{"url": "https://www.baaa-acro.com/crash/crash-bristol-170-freighter-31-near-thorhild-2-killed", "date": "Sep 17, 1955 at 0050 LT", "type": "Bristol 170 Freighter", "operator": "Pacific%20Western%20Airlines", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Edmonton – Yellowknife", "msn": "12831", "yom": 1947, "flight_number": null, "city": "Thorhild", "zone": "Alberta", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 0021LT the aircraft departed Edmonton for Yellowknife with a crew of two, four passengers and a cargo of freight. An IFR flight plan had been filed for the flight to be made at 5,000 feet over Blue Air Route No. 84. Clearance out of the Edmonton Control Area was given to the aircraft but VFR was to be maintained while in the area. About twenty-two minutes after take-off, the tower at Namao heard a distress message from the aircraft indicating that the starboard engine had failed and that the aircraft was returning to Edmonton at 3,000 feet. Two minutes later another distress message was picked up by Namao stating that the aircraft was returning to Edmonton. Two-way communication with the aircraft was not established and although Namao and Edmonton continued to call the aircraft for more than thirty minutes, nothing further was heard from it. Although hampered by darkness and poor weather conditions, an air and ground search was started almost immediately but without success, until shortly after first light when the wreckage was found in a farm field about ten miles north of Thorhild. The captain and one passenger had been killed and the copilot and three other passengers were seriously injured. The aircraft was destroyed.", "probable_cause": "For reasons not as yet determined, the starboard engine failed and as a result of being overloaded, the aircraft did not maintain altitude on one engine and struck the ground with the starboard wing tip. A further contributory factor was considered to be the failure of the copilot's vacuum-driven gyro instruments, without his knowledge. "}