{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-bowie-2-killed", "date": "Aug 15, 2014 at 1535 LT", "type": "Cessna 414 Chancellor", "operator": "Lawrence R. Liptack", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "La Porte - Bowie", "msn": "414-0519", "yom": 1974, "flight_number": null, "city": "Bowie", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1200, "captain_hours_type": 15, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4256, "circumstances": "The twin engine aircraft, owned by Lawrence R. Liptack, crashed in flames in an open field located northeast of Bowie, Texas. The pilot and owner, aged 51, was killed with his son aged 10. The multi-engine airplane was about 500 ft above ground level (agl) and on a left base landing approach when a witness saw the airplane suddenly point straight down, begin spinning, and make three complete rotations before impacting terrain in a partially nose-down attitude. The airplane came to rest upright, and was mostly consumed by an immediate post impact fire. A post accident examination of the wreckage revealed no evidence of preimpact mechanical malfunctions or failures that would have precluded normal operation. A pilot operating another pipeline patrol airplane in the vicinity reported frequent severe-to-extreme turbulence about 1,000-2,000 ft above ground level. Data from an on-board GPS unit indicated that, while on the base leg of the airport traffic pattern for landing, the accident airplane's airspeed decayed 10 knots below the manufacturer's recommended approach speed for turbulent conditions. An autopsy performed on the pilot found significant existing atherosclerotic disease (60 to 80 percent) and described evidence of an acute, premortem, nonocclusive thrombosis of the left anterior descending coronary artery. The medical examiner's conclusion stated it \"appears the decedent likely suffered an acute cardiac event while piloting his aircraft\" and \"died primarily due to hypertensive and atherosclerotic cardiovascular disease and that his multiple blunt force injuries likely contributed to his death.\" It is likely that the pilot was incapacitated due to the acute cardiac event and lost control of the airplane during the approach to land.", "probable_cause": "The pilot's incapacitation in flight as the result of a an acute cardiac event, which resulted in a loss of control and collision with terrain. "}