{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-e20-nelkan-6-killed", "date": "Nov 15, 2017 at 1309 LT", "type": "Let L-410", "operator": "KhabAvia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Khabarovsk - Chumikan - Nelkan", "msn": "15 30 10", "yom": 2015, "flight_number": "RNI463", "city": "Nelkan", "zone": "Khabarovsk Krai", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 12076, "captain_hours_type": 1243, "copilot_hours": 1220, "copilot_hours_type": 837, "aircraft_hours": 1693, "circumstances": "On 14.11.2017, Khabarovsk Airlines' representative submitted the flight request for L-410UVP-E20 RA-67047 A/C flight to Joint ATM System Khabarovsk regional unit; the flight (NI 463) was planned along the route Khabarovsk – Nikolayevsk-on-Amur – Nelkan. On 14.11.2017 at 22:00 (local time: on 15.11.2017 at 08:00) at Khabarovsk airport, the preflight preparation was started including the medical examination. While the preflight preparation was being performed, new information was received that Nikolayevsk-on-Amur airport was closed due to the RWY snow removal. In coordination with ATC of Nikolayevsk-on-Amur airport, it was decided to change the route as follows: Khabarovsk – Chyumican – Nelkan. Before coming onboard the crew passed all mandatory preflight procedures as required by the normative documentation. On 15.11.2017, before the departure, Khabarovsk Airlines' technicians provided the line maintenance check in accordance with the F-A Form (Maintenance Job Card #687). No findings in relation to the aircraft and/or systems' operation were reported. The total amount of fuel on board was 1250 kg. The flight crew obtained all the necessary weather information (actual and forecast) during of the preflight weather briefing. The actual weather and the weather forecast for the departure aerodrome, on route weather, the weather forecast for the destination and alternate aerodromes – all met the FAP-128 (Russian FAR) requirements stated in items 5.30 and 5.38, and did not preclude the PIC's decision for departure. There were 2 crew members, 5 passengers and 410 kg of cargo (personal luggage and mail) onboard. The A/C takeoff mass was 6368 kg and the A/C center of gravity was at 25.5% MAC, which was within the AFM limits for the flight. The takeoff from Khabarovsk airport was performed at 23:33. 50 minutes before the approach to Chyumikan aerodrome, the flight crew checked the remaining fuel and requested the Khabarovsk ATC controller for the route change (AFIL): after passing of the OGUMI waypoint to follow the B226 airway to Nelkan destination airport without a stop at Chyumikan. According the initial flight plan, the stop at Chyumikan was intended only for refueling. On 15.11.2017 at 01:47 the Khabarovsk ATC approved the AFIL. At 02:35 the crew contacted the Nelkan Tower controller and received the approach conditions and the actual weather at the landing site. During the approach, at the true height of about 100 m and IAS of about 100 knots, developing the aggressive right roll and losing its altitude, the aircraft left the descending glidepath, collided with the ground and was destroyed. The crew and 4 passengers were killed. A 3-and-half year old child was taken to hospital with serious injuries. Nobody was killed on ground and there was no on-ground damage. The accident area is mountainous, marshy, with broad-leaved and needle-leaved trees. In winter, the area is covered with snow which is about 50-100 cm deep. The accident place ASL elevation is 304 m, the magnetic dip is minus 15°.", "probable_cause": "The direct cause of the L410UVP-E20 RA-67047 A/C accident was the uncommanded inflight RH engine propeller blades setting to the angle of minus 1.8° which is significantly below the\r\nminimum inflight pitch angle (13.5°) with TCLs set to forward thrust. It caused the significant rolling and turning moments, the A/C loss of speed and controllability, and the subsequent with the ground collision. The propeller blades' setting to the negative angles was caused by the failures of two systems: the BETA Feedback system and the Pitch Lock system. As the Propeller Pitch Lock system components that are to be tested during the PITCH LOCK TEST most probably did not contribute to the system malfunction, then it is unlikely that the crews' deviation of the PITCH LOCK TEST procedure could have make any difference in the detection of the said system malfunction before the flight. The said situation had been classified as extremely improbable during the aircraft type certification, so, there was no required crew actions in AFM for such situations, and the respective crew training was not required."}