{"url": "https://www.baaa-acro.com/crash/crash-sncase-se161-languedoc-mt-mujer-muerta-21-killed", "date": "Dec 4, 1958 at 1715 LT", "type": "SNCASE SE.161 Languedoc", "operator": "Aviaco-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Vigo – Madrid", "msn": "28", "yom": 1946, "flight_number": null, "city": "Mt Mujer Muerta", "zone": "Castile and León", "country": "Spain", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 16, "pax_fatalities": 16, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off from Vigo airport at 1540 hours on a scheduled flight to Madrid, with a crew of 5 and 16 passengers on board. The flight was cleared IFR for cruising level 95. At 1605 the flight advised Madrid D. F. station that it had overflown Guinzo de Lirnia at 1600, in cloud, and estimated the Salamanca JW radio beacon at 1650. At 1654 the aircraft advised Madrid D. F. station that it had overflown Salamanca at 1650 at level 95 and estimated Madrid at 1730, also that its VHF equipment was out of order, and it was, therefore, requesting Barajas Tower to stand by on 3 023. 5 kc/s. At 1710 Madrid control cleared the aircraft to proceed directly to Barajas radio range, maintaining flight level 95. At 1715 Madrid control authorized the aircraft to switch over to 3 023. 5 kc /s and to establish contact with Barajas Tower on that frequency. This was the last communication with the aircraft. Between 1715 and 1720 the aircraft crashed and burst into flames on the peak of \"La Rodilla de la Mujer Muerta\" which is 1,999 metres, approximately 800m lower than flight level 95. All aboard were killed and the aircraft was destroyed.", "probable_cause": "The above leads to the conclusion that if the accident was due to meteorological factors, icing would have been the factor most directly responsible. It is assumed that during its flight through  innocuous stratiform clouds, the aircraft may have encountered a cumulus congestus where sudden severe icing occurred. The following may have taken place: \r\na) a sudden change in the aerodynamic characteristics of the aircraft may have caused stalling without giving the captain time to initiate recovery action,\r\nb) the aircraft may have lost height rapidly, down to a level where the downdrafts over the lee slope swept it into a lower zone of erratic turbulence that sent it out of control,\r\nc) when icing occurred, the captain may, in the belief he had already passed the mountain divide, have decided to fly below the freezing level which, as he knew, was to be found at about 2 200 metres. It is possible that in assumptions (a) and (b) turbulence within the cumuli may have been a contributing factor. Under severe icing conditions, the mechanical de-icing equipment is practically inoperative. About 40 minutes before the accident, the mountain divide was over- flown, also at level 95, by a scheduled Santiago-Madrid flight. This aircraft found nothing unusual to report, since light icing and turbulence are the normal accompaniments of winter weather in a low pressure area. This fact however, in no way precludes the possibility that shortly thereafter conditions of severe icing may have prevailed. "}