{"url": "https://www.baaa-acro.com/crash/crash-antonov-24b-nizhnevartovsk-24-killed", "date": "Oct 13, 1969 at 1727 LT", "type": "Antonov AN-24", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tyumen – Surgut – Nizhnevartovsk", "msn": "79901405", "yom": 1967, "flight_number": "SU227", "city": "Nizhnevartovsk", "zone": "Khantia-Mansia okrug", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 52, "pax_fatalities": 22, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2756, "circumstances": "The crew started the approach to Nizhnevartovsk Airport by night and marginal weather conditions. Due to erroneous calculations, the aircraft was not properly aligned on the approach path and the captain decided to make a go-around. Six minutes later, he initiated a second approach. On short final, ATC asked the pilot if he has the runway in sight. As the answer was positive, the crew was cleared to land. Less than a minute later, the airplane struck tree tops, stalled and crashed in flames in a wooded area located 1,092 meters short of runway threshold. 32 occupants were injured while 24 others were killed, among them the copilot and a flight attendant. ", "probable_cause": "It was determined that the propellers went inadvertently into reverse when the crew activated the engine de-icing system. It was later discovered during investigations that there was a conception error on this type of aircraft between the de-icing systems and the thrust reversal systems that could activate simultaneously. Nevertheless, when control was lost, the flaps were deployed in an angle of 17° instead of 38° as prescribed, which was considered as a contributing factor. "}