{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-2d3-doha-45-killed", "date": "Mar 14, 1979 at 2340 LT", "type": "Boeing 727-200", "operator": "Royal-Jordanian-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Amman - Doha - Muscat", "msn": "20886/1061", "yom": 1974, "flight_number": "RJ600", "city": "Doha-Old Airport", "zone": "All Qatar", "country": "Qatar", "region": "Asia", "crew_on_board": 15, "crew_fatalities": 4, "pax_on_board": 49, "pax_fatalities": 41, "other_fatalities": 0, "total_fatalities": 45, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Flight Royal Jordanian 600 departed Amman for a flight to Doha and Muscat. With the first officer as the handling pilot the aircraft, called \"The City of Petra\", left Amman at 21:55. Contact was established with Doha at 23:08 at a range of 45 miles when weather information was received, which included: wind 090° at 17 knots, visibility 10 km in thunderstorms, 1/8 CS at 2500 feet, 3/8 at 3000 feet, and QNH 1008. The controller added that the thunderstorm appeared to be building up over and to the north west of the airfield. The pilot requested runway 16 and was cleared for a visual approach to that runway or for a NDB/VOR approach if visual contact with the airfield was not established. The aircraft reported approaching the overhead position for a NDB/VOR procedure at 23:17. On the airfield rain was falling quite heavily and the controller informed the aircraft of this. The NDB then tripped, presumably as a result of a lightning strike but was back in the air again at 23:22. At 23:25 the aircraft reported procedure turn complete and was cleared to land. At 23:29 the aircraft reported that it had not seen the runway, and initiated a missed approach, requesting and receiving clearance to make an ILS approach to runway 34. At 23:30 a wind was reported 290°/14 knots in heavy rain. At 23:35 the aircraft reported procedure turn complete and field in sight. Landing clearance was given with a wind of 180°/06 kt. During the next 2 minutes of the final approach the controller reported winds of 150° at 13 kt, 150° at 15 kt, and 140° at 17 knots. Because of the increasing tail wind component and difficulties in maintaining the glide slope the crew decided before reaching decision height, that a missed approach was necessary and this was initiated at 23:37:19 at a height of about 300 feet agl. The pilot then requested clearance to Dhahran and the controller cleared the aircraft to climb straight ahead to FL 80. Go around power was applied and 25° flaps was selected, the undercarriage was raised. The aircraft climbed to 750 feet with the indicated airspeed falling to approximately 140 knots. The aircraft then began to descend at an increasing rate until it struck the ground with a vertical speed of 4200 ft/min., with the IAS increasing rapidly to approximately 170 kt in the last 5 seconds. The aircraft struck the left hand edge of the runway, 2050 m from the threshold with the nose approximately 10° above the horizon and with the left wing 5° down. The aircraft bounced off the first impact and turning left, rolled to the right to an inverted position and then slid, tail first, into the Fire Station garage some 800 m from the first impact point and 270 m from the runway edge. The fuselage broke into three main sections during the process. Four crew members and  41 passengers were killed while 19 other occupants were injured. ", "probable_cause": "The aircraft's encounter with a downburst associated with a thunderstorm, the effects of which exceeded the performance capability of the aircraft. The encounter resulted from the flight crew's decision to conduct an approach to land without due regard to the prevailing weather conditions."}