{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3c-new-york-la-guardia-3-killed", "date": "Aug 8, 1947 at 1849 LT", "type": "Douglas DC-3", "operator": "American-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Rochester", "msn": "19639", "yom": 1944, "flight_number": null, "city": "New York-LaGuardia", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4934, "captain_hours_type": 2000, "copilot_hours": 4760, "copilot_hours_type": 1500, "aircraft_hours": 2035, "circumstances": "The aircraft took off on runway 13 of La Guardia Airport at 1843LT, having been cleared on an instrument flight plan to Rochester, New York, with Toronto, Ontario, as an alternate. Approximately 2 minutes after take-off the flight called La Guardia Tower and reported that it was in the vicinity of the south end of Whitestone Bridge, approximately 2 1/2 miles northeast of La Guardia Airport. The flight advised that the oil pressure was low on one engine, and requested clearance to land on runway 22. The request was approved, and the tower informed the crew that the wind was calm. When asked if emergency equipment was desired to stand by, the flight replied in the negative. Shortly thereafter, NX88787 reported that it was on the final approach, and that it was over the sand barges, located approximately one-half mile off the approach end of runway 22. In reply the flight was again given clearance to land. The aircraft was first seen at an altitude of approximately 800 feet, and about 1,300 feet off the approach end of runway 22 with the landing gear extended. The flaps were lowered, and the aircraft started a steep descent to runway 22,but it passed over the approach end of the runway at an altitude of approximately 300 feet. The flight then requested and was granted permission by the tower to make a right turn, however, the aircraft continued straight ahead over the runway, gradually losing altitude. When one-third of the way down the runway, the right propeller was feathered. When over the intersection of runways 22 and 18 and at an altitude of 200 feet the flaps were raised, which resulted in an additional loss of altitude. During or directly after raising the flaps, a right turn was initiated, and the landing gear was observed to retract slowly. Competent witnesses stated that the right turn was made at a very slow speed, at a high angle of attack, and at an altitude appearing never to have exceeded 200 feet. Over Bowery Bay the aircraft on two occasions almost settled into the water. When in a flat right turn toward runway 13 it lost altitude to about 50 feet. Approximately 2,000 feet from the end of the runway, the landing gear started to extend, and became fully extended when the aircraft was aligned with runway 13. At this time the airplane attitude appeared to be that of a steep climb. The wings were seen to wobble slightly, then the left wing and nose dropped, and the airplane struck the water at an angle of approximately 20 degrees. The forward movement of the aircraft continued on the surface of the water for 40 to 50 feet, throwing up a great spray as the tail rose to a vertical position, after which the aircraft continued over on its back and sank in about 5 minutes.", "probable_cause": "The Board determines that the probable cause of this accident was that, following an attempted landing, a miss-approach procedure was attempted for a second landing without sufficient air speed for single engine operation.\r\nThe following factors were considered as contributory:\r\n- The oil screen cover plate gasket on the right engine was either fractured when installed immediately prior to the flight of August 8, 1947, or failed during the initial part of that flight,\r\n- As a result of the fractured oil screen cover plate gasket, oil pressure for the right engine dropped below normal, and the crew feathered the right propeller,\r\n- Insufficient air speed was maintained in a landing approach to runway 13 at the La Guardia Airport, after an attempted landing and \"go around\" had been made on runway 22, and as a result the airplane stalled and crashed into Bowery Bay."}