{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-noviny-pod-ralskem-2-killed", "date": "Sep 26, 2017 at 0736 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Valnetis Air", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Příbram – Gdansk", "msn": "421B-0931", "yom": 1975, "flight_number": null, "city": "Noviny pod Ralskem", "zone": "Liberec Region (Liberecký kraj)", "country": "Czech Republic", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 675, "captain_hours_type": 47, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6381, "circumstances": "The twin engine airplane departed Příbram Airport Runway 06 at 0705LT on a charter flight to Gdansk, carrying one passenger and one pilot. About 30 minutes into the flight, while cruising at an altitude of 14,100 feet, the pilot was cleared to climb to FL180 when he declared an emergency and reported the failure of both engines. The aircraft entered an uncontrolled descent and crashed in a wooded area located 1,5 km northeast of Noviny pod Ralskem, bursting into flames. The aircraft was destroyed by impact forces and a post crash fire and both occupants were killed. ", "probable_cause": "The cause of the accident was an inner mechanical defect in the left engine past its stipulated TSO. The defect caused a forced stall of the engine. For this reason, the propeller on this engine could not be feathered. During the shutdown of the right engine, the feathering of the propeller on this engine did not take place. The aircraft entered to the fall and a stall-spin in which it fell to the ground.\r\nContributing factors:\r\n- The left engine TSO was over the stipulated limit of 12 years. (The last general overhaul was performed on 29 October 2001.),\r\n- Limited experience of the pilot on this type of aircraft."}