{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-scappoose-2-killed", "date": "Oct 18, 2003 at 1413 LT", "type": "Cessna 340", "operator": "James T. Gillespie", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Red Bluff – Scappoose", "msn": "340A-0507", "yom": 1978, "flight_number": null, "city": "Scappoose", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3850, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4041, "circumstances": "Witnesses first observed the aircraft on final approach for landing, with the engine(s) making a backfiring sound. While the aircraft was on short final, another aircraft pulled onto the runway and initiated its takeoff roll. The accident aircraft was observed to initiate a go-around, but did not appear to be gaining altitude and was at what the witnesses thought was a slow airspeed. About mid-field, the accident aircraft made an approximate 45 degree turn from runway heading. Within 1/4 mile from the runway, the aircraft lost altitude. The witness stated that the aircraft was about 80 feet agl when the aircraft stalled, rolled inverted (left wing down) and collided with the flat open terrain in a nose low attitude. A post-crash fire subsequently consumed the wreckage. During the post-crash inspection of the engines, it was found that both engines displayed signs of operating at a lean mixture setting. The left engine pistons and spark plugs displayed a more serious lean condition than the right side and displayed the early signs of detonation on the piston heads. No other mechanical failure or malfunction was noted to either the engines or airframe.", "probable_cause": "The pilot's failure to maintain airspeed while maneuvering. An inadvertent stall, the pilot's failure to follow engine operation procedures and engine detonation were factors."}