{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-i-bluefield-5-killed", "date": "Jan 21, 1981 at 0844 LT", "type": "Cessna 500 Citation", "operator": "Georgia-Pacific", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Augusta - Bluefield - Frederick", "msn": "500-0026", "yom": 1972, "flight_number": null, "city": "Bluefield-Mercer County", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 10463, "captain_hours_type": 3642, "copilot_hours": 4748, "copilot_hours_type": 1216, "aircraft_hours": 4439, "circumstances": "The airplane overran the end of runway 23, following an instrument landing system (ILS) approach, crashed, and burned at the Mercer County Airport, Bluefield, West Virginia. The aircraft touched down between 500 and 2,000 feet on the runway which was covered with wet snow, and it did not decelerate normally. About 1,200 feet from the departure end of the runway, the pilot added engine thrust and rotated the aircraft for liftoff; however, it did not get airborne because of insufficient flying speed. The aircraft overran the end of the runway and struck three localizer antennas and a 10-foot embankment before it plunged down a steep, densely wooded hillside. The five occupants were killed, and the aircraft was destroyed by impact forces and postcrash fire. ", "probable_cause": "The probable cause of the accident was the pilot's attempt to land on a slush covered runway with insufficient stopping distance available, and his delayed initiation of a go-around which resulted in there being insufficient runway available to complete the maneuver successfully. Contributing to the accident was the lack of adequate emphasis in the manufacturer's aircraft flight manual regarding the required aircraft landing/stop distances under wet and icy runway conditions. "}