{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-sioux-lookout-5-killed", "date": "May 1, 1995 at 1330 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Air Sandy", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Sioux Lookout - Red Lake", "msn": "31-7652168", "yom": 1976, "flight_number": "SNY3101", "city": "Sioux Lookout", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 1250, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6784, "circumstances": "Bearskin flight 362, a Fairchild Swearingen Metro 23, departed Red Lake, Ontario, at 1300 central daylight saving time (CDT), with two pilots and one passenger on board, en route to Sioux Lookout on an instrument flight rules (IFR) flight plan. At approximately 30 nautical miles (nm) north of Sioux Lookout, the flight was cleared by the Winnipeg area control centre (ACC) for an approach to the Sioux Lookout airport. Air Sandy flight 3101, a Piper Navajo PA-31, departed Sioux Lookout at 1323 with one pilot and four passengers on board en route to Red Lake on a visual flight rules (VFR) flight. The pilot of Air Sandy 3101 reported clear of the Sioux Lookout control zone at 1326. No other communication was heard from the Air Sandy flight. At 1315 the Winnipeg ACC controller advised the Sioux Lookout Flight Service specialist that Bearskin 362 was inbound from Red Lake, estimating Sioux Lookout at 1332. At 1327, Bearskin 362 called Sioux Lookout Flight Service Station (FSS) and advised them they had been cleared for an approach and that they were cancelling IFR at 14 nm from the airport. At 1328, as Sioux Lookout FSS was giving an airport advisory to Bearskin 362, the specialist heard an emergency locator transmitter (ELT) emit a signal on the emergency frequencies. Moments later, the pilot of Bearskin 305, a Beechcraft B-99 in the vicinity of Sioux Lookout, advised the specialist that he had just seen a bright flare in the sky and that he was going to investigate. The pilot of Bearskin 305 stated that the flare had fallen to the ground and a fire was burning in a wooded area. A communications search was initiated to locate Bearskin 362, but the aircraft did not respond. A Search and Rescue aircraft from Trenton, Ontario, and an Ontario Ministry of Natural Resources (MNR) helicopter were dispatched to the site. The source of the fire was confirmed to be the Air Sandy aircraft. The MNR helicopter noticed debris and a fuel slick on a nearby lake, Lac Seul. It was later confirmed that Bearskin 362 had crashed into the lake. (See Appendix A.) The two aircraft collided in mid-air at 1328 during the hours of daylight at latitude 50º14'N and longitude 92º07'W, in visual meteorological conditions (VMC). All three persons on board the Bearskin aircraft and all five persons on board the Air Sandy aircraft were fatally injured.", "probable_cause": "Neither flight crew saw the other aircraft in time to avoid the collision. Contributing to the occurrence were the inherent limitations of the see-and-avoid concept which preclude the effective separation of aircraft with high closure rates, the fact that neither crew was directly alerted to the presence of the other aircraft by the Flight Service specialist or by onboard electronic equipment, and an apparent lack of pilot understanding of how to optimize avoidance manoeuvring. "}