{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-62-paramaribo-176-killed", "date": "Jun 7, 1989 at 0427 LT", "type": "Douglas DC-8", "operator": "Surinam-Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Amsterdam - Paramaribo", "msn": "46107", "yom": 1969, "flight_number": "PY764", "city": "Paramaribo-Zanderij", "zone": "Para", "country": "Suriname", "region": "South America", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 178, "pax_fatalities": 167, "other_fatalities": 0, "total_fatalities": 176, "captain_hours": 19450, "captain_hours_type": 8800, "copilot_hours": 6600, "copilot_hours_type": null, "aircraft_hours": 52706, "circumstances": "Surinam Airways (SLM) carried out regular flights between Amsterdam-Schiphol Airport (AMS) and Paramaribo (PBM) using McDonnell Douglas DC-8-60 planes. One of these was a US-registered plane, N1809E, named \"Anthony Nesty\". The air crew was furnished by Air Crew International (ACI). The contract between Surinam Airways and ACI stipulated that ACI would furnish SLM with qualified crew members who held FAA certificates and who met the regulatory requirements to fly the DC-8. ACI did not provide for proficiency checks but left it to the individual pilots to meet the training and other requirements of their profession. One of the captains provided by ACI was involved in several incidents while operating on SLM flights. After investigation, SLM instructed ACI not to use this captain in future SLM assignments. However, he still acted as a crew member on several flights since. The captain was again scheduled on the accident flight PY764. According to regulations, the captain was not even qualified to act as pilot-in-command of that flight because of his age. He was 66 years old and Surinam regulations stipulated that \"the holder of a pilot certificate is not authorized to act as pilot during commercial flights when he/she has reached age 60\". Also, his most recent proficiency check flight was on a GA-7 Cougar twin instead of a DC-8. Flight 764 departed Amsterdam-Schiphol Airport at 23:25 (June 6) on a flight to Paramaribo (PBM). The en route part of the flight was uneventful and about 20 minutes before arrival in Paramaribo the crew received the 07:00 UTC weather for Zanderij Airport: Wind calm, visibility 900 m in fog, temperature/dewpoint 22°C/22°C. This caught the crew by surprise since the previous weather information had included a visibility of 6 km. Because the ILS was not to be used for operational purposes, the copilot said: \"We don't legally have an ILS ... we have to use it\". The captain responded affirmatively. The crew were confident that they could land because they assumed that the fog was localized given the fact that they were able to see the airport during the descent. Zanderij Tower then cleared the flight for a VOR/DME approach to runway 10. The captain tuned in to the ILS and instructed the first officer to set the final approach course for the published VOR/DME approach on the first officer's side. During the approach the first officer reported that he could see the airport:\"Runway's at twelve o'clock\". A minute later he commented \"A little bit of low fog comin' up I reckon just a little bit\". He was still able to see the runway and reported the runway in sight. The DC-8 then entered some stratus clouds the captain told the first officer to \"Tell him [tower controller] to turn the runway lights up ... Tell him to put the runway lights bright\". The captain attempted to capture the unreliable ILS glide slope signal, but failed to capture it. The Ground Proximity Warning System (GPWS) sounded several times: \"Glideslope ... glideslope...\" until it was deactivated. The captain was flying the aircraft below the minimum altitude for the ILS/DME approach procedure (260 ft asl) as well as below the minimum descent altitude for the VOR/DME approach procedure (560 ft). The first officer called out: \"Two hundred feet\". Thirteen seconds later the no. 2 engine contacted a tree. The right wing then struck another tree, causing the aircraft to roll, striking the ground inverted. The airplane broke up and a fire erupted.", "probable_cause": "The Commission determines: \r\na) That as a result of the captain's glaring carelessness and recklessness the aircraft was flown below the published minimum altitudes during the approach and consequently collided with a tree.\r\nb) As underlying factor in the accident was the failure of SLM's operational management to observe the pertinent regulations as well as the procedures prescribed in the SLM Operations Manual concerning qualification and certification during recruitment and employment of the crew members furnished by ACI."}