{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-bacau", "date": "Jan 8, 1994 at 0937 LT", "type": "Beechcraft 100 King Air", "operator": "Travair", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Oradea – Iaşi", "msn": "B-188", "yom": 1974, "flight_number": null, "city": "Bacău", "zone": "Bacău", "country": "Romania", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off Oradea Airport at 0805LT with destination Iași Airport, having as alterne airport Bacău Airport. At 08.53 hrs, due to bad meteorological conditions on Iași Airport the crew requested to Bacău ACC permission for landing on Bacău Airport. Bacău ACC has granted permission and informed the crew about the meteorological conditions in that moment at Bacău Airport. The crew confirmed. During the aircraft was performing the approach procedure, the crew was instructed to contact the precision radar (PAR) and was informed that at that moment the visibility range was 800 metres. At the first approach PAR sent to the crew all the appropriate data for the radar assistance and in the final stage has asked the crew to perform a missed landing, go up to 900 metres and to contact Bacău TWR because the aircraft was away from the runway centerline (approx. 60 metres left). On Bacău TWR frequency the crew received the indication to perform a right turn to intercept the QDM 342 degrees at Bacău. It was also stated that the runway beacon is running. The crew was instructed, also, to contact PAR which assisted the aircraft, with the necessary corrections, during the approach procedure and landing until the crew reported the accident at 0930LT.", "probable_cause": "Further the analysis of the flight recordings between the aircraft and the Romanian Air Traffic Services, statements and all other data contained by the investigation file the following conclusions have been reached:\r\n- The meteorological conditions at Iași Airport were difficult and have not permitted the landing of the aircraft,\r\n- The decision for landing on Bacău Airport was made by the crew,\r\n- At the moment the meteorological conditions at Bacău Airport assured the minimum conditions for landing the aircraft,\r\n- The air traffic control was performed by Bacău TWR and PAR, according to international regulations, providing permanent information regarding the aircraft during the final approach for landing.\r\nWe mention that after the first missed landing the crew maintained its decision to perform a second approach for landing, knowing the meteorological conditions on Bacău Airport."}