{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690a-taos-1-killed", "date": "Mar 29, 1992 at 1900 LT", "type": "Rockwell Grand Commander 690", "operator": "Legal Air Flight Services", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Taos - Tulsa", "msn": "690-11163", "yom": 1974, "flight_number": null, "city": "Taos", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2200, "captain_hours_type": 120, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3404, "circumstances": "The airplane impacted slightly rising terrain in a 15° left bank, slight nose up attitude while descending shortly after takeoff in dark night IMC. There were rain and snow showers in the area and it was devoid of visible ground reference lights. The difference between the takeoff heading and the impact heading was 75° and the airplane had traveled 3,987 feet from the departure end of the runway at initial impact. The wreckage subsequently traveled an additional 837 feet through the brush. The pilot stated that the takeoff was normal in all aspects and all of the airplane systems were operating normally. He stated that the last thing he remembered was passing through 8,500 feet with a rate of climb of 1,500 feet per minute. The airport elevation was 7,091 feet. He did not recall the radio altimeter alert or the warning light activating. No evidence of pre-impact failure or malfunction was found during the investigation. Rescue of the occupants were delayed due to the weather, darkness, and spurious elt signals masked by the wreckage.", "probable_cause": "The pilot in command's failure to maintain the climb after departing the runway environment. Factors were the weather conditions and the dark night."}