{"url": "https://www.baaa-acro.com/crash/crash-avro-rj85-la-ceja-71-killed", "date": "Nov 28, 2016 at 2158 LT", "type": "Avro RJ85", "operator": "LAMIA-Bolivia", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Santa Cruz - Medellín", "msn": "E.2348", "yom": 1999, "flight_number": "LMI2933", "city": "La Ceja", "zone": "Antioquia", "country": "Colombia", "region": "South America", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 73, "pax_fatalities": 68, "other_fatalities": 0, "total_fatalities": 71, "captain_hours": 6692, "captain_hours_type": 3417, "copilot_hours": 6923, "copilot_hours_type": 1474, "aircraft_hours": 21640, "circumstances": "The aircraft was performing a charter flight from Santa Cruz-Viru Viru to Medellín-José María Córdova (Rionegro) Airport, carrying members of the Chapecoense Real soccer team from Brazil who were traveling to Medellín to play against Atletico Nacional for a Copa Sudamericana game. The descent to Medellín was started by night and in good weather conditions when it seems that the encountered electrical problem. At 2156LT, while descending to FL155, the four engine aircraft  hit tree tops and crashed in a wooded area located on the slope of a mountain located in the Cerro Gordo, near the city of La Ceja, about 17 km south from runway 01 threshold. The aircraft was totally destroyed upon impact but there was no fire. Six (two crew member and four passengers) were injured and evacuated while 71 other occupants were killed. According to first investigations, the crew encountered electrical problems and the aircraft may have suffered a fuel exhaustion. Due to the combination of several factors and findings that were detected during initial investigations, it was determined that the primary cause of the accident may have been a fuel exhaustion. The board of investigation was then in a process to determine the exact circumstances of the occurrence and to understand the course of events and the exact behavior and flight supervision (instruments, fuel jauges, flight preparation, operations, permission, ground assistance) on part of the flight crew and the operator. On December 2, the Civil Aviation Authority of Bolivia revoked with immediate effect the Air Operator Certificate of LAMIA. All flights have been suspended since. ", "probable_cause": "It was determined that the accident was the consequence of an inappropriate planning and execution of the flight, since the amount of fuel required to fly from the airport of destination to an alternate airport was not considered, nor was the amount of reserve fuel, nor the contingency fuel, nor the minimum landing fuel, quantities of fuel required by aeronautical regulations for the execution of the type of international flight that the aircraft CP-2339 was performing. The following factors were considered as contributing: \r\n- Loss of situational awareness,\r\n– Premature configuration of the aircraft for landing, \r\n– Latent deficiencies,\r\n– Lack of operational supervision and control of part of Operator,\r\n– Organizational and operational deviation on the part of the Operator (non compliant to standard procedures)."}