{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-aleknagik-1-killed", "date": "Aug 28, 2002 at 1600 LT", "type": "De Havilland DHC-2 Beaver", "operator": "General Communications Inc.", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Dillingham - Lake Nerka", "msn": "1653", "yom": 1966, "flight_number": null, "city": "Aleknagik", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 26300, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8847, "circumstances": "The amphibious float-equipped airplane was returning to a lodge located on a remote lake after picking up supplies. The airplane departed from a paved runway on an airport. En route to the destination lake, the pilot noted the airplane would not attain its normal cruise airspeed and attitude. Believing the airplane was tail heavy, the pilot asked the aft cabin passenger to move forward. Upon touchdown on the lake, the airplane nosed down into the water. As the airplane nosed down, the supplies, which were not secured in the aft cabin, came forward, and pinned the pilot and front seat passenger against the instrument panel. The passenger in the aft cabin lifted as many of the supplies off the pilot and front seat passenger as he could, before he had to exit the sinking airplane. Both the pilot and front seat passenger exited the submerged airplane under their own power, but the pilot did not reach the surface. An autopsy of the pilot disclosed that he had drowned. A postaccident inspection of the airplane revealed the wheels had not been retracted after takeoff on the runway, consequently the airplane landed on the lake with the wheels fully extended. The front seat passenger said that the pilot did not use a checklist prior to landing.", "probable_cause": "The pilot's failure to use a checklist to ensure the airplane was in the proper landing configuration, which precipitated an inadvertent water landing on amphibious floats with the wheels extended. A factor contributing to the accident was the pilot's failure to secure the cargo in the aft cabin."}