{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-santo-domingo-2-killed", "date": "Jun 4, 1957 at 0420 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Aerotaxi-Servicios-Aereos", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Puerto Berrío – Medellín", "msn": "744", "yom": 1954, "flight_number": null, "city": "Santo Domingo", "zone": "Antioquia", "country": "Colombia", "region": "South America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft landed at Puerto Berrío at 0346LT and took off again for Medellín at 0355LT. It carried a pilot and eight passengers. When it had covered half of the route and while at the highest point along the route, about 8 km from Santo Domingo, the aircraft crashed, at approximately 0420LT, into one of the hills. One passenger was killed instantly, another died later at Medellín, and the others suffered minor injuries. ", "probable_cause": "After careful study of the present investigation referring to the accident involving aircraft HK-181 owned by Aerotaxi Servicios Aéreos on the territory of the municipality of Santo Domingo ( Antioquia) which occurred on 4 June 1957, it is found that the cause of the accident was pilot error. This error consisted in the pilot's having flown too low under poor weather conditions and in his having engaged his aircraft in a canyon with no outlet. He was thus forced to make an emergency landing on unsuitable terrain. Unfavourable weather conditions being an extenuating circumstance, Civil Aeronautics rules that the pilot is to pay a penalty fine of five hundred pesos ($500.00) into the National Treasury in view of his responsibility for this accident which resulted in two deaths, and in the destruction of the aircraft. Aerotaxi Servicios Aéreos shall submit the pilot to severe checking before allowing him to fly again as a taxi pilot. "}