{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46d-15-cu-commando-chicago", "date": "Jan 4, 1951 at 0228 LT", "type": "Curtiss C-46 Commando", "operator": "Monarch Air Service", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago – Newark", "msn": "33564", "yom": 1945, "flight_number": "MAS1090", "city": "Chicago-Midway", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 45, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 18000, "captain_hours_type": 2170, "copilot_hours": 3700, "copilot_hours_type": 300, "aircraft_hours": 1257, "circumstances": "Monarch's Flight 1090 was cleared by Air Route Traffic Control (ARTC) to proceed on an instrument flight plan at 9,000 feet, nonstop Chicago to Newark, New Jersey. The crew consisted of Captain Marvin C. Staddon, Copilot Arthur J. Howarth, and Stewardess Thelma Dennis. Total aircraft weight at the time of take-off was approximately 46,100 pounds, 1,100 pounds in excess of the authorized gross weight. According to the crew the disposable load was so distributed as to be within the certificated limits with respect to the center of gravity. Prior to being cleared for take-off, preflight checks were accomplished in accordance with company operating procedures. All items checked satisfactorily, and the captain started his take-off at 0227 on Runway 31. He advanced the throttles to approximately 45 inches manifold pressure and 2700 RPM. The copilot then continued to advance the throttles to a manifold pressure of 47 inches, tightened the friction locks and guarded the throttles with his left hand to prevent creepage. The aircraft became airborne approximately half-way down the runway, which is 5,730 feet in length According to the copilot, manifold pressure and RPM's remained constant, and engine performance was normal. At the captain's command to raise the landing gear, the copilot moved the handle into the retract position and noticed at this time that the aircraft, now airborne, was turning slightly to the left and the air speed indicator read approximately 85 miles per hour. With the left wing down and with but a few feet of altitude, the copilot, realizing an emergency existed, immediately applied emergency take-off power--55 inches manifold pressure However, the C-46, still turning, struck several small aircraft parked on the west side of the airport, and continued beyond the airport boundary, striking a fence and railroad embankment Both throttles were then closed by the captain, but the electrical system switches were not turned off. The aircraft came to rest beyond the embankment and about one-half mile west of the airport's west boundary on a heading of approximately 250 degrees. A fire developed immediately, but all passengers and crew were evacuated before it assumed major proportions. The aircraft was destroyed. The maximum indicated air speed attained in flight, approximately 100 MPH, was noticed by the captain shortly after the landing gear was retracted. The maximum altitude attained was estimated as 25 feet.", "probable_cause": "The Board determines that the probable cause of this accident was loss of control of the aircraft due to faulty piloting technique and overloading of the aircraft. The following findings were pointed out:\r\n- The copilot was not properly certificated in that he had not accomplished the required six-month's equipment check in this type equipment,\r\n- The aircraft was loaded approximately 1,100 pounds in excess of its authorized take-off weight,\r\n- Take-off was made using less than the recommended power,\r\n- The aircraft became airborne at an indicated air speed of 85 miles per hour, or less, and before a safe flying speed had been attained."}