{"url": "https://www.baaa-acro.com/crash/crash-fokker-50-luxembourg-20-killed", "date": "Nov 6, 2002 at 1006 LT", "type": "Fokker 50", "operator": "Luxair-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Berlin – Luxembourg", "msn": "20221", "yom": 1991, "flight_number": "LG9642", "city": "Luxembourg-Findel", "zone": "All Luxembourg", "country": "Luxembourg", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 19, "pax_fatalities": 18, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": 4242, "captain_hours_type": 2864, "copilot_hours": 1156, "copilot_hours_type": 443, "aircraft_hours": 21836, "circumstances": "The Fokker 27 Mk050 registered LX-LGB and operated by Luxair left Berlin on 6 November 2002 at 07h 40min on flight LG 9642/LH 2420 with destination Luxembourg. Cruising level was at FL180. At 08h 50min, Frankfurt Control asked the crew to stop descent at FL 90, direct to Diekirch and at 08h 52min the flight was transferred to Luxembourg Approach. They were instructed to enter the Diekirch hold at FL90, to expect later on vectors for an ILS 24 and were given the latest RVR readings. At 08h 59min, well before reaching the Diekirch hold, the aircraft was recleared to 3000ft QNH and to turn left heading one three zero. At this time the aircraft flew in the clear sky above a fog layer. RVR was two hundred seventy five meters. The crew evoked a go-around if the RVR was not three hundred meters whilst passing ELU (it’s minima for a category II approach). At 09h04 min 36s, the aircraft passed overhead ELU maintaining 3000ft QNH. At 09h04 min 57s, the ATC controller transmitted an RVR of three hundred meters. Power was further reduced, flaps 10 were selected and the landing gear was lowered. Immediately after the landing gear was lowered, the pitch angle of the two propellers simultaneously reached a value that is lower than the minimum values for flight. This propeller pitch setting involves a rapid decrease of speed and altitude. During the following seconds, the left engine stopped and then the right engine stopped. The flight data recorders, no longer powered ceased functioning. At 09h05 min 42s (radar time base), the aircraft disappeared from the radar screen. It was immediately found in a field seven hundred meters to the north of runway centreline 24 and three point five kilometres to the east of the threshold. Six people were critically injured while 16 others were killed. Within the following hours, four of the survivors died from their injuries. The only two survivors were a passenger, a French citizen, and the captain. ", "probable_cause": "The initial cause of the accident is the crew’s acceptance of the approach clearance although they were not prepared to it, namely the absence of preparation of a go-around. It led the crew to perform a series of improvised actions that ended in the prohibited override of the primary stop on the power levers and leading to an irreversible loss of control.\r\nContributory factors can be listed as follows:\r\n1. A lack of preparation for the landing, initiated by unnecessary occupations resulting from an obtained RVR value, which was below their company approved minima, created a disorganisation in the cockpit, leading to uncoordinated actions by each crewmember.\r\n2. Some procedures as laid down in the operations manual were not followed at some stage of the approach. All this did not directly cause the accident, but created an environment whereby individual actions were initiated to make a landing possible.\r\n3. Routine and the will to arrive at destination may have put the crew in a psychological state of mind, which could have been the origin of the deviations from standard procedures as noticed. \r\n4. The priority in the approach sequence given to the crew by ATC, which facilitated the traffic handling for the controller who was not aware of the operational consequences.\r\n5. The low reliability of the installed secondary stop safety device that was favoured by the non-application of service bulletin ABSC SB Fo50-32-4. Also the mode of distribution of the safety information (Fokker Aircraft B.V. – Service letter 137) to the operator as well as the operator’s internal distribution to the crews, that did not guarantee that the crews were aware of the potential loss of secondary stop on propeller pitch control.\r\n6. Latent shortcomings in the Authority and the organisational structure of the operator, in combination with poor application of SOPs by the crew. "}