{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-supervan-900-pacific-ocean-1-killed", "date": "Sep 27, 2018 at 1528 LT", "type": "Cessna 208B Grand Caravan", "operator": "CGG", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Saipan - Sapporo", "msn": "208B-0884", "yom": 2001, "flight_number": null, "city": "Pacific Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 13600, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9291, "circumstances": "The pilot of a Cessna 208B aircraft, registered VH-FAY (FAY), was contracted to ferry the aircraft from Jandakot Airport, Western Australia (WA), to Greenwood, Mississippi in the United States (US). The pilot planned to fly via the ‘North Pacific Route’. At 0146 Coordinated Universal Time (UTC) on 15 September 2018, the aircraft took off from Jandakot Airport, WA, and landed in Alice Springs, Northern Territory at 0743. After landing, the pilot advised the aircraft operator that the aircraft had a standby alternator fault indication. In response, two company licenced aircraft maintenance engineers went to Alice Springs and changed the alternator control unit, which fixed the problem. Late the next morning, the aircraft departed Alice Springs for Weipa, Queensland, where the pilot refuelled the aircraft and stayed overnight. On the morning of 17 September, the pilot conducted a 1-hour flight to Horn Island, Queensland. About an hour later, the aircraft departed Horn Island with the planned destination of Guam, Micronesia. While en route, the pilot sent a message to the aircraft operator advising that he would not land in Guam, but would continue another 218 km (118 NM) to Saipan, Northern Mariana Islands. At 1003, the aircraft landed at Saipan International Airport. The next morning, the pilot refuelled the aircraft and detected damage to the propeller anti-ice boot. The aircraft was delayed for more than a week while a company engineer travelled to Saipan and replaced the anti-ice boot. At 2300 UTC on 26 September, the aircraft departed Saipan, bound for New Chitose Airport, Hokkaido, Japan. Once airborne, the pilot sent a message from his Garmin device, indicating that the weather was clear and that he had an expected flight time of 9.5 hours. About an hour after departure, the aircraft levelled out at flight level (FL) 220. Once in the cruise, the pilot sent a message that he was at 22,000 feet, had a tailwind and the weather was clear. This was followed by a message at 0010 that he was at FL 220, with a true airspeed of 167 kt and fuel flow of 288 lb/hr (163 L/hr). At 0121, while overhead reporting point TEGOD, the pilot contacted Tokyo Radio flight information service on HF radio. The pilot was next due to report when the aircraft reached reporting point SAGOP, which the pilot estimated would occur at 0244. GPS recorded track showed that the aircraft passed SAGOP at 0241, but the pilot did not contact Tokyo Radio as expected. At 0249, Tokyo Radio made several attempts to communicate with the pilot on two different HF frequencies, but did not receive a response. Tokyo Radio made further attempts to contact the pilot between 0249 and 0251, and at 0341, 0351 and 0405. About 4.5 hours after the pilot’s last communication, two Japan Air Self-Defense Force (JASDF) aircraft intercepted FAY. The pilot did not respond to the intercept in accordance with international intercept protocols, either by rocking the aircraft wings or turning, and the aircraft continued to track at FL 220 on its planned flight route. The JASDF pilots were unable to see into the cockpit to determine whether the pilot was in his seat or whether there was any indication that he was incapacitated. The JASDF pilots flew around FAY for about 30 minutes, until the aircraft descended into cloud. At 0626 UTC, the aircraft’s GPS tracker stopped reporting, with the last recorded position at FL 220, about 100 km off the Japanese coast and 589 km (318 NM) short of the destination airport. Radar data showed that the aircraft descended rapidly from this point and collided with water approximately 2 minutes later. The Japanese authorities launched a search and rescue mission and, within 2 hours, searchers found the aircraft’s rear passenger door. The search continued until the next day, when a typhoon passed through the area and the search was suspended for two days. After resuming, the search continued until 27 October with no further parts of the aircraft found. The pilot was not located. ", "probable_cause": "From the evidence available, the following findings are made with respect to the uncontrolled flight into water involving a Cessna Aircraft Company 208B, registered VH-FAY, that occurred 260 km north-east of Narita International Airport, Japan, on 27 September 2018. These findings should not be read as apportioning blame or liability to any particular organisation or individual.\r\nContributing factors:\r\n• During the cruise between Saipan and New Chitose, the pilot very likely became incapacitated and could no longer operate the aircraft.\r\n• The aircraft’s engine most likely stopped due to fuel starvation from pilot inaction, which resulted in the aircraft entering an uncontrolled descent into the ocean.\r\nOther factors that increased risk:\r\n• The pilot was operating alone in the unpressurised aircraft at 22,000 ft and probably not using the oxygen system appropriately, which increased the risk of experiencing hypoxia and being unable to recover."}