{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-johannesburg-10-killed", "date": "Dec 6, 1999 at 0706 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Flightline Charter Services", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Johannesburg - Oranjemund", "msn": "31-7405210", "yom": 1974, "flight_number": "FC350", "city": "Johannesburg-Rand", "zone": "Gauteng", "country": "South Africa", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 1444, "captain_hours_type": 445, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8422, "circumstances": "The charter operator was involved in a weekly operation to transport computer programmers and training staff, from a Johannesburg company, from Rand Airport to Oranjemund in Namibia. The outward leg of the flights to Oranjemund took place on the Monday morning and the pilot and aircraft stayed at Oranjemund for the week. The return flight to Johannesburg usually took place on the Friday afternoon. On the morning of the accident flight the set time of departure was 0500z. The passengers were assisted through the process of passport control, boarding and settling in by the operator's staff. The baggage was put next to the aircraft. According to a witness the pilot carried out the loading of the baggage. An instrument flight plan was filed and the pilot obtained departure clearance before the aircraft was taxied to the holding point. According to the air traffic controller, the take-off run was normal for this type of aircraft. Shortly after take-off the pilot declared an engine failure and requested to be routed back to land on the runway. Seconds later the pilot communicated they were going to crash. Several witnesses stated that the aircraft was very low when it passed over the highway close to the accident site. One of the witnesses stated that he noticed the right-hand engine stopped and he could see the blades of the propeller. The fire fighting services were alerted. It was apparent by the smoke that the aircraft crashed on an extended line of Runway 29. The accident took place at 0506z in daylight conditions. All 10 occupants were killed.", "probable_cause": "The following findings were identified:\r\n- The precipitative cause of this accident was the failure of the exhaust pipe segment, which caused the right–hand engine to lose power/fail.\r\n- The overloaded condition of the aircraft was thus a highly significant contributory factor.\r\n- The pilot operating the aircraft in an overloaded condition is regarded as a significant contributing factor.\r\n- The company’s lack of flight operations management experience, professional flight standards supervision and an operational safety management program are regarded as significant contributing factors.\r\n- The anomalies noted in regulatory oversight of the operator (airworthiness and flight operations surveillance) by the CD:CAA and CAA are regarded as possible contributing factors. "}