{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-near-pathankot-29-killed", "date": "Jun 3, 1963 at 1130 LT", "type": "Douglas DC-3", "operator": "Indian%20Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Amritsar – Srinagar", "msn": "20265", "yom": 1944, "flight_number": null, "city": "Pathankot", "zone": "Punjab", "country": "India", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 25, "pax_fatalities": 25, "other_fatalities": 0, "total_fatalities": 29, "captain_hours": null, "captain_hours_type": 2700, "copilot_hours": null, "copilot_hours_type": 4000, "aircraft_hours": null, "circumstances": "The aircraft was on a scheduled domestic flight from Amritsar to Srinagar. It took off at 1115LT with 29 persons on board and 7 minutes later it reported its position 25 miles from Amritsar. No further communication was received from the aircraft. Shortly after 1200 hours a report was received by telephone at Amritsar, stating that the aircraft had crashed in a field near the Sarna railway station, about five miles west from Pathankot. The crash took place at a point where the aircraft had to make a left turn of 70° to proceed on its normal course to Srinagar. Eyewitness evidence indicates that the aircraft made a left turn, went out of control and lost height rapidly. It then attained a climbing attitude, broke up and crashed to the ground, catching fire on impact. All 29 occupants were killed. ", "probable_cause": "The accident was caused by structural failure of the aircraft in the air following overstressing as a result of loss of control. The loss of control was caused by improper rigging of the rudder bungee system which helps to prevent the marked tendency of the rudder of the Hiper Dakota to reverse or lock under conditions of yawed turn and/or encountering a severe side gust. It is equally likely that malfunctioning or improper operation of the autopilot may have initiated a yaw and accentuated the tendency of the rudder to lock."}