{"url": "https://www.baaa-acro.com/crash/crash-cessna-421a-golden-i-eagle-tulsa-3-killed", "date": "Jul 10, 2010 at 2205 LT", "type": "Cessna 421A Golden Eagle I", "operator": "Chase Bales", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Pontiac – Tulsa", "msn": "421A-0084", "yom": 1968, "flight_number": null, "city": "Tulsa", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 592, "captain_hours_type": 67, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 640, "circumstances": "During the 3.5-hour flight preceding the accident flight, the airplane used about 156 gallons of the 196 gallons of usable fuel. After landing, the airplane was topped off with 156 gallons of fuel for the return flight. During the preflight inspection, a line serviceman at the fixed based operator observed the right main fuel tank sump become stuck in the open position. He estimated 5 to 6 gallons of fuel were lost before the sump seal was regained, but the exact amount of fuel lost could not be determined. The lost fuel was not replaced before the airplane departed. Data from an on board GPS unit indicate that the airplane flew the return leg at an altitude of about 4,500 feet mean sea level for about 4 hours. About 4 minutes after beginning the descent to the destination airport, the pilot requested to divert to a closer airport. The pilot was cleared for an approach to runway 18R at the new destination. While on approach to land, the pilot reported to the air traffic control tower controller, “we exhausted fuel.” The airplane descended and crashed into a forested area about 1/2 mile from the airport. Post accident examination of the right and left propellers noted no leading edge impact damage or signatures indicative of rotation at the time of impact. Examination of the airplane wreckage and engines found no malfunctions or failures that would have precluded normal operation. The pilot did not report any problems with the airplane or its fuel state before announcing the fuel was exhausted. His acceptance of the approach to runway 18R resulted in the airplane flying at least 1 mile further than if he had requested to land on runway 18L instead. If the pilot had declared an emergency and made an immediate approach to the closest runway when he realized the exhausted fuel state, he likely would have reached the airport. Toxicological testing revealed cyclobenzaprine and diphenhydramine in the pilot’s system at or above therapeutic levels. Both medications carry warnings that use may impair mental and/or physical abilities required for activities such as driving or operating heavy machinery. The airplane would have used about 186 gallons of fuel on the 4-hour return flight if the engines burned fuel at the same rate as the previous flight. The fuel lost during the preflight inspection and the additional 30 minutes of flight time on the return leg reduced the airplane’s usable fuel available to complete the planned flight, and the pilot likely did not recognize the low fuel state before the fuel was exhausted due to impairment by the medications he was taking.", "probable_cause": "The pilot’s inadequate preflight fuel planning and management in-flight, which resulted in total loss of engine power due to fuel exhaustion. Contributing to the accident was the pilot’s use of performance-impairing medications.\n"}