{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-18d-zurich-45-killed", "date": "Jan 18, 1971 at 1549 LT", "type": "Ilyushin II-18", "operator": "Balkan%20Bulgarian%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris - Sofia", "msn": "186 0090 02", "yom": 1966, "flight_number": "LZ130", "city": "Zurich-Kloten", "zone": "Zurich", "country": "Switzerland", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 7, "pax_on_board": 39, "pax_fatalities": 38, "other_fatalities": 0, "total_fatalities": 45, "captain_hours": 8444, "captain_hours_type": 3460, "copilot_hours": 9932, "copilot_hours_type": 3627, "aircraft_hours": 8622, "circumstances": "In the afternoon, the airplane departed Paris on flight LZ130 to Sofia, carrying 39 passengers and a crew of eight. While cruising at its assigned altitude vertical to Luxeuil VOR, the captain requested to ATC the permission to divert to Zurich-Kloten Airport. The reason for this rerouting was unknown. The crew was cleared to change his route and continued over south of West Germany before starting a descent to Zurich. The approach to runway 16 at Zurich-Kloten was initiated in poor weather conditions with fog reducing the horizontal visibility to 600 meters and the vertical visibility to 60 meters. On final, the left main gear and the left wing tip struck the ground. The airplane gain a little height then struck the ground, lost its four engines and crashed in flames about 700 meters short of runway threshold, slightly out from the approach path. The aircraft was totally destroyed by impact forces and a post crash fire and only two occupants survived the accident, the captain and a boy aged 12. All 45 other occupants were killed. The occupants were respectively 14 West German, 12 Bulgarian (among them 8 crew members), 9 French, 4 Syrians, 2 Lebanese, one Brazilian, one Dutch, one Argentinian, one Austrian, one Finnish and one British. ", "probable_cause": "The reason why the crew wanted to divert to Zurich-Kloten Airport could not be determined. Nevertheless, it was determined that during an ILS approach to runway 16 in thick fog, the crew neglected several published procedures which led the aircraft to pass below the minimum descent altitude and the approach path. The lack of visibility due to fog was considered as a contributing factor as the crew was unable to establish a visual contact with the ground and the runway. The last technical revision (50 hours) was completed two days prior to the accident, the 600 hours check on December 2, 1970 and the big revision (check C) was completed on May 31, 1969. At the time of the accident, the airplane was considered as airworthy and no technical anomalies was reported. The eight crew members were respectively a captain, a copilot, a navigator, a flight engineer, a radio navigator, an aspirant radio navigator, one steward and one stewardess. "}