{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-oscoda-1-killed", "date": "Sep 25, 2018 at 0613 LT", "type": "Beechcraft 200 Super King Air", "operator": "Kalitta%20Charters", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Detroit - Oscoda", "msn": "BB-272", "yom": 1977, "flight_number": "K985", "city": "Oscoda-Wurtsmith", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3806, "captain_hours_type": 201, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13933, "circumstances": "The airline transport pilot of the multiengine airplane was cleared for the VOR approach. The weather at the airport was reported as 400 ft overcast with 4 miles visibility in drizzle. When the airplane failed to arrive at the airport as scheduled, a search was initiated, and the wreckage was located soon thereafter. Radar data indicated that the pilot was provided vectors to intercept the final approach course. The last radar return indicated that the airplane was at 2,200 ft and 8.1 miles from the runway threshold. It impacted terrain 3.5 miles from the runway threshold and left of the final approach course. According to the published approach procedure, the minimum descent altitude was 1,100 feet, which was 466 ft above airport elevation. Examination of the wreckage revealed that the airplane had impacted the tops of trees and descended at a 45° angle to ground contact; the airplane was destroyed by a postcrash fire, thus limiting the examination; however, no anomalies were observed that would have precluded normal operation. The landing gear was extended, and approach flaps had been set. Impact and fire damage precluded an examination of the flight and navigation instruments. Autopsy and toxicology of the pilot were not performed; therefore, whether a physiological issue may have contributed to the accident could not be determined. The location of the wreckage indicates that the pilot descended below the minimum descent altitude (MDA) for the approach; however, the reason for the pilot's descent below MDA could not be determined based on the available information.", "probable_cause": "The pilot's descent below minimum descent altitude during the non precision instrument approach for reasons that could not be determined based on the available information."}