{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-great-falls", "date": "May 16, 1997 at 1314 LT", "type": "Learjet 35", "operator": "First Air Jet Charter", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Great Falls - Dallas", "msn": "35-398", "yom": 1981, "flight_number": null, "city": "Great Falls", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8700, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8019, "circumstances": "The captain reported: 'Shortly after V1...there was a loss of power to the left engine....' (FAR Part 1 defines V1 as takeoff decision speed.) However, the first officer, who was the pilot flying, stated the captain retarded power on the left engine as a training exercise. The first officer stated there was no preflight discussion of emergency procedure practice. The airplane became airborne about 3,500 feet down the runway; the crew subsequently lost control of the aircraft, and it crashed to the left of the runway, and a fire erupted. The crew escaped with minor injuries. A teardown of the left engine was performed under FAA supervision at the engine manufacturer's facilities; the engine manufacturer reported that damage found during the teardown 'was indicative of engine rotation and operation at the time of impact....' Both airspeed indicator bugs were found set 9 to 11 knots below the V1 speed on the takeoff and landing data (TOLD) card. No evidence of an aircraft or engine malfunction, to include inflight fire, was found at the accident site. ", "probable_cause": "The captain's inadequate preflight planning/preparation, and the subsequent improper response to a simulated loss of engine power, resulting in liftoff at an airspeed below that for which sustained flight was possible. "}