{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-4-caribou-entebbe", "date": "Apr 28, 1976", "type": "De Havilland DHC-4 Caribou", "operator": "Uganda%20Police", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Entebbe - Entebbe", "msn": "222", "yom": 1964, "flight_number": null, "city": "Entebbe", "zone": "Central", "country": "Uganda", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4723, "captain_hours_type": 36, "copilot_hours": 455, "copilot_hours_type": 69, "aircraft_hours": 1953, "circumstances": "The aircraft was operating circuits, from Entebbe Airport, for the purpose of a DHC-4 Type Rating (Night) Flight Examination. The cadet pilot was flying the aircraft from the left hand seat while the check captain occupied the right hand seat. There were no passengers. The first circuit involved a simulated hydraulic failure and was completed without incident. During the second circuit the starboard engine was intentionally feathered and the aircraft made a landing approach on one engine. Just prior to touchdown a sudden increase in engine power resulted in the aircraft yawing and rolling steeply towards the starboard side. The aircraft started skidding on its starboard wheel and wing tip. It skidded across the runway and over the adjoining grass strip, towards the aerodrome boundary. Somme 220 m further down, the aircraft crossed a drainage ditch and crashed through a barbed wire fence around the aerodrome perimeter. The fuselage broke in half during the crash and the wreckage came to a halt approximately 15 m beyond the aerodrome perimeter. The check captain suffered severe back injuries; the cadet pilot sustained no injuries. Investigations carried out after the accident revealed that the aircraft was operating satisfactorily prior to the accident. It is concluded that the probable cause of the accident was the application of considerable engine power when the aircraft was in an asymmetric landing configuration and at a speed probably below the single engine minimum control speed (Vmc). Lack of understanding between the two flight crew as to what each was doing immediately prior to the accident and the student/instructor relationship between the two crew members as well as the prevailing dark night conditions were contributory factors. ", "probable_cause": "The accident occurred most probably due to strong asymmetric thrust caused by increasing engine power on the operative engine when the aircraft was about to touch down with one engine feathered. Contributory factors were: \r\n- The lack of understanding between the two flight crew members of what each other was doing immediately prior to the accident,\r\n- The student/instructor relationship between the two and the prevailing dark night-time conditions."}