{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-south-lake-tahoe-4-killed", "date": "Sep 1, 2000 at 1550 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Jeffrey Thomas Needham", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "South Lake Tahoe – San Diego", "msn": "46-8508056", "yom": 1985, "flight_number": null, "city": "South Lake Tahoe", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 2500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2845, "circumstances": "The airplane took off from the airport on a left downwind departure and after reaching an altitude of approximately 300 feet, banked steeply and dove into the ground. Witness statements indicated that the takeoff ground roll extended to midfield of the runway, a distance of 4,850 feet before the airplane lifted off. According to the Airplane Flight Manual performance charts, the normal ground roll should have been about 2,100 feet. While turning crosswind, the airplane steepened its bank and continued toward the downwind. As the angle of bank approached 90 degrees, the nose dropped and the airplane descended to impact with trees and the ground. Several trees were struck before the airplane came to rest on the  underlying terrain in the backyard of a residence. The airplane was thermally destroyed in the impact sequence and post crash fire. Calculations of the airplane weight and balance data put it at least 251 pounds over maximum allowable gross takeoff weight. Remaining wreckage not consumed in the ground fire was examined and the engine was sent to the manufacturer for inspection. No discrepancies were found. Cockpit instrumentation and all autopilot components were thermally destroyed. Flaps and landing gear were found in the retracted position and the elevator trim surface was slightly nose up from the takeoff setting. The autopilot had a reported history of malfunction and the electric elevator trim system was scheduled for repair a week before the accident, but the owner took the airplane prior to the work being performed. The airplane had been modified with the addition of several Supplemental Type Certificates, one of which was a wing spoiler system. The controls and\r\nmany of the actuating linkages for the spoiler system were destroyed in the fire.", "probable_cause": "The pilot's in-flight loss of control in the takeoff initial climb for undetermined reasons."}