{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2b-26-islander-near-jhuosi-3-killed", "date": "Aug 30, 2012 at 0915 LT", "type": "Britten-Norman Islander", "operator": "Dapeng Airlines", "flight_phase": "Flight", "flight_type": "Aerial photography", "survivors": "No", "site": "Mountains", "schedule": "Taipei - Taitung", "msn": "2255", "yom": 1991, "flight_number": null, "city": "Jhuosi", "zone": "Hualien County (花蓮縣)", "country": "Taiwan", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 12545, "captain_hours_type": 465, "copilot_hours": 11212, "copilot_hours_type": 245, "aircraft_hours": 4909, "circumstances": "On August 30, 2012, a RAC’s BN-2B-26 aircraft, registration number B-68801, contracted  by Real World Engineering Consultants Inc. (Real World) to perform an aerial photogrammetry mission with a captain, a first officer and an aerial photographer on board. The flight plan was to take off from Songshan Airport, requested for instrument departure and visual flight rules to conduct aerial photogrammetry mission in Hualien and Taitung area, the aircraft planned to land at Taitung Airport after the mission accomplished. The aircraft took off at 0726, approximately 18 minutes after took off, the flight crew changed flight mode from instrument flight rules to visual flight rules. At 0827, the aircraft entered Hualien County Fenglin, Guangfu, Wanrong aerial photograph area, maintain 8,300 feet to 8,500 feet altitude and continued climbing to Jhuosi, Hualien County photo area at 0919. From 0837 to 0843, Taipei Approach informed the flight crew ‘Radar can’t cover you…..make sure maintain visual flight’. There were about 7 times communication blockage between the aircraft and Taipei Approach during 0755 to 0913 period. The Kaohsiung Approach Control contacted the aircraft at 0913:39 and lost contact with the aircraft at 0914:20 after the last communication. At 0920:55, the aircraft was at 260 degrees, 31.5 km mountain area from Yuli, Taitung and  began to turn right heading 280 degrees. The last recorded Light Detection and Ranging (LIDAR) device data was 262 degrees, 35.9 km west of Yuli′s mountain area with coordinates of 23 ° 20 ′25.01 \" latitude and 121 ° 01′ 50.03\" longitude. At the time of the last recording, the aircraft was at 9,572 feet with about 69 knots ground speed, 250 degrees heading, the climb rate was 874 ft / min and the pitch was 23.5 degrees. At 0940, Taipei Mission Control Center (MCC) received ELT (Emergency Locator Transmitter) signals, about the same time, Japan Coast Guard informed Rescue Command Center, Executive Yuan (RCC) of the same ELT signals. After verification with Civil Aeronautics Administration, Ministry of Transportation and Communications (CAA), RCC confirmed that the aircraft had lost contact. At 0955 on September 1, 2012, the search and rescue aircraft discovered the aircraft crashed at altitude about 9,568 feet of the original forest, about 20 kilometers southwest of Jhuosi, Hualien County. Three crew members on board were killed, and the aircraft was destroyed.", "probable_cause": "After completing the aerial photogrammetry of Morakot No.16 measuring line, the aircraft turned 280 degrees to the right and attempted to climb to get out of the valley area. During climbing, the pitch of the aircraft was remained more than 20 degrees for a few seconds, the aircraft might nearly close to stall and activated stall warning. The aircraft performance might not be able to fly over the obstacles ahead under this condition, the aircraft flew into trees and crashed. When completing the aerial photography of Morakot No.16 measuring line from the north to the south, the aircraft could not be able to fly over mountains ahead between the direction of 9 to 3 o’clock with the aircraft best climb performance. Despite the available climbing distance was longer when flight crew chose to turn to the right, the area geography was not favorable for circling climb or turn around to escape the mountain area safely. The on board personnel choose to perform an aerial photogrammetry at Morakot when weather condition was permitted after completing the aerial photography at Wanrong Woods without any advance planning due to the Morakot aerial photography had been behind schedule."}