{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa26t-merlin-iib-saint-george-2-killed", "date": "Jul 7, 1998 at 1547 LT", "type": "Swearingen SA26T Merlin II", "operator": "FS%20Air%20Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Mountains", "schedule": "Anchorage - Saint George", "msn": "T26-146", "yom": 1969, "flight_number": null, "city": "Saint George", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 13000, "captain_hours_type": 250, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7799, "circumstances": "The flight departed Anchorage, Alaska, and was en route to Saint George, Alaska, to pick up passengers for a return flight to Anchorage. The pilot-in-command (PIC) was seated in the right seat, and the copilot was seated in the left seat. This was the copilot's third flight in this make and model airplane, and he was not qualified as a crewman in it under 14 CFR Part 135. There was no record of when the copilot last performed a non directional beacon (NDB) approach. The NDB indicator in the cockpit was on the left side of the left control column, partially blocked from the view of the PIC. The minimum altitude for the segment of the approach prior to the final approach fix (FAF) was 1,700 feet. The Minimum Descent Altitude (MDA) for the final segment of the approach was 880 feet. The reported ceiling was 100 feet overcast. The Air Route Traffic Control Center radar altitude readout for the airplane revealed that the airplane descended below 600 feet prior to reaching the FAF. The radar ground track revealed the airplane on course prior to the course reversal procedure turn on the published approach. The radar ground track showed that after the course reversal, the airplane continued through the published final approach course, and turned to parallel the inbound track three miles north of course. The radar plot terminates about the location of the 550 feet high cliffs where the airplane was located. Weather at the time of the accident was reported as 100 foot overcast. This location was 5.5 miles (DME) from the airport. A review of radar tapes from the day prior to the accident, show the same airplane and PIC tracking the published course outbound and inbound, and descending below the published approach minima to below 500 feet. This flight successfully landed at the airport. An interview with the copilot from the successful flight revealed that the PIC intentionally descended to 300 feet on the approach until he acquired visual contact with the ocean, then flew to the airport to land. An aircraft flying on the published inbound final approach course at 5.5 DME is over water, approximately three miles from the nearest terrain. ", "probable_cause": "The pilot-in-command's failure to adequately monitor the instrument approach and the copilot's failure to intercept and maintain the proper NDB bearing on the approach. Contributing factors were the pilot-in-command's obstructed view of the NDB indicator and his overconfidence in his personal ability, the terrain (cliffs), low ceiling, and the flight crew's disregard of the minimum descent altitude. "}