{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-curitiba-2-killed", "date": "Aug 22, 2007 at 0035 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Two%20Taxi%20Aereo", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Curitiba – Jundiaí", "msn": "110-323", "yom": 1980, "flight_number": null, "city": "Curitiba-Afonso Pena", "zone": "Paraná", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 18400, "captain_hours_type": 8200, "copilot_hours": 5600, "copilot_hours_type": 1600, "aircraft_hours": null, "circumstances": "After passengers were dropped at Curitiba-Afonso Pena Airport, the crew was returning to his base in Jundiaí. Shortly after takeoff from runway 11 by night and marginal weather conditions, the airplane entered clouds at an altitude of 300 feet and continued to climb. Following a left turn, the aircraft climbed to an altitude of 700 feet then entered a right turn and an uncontrolled descent until it crashed in a field located near the Guatupê Police Academy located 3 km northeast of the airport. The accident occurred two minutes after takeoff. The aircraft was totally destroyed and both pilots were killed. At the time of the accident, the visibility was poor due to the night and a cloud base at 300 feet. ", "probable_cause": "Loss of control during initial climb in IMC conditions after the crew suffered a spatial disorientation. The following factors were identified:\r\n- Weather conditions were not suitable for the completion of the flight,\r\n- The crew failed to prepare the flight according to published procedures,\r\n- The crew failed to follow the pre-takeoff checklist, \r\n- The copilot did not have adequate training for this type of operation,\r\n- The captain had emotional conditions that compromised flight operations,\r\n- The relationship between both pilots was incompatible,\r\n- The main attitude indicator was out of service since a week and the crew referred to the emergency attitude indicator, \r\n- Because of poor flight preparation and non observation of the pre-takeoff checklist, the captain forgot to switch on the emergency attitude indicator prior to takeoff, \r\n- At the time of the accident, the captain had accumulated 15 hours and 22 minutes of work without rest, which is against the law,\r\n- The captain showed overconfidence and inflexibility which weakened his performances,\r\n- Both pilots disagreed on operations,\r\n- The visibility was poor due to the night and the ceiling at 300 feet above ground,\r\n- The state of complacency of the organization was characterized by a culture adaptable to internal processes, without the adoption of formal rules for the operations division and the acceptance of operating conditions incompatible with security rules and protocols, which allowed the newly hired crew to feel free to act in disagreement with the standards and regulations in force at the time of the accident,\r\n- Performing a sharp turn to the right in IMC conditions associated with a long working day and a lack of rest,\r\n- The level of stress of the captain due to intense fatigue generated by a high workload and an insufficient rest period,\r\n- Poor crew discipline,\r\n- Poor judgment of the situation,\r\n- Poor flight planning,\r\n- Failures in the operator's organizational processes and lack of supervision of flight operations."}