{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46a-50-cu-commando-mar-del-plata-51-killed", "date": "Jan 16, 1959 at 2140 LT", "type": "Curtiss C-46 Commando", "operator": "Austral-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Buenos Aires – Mar del Plata", "msn": "30514", "yom": 1944, "flight_number": "AU205", "city": "Mar del Plata", "zone": "Buenos Aires province", "country": "Argentina", "region": "South America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 47, "pax_fatalities": 46, "other_fatalities": 0, "total_fatalities": 51, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Buenos Aires-Aeroparque-Jorge Newbury Airport at 1950LT with a delay of 35 minutes due to bad weather at destination. Following an uneventful flight, the captain obtained the permission to land on runway 12 at Mar del Plata-Brigadier General Bartolomé de la Colina Airport, passed over the threshold at a height of 85 meters and overshot. The captain decided to make a go around when control was lost. The airplane stalled and crashed into the sea about 1,2 km offshore. A passenger was seriously injured while all 51 other occupants were killed. ", "probable_cause": "The pilot failed during a missed approach procedure to observe the instrument flight procedure and attempted to continue visual flight by night in unfavourable weather conditions. The aircraft then lost altitude and descended into the sea. Contributing factors were: \r\n- As the pilot was not familiar with the airport in this type of operation, he miscalculated during the instrument approach procedure,\r\n- The pilot's temporarily confused mental state, when he found himself in this critical situation, affected his capability and skill,\r\n- The radio beacon was out of service and the lighting was poor because of the weather conditions at the time of the approach,\r\n- Unsatisfactory dispatching of the aircraft by the operator."}