{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-near-kagarkhay-6-killed", "date": "Jul 19, 2020 at 2026 LT", "type": "PZL-Mielec AN-2", "operator": "Feniks", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Mountains", "schedule": "Kyren - Kyren", "msn": "1G207-47", "yom": 1984, "flight_number": null, "city": "Tagarkhay", "zone": "Republic of Buryatia", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 4280, "captain_hours_type": 4236, "copilot_hours": 8363, "copilot_hours_type": 8363, "aircraft_hours": 7382, "circumstances": "The single engine airplane departed Kyren Airport in the afternoon with four employees of the company and two pilots. The purpose of the flight was to familiarize them with the area of ​​the planned aviation chemical works for the processing of the silkworm. As the airplane failed to return to Kyren in the evening, SAR operations were initiated, but abandoned few days later as no trace of the aircraft was found. More than a year later, on July 24, 2021, a group of tourist discovered the burnt wreckage near the Baikonur Pass, in a rocky area, at an altitude of 2,780 metres. The airplane was destroyed by a post crash fire and all six occupants were killed. ", "probable_cause": "The accident with the An-2 RA-71276 aircraft occurred as a result of a collision with a mountain at an altitude of 2,780 metres above sea level perpendicular to the direction of the ridge with its minimum height of 2,960 metres conditions of limited visibility and the closure of mountain tops by clouds.\r\nThe following contributing factors were identified:\r\n- The crew took the decision to perform a flight over a mountainous area with predicted closure of the mountains by clouds and unfavorable wind conditions,\r\n- The crew took the decision to return to the landing site through the mountain range along an unexplored and previously unused route,\r\n- Operational fatigue of the crew due to the significant duration of working hours on the day of the accident (more than 12 hours),\r\n- The airplane falling under the influence of descending air currents on the leeward side of a mountain slope."}