{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-i-cassano-di-centenaro-2-killed", "date": "Nov 6, 2006 at 0322 LT", "type": "Piper PA-31 Cheyenne", "operator": "Air Loop", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Valetta - Milan", "msn": "31-7904030", "yom": 1979, "flight_number": null, "city": "Cassano di Centenaro", "zone": "Emilia-Romagna", "country": "Italy", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3169, "captain_hours_type": 2540, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3122, "circumstances": "The twin engine aircraft departed Valetta Airport, Malta, on a night flight to Milan-Linate Airport, carrying one passenger and one pilot. After passing Elba Island at an altitude of 21,000 feet, over the Gulf of Genoa, the aircraft deviated from the prescribed route to the east while it was supposed to pass over Genoa before descending to Milan. Few minutes later, the aircraft entered an uncontrolled descent and crashed in a wooded and hilly terrain located in Cassano di Centenaro, about 43 km southwest of Piacenza. The aircraft disintegrated on impact and both occupants were killed.  ", "probable_cause": "The pilot lost control of the aircraft, resulting in a collision with the ground. For reasons that investigations have not been able to determine with precision, the twin engine aircraft deviated from its intended course to the east. The lack of visibility caused by night could remain a contributing factor in that the pilot was not able to distinguish the ground and determine his position accurately. The analysis of the flight path and the debris of the aircraft did not make it possible to provide convincing and objective evidence on the possibility of an in-flight structural failure, of a technical failure of the flight controls or any alteration in the psychic or physical abilities of the pilot."}