{"url": "https://www.baaa-acro.com/crash/crash-fokker-f7-egmont-key", "date": "Aug 15, 1928 at 1915 LT", "type": "Fokker F7", "operator": "Pan%20Am.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Havana - Key West", "msn": "704", "yom": 1927, "flight_number": null, "city": "Saint Petersburg", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The three engine airplane departed Havana on a trip to Key West, carrying two passengers and a crew of three. The airplane has been refuelled prior to departure from Havana, giving an endurance of about three hours, which was more than enough for the 100 miles distance between both airports. About 20 minutes into the flight, while cruising at an altitude of 3,400 feet, the crew encountered poor weather conditions with a visibility below two miles. In such conditions, the pilot lost his orientation and passed over Key West before continuing to the north. After three hours of flight, as the fuel reserve was low, the pilot reduced his altitude to 100 feet and spotted the tanker named 'S. S. Ligonier' cruising in the Gulf of Mexico. After all three engines stopped due to fuel exhaustion, he ditched the airplane around 1915LT in rough sea. All five occupants, slightly injured, were quickly rescued by the crew of the tanker. Some mail bags were salvaged before the aircraft named 'General Machado' sank and was lost. \r\nCrew:\r\nCpt Robert H. Fatt, pilot,\r\nAngel Alfanco, mechanic, \r\nHugo C. Leuteritz, radio operator. \r\nPassengers:\r\nNorman Ageton-Iost, \r\nWilliam Mallon. ", "probable_cause": "Engine failure due to fuel exhaustion after the crew got lost in poor weather. "}