{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900d-bushi-3-killed", "date": "Mar 15, 2008 at 0920 LT", "type": "Beechcraft 1900D", "operator": "Wings Aviation", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Mountains", "schedule": "Lagos - Bebi", "msn": "UE-322", "yom": 1998, "flight_number": "TWD8300", "city": "Bushi", "zone": "Cross River", "country": "Nigeria", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 9730, "captain_hours_type": 852, "copilot_hours": 444, "copilot_hours_type": 204, "aircraft_hours": 5578, "circumstances": "The aircraft, Beech 1900D with flight number TWD8300 on a positioning flight, filed an Instrument Flight Rule (IFR) with Air Traffic Services (ATS) at Murtala Muhammed Airport (MMA) Lagos for departure to Bebi airstrip, Obudu on a filed flight plan LAG – UA609 – POTGO – DCT – ENU – DCT - OBUDU. But the actual route flown was LAG – UA609 – POTGO – LIPAR – LUNDO – IKROP – BUDU. The aircraft departed MMA at 0736 hrs as per the flight plan, climbed to FL250, estimated MOPAD at 0755 hrs, BEN at 0814hrs, POTGO at 0837hrs, LIPAR at 0844hrs, LUNDO at 0902 hrs and OBUDU destination at 0917hrs. The aircraft was transferred to Port Harcourt at 0845 hrs thereafter the crew requested descent. It was cleared to FL110 but on passing through FL160 requested further descent and was then released to Enugu at 0856 hrs by Port Harcourt. Enugu cleared it to FL050. The aircraft deviated from the flight plan route, and flew on airway UA609 direct to IKROP from POTGO. The inputs into Global Positioning System (GPS) gave the crew different distances to Bebi. The crew agreed on a coordinate to input and thereafter were busy trying to locate the airstrip physically. During this process the Ground Proximity Warning System (GPWS), warning signals and sound of “Terrain, terrain…..pull up” was heard several times without any of the pilot following the command. The aircraft flew into terrain, crashed and was destroyed. At 0923hrs, the Radio Operator at Bebi called the aircraft to confirm its position, but received no reply. The FDR showed that the aircraft crashed at about 0920:15 hrs at an altitude of about 3,400ft at Bushi Village during the hours of daylight with three fatalities. The aircraft flew for 103.75 minutes before impact.At 0924 hrs, Bebi Radio Operator called Calabar, to confirm if in contact with 5N-JAH, Calabar replied negative contact. The burnt wreckage was found by hunters in a dense wooded area on 30 August 2008.", "probable_cause": "The flight crew conducted an approach into a VFR airfield in an instrument meteorological condition and did not maintain terrain clearance and minimum safe altitude which led to Controlled Flight Into Terrain. The crew did not respond promptly to GPWS warning. \r\nContributory Factors:\r\n- The flight crew was not familiar with the route in a situation of low clouds, poor visibility and mountainous terrain.\r\n- The Area Controllers did not detect the estimate as passed by the pilot for positions not in the filed flight plan (LIPAR and LUNDO) and omitting ENUGU.\r\n- The flight crew changed from IFR flight to VFR flight without proper procedure and ATC clearance.\r\n- The crew did not use Jeppesen charts as approved in WINGS AVIATION Operational Specifications by NCAA.\r\n- The Lagos Area Control Center (ACC) did not detect or question the disparity in waypoints and routing as read back by the crew, compared with the filed flight plan."}