{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-602p-fortingall-1-killed", "date": "Nov 30, 2000 at 1635 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "Gardner%20Aircraft%20Sales", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "No", "site": "Mountains", "schedule": "Linz – Newcastle – Keflavik – Narsarsuaq – Goose Bay – New York", "msn": "60-8365-006", "yom": 1983, "flight_number": null, "city": "Fortingall", "zone": "Perth and Kinross", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1860, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Start-up, taxi and take-off were apparently normal with an IFR clearance for a noise abatement right turn-out on track towards the Talla VOR beacon. Soon afterwards the pilot was given clearance to join controlled airspace on track towards Talla at FL 140 and to expect the flight planned level of FL 200 when cleared by Scottish Radar. As the aircraft was climbing through FL 120 the Talla sector controller first cleared the pilot to climb to FL140 and then almost immediately re-cleared him to climb to FL 200. The pilot replied \"ER NEGATIVE I WOULD LIKE TO MAINTAIN ONE FOUR ZERO FOR THE TIME BEING\" and the controller granted his request. At 16:21 hrs the pilot transmitted \"SCOTTISH NOVEMBER SIX FOUR SEVEN ONE NINE ER REQUESTING HIGHER TO GET OUT OF SOME ICING\". Initially the controller offered FL 160 but the pilot replied \"IF POSSIBLE TWO ZERO ZERO\". Immediately he was given clearance to climb to FL 205, the correct quadrantal cruising altitude. Recorded radar data showed that for the next six minutes, the aircraft's rate of climb and airspeed were erratic. The pilot made one brief transmission of \"SCOTTISH\" at about 16:30 hrs but nothing more was said by him or the controller for another 20 seconds. Then the controller said \"NOVEMBER SIX FOUR SEVEN ONE NINE ER I SEE YOU'RE IN THE TURN DO YOU HAVE A PROBLEM\". There was no reply and so the controller repeated his message, eventually receiving the reply \"YES I HAVE ER AN EMERGENCY\". The controller asked the pilot to  \"SQUAWK SEVEN SEVEN ZERO ZERO\" but the pilot replied \"HANG ON\". By this time the aircraft was descending rapidly in a gentle right turn. The controller twice asked the pilot for the nature of his problem but the pilot asked the controller to 'HANG ON FOR A MOMENT\". The controller could see the aircraft was near high ground and losing altitude rapidly. He twice passed messages to this effect to the pilot but he did not receive an immediate reply. At 16:33 hrs the pilot transmitted \"CAN YOU GET ME ER SOMEWHERE WHERE I CAN LAND I CAN'T MAINTAIN ALTITUDE AT ALL\". Immediately the controller instructed the pilot to take up an easterly heading and gave him the aircraft's position relative to the airport at Perth. The controller then asked the pilot for his flight conditions (twice) to which the pilot eventually replied \"I'M COMING OUT OF ER THE CLOUDS NOW\" followed by \"JUST BREAKING OUT\". The controller then said \"ROGER DO YOU HAVE ANY POWER AT ALL OR HAVE YOU LOST THE ENGINE\". The pilot replied \"I GOT POWER AGAIN BUT I HAVE NO CONTROL\". That was his last recorded RTF transmission made at 16:34:40 hrs. The final radar return placed the aircraft at an altitude of 3,150 feet overhead Drummond Hill which is on the north bank of Loch Tay, near the village of Fortingall, and rises to 1,500 feet amsl. ", "probable_cause": "On vacating FL140, the aircraft's climb rate was so erratic at 140 KIAS that it seems likely that by then, the aircraft had already gathered sufficient ice to seriously affect its performance. If all the\r\nturbocharger inlets had become partially blocked, then manually selecting both engines to alternate air induction should have introduced warmer air into the turbochargers and restored power. The description of engine operation in the Superstar manual states: \r\n'If manifold pressure continues to decrease after opening the manual alternate air, it is an indication that turbocharger inlets are still restricted and the engine may become normally aspirated through the automatic alternate air door located below the induction air filter'.\r\nNormal aspiration reduces the manifold pressure to ambient or less and at FL140 the ambient pressure is about 17.6 inches which is less than half the climb rated manifold pressure. That might explain the inability to climb above FL 160 but it would also have deprived the pilot of pressurisation. There was no change in his voice consistent with donning an oxygen mask so he may not have lost pressurisation completely. Nevertheless, since he lost control at around FL160 and 110 KIAS, and because the aircraft initially turned to the right, a combination of airframe icing and asymmetric power loss seem the most likely explanation for the sustained loss of control. The split in the EDP diaphragm which almost certainly occurred during this flight may have contributed to an asymmetric power problem. Alternatively, the pilot might have become mildly hypoxic and decided to begin an emergency descent. If so, he did not declare an emergency at the time he started to descend, although he did utter the word \"SCOTTISH\" after control was lost, so he was conscious even if his mental abilities had been impaired by hypoxia. On balance, the tone of his voice and his initial failure to respond to ATC messages suggested that the descent was begun through loss of control rather than a deliberate act followed by loss of control. At the time of the accident the aircraft had been flying below the freezing level (8,000 feet) for about five minutes and much of the airframe and induction system ice may have melted. The would-be rescuers would have taken at least five minutes to reach the crash site and so the fact that  none of them reported seeing or treading on any ice was not surprising. Witness and propeller evidence indicated that power had been restored on at least one engine but there seemed to be insufficient power to climb out of Glen Lyon. The aircraft was out of control when it crashed at low speed from a sharp turning manoeuvre. Before this manoeuvre the pilot may have had partial control, albeit with a power problem which prevented him from climbing, and he finally lost control totally when he attempted to turn around within the confines of the Glen. He had no choice but to attempt the turn since, had he not turned, he would have flown into the side of the hill above the crash site. "}