{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-pacific-ocean", "date": "Apr 12, 1997 at 2204 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Corporate%20Air%20Australia", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Oakland - Honolulu", "msn": "342", "yom": 1972, "flight_number": null, "city": "Pacific Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 25000, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9873, "circumstances": "On a ferry flight from Oakland, California, to Honolulu, Hawaii, the pilot declared a low fuel emergency and diverted toward Hilo, Hawaii. Approximately 2.5 hours later, the aircraft was ditched in the Pacific ocean. The pilot evacuated the aircraft before it sank and was rescued by the U.S. Coast Guard. He stated that, under flight planned conditions, the aircraft departed Oakland with sufficient fuel onboard to reach the intended destination with a 2-hour fuel reserve. However, the winds at flight altitude, which were reported as light and variable at the preflight weather briefing, developed into a significant headwind during the flight. At a point 7 hours and 10 minutes into the flight, the pilot determined that his fuel remaining was 8 hours and 40 minutes, with 7 hours and 40 minutes remaining to destination. Three hours later, the pilot determined that his 2-hour reserve was gone. He declared an emergency and diverted toward the closest airport, which was Hilo. Prior to fuel system exhaustion, the pilot elected to ditch the aircraft with power. ", "probable_cause": "The pilot's inadequate en route fuel consumption calculations, which led to his failure to recognize a deteriorating fuel duration versus time-to-go situation in a more timely way. "}