{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-beagle-bay", "date": "Jan 14, 2010 at 0645 LT", "type": "Cessna 208B Grand Caravan", "operator": "Broome%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Broome - Koolan Island", "msn": "208B-0635", "yom": 1997, "flight_number": null, "city": "Beagle Bay", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Broome on a charter flight to Koolan Island, WA. At about 0645 Western Standard Time1, when the aircraft was at an altitude of about 9,500 feet, the pilot noticed a drop in the engine torque indication with a corresponding drop in the engine oil pressure indication. The pilot increased the power lever setting but the engine torque and oil indications continued to reduce, all other engine indications were normal. During an interview with the Australian Transport Safety Bureau (ATSB) the pilot stated that he felt a power loss associated with the drop in indicated engine torque. The pilot diverted to the nearest airstrip, which was Beagle Bay, WA. He stated that the low oil pressure warning light illuminated so he shut the engine down and prepared for an emergency landing. The pilot reported that on the final approach to the airstrip he realized that the aircraft was too high and its airspeed was too fast. The aircraft touched down about mid way along the runway and overran the end of the runway by about 200 metres. The aircraft impacted a mound of dirt, coming to rest upside down. The pilot, who was the only occupant sustained minor injuries. Examination of the aircraft by a third party and inspection of the photographs taken of the accident site, revealed that the engine, left main gear and nose gear had separated from the airframe during the accident sequence. There was a significant amount of oil present on the underside of the aircraft, indicating that the oil had leaked from the engine during operation. The\r\nengine was removed from the accident site as an assembly by a third party. The propeller was removed and the engine was shipped to an engine overhaul facility where a disassembly and\r\nexamination was conducted under the supervision of the ATSB. ", "probable_cause": "From the evidence available it was evident that the engine had a substantial in-flight oil leak, which necessitated the in-flight shut down of the engine and a diversion to the nearest available airstrip. The accident damage to the engine in the area of the apparent oil leak precluded a conclusive finding as to the source of the leak. Although the detailed examination of the oil tube attachment lug fracture surfaces was inconclusive, the oil tube remained the most likely source of the oil leak. Evidence from other oil tube failures indicated that significant vibratory loading can cause the oil tube attachment lugs to fracture in the manner observed in the oil tube fitted to VH-NTQ. There was  no evidence that the transfer tube was subjected to vibration from a compressor turbine or power turbine blade failure or of an incorrectly fitted engine mount. There was also no evidence of a pre-accident defect that would have caused a reduction in actual engine torque. "}