{"url": "https://www.baaa-acro.com/crash/crash-cessna-525-citationjet-cj2-memphis-3-killed", "date": "Nov 30, 2018 at 1028 LT", "type": "Cessna 525 CitationJet CJ2", "operator": "EstoAir", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Jeffersonville – Chicago", "msn": "525-0449", "yom": 2009, "flight_number": null, "city": "Memphis", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3306, "circumstances": "On November 30, 2018, about 1028 central standard time, a Cessna 525A (Citation) airplane, N525EG, was destroyed when it was involved in an accident near Memphis, Indiana. The pilot and two passengers were fatally injured. The airplane was operated as a Title 14 Code of Federal Regulations Part 91 business flight. The cross-country flight originated from Clark Regional Airport (JVY), Jeffersonville, Indiana, and was en route to Chicago Midway International Airport (MDW), Chicago, Illinois. The airplane was equipped with automatic dependent surveillance–broadcast (ADS-B), which recorded latitude and longitude from GPS, pressure and geometric altitude, and selected altitude and heading. The airplane was also equipped with a cockpit voice recorder (CVR), which recorded the accident flight and annunciations from the enhanced ground proximity warning system (EGPWS). It was not equipped with a flight data recorder (FDR) nor was it required to be. Review of the CVR transcript showed that the pilot operated as a single pilot but verbalized his actions as he configured the airplane before departure. He referenced items from the Before Taxi checklist and included in his crew briefing that in the event of a problem after takeoff decision speed, he would handle it as an in-flight emergency and “fly the airplane, address the problem, get the autopilot on, talk on the radios, divert over to Stanford.” The air traffic controller provided initial clearance for the pilot to fly direct to the STREP intersection and to climb and maintain 3,000 ft mean sea level. Before the departure from JVY, the pilot announced on the common traffic advisory frequency that he was departing runway 36 and verbalized in the cockpit “this is three six” before he advanced the throttles. The flight departed JVY about 1024:36 into instrument meteorological conditions. The CVR recorded the pilot state that he set power to maximum cruise thrust, switched the engine sync on, and turned on the yaw dampers. The pilot also verbalized his interaction with the autopilot, including navigation mode, direct STREP, and vertical speed climb up to 3,000 ft. According to the National Transportation Safety Board’s (NTSB) airplane performance study, the airplane climbed to about 1,400 ft msl before it turned left onto a course of 330° and continued to climb. The CVR recorded the pilot state he was turning on the autopilot at 1025:22. At 1025:39, the pilot was cleared up to 10,000 ft and asked to “ident,” and the airplane was subsequently identified on radar. The pilot verbalized setting the autopilot for 10,000 ft and read items on the After Takeoff/Climb checklist. The performance study indicated that the airplane passed 3,000 ft about 1026, with an airspeed between 230 and 240 kts, and continued to climb steadily. At 1026:29, while the pilot was conducting the checklist, the controller instructed him to contact the Indianapolis Air Route Traffic Control Center; the pilot acknowledged. At 1026:38, the pilot resumed the checklist and stated, “uhhh lets seeee. Pressurization pressurizing anti ice de-ice systems are not required at this time.” The performance study indicated that, at 1026:45, the airplane began to bank to the left at a rate of about 5° per second and that after the onset of the roll, the airplane maintained airspeed while it continued to climb for 12 seconds, consistent with engine power not being reduced in response to the roll onset. At 1026:48, the CVR recorded the airplane’s autopilot disconnect annunciation, “autopilot.” The performance study indicated that about this time, the airplane was in about a 30° left bank. About 1 second later, the pilot stated, “whooooaaaaah.” Over the next 8 seconds, the airplane’s EGPWS annunciated six “bank angle” alerts. At 1026:57, the airplane reached its maximum altitude of about 6,100 ft msl and then began to descend rapidly, in excess of 11,000 ft per minute. At 1026:58, the bank angle was about 70° left wing down, and by 1027:05, the airplane was near 90° left wing down. At 1027:04, the CVR recorded a sound similar to an overspeed warning alert, which continued to the end of the flight. The performance study indicated that about the time of the overspeed warning, the airplane passed about 250 kts calibrated airspeed at an altitude of about 5,600 ft. After the overspeed warning, the pilot shouted three expletives, and the bank angle alert sounded two more times. According to the performance study, at 1027:18, the final ADS-B data point, the airplane was about 1,000 ft msl, with the airspeed about 380 kts and in a 53° left bank. At 1027:11, the CVR recorded the pilot shouting a radio transmission, “mayday mayday mayday citation five two five echo golf is in an emergency descent unable to gain control of the aircraft.” At 1027:16, the CVR recorded the EGPWS annunciating “terrain terrain.” The sound of impact was recorded about 1027:20. The total time from the beginning of the left roll until ground impact was about 35 seconds. The accident site was located about 8.5 miles northwest of JVY.", "probable_cause": "The asymmetric deployment of the left wing load alleviation system for undetermined reasons, which resulted in an in-flight upset from which the pilot was not able to recover."}