{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-hilltop-lakes-4-killed", "date": "Sep 20, 2020 at 1050 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "KMAC Bravo", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Horseshoe Bay – Natchitoches", "msn": "46-8508014", "yom": 1985, "flight_number": null, "city": "Hilltop Lakes", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1107, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While in cruise flight at 19,000 ft mean sea level (msl), the pilot declared an emergency to air traffic control and stated that the airplane had lost engine power and that he needed to divert. The pilot elected to divert to an airport that was about 5 miles south of his position. Archived automatic dependent surveillance-broadcast data and commercially available flight track data showed that a descent was initiated from 19,000 ft and the airplane proceeded directly to, and circled around, the airport one time while descending. The last data point showed the airplane at 1,250 ft msl (about 750 ft above ground level) and about 1 mile north of the approach end of the runway. From the cruise altitude of 19,000ft until the last data point, about 12 minutes and 45 seconds had elapsed, which equated to an average descent rate of about 1,392ft per minute. Witnesses located about 1/4 mile south of the end of the runway on a miniature golf course noticed the propeller on the airplane was not turning. They stated that they saw the airplane in a “really hard” left bank; the nose of the airplane dropped, and it impacted the ground in a near vertical attitude. The airplane came to rest along a road about 200 ft south of the airport property. The airplane impacted the terrain in a nose low, near vertical attitude and sustained substantial damage to fuselage and both wings. It is likely that, based on the location of the runway, relative to the miniature golf course, the pilot initiated the left bank to avoid bystanders on the ground and inadvertently exceeded the wing’s critical angle of attack, which resulted in an aerodynamic stall. The airplane was equipped with an engine trend monitor (ETM), which captured various events concerning the accident flight, including engine start, operating limit exceedances, and power checks. The ETM captured a power check while the airplane was at 19,100 ft. About 3 minutes 32 seconds later, an engine off event was recorded. The ETM further captured a logon message, which was consistent with the power being cycled, at an altitude of 3,542 ft, 9 minutes, 52 seconds later. The ETM did not record any start attempts between the logged engine off event and when power was lost to the unit. A postaccident examination of the airframe, engine, and accessories did not reveal any mechanical malfunctions or anomalies that would have precluded normal operation. Although it cannot be determined whether a restart attempt would have been successful, the data were consistent with a restart not being attempted. Both the engine failure and power off landing checklists contained instructions for the pilot to establish the airspeed at 90 knots; however, when the winds aloft were applied to the reported groundspeeds, it was evident this did not occur. Furthermore, the power off landing checklist instructed the pilot to be about 1,500 ft above the airport on the downwind leg; however, data indicate that the airplane was about 5,000 ft above the airport on the downwind leg. The rapid descent from 5,000 ft on the downwind leg to about 750 ft above ground level on the final leg resulted in an unstabilized approach.", "probable_cause": "The loss of engine power for reasons that could not be determined and the pilot’s failure to maintain control of the airplane which resulted in an aerodynamic stall and spin. Contributing to the accident was the pilot’s failure to establish and maintain a proper glidepath."}