{"url": "https://www.baaa-acro.com/crash/crash-avro-748-353-2a-tambacounda-23-killed", "date": "Feb 1, 1997 at 1438 LT", "type": "Avro 748", "operator": "Air%20Senegal.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tambacounda - Dakar", "msn": "1769", "yom": 1979, "flight_number": null, "city": "Tambacounda", "zone": "Tambacounda Region", "country": "Senegal", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 49, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 23, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The departure was delayed due to overbooking. Passengers and crew were nervous and few passengers should disembark. Following a normal takeoff roll, the pilot-in-command started the rotation. About 30 seconds later, while climbing to a height of about 100 feet, the left engine failed. The aircraft stalled and crashed less than 100 metres past the runway end, bursting into flames. The aircraft broke in two and most of the survivors were found in the rear part of the cabin while the front one disintegrated on impact. Twenty-nine people survived while 23 others, including all three crew members, were killed. ", "probable_cause": "The exact cause of the accident could not be determined and the official accident report was not published by the Senegal Government. Nevertheless, The determination of the causes of the accident is therefore based on the expert reports ordered by the French investigating magistrate and the position of the locking pin of the left supply valve observed after the accident. Experts conclude that the left engine has stopped due to the closing of the fuel supply valve. The poor quality of the fuel was also blamed, which, before the accident, led Air Senegal to ask a chemical engineer from Shell-Senegal to test the fuel and the refueling operations. The engineer, while noting the poor quality of the fuel, came to the same conclusions as the experts. In France, operational tests were carried out on a similar aircraft and, moreover, fuel analyzes were carried out by the Accident Investigation Bureau. To these different expertises were added those of the government of the United Kingdom, the country of the manufacturer of the aircraft, and the results of a test carried out by British Aerospace with the same aircraft. The various analyzes carried out on the drums used for refueling showed that water was not present in the drums but in the pump used for refueling. It appears that the pump had been disassembled and the filters removed before filling the aircraft's tanks. As a result, the tiny amount of water that could have been found in the tanks would not have allowed the fuel to be considered contaminated and therefore unfit for consumption. The court, considering itself sufficiently informed by all these expertises, refused to grant the civil parties a further investigation 12 years after the facts. For the magistrates, there is no doubt that the determining cause of the accident was the closure of the left fuel isolation valve. The various investigations finally made it possible to determine that a ground mechanic had carried out a technical intervention under the left wing before the departure, at the level of the engine, but the exact nature of this intervention could not be established with precision. In its judgment, the court recognized that various indirect causes may have played a role in the occurrence of this air disaster: anomalies in the storage and distribution of fuel, nervousness and intense stress generated around the aircraft due to overbooking, irritability of the captain who, impatient to take off, did not consider certain checks useful. However, the magistrates have ruled, the determining cause perfectly defined by the various experts is the closing of the isolation valve of the left engine of the aircraft. On May 14, 2009, more than 12 years after the incident, Senegalese mechanic Moustapha Diagne was sentenced to 30 months' imprisonment with a 15-month suspended sentence. The length of the firm prison sentence is the length of the pre-trial detention that the defendant, after being extradited, had already served."}