{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-62m-luxembourg-7-killed", "date": "Sep 29, 1982 at 1923 LT", "type": "Ilyushin II-62", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Luxembourg - Havana - Lima", "msn": "72503", "yom": 1977, "flight_number": "SU343", "city": "Luxembourg-Findel", "zone": "All Luxembourg", "country": "Luxembourg", "region": "Europe", "crew_on_board": 11, "crew_fatalities": 0, "pax_on_board": 66, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10325, "circumstances": "Following an uneventful flight from Moscow-Shermetyevo Airport, the crew completed the approach to Luxembourg-Findel Airport. While passing over the runway 06 threshold at a height of 5 meters and a speed of 278 km/h, engine power was reduced to 40% and thrust reversers were activated on engine n°1 and 4. For unknown reasons, reversers on engine n°1 failed to deploy and the airplane banked right. At a speed of 265 km/h, the airplane landed five seconds later and after touchdown, the spoilers were activated and the engine power increased on engine n°1 and 4 to 86% and 80% respectively. The airplane veered off runway to the right, rolled for 1,300 meters then struck a water tower before coming to rest 900 meters further, bursting into flames. 38 occupants were injured and 32 others were unhurt. Unfortunately, seven passengers were killed in the accident. ", "probable_cause": "The accident may be attributed to a mechanical failure affecting the mechanism of controlling thrust which occurred during the most critical phase of landing. This failure, sudden and unpredictable, was identified by the crew and made the aircraft uncontrollable in direction during the execution of the normal landing procedure."}