{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54-do-skymaster-seattle-28-killed", "date": "Nov 17, 1955 at 2359 LT", "type": "Douglas C-54 Skymaster", "operator": "Peninsular Air Transport", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "City", "schedule": "Seattle – Newark", "msn": "3123", "yom": 1942, "flight_number": "PNS17K", "city": "Seattle-Boeing Field", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 1, "pax_on_board": 70, "pax_fatalities": 27, "other_fatalities": 0, "total_fatalities": 28, "captain_hours": 5920, "captain_hours_type": 1000, "copilot_hours": 5778, "copilot_hours_type": 531, "aircraft_hours": 19630, "circumstances": "Peninsular Air Transport Common Carriage Flight 17K was scheduled to originate at Boeing Field and terminate at Newark, New Jersey, with intermediate refueling stops. The assigned crew consisted of Captain W. J. McDougall, First Officer F. C. Hall, and Steward J. O. Adams. The third pilot, Edward, McGrath, deadheading to Miami, Florida, occupied the jump seat with no crew duties. The flight, scheduled to depart at 2030, was delayed because of a heavy snowfall during the afternoon and early evening of November 17 which delayed passenger arrivals and necessitated removal of snow from the aircraft before departure. At 2332 the flight taxied to runway 13, holding off the runway waiting its turn behind other flights to take off, During this time the crew completed pre-takeoff cheeks and received an IFR (Instrument Flight Rules) clearance. This, in part, instructed them to turn right after takeoff and climb on the northwest course of the Seattle Range to 5,000 feet m. s. 1. (mean sea level). The takeoff was started at 2358 and appeared normal as the landing gear retracted and right turn was begun. When approximately 300-400 feet above the ground the first reduction of power, from takeoff to normal rated power, was made and about five of the 15 degrees of flaps extended, were retracted. At this time the No. 4 propeller surged and engine r. p. m. increased to about 2,800. Unable to reduce the r. p. m. of No. 4 by reducing its power an attempt was made to feather the propeller; this also was unsuccessful. As the aircraft then began to descend takeoff power was reapplied to Nos. 1, 2, and 3 engines and the power from No. 4 was further reduced. This action did not reduce the r. p. m. of No. 4 which surged again and increased to more than 3,000. The aircraft veered to the right and continued to descend. Realising that a crash-landing was imminent Captain McDougall reduced the airspeed until the aircraft was nearly stalled and applied full power to all four engines. The aircraft continued to settle. It then struck a telephone pole and several trees before crash-landing in a nose-high attitude. Fire and rescue equipment was dispatched to the scene from both the Seattle Fire Department and the Seattle-Tacoma Airport. The units arrived promptly and gave first aid to the survivors. Fire which followed the crash was quickly extinguished but not before extensive property was burned and the aircraft was nearly consumed. One crew member and 27 passengers were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the excessively high drag resulting from the improperly indexed propeller blades and inability to feather. These conditions were the result of a series of maintenance errors and omissions. The following findings were reported:\r\n- Weather conditions at takeoff were above minim with respect to ceiling and visibility,\r\n- There was no snow or ice on the aircraft when it took off,\r\n- During the first power reduction the No. 4 engine r. p. m. fluctuated, became uncontrollable, and shortly thereafter increased to more than 3,000,\r\n- Efforts to reduce the r. p. m. and feather the malfunctioning propeller were unsuccessful,\r\n- The propeller dome retaining nut was not tightened sufficiently permitting oil to leak around the dome seal,\r\n- The leaking oil resulted in a lack of oil for reducing the r. p. m. or feathering the No. 4 propeller,\r\n- Poor maintenance procedures, omissions during maintenance, and lack of proper inspection were evident in the maintenance work performed by Seattle Aircraft Repair, Inc,\r\n- Improper indexing of the No. 4 propeller blades occurred during the work at Seattle,\r\n- Propeller drag from the overspeeding No. 4 propeller greatly increased by the incorrect indexing of the blades made continued flight difficult if not impossible,\r\n- The aircraft was unairworthy following the Seattle maintenance work."}