{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chiefain-medford-1-killed", "date": "Dec 5, 2021 at 1652 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Donald H. Sefton", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Medford - Fallon", "msn": "31-7752124", "yom": 1977, "flight_number": null, "city": "Medford-Rogue Valley", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On December 05, 2021, at 1652, a Piper PA-31-350 Navajo Chieftain airplane, N64BR, was substantially damaged when it was involved in an accident in Medford, Oregon. The pilot and passenger were fatally injured. The airplane was operated as a Title 14 Code of Federal Regulations (CFR) Part 91 personal flight. The pilot and passenger made a flight on November 24, from the airplane’s home airport in Fallon, Nevada to Medford. After landing, the pilot noticed the airplane was leaking a large amount of fuel from the right wing-root. The pilot arranged to make the necessary repairs with a fixed based operator (FBO) at the airport and drove a rental car back home to Nevada. On December 4, a mechanic at the FBO notified the pilot that the maintenance to the airplane was completed. The pilot responded that he would plan to get the airport about 1430 the following day (on the day of the accident). The pilot and passenger drove to Medford arriving about 1600. The radio communication times could not be confirmed for accuracy for the purposes of the preliminary report. The pilot received an instrument flight rules (IFR) clearance and was issued the BRUTE7 departure procedure with the LANKS transition. During the exchange of the clearance instructions, the pilot requested the controller read back the departure procedure and transition phonetically. The pilot’s family and a business associate stated this was very normal for the pilot and he would often have people clarify names and instructions. The published BRUTE SEVEN Standard Instrument Departure (SID) with a takeoff from runway 14 consisted of a “climbing right turn direct MEF [Medford] NDB [nondirectional beacon],” and continue to the BRUTE intersection on a bearing of 066°. After receiving the clearance, the controller informed the pilot the overcast layer base was at 200 ft above ground level (agl) the tops of the layer was at 2,500 ft. After the airplane departed the pilot made a radio communication to the controller asking “will you be calling my turn for the BRUTE7?” The controller replied that he would not be calling his turn and that the pilot should fly the departure as published making a climbing right turn to overfly the approach end of runway 14 before proceeding to the BRUTE intersection (see Figure 1 below). The pilot acknowledged the communication, which was his last transmission. Several seconds later, the controller stated that he was receiving a low-altitude alert that the airplane’s altitude was showing 1,700 ft. He made several attempts to reach the pilot with no response. The radar and automatic dependent surveillance-broadcast (ADS-B) information disclosed that the airplane arrived in the run-up area for runway 14 about 1643 and then continued onto the runway about 6 minutes thereafter. The airplane departed about 1649:30 and after crossing over the south end of the runway, it climbed to about 1,550 ft mean sea level, equivalent to 200 ft agl (see Figure 2 below). The airplane then began a gradual right turn and climbed to 1,950 ft maintaining an airspeed between 120- 130 kts. As the airplane turn continued to the north the altitude momentarily decreased to 1,650 ft (about 350 ft agl) with the airspeed increasing to 160 kts. Thereafter, the airplane then increased the bank angle and made a 360-degree turn initially climbing to 2,050 ft. At the completion of the turn, the airplane descended to 1,350 ft, consistent with it maneuvering below the cloud layer. The airspeed increased to about 160 kts and several seconds later, the airplane climbed to 2,250 ft with the derived airspeed showing below 15 kts. Six seconds later was the last radar return, located about 990 ft north-northwest of the accident site. Video footage was obtained from several fixed security cameras on buildings around the accident site. A review of the footage revealed that the airplane descended below the cloud layer and then climbed back up. About 16 seconds thereafter, the airplane is seen descending in a near vertical attitude. The airplane’s position and strobe light appeared to be illuminated throughout the video. The preliminary review of the recorded audio from the camera footage revealed that there were sound components at frequencies that correspond to the normal operating speed range of the airplane engines. The accident site was adjacent to the garage bays of an automobile dealership located about 2,800 ft west-southwest from the departure end of runway 14. A majority of the wreckage had been consumed by fire and sustained major crush deformation. Various items in the cockpit were not burned, including numerous paper sectionals and IFR charts of which there were several current departure procedure plates for the Medford Airport. The Piper PA-31-350 Navajo (Panther conversion), airplane was manufactured in 1977 and was powered by two Lycoming TIO-540-J2B series engines driving two, four-bladed Q-Tip propellers. The airplane was equipped with a Garmin GNS 530W and an autopilot. The pilot had previously owned a PA-31-350 and purchased the accident airplane in 2013. According to his electronic logbooks he had amassed about 1,500 hours in a PA-31-350 of which 280 hours was in actual instrument meteorological conditions. The logbooks indicated that the pilot had departed from Medford in August 2018 and 2019 by way of the JACKSON1 and EAGLE6 departure procedures, respectively. Investigators compiled a comparison of ADS-B data from two airplanes that departed before the accident airplane (at 1507 and 1556) and two that departed after (1734 and 1813). A comparison of flight tracks from the three airplanes that departed runway 14 revealed that all began the right turn after the accident flight.", "probable_cause": null}