{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6-mount-carmel-43-killed", "date": "Jun 17, 1948 at 1241 LT", "type": "Douglas DC-6", "operator": "United-Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "San Diego – Los Angeles – Chicago – New York", "msn": "42871", "yom": 1947, "flight_number": "UA624", "city": "Mount Carmel", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 39, "pax_fatalities": 39, "other_fatalities": 0, "total_fatalities": 43, "captain_hours": 7310, "captain_hours_type": 30, "copilot_hours": 3289, "copilot_hours_type": 129, "aircraft_hours": 1245, "circumstances": "The airplane arrived in Chicago at 0952LT, en route from Los Angeles to New York City. At Chicago, the airplane was given a routine station inspection, serviced, loaded, and the flight departed for New York with a new crew at 1044. Aboard were 39 passengers, a crew of four, 2,568 pounds of cargo and 1,800 gallons of fuel, all properly loaded. The resulting total airplane weight was within the certificated gross weight. The airplane climbed en route to its planned altitude of 17,000 feet, proceeding on course, and at 1155 the captain reported to the company radio at LaGuardia Field, that the airplane was mechanically \"okay” for a return trip. A routine report was made over Phillipsburg, PA, approximately 500 miles east of Chicago, at 1223, and at 1227 the crew made a routine acknowledgment of a clearance to descend en route to an altitude between 13,000 and 11,000 feet. Four minutes later, at 1231, the company radio operator at LaGuardia Field heard a voice which did not identify itself calling loudly and urgently. Another United crew in a DC-3, flying over the same route behind Flight 624 and at a different altitude, heard what they termed “screaming voices” calling \"New York.\" Then, after an unintelligible transmission, “This is an emergency descent.\" Inasmuch as all other air carrier flights in the vicinity at this time were accounted for, this transmission undoubtedly emanated from Flight 624. The airplane was first observed by ground witnesses 31 miles northwest of the scene of the accident flying a southeasterly heading toward Shamokin, PA. The airplane flew over the Sunbury Airport, at approximately 4,000 feet above the ground on a southeasterly heading. Immediately north of Shamokin the airplane, then only 500 to 1,000 feet above the ground, described a shallow left turn. The course was toward constantly rising terrain, the hills around Sunbury being 900 feet in elevation and the hills around Shamokin being approximately 1,600 feet in elevation. Five miles east or beyond Shamokin the airplane, flying only 200 feet above the ground, entered a right climbing turn. As it passed to the north of Mount Carmel, the climbing turning attitude increased sharply. The airplane then struck a hillside at an elevation of 1,649 feet. The aircraft disintegrated on impact and all 43 occupants were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the incapacitation of the crew by a concentration of CO2 gas in the cockpit.\r\nThe following factors were considered as contributing:\r\n- A fire warning caused the crew to discharge at least one bank of the CO2 fire extinguisher bottles in the forward cargo pit (the forward underfloor baggage compartment),\r\n- Six 15-pound CO2 bottles and six discharge valves were found in the wreckage, however, both the bottles and the valves (which had become separated from their respective bottles upon impact) were so damaged that no conclusions could be drawn as to how many of such bottles had been discharged prior to impact,\r\n- At the time of impact, the emergency cabin pressure relief valves were closed, and the control mechanism for such valves was in the closed position,\r\n- Except for the apparent failure of the fire detection instrument referred to in finding No. 5, supra, the investigation revealed no mechanical failure of the aircraft or fire in flight,\r\n- The emergency procedure for the operation of the DC-6 fire extinguisher system was established after flight tests were conducted in a descent configuration of 300 miles per hour, with landing gear and flaps up, no flight tests were conducted prior to the accident in a descent configuration of 160 miles per hour with gear and flaps down, which configuration was also approved for DC-6 operations,\r\n- At the time of impact the landing gear was in the “up\" position, thus indicating that the aircraft had descended in the configuration of 300 miles per hour. The extensive breakage of the aircraft precluded any positive determination as to the position of the flaps,\r\n- After the release of CO2 gas hazardous concentrations of the gas entered into the cockpit,\r\n- Due to the physiological and toxic effects of high concentrations of CO2 gas in the cockpit, which would probably not have occurred had the cabin pressure relief valves been open, the members of the flight crew of the aircraft were rendered physically and mentally incapable of performing their duties.\r\nThe following comment was added to the conclusion:\r\nA fire in flight permits little opportunity for the exercise of detached and thoughtful consideration of emergency procedure. Immediate action is required if a fire is to be controlled. Too little consideration has been given to the psychological and physical limitations of crew members in time of stress and danger as related to the complexity of emergency fire procedure. It is not safe to assume that the pilot and co-pilot, under emergency pressure, will always adhere rigidly to the sequence of steps outlined in the CAA Approved Airplane Operating Manual. The possibility of human error under great mental stress is well documented in air transport experience and the design of aircraft controls, especially those of an emergency character, should take into consideration the natural limitations of human nature. These limitations argue against involved procedures applicable in emergencies. In harmony with this objective, the Douglas Aircraft Company has designed and is testing a modified fire extinguishing system which will permit all necessary steps to be executed by the movement of one control. An additional vent is also being designed to reduce CO2 concentration in the cockpit. Seven days after the Mt Carmel accident, the Director of Aviation Safety of the CAA directed telegrams to all CAA regional administrators calling attention to his telegram of June 10, 1948, referred to above, and advising that further investigation had disclosed the existence of the CO2 concentration condition found in Constellation aircraft by the Chillicothe tests in other makes of aircraft. The telegram concluded \"Hence, flight crews of all aircraft should be advised to wear oxygen masks and utilize emergency cockpit smoke clearance procedures when carbon dioxide is released into any fuselage compartment from other than portable extinguishers.” All scheduled U S air carriers operating DC-6s have equipped the airplanes with demand type full face oxygen masks for the use of the crew."}