{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-123b-new-york-95-killed", "date": "Mar 1, 1962 at 1008 LT", "type": "Boeing 707", "operator": "American-Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Los Angeles", "msn": "17633", "yom": 1959, "flight_number": "AA001", "city": "New York-Idlewild", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 87, "pax_fatalities": 87, "other_fatalities": 0, "total_fatalities": 95, "captain_hours": 18300, "captain_hours_type": 1600, "copilot_hours": 8800, "copilot_hours_type": 900, "aircraft_hours": 8147, "circumstances": "Flight One was cleared for takeoff from Runway 31L on a regularly scheduled nonstop flight to Los Angeles, California, and became airborne at 1007 e.s.t. The takeoff and initial climb appeared to be normal and a gentle turn to the left was started about 8,000 feet down the runway near taxiway AA, at an altitude of about 100 feet. Straightening out from this turn the aircraft continued to climb for several seconds on a magnetic heading of 290 degrees, and started a second turn to the left, apparently in compliance with radar vector directions given by Departure Control. In the second turn the airplane continued to climb. After initiation of the second turn the angle of bank increased until the airplane rolled through 90 degrees of bank at a peak altitude of about 1,600 feet m.s.1. It then entered an inverted, nose-low attitude and plunged earthward in a nearly vertical dive. The airplane struck the shallow waters of Pumpkin Patch Channel of Jamaica Bay approximately three miles southwest of the Idlewild Control Tower at 1008:49 Floating debris and fuel ignited a few minutes later and burned fiercely. The aircraft disintegrated on impact and there were no survivors among the 95 occupants. ", "probable_cause": "The Board determines that the probable cause of this accident was a rudder control system malfunction producing yaw, sideslip and roll leading to a loss of control from which recovery action was not effective."}