{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-near-cody-4-killed", "date": "Jun 28, 1987 at 2359 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Hugo Schoellkopf", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "White Sulfur Springs – Casper – Dallas", "msn": "421C-0707", "yom": 1974, "flight_number": null, "city": "Cody", "zone": "Wyoming", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3665, "captain_hours_type": 315, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot and three passengers were returning to Dallas, TX from a retreat in Montana. The pilot filed an IFR flight plan from White Sulphur Springs, MT, to Casper, WY, but did not activate it after departure. The aircraft was reported overdue by family and a search was initiated. The wreckage was located by the civil air patrol on 7/1/87. The aircraft had crashed at the 10,000 feet level of a box canyon area in mountainous terrain. The impact area was on a rolling meadow that was surrounded on three sides by mountains. Entrance to the area was from the north-northeast. There was evidence the aircraft impacted in a left wing low, nose low attitude, after turning to a heading of about 050°. Before takeoff, the pilot had added 35 gallons of fuel (mixture of 80 and 100 octane fuel) for an estimated fuel load of 213 gallons. No evidence was found of a preimpact mechanical failure or malfunction. Approximately 27 miles south-southeast of Cody, WY, the weather was in part: 18,000 feet scattered, 25,000 feet overcast, 30 miles visibility. The elevation at Cody was about 5,000 feet lower than the crash site. All four occupants were killed. ", "probable_cause": "Occurrence #1: in flight collision with terrain/water\r\nPhase of operation: maneuvering\r\nFindings\r\n1. (c) in-flight planning/decision - improper - pilot in command\r\n2. (f) overconfidence in aircraft's ability - pilot in command\r\n3. (f) weather condition - high density altitude\r\n4. (f) terrain condition - mountainous/hilly\r\n5. (c) proper altitude - not attained - pilot in command"}