{"url": "https://www.baaa-acro.com/crash/crash-mbb-hfb-320-hansa-jet-blackpool-7-killed", "date": "Jun 29, 1972 at 1810 LT", "type": "MBB HFB-320 Hansa Jet", "operator": "Inter City Flug", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Blackpool – Rotterdam – Munich", "msn": "1029", "yom": 1968, "flight_number": null, "city": "Blackpool", "zone": "Lancashire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 4936, "captain_hours_type": 910, "copilot_hours": 1615, "copilot_hours_type": 869, "aircraft_hours": 2274, "circumstances": "The aircraft was one of a number of aircraft of this type used for the carriage of company employees and goods for Messerschmitt-Bolkow-Blohm GmbH. A twice-weekly charter service was operated from Germany to Warton Aerodrome in the United Kingdom or, alternatively, to Blackpool civil airport. D-CASY left Munich on the morning of 29 June 1972 and landed at 09:04 hrs at Blackpool, as Customs facilities were not available at that time at Warton. During the day the aircraft remained on the ground at Blackpool and for most of the time the captain and co-pilot were with it. At 15:20 hrs six of the eight passengers to be carried on the return trip to Germany arrived at Blackpool Airport and, as it was raining, sat in the aircraft, the Auxiliary Power Unit (APU) of which was running. Two more passengers were expected. A flight plan was prepared for Munich via Rotterdam and filed at 15:30 hrs. The two passengers did not turn up at the appointed time and the APU was shut down while the passengers and crew waited in the aircraft. About 16:30 hrs word was received that the two extra passengers were not coming. This meant that extra fuel could be accommodated and a new flight plan direct to Munich could be prepared. It was filed by the first officer, while the captain carried out the pre-flight check. The captain then started the APU and sat in the left hand seat with the first officer in the right hand seat and, according to the passenger who survived the accident, indicated that the first officer should operate the aircraft in command under supervision. The aircraft taxied out and lined up and the surviving passenger saw the right hand wing slat extended when the first officer applied power with the brakes 'on' at the start of the take-off. The port side wing slat and the flaps were outside this passenger's field of view. During the take-off run the aircraft reached its normal rotation speed in the usual distance. However, although the aircraft was travelling fast enough, rotation did not take place and it did not become airborne. The surviving passenger saw the first officer's hand holding the throttles fully open and wondered why the aircraft did not take-off. Then he saw a gesture from the captain indicating that the take-off should be abandoned. The first officer immediately closed the throttles. Observers on the aerodrome heard the engine noise die down approximately 300 metres from the end of the runway. Subsequently brake marks were found commencing in the same area. Braking was not effective, however, and the aircraft left the end of the runway at high speed, in a level attitude with its nose wheel and main wheels in contact with the ground. Shortly before the first impact the surviving passenger noticed the captain's hand on the controls and saw aileron movement. The first collision occurred when the starboard wing tip struck and severed a post supporting one of the airfield runway approach lights. The aircraft continued, colliding with and badly distorting the double track railway lines at the edge of the airfield. The nose wheel of the landing gear was broken off by this impact and some structural damage was done to the underside of the fuselage. Almost immediately beyond the railway lines the aircraft broke through a wall and collided with a row of single storey masonry chalets in the adjacent holiday camp, demolishing six of them and setting them on fire. The wings were broken off during this impact, spilling fuel over the area, but the main part of the aircraft continued its progress, sustaining further structural damage as it did so. The forward part of the fuselage, including the flight deck, was twisted to starboard and progressively destroyed. The final impact brought the aircraft to rest against a second row of chalets which were also badly damaged. The wreckage caught fire and was destroyed. The crew of two and five of the six passengers on board were killed. The sixth passenger, although thrown clear, was seriously injured.", "probable_cause": "A failure to unstick, most probable because the elevator gust lock had not been removed during the pre-flight checks. The take-off was abandoned at too high a speed for the aircraft to be brought to rest before colliding with obstructions."}