{"url": "https://www.baaa-acro.com/crash/crash-partenavia-p68tc-gratwich", "date": "Jun 3, 2001 at 1317 LT", "type": "Partenavia P.68", "operator": "Southern%20Aircraft%20Consultancy_0", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Meaux – Liverpool – Henstridge", "msn": "347-33/TC", "yom": 1984, "flight_number": null, "city": "Gratwich", "zone": "Staffordshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 695, "captain_hours_type": 159, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The five occupants left Guernsey on 24 May and flew direct to Vannes in Normandy. The pilot routinely cruised at power settings of 2,350 RPM and 32 inches Manifold Pressure giving a speed of 140 KIAS. The flight to Vannes would have taken some 44 minutes in still air and records recovered from the aircraft indicated that it lasted 50 minutes. The aircraft was parked at Vannes for a few days on level ground. No fuel was uplifted before leaving Vannes and the aircraft departed on 31 May to fly to Meaux on the eastern outskirts of Paris. The records indicate that this 254 nm flight lasted 2 hours 5 minutes. The aircraft was parked on level ground at Meaux for a few days. On the morning of 3 June, the day of the accident, the owner taxied the aircraft to the aero club's fuel pumps at Meaux to have the fuel tanks replenished. She believes she may have dipped the tanks before refuelling began but she could not remember the resultant quantities. Whilst the aircraft was being refuelled, the pilot left its vicinity and went into the club premises to file her flight plan, check the weather and pay the fuel and airport charges. The fuel receipt was completed for 157 litres of 100LL AVGAS When the refuelling operator had finished filling the left wing tank he moved towards the right wing but received instructions from a member of the pilot's family that there was no need to refuel the right wing tank. A different member of the family stated, soon after the accident, that this was because the right fuel tank gauge was indicating 2/3 full. Shortly afterwards the pilot returned to the aircraft. She did not dip the tanks after refuelling. On leaving Meaux the pilot recalled that the right tank gauge indicated \"almost full\" whilst the left tank gauge indicated \"a bit less\". Her intentions were to fly from Meaux to the airstrip near Liverpool where three persons would disembark and she  would then return to Henstridge. There were no refuelling facilities at the Liverpool landing strip and she planned to complete both legs without refuelling. She did so on the basis that the aircraft's endurance on full tanks was about 6 hours and she planned to be airborne for less than this. (The still air flight time was later calculated to be 41/4 hours and the prevailing winds were westerly). The aircraft departed Meaux at 1020 hrs and was flown uneventfully and in VMC conditions towards Liverpool via Compiegne, Abbeville, Lydd, Clacton and Cambridge. The autopilot was disengaged throughout the flight and the pilot could not recall using abnormal amounts of rudder or roll control (the aircraft had no aileron trim). Specifically, she was not aware of any marked imbalance in roll or any abnormal fuel gauge readings. At 1246 hrs when the aircraft was at 3,500 feet altitude and south of Leicester the pilot contacted East Midlands Approach and requested a Flight Information Service en-route to the Lichfield NDB. At 1312 hrs she transmitted a Mayday message on the East Midlands frequency stating that she had \"lost\" the right engine. The controller responded with information that the nearest airfield was Tatenhill in her six o'clock at about 10 miles range. The pilot turned to the right and took-up a south-westerly track towards Tatenhill. About one minute later, when asked to confirm her altitude, the pilot reported \"I HAVE NO ENGINES NOW\" followed by \"TO DO A FORCED LANDING PAPA VICTOR, OH NO ITS GOING AGAIN\". The controller continued providing vectors to Tatenhill whilst his assistant briefed Tatenhill's radio operator and West Drayton's Distress and Diversion cell on the developing situation. At 1315:40 hrs, when the aircraft was 10 miles northwest of Tatenhill at 2,800 feet altitude, the pilot reported \"NO ENGINES ... W'ELL HAVE TO FIND A FIELD\". The last recorded RTF message from the pilot at 1316:50 hrs was \"I HAVE A HI... HILL ERM A FIELD ON A\". The pilot was heavily sedated in hospital for some time after the accident and she could remember little of the final stages of the glide approach. The aircraft passed low beside a farmhouse and crash-landed in a field of soft earth with a significant up-slope in the landing direction.", "probable_cause": "The accident arose partly through significantly asymmetric fuel quantities in the two wing tanks before the aircraft took off. The pilot was critically injured in the accident and heavily sedated for some time afterwards, which may explain why she could remember few details of the refuelling process at Meaux. Because she left the aircraft during the refuelling operation, she may have been unaware that only the left tank had been replenished. A representative of the flying club at Meaux stated that the club accepted payment for fuel only by French cheque or in cash, and that the pilot paid in cash and appeared to spend all her remaining French currency. However, after paying all the charges at Meaux, the pilot's family had several hundred Francs and some French currency cheques with them and consequently, the inability to pay for more fuel was not an issue. Moreover, no explanation was offered as to how a pilot could pay for 157 litres of fuel before it had been delivered without the refueller receiving instructions to deliver that quantity. The pilot could not remember her instructions to the refueller but her instructions to a family member who remained with the aircraft were that if the left tank was between one half and two thirds full, the right tank was to be filled to within two inches of the filler neck. The pilot now believes that there may have been some confusion between the identification of 'left' and 'right' tanks. Nevertheless, if the fuel tank quantities were similar before the refuelling, it is surprising that the pilot was unaware of any tendency to roll towards the heavier left wing after take-off. Moreover, it is also surprising that the fuel gauges, which worked correctly when tested, did not give early warning of low fuel contents in one tank. The loss of power from the right engine was consistent with exhaustion of the fuel supply from the right wing tank which had not been replenished since the aircraft left Guernsey. Had it not been for  the mis-positioned fuel selector valve, the pilot should have had ample fuel to land safely at Tatenhill on one engine, a procedure which she had been adequately trained to accomplish. This option was thwarted when air from the empty right tank reached the left engine. At that moment the left engine began to run intermittently and ultimately the pilot had no option but to execute a forced landing. The pilot chose a brown field in which to land because she feared the aircraft might turn over if she landed in a field of standing crop. The upward slope of the field, the soft earth and the 'clean' wing configuration all contributed to a very heavy forced landing. The pilot did not remember feathering the right propeller (it had been feathered) and she could not explain why she had touched down with the flaps retracted. Nevertheless, the tone of the pilot's voice on the radio suggested that she was coping well with an unpleasant and unforeseen situation. The East Midlands air traffic controller's performance was exemplary. "}