{"url": "https://www.baaa-acro.com/crash/crash-cessna-750-citation-x-egelsbach-5-killed", "date": "Mar 1, 2012 at 1856 LT", "type": "Cessna 750 Citation X", "operator": "Asia Today", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Linz – Egelsbach - Bratislava", "msn": "750-0219", "yom": 2003, "flight_number": null, "city": "Egelsbach", "zone": "Hesse", "country": "Germany", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 4580, "captain_hours_type": null, "copilot_hours": 3000, "copilot_hours_type": null, "aircraft_hours": 3377, "circumstances": "The airplane was on a business trip in Austria from Innsbruck via Salzburg to Linz. At 1816 hrs the airplane took off in Linz with two pilots and three passengers aboard; destination airport was to be Bratislava, Czech Republic. On the way to Bratislava a stopover in Egelsbach, Germany (EDFE) was planned; an additional passenger would board there. For the flight from Linz to Egelsbach a Y-flight plan was filed; it scheduled a flight according to Instrument Flight Rules (IFR) including an approach according to Visual Flight Rules (VFR). At 1824 hrs the airplane reached German airspace. The radio communication recorded by the air traffic service provider showed that the Cessna Citation 750 crew made the initial call to Langen Radar at 1836:54 hrs on frequency 120.575 MHz. At 1839:10 hrs the air traffic controller cleared a descent to Flight Level (FL) 140 after the identification of the airplane. Initially, the crew did not understand the instruction to fly a left turn toward SPESSART NDB and then later toward CHARLIE VOR. The Pilot in Command (PIC) apologized and let the controller know that he did not come here very often. At 1843:58 hrs a descent to 5,000 ft was instructed and the barometric air pressure QNH of 1,025 hPa passed. After \"high speed approved\" given by the controller the Citation 750 was passed on to Frankfurt Approach Control (136.125 MHz). At 1845:00 hrs the PIC made the initial call to Frankfurt Approach Control. He said he was in descent to 5,000 ft and did have the weather for Frankfurt. The controller issued a clearance for a visual approach at night (VFR Night) to Frankfurt-Egelsbach Airfield and asked him to report \"Egelsbach in sight\". The co-pilot acknowledged the clearance and that he would report \"field in sight\". The controller asked for a confirmation by the crew that it was indeed a VFR Night flight. About one minute later the controller asked the pilot if the IFR part had already been cancelled. The copilot answered \"negative\". The controller apologized and said it was his fault and he should continue his flight to CHARLIE. The controller added: “Disregard the VFR Night“. The crew made contact with the destination airport with VHF 2. The Aviation Supervision Office at Frankfurt-Egelsbach told the PIC that he could choose his landing direction. The crew received the information that runway 27 was easier to approach and that YANKEE ZWO was a good approach point. Afterwards the co-pilot said: “ … we’re proceeding direct to Egelsbach and we have just been talking to them we will take runway two seven for four miles final.” The controller advised of the “YANKEE inbound routing”; the pilot acknowledged with the reference that they were not yet flying VFR. The controller's information “ja however you may proceed YANKEE ONE“ was read back by the pilot with “YANKEE ONE“. The read-out of the Cockpit Voice Reorder (CFR) indicates that the crew had entered reporting point ECHO into the Flight Management System (FMS). The crew asked for a descent clearance to 4,000 ft which was granted at 1850:59 hrs. At 1851:36 hrs a descent for 3,000 ft was cleared. The pilot acknowledged the clearance with “…descend three thousand“; the controller answered: “….direct YANKEE ZWO für die zwo sieben“ (direct YANKEE ZWO for the two seven). After a further descent clearance to 2,500 ft, the controller asked at 1853:58 hrs if the pilot could cancel the IFR part. The co-pilot answered \"affirmative\". The controller confirmed the change from IFR to VFR with the time indication of 17:54 UTC. He added that the pilot should continue his descent to 1,500 ft or lower for the VFR Night flight and report airfield in sight. The pilot acknowledged that he would report back once he had the airfield in sight. Afterwards the PIC ordered “Flaps five“ which the co-pilot acknowledged with \"Speed check. Flaps five selected“. According to the radar recording the airplane passed reporting point ECHO at 1854:42 hrs. The airplane passed YANKEE ONE to the south with a distance of 1.2 Nautical Miles (NM). The read-out of the Flight Data Recorder (FDR) data showed the airplane was in 2,800 ft AMSL at that time. The ground speed was about 285 kt with a rate of descent of 600 ft/min. Ten seconds after the PIC said “Okay. Let’s slow it down“ the flaps were set to 15° and the landing gear was extended. At that time the airplane was in about 1,770 ft AMSL with a brief rate of descent of 2,500 ft/min. At 1855:05 hrs the controller reported “…, field now eleven clock position, range six miles.“ The co-pilot answered that he had the airfield in sight after he had gotten the PIC's assurance.  The airplane turned left to a heading of about 265°. At that time the rate of descent was about 600 ft/min and speed decreased further with 1 kt/s. At 18 55:16 hrs the last radio communication with Frankfurt Approach Control was “…. approved to leave any time …\" which the co-pilot acknowledged. The co-pilot established radio contact with the Flugleiter of Egelsbach Airfield where he was asked to report airfield in sight. According to the recorded communication be-tween crew and Frankfurt-Egelsbach Info the runway lighting including the strobe lights were activated. The FDR recorded that at 1855:32 hrs the altitude select of the auto flight system was changed from 1,500 ft to 1,160 ft AMSL. The radar data showed that the on-request reporting point YANKEE TWO was passed at 1855:37 hrs in 1,530 ft AMSL with an airspeed of 175 kt. Based on the determined data the airplane was in about 820 ft AGL. At 1855:56 hrs the preselected altitude was reduced to 580 ft. The co-pilot's comment “….thousand feet above“ answered the PIC with “… and three miles to go only“. At 1856:06 hrs the radio altimeter reported “Five hundred“. The rate of descent was now 1,200 ft/min and increased in the following ten seconds up to 2,500 ft/min. The flaps drove from 15° to 35°. Two seconds after the radio altimeter the Enhanced Ground Proximity Warning System (EGPWS) generated the announcement \"Sink rate, pull up, pull up, pull up, ...\". Seven seconds after the beginning of the EGPWS warning the co-pilot said: “That’s five ….three hundred feet“. At 1856:08 hrs the EGPWS announced \"...sink rate, too low, terrain, sink rate, terrain.\" The PIC asked \"Terrain?\" which the co-pilot answered with \"Terrain!!!\". At that moment an elevator deflection of up to 17° nose up occurred. The pitch increased from -4° to +20° within two seconds. At 1856:22 hrs the airplane collided with trees one second before the airplane reached the maximum pitch. At the time the autopilot was engaged. The engine parameter N1 (engine thrust) remained at 34% for both engines until the end of the recording. In the further course of the accident individual parts of the airplane were torn off by contact with trees. About 430 m after the initial tree contact the airplane impacted the ground. Prior to the impact the airplane had inverted itself. About 25 m prior to the ground impact both wings were torn-off by trees. The accident site was about 3.6 km (1.96 NM) from the threshold of runway 27 of Frankfurt-Egelsbach Airfield. The airplane was destroyed by impact forces and ensuing fire. Both pilots and the three passengers sustained fatal injuries.", "probable_cause": null}