{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-vostochnaya-1-killed", "date": "Mar 23, 2013 at 1503 LT", "type": "PZL-Mielec AN-2", "operator": "Yug Line", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Vostochnaya - Vostochnaya", "msn": "1G234-34", "yom": 1989, "flight_number": null, "city": "Vostochnaya", "zone": "Krasnodar Krai", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5536, "captain_hours_type": 2710, "copilot_hours": 61, "copilot_hours_type": 61, "aircraft_hours": 3612, "circumstances": "The crew was engaged in a crop spraying flight on agricultural field in Vostochnaya, about 70 km northeast of Krasnodar. The day prior to the accident, the engine failed in flight and the crew made a forced landing in a field. As the carburetor was broken, it was replaced and an engine test run was performed. On 23 March, one minute after takeoff, while climbing to a height of 30 metres, the engine failed again. The crew attempted an emergency landing when the aircraft stalled and crashed in the Bakhotinski Lake, coming to rest upside down. The copilot escaped with minor injuries while the captain was killed. The wreckage was recovered three days later.", "probable_cause": "The accident was caused by its nosing during the emergency landing on water surface. The emergency landing was caused by the engine power loss and flameout in the air due to the destruction of the exhaust collector can type combustor and burn through of the carburetor intake valve followed by high temperature burnt gases ingestion into the engine carburetor intake. The destruction of the exhaust collector can type combustor most probably occurred on the corrosion mechanism energized in conditions of the material heat during the engine operation using motor petrol. Power factor resulted in initial crack formation most probably was caused by residual tenses in the material of manufacture origine caused during can type combustor manufacture. In accordance with the passport the latest can type combustor overhaul was performed on January 27, 2009 in \"Shakhtinsky ARZ DOSSAAF\" CJSC. The commission didn't find the actual confirmation of the can type combustor overhaul as the marking at the single remained label indicates that the specified section had overhaul at the plant n° 420GA in October 1983. "}