{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-21-islander-weipa-6-killed", "date": "Mar 21, 1994 at 1754 LT", "type": "Britten-Norman Islander", "operator": "Aurukun Air Services", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Weipa - Aurukun", "msn": "632", "yom": 1971, "flight_number": null, "city": "Weipa", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 321, "captain_hours_type": 6, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the day before the accident, the aircraft flew from Aurukun to Weipa with the chief pilot occupying the left pilot seat and the pilot involved in the accident occupying the right pilot seat. At Weipa the chief pilot left the aircraft, instructing the other pilot to fly some practice circuits before returning the aircraft to Aurukun. Before commencing the circuits and the return flight to Aurukun, the aircraft's two main tanks each contained 100 L of fuel and the two wing tip tanks each contained about 90 L of fuel. On the day of the accident the pilot added 200 L of fuel at Aurukun to the aircraft's tanks and then flew the aircraft and the passengers to Weipa. About 50 minutes before sunset, the aircraft taxied for departure from runway 30 for the 25-minute return flight to Aurukun. When the aircraft was about 300 ft above ground level after takeoff, a witness reported that all engine sounds stopped and that the aircraft attitude changed from a nose-high climb to a more level attitude. A short time later, the noise of engine power surging was heard. The aircraft rolled left and entered a spiral descent. It struck level ground some 350 m beyond the departure end of runway 30 and 175 m to the left of the extended centreline. All six occupants were killed. ", "probable_cause": "Significant factors:\r\n- The pilot mismanaged the aircraft fuel system.\r\n- Both engines suffered a total power loss due to fuel starvation.\r\n- The right engine regained power probably as a result of a change in aircraft attitude.\r\n- The pilot lost control of the aircraft.\r\n- Recovery was not possible in the height available."}