{"url": "https://www.baaa-acro.com/crash/crash-cessna-402-coventry-4-killed", "date": "Aug 17, 2008 at 1136 LT", "type": "Cessna 402", "operator": "RVL%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Calibration", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Coventry - Coventry", "msn": "402-0008", "yom": 1979, "flight_number": null, "city": "Coventry", "zone": "West Midlands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1627, "captain_hours_type": 125, "copilot_hours": 2281, "copilot_hours_type": 339, "aircraft_hours": null, "circumstances": "Cessna 402C aircraft G-EYES was engaged in flight calibration training and was making an ILS approach to Runway 23 at Coventry Airport when it was involved in a mid-air collision with a Rand KR-2 aircraft, G-BOLZ, operating in the visual circuit. The collision occurred in Class G (uncontrolled) airspace. The four occupants of G-EYES and the single occupant of G-BOLZ received fatal injuries. ", "probable_cause": "The investigation identified the following primary causal factor:\r\nThe two aircraft collided because their respective pilots either did not see the other aircraft, or did not see it in time to take effective avoiding action.\r\nThe investigation identified the following contributory factors:\r\n1. The likelihood that the crew of G-EYES would see G-BOLZ in time to carry out effective avoiding action was reduced by the small size of G-BOLZ, its position relative to G-EYES and the high rate of closure between the aircraft.\r\n2. Insufficient or inaccurate information was provided to the pilots, which did not assist them in fulfilling their duty to take all possible measures to avoid collisions with other aircraft.\r\n3. The Aerodrome Controller’s sequencing plan, which was based on an incomplete understanding of the nature of G-EYES’ flight, was unlikely to have been successful. By the time the risk of a collision was identified, it was too late to devise an effective method of resolving the situation.\r\n4. There were no effective measures in place to give G-EYES priority over traffic in the visual circuit"}