{"url": "https://www.baaa-acro.com/crash/crash-short-c-23b-sherpa-unadilla-21-killed", "date": "Mar 3, 2001 at 0955 LT", "type": "Short 330", "operator": "Florida%20Air%20National%20Guard", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Plain, Valley", "schedule": "Hurlburt Field - Oceana", "msn": "3420", "yom": 1985, "flight_number": "PAT528", "city": "Unadilla", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 18, "pax_fatalities": 18, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Sherpa departed Hurlburt Field AFB, Florida, on flight PAT528 to Oceana NAS, Virginia, carrying 18 passengers and a crew of three. While in cruising altitude over Georgia, the crew encountered poor weather conditions with thunderstorm activity, heavy rain falls, severe turbulences, windshear conditions and wind gusting up to 72 knots. The aircraft became unstable, lost 100 feet in three seconds then adopted a nose up attitude. Within the next 12 seconds, the aircraft suffered a positive aerodynamic acceleration then entered an uncontrolled descent, partially disintegrated in the air and eventually crashed in an open field. All 21 occupants were killed. \r\nCrew (171st Aviation Regiment Lakeland):\r\nCW4 Johnny W. Duce, \r\nCW2 Erik P. Larson, \r\nS/Sgt Robert F. Ward Jr.\r\nPassengers (213rd Red Horse Flight, Virginia Beach):\r\nM/Sgt James Beninati, \r\nS/Sgt Paul J. Blancato,\r\nT/Sgt Ernest Blawas,\r\nS/Sgt Andrew H. Bridges,\r\nM/Sgt Eric G. Bulman,\r\nS/Sgt Paul E. Cramer,  \r\nT/Sgt Michael E. East,\r\nS/Sgt Ronald L. Elkin, \r\nS/Sgt James P. Ferguson, \r\nS/Sgt Randy V. Johnson, \r\nSRA Mathrew K. Kidd,\r\nM/Sgt Michael E. Lane, \r\nT/Sgt Edwin B. Richardson, \r\nT/Sgt Dean J. Shelby,\r\nS/Sgt John L. Sincavage, \r\nS/Sgt Gregory T. Skurupey, \r\nS/Sgt Richard L. Summerell, \r\nMaj Frederick V. Watkins III.", "probable_cause": "The Collateral Investigation Board found the preponderance of the evidence concluded that the aircraft accident was due to crew error. The board found other factors present but not contributing directly to this aircraft accident. These factors may have influenced the crew's decision making process and aircraft performance. This is normally the case in most aircraft human factor accidents. The board did find the preponderance of the evidence directed the board toward the crew's failure to properly load the aircraft. In particular, the crew's failure to properly manage the weight and balance of the aircraft resulted in an 'out-of-CG' condition that exceeded the aircraft design limits, rendering the aircraft unstable and leading to a violent departure from controlled flight. Once the aircraft departed controlled flight, the rapid onset of significant G-force shifts rendered the crew and passengers incapacitated and unconscious and led to a structural break-up of the aircraft in flight. This ultimately resulted in the aircraft impacting the ground, killing all on board."}