{"url": "https://www.baaa-acro.com/crash/crash-lockheed-ymc-130h-hercules-wagner-field", "date": "Oct 29, 1980", "type": "Lockheed C-130 Hercules", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Demonstration", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Wagner Field - Wagner Field", "msn": "4658", "yom": 1976, "flight_number": null, "city": "Wagner Field", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "This aircraft was delivered on 17 October to TAB1 at Wagner Field, a disused auxiliary airfield at Eglin Air Force Base, Florida. Between 19 October and 28 October, numerous flights were made testing various aspects, including the double-slotted flaps system, which enabled the C-130 to fly at 85 knots on final approach at a very steep eight-degree glide slope. All aspects worked flawlessly, and a full profile test was scheduled for 29 October. The test's takeoff phase was executed flawlessly, setting a number of short takeoff records. The Lockheed test crew then assessed that the computer used to command the firing of the rockets during the landing sequence needed further calibration, and elected to manually input commands. The reverse-mounted (forward-facing) eight ASROC rockets for decelerating the aircraft's forward speed were situated in pairs on the fuselage's upper curvature behind the cockpit, and at the midpoint of each side of the fuselage beneath the uppers. Testing had determined that the upper pairs, fired sequentially, could be ignited while still airborne (specifically, at 20 feet), but that the lower pairs could only be fired after the aircraft was on the ground, with the descent-braking rockets also firing during the sequence. The flight engineer, blinded by the firing of the upper deceleration rockets, thought the aircraft was on the runway and fired the lower set early. The descent-braking rockets did not fire at all. Later unofficial disclaimers allegedly made by some of the Lockheed test crew's members asserted that the lower rockets fired themselves through an undetermined computer or electrical malfunction, which at the same time failed to fire the descent-braking rockets. As a result, the aircraft's forward flight was immediately reduced to nearly zero, dropping it hard to the runway and breaking the starboard wing between the third and fourth engines. During rollout, the trailing wing ignited a fire, but a medical evacuation helicopter dispersed the flame and crash response teams extinguished the fire within eight seconds of the aircraft stopping, enabling the crew to exit the aircraft safely. 74-1683 was dismantled and buried on-site for security reasons, but most of its unique systems were salvaged.", "probable_cause": null}