{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-h18-morganton-1-killed", "date": "Feb 26, 1992 at 0826 LT", "type": "Beechcraft H18", "operator": "Piedmont%20Air%20Cargo", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Charlotte - Morganton", "msn": "BA-654", "yom": 1963, "flight_number": null, "city": "Morganton", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10000, "captain_hours_type": 3000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13506, "circumstances": "The commercial pilot was on a part 135 cargo flight. Since the destination airport had no weather reporting facility, company policy and far 135 required a VFR descent and landing from the MVA. The pilot requested and received clearance for a localizer approach to the airport, although a nearby airport was reporting 400' broken/3 miles with fog. The pilot reported to ATC that he had missed his first approach, and requested a second approach to the same airport. After executing the missed approach, the aircraft impacted mountainous terrain while aligned with the extended centerline of the localizer. Cap personnel reported that the accident site was obscured in clouds at the time of the accident. The investigation revealed that the aircraft descended about 1,500 feet below a minimum altitude on the first approach attempt. Mode c altitude data was lost during the missed approach. Four years earlier, this pilot descended below glidepath on an ILS approach and crashed into trees with weather below approach minimums. The pilot, sole on board, was killed. ", "probable_cause": "The failure of the pilot to follow far and company procedures, and his failure to maintain proper altitude during the approach. Factors were the mountainous terrain conditions, and the foggy, low ceiling weather conditions existing at the time of the accident."}