{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-mt-balmfluechopfli-1-killed", "date": "Oct 24, 1993 at 1440 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Mountains", "schedule": "Cannes - Grenchen", "msn": "46-08132", "yom": 1988, "flight_number": null, "city": "Mt Balmfluechöpfli", "zone": "Solothurn", "country": "Switzerland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1181, "captain_hours_type": 440, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 922, "circumstances": "After passing over the Alps and a layer of stratus over the Plateau, the pilot reached the Willisau VOR where he was cleared to initiate an IFR approach to Grenchen Airport runway 25. He completed a standard turn then followed the 290° radial instead of the published 280° radial. When the DME system indicated 7 NM, the pilot realized he was too far from the normal approach track, disengaged the automatic pilot system and elected to gain altitude. In a flaps down/gear down configuration, the aircraft failed to gain sufficient height and struck, in poor visibility due to thick fog, the wooded slope of Mt Balmfluechöpfli (1,289 metres high) located about 12 km northeast of Grenchen Airport. The aircraft disintegrated on impact and the pilot was killed. The female passenger, slightly injured as she was seating in the seat opposite to the direction of flight, was able to walk away to ask for help. ", "probable_cause": "The accident was the consequence of the following factors: \r\n- Selection of the radial 290° and engagement thereon instead of the published 280° radial,\r\n- Inappropriate NAV setting,\r\n- Too late and inconsistent throttle reset,\r\n- Difficult IFR approach procedure without radar monitoring of the followed route,\r\n- Too high speed on approach."}