{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-hampton", "date": "May 9, 2020 at 1513 LT", "type": "Cessna 402", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Peachtree City - Peachtree City", "msn": "402C-0019", "yom": 1979, "flight_number": null, "city": "Hampton-Henry County", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7330, "captain_hours_type": 11, "copilot_hours": 1096, "copilot_hours_type": 5, "aircraft_hours": 17081, "circumstances": "According the commercial pilot and a flight instructor rated check pilot, they were conducting their first long-duration, aerial observation flight in the multiengine airplane, which was recently acquired by the operator. They departed with full fuel tanks, competed the 5-hour aerial observation portion of the flight, and began to return to the destination airport. About 15 miles from the airport, the left engine fuel warning light illuminated. Within a few seconds, the right engine stopped producing power. They attempted to restart the engine and turned the airplane toward an alternate airport that was closer. The pilots then turned on the electric fuel pump, the right engine began surging, and soon after the left engine stopped producing power. They turned both electric fuel pumps to the low setting, both engines continued to surge, and the pilots continued toward the alternate airport. When they were about 3 miles from the airport, both engines lost total power, and they elected to land on a highway. When they were a few feet above the ground, power returned briefly to the left engine, which resulted in the airplane climbing and beginning to roll. The commercial pilot pulled the yoke aft to avoid a highway sign, which resulted in an aerodynamic stall, and subsequent impact with trees and terrain. The airplane sustained substantial damage to the wings and fuselage. Although both pilots reported the fuel gauges indicated 20 gallons of fuel remaining on each side when the engines stopped producing power, the flight instructor noted that there was no fuel in the airplane at the time of the accident. In addition, according to a Federal Aviation Administration inspector who responded to the accident site, both fuel tanks were breached and there was no evidence of fuel spillage.", "probable_cause": "A dual total loss of engine power as a result of fuel exhaustion."}