{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-hampton-roads-4-killed", "date": "Oct 10, 2013 at 1209 LT", "type": "Cessna 340", "operator": "Stephen George", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Lauderdale – Hampton Roads", "msn": "340A-0777", "yom": 1979, "flight_number": null, "city": "Hampton Roads-Executive", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The instrument-rated pilot was on a cross-country flight. According to air traffic control records, an air traffic controller provided the pilot vectors to an intersection to fly a GPS approach. Federal Aviation Administration radar data showed that the airplane tracked off course of the assigned intersection by 6 nautical miles and descended 800 ft below its assigned altitude before correcting toward the initial approach fix. The airplane then crossed the final approach fix 400 ft below the minimum crossing altitude and then continued to descend to the minimum descent altitude, at which point, the pilot performed a missed approach. The missed approach procedure would have required the airplane to make a climbing right turn to 2,500 ft mean sea level (msl) while navigating southwest back to the intersection; however, radar data showed that the airplane flew southeast and ascended and descended several times before leveling off at 2,800 ft msl. The airplane then entered a right 360-degree turn and almost completed another circle before it descended into terrain. Examination of the wreckage revealed no evidence of any preimpact mechanical malfunctions or failures. During the altitude and heading deviations just before impact, the pilot reported to an air traffic controller that adverse weather was causing the airplane to lose \"tremendous\" amounts of altitude; however, weather radar did not indicate any convective activity or heavy rain at the airplane's location. The recorded weather at the destination airport about the time of the accident included a cloud ceiling of 400 ft above ground level and visibility of 3 miles. Although the pilot reported over 4,000 total hours on his most recent medical  application, the investigation could not corroborate those reported hours or document any recent or overall actual instrument experience. In addition, it could not be determined whether the pilot had experience using the onboard GPS system, which had been installed on the airplane about 6 months before the accident; however, the accident flight track is indicative of the pilot not using the GPS effectively, possibly due to a lack of proficiency or familiarity with the equipment. The restricted visibility and precipitation and maneuvering during the missed approach would have been conducive to the development of spatial disorientation, and the variable flightpath off the intended course was consistent with the pilot losing airplane control due to spatial disorientation. Toxicological tests detected ethanol and other volatiles in the pilot's muscle indicative of postmortem production.", "probable_cause": "The pilot's failure to maintain airplane control due to spatial disorientation in low-visibility conditions while maneuvering during a missed approach. Contributing to the accident was the pilot's ineffective use of the onboard GPS equipment."}