{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-200-madrid-51-killed", "date": "Dec 7, 1983 at 0939 LT", "type": "Boeing 727-200", "operator": "Iberia-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Madrid - Rome", "msn": "20820", "yom": 1974, "flight_number": "IB350", "city": "Madrid-Barajas", "zone": "Madrid", "country": "Spain", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 1, "pax_on_board": 84, "pax_fatalities": 50, "other_fatalities": 0, "total_fatalities": 51, "captain_hours": 8860, "captain_hours_type": 1919, "copilot_hours": 3474, "copilot_hours_type": 2840, "aircraft_hours": 21525, "circumstances": "Boeing 727-256 EC-CFJ of Iberia, operating scheduled flight IB350 to Rome, and DC-9-32 EC-CGS of Aviaco, operating schedule AO134 to Santander, crashed on runway 01/19 at Madrid-Barajas Airport. The Boeing 727 had been cleared for takeoff on runway 01 and was at V1 speed. The DC-9 had been cleared to proceed to the holding point at runway 01 through the outer taxiway. The accident occurred approximately at 09h39:29 on December 7, 1983. As a result of the impact and instant fire, the DC-9 aircraft was totally destroyed, dying the whole of its occupants, 5 crew members and 37 passengers. The Boeing 727 aircraft lost almost all of its left wing and main gear of the same side, sliding on the runway about 460 meters, until its final stop, remaining facing the opposite direction of takeoff, on the left edge of runway 01. As a result of the impact and of the spilling of fuel from the left wing, there was an almost instant fire at the time o the crash, which subsequently destroyed the aircraft. 34 passengers and 8 crew members out of the 84 passengers and 9 crew members, survived. 50 passengers and one assistance crew member died as a result of the impact and fire. The conditions of visibility at the airport were of daylight and intense fog.", "probable_cause": "The cause of the accident was the unknown incursion of the DC-9 on the runway 01/19 when the Boeing 727 was on takeoff roll. The DC-9 was on the active runway because visibility conditions due to fog, by the zone where the aircraft was taxiing, impeded to the crew obtain sufficient visual references, to determine that, that was not the correct run that they should realize to reach the threshold of runway 01."}