{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-28-ayan-16-killed", "date": "Aug 29, 2002 at 1856 LT", "type": "PZL-Mielec AN-28", "operator": "Vostok%20Aviakompania", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Khabarovsk – Poliny Osipenko – Ayan", "msn": "1AJ008-19", "yom": 1990, "flight_number": "VTK359", "city": "Ayan", "zone": "Khabarovsk Krai", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 14, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was completing a flight from Khabarovsk to Ayan with an intermediate stop in Poliny Osipenko, carrying 14 passengers and two pilots. Before takeoff from Poliny Osipenko, the crew was informed about weather conditions at Ayan with a visibility up to 5 km. But while approaching the destination, the crew realized that weather conditions deteriorated rapidly with poor visibility due to low stratus and fog. The crew initiated the descent prematurely and after the first turn, the aircraft was already at an insufficient altitude of 800 metres instead of the required 950 metres. At a speed of 283 km/h, the aircraft descended too low and deviated to the right of the approach pattern by 2,3 km when it entered an area of low stratus at an altitude of 320 metres. In a visibility reduced to 50 metres, the crew lost visual contact with the ground but the captain decided to continue the approach. At a height of 188 metres, the aircraft impacted a hill (226 metres high) located near the shore of the Okhotsk Sea. The aircraft was destroyed by impact forces and a post crash fire and all 16 occupants were killed.   ", "probable_cause": "Controlled flight into terrain following after the crew initiated the descent prematurely and failed to follow the published procedures. The following contributing factors were identified:\r\n- The approach was continued in below minima weather conditions, \r\n- Failure of the crew to get a current weather report for Ayan and the alternate airport,\r\n- The decision of the captain to continue the approach at decision height without any visual contact with the ground and his failure to initiate a go-around procedure, \r\n- Failure of the crew to follow the established approach pattern,\r\n- Failure of the meteorological observer to issue updated weather bulletin, \r\n- Absence of radio navigational aids at Ayan Airport,\r\n- Lack of interaction between ATC and meteorological observer at Ayan Airport when aircraft are approaching in adverse weather conditions."}