{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-131f-huete-17-killed", "date": "May 9, 1976 at 1535 LT", "type": "Boeing 747-100", "operator": "IIAF", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Plain, Valley", "schedule": "Tehran - Madrid - McGuire", "msn": "19677/73", "yom": 1970, "flight_number": "ULF48", "city": "Huete", "zone": "Castile-La Mancha", "country": "Spain", "region": "Europe", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 17, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane was completing a military logistic flight from Tehran to McGuire AFB via Madrid, carrying Iranian and US officers. The flight took off from Tehran at 08:20 GMT and climbed to a cruising altitude of FL330. After establishing contact with Madrid control, clearance was received to CPL VOR via Castejon. At 14:25 the flight was cleared to FL100. At 14:30 the crew advised Madrid that they were diverting to the left because of thunderstorm activity, and at 14:32 Madrid cleared ULF48 to 5,000 feet and directed him to contact Madrid approach control. At 14:33 the crew contacted approach control and advised them that there was too much weather activity ahead and requested to be vectored around it. Last radio contact was when ULF48 acknowledged the 260° heading instructions and informed Madrid that they were descending to 5,000 feet. The aircraft was later found to have crashed in farmland at 3,000 feet msl following left wing separation. The aircraft was totally destroyed and all 17 occupants have been killed. ", "probable_cause": "After analyzing all of the available evidence, it is concluded that the most probable sequence of events which culminated with multiple structural failures and separation of the wing began with an ignition of the fuel vapors in the n°1 fuel tank. The damage to the structure in the area of the tank provided positive indications of an explosion. The possibility that the explosion was a secondary result of structural failure caused by excessive aerodynamics forces developed during high velocity gusts and turbulence cannot be completely dismissed; however, the evidence and the probabilities of an aircraft's encountering these unique environmental conditions make this hypothesis less supportable. "}