{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-e-el-embrujo-9-killed", "date": "Mar 26, 2005 at 0951 LT", "type": "Let L-410", "operator": "West%20Caribbean%20Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "El Embrujo – San Andrés", "msn": "90 24 26", "yom": 1990, "flight_number": "YH9955", "city": "El Embrujo (Providencia Island)", "zone": "San Andrés, Providencia & Santa Catalina", "country": "Colombia", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 12, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 6038, "captain_hours_type": 145, "copilot_hours": 868, "copilot_hours_type": 653, "aircraft_hours": 6901, "circumstances": "The crew already completed four round trips the same morning on the same routing. During the takeoff roll from runway 35 at El Embrujo Airport, around V1 speed, the left engine speed. The crew continued the takeoff procedure while the speed dropped. Shortly after rotation, the aircraft rolled to the right to an angle of 135° then entered an uncontrolled descent and crashed in a wooded area located 117 metres past the runway end. Both pilots and seven passengers were killed while five others passengers were injured. ", "probable_cause": "The non-observance of the procedures described for an engine failure after V1, especially those relating to the maintenance of safe takeoff speed of 84 knots, the retraction of the flaps, automatic operation of the landing gear lever and the use of contingency power. The erroneous operation of the fuel-flow-control lever (FCL) of engine number one, the move from the open to the closed position during the chain of events, which left the plane and the inappropriate use of the fuel-flow-control lever (FCL) of engine number two, to bring it to the MAX NG position in an attempt to obtain performance of the engine. Maintaining an attitude of the plane on take-off after nr. 2 engine failure with the consequent reduction of speed and then maintaining the aircraft in a climbing attitude, after an engine shutdown, which came at stall speed and the subsequent lack of control of the aircraft. The failure of the engine for undetermined reasons during the takeoff roll, after V1, which forced the crew to perform a series of emergency procedures to deal with the fault and continue with the initial climb. The absence or failure of resource management among flight crew members during the sequence of events. The unmeasurable reduction in the situational awareness of the crew as a result of the financial situation of the company and the divorce in which the Captain of the aircraft was involved."}