{"url": "https://www.baaa-acro.com/crash/crash-consolidated-b-24-liberator-vi-near-amarda-road-8-killed", "date": "Jul 26, 1945 at 0945 LT", "type": "Consolidated B-24 Liberator", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Amarda Road - Amarda Road", "msn": null, "yom": null, "flight_number": null, "city": "Amarda Road AFB", "zone": "Odisha (Orissa)", "country": "India", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 0915LT, six Liberators of AFTU took off from Amarda Rd Airfield to carry out a navigational exercise in formation. At approximately 0945LT, the formation, which had been encountering medium to bad weather, approached a heavy bank of cloud. The leader, S/Ldr Heynert, commenced to lose height in an attempt to fly underneath this, but reached the cloud before he was quite low enough and the formation entered the cloud. Number 6 by this time was some little way behind the formation. On entering the cloud visibility was reduced to nil and numbers 2 and 5 in the formation altered course starboard and number 4 altered course port. On coming out of the cloud aircraft number 1 (EW225) and aircraft number 3 (EW247) captained by PO Herbert, were seen to be in close proximity, and number 3 was then seen to pull up and collide with number 1. The tail unit of number 1 was torn off and the aircraft crashed out of control, and one wing (which one not established) of number 3 was torn off, causing the aircraft to crash.\nCrew:\nS/Ldr Félicité Pierre André Heynert, pilot,\nP/O Raymond Maurice Bullen, pilot,\nF/O Robert Stanley Manson, wireless operator and air gunner, \nF/Lt Alexander Norman Borrow, navigator and bomb aimer, \nP/O Lewis Arnold Bridgman, wireless operator and air gunner,\nF/O Peter Ettlinger, flight engineer, \nF/Lt Sydney Wilfred Wells, navigator and bomb aimer, \nF/Sgt Walter Reginald George Wood, air bomber.\nSource: http://www.rquirk.com/amarda/26July45storyV6eb.pdf", "probable_cause": null}