{"url": "https://www.baaa-acro.com/crash/crash-short-sc7-skyvan-3-variant-100-mystic-lake-lodge-1-killed", "date": "Sep 20, 2007 at 1430 LT", "type": "Short SC.7 Skyvan Variant", "operator": "Arctic%20Circle%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Mystic Lake Lodge - Anchorage", "msn": "SH1963", "yom": 1978, "flight_number": null, "city": "Mystic Lake Lodge", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 15000, "captain_hours_type": 2600, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10730, "circumstances": "The airline transport pilot was departing in a twin engine turboprop airplane on a ferry flight from a remote lodge airstrip that was about 1,000 feet long and 40 feet wide. The airplane had previously received substantial damage to the nose wheel assembly on a previous flight to the airstrip. Repairs were made to the airframe, and the pilot was departing for a maintenance facility. The pilot had flown in and out of the airstrip on numerous occasions, but not in the accident type airplane. The lodge owner reported that the pilot started both engines and taxied the length of the airstrip, stopping momentarily several times. The pilot ran the engines for about 20 minutes, and then began a takeoff to the south. The airplane appeared to accelerate and remain on the centerline of the airstrip, but did not liftoff until the very end of the airstrip. The owner did not notice any unusual sounds or appearance of the engines. After liftoff, the wheels of the airplane struck and broke off the tops of trees and shrubs, that were about 6 to 7 feet above the ground. The airplane immediately veered to the right, and went out of the lodge owner's sight, but he continued to hear the airplane hitting trees until final impact. The airplane crashed in a shallow lake, coming to rest about 300 feet from shore, in about 5 feet of water. The entire cockpit area, forward of the wings, was torn off the airframe. The validity of any postaccident cockpit and instrument findings was unreliable due to the extensive damage to the cockpit. Likewise, structural damage to the airframe precluded determining wing flap settings during takeoff. Performance calculations indicated that the airplane's takeoff distance would have been about 950 feet, although the lodge owner said that in his experience, the accident airplane was capable of lifting off about half way down the airstrip without difficulty. The circumstances of the takeoff indicated that the left engine had been producing sufficient power to chop through several trees during the crash. Testing and inspection of the right engine was inconclusive, and although it was run on a test stand at reduced power, full power could not be attained due to ingestion of foreign material during the test run.", "probable_cause": "A collision with trees during takeoff-initial climb for an undetermined reason."}