{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-berkovici-9-killed", "date": "Feb 26, 2004 at 0745 LT", "type": "Beechcraft 200 Super King Air", "operator": "Macedonian Government", "flight_phase": "Landing (descent or approach)", "flight_type": "Government", "survivors": "No", "site": "Mountains", "schedule": "Skopje – Mostar", "msn": "BB-652", "yom": 1980, "flight_number": null, "city": "Berkovići", "zone": "Republika Srpska", "country": "Bosnia and Herzegovina", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Skopje on an official flight to Mostar, carrying two pilots and seven passengers, among them Boris Trajkovski, President of the Republic of Macedonia. He was flying to Mostar with members of his government to take part to an economic conference. On approach by night and limited visibility due to marginal weather conditions, the aircraft struck the slope of a mountain located near Berkovići, about 32 km southeast of the airport. The aircraft was destroyed by impact forces and a post crash fire and all nine occupants were killed. ", "probable_cause": "The accident was the consequence of a controlled flight into terrain after the crew initiated the approach prematurely. The following contributing factors were identified:\r\n- Poor approach and landing preparation and planning, \r\n- The crew ignored ATC information about the current meteorological situation at Mostar Airport,\r\n- The crew misinterpreted the Final Approach Fix (FAF) with the Intermediate Approach Fix (IAF), causing the aircraft to start the descent prematurely,\r\n- The crew disengaged the autopilot system during the approach while descending in complex meteorological conditions, \r\n- Poor crew resources management, \r\n- Lack of crew communication, \r\n- The crew failed to comply with SOP's, \r\n- Failure of the pilot-in-command to maintain flight level when the aircraft reached the MDA and failure of the second pilot to give adequate assistance."}