{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-749-constellation-near-khartoum", "date": "Jul 10, 1957 at 0920 LT", "type": "Lockheed L-749 Constellation", "operator": "Ethiopian%20Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Desert", "schedule": "London – Athens – Khartoum – Addis Ababa", "msn": "2608", "yom": 1949, "flight_number": "ET003", "city": "Khartoum", "zone": "Khartoum (الخرطوم)", "country": "Sudan", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 14, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft left Khartoum International Aerodrome at 0555 hours GMT on 10 July carrying a crew of 6 and 14 passengers and was cleared to cruise at 17 500 feet. At 0610 hours, at about 10 500 feet altitude, the number two engine fire warning light for zones 2 and 3 came on and the warning bell rang. The engine was feathered. The CO2 bottle was released and concurrently an explosion followed by a violent fire, made it necessary (at approximately 0620) to land the aircraft with gear up on a large flat cultivated area. There were no injuries to passengers or crew, but the aircraft was almost totally destroyed by fire which continued burning on the ground. ", "probable_cause": "This accident was due to the overheating of one of the brakes of the main landing gear during the aircraft's taxiing and take-off run. It was caused by a dragging brake and a leakage of hydraulic oil with resultant fire and tire blow out. The tire blow out resulted in damage to hydraulic oil and fuel lines within the confined area of No. 2 engine nacelle, between the rear of the engine fire wall and rear spar, and between the fuselage and left side of the landing gear wheel well doors."}