{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-4-alexandria", "date": "Oct 11, 1946 at 2325 LT", "type": "Douglas C-54 Skymaster", "operator": "Eastern-Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Miami – Tampa – Atlanta – Washington DC – Newark", "msn": "18396", "yom": 1944, "flight_number": "EA564", "city": "Alexandria", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 22, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11065, "captain_hours_type": 1227, "copilot_hours": 3032, "copilot_hours_type": 79, "aircraft_hours": 2045, "circumstances": "The four engine aircraft left Atlanta Airport at 2027LT bound for Newark with an intermediate stop in Washington-National Airport. While flying on airway Green 6 at an altitude of 7,000 feet, the crew was informed by ATC that a landing in Washington was not possible due to poor weather conditions and that he should proceed direct to Newark. Two hours later, the crew received new instructions from ATC: as weather conditions improved in Washington, a landing was therefore possible. The crew modified his route and started the descent to the National Airport. Due to low visibility, the first attempt to land was abandoned and the crew completed a go around. On the second approach, while at a height of 200 feet, the aircraft hit the slope of a small hill, bounced, snatched two telephone poles and crashed in flames near Alexandria, about 6 miles southwest of the airport. Quickly on the scene, the rescue teams were able to evacuate all 26 occupants, some of them injured, while the aircraft was destroyed by a post crash fire. ", "probable_cause": "The Board finds that the probable cause of this accident was the failure of the pilot to maintain flight at or above the minimum safe altitude for an instrument approach to Washington-National Airport."}