{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-340-32-chicago-22-killed", "date": "Jul 17, 1955 at 0624 LT", "type": "Convair CV-340", "operator": "Braniff-International-Airways-1", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dallas – Oklahoma City – Wichita – Kansas City – Chicago", "msn": "71", "yom": 1953, "flight_number": "BN560", "city": "Chicago-Midway", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 2, "pax_on_board": 38, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 22, "captain_hours": 15121, "captain_hours_type": 1281, "copilot_hours": 9040, "copilot_hours_type": 1989, "aircraft_hours": 4956, "circumstances": "Flight 560 is a Braniff daily scheduled flight between Dallas, Texas, and Chicago, Illinois, with intermediate stops at Oklahoma City, Oklahoma; Wichita, Kansas; and Kansas City, Missouri. On July 17 the flight crew, assigned at Dallas for the entire trip, consisted of Captain Allen R. Tobin. First Officer Orbin W. Hanks, and Hostess Mary E. Teel. Captain Tobin and First Officer Hanks arrived at the airport more than an hour before the scheduled departure. During this time preflight preparations were made in a normal and routine manner. The pilots were briefed and furnished the latest weather forecasts and reports over the route and for the scheduled stops. No weather conditions of consequence were indicated except that fog was forecast for the Chicago area, and the visibility was expected to be restricted to possibly one-half mile, on arrival. Flight 560 departed Dallas on schedule at 0100. The flight segments between Dallas and Wichita were uneventful; however, while starting the No. 1 (left) engine at Wichita prior to departure a small carburetor intake manifold fire occurred which was immediately extinguished. There was no damage incurred and the engine started easily on the second attempt. The flight proceeded to Kansas City where it landed at 0416. As the aircraft taxied to the terminal several persons noted that the No. 1 propeller was feathered and stopped. Captain Tobin told Braniff personnel that it feathered while being returned to positive pitch after reverse thrust had been used during the landing roll deceleration. The captain unfeathered the propeller before deplaning and maintenance personnel checked it for malfunction; none was indicated. No other mechanical service was requested or performed. The aircraft was serviced to 1,000 gallons of fuel while Captain Tobin and First Officer Hanks received supplemental weather information and completed other preparations for the last segment of the route to Chicago. Flight 560 departed Kansas City at 0435 in accordance with a VFR (Visual Flight Rules) flight plan. The aircraft, according to company records, was loaded to a gross weight of 45,622 pounds. This amount was less than the maximum allowable of 47,000 pounds and the load was properly distributed with respect to the center of gravity limitations. The flight climbed to 15,000 feet m. s. l. (mean sea level. At 0519 it requested and received an IFR (Instrument Flight Rules) flight plan for the remainder of the trip; accordingly, routine en route reports were made. This segment, as well as the previous, was described as very pleasant, smooth, and conducted primarily above or clear of the clouds. At 0547 ARTC cleared the flight as follows: “ATC clears Braniff 560 to the Naperville Omni via Peoria, Victor 116 over Joliet, maintain at least l,000 on top, tops reported 2,000 m. s. l., contact Chicago Center on 118.9 mc. passing Peoria.” This clearance was acknowledged and the flight reported accordingly. At 0556 Chicago ARTC broadcast a Chicago special weather observation which was: “Thin obscuration, visibility one-half mile.” At approximately 0609 the flight was asked by ARTC if it could land with one-half mile visibility and 1,000 feet thin obscuration. Braniff 560 replied that it could. At 0611 the flight reported over Joliet, 1,000 on top, whereupon ARTC advised it to contact the Chicago Midway Approach Control. Immediate contact was made and the flight was given the same weather and the latest altimeter information. The crew reported at 0618 over Naperville and was radar vectored by Approach Control to the outer marker for an ILS (Instrument Landing System) approach to runway 13R for landing. At 0624 the aircraft hit the sign and crashed through the airport boundary fence onto the airport. Another flight, holding off the runway before takeoff saw the wreckage stop and immediately notified the tower; crash emergency procedures were promptly initiated. The weather conditions reported at the time of the accident were: Partial obscuration; visibility one-half mile, fog, and smoke; sea level pressure 1014.2; temperature 71, dewpoint 68; wind south 6; altimeter 29.94; remarks, fog 8.", "probable_cause": "The Board determines that the probable cause of this accident was momentary disorientation caused by the lose of visual reference during the final visual phase of the approach resulting in an increased rate of descent at an altitude too low to effect recovery. The following findings were reported: \r\n- The reported weather conditions at Chicago permitted the flight to land and were accurately reported from the observer's position,\r\n- The navigational aids, the ILS components, and ground lighting facilities were functioning normally,\r\n- An ILS approach was made to runway 13R and was executed precisely and accurately until one-half mile from touchdown,\r\n- Radar advisories were furnished in a normal manner supplementing the ILS approach,\r\n- After approximately one-half mile from touchdown the aircraft descended at a high rate,\r\n- The aircraft struck an advertising sign and its supporting steel post located 1,000 feet short of the runway threshold,\r\n- Fog, with near zero flight visibility, enveloped the crash site over an indeterminable area,\r\n- Examination of the aircraft wreckage and its components revealed no evidence indicating malfunction or failure and there was no evidence of an emergency aboard the flight."}