{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-north-palm-beach", "date": "Oct 8, 2020 at 1115 LT", "type": "Cessna 414 Chancellor", "operator": "Sierra AE", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "North Palm Beach - Claxton", "msn": "414-0032", "yom": 1969, "flight_number": null, "city": "North Palm Beach County", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1987, "captain_hours_type": 897, "copilot_hours": 149, "copilot_hours_type": 5, "aircraft_hours": 6377, "circumstances": "The copilot, who was seated in the right seat, reported that after an uneventful run-up and taxi, the pilot, who was seated in the left seat, initiated the takeoff. The airplane remained on the runway past the point at which takeoff should have occurred and the copilot observed the pilot attempting to pull back on the control yoke but it would not move. The copilot then also attempted to pull back on the control yoke but was also unsuccessful. Observing that the end of the runway was nearing, the copilot aborted the takeoff by reducing the throttle to idle and applying maximum braking. The airplane overran the runway into rough and marshy terrain, where it came to rest partially submerged in water. Postaccident examination of the airplane and flight controls found no evidence of preimpact mechanical malfunctions or failures that would have precluded normal operation. Specifically, examination of the elevator flight control rigging, in addition to functional checks of the elevator, confirmed continuity and normal function. Additionally, the flight control lock was found on the floor near the rudder pedals on the left side of the cockpit. Due to a head injury sustained during the accident, the pilot was unable to recall most of the events that transpired during the accident. The pilot did state that he typically removed the control lock during the preflight inspection and that he would place it in his flight bag. He thought that a shoulder injury may have led to the control lock missing the flight bag, and why it was found behind the rudder pedals after the accident. Review and analysis of a video that captured the airplane during its taxi to the runway showed that the elevator control position was similar to what it would be with the control lock installed. While the pilot and copilot reported that they did not observe the control lock installed during the takeoff, the position of the elevator observed on the video, the successful postaccident functional test of elevator, and the unsecured flight control lock being located behind the pilot’s rudder pedals after the accident suggest that the control anomaly experienced by the pilots may have been a result of the control lock remaining inadvertently installed and overlooked by both pilots prior to the takeoff. According to the airframe manufacturer’s preflight and before takeoff checklists, the flight control lock must be removed during preflight, prior to engine start and taxi, and the flight controls must be checked prior to takeoff. Regardless of why the elevator control would not move during the takeoff, a positive flight control check prior to the takeoff should have detected any such anomaly. It is likely that the pilot failed to conduct a flight control check prior to takeoff. Further, the pilot failed to abort the takeoff at the first indication that there was a problem. Although delayed, the copilot’s decision to take control of the airplane and abort the takeoff likely mitigated the potential for more severe injury to the occupants and damage to the airplane.", "probable_cause": "The pilot’s inadequate preflight inspection during which he failed to detect a flight control abnormality, and his failure to expediently abort the takeoff, which resulted in the co-pilot performing a delayed aborted takeoff and the subsequent runway overrun."}