{"url": "https://www.baaa-acro.com/crash/crash-fairchild-hiller-fh-227b-near-leoncel-22-killed", "date": "Apr 10, 1989 at 2107 LT", "type": "Fairchild-Hiller FH-227", "operator": "Uni-Air%20International", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Paris - Valence", "msn": "532", "yom": 1967, "flight_number": "UAR5602", "city": "Léoncel", "zone": "Drôme", "country": "France", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 19, "pax_fatalities": 19, "other_fatalities": 0, "total_fatalities": 22, "captain_hours": 8970, "captain_hours_type": 577, "copilot_hours": 15639, "copilot_hours_type": null, "aircraft_hours": 27249, "circumstances": "Following an uneventful flight from Paris-Orly, the crew was cleared to descend to FL070 at 2049LT then to FL060 at 2055LT. Then the crew was instructed to turn right to 178° to the VOR of Vienne but after passing VNE VOR, he followed a wrong track off 155°. At 2058LT, the crew was transferred from Lyon-Satolas Approach to Valence Approach with whom the radio contact was established 30 seconds later. The crew was cleared to descend to 3,500 feet for a specified arrival route Vienne - Valence. A right turn to 200° was initiated when, at a speed of 187 knots, the aircraft struck the vertical cliff of 'Pierre Chauve' (1,260 meters high) located near Léoncel. The aircraft disintegrated on impact and all 22 occupants were killed. ", "probable_cause": "The accident is the direct result of a navigational error. This error had the direct causes:\r\n- The display and use the VOR LSA (Lyon-Satolas) instead of VNE (Vienne),\r\n- An insufficiency in the mental representation of the path of the aircraft despite other available information.\r\nMoreover, the lack of rigor in the division of work in their execution and in the mutual control are contributing factors.\r\nThe Committee also noted that the following facts have facilitated the development of a critical situation:\r\n- Documentation of the crew used for navigation and organization of the dashboard of the plane could be sources of error,\r\n- The organization of the airspace in the region of Valence did not allow optimal use of existing radar,\r\n- The tasks of the crew were not defined by the operator,\r\n- The copilot had a moderate but significant blood alcohol level."}