{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-31-chicago-10-killed", "date": "Dec 20, 1972 at 1800 LT", "type": "Douglas DC-9", "operator": "North%20Central%20Airlines-2_0", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago – Madison – Duluth", "msn": "47159", "yom": 1967, "flight_number": "NC575", "city": "Chicago-O'Hare", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 41, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 20261, "captain_hours_type": 3455, "copilot_hours": 4537, "copilot_hours_type": 1601, "aircraft_hours": 11812, "circumstances": "The crew was cleared to takeoff from runway 27L. During the takeoff roll completed by night and a visibility limited to 250 feet due to fog, the captain called for rotation and the copilot, the pilot-in-command, started the rotation when one of the wing struck the tail of a Delta Airlines Convair CV-880. Registered N8807E, the Convair just landed at O'Hare Airport on flight DL954 from Tampa and its crew was cleared to cross runway 27L to roll to the gate. The collision caused the tail of the Convair to be torn off. Out of control, the DC-9 landed back onto the runway then veered off and came to rest in flames. The Convair was damaged beyond repair and the DC-9 was destroyed by a post crash fire. While 10 people on board the Convair were injured, 10 passengers on board the DC-9 were killed and 35 others were injured, some of them seriously. ", "probable_cause": "Failure of the air traffic control system to ensure separation of aircraft during a period of restricted visibility. This failure included the following: \r\n- The controller omitted a critical word which made his transmission to the flight crew of the Delta CV-880 ambiguous,\r\n- The controller did not use all the available information to determine the location of the CV-880,\r\n- The CV-880 flight crew did not request clarification of the controller's communications."}