{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690a-anchorage-3-killed", "date": "Jul 28, 2006 at 2037 LT", "type": "Rockwell Grand Commander 690", "operator": "Commander Northwest", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Kenai - Anchorage", "msn": "690-11120", "yom": 1973, "flight_number": null, "city": "Anchorage", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4600, "captain_hours_type": null, "copilot_hours": 9200, "copilot_hours_type": null, "aircraft_hours": 11340, "circumstances": "The crew of the missing airplane was conducting a local area familiarization flight under Title 14, CFR Part 91. At the time of the flight, visual meteorological  conditions prevailed, with occasional moderate turbulence forecast for the area. The airplane was routinely contracted for animal and bird counts, and the flight was to include low level flight simulating such a mission. The three occupants of the airplane were the pilot, company check pilot, and another company pilot riding along as a passenger. Both the pilot and the check pilot held airline transport certificates, and were experienced in the make and model of the accident airplane. The airplane was equipped with a satellite position reporting device that updated position, groundspeed, and altitude every 2 minutes. Radar and GPS track information indicated the accident airplane was flying low and slow along a peninsula coast over a saltwater inlet, and turned toward the center of the inlet. The track stopped about 3 miles offshore. The data indicated that while flying along the inlet, the airplane descended to 112 feet above ground level (water), and climbed as high as 495 feet, which was the airplane's altitude at the last data point. The airplane's groundspeed varied between 97 and 111 knots. The area of the presumed crash site experiences extreme tides and strong currents, with reduced visibility due to a high glacial silt content. An extensive search was conducted, but the airplane and its occupants have not been located. An examination of the airplane's maintenance logs did not disclose any unresolved maintenance issues.", "probable_cause": "Undetermined; the airplane and its occupants are missing."}