{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-049-constellation-reading-5-killed", "date": "Jul 11, 1946 at 1140 LT", "type": "Lockheed L-049 Constellation", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Reading - Reading", "msn": "2040", "yom": 1946, "flight_number": "TW2040", "city": "Reading", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 2477, "captain_hours_type": 196, "copilot_hours": 5520, "copilot_hours_type": 15, "aircraft_hours": 959, "circumstances": "The aircraft climbed to an altitude of 3,000 feet to an area approximately four miles east of the Reading Airport at which time, at the instruction of Captain Brown, Captain Nilsen leveled off to begin practice of instrument approach procedures. Shortly thereafter, the flight crew detected an odor resembling burning insulation, but did not immediately determine the source. At approximately 1137, the slight engineer went aft in order to determine the origin of the smoke. Upon opening the galley door, he observed that the entire cabin was filled with a very dense smoke and he returned to the cockpit and reported to Captain Brown that \"the whole cabin is on fire\".  The crew immediately attempted to combat the fire with the cockpit fire-extinguisher but were unable to enter the cabin because of the dense smoke and intense heat. The smoke quickly filled the cockpit through the open galley door, rendering visibility extremely poor and making it difficult for the pilots to observe the instruments. The student flight engineer opened the cockpit crew hatch in an attempt to clear the cockpit of smoke, however, the opening of the hatch increased the flow of smoke from the cabin toward the cockpit and shortly thereafter it became impossible for Captain Brown to observe any of the instruments or to see through the windshield. Captain Brown opened the window on the right side of the pilot compartment and attempted to fly the aircraft back to the Reading Airport for an emergency landing while descending with the engines throttled and with his head out of the side window. With the increased intensity of the heat and denseness of the smoke in the cockpit, it became impossible for the pilots to maintain effective control of the aircraft. At an altitude of approximately 100 feet, two miles northwest of the airport, Captain Brown withdrew his head from the window and attempted to \"ditch\" the aircraft \"blind\". The aircraft contacted two electric power wires strung about 25 feet above the ground, and the left wing tip glanced against scattered rocks and struck the base of the large tree. The aircraft settled to the ground, slowly rotating to the left, as it skidded approximately 1,000 feet across a hay field, causing disintegration of the left wing panel, flaps and aileron. The aircraft continued to yaw to the left and, after having rotated more than 90 degrees, it plunged through a row of trees and telephone poles lining a road bordering the field, coming to rest in a pasture at a point approximately 150 feet beyond the road and pointing approximately 160 degrees from its original heading at the time of initial impact. Gasoline was spilled from the ruptured tanks and fire broke out consuming the major portion of the wreckage. When local farm workers arrived at the scene approximately one minute after the aircraft had come to rest, Captain Brown was observed walking away from the wreckage and Captain Nilsen was seen lying on the ground to the rear of the trailing edge of the right wing approximately six feet from the fuselage Both pilots were taken to the Reading Hospital where Captain Nilsen died shortly afterward. The remaining four crew members died in the wreckage.", "probable_cause": "The Board determines that the probable cause of this accident was failure of at least one of the generator lead through-stud installations in the fuselage skin of the forward baggage compartment which resulted in intense local heating due to the electrical arcing, ignition of the fuselage insulation, and creation of smoke of such density that sustained control of the aircraft became impossible. A contributing factor was the deficiency in the inspection systems which permitted defects in the aircraft to persist over a long period of time and to reach such proportions as to create a hazardous condition."}