{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-do-skymaster-kilkee-8-killed", "date": "Aug 15, 1949 at 0240 LT", "type": "Douglas C-54 Skymaster", "operator": "Transocean%20Airlines", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Rome – Shannon – Gander – New York – San Juan – Caracas", "msn": "3076", "yom": 1943, "flight_number": null, "city": "Kilkee", "zone": "Munster", "country": "Ireland", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 1, "pax_on_board": 49, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 8600, "captain_hours_type": 2500, "copilot_hours": 6200, "copilot_hours_type": 2500, "aircraft_hours": null, "circumstances": "The flight departed from Rome, Italy, at 1608, August 14, 1949, carrying 49 passengers and a crew of nine, 2,260 gallons of fuel, and 2,750 pounds of baggage and cargo Aircraft weight at time of takeoff was 68,646 pounds, which was within the allowable limit of 70,700 pounds No information is available as to whether the aircraft was properly loaded with respect to its certificated center of gravity limits According to the instrument flight clearance filed with Rome Air Traffic Control, the planned route was to Marseille, France, at an altitude of 10,500 feet, then direct to Shannon, Ireland, at an altitude of 8,500 feet Orly, the principal commercial airport at Paris, France, was designated as the flight's alternate Clear weather and light to moderate winds over the proposed route were predicted. Takeoff from Rome was made by First Officer Hall as pilot with Captain Bessey serving as copilot After leveling off at 8,500 feet, 2,000 feet below the planned cruising altitude to Marseille, Captain Bessey retired to the crew's quarters, and the flight continued with First Officer Hall flying as pilot Second Officer John Moore was co-pilot, James Baumann was navigator, Robert D Thomas and Herbert Ashbell were radio officers, and Ralph Fisher and Luigina Cerabona were flight attendants The ninth member of the crew, Ruth Nichols, had no assigned duties. Except for the fact that the number 3 engine operated roughly when the mixture was in auto lean, the flight progressed without incident At approximately 2300, the flight descended to 3,500 feet, which was above a layer of stratus clouds. The original ETA (estimated time of arrival) of 0021 over Shannon was revised several times en route, but all such times passed without the flight observing the Shannon Airport Actually, although unknown to the crew, at 2300 the aircraft had been flown beyond Shannon and was over the North Atlantic It was not until 0050 or later that a turn was made for the return course to Shannon. At 0106 the flight alerted Air-Sea Rescue facilities at Shannon and gave its position as 100 miles west of Shannon, flying inbound on a track of 80 degrees Ground speed was estimated to be 140 knots The flight continued toward Shannon until 0240 when all fuel was exhausted, and at which time the aircraft was ditched, seven miles northwest of Lurga Point on the Irish Coast No use was, made by the flight of 500 KC's, the International Distress Frequency. The aircraft remained afloat for about 15 minutes, during which time the crew and the passengers removed and manned all but one of the life rafts Aircraft circling over the life rafts were able to direct the British trawler \"Stalberg\" to the scene. All rescue operations were completed shortly after daylight of August 15, 1949. Seven passengers and one crew member died as a result of exposure or drowning, all others were successfully rescued. The aircraft sank and was lost. ", "probable_cause": "The Board determines that the probable cause of this accident was the failure of the captain to exercise the proper supervision over his crew during flight planning and while en route.\r\nThe following findings were noted:\r\n- The crew did not confer during flight planning, and did not have any agreement or accurate knowledge as to route, fuel hours an board, fuel requirements, or duration of flight,\r\n- Weather information which was obtained at the time of flight planning was not obtained for the route which was flown, and no attempt was made en route to secure such information,\r\n- Accurate hourly positions of the aircraft were not determined or plotted, nor was celestial navigation used as a routine means of position determination, though the stars were visible at all times after sunset,\r\n- The flight passed over the immediate vicinity of Mizen Head, Ireland, at 2227 at which time it erroneously reported its position to Shannon radio as being over Land's End, Great Britain,\r\n- The flight continued beyond destination until approximately 0050, at which time a turn was made in the vicinity of 53 27 degrees north latitude End 18 20 degrees west longitude for return to Shannon,\r\n- All fuel was exhausted at 0240, necessitating a ditching at a point approximately seven miles northwest of Lurga Point on the Irish Coast."}