{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690b-hare-2-killed", "date": "Apr 9, 2016 at 0951 LT", "type": "Rockwell Grand Commander 690", "operator": "Mickey L. Brethower", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Georgetown - Georgetown", "msn": "11487", "yom": 1978, "flight_number": null, "city": "Hare", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1351, "captain_hours_type": 65, "copilot_hours": 25975, "copilot_hours_type": null, "aircraft_hours": 9002, "circumstances": "The private pilot, who was the owner of the airplane, and a flight instructor were performing a recurrent training flight. Radar data showed that the airplane departed and climbed to an altitude about 5,000 ft above ground level. About 5 minutes after takeoff, the airplane conducted a left 360° turn followed by a right 360° turn, then continued in level flight for about 2 minutes as it slowed to a groundspeed of about 90 knots, which may have been indicative of airwork leading to slow flight or stall maneuvers. The airplane then entered a steep bank and impacted the ground in a nose-low attitude. Both engines and propellers displayed evidence of operation at the time of impact, and postaccident examination revealed no mechanical anomalies that would have precluded normal operation of the airframe or engines. The instructor had a history of obstructive sleep apnea. The investigation was unable to determine how well the condition was controlled, if he had symptoms from the condition, or if it contributed to the accident. Toxicology testing revealed low levels of ethanol in specimens from both pilots; however, it is likely that some or all of the ethanol detected was a result of postmortem production, and it is unlikely that alcohol impairment contributed to the accident. Toxicology testing also detected the primary psychoactive compound of marijuana, tetrahydrocannabinol (THC), and its metabolite, tetrahydrocannabinol carboxylic acid (THCCOOH), in specimens obtained from comingled remains; the investigation was unable to reliably determine which pilot had used the impairing illicit drug. Additionally, it is not possible to determine impairment from tissue specimens; therefore, the investigation was unable to determine whether THC impaired either of the pilots or if it may have contributed to the accident. ", "probable_cause": "A loss of control while maneuvering for reasons that could not be determined because postaccident examination did not reveal any mechanical malfunctions or anomalies with the\r\nairplane."}