{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-120rt-brasilia-carrollton-8-killed", "date": "Aug 21, 1995 at 1253 LT", "type": "Embraer EMB-120 Brasília", "operator": "Atlantic%20Southeast%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Atlanta - Gulfport", "msn": "120-122", "yom": 1989, "flight_number": "EV529", "city": "Carrollton", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 26, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 9876, "captain_hours_type": 7374, "copilot_hours": 1193, "copilot_hours_type": 363, "aircraft_hours": 17151, "circumstances": "Atlantic Southeast Airline Flight 529 was climbing through 18,000 feet, when a blade from the left propeller separated. This resulted in distortion of the left engine nacelle, excessive drag, loss of wing lift, and reduced directional control. The degraded performance resulted in a forced landing. While landing, the airplane passed through trees, impacted the ground, and was further damaged by post impact fire. An exam of the left propeller revealed the blade had failed due to a fatigue crack that originated from multiple corrosion pits in the taper bore surface of the blade spar. The crack had propagated toward the outside of the blade and around both sides of the taper bore. Due to 2 previous blade failures (separations), a borescope inspection procedure had been developed by Hamilton Standard to inspect returned blades (that had rejectable ultrasonic indications) for evidence of cracks, pits and corrosion. The accident blade was one of 490 rejected blades that had been sent to Hamilton Standard for further evaluation and possible repair. Maintenance technicians, who inspected the blade, lacked proper NDI familiarization training and specific equipment to identify the corrosion that resulted in fatigue. The captain and seven passengers were killed. ", "probable_cause": "The in-flight fatigue fracture and separation of a propeller blade resulting in distortion of the left engine nacelle, causing excessive drag, loss of wing lift, and reduced directional control of\r\nthe airplane. The fracture was caused by a fatigue crack from multiple corrosion pits that were not discovered by Hamilton Standard because of inadequate and ineffective corporate inspection and repair techniques, training, documentation, and communications. Contributing to the accident was Hamilton Standard's and FAA's failure to require recurrent on-wing ultrasonic inspections of the affected propellers. Contributing to the severity of the accident was the overcast cloud ceiling at the accident site. "}