{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6a-pacific-ocean-58-killed", "date": "Jul 12, 1953 at 0841 LT", "type": "Douglas DC-6", "operator": "Transocean%20Airlines", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Hanoi – Manila – Agana – Wake – Honolulu – Oakland", "msn": "42901", "yom": 1949, "flight_number": "TL512", "city": "Pacific Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 49, "pax_fatalities": 49, "other_fatalities": 0, "total_fatalities": 58, "captain_hours": 10312, "captain_hours_type": 729, "copilot_hours": 5699, "copilot_hours_type": 434, "aircraft_hours": 6235, "circumstances": "Transocean Air Lines' Flight 512 departed Guam. M. I., at 0004 on July 12, 1953, for Oakland, California, with planned intermediate stops at Wake Island and Honolulu, T. H. The crew consisted of Captain W. L. Word, First Officer H. A. Hudson, Second Officer L. H. Nowell, Navigator J. R. Hay, Flight Engineer G. C. Haaskamp, Student Flight Engineer P. Yedwabnick, flight Purser H. H. Sargent and Stewardess N. L. Downing. Forty-nine passengers were on board including one infant. The flight to Wake Island was accomplished without incident in five hours and 35 minutes. One passenger boarded the aircraft at Wake Island and since none were discharged at this point, there was a total of 50 passengers on board for the Wake Island-Honolulu segment of the flight. Following a briefing by the U. S. Weather Bureau personnel on the expected en route weather conditions, the crew filed an IFR flight plan. This plan indicated that a rhumb-line course to Honolulu was to be flown at a cruising altitude of 15,000 feet at an air speed of 236 miles per hour. Also that the estimated elapsed time was nine hours and three minutes with 11 hours and 15 minutes of fuel on board. Prior to departure the aircraft was serviced with 2,503 gallons of 100/130 octane gasoline (to a total of 4,069 gallons) and 32 gallons of oil. Takeoff from Wake Island was at 0658, July 12, 1953, with the same crew on board. According to the company's records, the total gross weight of the aircraft at takeoff was 94,397 pounds which was within the allowable gross takeoff weight of 100,000 pounds; the load was properly distributed relative to the approved CG limits. Seven minutes after departure, Flight 512 was cleared from the Wake Island CAA Control Tower frequency. At 0729 the flight made the required 100-mile-east position report and stated that it had reached cruising altitude two minutes earlier. At 0829, one hour and 31 minutes after departing Wake Island, the flight made a scheduled position report as 19 degree 48’ north latitude, 171 degree 48’ east longitude, and cruising at 15,000 feet between cloud layers. This was the last known radio contact with the flight. Since the flight did not report over its next scheduled reporting point, an alert was declared by Wake Island ARTC (Air Route Traffic Control) at 1001. An aircraft flying from Honolulu to Wake Island reported at 1212 that a green flare had been seen. This aircraft's position was 19 degree 23’N and 172 degree 05’E at the time the flare was sighted. The U. S. Coast Guard immediately dispatched several aircraft and a surface vessel to search the area. A Preliminary Accident Notice was filed by Wake Island ARTC at 1643, July 12, 1953.", "probable_cause": "The Board is unable to determine the probable cause of this accident from the available evidence."}