{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-islip", "date": "May 18, 2001 at 1725 LT", "type": "Beechcraft 90 King Air", "operator": "Executive%20Fliteways", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "East Hampton - Ronkonkoma", "msn": "LJ-858", "yom": 1979, "flight_number": null, "city": "Ronkonkoma-Long Island-McArthur Field", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2439, "captain_hours_type": 98, "copilot_hours": 1613, "copilot_hours_type": 114, "aircraft_hours": 6581, "circumstances": "After about a 20 minute flight, while on final approach for landing, the airplane experienced a loss of engine power on both engines, and the pilot-in-command (PIC) performed a forced landing into trees about 1/2 mile from the airport. The left and right boost pumps and the left and right transfer pumps, were observed in the \"OFF\" position. According to the PIC, after he exited the airplane, he returned to the cockpit and \"shut off the fuel panel. The fuel quantity indicator toggle switch was observed in the \"TOTAL\" position. Examination of the fuel system revealed both engine nacelle tanks, both wing center section tanks, and the right wing fuel tanks were not compromised. About 1 quart of fuel was drained from the left and right engine nacelle tanks, respectively. Less than a quart of fuel was drained from the right wing tanks. The left wing tanks were compromised during the accident; however there was and no evidence of a fuel spill. Examination of the left and right wing center tanks revealed approximately 27 gallons (approximately 181 lbs) of fuel present in each tank. Battery power was connected to the airplane, and when the fuel transfer pump switches were turned to the \"ON\" position, fuel was observed being pumped from the left and right wing center tanks to their respective nacelle tanks. The accident flight was the third flight of the day for the flight crew and airplane. According to a flight log located in the cockpit, the flight crew indicated 750 lbs of fuel remained at the time of the takeoff. According to the airplane flight manual (AFM),\"Fuel for each engine is supplied from a nacelle tank and four interconnected wing tanks...The outboard wing tanks supply the center section wing tank by gravity flow. The nacelle tank draws its fuel supply from the center section tank. Since the center section tank is lower than the other wing tanks and the nacelle tank, the fuel is transferred to the nacelle tank by the fuel transfer pump in the low spot of the center section tank....\" Additionally, with the transfer pumps inoperative, all wing fuel except 28 gallons from each wing will transfer to the nacelle tank through gravity feed.", "probable_cause": "The pilot’s failure to activate the fuel transfer pumps in accordance with the checklist, which resulted in fuel exhaustion."}