{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-coari", "date": "Apr 21, 2008 at 1500 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Rico", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Manaus – Carauari", "msn": "110-359", "yom": 1981, "flight_number": null, "city": "Coari", "zone": "Amazonas", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 15, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16442, "captain_hours_type": 2519, "copilot_hours": 1132, "copilot_hours_type": 364, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Manaus-Eduardo Gomes Airport on a flight to Carauari, carrying 15 passengers and two pilots. About 50 minutes into the flight, while cruising at an altitude of 8,500 feet, the right engine failed. The crew elected several times to restart it but without success. After the crew informed ATC about his situation, he was cleared to divert to Coari Airport located about 37 km from his position. Because the aircraft was overloaded and one engine was inoperative, the crew was approaching Coari Airport runway 28 with a speed higher than the reference speed. The aircraft landed too far down the runway, about 700 metres past the runway 28 threshold (runway 28 is 1,600 metres long). After touchdown, directional control was lost. The airplane veered off runway to the left and while contacting a drainage ditch, the undercarriage were torn off and the aircraft came to rest 20 metres further. All 17 occupants were evacuated, among them nine were injured. The aircraft was damaged beyond repair. ", "probable_cause": "The failure of the right engine was the result of the failure of the fuel pump due to poor maintenance and a possible use beyond prescribed limits. The presence of iron oxide inside and outside the fuel pump as well as the lack of cleanliness of the internal components indicates a probable lack of maintenance. When the right engine stopped running, the generator No. 1 was then responsible for powering the aircraft's electrical system. As the latter was not in good working order, the primary generator could not withstand the overload and ceased to function, leaving only the battery to power the entire electrical system. To maintain power to critical systems, the crew would have had to select the backup power system. Since after the engine stopped, there was no monitoring of the electrical system, the pilots only realized the failure of the electrical system when they attempted to extend the landing gears. The emergency hydraulic system was then used to lower the gears, after which the crew did not return the system selection valve to the 'normal' position, resulting in the brakes and the steering systems to be inoperative after landing. The chain of failures may be associated with not reading the checklist when performing procedures after the engine failure. \r\nThe following contributing factors were identified:\r\n- Poor flight preparation, \r\n- The crew failed to follow the SOP's, and took the decision to initiate the flight with an aircraft that was overloaded by 503 kilos, \r\n- When the emergency situation presented itself to the crew, they failed to follow the checklist,\r\n- On an organizational level, the company did not have an effective personnel training system in place, so that the crew did not have sufficient skills to respond to emergency situations,\r\n- Because the aircraft was overloaded and that one engine was inoperative, the crew was forced to complete the approach with a speed higher than the reference speed, \r\n- An improper use of the controls allowed the aircraft to land 700 meters past the runway 28 threshold, reducing the landing distance available,\r\n- The crew focused their attention on the failure of the right engine and did not identify the failure of the electrical system, which delayed their tasks assignment, all made worse by the failure to comply with the checklist,\r\n- The operations cleared the crew to start the flight despite the fact that the aircraft was overloaded on takeoff based on weight and balance documents,\r\n- The crew did not prepare the flight according to published procedures and did not consider the total weight of the aircraft in relation to the number of passengers on board and the volume of fuelin the tanks, which resulted in an aircraft to be overloaded by 503 kilos and contributed to the failure of the right engine, \r\n- A lack of maintenance on the part of the operator."}