{"url": "https://www.baaa-acro.com/crash/crash-consolidated-pby-5a-catalina-southampton-2-killed", "date": "Jul 27, 1998 at 1444 LT", "type": "Consolidated PBY Catalina", "operator": "Plane Sailing Air Displays", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Southampton - Southampton", "msn": "1997", "yom": 1944, "flight_number": null, "city": "Southampton", "zone": "Hampshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 14, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 9935, "captain_hours_type": 151, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft had been booked for a static display and press 'photocall' at Southampton Airport, as part of the official launch of a project known as Seawings 2000. The aircraft operator had offered some short flights, free of charge, for the event organisers to use as they felt appropriate. Initial seat  allocation was to the press, and members and officers of Southampton City Council. The remaining seats were offered to individuals representing organisations assisting the running of the project. The crew consisted of two pilots and two rear crew; one of the latter was designated 'crew chief'. There were two passenger compartments separated by a central compartment which had a door in the front bulkhead. Each passenger compartment was configured with eight seats, four either side of a central aisle. The front seats in each compartment were aft facing. The seats were typical airline type and had a standard lap belt restraint; a lifejacket was stowed under each seat. There was a bench type seat in each rear blister; however, these did not have restraint belts. On land, the aircraft is normally entered/vacated via ventral stairs, however, this access is not available when on water. There is a window type hatch between the seats on the left side of the front compartment. This is hinged at the top and opens upwards and outwards. To the rear and either side of the aft compartment there are two observation blisters which open upward in an 'eyelid' fashion. All three exits can be used for emergency egress. Emergency egress from the flight deck is through a removable hatch above the co-pilot's head.", "probable_cause": "Because the nose gear doors were not recovered, it is not possible to exclude the possibility that the aircraft encountered a significant piece of flotsam which caused the doors to collapse inwards. Regardless of this, the presence of the severe corrosion in the nose gear operating mechanism torque tube can only have served to compromise the ability of the left door to resist the range of loads which might have been imposed during a water landing. The corrosion found in the torque tube had clearly developed over a long time but it went undetected because it was inside a closed area and no specific inspection of the inside of the tubes was called for. When looking at another Catalina, it was observed that there were no bungs in the aft ends of the torque tubes and it would have been possible, with suitable apparatus, to inspect the whole of the inside of the tube assemblies, particularly in the zone where the tube failed on this occasion. The Maintenance Manual and Schedule for the Catalina were developed and written in a different age when these aircraft were very differently utilised. Although both the Manual and Schedule have been developed as a result of the Catalina's continued amphibious operation, for probably much longer than originally envisaged, there are now likely to be some time related maintenance considerations which did not previously exist."}