{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-200-raleigh-1-killed", "date": "Jul 31, 2000 at 0034 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Win%20Win%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hinckley - Louisburg", "msn": "163", "yom": 1968, "flight_number": null, "city": "Raleigh-Durham", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1725, "captain_hours_type": 147, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 28711, "circumstances": "The flight had proceeded without incident until a visual approach was made to the destination airport, but a landing was not completed because of poor visibility due to ground fog. The pilot then requested vectors to another airport, and was advised by ATC that he was below radar coverage, and he could not be radar identified. The pilot stated he would proceed to a third airport; he was given a heading, instructed to proceed direct to the airport, and report the field in sight. He was told to over-fly the airport, and might be able to descend through a clearing in the clouds. An inbound air carrier flight reported instrument meteorological conditions on the final approach to a parallel runway. At a location of 1.13 miles east of the airport, the flight, for no apparent reason, turned south, away from the airport. The last radio contact with pilot was after ATC told him his heading was taking him away from the airport and he said he was turning back. The last known position of N201RH was 1.95 miles southeast of the airport, at 500 feet MSL. According to the statement of the passenger that was sitting in the co-pilot's seat, \"...all we could see were city lights and darkness underneath us. We were in a right turn, when I saw the trees and subsequently hit it.\" According to the pilot's log book and FAA records revealed a limitation on his commercial pilot certificate prohibited him from carrying passengers for hire at night and on cross-country flights of more than 50 nautical miles. The records did not show any instrument rating. As per the entries in his personal flight logbook, he had accumulated a total of 1,725.2 total flight hours, 1,550.9 total single engine flight hours, and 184.3 total flight hours in multi-engine aircraft of which 145.6 hours were in this make and model airplane. In addition, the logbooks showed that he had a total of 487.3 cross country flight hours, 61.9 total night flight hours, and 21.6 simulated instrument flight hours.", "probable_cause": "The pilot's continued VFR flight into IMC conditions, by failing to maintain altitude, and descending from VFR conditions into IMC, which resulted in him subsequently impacting with trees. Factors in this accident were: reduced visibility due to dark night and fog. An additional factor was the pilot was not certified for instrument flight."}