{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-ankeny-2-killed", "date": "Nov 8, 2005 at 1017 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Exec 1 Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Ankeny - Emmetsburg", "msn": "31-7752065", "yom": 1977, "flight_number": null, "city": "Ankeny", "zone": "Iowa", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 9400, "captain_hours_type": 460, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8336, "circumstances": "The twin-engine airplane was destroyed by impact with terrain about 2.5 miles northeast of the airport while returning to the airport with an engine problem. A witness reported that the FAR Part 135 on-demand passenger flight had been scheduled for a 0900 departure, but because the flight had not been confirmed, a pilot was not scheduled to fly the flight. The accident pilot arrived at the airport about 1005. A witness reported that the pilot was not in the office for more than two minutes when he \"grabbed the status book,\" walked straight to the airplane, and boarded. A lineman serviced both engines at 0930 with oil, but failed to put the dipstick back in the right engine oil filler tube. Witnesses reported that they did not see the pilot perform a preflight. The pilot was unaware that the dipstick was left on the right wing of the airplane. The pilot taxied the airplane forward about 5 feet and abruptly stopped and shut down both engines. The pilot got out of the airplane. The lineman reported that he approached the pilot and asked what was wrong. The lineman reported that the pilot closed the oil flap door on the right engine, and said that the oil flap door had been left open. The pilot restarted the engines and departed about 1008. About three minutes after takeoff, the pilot informed departure control that he needed to return to the airport due to an oil leak. The pilot reported over the Unicom radio frequency that he was returning because he was having trouble with the right engine. Radar track data indicated that about 1013, the airplane's position was about 1.5 miles directly north of the airport about 1,800 feet msl, heading south at 126 knots calibrated airspeed (CAS). The airplane continued to fly south directly to the airport. The radar track data indicated that instead of landing on runway 18, the airplane flew over the airport, paralleling runway 18. About 1014, the airplane's position was over the airport at an altitude of about 1,460 feet msl (550 feet above ground level), heading south at about 97 knots CAS. The airplane continued to fly south past the airport, entered a left turn, and turned back to the north. The last radar return was recorded about 1016. The airplane's position was approximately 1.5 miles east of the approach end of runway 18 at an altitude of about 1,116 feet msl (344 feet agl), heading north at about 99 knots CAS. The impact site was located about 2.5 miles north of the last radar return. A witness, located about 1/4 mile from the accident site, observed the airplane flying \"really low.\" He reported, \"The motor on the plane wasn't cutting out or sputtering.\" Another witness reported, \"The plane lifted up over power lines then went across a field about 50 to 80 ft off ground.\" The airplane impacted a harvested cornfield in a  Page 2 of 11 CHI06FA026 steep nose-down attitude, and traveled 45 feet before stopping. The inspection of the airplane revealed that the landing gear was down, flaps were found in a 20-degree down position, and neither propeller was feathered. The post accident inspection of the airplane's engines and airframe revealed no preexisting anomalies that could be associated with a pre-impact condition.", "probable_cause": "The pilot's failure to preflight the airplane, the pilot's improper in-flight decision not to land the airplane on the runway when he had the opportunity, and the inadvertent stall when the pilot allowed the airspeed to get too low. Factors that contributed to the accident were the lineman's improper servicing of the airplane when he left the oil dipstick out and the subsequent oil leak."}