{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-414-hudson-i-raf-leuchars-1", "date": "Jan 15, 1940 at 0820 LT", "type": "Lockheed L-414 Hudson", "operator": "Royal-Air-Force-4", "flight_phase": "Takeoff (climb)", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Leuchars - Leuchars", "msn": "414-1641", "yom": 1939, "flight_number": null, "city": "Leuchars AFB", "zone": "Fife", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 15 January 1940 the Hudson I N7245 ZS-F of 233 Sqn RAF was taking off at 0820 hrs from Leuchars for a patrol when the pilot, F/O Andrew Hood McLaren, raised the undercarriage too soon. The Hudson stalled and ran into an electric transformer in a wood and caught fire. The crew escaped uninjured through the cabin door and ran from the burning wreck before the bombs had time to explode. F/O McLaren when well clear of the aircraft observed the Fire Tender and crew approaching to render assistance without knowing that the crew had already escaped. Without any hesitation he returned to the crash, warned the Fire Tender crew of the danger, and ordered them to get clear. Immediately after they were at a safe distance the bombs exploded, four minutes after the crash, blowing into small fragments the whole aircraft, except the engines. Had it not been for the prompt action of this officer several lives might have been lost, and this deed and some others won him a DFC on 16 April 1940, sadly being lost four days before. Of the three other crew, only one name is known, P/O A. E. Evans.\n\r\nSource: http://rcafassociation.ca/uploads/airforce/2009/07/canrafm-r.html", "probable_cause": "Premature retraction of the landing gear during the takeoff roll on part of the pilot. "}