{"url": "https://www.baaa-acro.com/crash/crash-boeing-kc-97g-28-bo-stratotanker-near-newry-5-killed", "date": "Jun 27, 1960", "type": "Boeing KC-97 Stratotanker", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Refuelling", "survivors": "No", "site": "Mountains", "schedule": "Plattsburgh - Plattsburgh", "msn": "16769", "yom": 1952, "flight_number": null, "city": "Newry", "zone": "Maine", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 8:15 PM on Monday, June 27, 1960, crew T-51 of the 380th Air Refueling Squadron departed Plattsburgh AFB aboard a KC-97G for the \"Fighting Fox\" air refueling area over Maine. Their mission was part of a SAC Operational Readiness Inspection of the 380th Bombardment Wing code named \"Jet Stream Golf\". They, and a backup KC-97G, were to refuel a B-47 under simulated combat conditions. The mission was expected to last just under four hours, with both tankers returning to Plattsburgh. After a successful rendezvous with the bomber, the tanker descended to the refueling altitude of 15,500 feet and accelerated, nose down, to 190 knots. The low altitude, when compared to today's KC-135 and KC-10 operations, was one of the necessities of refueling jet bombers like the B-47 and B-52 with a reciprocating engine powered aircraft. As the B-47 closed with the KC-97 from a higher altitude in \"observation\" position, everything seemed fine. Logistical radio exchanges were made and the bomber began to descend and close into refueling position. As they approached, the B-47 pilot and copilot saw a long stream of flame come back toward them from the KC-97's number one engine, then suddenly disappear. A small spot of white hot glow was noted near the rear of the number one engine. Seconds later, a large ball of flame enveloped the engine and the surrounding wing area. The boom operator transmitted \"breakaway, breakaway, breakaway\", and the B-47 commander took up a loose formation position off the tanker's right wing. The backup tanker, above and to the rear, made radio contact asking if they were in trouble, to which Lt. Burgess, the aircraft commander calmly replied \"Roger, I'm on fire\". At this point, the aircraft entered a gradual left turn which continued to get steeper, and turned into a spiral or spin. It was later determined that the left wing outboard of the burning engine had failed due to fire damage, before the crew could complete the \"engine fire\" drill. It was later found in Howard Pond some three miles from the crash site. The B-47 commander called \"bail out! bail out!\" but got no reply and spotted no parachutes. Witnesses on the ground, including over three hundred moviegoers at the Rumford Point Drive-In, saw the flaming aircraft spin down with burning pieces falling off. The fuel laden tanker crashed into Jonathan Smith Mountain near Route 26 in the Town of Newry. The aircraft was totally destroyed and all five crew members were killed. \nCrew:\nLt William Burgess, pilot,\nLt Lewis Turner, copilot,\nLt Raymond Kisonas, navigator, \nM/Sgt Harold Young, flight engineer, \nT/Sgt Robert Costello, boom operator.\nSource: http://www.mewreckchasers.com/kc97art.html", "probable_cause": "The investigation revealed that the accident was caused by a lubrication failure to the supercharger impeller shaft of the number one engine, leading to premature failure. The impeller, leaving the engine nacelle, did major damage and caused fuel leakage resulting in the severe fire and rapid structural failure of the wing."}