{"url": "https://www.baaa-acro.com/crash/ground-explosion-douglas-dc-9-32-atlanta", "date": "Jun 8, 1995 at 1908 LT", "type": "Douglas DC-9", "operator": "Valujet.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Atlanta - Miami", "msn": "47321", "yom": 1969, "flight_number": "VJA597", "city": "Atlanta-William Berry Hartsfield", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 57, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9500, "captain_hours_type": 3500, "copilot_hours": 3800, "copilot_hours_type": 552, "aircraft_hours": 63000, "circumstances": "As ValuJet Flight 597 began its takeoff roll, a 'loud Bang' was heard by the occupants, the right engine fire warning light illuminated, the crew of a following airplane reported to the ValuJet crew that the right engine was on fire, and the takeoff was rejected. Shrapnel from the right engine penetrated the fuselage and the right engine main fuel line, and a cabin fire erupted. The airplane was stopped on the runway, and the captain ordered evacuation of the airplane. A flight attendant (F/A) received serious puncture wounds from shrapnel and thermal injuries; another F/A and 5 passengers received minor injuries. Investigation revealed that an uncontained failure of the right engine had occurred due to fatigue failure of its 7th stage high compressor disc. The fatigue originated at a stress redistribution hole in the disc. Analysis of fatigue striation measurements indicated that the fatigue crack had originated before the disc was last overhauled at a repair station (Turk Hava Yollari) in 1991, but was not detected. Also, investigation of the repair station revealed evidence concerning a lack of adequate recordkeeping and a failure to use 'process sheets' to document the step-by-step overhaul/inspection procedures. ", "probable_cause": "Failure of Turk Hava Yollari maintenance and inspection personnel to perform a proper inspection of a 7th stage high compressor disc, thus allowing the detectable crack to grow to a length at which the disc ruptured, under normal operating conditions, propelling engine fragments into the fuselage; the fragments severed the right engine main fuel line, which resulted in a fire that rapidly engulfed the cabin area. The lack of an adequate record keeping system and the failure to use 'process sheets' to document the step-by-step overhaul/inspection procedures contributed to the failure to detect the crack and, thus, to the accident. "}