{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6-near-half-moon-bay-19-killed", "date": "Oct 29, 1953 at 0843 LT", "type": "Douglas DC-6", "operator": "British%20Commonwealth%20Pacific%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Sydney – Nadi – Canton – Honolulu – San Francisco", "msn": "43125", "yom": 1948, "flight_number": "BCP304", "city": "Half Moon Bay", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 19, "captain_hours": 10696, "captain_hours_type": 4136, "copilot_hours": 4782, "copilot_hours_type": 3896, "aircraft_hours": 5904, "circumstances": "British Commonwealth Pacific Airlines' Flight 304/44 of October 28. 1953, was scheduled between Sydney, Australia., and San Francisco., California., with intermediate stops at Nadi., Fiji Island, Canton Island., and Honolulu, T. H. The flight to Honolulu was without incident. A routine crew change was effected at Honolulu and the new crew consisted of Captain B. N. Dickson. First Officer F. A. Campbell. Navigator G. R. Murtagh. Radio Officer V. A. Walker, Flight Engineer C. N. Cattanach., Purser W. Knight and Hostesses J. F. Elder and A. K. Lewis. Following a briefing on expected en route and terminal weather by U. S. Weather Bureau personnel: the crew filed an IFR (Instrument Flight Rules) flight plan with ARTC (Air Route Traffic Control) which indicated a rhumb line course was to be flown to San Francisco with Sacramento, California,, the alternate airport. The estimated flying time of the flight was nine hours and 25 minutes and there was 12 hours and 53 minutes of fuel on board. Flight 304/44 departed Honolulu at 2259, October 28, 1953, with 10 adult passengers and one child. According to company records., the gross takeoff weight of the aircraft was 90,166 pounds which was below the allowable gross takeoff weight of 95,200 pounds and the load was properly distributed with respect to the center of gravity of the aircraft. Following departure from Honolulu, the flight called the tower and requested to leave tower frequency. This request was granted. At 2302, the flight again called the tower and reported that it was over Diamond Head requesting permission to return to the airport. At this time the pilot stated, \"We're having a little trouble with one of the props.\" The IFR flight plan was then cancelled. Three minutes later when over the airport the flight reported: \"The relay is working okay now; desire to continue flight.\" Upon receipt of this message., ARTC revalidated the original clearance and the flight proceeded on course. As the flight proceeded toward San Francisco hourly routine position reports were made to OFACS (Overseas Foreign Aeronautical Communication Station). At 0555, the following message was sent by the flight: \"VHBPE Position 32.39N 134,40W. Time 13502 (0550). Altitude 11,500. Track 064 degrees. Ground speed 225 knots. Estimating over SFO at 1640Z (0840). Estimating arrival at Blocks 1650Z (0850).\" Communications to and from the flight were then changed from CW (code) to voice. In answer to a request from the flight, San Francisco ARTC,, at 0807, cleared it to descend in accordance with Visual Flight Rules and to maintain at least 500 feet on top of clouds. The flight reported that it was starting descent at 0815 and at that time was given the San Francisco 0800 weather: \"Measured ceiling 1.200 feet. broken. visibility nine statute miles. temperature 54. dew point 50, wind west 12 knots and altimeter 30.13.\" As the aircraft approached the coast, it was identified by Western Air Defense Force Radar and released from corridor assignment at 0821. ARTC shortly there after cleared VHBPE as follows: \"ATC clears VHBPE to the San Francisco ILS Outer Marker via the Half Moon Bay Fan Marker direct to the San Francisco Outer Marker. Maintain at least 500 feet above all clouds. Contact San Francisco Approach Control after passing Half Moon Bay Fan Marker. Cloud tops reported in the Bay area l.,700 feet.\" This message was acknowledged and repeated back. The last communication from the flight heard by OFACS was at 0823 when the aircraft reported approximately 60 miles west of the coast. At 0839., the flight called San Francisco Approach Control on 3105 kc., identified itself as \"Air Pacific Echo\" and advised that it was over Half Moon Bay. 500 on top and was listening on 278 kc. Approach Control acknowledged and gave the following clearance: \"Cleared for an ILS approach to the airport, Runway 28, wind west 15; cross the outer marker initial (ly) at least 500 on top, report when inbound; ceiling 1.200, visibility nine. altimeter 30.14.\" Approximately three minutes later, the flight made a report which was acknowledged by the controller as \"Air Pacific Easy., Roger, southeast, turning inbound\"; the controller then added. \"Cheek passing the ILS outer marker inbound.\" At 0845, a call to the flight was unanswered as were all subsequent calls. Shortly thereafter, appropriate search and rescue agencies were alerted that the flight was overdue. The wreckage was sighted at 1010, approximately seven and one-half miles southeast of the town of Half Moon Bay. All 19 occupants have been killed. ", "probable_cause": "The Board determines the probable cause of this accident was the failure of the crew to follow prescribed procedures for an instrument approach. The following findings were reported:\r\n- The clearance given the flight for its instrument approach to San Francisco Airport was proper. was acknowledged. and was read back correctly,\r\n- The radio navigational and landing facilities for this area were functioning normally at the time the approach was being made,\r\n- The accident location was in a mountainous area seven and one-half miles southeast of Half Moon Bay at an elevation of 1,950 feet MSL,\r\n- The weather conditions in the area precluded an approach by means of visual reference to the ground,\r\n- The time element involved would not have permitted the aircraft to have flown from Half Moon Bay Fan Marker to the ILS outer marker and then execute the CAA approved instrument approach procedure,\r\n- The undestroyed wreckage yielded no evidence of mechanical or structural failure of the aircraft prior to impact."}