{"url": "https://www.baaa-acro.com/crash/crash-iai-1124a-westwind-ii-norfolk-island", "date": "Nov 18, 2009 at 2156 LT", "type": "IAI 1124 Westwind", "operator": "Pel-Air2", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Apia - Norfolk Island - Melbourne", "msn": "387", "yom": 1983, "flight_number": null, "city": "Norfolk Island", "zone": "All Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3596, "captain_hours_type": 923, "copilot_hours": 1954, "copilot_hours_type": 649, "aircraft_hours": 21528, "circumstances": "On 18 November 2009, the flight crew of an Israel Aircraft Industries Westwind 1124A aircraft, registered VH-NGA, was attempting a night approach and landing at Norfolk Island on an aeromedical flight from Apia, Samoa. On board were the pilot in command and copilot, and a doctor, nurse, patient and one passenger. On arrival, weather conditions prevented the crew from seeing the runway or its visual aids and therefore from landing. The pilot in command elected to ditch the aircraft in the sea before the aircraft’s fuel was exhausted. The aircraft broke in two after ditching. All the occupants escaped from the aircraft and were rescued by boat.", "probable_cause": "The pilot in command did not plan the flight in accordance with the existing regulatory and operator requirements, precluding a full understanding and management of the potential hazards affecting the flight. The flight crew did not source the most recent Norfolk Island Airport forecast, or seek and apply other relevant weather and other information at the most relevant stage of the flight to fully inform their decision of whether to continue the flight to the island, or to divert to another destination. The flight crew’s delayed awareness of the deteriorating weather at Norfolk Island combined with incomplete flight planning to influence the decision to continue to the island, rather than divert to a suitable alternate.\n"}