{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-west-palm-beach", "date": "Apr 3, 1998 at 1705 LT", "type": "Cessna 402", "operator": "Dove One", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Marsh Harbour - West Palm Beach", "msn": "402B-0338", "yom": 1972, "flight_number": null, "city": "West Palm Beach", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6120, "captain_hours_type": 350, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "According to the passengers, they departed about 30 or 40 minutes late because of the late arrival of the airplane. When the pilot arrived, he 'seemed to...be in a hurry...there was no safety instructions or any attempt to show us or the kids the operation of the door.' After takeoff, the flight climbed to an altitude of 6,700 feet. The pilot attempted to make radio contact with an unknown station, was unsuccessful in making radio contact, and according to a passenger, 'seemed agitated.' The passengers noticed that the left alternator light was illuminated, and questioned the pilot. The pilot told the passengers, '...it's nothing it always comes on.' About 15 minutes after departure, the flight descended to 3,000 feet and the pilot attempted to make radio contact with someone again. The flight continued at 3,000 feet until the pilot saw a ship in the ocean. He descended to around 1,000 feet over the ship, and was still working with the radio. The flight continued onto the coast. The passengers told EMS personnel that the airplane made an 'abrupt' left turn to line up with the runway, and when the airplane touched down, they felt the right side of the aircraft collapse. After touchdown on runway 27L, the airplane's right main landing gear collapsed, then the left gear collapsed. The airplane slid off the right side of the runway and struck RVR (runway visual range) equipment. According to the pilot's statement he, '...made [a] normal approach to runway 27 left. All system indicated normal. Upon touchdown and roll out all was ok for 3-4 hundred feet- [right] gear collapsed...unable to hold aircraft on runway...nose hit RVR antenna swinging aircraft more right to catch right wing and remove tip tank. Left gear collapsed as aircraft came to rest.' According to the FAA Inspector's statement, it was his opinion, on the day of the accident the aircraft was 'over gross weight on departure from Marsh Harbor...the pilot was experiencing radio problems... and I [FAA Inspector] believe he was flustered and annoyed...in the pattern he made an abrupt left turn to lineup with [runway] 27, and when he touched down on the runway the right gear immediately collapsed due to [side] overload.' In addition, both landing gear trunnions, where the retract mechanisms attached, were broken as if 'overloaded.' ", "probable_cause": "The pilot allowed the airplane to improperly touchdown on the right main landing gear, resulting in the gear collapsing, and subsequent impact with runway visual range equipment. "}