{"url": "https://www.baaa-acro.com/crash/crash-lockheed-ec-121r-super-constellation-korat-18-killed", "date": "Apr 25, 1969 at 1559 LT", "type": "Lockheed C-121 Super Constellation", "operator": "United%20States%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Korat - Korat", "msn": "4489", "yom": 1957, "flight_number": "Batcat 21", "city": "Korat", "zone": "Nakhon Ratchasima (นครราชสีมา)", "country": "Thailand", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 14, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 18, "captain_hours": 5583, "captain_hours_type": 1109, "copilot_hours": 6607, "copilot_hours_type": 4388, "aircraft_hours": null, "circumstances": "An EC-121R, 67-21493, callsign \"BATCAT 21\" from the 554th Recon Sq, was scheduled for a combat tactical mission out of Korat, Thailand. BATCAT 21 started engines approximately 15:20 and commenced taxi to run-up position at 15:30. After completing engine run-up, the flight was cleared for takeoff by Korat Tower at 15:54 and was advised to contact departure control. BATCAT 21 established contact with departure control and requested information on the position, direction of movement and speed of the thunderstorm cell near the base. Departure control advised BATCAT 21 that the thunderstorm was over the base and extended 20 miles southwest. BATCAT 21 requested a right turn after takeoff and radar vectoring around the thunderstorms. The controller requested the crew to maintain runway heading and indicated that he would vector the aircraft around the thunderstorms. Prior to becoming airborne, BATCAT 21 was advised that he was cleared to turn right to two eight zero degrees. The flight reported airborne at 15:58 and departure control advised the heading was two eight zero degrees and he would radar identify BATCAT 21. This was acknowledged and a short time later the crew requested to make a right turn if possible as it was very turbulent. Korat departure control approved the request. No further transmissions were received from BATCAT 21. The aircraft impacted with the ground gear up, engine power METO. The initial point of impact was in a rice paddy at a ground speed of 221 knots. Indicated airspeed was approximately 150-160 knots. As the aircraft traversed the rice paddies the under part of the wings and the propellers began to disintegrate. A dike separating the rice paddies, 80 yards from impact, started the disintegration of the accessory section of the engines. The right wing then struck a tree stump causing the path of the aircraft to veer slightly right. It continued on this path an additional 30 yards, struck another stump and returned to its original path across the ground, striking a tree with the number 2 engine and exploding 255 yards from impact. The fuselage continued down the rolling hill separating the two rice paddy areas and flipped to the right (the right side of the cockpit being the pivot point), finally coming to rest 300 yards from the touchdown point.\r\nSource: ASN", "probable_cause": "At approximately two and one half miles after lift-off and about 500 feet altitude, the aircraft entered a down draft which also was an area of strong wind shear. The aircraft experienced turbulence, but more significantly, the relative wind swiftly changed from a 20 knot head wind to at least a 20 knot tailwind. As the aircraft descended it entered the region closest to the ground where the tailwind was the strongest. Witness reports and wind damage estimates indicate the there was a most likely 60 knot tailwind at the surface when the aircraft crashed."}