{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-26-near-barberton-9-killed", "date": "Oct 5, 2008 at 1538 LT", "type": "Britten-Norman Islander", "operator": "Glen Lena", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Inhambane - Nelspruit - Bloemfontein", "msn": "461", "yom": 1975, "flight_number": null, "city": "Barberton", "zone": "Mpumalanga", "country": "South Africa", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 275, "captain_hours_type": 9, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The purpose of the flight was to spend a week in Mozambique during the school holidays following the 3rd term. The regular pilot of the aircraft was unable to undertake the journey due to an injured leg, so a replacement pilot was trained over a three-day period to fly two families to Mozambique. The pilot, together with four adults accompanied by four children, departed New Tempe aerodrome (FATP) on the 27th of September 2008. The first leg of the journey would see the aircraft fly from New Tempe aerodrome (FATP) to Kruger Mpumalanga International Airport (FAKN). After a brief stop at Kruger Mpumalanga International Airport (FAKN) for customs formalities, the aircraft then proceeded to Inhambane (FQIN) in Mozambique. On the 5th of October 2008, the aircraft was refuelled with 200 litres of fuel at Inhambane (FQIN) in Mozambique for the return leg of the journey. The return leg of the journey would see the aircraft fly from Inhambane (FQIN) in Mozambique to Kruger Mpumalanga International Airport (FAKN) for customs formalities and refuelling. 326 litres of fuel was uplifted at Kruger Mpumalanga International Airport (FAKN). The pilot filed a visual flight rules (VFR) flight plan with the ATC at Kruger Mpumalanga International Airport (FAKN) for the flight to New Tempe aerodrome (FATP) on the day of the accident. The aircraft departed Kruger Mpumalanga International Airport (FAKN) at 1317Z for the final leg of the flight to New Tempe aerodrome (FATP). Approximately 20 minutes after take-off from FAKN, a witness observed the aircraft flying at an altitude of approximately 1,000 feet AGL with the wings level in a southerly direction, overhead the farm, in the direction of the mountains. The witness noted that the aircraft was flying much lower than aircraft would normally fly when they flew over the farm. Thick mist covered approximately one third (1/3) of the top of the mountain at the time. The witness then lost sight of the aircraft and approximately two minutes later he heard an explosion. The witness immediately notified the Kruger Mpumalanga Airport authorities that an aircraft may have been involved in an accident. A search and rescue operation was initiated after the appropriate authorities had been informed. The search and rescue operation that consisted of air and ground searches were hampered by adverse weather conditions in the area from where the witness had heard the explosion emanating. The wreckage was located the following day during the air search operation, approximately 170 feet below the mountain top, where the aircraft had impacted with terrain. The aircraft had ploughed through a pine tree plantation, and was destroyed in the impact sequence and by the post-impact fire that had erupted. All the occupants on board the aircraft were fatally injured in the accident.", "probable_cause": "The pilot encountered adverse weather (IMC) conditions en route during a VFR flight, which resulted in controlled flight into terrain (CFIT) near the top of the mountain."}