{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-tremonton-2-killed", "date": "Feb 9, 1995 at 1821 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Mistystar", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Pueblo – Tremonton", "msn": "61-0775-8063388", "yom": 1980, "flight_number": null, "city": "Tremonton", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4300, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2100, "circumstances": "The instrument-rated private pilot intended to land at an uncontrolled airport at night. The airport had no instrument approaches. The airplane was flying on an instrument flight rules (IFR) flight plan above an overcast layer of clouds. The pilot informed air traffic control (ATC) that he was going to try to find a 'hole' in the overcast and attempt a visual approach into the uncontrolled airport. The pilot then stated that he could not find a hole; he requested and received an IFR clearance to a larger controlled airport. On his way to the controlled airport, he stated that he found a 'hole' and attempted a visual approach to the uncontrolled airport. He received a cruise clearance from atc for 12,000 feet msl, and then descended at 2,280 feet per minute before impacting mountainous terrain at an elevation of 6,200 feet msl. Instrument meteorological conditions prevailed near the accident site. No distress calls from the airplane were recorded. An examination of the wreckage did not reveal any evidence of preimpact mechanical malfunctions. Both occupants were killed. ", "probable_cause": "The pilot's attempt to conduct visual flight into instrument meteorological conditions, and his failure to maintain altitude/clearance with the mountainous terrain. Factors were the clouds, and the dark night."}