{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-sitka", "date": "May 30, 2003 at 1430 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Harris%20Aircraft%20Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Sitka - Salmon Lake", "msn": "1205", "yom": 1958, "flight_number": null, "city": "Sitka", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3720, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6060, "circumstances": "The airline transport certificated pilot departed from a paved runway for a short flight to a remote lake in an amphibious float-equipped airplane to deliver supplies to a client. The pilot reported that he was transporting several loads of equipment to the lake, and failed to visually check the gear position while looking for a new unloading area. He also indicated that he was distracted when he had to reset the flaps, and by a minor malfunction with the airplane's GPS receiver. He said he forgot to raise the landing gear wheels, and landed on the lake with the wheels extended. During the landing touchdown on the lake, the airplane nosed over and received damage to the left wing and fuselage. The airplane is equipped with floats that have landing gear position lights installed on the instrument panel. The airplane also has a mirror enabling the pilot to visually observe the landing gear position.", "probable_cause": "The pilot's failure to retract the landing gear wheels of an amphibious float equipped airplane after departure from a paved runway, which resulted in a nose over when the airplane was landed on a nearby lake with the wheels extended. A contributing factor in the accident was the pilot's diverted attention during the short flight from the airport to the lake."}