{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-50-dl-seattle-14-killed", "date": "Jan 2, 1949 at 2203 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Seattle Air Charter", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Seattle – New Haven", "msn": "10181", "yom": 1943, "flight_number": null, "city": "Seattle", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 27, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 6000, "captain_hours_type": 3000, "copilot_hours": 3000, "copilot_hours_type": null, "aircraft_hours": 5419, "circumstances": "A group of Yale University students returning to school following their Christmas vacation arranged with William F. Leland, sole owner and operator of Seattle Air Charter, to transport them front Seattle to New Haven, Connecticut, January 2, 1949. Departure was delayed because a full crew was not available at 1800 as had been originally planned. At approximately 2100 a crew was organized, consisting of G. W. Chavers, pilot; K.A. Love, copilot; and W. F. Leland, third crew member. The flight taxied to Runway 13 for takeoff at 2138 and held because ground fog conditions restricted the visibility below the one mile minimum required for takeoff. The flight maintained radio contact with the control tower which advised the pilots of the existing weather conditions on the field. When the flight had taxied from the parking ramp, the tower reported, “Boeing Field weather is clear, visibility, 1/2 variable to 1/4 mile in all quadrants.” The flight asked if they could take off. The tower replied: “Roger. We will let you out as far as traffic is concerned. You are cleared into position to holds.” A few minutes later, at 2145, the flight requested their weather minimums for takeoff and were told that they were ceiling 300 feet, and visibility one mile. To this, the flight responded, “If we take off we will be in violation, won’t we?” The tower answered, “Yes.” Shortly after this conversation, the tower again reported the visibility which was at that time restricted to 1/8 mile. After a period of 10 minutes during which time the flight continued to hold at the end of the runway, the tower remarked: “It appears we are getting a little break. Cleared into position and hold. We will have a clearance for you shortly.” Immediately following, the flight’s air route traffic control clearance was transmitted. Then, at 2201, the crew stated that they could see the four green range lights at the end of the runway, and that they were going to take off. These lights are located 5,700 feet from the approach end of runway 13, which is 7,500 feet in length. At 2204 the tower stated, “Cleared for take off report on top.” At this time the weather as reported by the Weather Bureau was ceiling unlimited, thin obscurement, visibility one fourth of a mile, restricted by fog. The airplane began its take off to the south, and for approximately 1,000 feet it appeared normal to observers who could see the navigation lights of the airplane. It then began to swerve to the left, becoming airborne approximately 1,800 feet down the runway on a heading 35 degrees to the left of the runway. Shortly after leaving the runway, the left wing dropped and the tip dragged on the ground for a distance of 117 feet. The aircraft remained airborne for approximately 750 feet after leaving the runway, and then made contact with the ground in a landing attitude, tail wheel first. Upon contact with the ground, power to the engines was “cut”. The aircraft rolled or skidded the remaining distance, approximately 700 feet, into a revetment hangar, immediately after which it was enveloped in flames. Fourteen occupants, among them all three crew members, were killed while 16 others were injured. The aircraft was destroyed. \n\r\nAs the tower watched the airplane’s navigation lights, they realized that a crash was imminent and called the Boeing Field Fire Department which was located 1,300 feet south of the control tower, and 200 feet south of the revetment hangar into which the airplane crashed. The fire captain on duty heard the crash. He and 2 firemen, which comprised the duty crew that night, responded immediately, departing for the scene of the crash with all available equipment. This comprised a crash wagon and 2 pump trucks. The equipment arrived within a minute after the crash.", "probable_cause": "The Board determines that the probable cause of this accident was the attempt to take off in an airplane which had formations of ice and frost on the surfaces of the wings.\r\nThe following factors were reported: \r\n- At the time of takeoff ice covered the bottom surfaces of both wings, and patches of ice and frost were on the top surface of the left wing,\r\n- The left wing tip dragged the ground for a distance of 117 feet and the aircraft remained airborne for a distance of approximately 750 feet after which it made contact with the ground in a landing attitude,\r\n- Power to both engines was cut after the airplane touched the ground. It then crashed into a revetment hangar, and was immediately enveloped in flames,\r\n- No indication of any mechanical or structural failure in the aircraft or any of its components was found."}