{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-weston", "date": "Oct 26, 2015 at 1233 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Spohrer-Dodd", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Jacksonville – Fort Lauderdale", "msn": "31-7852013", "yom": 1978, "flight_number": null, "city": "Weston", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11000, "captain_hours_type": 105, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6003, "circumstances": "The airline transport pilot of the multiengine airplane had fueled the main (inboard) fuel tanks to capacity before the cross-county flight. As the flight approached the destination airport, an air traffic controller instructed the pilot to turn right for a visual approach, and the pilot acknowledged. Subsequently, the pilot reported that he might have to land on a highway. The airplane impacted a marsh area about 15 miles from the destination airport. Review of data downloaded from an onboard engine monitor revealed that the right engine momentarily lost and regained power before experiencing a total loss of power. Examination of the wreckage revealed that the left propeller was feathered and that the right propeller was in the normal operating range. Sufficient fuel to complete the flight was drained from the left wing fuel tanks. Although the right wing fuel tanks were compromised during the impact, sufficient fuel was likely present in the right main fuel tanks to complete the flight before impact because both the left and right main fuel tanks were fueled to capacity concurrently before the flight, but it likely was in a low fuel state due to fuel used during the flight. The right wing main fuel tank was not equipped with a flapper valve, which should have been located on the baffle nearest the wing root where the fuel pickup was located. The flapper valve is used to trap fuel near the fuel pickup and prevent it from flowing outboard away from the pickup. The maintenance records did not indicate that the right main fuel tank bladder had been replaced; however, the manufacture year printed on the bladder was about 20 years before the accident and 16 years after the manufacture of the airplane, indicating that the bladder had been replaced at some point. When the right main fuel tank bladder was replaced, the flapper valve would have been removed. Based on the evidence, it is likely that maintenance personnel failed to reinstall the flapper valve after installing the new fuel bladder. This missing valve would not affect operation of the fuel system unless the right main fuel tank was in a low fuel state, when fuel could flow outboard away from the fuel pickup (such as in a right turn, which the pilot was making when the engine lost power), and result in fuel starvation to the engine.Toxicology testing of the pilot revealed that his blood alcohol level during the flight was likely between 0.077 gm/dl and 0.177 gm/dl, which is above the level generally considered impairing. Therefore, it is likely that, during the right turn, the fuel in the right main fuel tank moved outboard, which resulted in fuel starvation to the right engine. When the right engine lost power, the pilot should have secured the right engine by feathering the propeller to reduce drag and increase single-engine performance; however, given the position of the propellers at the accident site, the pilot likely incorrectly feathered the operating (left) engine, which rendered the airplane incapable of maintaining altitude. It is very likely that the pilot's impairment due to his ingestion of alcohol led to his errors and contributed to the accident.", "probable_cause": "The pilot's feathering of the incorrect propeller following a total loss of right engine power due to fuel starvation, which resulted from maintenance personnel's failure to reinstall the flapper valve in the right main fuel tank. Contributing to the accident was the pilot's impairment due to alcohol consumption."}