{"url": "https://www.baaa-acro.com/crash/crash-bae-125-800b-minsk-5-killed", "date": "Oct 26, 2009 at 2134 LT", "type": "BAe 125", "operator": "S-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Minsk", "msn": "258076", "yom": 1986, "flight_number": "RLS9607", "city": "Minsk-2", "zone": "Minsk voblast", "country": "Belarus", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 11926, "captain_hours_type": 811, "copilot_hours": 2356, "copilot_hours_type": 811, "aircraft_hours": 12751, "circumstances": "Following an uneventful flight from Moscow-Vnukovo Airport, the crew started a night approach to  Minsk-2 Airport runway 31. On approach, the crew encountered poor visibility due to marginal weather. The 'Pull Up' alarm sounded and the captain initiated a go-around procedure. Few minutes later, the crew attempted a second approach to land. At an altitude of about 550 metres, the crew realized he was on the wrong ILS frequency and corrected it. On final, the EGPWS alarm sounded for 35 seconds but the captain decided to continue the approach until the aircraft impacted trees and crashed in a wooded area located 3 km short of runway, bursting into flames. The aircraft was destroyed by a post crash fire and all five occupants were killed. ", "probable_cause": "The cause of the crash of BAe-125-800B RA-02807 during the ILS approach procedure at night, in weather conditions that met ICAO CAT I, was the failure to take timely action by the crew to carry out a missed approach, or divert to an alternate, when the ground could not be seen while descending below decision height during a transition to visual flight, and the lack of a proper response and action required when the TAWS alarm repeatedly sounded, which led to the collision of the aircraft with obstacles (forest) and land in a controlled flight (CFIT), its destruction and death of people on board.\n\r\nContributing factors were:\r\n- Deficiencies in the type of retraining and training of the flight crew, especially in the use of automatic flight modes, and flight director;\r\n- Erroneous actions of the captain, which led to an execution of the approach with the wrong ILS frequency set on the left set;\r\n- Lack of preparation of the commander of the plane for an approach in weather conditions that meet CAT I ICAO. \r\nValues of meteorological conditions in the flight log were in most cases were falsified;\r\n- Poor communication and crew resource management (CRM) of the flightcrew;\r\n- Poor control of the level of training of the crew by the airline's management and lack of organization in the airline's flight operations;\r\n- Psychological characteristics of the pilots, unrecorded in the formation of the crew and, possibly, reduced efficiency of the captain in a stressful situation because of chronic ischemic heart disease with coronary artery problems, which was not detected when passing aviation medical checks."}