{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6-northwood-32-killed", "date": "Jul 4, 1948 at 1503 LT", "type": "Douglas DC-6", "operator": "SAS.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Stockholm – Amsterdam – Northolt", "msn": "43119", "yom": 1948, "flight_number": null, "city": "Northwood", "zone": "London Metropolis", "country": "United Kingdom", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 25, "pax_fatalities": 25, "other_fatalities": 0, "total_fatalities": 32, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine aircraft christened 'Agnar Viking' was approaching RAF Northolt when the crew encountered low visibility due to poor weather conditions. After being cleared by ATC to descent to 2,500 feet, the crew was unable to locate the airport and decided to return to Amsterdam-Schiphol Airport. Few minutes later, while climbing to an altitude of 3,000 feet, the aircraft collided with a Royal Air Force Avro 685 York C.1 registered MW248. This second aircraft was completing a flight from Malta-Luqa with four passengers and a crew of three. Following the collision, both aircraft went out of control, dove into the ground and crashed in a wooded area located in Northwood, about 4 miles north of RAF Northolt. Both aircraft were destroyed and all 39 people were killed. ", "probable_cause": "The cause of the loss must in all probability be found in the field of human fallibility on the part of those responsible for the control of the aircraft from the ground or the flight of the aircraft in the air. Investigators found that the separation of 500 feet in force in the Northolt area, provided an inadequate margin of safety and recommended that it should be increased to 1,000 feet for the Metropolitan Control Zone. The report also discussed the standard setting for altimeters (known as QFF) that had been introduced in May 1948 for aircraft above 1,500 feet within control zones, and that any error in setting the barometric pressure of one millibar gave an error of 28 feet."}