{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54g-1-do-skymaster-mt-sanford-30-killed", "date": "Mar 12, 1948 at 2114 LT", "type": "Douglas C-54 Skymaster", "operator": "Northwest%20Airlines2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Shanghai – Anchorage – New York", "msn": "35966", "yom": 1945, "flight_number": "NW4422", "city": "Mt Sanford", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 24, "pax_fatalities": 24, "other_fatalities": 0, "total_fatalities": 30, "captain_hours": 4453, "captain_hours_type": 733, "copilot_hours": 8324, "copilot_hours_type": 728, "aircraft_hours": 3306, "circumstances": "Take-off from Anchorage was accomplished at 2012, March 12, 1948, and the flight proceeded en route. 2 At 2028 the flight reported over the Wasilla Intersection, which is the intersection of the north course of the Anchorage radio range and the east course of the Skwentna radio range. This intersection is located 35 miles north 3 of Anchorage. Three minutes later, at 2031, the flight reported that it was at its cruising altitude of 11,000 feet. At 2042 the flight reported over Sheep Mountain, a non-directional radio beacon located 85 miles airways distance, 31 degrees, from Anchorage. At 2103 the flight reported being over the Gulkana radio range station, 159 miles, 34 degrees, from Anchorage, and at this time it estimated that it would be over Northway, Alaska, 283 miles from Anchorage, at 2136. Gulkana did not establish communication with the flight. However, the flight repeated its clearance into the Fairbanks area back to Northway, indicating that the flight could receive on 400 kcs, the frequencies for both the Northway radio range and communication. Shortly before the position report of 2103, the flight was observed flying an easterly heading approximately 4 miles south of the Gulkana radio range station. Approximately 42 miles, 51 degrees, from the Gulkana radio range station is Mt. Sanford, the elevation of which is 16,208 feet. In order to provide a safe lateral distance from Mt. Sanford for aircraft flying the route, the airway from Gulkana east is deflected to the north, its course being 23 degrees. Fifteen minutes after the flight was observed flying easterly from Gulkana a fire was observed on the western slope of Mt. Sanford. Except for a repeat transmission of the flight's Gulkana position report, overheard by Northway Radio 124 miles northeast of Gulkana and approximately one minute before the fire was observed on Mt. Sanford, no communication was received from the flight after 2103. Northwest Airlines, at 2150, requested from Anchorage Radio the reported time of the flight over Northway, at which time Anchorage Radio advised that neither the Northway nor the Gulkana stations had been able to contact the flight, and that a fire had been reported on Mt. Sanford. Radio facilities over the route were immediately alerted. Since all attempts to contact the flight were unsuccessful, it was concluded that the flight had struck Mt. Sanford and burned.", "probable_cause": "The Board determines that the probable cause of this accident was the pilot's failure to see Mt. Sanford, which was probably obscured by clouds or the aurora borealis or both while flying a course off the airway."}