{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-40-solitaire-ainsworth-1-killed", "date": "Sep 23, 2017 at 1028 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "RA Aircraft Management", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Ainsworth – Bottineau", "msn": "414", "yom": 1980, "flight_number": null, "city": "Ainsworth", "zone": "Nebraska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3775, "captain_hours_type": 2850, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5383, "circumstances": "The instrument-rated private pilot departed on a cross-country flight in instrument meteorological conditions (IMC) with an overcast cloud layer at 500 ft above ground level (agl)\r\nand visibility restricted to 1 ¾ miles in mist, without receiving an instrument clearance or opening his filed instrument flight rules flight plan. There was an outage of the ground communications system at the airport and there was no evidence that the pilot attempted to open his flight plan via his cellular telephone. In addition, there was a low-level outage of the radar services in the vicinity of the accident site and investigators were unable to determine the airplane's route of flight before impact. The airport manager observed the accident airplane depart from runway 35 and enter the clouds. Witnesses located to the north of the accident site did not see the airplane but reported hearing an airplane depart about the time of the accident. One witness reported hearing a lowflying airplane and commented that the engines sounded as if they were operating at full power. The witness heard a thud as he was walking into his home but attributed it to a thunderstorm in the area. The airplane impacted a field about 3.5 miles to the northeast of the departure end of the runway and off the track for the intended route of flight. The airplane was massively fragmented during the impact and debris was scattered for about 300 ft. The damage to the airplane and ground scars at the accident site were consistent with the airplane impacting in a left wing low, nose low attitude with relatively high energy. A postaccident examination of the engines and propeller assemblies did not reveal any preimpact anomalies that would have precluded normal operation. Signatures were consistent with both engines producing power and both propellers developing thrust at the time of impact. While the massive fragmentation precluded functional testing of the equipment, there was no damage or failure that suggested preimpact anomalies with the airframe or flight controls.Several days before the accident flight, the pilot encountered a \"transient flag\" on the air data attitude heading reference system. The pilot reported the flag to both the co-owner of the airplane and an avionics shop; however, exact details of the flag are not known. The unit was destroyed by impact forces and could not be functionally tested. If the flag affecting the display of attitude information had occurred with the unit after takeoff, the instrument panel had adequate stand-by instrumentation from which the pilot could have continued the flight. It is not known if this unit failed during the takeoff and investigators were unable to determine what role, if any, this transient issue may have played in the accident. Based upon the reported weather conditions, the location of the wreckage, and the attitude of the airplane at the time of impact with the ground, it is likely that the pilot experienced spatial disorientation shortly after takeoff which resulted in a loss of control and descent into terrain.", "probable_cause": "The pilot's loss of airplane control due to spatial disorientation.\n"}