{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-10-dk-columbus-1-killed", "date": "Feb 25, 1948 at 0600 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Bruning Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pittsburgh – Columbus", "msn": "12527", "yom": 1944, "flight_number": null, "city": "Columbus-John Glenn (Port Columbus)", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2150, "captain_hours_type": null, "copilot_hours": 2400, "copilot_hours_type": 500, "aircraft_hours": 3300, "circumstances": "Captain De Cicco took over the controls of the aircraft shortly after the flight had passed the Newark fan marker, and started an instrument approach to the Port Columbus Airport. Altitude was reduced to 1,600 feet which was the minimum for that part of the instrument approach to Columbus. However, Captain De Cicco continued his descent below 1,600 feet despite the objections of Mr. Cole. Mr. Cole stated that he immediately engaged himself in a search of the cockpit for an instrument approach chart for Columbus, presumably to show Captain De Cicco that an altitude of 1,600 feet was required until over the Summit Hill fan marker. The descent was continued, and just as the aircraft emerged below the overcast Mr. Cole looked up to see the trees into which the aircraft flew. The first tree struck extended approximately 90 feet above the terrain, the elevation of which was 1,055 feet. The aircraft continued in a straight line, striking a second tree 60 feet away from the first. At this point the right horizontal stabilizer tip and the right elevator were sheared from the empennage A third tree was struck, 265 feet from the first point of contact, and miscellaneous fuselage parts and the right wing were torn from the aircraft. The airplane then made contact with the ground at which time both propellers were broken from the engines. The main body of the wreckage came to rest and burned 1,150 feet from the first point of impact. The pilot was killed, but the co-pilot, although seriously injured has substantially recovered.", "probable_cause": "The Board determines that the probable cause of this accident was the continuation of an instrument approach below an altitude sufficient to clear the terrain en route.\r\nThe following factors were considered as contributory:\r\n- At the scene of the crash, 6 miles east of Port Columbus Airport, the ground elevation is 1,055 feet, and at the time of the accident the ceiling was reported over the Port Columbus Airport to be 300 feet and visibility one mile,\r\n- The pilot did not follow the standard instrument approach procedure to the Columbus Airport but reduced his altitude below the minimum allowable of 1,600 feet between the Newark and Summit Hill fan markers, located 23 and 5 miles east of Port Columbus Airport respectively; and the aircraft struck the top of trees at an altitude of approximately 1,140 feet."}