{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-chibougamau", "date": "Apr 19, 2004 at 1018 LT", "type": "Beechcraft 100 King Air", "operator": "Myrand%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Quebec - Chibougamau", "msn": "B-145", "yom": 1973, "flight_number": null, "city": "Chibougamau", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11338, "captain_hours_type": 2600, "copilot_hours": 1176, "copilot_hours_type": 400, "aircraft_hours": null, "circumstances": "The Beechcraft A100, registration C-FMAI, operated by Myrand Aviation Inc., was on a chartered instrument flight rules flight from QuÈbec/Jean Lesage International Airport, Quebec, to Chibougamau/Chapais Airport, Quebec, with two pilots and three passengers on board. The copilot was at the controls and was flying a non-precision approach for Runway 05. The pilot-in-command took the controls less than one mile from the runway threshold and saw the runway when they were over the threshold. At approximately 1018 eastern daylight time, the wheels touched down approximately 1500 feet from the end of Runway 05. The pilot-in-command realized that the remaining landing distance was insufficient. He told the co-pilot to retract the flaps and applied full power, but did not reveal his intentions. The co-pilot cut power, selected reverse pitch and applied full braking. The aircraft continued rolling through the runway end, sank into the gravel and snow, and stopped abruptly about 500 feet past the runway end. The aircraft was severely damaged. None of the occupants were injured.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The aircraft was positioned over the runway threshold at an altitude that did not allow a landing at the beginning of the runway, and this, combined with a tailwind component and the wet runway surface, resulted in a runway excursion.\r\n2. Failure to follow standard operating procedures and a lack of crew coordination contributed to confusion on landing, which prevented the crew from aborting the landing and executing a missed approach.\r\n3. The pilot-in-command held several management positions within the company and controlled the pilot hiring and dismissal policies. This situation, combined with the level of experience of the co-pilot compared with that of the pilot-in-command, had an impact on crew cohesiveness.\r\nFindings as to Risk:\r\n1. The pilot-in-command of C-FMAI decided to execute an approach for Runway 05 without first ensuring that there would be no possible risk of collision with the other aircraft.\r\n2. The regulatory requirement to conform to or avoid the traffic pattern formed by other aircraft is not explicit as to how the traffic pattern should be avoided, in terms of either altitude or distance, which can result in risks of collision.\r\n3. The regulations do not indicate whether the missed approach segment should be considered part of the traffic pattern; this situation can lead pilots operating in uncontrolled airspace to believe that they are avoiding another aircraft executing an instrument approach when in reality a risk of collision exists."}