{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-monterey-1-killed", "date": "Jul 13, 2021 at 1042 LT", "type": "Cessna 421C Golden Eagle III", "operator": "M. E. Mullaly", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Monterey – Salinas", "msn": "421C-1023", "yom": 1981, "flight_number": null, "city": "Monterey", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On July 13, 2021 about 1042 Pacific daylight time, a Cessna 421C, N678SW, was destroyed when it was involved in an accident near Monterey, California. The pilot and passenger were fatally injured. The airplane was operated as a Title 14 Code of Federal Regulations Part 91 personal flight. Review of recorded communication from the Monterey air traffic control tower revealed that the pilot canceled their initial instrument flight rules (IFR) clearance and requested a Visual Flight Rules (VFR) on top clearance. The controller subsequently issued a VFR-ON-TOP clearance via the Monterey Five departure procedure, which included instructions to turn left after takeoff to join the Salinas very high frequency omni directional range (VOR) 264° radial. The controller issued a clearance for takeoff and shortly after, instructed the pilot to contact the Oakland Air Route Traffic Control Center (ARTCC). Review of recorded communication from the Oakland ARTCC revealed that the pilot established radio communication with the Oakland ARTCC controller as the airplane ascended through 1,700 ft msl. The controller noticed the airplane was turning in the wrong direction and issued an immediate right turn to a heading of 030° which was acknowledged by the pilot. The controller then immediately issued two low altitude alerts with no response from the pilot. No further radio communication with the pilot was received. Recorded Automatic Dependent Surveillance-Broadcast (ADS-B) data provided by the Federal Aviation Administration (FAA) showed that the airplane departed from runway 10R at 1738:44 and ascended to 1,075 ft msl before a right turn was initiated. The data showed that at 1740:14, the airplane continued to \r\nascend in a right turn and reached an altitude of 2,000 ft msl before a descent began. The data showed that the airplane continued descending right turn until ADS-B contact was lost at 1740:38, at an altitude of 775 ft, about 520 ft southwest of the accident site. A witness located near the accident site reported that he observed the accident airplane descend below the cloud layer in a nose low attitude with the landing gear retracted. The witness stated that the airplane made a right descending turn and impacted the top of a pine tree before it traveled below the tree line, followed by the sound of an explosion. The preliminary weather for the MRY airport reported that at 1054 PDT, winds from 280° at 7 knots, visibility of 9 statute miles, ceiling overcast at 800 feet agl, temperature of 15°C and dew point temperature of 11°C, altimeter setting of 29.99 inches of mercury, remarks included: station with a precipitation discriminator. Examination of the accident site revealed that the airplane impacted trees about 1 mile south of the departure end of runway 10R. The first identifiable point of contact (FIPC) was a 50 to 75 ft tall tree that had damaged limbs near the top of the tree. The debris path was oriented on a heading of about 067° and was about 995 ft in length from the FIPC, as seen in figure 2. The main wreckage was located about 405 ft from the FIPC. Various portions of aluminum wing skin, right wing, flap, aileron, engine, propeller blades, and propeller hub were observed throughout the debris path. Additionally, several trees were damaged throughout the debris path. The fuselage came to rest upright against a residential structure on a heading of about 045° magnetic at an elevation of 447 ft msl. The wreckage was recovered to a secure location for further examination. ", "probable_cause": null}