{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-211-near-prads-haute-bleone-150-killed", "date": "Mar 24, 2015 at 1041 LT", "type": "Airbus A320", "operator": "Germanwings-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Barcelona – Düsseldorf", "msn": "147", "yom": 1990, "flight_number": "4U9525", "city": "Prads-Haute-Bléone", "zone": "Alpes-de-Haute-Provence", "country": "France", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 144, "pax_fatalities": 144, "other_fatalities": 0, "total_fatalities": 150, "captain_hours": 6763, "captain_hours_type": 3811, "copilot_hours": 919, "copilot_hours_type": 540, "aircraft_hours": 58313, "circumstances": "The aircraft left Barcelona at 1000LT on a scheduled flight to Düsseldorf (flight 4U9525/GWI18G). At 1032LT, one minute after reaching its assigned cruising altitude of  38,000 feet near Toulon (level off), the aircraft started to lose altitude and continued a straight in descent during nine minutes, until it reached the altitude of 6,800 feet. It was later confirmed that no distress call was sent by the crew. Radar contact was lost at a height of 6,800 feet at 1041LT when the aircraft hit a mountain slope located near Prads-Haute-Bléone, northeast of Digne-les-Bains. At the time of the accident, weather conditions were considered as good with no storm activity, reasonable wind component and no turbulence. The crash site was reached by first rescuers in the afternoon and the aircraft  disintegrated on impact. None of the 150 occupants survived the crash. The second black box (DFDR) was found on April 2, nine days after the accident.", "probable_cause": "The collision with the ground was due to the deliberate and planned action of the copilot who decided to commit suicide while alone in the cockpit. The process for medical certification of pilots, in particular self-reporting in case of decrease in medical fitness between two periodic medical evaluations, did not succeed in preventing the copilot, who was experiencing mental disorder with psychotic symptoms, from exercising the privilege of his licence. The following factors may have contributed to the failure of this principle:\r\n-The copilot’s probable fear of losing his ability to fly as a professional pilot if he had reported his decrease in medical fitness to an AME,\r\n-The potential financial consequences generated by the lack of specific insurance covering the risks of loss of income in case of unfitness to fly,\r\n- The lack of clear guidelines in German regulations on when a threat to public safety outweighs the requirements of medical confidentiality.\r\nSecurity requirements led to cockpit doors designed to resist forcible intrusion by unauthorized persons. This made it impossible to enter the flight compartment before the aircraft impacted the terrain in the French Alps."}