{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-sanamer", "date": "May 18, 2015 at 0912 LT", "type": "PZL-Mielec AN-2", "operator": "S. V. Etapin", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "City", "schedule": "Kevsala – Gribnoye", "msn": "1G183-28", "yom": 1979, "flight_number": null, "city": "Sanamer", "zone": "Stavropol Krai", "country": "Russia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 20000, "captain_hours_type": 17500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The single engine aircraft was completing a flight from Kevsala (Ipatovo district of the Stavropol region) to Gribnoye, in the Novopavlovsk district, carrying one pilot and four oil drums. En route, while approaching Sanamer at low altitude, the pilot encountered engine problems and attempted an emergency landing. After touchdown, the aircraft hit a fence, crushed some trees and came to rest against the wall of a church. The pilot was seriously injured and the aircraft was damaged beyond repair.", "probable_cause": "The need of the emergency landing was due to the engine flameout in the air most probably caused by the oil tank swelling and pressing its wall on the fuel shutoff valve lever. Oil tank pressure and its swelling most probably caused carbon deposit in vent pipeline connecting oil tank with atmosphere. \r\nThe following factors most probably contributed to the accident:\r\n- No water washing of the oil tank and vent pipeline of oil tank with atmosphere specified by scheduled maintenance after 400±30 flight hours or 12±1 month of operation;\r\n- Aircraft maintenance by people not having the aircraft maintenance license;\r\n- Flight operation over locality at the altitude insufficient to perform landing within its limits in case of aircraft nonoperation;\r\n- Flight operation by PIC in moderate alcohol intoxication. "}