{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-497-yogyakarta-21-killed", "date": "Mar 7, 2007 at 0758 LT", "type": "Boeing 737-400", "operator": "Garuda-Indonesia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jakarta - Yogyakarta", "msn": "25664", "yom": 1992, "flight_number": "GIA200", "city": "Yogyakarta", "zone": "Special Region of Yogyakarta", "country": "Indonesia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 1, "pax_on_board": 133, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": 13421, "captain_hours_type": 3703, "copilot_hours": 1528, "copilot_hours_type": 1353, "aircraft_hours": 35207, "circumstances": "On 7 March 2007, a Boeing Company 737-497 aircraft, registered PK-GZC, was being operated by Garuda Indonesia on an instrument flight rules (IFR), scheduled passenger service, as flight number GA200 from Soekarno-Hatta Airport, Jakarta to Adisutjipto Airport, Yogyakarta. There were two pilots, five flight attendants, and 133 passengers on board. The pilot in command (PIC) and copilot commenced duty in Jakarta at about 21:30 Coordinated Universal Time (UTC), or 04:30 local time, for the flight to Yogyakarta. Prior to departing Jakarta, during the push back, the PIC contacted the ground engineers and informed them that the number-1 (left) engine thrust reverser fault light on the cockpit instruments had illuminated. The engineers reset the thrust reverser in the engine accessories unit and the fault light extinguished. The scheduled departure time was 23:00. The aircraft took off from Jakarta at 23:17, and the PIC was the pilot flying for the sector to Yogyakarta. The copilot was the monitoring/support pilot. During the cruise, just before top of descent, the crew was instructed by Jakarta Control to ‘maintain level 270 and contact Yogya Approach 123.4’. The copilot acknowledged; ‘contact Yogya 123.4, Indonesia 200’. The PIC started to give a crew briefing at 23:43 stating: ‘in case of holding, heading of 096’. The briefing was interrupted by a radio transmission from Yogya Approach, giving GA200 a clearance to Yogyakarta via airway W 17 for runway 09, and a requirement to report when leaving flight level 270. When radio communication was completed, the PIC continued with the crew briefing for an ILS approach, stating: \r\nWhen clear approach ILS runway 09, course 088. (C) Frequency 1091, aerodrome elevation three hundred fifty, (C) leaving two thousand five hundred by 6 point 6 DME ILS, (C) to check four DME one thousand six hundred seventy, (C) crossing two DME one thousand thirty seven. Decision Altitude ILS Cat I, five eight seven, two three seven both set, approach flap forty, auto brake two. Speed one three six, one five one, two twenty. Timing from final approach-fix to VOR 6 DME. (C) With airspeed approximately one four one, two minutes thirty six. (C) In case localizer, MDA seven hundred, localizer, miss approach, at point six. (C) DME ILS India Juliet oscar golf. (C) On landing, to the left standby parking stand. Go-around missed approach climb one thousand five hundred turn left. To holding fix via Yogya VOR, continue climb four thousand feet, to cross Yogya at or above two thousand five hundred DME eight. (C).\r\nTwelve minutes and 17 seconds later, Yogya Approach cleared GA200 ‘for visual approach runway zero nine, proceed to long final, report runway in sight’. The copilot acknowledged the clearance and asked for confirmation that they were cleared to descend to circuit altitude, Yogya Approach replied ‘descend to two thousand five hundred initially’. The crew informed the investigation that they were conducting an Instrument Landing System (ILS) approach to runway 09, in visual meteorological conditions (VMC). However they did not inform Yogya Approach or Yogyakarta Tower that they were flying the 09 ILS approach. At 23:58:10, the aircraft overran the departure end of runway 09 at Yogyakarta Airport. The PIC reported that as the aircraft was about to leave the runway, he shut down both engines. The aircraft crossed a road, and impacted an embankment before stopping in a rice paddy field 252 meters from the threshold of runway 27 (departure end of runway 09). The aircraft was destroyed by the impact forces and an intense, fuel-fed, post impact fire. There were 119 survivors. One flight attendant and 20 passengers were fatally injured. One flight attendant and 11 passengers were seriously injured. ", "probable_cause": "Causes:\r\n1) Flight crew communication and coordination was less than effective after the aircraft passed 2,336 feet on descent after flap 1 was selected. Therefore the safety of the flight was compromised.\r\n2) The PIC flew the aircraft at an excessively high airspeed and steep descent during the approach. The crew did not abort the approach when stabilized approach criteria were not met.\r\n3) The pilot in command did not act on the 15 GPWS alerts and warnings, and the two calls from the copilot to go around.\r\n4) The copilot did not follow company instructions and take control of the aircraft from the pilot in command when he saw that the pilot in command repeatedly ignored warnings to go around.\r\n5) Garuda did not provide simulator training for its Boeing 737 flight crews covering vital actions and required responses to GPWS and EGPWS alerts and warnings such as ‘TOO LOW TERRAIN’ and ‘WHOOP, WHOOP PULL UP’.\r\nOther Factors:\r\n1) The airport did not meet the ICAO Standard with respect to runway end safety areas.\r\n2) The airport did not meet the ICAO Standard with respect to rescue and fire fighting equipment and services for operation outside the airport perimeter and in swampy terrain. "}