{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-35-marquise-smyrna", "date": "Sep 21, 1995 at 0425 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Corporate Flight Management", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Smyrna - Louisville", "msn": "602", "yom": 1973, "flight_number": null, "city": "Smyrna-Rutherford County", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2140, "captain_hours_type": 112, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4304, "circumstances": "A witness stated he observed the airplane on climbout from runway 32. The airplane started a right turn estimated at about 30 to 45° angle of bank. The airplane stopped climbing and began descending. Subsequently, it collided with a tree line, while in a right bank, and then it impacted the ground. Weather conditions at the time of accident were described by the witness as very dark, with no ambient light or visible horizon. Examination of the airframe, flight control system, engine assembly, and propeller assembly revealed no evidence of a precrash failure or malfunction. The autopilot was found in the off position, and the autopilot circuit breakers were not tripped. The pilot and passenger were seriously injured and had no memory of the flight. A radio transcript revealed that after taking off, the flight had made one radio transmission to request an ifr clearance.  ", "probable_cause": "Failure of the pilot to maintain a proper climb rate after takeoff, and his inadvertent entry in a descending spiral, which he failed to correct. Factors relating to the accident were: darkness, and the pilot becoming spatially disoriented during the initial climb while attempting to obtain an ifr clearance."}