{"url": "https://www.baaa-acro.com/crash/crash-cessna-t303-crusader-serrania-del-baudo-1-killed", "date": "Jun 20, 2015 at 1305 LT", "type": "Cessna 303 Crusader", "operator": "Jorge Alberto Rodas Estrada", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Mountains", "schedule": "Nuquí – Quibdo", "msn": "303-00189", "yom": 1982, "flight_number": null, "city": "Serranía del Baudó", "zone": "Chocó", "country": "Colombia", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2322, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6491, "circumstances": "The twin engine airplane departed Nuquí Airport at 1256LT on a flight to Quibdó, carrying two passengers and one pilot. Two minutes after takeoff, the pilot informed ATC he was flying at an altitude of 1,500 feet and estimated his ETA at Quibdó-El Caraño Airport at 1315LT. Nine minutes into the flight, while cruising in IMC conditions, the aircraft contacted trees and crashed in a dense wooded area located near Serranía del Baudó, some 50 km north of Nuquí. SAR operations were initiated but the wreckage was found five days later only. Both passengers, a female aged 18 and her baby aged 8 months were evacuated with minor injuries while the pilot was killed. The aircraft was totally destroyed by impact forces. ", "probable_cause": "The accident was the consequence of a controlled flight into terrain following the decision of the pilot to continue under VFR mode in IMC conditions. \r\nThe following contributing factors were identified:\r\n- Poor risk assessment when planning a flight in VFR conditions over a mountainous area, even though the weather conditions were unfavorable.\r\n- Loss of situational awareness after entering the mountain area under VFR mode in IMC conditions, resulting in a CFIT. "}