{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-62m-havana-67-killed", "date": "May 27, 1977 at 0845 LT", "type": "Ilyushin II-62", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Frankfurt - Lisbon - Havana", "msn": "51903", "yom": 1975, "flight_number": "SU331", "city": "Havana-José Martí (Rancho Boyeros)", "zone": "La Habana", "country": "Cuba", "region": "Central America", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 59, "pax_fatalities": 57, "other_fatalities": 0, "total_fatalities": 67, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5549, "circumstances": "Following an uneventful flight from Lisbon, the crew started the descent to Havana-Jose Martí-Rancho Boyeros Airport and was cleared for an approach to runway 05. The crew encountered poor visibility due to foggy conditions and failed to realize his altitude was too low after he initiated the final approach too late, causing the aircraft to be 64 meters below the minimum descent altitude. The aircraft turned onto runway heading at a distance of 9 km from the runway threshold. According to the approach procedure, the aircraft should have done so at 14-15 km from the threshold. Despite he did not have the runway in sight, the captain decided to continue to descent until the aircraft passed below the decision height. At a distance of 1,820 meters from the runway threshold, the aircraft was approaching at a speed of 280 km/h and at a height of 23-25 meters when it struck power cables. Elevators separated and flaps on the right wing were torn off. The airplane then struck 22 palms, continued to descent until it crashed in flames 1,270 meters short of runway and 121 meters to the right of its extended centerline. Two passengers were seriously injured while 67 other occupants were killed. ", "probable_cause": "The accident was the consequence of several errors on part of the flying crew who failed to realize that the approach configuration was wrong. The approach was initiated too late (9 km iso 15 km) and the crew continued the descent below the glide due to a wrong altimeter setting. At the time of the accident, the visibility was below minimums due to foggy conditions and the crew failed to take corrective actions and to properly monitor the radio altimeter, causing the airplane to descend until it impacted with trees and ground. "}