{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-mount-pleasant", "date": "Apr 14, 2003 at 1140 LT", "type": "Rockwell Shrike Commander 500", "operator": "SCDNR_0", "flight_phase": "Takeoff (climb)", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Mount Pleasant - Mount Pleasant", "msn": "500-3160", "yom": 1973, "flight_number": null, "city": "Mount Pleasant", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4578, "captain_hours_type": 280, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11617, "circumstances": "According to the pilot, he requested the refueler to top off his fuel tanks with \"100 low lead fuel\". After refueling, the pilot performed a preflight including taking fuel samples from under the wings, draining the rear fuel drain, and checking the fuel cap for security. The engine start, run-up, and taxi were uneventful. The airplane departed runway 17 and was in a positive rate of climb. At approximately 200 feet AGL the airplane began to lose power. Shortly after the pilot ensured that the throttle, propeller, and mixture controls were in the full forward position, the airplane lost power in both engines. The pilot executed an emergency off field landing. Examination of the wreckage revealed that the left wing had broken off and the aft cabin area was crushed. According to the refueler, he stated that he mistakenly used the Jet-A fuel truck instead of the AVGAS 100 low lead truck, and pumped 58 gallons of Jet-A into the airplane. Examination of the fuel samples taken from both engines revealed the left and right engine contained 70 percent of jet A fuel.", "probable_cause": "The improper refueling of the airplane by airport personnel with the incorrect fuel grade that resulted in a total loss in engine power on both engines during initial climb. A factor was the inadequate preflight inspection by the pilot in command."}