{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-223-cotonou-141-killed", "date": "Dec 25, 2003 at 1459 LT", "type": "Boeing 727-200", "operator": "Union%20des%20Transports%20Africains", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Conakry - Cotonou - Kufra - Beirut - Dubai", "msn": "21370", "yom": 1977, "flight_number": "GIH141", "city": "Cotonou-Cardinal Bernardin Gantin (ex Cadjehoun)", "zone": "Littoral", "country": "Benin", "region": "Africa", "crew_on_board": 10, "crew_fatalities": 5, "pax_on_board": 153, "pax_fatalities": 136, "other_fatalities": 0, "total_fatalities": 141, "captain_hours": 11000, "captain_hours_type": 8000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 67186, "circumstances": "Flight GIH 141 was a weekly scheduled flight, performed by the Union des Transports Africains (UTA), between Conakry (Guinea), Cotonou (Benin), Beirut (Lebanon) and Dubai (United Arab Emirates). A stopover at Kufra (Libya) was planned between Cotonou and Beirut. Having departed from Conakry at 10 h 07 with eighty-six passengers, including three babies, and ten crew members, the Boeing 727-223 registered 3X-GDO landed at Cotonou Cadjèhoun on 25 December 2003 at 12 h 25. Nine passengers disembarked. Sixty-three persons, including two babies, checked in at the airport check-in desk. Ten others, including one baby, boarded from an aircraft that had arrived from Lomé (Togo). Passenger boarding and baggage loading took place in a climate of great confusion. The airplane was full. In the cockpit, two UTA executives were occupying the jump seats. Faced with the particularly large number and size of the hand baggage, the chief flight attendant informed the Captain of the situation. The ground handling company’s agents began loading the baggage in the aft hold when one of the operator’s agents, who remains unidentified, asked them to continue loading in the forward hold, which already contained baggage. When the operation was finished, the hold was full. During this time, the crew prepared the airplane for the second flight segment. The co-pilot was discussing his concerns with the UTA executives, reminding them of the importance of determining the precise weight of the loading of the airplane. The flight plan for Kufra, signed by the Captain, was filed with the ATC office but the meteorological dossier that had been prepared was not collected. Fuel was added to fill up the airplane’s tanks (14,244 liters, or 11.4 metric tons). The accompanying mechanics added some oil. The Captain determined the limitations for the flight and selected the following configuration: flaps 25°, air conditioning units shut down. At 13 h 47 min 55, the crew began the pre-flight checklist. Calm was restored in the cockpit. At 13 h 52 min 12, flight GIH 141 was cleared to roll. The co-pilot was pilot flying (PF). The elevator was set at 6 ¾, it was stated that the takeoff would be performed with full power applied with brakes on, followed by a climb at three degrees maximum to gain speed, with no turn after landing gear retraction. As the roll was beginning, a flight attendant informed the cockpit that passengers who wanted to sit near their friends were still standing and did not want to sit down. The airline’s Director General called the people in the cabin to order. Take-off thrust was requested at 13 h 58 min 01, brake release was performed at 13 h 58 min 15. The airplane accelerated. In the tower, the assistant controller noted that the take-off roll was long, though he did not pay any particular attention to it. At 13 h 59, a speed of a hundred and thirty-seven knots was reached. The Captain called out V1 and Vr. The co-pilot pulled back on the control column. This action initially had no effect on the airplane’s angle of attack. The Captain called « Rotate, rotate »; the co-pilot pulled back harder. The angle of attack only increased slowly. When the airplane had hardly left the ground, it struck the building containing the localizer on the extended runway centerline, at 13 h 59 min 11. The right main landing gear broke off and ripped off a part of the underwing flaps on the right wing. The airplane banked slightly to the right and crashed onto the beach. It broke into several pieces and ended up in the ocean. The two controllers present in the tower heard the noise and, looking in the direction of the takeoff, saw the airplane plunge towards the ground. Immediately afterwards, a cloud of dust and sand prevented anything else being seen. The fire brigade duty chief stated that the airplane seemed to have struck the localizer building. The firefighters went to the site and noticed the damage to the building and the presence of a casualty, a technician who was working there during the takeoff. Noticing some aircraft parts on the beach, they went there through a service gate beyond the installations. Some survivors were still in the wreckage, others were in the water or on the beach. Some inhabitants from the immediate vicinity crowded around, complicating the rescuers’ task. The town fire brigade, the Red Cross and the Cotonou SAMU, along with some members of the police, arrived some minutes later.", "probable_cause": "The accident resulted from a direct cause:\r\n• The difficulty that the flight crew encountered in performing the rotation with an overloaded airplane whose forward center of gravity was unknown to them; and two structural causes:\r\n• The operator’s serious lack of competence, organization and regulatory documentation, which made it impossible for it both to organize the operation of the route correctly and to check the loading of the airplane;\r\n• The inadequacy of the supervision exercised by the Guinean civil aviation authorities and, previously, by the authorities in Swaziland, in the context of safety oversight.\r\nThe following factors could have contributed to the accident:\r\n• The need for air links with Beirut for the large communities of Lebanese origin in West Africa;\r\n• The dispersal of effective responsibility between the various actors, in particular the role played by the owner of the airplane, which made supervision complicated;\r\n• The failure by the operator, at Conakry and Cotonou, to call on service companies to supply information on the airplane’s loading;\r\n• The Captain’s agreement to undertake the take-off with an airplane for which he had not been able to establish the weight;\r\n• The short length of the runway at Cotonou;\r\n• The time of day chosen for the departure of the flight, when it was particularly hot;\r\n• The very wide margins, in particular in relation to the airplane’s weight, which appeared to exist, due to the use of an inappropriate document to establish the airplane’s weight and balance sheet; \r\n• The existence of a non-frangible building one hundred and eighteen meters after the runway threshold. "}