{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh86-express-ilfracombe-4-killed", "date": "Nov 15, 1934 at 0547 LT", "type": "De Havilland DH.86 Express", "operator": "Qantas2", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "No", "site": "Plain, Valley", "schedule": "London – Singapore – Darwin – Longreach – Brisbane – Sydney", "msn": "2311", "yom": 1934, "flight_number": null, "city": "Ilfracombe", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Longreach Airport at 0530LT bound for Brisbane with a crew of two and two passengers on board. Less than 20 minutes later, while flying at a height of some 1,000 feet, the aircraft went out of control and crashed in a prairie. Quickly on the scene, local residents were able to evacuate the captain who was seriously injured while all three others occupants were killed. Unfortunately, the captain died from his injuries few hours later. Weather conditions were excellent at the time of the accident and the crew was performing a delivery flight from London when the accident occurred. The aircraft was named 'Adelaide'.\r\nCrew:\r\nR. A. Prendergast, pilot,\r\nW. C. Creastes, copilot.\r\nPassengers:\r\nF. R. Charlton, engineer by Imperial Airways,\r\nE. H. Broadfoot, serviceman by Shell Company at Sydney-Mascot Airport. ", "probable_cause": "Investigators expressed concern at apparent defects in the forward pin post, posing the question that a failure in that component apparently caused the loss of control. Further investigation revealed that VH-USG had been loaded with a spare engine in the rear of the cabin, and that one of the crew members was in the lavatory in the extreme aft of the cabin when control was lost. It was theorized that the aft center of gravity condition that thus existed resulted in a loss-of-control at an altitude insufficient for recovery (the aircraft was at an estimated height of 1,000 ft (300 m) prior to the crash."}