{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-gillam", "date": "Apr 24, 2019 at 1823 LT", "type": "Beechcraft 200 Super King Air", "operator": "Keewatin%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Winnipeg – Churchill – Rankin Inlet", "msn": "BB-979", "yom": 1982, "flight_number": "KEW202", "city": "Gillam", "zone": "Manitoba", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1350, "captain_hours_type": 1100, "copilot_hours": 3500, "copilot_hours_type": 1350, "aircraft_hours": null, "circumstances": "On 24 April 2019, the Keewatin Air LP Beechcraft B200 aircraft (registration C‑FRMV, serial number BB979), equipped to perform medical evacuation flights, was conducting an instrument flight rules positioning flight (flight KEW202), with 2 flight crew members and 2 flight nurses on board, from Winnipeg/James Armstrong Richardson International Airport, Manitoba, to Rankin Inlet Airport, Nunavut, with a stop at Churchill Airport, Manitoba. At 1814 Central Daylight Time, when the aircraft was cruising at flight level 250, the flight crew declared an emergency due to a fuel issue. The flight crew diverted to Gillam Airport, Manitoba, and initiated an emergency descent. During the descent, both engines flamed out. The flight crew attempted a forced landing on Runway 23, but the aircraft touched down on the frozen surface of Stephens Lake, 750 feet before the threshold of Runway 23. The landing gear was fully extended. The aircraft struck the rocky lake shore and travelled up the bank toward the runway area. It came to rest 190 feet before the threshold of Runway 23 at 1823:45 Central Daylight Time. None of the occupants was injured. The aircraft sustained substantial damage. The 406 MHz emergency locator transmitter activated. Emergency services responded. There was no fire.", "probable_cause": "Findings as to causes and contributing factors:\r\nThese are conditions, acts or safety deficiencies that were found to have caused or contributed to this occurrence.\r\n1. When the captain asked if the aircraft was ready for the flight, the first officer replied that it was, not recalling that the aircraft required fuel.\r\n2. While performing the FUEL QUANTITY item on the AFTER START checklist, the captain responded to the first officer’s prompt with the rote response that the fuel was sufficient, without looking at the fuel gauges. \r\n3. The aircraft departed Winnipeg/James Armstrong Richardson International Airport with insufficient fuel on board to complete the planned flight. \r\n4. The flight crew did not detect that there was insufficient fuel because the gauges had not been included in the periodic cockpit scans.\r\n5. When the flight crew performed the progressive fuel calculation, they did not confirm the results against the fuel gauges, and therefore their attention was not drawn to the low-fuel state at a point that would have allowed for a safe landing.\r\n6. Still feeling the effect of the startle response to the fuel emergency, the captain quickly became task saturated, which led to an uncoordinated response by the flight crew, delaying the turn toward Gillam Airport, and extending the approach.\r\n7. The right engine lost power due to fuel exhaustion when the aircraft was 1 nautical mile from Runway 23. From that position, a successful forced landing on the intended runway was no longer possible and, as a result, the aircraft touched down on the ice surface of Stephens Lake, short of the runway.\n\r\nFindings as to risk:\r\nThese are conditions, unsafe acts or safety deficiencies that were found not to be a factor in this occurrence but could have adverse consequences in future occurrences.\r\n1. If procedures are not developed to instruct pilots on their roles and responsibilities during line indoctrination flights, there is a risk that flight crew members may not participate when expected, or may work independently towards different goals.\n\r\nOther findings:\r\nThese items could enhance safety, resolve an issue of controversy, or provide a data point for future safety studies.\r\n1. Because emergency medical services and the fire department were not notified immediately about the declared emergency, they were not on site before the aircraft arrived at Gillam Airport."}