{"url": "https://www.baaa-acro.com/crash/crash-lockheed-hc-130p-hercules-pacific-ocean-10-killed", "date": "Nov 22, 1996 at 1846 LT", "type": "Lockheed C-130 Hercules", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Military", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Portland - North Island", "msn": "4072", "yom": 1965, "flight_number": "King 56", "city": "Pacific Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 11, "crew_fatalities": 10, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Based upon digital flight data recorded (DFDR) information, the mishap aircraft departed Portland IAP at 1720 PST on 22 Nov 96 on an instrument flight rules (IFR) flight en route to North Island Naval Air Station. The purpose of the sortie was to conduct an overwater navigation evaluation. King 56 began the sortie with a normal takeoff, departure and climbout. One hour and 24 minutes after takeoff in level flight at FL 220 the mishap sequence began with the engineer commenting on a torque flux on the number 1 engine. Nothing on the cockpit voice recorder (CVR), the DFDR, or the survivor’s testimony suggested any unusual events prior to the engineer’s comment. Over the next three minutes, the operations of all four engines became unstable and eventually failed. Crew actions during these critical three minutes are known only by verbal comments on the CVR and the survivor’s testimony. The following discusses what we know of those actions. The engineer called for n°1 propeller to be placed in mechanical governing. This would normally remove electrical inputs to the propeller through the synchrophaser. The pilot then called for all four propellers to be placed in mechanical governing. This action was consistent with treating this emergency as a four-engine rollback. There is no indication on the DFDR or the CVR as to whether or not the crew selected mechanical governing on any of the remaining three propellers. At the same time the crew was analyzing the emergency, they also declared an in-flight emergency with Oakland ARTCC and turned the mission aircraft east to proceed toward Kingsley Field, Klamath Falls, OR, approximately 230 miles away and approximately 80 miles from the coast. The Radio Operator radioed the USCG Humboldt Bay Station and notified them of the in-flight emergency. During the turn toward the shore the number 3 and number 4 engines once briefly recovered most of their torque. These increases are recorded by the flight data recorder. When the RPM on number 3 (the aircraft’s last functioning engine) finally decreased below 94% RPM the last generator producing electrical power dropped off line due to low frequencies. As a result, at 1846 Pacific Standard Time all electrical power was lost. After a brief period, power was restored to the equipment powered by the battery bus. From this point on, the aircraft glided to the attempted ditching. There is no record of that portion of the flight, except the survivor’s testimony.The outboard wing sections and all four engines separated from the center wing section that in turn separated from the fuselage. Subsequently, the engines and fuselage went straight to the ocean floor at a depth of approximately 5500 feet.  The outer wing and the center wing sections floated on the surface for several days and sank more than 50 nm from the impact location. The radio navigator was rescued while 10 other crew members were killed.", "probable_cause": "Fuel starvation for unknown reasons. "}