{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-8-103-hammerfest", "date": "May 1, 2005 at 1436 LT", "type": "De Havilland DHC-8-100 (Dash-8)", "operator": "Wideroe_1", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tromsø – Hammerfest", "msn": "394", "yom": 1995, "flight_number": "WF921", "city": "Hammerfest", "zone": "Finnmark", "country": "Norway", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 27, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12900, "captain_hours_type": 5500, "copilot_hours": 2100, "copilot_hours_type": 60, "aircraft_hours": 20462, "circumstances": "Widerøe flight WIF 921 took off from Tromsø airport (ENTC) at time 1401 with an estimated landing time at Hammerfest airport (ENHF) 1442. On board the aircraft, a DHC-8-103 with registration LN-WIK, were a crew of two pilots and one cabin attendant, 26 fare paying passengers and one passive cabin attendant. The crew had taken off from ENHF earlier in the day, when the weather and wind did not cause any problems. During the approach to ENHF the crew was informed about variable and occasional gusty wind from south-east. The wind direction favoured runway 23 and the crew planned the landing accordingly. The copilot was Pilot Flying (PF) and the commander was Pilot Not Flying (PNF). The copilot was newly hired and was flying under supervision. The crew was kept updated on the wind conditions by the AFIS operator, and at times the gusty wind conditions favoured runway 05. The copilot left the control to the commander who continued the approach to runway 05. Just before landing the wind direction veered to the right and increased in strength, resulting in a significant tail wind component. This resulted in a marked increase in the descent rate which the commander tried to stop by advancing to full power. However, the altitude was too low and the airplane touched down hard just inside the runway edge on runway 05. At touch down the right main landing gear leg failed. The airplane slid on the belly, right partly retracted main wheel and wing tip for some 650 m, and stopped just after the second (TWY B) turnoff to the apron. The fire and rescue vehicles were quickly at the scene and sprayed foam on the plane to prevent fire. The cabin attendant calmed the passengers who wanted to get out of the plane quickly due to smoke and burned smell in the cabin. It took 33 seconds from the commander ordered evacuation until this was initiated. The delay was mainly caused by the fact that the order did not get through the cabin’s Public Address (PA) system.", "probable_cause": "The investigations show that Widerøe permitted landings in up to the maximum demonstrated crosswind component of 36 kt and in up to 10 kt tail wind during short field operations. AIBN recommends that Widerøe should review the wind limitations and prohibit tail wind component during landings on short runways in conditions with large variations in wind direction and strength. AIBN is issuing 7 safety recommendations."}