{"url": "https://www.baaa-acro.com/crash/crash-boeing-767-323er-chicago", "date": "Oct 28, 2016 at 1435 LT", "type": "Boeing 767-300", "operator": "American-Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago – Miami", "msn": "33084", "yom": 2003, "flight_number": "AA383", "city": "Chicago-O'Hare", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 9, "crew_fatalities": 0, "pax_on_board": 161, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17400, "captain_hours_type": 4000, "copilot_hours": 22000, "copilot_hours_type": 1846, "aircraft_hours": 50632, "circumstances": "On October 28, 2016, about 1432 central daylight time, American Airlines flight 383, a Boeing 767-323, N345AN, had started its takeoff ground roll at Chicago O’Hare International Airport, Chicago, Illinois, when an uncontained engine failure in the right engine and subsequent fire occurred. The flight crew aborted the takeoff and stopped the airplane on the runway, and the flight attendants initiated an emergency evacuation. Of the 2 flight crewmembers, 7 flight attendants, and 161 passengers on board, 1 passenger received a serious injury and 1 flight attendant and 19 passengers received minor injuries during the evacuation. The airplane was substantially damaged from the fire. The airplane was operating under the provisions of 14 Code of Federal Regulations Part 121. Visual meteorological conditions prevailed at the time of the accident. The uncontained engine failure resulted from a high-pressure turbine (HPT) stage 2 disk rupture. The HPT stage 2 disk initially separated into two fragments. One fragment penetrated through the inboard section of the right wing, severed the main engine fuel feed line, breached the fuel tank, traveled up and over the fuselage, and landed about 2,935 ft away. The other fragment exited outboard of the right engine, impacting the runway and fracturing into three pieces. Examination of the fracture surfaces in the forward bore region of the HPT stage 2 disk revealed the presence of dark gray subsurface material discontinuities with multiple cracks initiating along the edges of the discontinuities. The multiple cracks exhibited characteristics that were consistent with low-cycle fatigue. (In airplane engines, low-cycle fatigue cracks grow in single distinct increments during each flight.) Examination of the material also revealed a discrete region underneath the largest discontinuity that appeared white compared with the surrounding material. Interspersed within this region were stringers (microscopic-sized oxide particles) referred to collectively as a “discrete dirty white spot.” The National Transportation Safety Board’s (NTSB) investigation found that the discrete dirty white spot was most likely not detectable during production inspections and subsequent in-service inspections using the procedures in place. The NTSB’s investigation also found that the evacuation of the airplane occurred initially with one engine still operating. In accordance with company procedures and training, the flight crew performed memory items on the engine fire checklist, one of which instructed the crew to shut down the engine on the affected side (in this case, the right side). The captain did not perform the remaining steps of the engine fire checklist (which applied only to airplanes that were in flight) and instead called for the evacuation checklist. The left engine was shut down as part of that checklist. However, the flight attendants had already initiated the evacuation, in accordance with their authority to do so in a life-threatening situation, due to the severity of the fire on the right side of the airplane. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was the failure of the high-pressure turbine (HPT) stage 2 disk, which severed the main engine fuel feed line and breached the right main wing fuel tank, releasing fuel that resulted in a fire on the right side of the airplane during the takeoff roll. The HPT stage 2 disk failed because of low-cycle fatigue cracks that initiated from an internal subsurface manufacturing anomaly that was most likely not detectable during production inspections and subsequent in-service inspections using the procedures in place. Contributing to the serious passenger injury was (1) the delay in shutting down the left engine and (2) a flight attendant’s deviation from company procedures, which resulted in passengers evacuating from the left overwing exit while the left engine was still operating. Contributing to the delay in shutting down the left engine was (1) the lack of a separate checklist procedure for Boeing 767 airplanes that specifically addressed engine fires on the ground and (2) the lack of communication between the flight and cabin crews after the airplane came to a stop."}