{"url": "https://www.baaa-acro.com/crash/crash-fokker-50-nairobi-0", "date": "Jan 4, 2015 at 1102 LT", "type": "Fokker 50", "operator": "Skyward%20Express", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Wajir – Nairobi", "msn": "20167", "yom": 1989, "flight_number": null, "city": "Nairobi-Jomo Kenyatta (ex Embakasi)", "zone": "Nairobi City District", "country": "Kenya", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17000, "captain_hours_type": 1200, "copilot_hours": 4143, "copilot_hours_type": 200, "aircraft_hours": null, "circumstances": "On 4 January 2015, about 0840 local time, a Fokker 27-50 a cargo flight, registration 5Y-SIB, operated by Skyward Express Ltd, experienced a gear-up landing at Jomo Kenyatta International Airport (HKJK). The flight had diverted to HKJK due to a mechanical malfunction of the landing gear. Visual meteorological conditions prevailed and the airplane was on an IFR flight plan. None of the ten persons on board were injured. The airplane was substantially damaged and there was no fire. The flight originated at Wajir (HKWJ) and the original destination was Nairobi-Wilson Airport (HKNW). During the departure from HKWJ, the flight sustained a bird-strike. After taking steps to confirm any aircraft system malfunction the aircraft systems were still operable and the flight crew elected to continue the flight. The flight en route was without any incident. While in the traffic pattern at Wilson, the landing gear was activated to extend and it resulted in an unsafe indication for the left main gear. During the period of about an hour while circling overhead the airport, the flight crew attempted to resolve the anomaly but they were unsuccessful. It prompted the crew to declare an emergency after they had confirmed that the left main landing gear was locked up in the air position and was not lowering. After declaring an emergency, the crew carried out an extensive consultation with the air traffic services and the company ground personnel and elected to divert the flight to Jomo Kenyatta International Airport (HKJK). The crew made a successful gear-up landing at Jomo Kenyatta International Airport (HKJK) runway 06 with no injury to those onboard the flight however the aircraft sustained substantial damage. The aircraft got disabled after landing and blocked both runways for more than four hours as the airport authorities struggled to remove it to pave way for other operations. According to the report obtained from post-accident interview with the flight crew at 0540 the aircraft took-off at Wajir (HKWJ) on runway 15 and immediately after take-off on passing 200ft at a speed of Vref +10 Knots the crew noticed a flock of birds and tried to evade them. While increasing the aircraft rate of climb they felt like a thud (hitting something). After clearing the flock they inspected the instruments and confirmed all aircraft systems were functioning satisfactorily. They then proceeded with their flight as intended. According to the air traffic control (ATC) transcript obtained from Wilson control tower upon entering Wilson aerodrome traffic circuit at 0641:41 the crew requested ATC to join downwind runway 07 and was immediately cleared. After five minutes (0646:50) the crew requested ATC to extend downwind and at 0648:03 the crew confirms to the ATC that they are checking the undercarriage. At 0654:08 the crew confirms to the ATC that they have an emergency on the left main landing gear and they have checked it is locked up in the air position. The crew requested for more time to trouble-shoot the problem and requested ATC to brief their company about the problem. At 0731:07 the crew confirmed to HKNW air traffic service unit that they are ready to do gear-up landing and they would prefer HKJK instead of HKNW. They are then cleared for HKJK to join left base runway 06. 30 seconds later the crew changes their intention to go to HKJK and confirms to HKNW ATC that they would do a gear-up landing at HKNW and requests for more time. At 0749:31 the crew consults with their company through HKNW ATC and agrees to carry out the gear-up landing at HKJK and the flight was cleared to proceed to HKJK. At 0802 the crew made a successful gear-up landing on runway 06 at HKJK. ", "probable_cause": "The cause of the accident was the failure of the left Main Landing Gear, MLG to extend during landing due to a bird strike which disabled proper functioning of the mechanical system that controls the opening and closing the door to the left MLG."}