{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-12-santa-fe-1-killed", "date": "Sep 29, 2008 at 2216 LT", "type": "Pilatus PC-12", "operator": "Gardner Leasing", "flight_phase": "Landing (descent or approach)", "flight_type": "Delivery", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "New York - Lubbock - Santa Fe", "msn": "1020", "yom": 2008, "flight_number": null, "city": "Santa Fe", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2437, "captain_hours_type": 86, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 130, "circumstances": "The pilot was approaching his home airport under dark night conditions. He reported that he was five miles from the airport and adjusted the airport lighting several times. He made no further radio calls, though his normal practice was to report his position several times as he proceeded in the landing pattern. The airplane approached the airport from the southeast in a descent, continued past the airport, and adjusted its course slightly to the left. One witness reported observing the airplane enter a left turn, then pitch down, and descend at a steep angle. The airplane impacted terrain in a steep left bank and cart wheeled. An examination of the airframe, airplane systems, and engine revealed no pre-impact anomalies. Flight control continuity was confirmed. The pilot had flown eight hours and 30 minutes on the day of the accident, crossing two time zones, and had been awake for no less than 17 hours when the accident occurred. The accident occurred at a time of day after midnight in the pilot's departure time zone. Post-accident toxicology testing revealed doxylamine and amphetamine in the pilot's tissues. The pilot had been diagnosed with attention deficit hyperactivity disorder (ADHD) almost five years prior to the accident and had taken prescription amphetamines for the disorder since that diagnosis. The FAA does not medically certify pilots who require medication for the control of ADHD. At the time of the accident, the pilot's blood level of amphetamines may have been falling, and he may have been increasingly fatigued and distracted. The use of doxylamine (an over-the-counter antihistamine, often used as a sleep aid) could suggest that the pilot was having difficulty sleeping.", "probable_cause": "The pilot's incapacitation due to fatigue resulting in an in-flight collision with terrain."}