{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-42-720-cheyenne-iii-prescott-5-killed", "date": "Oct 18, 2006 at 1347 LT", "type": "Piper PA-42 Cheyenne", "operator": "Flying Moose", "flight_phase": "Flight", "flight_type": "Aerial photography", "survivors": "No", "site": "Plain, Valley", "schedule": "Prescott - Prescott", "msn": "42-8001032", "yom": 1981, "flight_number": null, "city": "Prescott", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 4363, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5317, "circumstances": "The pilot of a MiG 21 and the pilot of a Piper PA-42 Cheyenne III met just prior to the flight to discuss the flight in which the Cheyenne pilot would be taking aerial photos of the MiG. The two pilots established a minimum altitude of 2,500 to 3,000 feet agl and 200 knots as their minimum airspeed. The pilots did not establish a minimum separation distance, as it was not intended to be a formation flight. The MiG pilot reported that after takeoff the aircraft experienced a problem with the landing gear retraction. The pilot recycled the landing gear and a successful gear retraction was indicated. The MiG pilot notified the Cheyenne pilot of the situation and the Cheyenne pilot indicated that they would join up with the MiG, look it over and check-out the landing gear, and let the MiG pilot know what they saw. The MiG pilot flew at 9,000 feet msl in a 30-degree right hand turn at 200 knots (about 90 percent power set) with approach flaps selected (approximately 25 degrees) until the Cheyenne met up with the MiG. The MiG pilot reported that he observed the Cheyenne meet up with him at his 5 o'clock position about 300-400 feet behind him and about the same altitude. In this position, the Cheyenne was in the direct path of the high velocity jet core exhaust from the MiG. The MiG pilot looked forward and when he looked back, he could not see the Cheyenne. The Cheyenne pilot then contacted the MiG pilot and made a comment about the right landing gear or gear door, but the statement was not completed. The MiG pilot did not hear back from the Cheyenne pilot. The MiG pilot then observed smoke rising from the desert terrain and notified air traffic control. The airport manager that was monitoring the conversation between the two aircraft stated that he heard the Cheyenne pilot indicate that he would \"drop down and go underneath and let you know how it looks.\" Wreckage documentation noted that the main wreckage was located in an inverted position on flat terrain. The T-tail, which consisted of the upper half of the vertical stabilizer, horizontal stabilizer, and elevator had separated in flight and was located about 1/2 mile south of the main wreckage. Inspection of the upper portion of the aft vertical spar displayed a right bend and twist at the point of separation. No evidence of pre-existing cracks, corrosion or wear was noted to the material. Inspection of the MiG aircraft found no evidence of contact between the two aircraft.", "probable_cause": "The failure of the pilot following a jet aircraft to maintain adequate separation from the high velocity jet core exhaust. The separation of the T-tail upper section vertical stabilizer of the following aircraft due to contact with the high velocity jet core exhaust was a factor."}