{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-ii-marthas-vineyard", "date": "Jan 30, 2001 at 1835 LT", "type": "Cessna 402", "operator": "Cape%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Providence – Martha’s Vineyard", "msn": "402C-0467", "yom": 1981, "flight_number": "9K415", "city": "Martha’s Vineyard", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1668, "captain_hours_type": 348, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 19131, "circumstances": "The pilot departed on a scheduled flight conducted under night instrument meteorological conditions. Arriving in the area of the destination airport, the weather was reported as, winds from 220 degrees at 18 knots, gusts to 25 knots; 1/2 statute miles of visibility and haze; vertical visibility of 100 feet. The pilot was vectored and cleared for the ILS 24 approach. As the airplane crossed the glideslope, the pilot observed that the \"ride\" became increasingly bumpy and turbulent, with a strong wind component from the right. The approach lights came into view as the airplane neared the runway, but soon disappeared due to the low visibility. The pilot executed a missed approach, and as full power was applied, the airplane began to move laterally to the left. During the missed approach, a \"thunk\" was heard on the left side of the fuselage, and the airplane descended into the trees. The airplane came to rest in a wooded area about 1/4 mile from the Runway 24 threshold, about 1,000 feet to the left of the extended centerline. Review of the approach plate for the ILS 24 approach revealed that the glide slope altitude at the final approach fix for the non-precision approach, which was located about 4 miles from the approach end of the runway, was 1,407 feet. The glide slope altitude at the middle marker, which was located about 0.6 miles from the approach end of the runway, was 299 feet. Review of radar data revealed that the airplane intercepted the glideslope about 4 miles from the threshold of runway 24. In the following 2 minutes, 30 seconds, the airplane deviated below and returned to the glideslope centerline approximately 4 times, with a maximum deviation of 2-dots below the glideslope centerline. About 1-mile from the runway, the airplane began a trend downward from the glideslope centerline, descending below the 2- dot low deviation line of the glideslope to an altitude of about 300 feet, when the last radar hit was recorded. During the approach, the airplane's ground speed varied between 50 and 125 knots. According to the Aeronautical Information Manual chapter on Navigation Aids, Instrument Landing System (ILS), it stated that \"Make every effort to remain on the indicated glide path.\" It also cautioned the pilot to, \"Avoid flying below the glide path to assure obstacle/terrain clearance is maintained.\"\n", "probable_cause": "The pilot's failure to maintain a stabilized approach with an adequate vertical and lateral track. Also causal was his failure to maintain obstacle clearance."}