{"url": "https://www.baaa-acro.com/crash/crash-avro-652-anson-i-guisborough-4-killed", "date": "Sep 11, 1937 at 1045 LT", "type": "Avro 652 Anson", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Mountains", "schedule": "Thornaby - Thornaby", "msn": null, "yom": null, "flight_number": null, "city": "Guisborough", "zone": "Yorkshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At around 06.50hrs on Saturday, 11th September 1937 this aircraft took off from Thornaby airfield with its crew instructed to carry out a Home Fleet exercise over a wide area off the east coast of Scotland. The crew of this aircraft carried out their task and made their return south with the aim of returning to Thornaby and they passed Newcastle just before 10.00hrs, the weather became poor as they flew south and thick fog was present towards the mouth of the River Tees. The crew making their way along the coastline towards the Middlesbrough area to return to Thornaby airfield and it was thought that the navigator had missed the turn inland when over the Tees estuary because of the poor visibility. Flying at a height of 750 feet the aircraft passed over Guisborough, but it was later believed that those on the aircraft mistook Guisborough to have been Greatham as the two towns looked similar from above and in the bad visibility the mistake could be made. The aircraft flew over Guisborough at low height and ploughed into the hillside above Belmont Mine at 10.45hrs killing all four on board instantly. Local people had heard the plane fly over just before the accident and also heard the engines fall silent after the resulting crash, many local people made their way up onto the moor to try and locate the site which they could not see because of the fog from the town below. Nothing could be done for the airmen, they were certified dead at the scene and were later carried down from the moor and taken to the Admiral Chaloner Hospital in Guisborough where they lay until removal for burial.\r\nCrew:\r\nP/O Leonard W. Lowden, \r\nP/O Hugh G. McDonald,\r\nP/O David Sorley Munro,\r\nAC1 Thomas Douglas.\r\nSource: www.yorkshire-aircraft.co.uk", "probable_cause": "Navigation error. "}