{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-2c3-carajas-1-killed", "date": "Feb 14, 1997 at 1234 LT", "type": "Boeing 737-200", "operator": "Varig.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Belém – Marabá – Carajás – Brasília", "msn": "21013", "yom": 1974, "flight_number": "RG265", "city": "Carajás-Parauapebas", "zone": "Pará", "country": "Brazil", "region": "South America", "crew_on_board": 6, "crew_fatalities": 1, "pax_on_board": 48, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6138, "captain_hours_type": 2478, "copilot_hours": 1720, "copilot_hours_type": 1464, "aircraft_hours": null, "circumstances": "The aircraft departed Belém-Val de Cans Airport on a flight to Brasília with intermediate stops in Marabá and Carajás, carrying 48 passengers and a crew of six. The approach to Carajás-Parauapebas Airport was completed in poor weather conditions with rain falls, clouds down to 120 metres and a limited visibility due to rain and fog. On final the aircraft was unstable and landed hard on runway 10. On touchdown, the right main gear was torn off and the aircraft went out of control. It veered off runway to the right, collided with trees and eventually came to rest in a wooded area. The copilot was killed as the right side of the cockpit was destroyed upon impact. Ten other people were injured and 43 escaped unhurt. The aircraft was destroyed. ", "probable_cause": "The following findings were identified:\r\n- Lack of crew coordination, \r\n- The captain was overconfident, \r\n- The copilot showed a lack of self confidence, \r\n- The environment developed in the cockpit on approach allowed the pilots to deviate from the operational tasks primarily related to mutual controls, \r\n- Poor approach and landing planning which required a higher sink rate than normal, \r\n- The crew failed to make an approach briefing, \r\n- Insufficient application of controls, \r\n- The crew completed an unstable approach, \r\n- Weather conditions were below minimums, \r\n- The runway was not equipped with a lighting system but only with PAPIs,\r\n- The crew failed to initiate a go-around procedure as the landing was obviously missed. "}