{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-pelee-island-10-killed", "date": "Jan 17, 2004 at 1638 LT", "type": "Cessna 208B Grand Caravan", "operator": "Georgian%20Express", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Pelée Island – Windsor", "msn": "208B-0658", "yom": 1998, "flight_number": "GGN125", "city": "Pelée Island", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 3465, "captain_hours_type": 957, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7809, "circumstances": "On 17 January 2004, the occurrence pilot started his workday in Toronto, Ontario, reporting for duty at 0445 eastern standard time. In the morning, he completed flights in the Cessna 208B Caravan from Toronto to Windsor, Ontario, Windsor to Pelee Island, Ontario, and then Pelee Island to Windsor where the aircraft landed at 0916. At approximately 1500, the pilot received local weather and passenger information by telephone from the Pelee Island office personnel. The 1430 weather was reported as follows: ceiling 500 feet obscured, visibility two miles. There were eight male passengers for pick up at Pelee Island. One additional passenger was travelling with the pilot. There was no discussion concerning the amount of cargo to be carried or the passenger weights. At 1508, the pilot received a faxed weather package that he had requested from the Flight Information Centre (FIC) in London, Ontario. At 1523, the aircraft was refuelled in preparation for the scheduled 1600 departure to Pelee Island. The passengers were loaded earlier than usual to allow time for aircraft de-icing, as wet snow had accumulated on the fuselage and wings since the previous flight. At 1555, the aircraft was de-iced with Type 1 de-icing fluid, and it departed for Pelee Island at 1605 on an instrument flight rules (IFR) flight plan as Flight GGN125. At 1615, the pilot advised the Cleveland Control Centre, Ohio, United States, that he had Pelee Island in sight, was cancelling IFR, and was descending out of 5000 feet. The pilot also advised Cleveland that he would be departing IFR out of Pelee Island in about 20 minutes as GGN126 and asked if a transponder code could be issued. The Cleveland controller issued a transponder code and requested a call when GGN126 became airborne. The pilot advised that the flight would depart on Runway 27 then turn north. These were the last recorded transmissions from the aircraft. The aircraft landed at 1620. While on the ramp, two individuals voiced concern to the pilot that there was ice on the wing. Freezing precipitation was falling. The pilot was observed to visually check the leading edge of the wing; however, he did not voice any concern and proceeded with loading the passengers and cargo. At approximately 1638, GGN126 departed Pelee Island for Windsor. After using most of the runway length for take-off, the aircraft climbed out at a very shallow angle. No one on the ground observed the aircraft once it turned toward the north; however, witnesses who were not at the airport reported that they heard the sound of a crash, then no engine noise. A normal flight from Pelee Island to Windsor in the Cessna Caravan takes 15 to 20 minutes. Shortly after the aircraft departed, the ticket agent in Windsor received a call from Pelee Island reporting that a crash had been heard. At 1705, when the aircraft had not arrived, the ticket agent called Windsor tower. The pilot had not made contact with any air traffic services (ATS) facility immediately before or after departure, so there was nothing in the ATS system to indicate that the aircraft had taken off. It was, therefore, unaccounted for. There was no signal heard from the emergency locator transmitter (ELT). At 1710, the Windsor tower controller contacted the Rescue Coordination Centre in Trenton, Ontario, and a search was initiated. At 1908, the aircraft empennage and debris were spotted by a United States Coast Guard (USCG) helicopter on the frozen surface of the lake, about 1.6 nautical miles (nm) from the departure end of the runway. There were no survivors. The empennage sank beneath the surface some four hours later. The wreckage recovery was not fully completed until 13 days later.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. At take-off, the weight of the aircraft exceeded the maximum allowable gross take-off weight by at least 15 per cent, and the aircraft was contaminated with ice. Therefore, the aircraft was being flown significantly outside the limitations under which it was certified for safe flight.\r\n2. The aircraft stalled, most likely when the flaps were retracted, at an altitude or under flight conditions that precluded recovery before it struck the ice surface of the lake. \r\n3. On this flight, the pilotís lack of appreciation for the known hazards associated with the overweight condition of the aircraft, ice contamination, and the weather conditions was inconsistent with his previous practices. His decision to take off was likely adversely affected by some combination of stress and fatigue.\r\nFindings as to Risk:\r\n1. Despite the abbreviated nature of the September 2001 audit, the next audit of Georgian Express Ltd. was not scheduled until September 2004, at the end of the 36-month window.\r\n2. The internal communications at Transport Canada did not ensure that the principal operations inspector responsible for the air operator was aware of the Pelee Island operation.\r\n3. The standard passenger weights available in the Aeronautical Information Publication at the time of the accident did not reflect the increased average weight of passengers and carry-on baggage resulting from changes in societal-wide lifestyles and in travelling trends.\r\n4. The use of standard passenger weights presents greater risks for aircraft under 12 500 pounds than for larger aircraft due to the smaller sample size (nine passengers or less) and the greater percentage of overall aircraft weight represented by the passengers. The use of standard passenger weights could result in an overweight condition that adversely affects the safety of flight.\r\n5. The Cessna Caravan de-icing boot covers up to a maximum of 5% of the wing chord. Research on this wing has shown that ice accumulation beyond 5% of the chord can result in degradation of aircraft performance.\r\n6. At the Pelee Island Airport, the air operator did not provide the equipment that would allow an adequate inspection of the aircraft for ice during the pre-flight inspection and did not provide adequate equipment for aircraft de-icing.\r\n7. Repetitive charter operators are not considered to be scheduled air operators under current Transport Canada regulations, and, therefore, even though the charter air operator may provide a service with many of the same features as a scheduled service, Transport Canada does not provide the same degree of oversight as it does for a scheduled air operator.\r\n8. A review of the Canadian Aviation Regulations regarding simulator training requirements indicates that there is no requirement to conduct recurrent simulator training if currency and/or pilot proficiency checks do not lapse.\r\n9. Commercial Air Service Standard 723.91(2) does not clearly indicate whether there is a requirement for simulator training following expiration of a pilot proficiency check. \r\n10. Incorrect information on the passenger door placards, an incomplete safety features card, and the fact that the operating mechanisms and operating instructions for the emergency exits were not visible in darkness could have compromised passenger egress in the event of a survivable accident.\r\n11. The dogs being carried on the aircraft were not restrained, creating a hazard for the flight and its occupants."}