{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh18a-thieuloy-saint-antoine-2-killed", "date": "Apr 7, 1922 at 1400 LT", "type": "De Havilland DH.18", "operator": "Daimler%20Airways", "flight_phase": "Flight", "flight_type": "Postal (mail)", "survivors": "No", "site": "Plain, Valley", "schedule": "Croydon - Paris", "msn": "DH.18/04", "yom": 1921, "flight_number": null, "city": "Thieuloy-Saint-Antoine", "zone": "Oise", "country": "France", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was completing a regular schedule flight from Paris-Le Bourget to Croydon with three passengers and a crew of two on board. While cruising at a height of 500 feet in foggy conditions, the aircraft collided with a De Havilland DH.18A operated by Daimler Airway and registered G-EAWO. It appears that the DH.18 hit the upper left wing of the Farman which detached. Both aircraft crashed in an open field (a piece of wing crashed on the roof of a house) and were destroyed. While the British pilot was seriously injured, all other six occupants were killed. The only survivor died from his injuries few hours later. The collision occurred in Thieuloy-Saint-Antoine, some four km south of Grandvilliers and 27 km north of Beauvais, Oise. At the time of the accident, the visibility was reduced due to fog. First collision in commercial aviation history.\r\nCrew:\r\nRobin E. Duke, pilot\r\nEdward Hesterman, steward.", "probable_cause": "Both crews were apparently trying to maintain visual contact with the ground while flying under a low overcast, and must have simply failed to see each other in time to prevent the accident. It was also reported that G-EAWO had been slightly to the left of the proper course, maybe due to the inexperience of the pilot on this line. Priority rules should be the same in aviation as on the road but in the present case, experts confirmed these rules were not the same in UK and France. So new priority rules will come into force following this tragic event."}