{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-naylor-2-killed", "date": "May 27, 1990 at 1034 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Frank M. Adams", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Sewanee – Springfield", "msn": "46-8508024", "yom": 1985, "flight_number": null, "city": "Naylor", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1603, "captain_hours_type": 182, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After takeoff, the pilot received progressive altitude clearances to FL200. While cruising at FL200, he reported 'moderate chop.' At about 1025 cdt, he requested and received clearance to FL220. About 3 minutes later, he inquired about cloud tops and said he was 'in a layer right now at about flight level 200 to 210.' Soon thereafter, the aircraft began altitude deviations and went above the assigned altitude of FL220 (22,000 feet). It then descended to about 20,500 feet, where it pitched up to an altitude of about 23,000 feet. The aircraft then went into a steep descent. Subsequently, an in-flight breakup of the aircraft occurred at about the time it emerged from the clouds near the 2,000 feet level. Pieces of wreckage were found over a wide area. The left wing was found about 0.2 mile from the fuselage; pieces of the rudder and stabilizers were found about 100 yards from the fuselage. An exam of the fractures on major structural components revealed features typical of overstress separation. No preexisting cracks were found. An area forecast had flight predictions for IFR, thunderstorms, icing in the vicinity of convective activity. The pitot heat switch was found in the 'off' position. Both occupants were killed.    ", "probable_cause": "The pilot's failure to activate the pitot heat before flying in instrument meteorological conditions (IMC) above the freezing level, followed by his improper response to erroneous airspeed indications that resulted from blockage of the pitot tube by atmospheric icing."}