{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-6-islander-beaver-island-4-killed", "date": "Nov 13, 2021 at 1349 LT", "type": "Britten-Norman Islander", "operator": "Island%20Airways%20Michigan", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Charlevoix – Beaver Island", "msn": "185", "yom": 1970, "flight_number": null, "city": "Beaver Island", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On November 13, 2021, at 1349 eastern standard time, a Britten Norman BN-2A airplane, N866JA, was Substantially damaged when it was involved in an accident on Beaver Island, Michigan. The pilot and three passengers were fatally injured, and one passenger received serious injuries. The airplane was operated as a Title 14 Code of Federal Regulations (CFR) Part 135 air taxi flight. The airplane departed the Charlevoix Municipal Airport (CVX), at 1332, with the pilot and 4 passengers on-board. After departing CVX, the airplane turned north and proceeded directly toward the Welke Airport (6Y8), on Beaver Island, Michigan. The enroute portion of the flight was conducted about 1500 ft. above mean sea level (msl), and the airplane remained at this altitude until the it was about 3 nautical miles (nm) from 6Y. At this point, the airplane began descending and was maneuvered toward a straight-in approach to runway 35 at 6Y8. The Automatic Dependent Surveillance-Broadcast (ADS-B) data ended about 0.24 nm south of the accident site. The airplane impacted the ground about 110 ft east of the extended centerline of runway 35, and 320 ft south of the runway threshold. The turf runway was 3.500 ft long and had a displaced threshold just beyond its intersection with paved runway 9/27. Impact signatures indicated that the airplane struck the ground in a left wing low, nose low attitude. The front of the fuselage was crushed upward and aft. All major components of the airplane were located at the accident scene. Flight control continuity was established from the cockpit controls to each respective control surface except for cuts made by first responders for occupant extraction. Engine control continuity was established from the cockpit to each engine except for cuts made by first responders for occupant extraction. The wing flaps were found in an extended position.", "probable_cause": null}