{"url": "https://www.baaa-acro.com/crash/crash-antonov-24b-cairo-30-killed", "date": "Mar 18, 1966 at 1658 LT", "type": "Antonov AN-24", "operator": "United-Arab-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Berlin – Nicosia – Cairo", "msn": "57302009", "yom": 1965, "flight_number": "MS749", "city": "Cairo-Intl", "zone": "Cairo", "country": "Egypt", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 25, "pax_fatalities": 25, "other_fatalities": 0, "total_fatalities": 30, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Flight 749 took off from Nicosia at 15:49 for a flight to Cairo. Bad weather existed along the route and weather at destination Cairo was also worsening. The crew contacted Misrair Operations and requested information about possible airports for a diversion. The crew also reported they where flying in a thunderstorm with turbulent and icing conditions. One altimeter read 24000 feet while the other read 25000 feet, the magnetic compass was unserviceable and there was a crack in a cockpit window panel due to the thunderstorm. Possible like Alexandria, Port Said and El Arish were discussed, but the flight continued to Cairo. The flight was cleared for a runway 23 approach and landing, but nothing more was heard from the flight. The aircraft had crashed and caught fire 5 km from the runway.", "probable_cause": "The accident arose from the descent of the aircraft below the safe flight altitude in the final approach and the impact of the port wing against the sand dunes lying to the northeast of the aerodrome. As a result the pilot lost control of his aircraft and hit the ground. It is probable that the cause of descent of the aircraft below the safe level was due to the change from IFR to VFR, taking into consideration that considerable time would have been needed for the pilot to have adapted to this change in the prevailing weather conditions."}