{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-75-dl-axford-2-killed", "date": "Mar 11, 1944", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "USAAF", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Plain, Valley", "schedule": null, "msn": "19340", "yom": null, "flight_number": null, "city": "Ramsbury AFB", "zone": "Wiltshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the morning of Saturday 11th March 1944, during a routine glider tow training mission, a Horsa glider (LG891) became detached from its tow plane and landed in a large ploughed field just north of the small village of Axford. The pilot of the C-47 tow plane, Major Donald Bradley (who was also commanding officer of the 83rd Troop Carrier Squadron), inspected the field and decided that it would be possible to pull the glider out. He flew the short distance back to Ramsbury airfield, the squadron's home station, and picked up a new towrope. During the afternoon of the same day he returned to the field. Flying with him was 1st. Lt. Gaylord Strong, co-pilot; Captain Lee Gillette, 83rd Squadron Flight Surgeon; S/Sgt. Charles Dudenhoef, Crew Chief, and Lieutenant's Kenneth Weber and Robert Frank who were to act as the glider's pilot and co-pilot respectively. After flying low over the field several times Major Bradley landed the plane without difficulty and attached the new towrope. Meanwhile ‘Doc’ Gillette stationed an ambulance at the southern end of the field. The field was only 2,600 feet in length, it had been recently ploughed and chain harrowed and sloped in a southerly direction towards the valley floor. A road and an electric power line ran along its southern boundary and, at the time of take off, there was a 20 mph tail wind! There followed a lengthy discussion between the men present as to the feasibility of pulling the glider out of the field. Despite doubts expressed by others Major Bradley was confident that the task could be easily accomplished. The crew chief was given the option of remaining on the ground, which he chose, and his place in the aircraft was taken by Captain Gillette. All three men then clambered aboard the C-47 aircraft, Major Bradley sat in the left-hand cockpit seat, Lt. Strong on his right and ‘Doc’ Gillette below the Astral Dome. Both the glider pilots had installed themselves in the Horsa and were awaiting the signal to go. The brakes on the C-47 were released and the plane slowly picked up speed. As it became airborne Major Bradley realized that he was not going to clear the power cables and pulled back on the stick, causing the tail wheel to dig into the field. The plane then stalled before pitching into the ground, eventually coming to a rest in the River Kennet. The fuselage had broken in two and was facing in the direction from which it had come. Fortunately there was no fire. The glider pilot, although unable to see the tow aircraft through a cloud of dust, saw the flash of sparks as the C-47 hit the power cables and cut loose, before gliding across the valley to another field for a safe landing. Major Bradley suffered serious head injuries and died one hour later. Lt. Strong was also badly injured and died two days later in Burdrop hospital near Swindon. ‘Doc’ Gillette suffered severe damage to his back and was hospitalized for over a month, but eventually returned to his duties and remained with the group until the end of the war.\nSource: http://www.ramsburyatwar.com/crashes/c47axford.htm", "probable_cause": "The crash committee, consisting of Major Lucion Powell, Major Albert Bivings and Captain Richard Cathcart, concluded that Major Bradley was fully responsible for the accident. They said that despite his length of flying experience and his familiarity with glider operations, he exercised very poor judgement in trying to take off downwind with a glider in tow from a field of inadequate length with obstructions at the end."}