{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-skwentna-4-killed", "date": "Jul 5, 1997 at 0930 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Alaska Bush Carrier", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Anchorage - Chelatna Lake", "msn": "506", "yom": 1953, "flight_number": null, "city": "Skwentna", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3350, "captain_hours_type": 2200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13864, "circumstances": "The pilot boarded the 4 passengers and cargo (unsecured) for a chartered flight to a fishing lodge. The floatplane departed uneventfully. About 45 min. later, while cruising about 1,700 feet above rugged terrain and a river, the engine began to lose power and the floatplane descended. The pilot attempted a forced landing in a small lake that was 1,200 ft. in length and located about 1 mile west of the river. During the approach to landing, the airplane stalled and impacted swampy terrain at the lake's edge in a steep nose down attitude. An examination of the wreckage revealed that the no.1 engine exhaust pushrod had failed in fatigue just below the top (valve) ball end. Examination of the pushrod revealed that material had been pushed away from the rod during installation of the ball end. The fatigue crack may have initiated from a score mark produced by the installation. Pushrod life is reduced due to surface scratches. The life of the failed pushrod could not be determined. Insufficient information exists in the overhaul manual regarding pushrod life/inspection. ", "probable_cause": "A loss of engine power due to the fatigue failure of the no.1 exhaust push rod. Factors contributing to the accident were: insufficient information on pushrod inspection and overhaul from the manufacturer, unsuitable terrain available for landing, and the pilot's failure to maintain airspeed during the approach which led to an inadvertent stall."}