{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-235-new-orleans-153-killed", "date": "Jul 9, 1982 at 1608 LT", "type": "Boeing 727-200", "operator": "Pan%20Am.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "City", "schedule": "Miami - New Orleans - Las Vegas - San Francisco - San Diego", "msn": "19457", "yom": 1968, "flight_number": "PA759", "city": "New Orleans-Louis Armstrong (Moisant)", "zone": "Louisiana", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 138, "pax_fatalities": 138, "other_fatalities": 8, "total_fatalities": 153, "captain_hours": 11727, "captain_hours_type": 10595, "copilot_hours": 6127, "copilot_hours_type": 3914, "aircraft_hours": 39253, "circumstances": "Pan Am Flight 759 was a scheduled flight from Miami (MIA) to Las Vegas (LAS), with an en route stop at New Or1eans (MSY). At 15:58:48 Boeing 727 \"Clipper Defiance\" taxied from its gate at the New Orleans International Airport. Before leaving the gate, the flightcrew had received ATIS message Foxtrot which read in part \"....time one eight five five Zulu, weather, two thousand five hundred scattered, two five thousand thin broken, visibility six miles in haze, temperature niner zero, wind two four zero at two, winds are calm altimeter three zero zero one...\". The flightcrew requested runway 10 for the takeoff and ground control cleared the flight to taxi to runway 10. At 15:59:03, the first officer requested a wind check. Winds were 040 degrees at 8 knots. At 16:02:34, while Flight 759 was taxiing to runway 10, the crew heard a transmission from ground control, advising another airplane of low level wind shear alerts in the northeast quadrants of the airport. At 16:03:33, the first officer requested another wind check. Ground control replied, \"Wind now zero seven zero degrees at one seven... peak gusts two three, and we have low level wind shear alerts all quadrants, appears to be a frontal passing overhead right now, we're right in the middle of everything.\" The captain then advised the first officer to \"...let your airspeed build up on takeoff...\" and said that they would turn off the air conditioning packs for the takeoff, which would enable them to increase the EPR's on engines Nos. 1 and 3 to 1.92. The flightcrew completed the takeoff and departure briefings and turned onto the active runway for takeoff. At l6:06:22, Flight 759 informed the tower that it was ready for takeoff. The local controller cleared the flight for takeoff, and the first officer acknowledged the clearance. About 16:07:57, the Boeing 727 began its takeoff. According to witnesses, the airplane lifted off about 7,000 feet down runway 10, climbed in a wings-level attitude, reached an altitude of about 100 feet to 150 feet above the ground (AGL), and then began to descend towards trees. The airplane crashed into a residential area and was destroyed during the impact, explosion, and subsequent ground fire. Eight persons on the ground were killed.", "probable_cause": "The airplane's encounter during the lift-off and initial climb phase of flight with a micro-burst induced windshear which imposed a downdraft and a decreasing headwind, the effects of which the pilot would have had difficulty recognizing and reacting to in time for the airplane's descent to be arrested before its impact with trees. Contributing to the accident was the limited capability of current ground based low level windshear detection technology to provide definitive guidance for controllers and pilots for use in avoiding low level wind shear encounters."}