{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-melbourne-2-killed", "date": "Aug 10, 1979 at 1508 LT", "type": "Rockwell Shrike Commander 500", "operator": "Norfish", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Whitemark - Melbourne", "msn": "500-1810-20", "yom": 1968, "flight_number": null, "city": "Melbourne-Essendon", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8500, "captain_hours_type": 100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During the morning of August 9, 1979, the aircraft was refuelled to capacity and three drums, each with a capacity of 20 litres, were also filled with fuel and placed in the baggage compartment. The aircraft, loaded with freight, subsequently departed Essendon at 1335 hours and proceeded to Cambridge where it arrived at 1536 hours. The freight was unloaded and, at 1621 hours, the aircraft departed for Launceston where it arrived at 1653 hours. It was again loaded with freight and departed Launceston at 1720 hours bound for Flinders Island. The aircraft landed at Flinders Island several minutes after the end of daylight, which was at 1745 hours, and the freight was unloaded. On the following day, the aircraft was again loaded with freight and the pilot subsequently reported departure from Flinders Island at 1329 hours, bound for Essendon. The take-off run was observed to be longer than usual for this type of aircraft and its rate of climb appeared to be less than normal. The IFR flight plan notified by the pilot before departure indicated his intention to cruise at an altitude of 4500 feet but, at 1410 hours, he reported to Melbourne Flight Service Unit \"request traffic for a descent to proceed VFE we're getting 50 knot head wind here\". On being advised that there was no traffic information, the pilot reported leaving 4500 feet. At 1502 hours, the pilot established communication with Essendon Tower, reported approaching Channel 0 at 1500 feet, and \"request expedite clearance\". He was issued with a clearance to enter controlled airspace at 1500 feet tracking from Channel 0 to Essendon via Clifton Hill. At 1506 hours he reported at Clifton Hill and, at 1507:38 hours, he advised \"I'm sorry have a Mayday appear to have a fuel problem we'll have to land on a golf course\". On being asked \"which golf course?, the pilot replied \"oh right where we are now\". No further communications were received from the aircraft. The aircraft was observed by witnesses in the Northcote area initially on a north-westerly heading towards Essendon. E was seen to be descending and the sound of the engines was not normal. After flying over the northern section of the Northcote Municipal Golf Course, the aircraft commenced a descending left turn and [passed over a power transmission line which ran in a north-south direction near the western boundary of the golf course. As the turn continued towards an easterly heading, the aircraft again passed over the power line, at a very low height, and in strong tail wind conditions struck trees bordering a fairway while in a slightly left wing down, nose down, attitude. It struck the ground heavily just beyond the trees and the main wreckage travelled a further 73 metres before it came to rest on the edge of a green in the south-eastern corner of the golf course. Detailed examination of the wreckage of the aircraft revealed no evidence of any defect or malfunction which may have contributed to the accident. There was no significant fuel in the fuel systems of the two engines and there was negligible fuel in those cells of the fuel storage system which were undamaged. There  was no fire. The pilot was in full time employment as an airline captain with a major operator. He was also involved financially and managerially in Norfish Pty. Ltd. and both he and the Company had financial difficulties at that time. The flight plan submitted by the pilot before departure from Essendon on August 9 contained false names in respect of both the pilot and the operator. Neither the pilot nor Norfish Pty Ltd held a Charter or Aerial Work Licence. The maximum specified take-off weight for the aircraft was 3357 kg. for VFR operations and 3243 kg. for IFR operations. It has been calculated that the gross weight of the aircraft was 3775 kg. when it departed Essendon for Cambridge on 9.8.79 and 3746 kg. when it departed Launceston for Flinders Island on the same day. The calculated gross weight was 4061 kg. when it departed Flinders Island on the day of the accident. Although fuel was available at Cambridge and Launceston, the aircraft was not refuelled after it 'departed from Essendon. The three 20 litre drums were located in the aircraft wreckage and, although all were damaged, detailed examination indicated that they ruptured under the action of hydraulic shock and that they wert filled at the time of the accident. The total operating time of the aircraft from departure Essendon until the time of the accident was consistent with a fuel endurance which could be expected in the circumstances leading to this accident.\n", "probable_cause": "The cause of the accident was that the aircraft was operated with insufficient fuel to safely complete the flight."}