{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-32-houston", "date": "Feb 19, 1996 at 0904 LT", "type": "Douglas DC-9", "operator": "Continental%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Washington DC - Houston", "msn": "47423", "yom": 1970, "flight_number": "CO1943", "city": "Houston-George Bush-Intercontinental", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 82, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17500, "captain_hours_type": 5000, "copilot_hours": 2200, "copilot_hours_type": 575, "aircraft_hours": 63132, "circumstances": "The airplane landed wheels up and slid 6,850 feet before coming to rest in grass about 140 feet left of the runway centerline. The cabin began to fill with smoke, and the airplane was evacuated. Investigation showed that because the captain had omitted the 'Hydraulics' item on the in-range checklist and the first officer failed to detect the the error, hydraulic pressure was not available to lower the landing gear and deploy the flaps. Both the captain and the first officer recognized that the flaps had not extended after the flaps were selected to 15°. The pilots then failed to perform the landing checklist and to detect the numerous cues alerting them to the status of the landing gear because of their focus on coping with the flap extension problem and the high level of workload as a result of the rapid sequence of events in the final minute of flight. The first officer attempted to communicate his concern about the excessive speed of the approach to the captain. There were deficiencies in Continental Airlines' (COA) oversight of its pilots and the principal operations inspector's oversight of COA. COA was aware of inconsistencies in flightcrew adherence to standard operating procedures within the airline; however, corrective actions taken before the accident had not resolved this problem. ", "probable_cause": "The captain's decision to continue the approach contrary to Continental Airlines (COA) standard operating procedures that mandate a go-around when an approach is unstabilized below 500 feet or a ground proximity warning system alert continues below 200 feet above field elevation. The following factors contributed to the accident: \r\n(1) the flightcrew's failure to properly complete the in-range checklist, which resulted in a lack of hydraulic pressure to lower the landing gear and deploy the flaps; \r\n(2) the flightcrew's failure to perform the landing checklist and confirm that the landing gear was extended; \r\n(3) the inadequate remedial actions by COA to ensure adherence to standard operating procedures; and \r\n(4) the Federal Aviation Administration's inadequate oversight of COA to ensure adherence to standard operating procedures. "}