{"url": "https://www.baaa-acro.com/crash/crash-pac-750xl-pacific-ocean-1-killed", "date": "Dec 26, 2003 at 0601 LT", "type": "PAC 750XL - Pacific Aerospace Corporation", "operator": "PAC", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Hamilton – Pago Pago – Christmas Island – Kiribati – Hilo – Oakland", "msn": "103", "yom": 2003, "flight_number": null, "city": "Pacific Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 16564, "captain_hours_type": 180, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 65, "circumstances": "The pilot was ferrying the aircraft from Hamilton, New Zealand to Davis, California, via Pago Pago, American Samoa; Christmas Island, Kiribati; and Hilo, Hawaii. On the final leg, following a position report 858 nm from San Francisco, he reported a problem with his fuel system, indicating a probable ditching. Under the observation of a US Coast Guard HC-130 crew, the pilot ditched the aircraft at 1701 UTC, 341 nm from San Francisco, the aircraft nosing over on to its back as it touched down. The pilot did not emerge as expected and was later found by rescue swimmers, deceased, still in the cockpit. His body could not be recovered and was lost with the aircraft.", "probable_cause": "The following findings were reported:\r\n- The pilot was appropriately licensed, rated and experienced for the series of flights undertaken.\r\n- The aeroplane had a valid airworthiness certificate and had been released to service.\r\n- There was nothing (other than the item in 3.5) to suggest that the aeroplane was operating abnormally on the final flight.\r\n- The aeroplane was being operated at 14 000 feet pressure altitude without supplementary oxygen as required by CAR 91.209 and 91.533.\r\n- The left front fuel filler orifice was observed to be leaking fuel before departure.\r\n- There was no attempt made to further investigate or correct this fuel leak and the pilot stated that it would stop once he departed.\r\n- On most other aircraft this would be true, once the fuel level dropped away from the filler orifice and was no longer affected by aerodynamic suction.\r\n- On the 750XL, the fuel system design was such that the front tanks were continuously topped up.\r\n- The fuel loss would continue until all fuel in the rear tanks and the ferry system was consumed.\r\n- The front fuel caps are thus critical items to be checked before flight. \r\n- The fuel quantity uplifted at Hilo indicated that the problem had existed on the previous leg with a loss rate of up to 125 litres (33.2 US gallons) per hour.\r\n- A comparison of the uplift figure with the expected consumption on the previous leg should have provided sufficient warning to the pilot that a problem existed.\r\n- The existence of the problem could have been detected on the final flight by the shortened top-up intervals and by comparing fuel used by the engine with fuel remaining.\r\n- Cumulative delays, especially including the longer than normal final refuelling time, probably influenced the pilot’s decision to depart without further checking the reason for the fuel leak or the apparent discrepancy between fuel figures.\r\n- Cumulative fatigue, circadian rhythm and hypoxia were probably significant factors in the pilot’s failure to detect the fuel problem in flight, in time to make a safe return.\r\n- By the time the pilot announced that he had a fuel problem, the only course of action open to him was ditching the aeroplane.\r\n- The search and rescue facilities were activated appropriately, and had the potential to effect a successful rescue.\r\n- The water entry impact on ditching was reasonably severe and probably incapacitated the pilot before he could vacate the cockpit. "}