{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-b-grand-manan", "date": "Sep 12, 1997 at 2130 LT", "type": "Piper PA-31-310 Navajo", "operator": "Manan Air Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yarmouth - Grand Manan", "msn": "31-7812038", "yom": 1978, "flight_number": null, "city": "Grand Manan Islands", "zone": "New Brunswick", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Grand Manan, New Brunswick, at 1938 Atlantic daylight time (ADT) on a charter flight to Yarmouth, Nova Scotia, with the pilot and five passengers on board. After dropping off the passengers at Yarmouth, the aircraft departed at 2106 ADT for a night visual flight to return to Grand Manan. The pilot was unable to land at Grand Manan off the first visual approach because of low weather conditions and conducted a second visual approach. During the second approach, he noticed that he required increasing right rudder to maintain direction, and that the left engine manifold pressure was low. The pilot feathered the left propeller and, despite the application of full power on the right engine, the aircraft would not accelerate or climb. The aircraft began a shallow descent into a fog layer, and the aircraft collided with some trees, pitched nose-down, and struck the ground. The aircraft was destroyed by the impact and a post-impact fire. The pilot suffered serious injuries, but managed to get out of the aircraft and make his way to a nearby cabin where he was found by a ground search team about three hours later.", "probable_cause": "The aircraft lost power on the left engine during the approach for undetermined reasons and descended into the ground. The cause of the engine power loss was not determined. The low  airspeed, at the time of the engine power loss, decreased the time available to the pilot to secure the emergency in accordance with the POH, and contributed to the poor single-engine performance of the aircraft."}