{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-65-queen-air-san-carlos-3-killed", "date": "Sep 2, 2010 at 1151 LT", "type": "Beechcraft 65 Queen Air", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "San Carlos - Santa Clara", "msn": "LC-112", "yom": 1961, "flight_number": null, "city": "San Carlos", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 18000, "captain_hours_type": 6000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after takeoff for a repositioning flight for the airplane’s upcoming annual inspection, numerous witnesses, including the two air traffic controllers, reported observing the airplane climbing out normally until it was about 1/2 mile beyond the runway. The witnesses stated that the airplane then underwent a short series of attitude excursions, rolled right, and descended steeply into a lagoon. All radio communications between the airplane and the air traffic controllers were normal. Ground-based radar tracking data indicated that the airplane's climb to about 500 feet was normal and that it was airborne for about 40 seconds. Postaccident examination of the airframe, systems, and engines did not reveal any mechanical failures that would have precluded continued normal operation. Damage to both engines’ propeller blades suggested low or moderate power at the time of impact; however, the right propeller blades exhibited less damage than the left. The propeller damage, witness-observed airplane dynamics, and the airplane’s trajectory were consistent with a loss of power in the right engine and a subsequent loss of control due to airspeed decay below the minimum control speed (referred to as VMC). Although required by the Federal Aviation Administration (FAA)-approved Airplane Flight Manual, no evidence of a cockpit placard to designate the single engine operating speeds, including VMC, was found in the wreckage. The underlying reason for the loss of power in the right engine could not be determined. The airplane's certification basis (Civil Air Regulation [CAR] 3) did not require either a red radial line denoting VMC or a blue radial line denoting the single engine climb speed (VYSE) on the airspeed indicators; no such markings were observed on the airspeed indicators in the wreckage. Those markings were only mandated for airplanes certificated under Federal Aviation Regulation Part 23, which became effective about 3 years after the accident airplane was manufactured. Neither the Federal Aviation Administration (FAA) nor the airplane manufacturer mandated or recommended such VMC or VYSE markings on the airspeed indicators of the accident airplane make and model. In addition, a cursory search did not reveal any such retroactive guidance for any twin-engine airplane models certificated under CAR 3. Follow-up communication from the FAA Small Airplane Directorate stated that the FAA has \"not discussed this as a possible retroactive action... Our take from the accident studies is that because of the accident record with light/reciprocating engine twins, the insurance industry has restricted them to a select group of pilot/owners…\"  Toxicology testing revealed evidence consistent with previous use of marijuana by the pilot; however, it was not possible to determine when that usage occurred or whether the pilot might have been impaired by its use during the accident flight.", "probable_cause": "A loss of power in the right engine for undetermined reasons and the pilot’s subsequent failure to maintain adequate airspeed, which resulted in a loss of control. Contributing to the loss of control was the regulatory certification basis of the airplane that does not require airspeed indicator markings that are critical to maintaining airplane control with one engine inoperative. \n"}