{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-139-new-york", "date": "Apr 7, 1964 at 2302 LT", "type": "Boeing 707", "operator": "Pan%20Am.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Juan – New York", "msn": "17904", "yom": 1960, "flight_number": "PA212", "city": "New York-JFK", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 9, "crew_fatalities": 0, "pax_on_board": 136, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14629, "captain_hours_type": 711, "copilot_hours": 10433, "copilot_hours_type": 141, "aircraft_hours": 11094, "circumstances": "PAA 212 departed Dulles Airport at 2221 with the same crew of 9 and 136 passengers. The flight was conducted under instrument conditions and was routine until arrival in the New York area. At 2239 the New York Center controller transmitted the JFK weather to PAA 212. The runway visual range (RVR) on runway 4R at JFK was reported to be 1,600 feet. At 2250 JFK Approach Control established radar and radio contact with PAA 212 and advised: \"Depart Colts Neck heading zero nine zero for vectors to the final approach course, Kennedy weather is three hundred thin broken, measured ceiling one thousand five hundred overcast, visibility one and one-half miles fog, and the runway visual range runway four right more than one thousand feet, standby.\" FAA 212 acknowledged the transmission. N779PA was restricted to landing Minimums of 300-foot ceiling and 3/4 mile visibility. The flight reported over the Colts Neck VOR at 2253 35 and was cleared to descend from 6,000 to 1,500 feet. Several vectors were given to position FAA 212 on the inbound heading to the Outer Marker (OM). At 2256.15 while on a heading of 040 degree, the crew reported reaching 1,500 feet, airspeed 180. Several delaying vectors were given to position the aircraft three and one-half miles behind a DC-8 which was landing ahead. At 2259.45 the JFK local controller transmitted to FAA 212: \"Clipper two one two this is Kennedy Tower, report passing outer marker, straight in four right, wind calm, runway visual range, all aircraft copy, four right is more than six thousand.\" Prevailing visibility at the JFK Airport was less than three miles, therefore the Precision Approach Radar (PAR) Controller was monitoring all ILS approaches to runway 4R as prescribed by procedures. At 2301.10 the PAR controller advised, \"Clipper two twelve, Kennedy radar on localizer one mile from outer marker course and glidepath OK.\" At 2301:40, PAA 212 reported passing the outer marker and the PAR controller advised, \"Clipper two twelve two miles from touchdown.\" The local controller transmitted at 2301 45 \"Clipper two one two, Kennedy Tower cleared to land four right, traffic will be clear in five seconds.\" PAR at 2302-10 advised \"Clipper two twelve, Kennedy radar, execute a missed approach if you do not have the runway in sight.\" Immediately following this transmission, PAA 212 acknowledged \"Uh. . . Roger two one two.\" The next radio transmission was at 2303:10 when the local controller called the flight but was unable to establish radio contact. After touchdown the aircraft continued down and off the runway across the asphalt overrun and through a sandy area before coming to rest in the shallow water of Thurston Basin approximately 800 feet from the far end of runway 4R. When the aircraft came to rest the crew proceeded aft to assist the passengers. The main forward (left) cabin door was opened and the passengers in this section of the aircraft left through this door. The passengers in the aft section left through the overwing exits onto the wings; and others left through the two rear doors and got into two life rafts that had been launched. Evacuation of the aft section of the aircraft was completed in approximately five minutes. After seats and debris had been removed from the first-class compartment aisle, some of the persons who had been in the aft section of the aircraft reentered the aircraft and left through the main forward cabin door. The aircraft broke in two and was written off. Among the 145 occupants, 40 were injured, seven of them seriously, and 105 other occupants were unhurt. ", "probable_cause": "The Board determines that the probable cause of this accident was the captain's deviation from the glide slope during an ILS approach resulting in a touchdown on the rim-way at a point and speed which precluded stopping the aircraft on the remaining runway."}