{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-umgalala-1-killed", "date": "Oct 6, 2009 at 1938 LT", "type": "PZL-Mielec AN-2", "operator": "Bashmia Aero Spray", "flight_phase": "Landing (descent or approach)", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Umgalala - Umgalala", "msn": "1G156-23", "yom": 1974, "flight_number": null, "city": "Umgalala", "zone": "White Nile (النيل الأبيض)", "country": "Sudan", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6481, "circumstances": "The Antonov 2 aircraft was assigned to spray birds at the white Nile Scheme. The aircraft arrived at Um-galala airstrip 5 days before the accident date and carried out seven spraying flight in the previous five days. The spraying of birds start daily about 18:30 local time and took about 50 minutes flight. According to the scheduled operation the aircraft started its flight ten minutes before Sun set to fly to the assigned bird location for spraying chemicals.On the day of the accident the airstrip lights were positioned by the captain himself at the edges of the airstrip. He put seven lamps at the left side and three lamps at the right side of the airstrip. The red lamp which should have been placed at the beginning of the airstrip was not placed that day due to a flat battery. At about 15:45 UTC the aircraft took-off for spraying birds. That night was dark and there was no moon light. After take-off the technician switched on all lamps except the red one waiting for aircraft arrival. Fifty minutes after take-off the aircraft was seen approaching the airstrip. The aircraft came flying over the strip at a height of about 25 meters and made a left turn. The aircraft then made another approach and came over the left row of lamps at a height of about 10 meters, as stated by the technician, and made a sharp left turn. At that instant the aircraft went down and crashed east of the airstrip. A fire erupted. The pilot died of his injuries. Although the airplane was formally registered ST-AUS in July 2009, the airplane still carried its previous Polish registration mark SP-WMH.", "probable_cause": "The captain, as he was not rated for instrument flying, was disoriented by the absence of the red lamp which was used to indicate the beginning and center line of the airstrip in addition to remains of birds on windscreen which decreased the pilot vision. The presence of some people from the village within the East side of airstrip causing illusion of vision to the pilot was considered a contributory factor to this accident."}