{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-20c-narsarsuaq-3-killed", "date": "Aug 5, 2001 at 0245 LT", "type": "Dassault Falcon 20", "operator": "Naske%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Gdansk – Copenhagen – Keflavik – Narsarsuaq – Seven Islands – Louisville", "msn": "63", "yom": 1967, "flight_number": null, "city": "Narsarsuaq", "zone": "Kommune Kujalleq", "country": "Greenland", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight, during which the accident occurred, was part of a non-scheduled international cargo flight from Gdansk (EPGD) to Louisville (KSDF). The flight crew had previously on August 4, 2001, on another charter flight, flown the aircraft from Hanover (EDDV) to Palma de Mallorca (LEPA) and then to EPGD in order to bring the aircraft in position for the cargo flight. The flight was chartered by a cargo courier to depart EPGD at 2000 hrs on August 4, 2001, and arrive at KSDF at 0900 hrs on August 5, 2001. Technical landings (fuel uplift) were planned at EKCH in Denmark, at Keflavik (BIKF) in Iceland, at BGBW in Greenland and at Sept-Iles (CYZV) in Canada. The aircraft had a two hour delay at LEPA due to a slot time. For that reason, the aircraft did not arrive at EPGD until 2106 hrs. The aircraft was refuelled and the flight crew loaded the cargo themselves. The aircraft departed EPGD at 2218 hrs and arrived at EKCH at 2238 hrs. Then the aircraft departed EKCH at 2313 hrs and arrived at BIKF at 0202 hrs. At BIKF, the aircraft was refuelled with 1034 USG of JET A1. The commander filed an ATC flight plan for BGBW with Kangerlussuaq (BGSF) in Greenland as destination alternate. At BIKF no weather reports for BGBW were valid for the flight crew’s flight planning. The handling agent directed the Commander’s attention to the lack of updated weather reports for BGBW, but the Commander seemed not to be concerned. It was the general opinion of the handling agent that the Commander seemed stressed. At 0246 hrs, the flight crew requested start up and shortly after they got an ATC clearance to BGBW via EMBLA, 63N 30W, 62N 40W and NA at FL 240 with cruise Mach at 0.76. The aircraft departed BIKF at 0300 hrs and the flight crew got an ATC clearance with FL 260 as the final cruising level inbound BGBW. The First Officer was the pilot flying and the Commander was the pilot non-flying. At 0423:24 hrs, the Commander contacted Narsarsuaq Flight Information Service (FIS) on frequency 121.300 MHz. The Commander reported that they expected to be overhead NA (358 KHz) at 0438 hrs. At this time, the aircraft was cruising at FL 260 and was inbound NA on a magnetic track of 280° approximately 50 nm east of the aerodrome. Through link to Gander ATC, Narsarsuaq FIS cleared the aircraft to descend out of controlled airspace on QNH 1004 and to report FL 195 descending. The Commander was now the pilot flying and the First Officer was the pilot non-flying. The Commander had experience of flying to BGBW. The aircraft left FL 260, and at 0434:27 hrs, the First Officer reported that the aircraft was passing FL 195. Narsarsuaq FIS requested the flight crew to report 10 nm from the aerodrome. While descending, the flight crew made a briefing on the NDB/DME approach procedure to runway 07. At 0437:00 hrs, the First Officer reported that the aircraft was 10 NM from NA. Narsarsuaq FIS requested the flight crew to contact Narsarsuaq AFIS on frequency 119.100 MHz. At 0437:17 hrs, the flight crew was in contact with Narsarsuaq AFIS and the First Officer reported passing FL 130. The AFIS Operator reported that there was no reported traffic in the TIZ and that the flight crew could make an approach by their own discretion. The weather was reported to be a wind direction and speed of 080° at 24 knots, visibility 10 kilometres with broken clouds at 6000 feet and overcast at 9000 feet, light rain, temperature +14°C, dew point +3°C and the QNH 1004 hPa. At 0440:26 hrs and at 0440:52 hrs, one of the flight crewmembers made cockpit call outs of passing 6 nm and 8 nm respectively outbound from NA. At 0441:45 hrs, one of the flight crewmembers made a cockpit call out of the aircraft being on base. The Commander ordered the extension of the landing gear. With reference to the CVR read out, there were no audible flight crew call outs concerning the use of checklists, altitude checks and Standard Operating Procedures (SOP) during the descent, the initial and the final approach phase. At 0442:29 hrs, the First Officer reported that the aircraft was on final to runway 07. The AFIS operator reported the threshold wind for runway 07 to be 070° at 22 knots gusting to 29 knots and the runway to be free. The AFIS operator made a visual scan of the approach sector, but he did not see the aircraft, as he normally would have, when an aircraft was established on final in dark night and under similar weather conditions. At approximately 0443:07 hrs, the aircraft impacted in landing configuration mountainous terrain at approximately 700 feet msl. The accident occurred 4.5 nm southwest of the aerodrome. On the CVR read out, there were no audible flight crew call outs immediately before the impact. Several times from 0452 hrs until 0459 hrs, Narsarsuaq AFIS tried to get in radio contact with the aircraft, but there was no reply.", "probable_cause": "A combination of non-adherence to the approach procedure and the lack of vertical position awareness was the causal factor to this Controlled Flight Into Terrain (CFIT) accident. Several of the most common factors found in CFIT accidents were present in this accident. The flight crew did not follow SOPs (adherence to the approach procedure, altitude calls, checklist reading). Furthermore the GPWS was inoperative and the flight crew were exposed to peak fatigue. The absence of CRM and non-adherence to SOPs removed important defences in preventing CFIT. In this accident, the aircraft was capable of being controlled and was under control of the flight crew until impact. Nothing indicated that the flight crew were aware of their proximity to the mountainous terrain. Consequently, this is considered to be a CFIT accident. "}