{"url": "https://www.baaa-acro.com/crash/crash-technoavia-sm-92g-turbo-finist-thiene", "date": "Feb 3, 2002 at 1630 LT", "type": "Technoavia SM-92 Turbo Finist", "operator": "Thiene Aero Club", "flight_phase": "Landing (descent or approach)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "City", "schedule": "Thiene - Thiene", "msn": "00-004", "yom": 1995, "flight_number": null, "city": "Thiene-Arturo Ferrarin", "zone": "Veneto", "country": "Italy", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 500, "captain_hours_type": 40, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The single engine airplane departed Thiene Airstrip at 1540LT for a local flight, carrying nine skydivers, one observer and one pilot. At the altitude of 13,500 feet, seven skydivers jumped while three others decided to stay in the cabin because the visibility was poor due to foggy conditions. While returning to his departure point, the pilot encountered poor visibility and completed two unsuccessful approach. He eventually decided to divert to Asiago Airport located 24 km from his position but this decision was taken too late. While circling around the airport, the engine failed and the aircraft stalled, struck the roof of a house and crashed in Rozzampia, less than one km east of the airfield. All four occupants were injured and the aircraft was damaged beyond repair. ", "probable_cause": "The following contributing factors were identified:\r\n- Weather conditions were marginal with thick fog reducing the visibility to 100 metres,\r\n- Poor flight planning as the pilot failed to refuel the airplane prior to departure and ignored the instability of the weather conditions, \r\n- The pilot's decision to divert to Asiago Airfield was taken too late, \r\n- Poor coordination with the people in place at the Thiene Aerodrome, \r\n- The pilot's inexperience. "}