{"url": "https://www.baaa-acro.com/crash/crash-bae-3101-jetstream-31-new-orleans", "date": "May 26, 1987 at 1645 LT", "type": "BAe Jetstream 31", "operator": "Continental%20Express", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New Orleans - Valparaiso", "msn": "742", "yom": 1987, "flight_number": "CO962", "city": "New Orleans-Louis Armstrong (Moisant)", "zone": "Louisiana", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7500, "captain_hours_type": 60, "copilot_hours": 3000, "copilot_hours_type": 18, "aircraft_hours": 147, "circumstances": "Taxi clearance was received at 16:35 and the flight left gate 14B for runway 19. The airplane was cleared for takeoff at 16:44. Shortly after lifting off, at 200 feet above the ground, the engine torque gauges began to fluctuate erratically and the plane began to yaw back and forth. The captain believed the TTL (Torque Temperature Limiting) system may have been bypassing fuel to the engines (a situation that could occur when power levers are advanced too far forward). He then slightly decreased the power settings which resulted in even greater torque oscillations and greater yawing. The captain believed both engines were malfunctioning for some unknown reason and landed back on runway 19, because a 90° turn for runway 28 seemed impossible. The aircraft overran the runway, struck a 6 feet high chain link fence, struck a concrete barrier and skidded across the Route 61 highway before coming to rest on a parking lot.", "probable_cause": "A breakdown of the flight crew coordination which resulted in their failure to comply with the Before Takeoff Checklist and advance the RPM levers to the high RPM position, and the flight crew's failure to diagnose and remedy engine oscillations on initial climbout. Contributing to the flight crew's failure to advance the RPM levers before take off was the fact that both crew members had limited experience in the BAe-3101 and extensive recent experience in other aircraft which use RPM control lever procedures that are different from the BAe-3101.\""}