{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-reading", "date": "Aug 3, 2008 at 1519 LT", "type": "Cessna 550 Citation II", "operator": "Drug-Plastics-Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pottstown - Reading", "msn": "550-0660", "yom": 1990, "flight_number": null, "city": "Reading", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12100, "captain_hours_type": 2690, "copilot_hours": 1779, "copilot_hours_type": 65, "aircraft_hours": 5008, "circumstances": "The air traffic controller, with both ground and local (tower) responsibilities, cleared the accident airplane to land when it was about 8 miles from the runway. Another airplane landed in front of the accident flight, and the controller cleared that pilot to taxi to the hangar. The controller subsequently cleared a tractor with retractable (bat wing) mowers, one on each side, and both in the “up” position, to proceed from the terminal ramp and across the 6,350-foot active runway at an intersection about 2,600 feet from the threshold. The controller then shifted his attention back to the airplane taxiing to its hangar, and did not see the accident airplane land. During the landing rollout, the airplane’s left wing collided with the right side of the tractor when the tractor was “slightly” left of runway centerline. Calculations estimated that the airplane was about 1,000 feet from the collision point when the tractor emerged from the taxiway, and skid marks confirmed that the airplane had been steered to the right to avoid impact. Prior to the crossing attempt, the tractor operator did not scan the runway, and was concentrating on the left side bat wing. Federal Aviation Administration publications do not adequately address the need for ground vehicle operators to visually confirm that active runways/approaches are clear, prior to crossing with air traffic control authorization, thus overlooking an additional means to avoid a collision.", "probable_cause": "The air traffic controller’s failure to properly monitor the runway environment. Contributing to the accident was the tractor operator’s failure to scan the active runway prior to crossing, and the Federal Aviation Administration’s inadequate emphasis on vehicle operator visual vigilance when crossing active runways with air traffic control clearance."}