{"url": "https://www.baaa-acro.com/crash/crash-sud-aviation-se-210-caravelle-10r-haslemere-37-killed", "date": "Nov 4, 1967 at 2202 LT", "type": "Sud-Aviation SE-210 Caravelle", "operator": "Iberia-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Málaga – London", "msn": "202", "yom": 1966, "flight_number": "IB062", "city": "Haslemere", "zone": "West Sussex", "country": "United Kingdom", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 30, "pax_fatalities": 30, "other_fatalities": 0, "total_fatalities": 37, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Iberia flight IB062 left Málaga, Spain, at 19:30 UTC on a flight to London-Heathrow Airport, United Kingdom. The weather at the time was slightly misty with intermittent drizzle but there was reasonable visibility. The aircraft was cleared to descend to FL210 after passing latitude 50 °N and was given a routing via Ibsley and Dunsfold. After passing conflicting traffic, the aircraft was recleared to FL110 and directed to turn right on to 060° for Dunsfold. Passing abeam Fawley the aircraft was further cleared to FL60 and, in acknowledging this instruction, the crew reported leaving FL145. Just under 4 minutes later the aircraft was cleared to proceed direct to Epsom on its own navigation. The flight crew acknowledgement this instruction. All the while the aircraft had been in a continuous descent, until it impacted trees on the southern slope of Blackdown Hill, approximately 48 km south-southwest of Heathrow Airport. The aircraft continued for hundreds of yards, passing across a meadow where it killed 65 grazing sheep. It then broke through a large hedge and parts of the aircraft fell off destroying a garage, and damaging parts of the roof of Upper Blackdown House as the aircraft disintegrated. None of the 37 occupants survived the crash.", "probable_cause": "Accident investigators failed to find the reason for the continued descent. A possible misreading of the altimeters was examined in detail. The aircraft was fitted with three-pointer altimeters with warnings to indicate when the aircraft was below 10,000ft. The aircraft descended continuously at a steady rate over a period of 13 1/2 minute and the pointers would have been in continuous motion throughout, increasing the likelihood of misreading. The cross hatching in this type of altimeter first appears in a window in the 10,000ft disc at an indicated altitude of 26,666ft and the edge of the cross hatching would have been visible within 2 minutes of the aircraft beginning its descent. At 10,000 feet the cross hatching completely fills the window and it remains filled as long as the aircraft is below 10,000ft. Thus the cross hatching would have been visible to the crew for a period of about 9 1/2 minutes before the aircraft passed through FL60. According to the investigation report, it is not difficult to read an indication of 6,000ft as 16,000ft with this type of altimeter if particular note is not made of the position of the 10,000ft pointer. Evidence against the possibility of a simple misreading of this sort is the message from the aircraft to ATC reporting passing FL145. indicating that at this time the crew knew that they were below 16,000ft. This evidence indicates that down to this level there had been no misreading or misinterpretation but it does not dispose of the possibility that the crew subsequently suffered a mental loss of sequence and transposed themselves in time and space back to some altitude above 16,000ft. This has been known to, happen in the past, the investigators noted. Nevertheless, there is no evidence to show that it happened on this occasion. In conclusion, the accident was due to the aircraft having continued to descend through its assigned flight level down to the ground. No reason could be established for the continued descent. "}