{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-159-gulfstream-i-houston-3-killed", "date": "Aug 23, 1990 at 1720 LT", "type": "Grumman G-159 Gulfstream I", "operator": "Rowan", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Houston - New Orleans", "msn": "198", "yom": 1969, "flight_number": null, "city": "Houston-George Bush-Intercontinental", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 13, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 20200, "captain_hours_type": 760, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5343, "circumstances": "The passengers and witnesses reported that during takeoff, the aircraft yawed both left and right after lift-off. It then veered to the left and contacted the ground in a left wing low attitude between the runway and a parallel taxiway. An investigation revealed evidence that the left engine had sustained a partial loss of power due to a malfunctioning fuel pump. There were indications the power loss was not sufficient to trigger or allow completion of the autofeathering operation of the left propeller. Feathering of the left propeller had been manually initiated, but the propeller had not reached the feather position before impact. Manual feathering operation required the feathering pump button be held about 5 sec. 'V' speeds (kias) for this flight were: V1 92, VR 99, V2 110, normal VMCA (dead engine propeller feathered, flaps set for takeoff and aircraft out of ground effect) 101, VMCA (dead engine propeller unfeathered/windmilling and flaps set for takeoff) 127 knots. Exam of the actuators revealed the gear was retracted and the flaps were set for takeoff. Both pilots and a passenger who was seating on the jumpseat were killed. ", "probable_cause": "Partial failure of the left engine fuel pump, which resulted in a partial loss of power in the left engine, but not enough of a power loss to trigger and/or complete the autofeathering operation of the left propeller, thus allowing insufficient time for the crew to manually feather the propeller or attain VMC (for the aircraft configured with an unfeathered propeller)."}