{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900d-hyannis-2-killed", "date": "Aug 26, 2003 at 1540 LT", "type": "Beechcraft 1900D", "operator": "US-Airways-Express.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Hyannis - Albany", "msn": "UE-40", "yom": 1993, "flight_number": "US9446", "city": "Hyannis-Barnstable", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2891, "captain_hours_type": 1364, "copilot_hours": 2489, "copilot_hours_type": 689, "aircraft_hours": 16503, "circumstances": "The accident flight was the first flight after maintenance personnel replaced the forward elevator trim cable. When the flightcrew received the airplane, the captain did not address the recent cable change noted on his maintenance release. The captain also did not perform a first flight of the day checklist, which included an elevator trim check. Shortly after takeoff, the flightcrew reported a runway trim, and manually selected nose-up trim. However, the elevator trim then traveled to the full nose-down position. The control column forces subsequently increased to 250 pounds, and the flightcrew was unable to maintain control of the airplane. During the replacement of the cable, the maintenance personnel skipped a step in the manufacturer's airliner maintenance manual (AMM). They did not use a lead wire to assist with cable orientation. In addition, the AMM incorrectly depicted the elevator trim drum, and the depiction of the orientation of the cable around the drum was ambiguous. The maintenance personnel stated that they had completed an operational check of the airplane after maintenance. The Safety Board performed a mis-rigging demonstration on an exemplar airplane, which reversed the elevator trim system. An operational check on that airplane revealed that when the electric trim motor was activated in one direction, the elevator trim tabs moved in the correct direction, but the trim wheel moved opposite of the corresponding correct direction. When the manual trim wheel was moved in one direction, the elevator trim tabs moved opposite of the corresponding correct direction.", "probable_cause": "The improper replacement of the forward elevator trim cable, and subsequent inadequate functional check of the maintenance performed, which resulted in a reversal of the elevator trim system and a loss of control in-flight. Factors were the flightcrew's failure to follow the checklist procedures, and the aircraft manufacturer's erroneous depiction of the elevator trim drum in the maintenance manual."}