{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-6b1-h2-turbo-porter-cooma-3-killed", "date": "May 20, 1976 at 1002 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "Snowy%20Hydro", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Talbingo – Khancoban – Cooma", "msn": "657", "yom": 1967, "flight_number": null, "city": "Cooma-Polo Flat", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 13138, "captain_hours_type": 3000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Polo Flat at 0750 hours on a planned flight to Khancoban, Talbingo and return. There was dense fog at Polo Flat at this time and the aircraft took off and climbed through fog until it was in clear conditions above. At Cooma Aerodrome, fog which had existed earlier dissipated about 0715 hours and the weather at that location then remained clear. When the aircraft returned to the Polo Flat area shortly after 0930 hours, fog was still present but it was commencing to break with patches of blue sky visible from time to time. Information regarding the weather conditions was communicated to the, pilot who had established radio contact with the base operations officer at Polo Flat. Shortly after the aircraft arrived in the area it was observed to make what appeared to be a landing approach into the north but when it had descended to a height of 10 to 15 feet the approach was discontinued and it climbed away. After flying for some time above the fog at a height of about 500 feet the aircraft was heard approaching from the south and the operations officer heard the pilot transmit the words 'hit the...'. Shortly afterwards the sound of an impact was heard. The port wing of the aircraft had struck the radio transmitter mast 32 feet from the top and the aircraft crashed to the ground in a steep nose-down attitude some 146 metres north of the mast. A fierce fire developed shortly after impact.\r\nCrew: \r\nJohn Howard, pilot.\r\nPassengers:\r\nEvelyn Anne Harvey,\r\nPatricia Joy Harvey.", "probable_cause": "The probable cause of the accident was that the aircraft was operated at an unsafe height in weather conditions in which the pilot was not able to maintain the visual reference necessary to ensure adequate clearance from obstructions."}