{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a60-duke-jesup-2-killed", "date": "Oct 23, 2002 at 2128 LT", "type": "Beechcraft 60 Duke", "operator": "Duke Aircraft Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Muncie – Melbourne", "msn": "P-222", "yom": 1973, "flight_number": null, "city": "Jesup-Wayne County", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8, "captain_hours_type": 8, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5125, "circumstances": "The airplane was equipped with two experimental Engine AIR Power Systems TSIVD-427, 500-horsepower, liquid-cooled, turbocharged, V8 engines. During previous flights, the right engine lost boost then overboosted intermittently, and attempted repairs were unsuccessful. The pilot elected to fly the airplane to its home base for further troubleshooting. During cruise flight, the pilot reported an engine was surging, declared an emergency, and received vectors toward the airport. The airplane collided into a field beside the airport runway and caught fire. The airplane had a total of 8 to 10 hours of flight time at the time of the accident. Records revealed that two days after the airplane's first test flight, the pilot flew the airplane from Melbourne, Florida, to an airport 336 nm miles away, then flew it to Canada to display it at a fly-in.The FAA operating limitations for the airplane restricted its operation to flight test only, which was proposed to consist of 100 flight hours, since the installation of the modified engines. No single-engine performance data was available for this airplane. Examination of the engines and accessories revealed extensive fire and impact damage. Continuity of the crankshaft, valves, rods, and pistons was established for the right engine by manually rotating the propeller reduction control unit.", "probable_cause": "The loss of power in one engine and the loss of control for undetermined reasons."}