{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-barcelona-2-killed", "date": "Jul 28, 1998 at 0052 LT", "type": "Swearingen SA227 Metro III", "operator": "Swiftair", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Palma de Mallorca - Barcelona", "msn": "AC-651", "yom": 1986, "flight_number": "SWT704", "city": "Barcelona", "zone": "Catalonia", "country": "Spain", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4500, "captain_hours_type": 4132, "copilot_hours": 2000, "copilot_hours_type": 1769, "aircraft_hours": 14748, "circumstances": "Flight SWT704, a cargo flight from Palma de Mallorca to Barcelona, was to be used by the crew as an instruction flight. The co-pilot, who that day was flying for the first time since 20th March 1998, and who was sitting in the left-hand seat, would thus carry out a refresher flight as \"First officer under supervision\", in accordance with the operator's procedures. At first, it had been planned that the aircraft should carry out a missed approach with one engine on its arrival at Barcelona Airport. However, for a runway 25 approach this was very difficult and the captain decided to postpone this manoeuvre. It was then decided to carry out a standard approach leaving the glide path a little above and then stopping the engine. They would then raise the landing gear and flaps by increments. The captain added: \"As soon as we're without control, we'll restore it\" (the engine). The approach to runway 25 was also normal. At 00:47:10 they contacted the Barcelona control tower, which indicated that they were number 1, that they should continue and that they should notify \"established in final\". Afterwards, they extended the landing gear and flaps. At 22:49:55 h, the captain notified the control tower that they were established in final. The tower indicated that they should continue, that a flight was leaving runway 25 and that it would call them immediately. At that moment, the Metro was at a height of some 1400 feet, at some 6 nm (about 3 minutes at 120 kt) from the runway threshold. At 22:50:03 h, with gear and flaps down, the instructor said \"Well, engine stop\" to which the copilot replied: \"Come on, landing gear up\". Contrary to normal practice, the right engine was shut down completely and the prop was feathered. It's usual practice to retard the throttles to idle to simulate zero thrust for that engine. When the co-pilot pushed the wrong pedal, the plane deviated to the right. The captain then tried to start the engine again. This failed however because due to the seizing of the guide rod bushing of the propeller pitch change mechanism, the pitch varying mechanism did not take the blades to the necessary pitch for start-up. The captain then said: \"Well, I am taking out the engine again. I've raised the flap for you. Now flap by increments...\". A few moments later the copilot asked \"I continue with the approach, don't I?\" to which the captain replied in the affirmative and added that they had been authorized to land and that they were going to land with one engine. At 22:51:09 he again confirmed \"Well, just continue with one engine\" and appeared to give general instructions on how to carry out a missed approach or what to do when near the runway. At 22:52:01, the captain said \"landing gear\", the co-pilot said \"landing gear now\" and the captain then confirmed \"coming down\". The stall warning then began to sound. The aircraft turned off to the right of the ILS localizer and adopted a position of almost 90° of roll to the left, then a position of 90° of roll to the right whilst continuing to lose height and then again took up a position of 90° of roll to the left. Finally, the left wing struck the ground and then the aircraft crashed first into the outside barrier of highway B-203 which runs round the edge of the Airport and then the perimeter fence, finally coming to a halt at some 250 m from the threshold of runway 25 and some 100 metres to the right of the runway axis. The wreckage of the aircraft burst into flames.", "probable_cause": "It is considered that the probable cause of the accident was the loss of control of the aircraft due to an excessive reduction of speed at low height, after having extended the landing gear, with an intermediate flap position, and with the right engine stopped and its propeller pitch close to feather."}