{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-washougal-4-killed", "date": "Nov 27, 1999 at 1455 LT", "type": "De Havilland DHC-2 Beaver", "operator": "William S. Warren", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": null, "msn": "826", "yom": 1955, "flight_number": null, "city": "Washougal", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 2400, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15540, "circumstances": "Witnesses reported that following takeoff from a river, the aircraft climbed to approximately 100 to 400 feet above the water, then initiated a left turn of approximately 45 degrees bank. The majority of the witnesses reported that after the aircraft had turned about 180 degrees, its nose abruptly dropped and it impacted the water. Witnesses did not report observing any evidence of problems with the aircraft before impact, and did not report hearing any abnormal engine sounds or sudden changes in engine pitch. Upon water impact, the aircraft went inverted and its cabin submerged. Efforts by witnesses to gain entry to the aircraft cabin to render assistance were unsuccessful due to aircraft damage. Rescue divers found all occupants deceased in the aircraft upon arrival, but were able to remove the two rear-seat victims without removing any passenger restraints. Autopsies disclosed that all four aircraft occupants had drowned. Investigators did not find any evidence of pre-impact aircraft or engine malfunctions during post-accident examinations of the wreckage, but did find that a cabin entry door was jammed shut due to impact damage, and that the range of travel of both pilot doors was restricted by damaged aircraft components. ", "probable_cause": "The pilot's failure to ensure attainment of adequate airspeed prior to initiating a steep turn at low altitude, resulting in an accelerated stall. A factor contributing to the occurrence of the accident was the aircraft's low altitude. Factors contributing to the severity of the accident included a water impact, and jammed/restricted doors due to impact damage resulting in degraded aircraft evacuation capability. "}