{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-35-dl-mariehamn-22-killed", "date": "Nov 8, 1963 at 1859 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Finnair%20%282%29", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Helsinki – Turku – Mariehamn", "msn": "9799", "yom": 1943, "flight_number": "AY217", "city": "Mariehamn", "zone": "Åland", "country": "Finland", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 22, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 22, "captain_hours": 7228, "captain_hours_type": 2772, "copilot_hours": 1078, "copilot_hours_type": 1078, "aircraft_hours": 30672, "circumstances": "Flight AY217 was on a scheduled domestic flight from Helsinki to Mariehamn with an intermediate stop at Turku. The flight to Turku was routine and the aircraft took off from Turku at 1620 GMT, with a crew of three and 21 passengers plus one former Finnair pilot who was in the cockpit without ticket or permit. The flight from Turku to Mariehamn was carried out at an altitude of 2 000 ft and nothing abnormal was reported by the aircraft. The approach to the Mariehamn NDB (MAR) was made from the East- North-East and at 1657 hours the aircraft reported over the NDB on the inbound track to runway 20. During the final approach the aircraft which was flying strictly on the inbound track struck trees in a nearly horizontal attitude 1,470 metres before the threshold of the runway. Upon impact the aircraft flipped over on its back around its longitudinal axis and caught fire immediately. The accident occurred at 1659 hours. A crew member and two passengers were seriously injured while 22 other occupants were killed. ", "probable_cause": "The Board considered that the ultimate cause of the accident was the pilot's misconception of his altitude. It was impossible to determine whether this was due to a wrong indication of the altimeter or to human error. The defect, found in the pilot-in- command's altimeter, was regarded however as sufficient to have brought a wrong indication of the altitude which the pilot could not foresee. The cause of the accident was therefore established as follows: As a result of a wrong indication of the aircraft's pilot's altimeter during an instrument approach carried out in weather conditions worse than the weather minima approved for runway 20 at Mariehamn, the aircraft came below the safe flying altitude and hit trees on the approach line. "}