{"url": "https://www.baaa-acro.com/crash/crash-boeing-40c-near-canyonville-1-killed", "date": "Oct 2, 1928 at 1000 LT", "type": "Boeing 40", "operator": "Pacific-Air-Transport-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Medford – Portland", "msn": "1043", "yom": 1928, "flight_number": null, "city": "Canyonville", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the morning of October 2, 1928, Pacific Air Transport pilot Grant Donaldson took off in NC5339 from Medford, Oregon, on his way to Portland with nine pounds of mail and passenger D. P. Donovan, a West Coast drugstore chain owner and a gemstone dealer who carried a satchel of diamonds. An hour into scud-running beneath low-lying clouds, Donaldson heard booming noises and discovered that he was scraping treetops. There was no time to recover. The 40C dove forward “as if it had been a giant scythe,” reported the Roseburg, Oregon News-Review. “One tree, nearly a foot in diameter was cut off about 25 feet from the ground.” Donaldson rushed out of the cockpit as the biplane’s nitrate-doped cotton skin fueled a fire so intense it melted the aircraft’s metal propeller. He fought through the flames to check on his passenger, but saw that Donovan had been killed on impact. Donaldson’s actions left him with severe burns; for the rest of his life he would have a scar tissue circumscription of flight goggles on his face. Bloody and incoherent, Donaldson staggered down to a highway, where a preacher and his family hurriedly drove him to a pharmacy nine miles north, in Canyonville. “The next day the airline went up there and they got the remains of poor Donovan,” says Pemberton. “They picked out what diamonds they could, and they salvaged what they could of the engine.” For years afterward, townspeople hiked up to the crash site to sift for diamonds. (Rumors abound of Canyonville wives who own rings set with diamonds from the crash.) In 1929, they hacksawed the tail section off to use as a nursery school jungle gym.\r\nSource: www.airspacemag.com", "probable_cause": "Pilot error. "}