{"url": "https://www.baaa-acro.com/crash/crash-antonov-2-kazalinsk-5-killed", "date": "Nov 1, 1969 at 1120 LT", "type": "Antonov AN-2", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Aralsk – Amanutkul – Raym – Oktyabr – Kazalinsk – Frunze – Kaukey – Azhar – Kyzylorda", "msn": "1 67 473 14", "yom": 1956, "flight_number": "SU643", "city": "Kazalinsk", "zone": "Kyzylorda", "country": "Kazakhstan", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 24, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10570, "circumstances": "The airplane arrived in Kazalinsk at 1020LT and 12 passengers embarked. The aircraft was fully booked and ready for departure when the captain accepted, against retribution, that 12 additional passengers (11 adults and one infant) embarked as well. Some 120 kilos of cargo and 120 kilos of additional baggage were also loaded. After takeoff, while climbing to a height of 200 meters, the airplane adopted a high angle of attack when the tail stalled. Out of control, the airplane crashed 65 meters to the left of the main runway. 25 passengers were injured while one child was killed. A day later, two passengers died from their injuries and two other passengers died few days later. The aircraft was destroyed upon impact. ", "probable_cause": "The decision of the captain to embark 12 additional passengers was criminal and against all published procedures. Neither the copilot nor the Airport Manager complained about this decision. At the time of the accident, the total weight of the aircraft was 6,484 kilos, some 1,234 kilos above the MTOW, taking into consideration the actual flying conditions. Also, the CofG was far aft and well outside the envelope, which caused the airplane to stall from the tail during initial climb. All additional passengers did not have safety belt. "}