{"url": "https://www.baaa-acro.com/crash/crash-canadair-regionaljet-crj-200er-almaty-21-killed", "date": "Jan 29, 2013 at 1310 LT", "type": "Canadair RegionalJet CRJ-200", "operator": "SCAT-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Kokshetau - Almaty", "msn": "7413", "yom": 2000, "flight_number": "VSV760", "city": "Almaty", "zone": "Almaty Province", "country": "Kazakhstan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 16, "pax_fatalities": 16, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": 18194, "captain_hours_type": 1010, "copilot_hours": 3507, "copilot_hours_type": 132, "aircraft_hours": 25707, "circumstances": " Following an uneventful flight from Kokshetau, the crew started the descent to Almaty Airport and was cleared for an ILS approach (Cat IIIb approach) to runway 23R. At this time, the horizontal visibility was 200 metres, the vertical visibility 40 metres and the RVR for runway 23R was 275-250-225 metres respectively. Due to this poor weather conditions at destination, the captain got stressed, creating a strong emotional reaction. On short final, at an altitude of 180 metres, the captain decided to abandon the landing procedure and initiated a go-around manoeuvre. The automatic pilot system was deactivated and the TO/GA mode was activated. Four seconds later, the captain pushed the control column forward, causing the aircraft to descend. The EGPWS alarm sounded in the cockpit but there was no response from the flying crew. In a pitch angle of -16° and with a descent rate of about 20-30 metres per second, the aircraft impacted ground and disintegrated in a snow covered field. The wreckage was found some 1,400 metres short of runway. All 21 occupants were killed. Due to the actual weather conditions, the crew should perform a Cat IIIc approach. ", "probable_cause": "The accident with aircraft CRJ-200 UP-CJ006 occurred during the execution of a go-around, in instrument meteorological conditions, without the possibility of visual contact with ground reference points (vertical visibility in the fog did not exceed 40 m), the necessity of which was caused by the mismatch between the actual weather conditions and the minimum conditions for which the crew was certified to land. As a result, the deflection of the elevator towards a dive of the aircraft caused a descent and collision with the ground. It was not possible to uniquely identify the causes of the aircraft's transfer to a dive from the available data. The Commission did not find evidence of failures of aviation equipment, as well as external to the aircraft (icing, wind shear, wake turbulence) when trying to perform a go-around.\r\nThe most likely factors that led to the accident, were:\r\n- Partial loss performance of the pilot in command, which at the time of aircraft impact with the ground was not in a working position;\r\n- The lack of CRM levels in the crew, and violation of the Fly-Navigate-Communicate principle, which manifested itself in diverting attention by the co-pilot to conduct external radio communication and lack of control of the flight instrument parameters;\r\n- The lack of response to the EGPWS and the actions required;\r\n- The impact somatogravic illusions of perception of the pitch angle (a nose-up illusion);\r\n- Increased emotional stress by the crew members associated with the unjustified expectations of improved weather conditions at the time of landing;\r\n- Failure to comply with the requirements for health examination of flight personnel, which led to the pilot in command flying without the rehabilitation period and without assessment of his health status after undergoing surgery."}