{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-25-dk-mers-les-bains", "date": "Dec 17, 1965 at 2340 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Skyways%20Coach-Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Beauvais – London-Gatwick", "msn": "15846/32594", "yom": 1945, "flight_number": "SX316", "city": "Mers-les-Bains", "zone": "Somme", "country": "France", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 29, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12548, "captain_hours_type": 4000, "copilot_hours": 1820, "copilot_hours_type": 250, "aircraft_hours": 12815, "circumstances": "Flight 316 was a scheduled international flight from Beauvais, France to Gatwick, England. It took off from runway 23 at Beauvais at 1948 hours GMT. At 2009 hours it contacted London Airways reporting over Abbeville, with an estimated time of arrival at the Paris/London FIR boundary of 2020 hours. At 2030 hours at the request of London Airways the aircraft reported 2036 as its estimated time of arrival at Lydd, whereas taking the wind into account it should have been 2040 hours. In fact the aircraft reported over Lydd at 2040 hours and, on the basis of the radar observations of London Airport which followed the aircraft from 2036 hours onwards, the aircraft probably flew over this point at 2041 hours or 2042 hours. At 2040 hours the aircraft reported its estimated time of arrival at Mayfield as 2058 hours, a dead reckoning calculation which this time allowed for the wind. At 2040 hours London Airways asked the flight to confirm its estimated time of arrival at Mayfield. It was when the co-pilot began the VHF transmission to reply to this query that he first noticed that his transmitter was not working, then that the No. 2 VHF, the ILS receiver, the radio compasses, the starboard generator and the two inverters had also failed. The aircraft lighting, however, was still working. The pilot-in-command handed over the controls to the co-pilot and went to inspect the main electrical panel. As he did not have the necessary tools, he was unable to remove the main radio fuse in order to inspect it. He checked the circuit breakers on the radio electrical panel and found that they were in the normal position. He also noted that the inverters were no longer working. On returning to his seat he asked the co-pilot to make the same checks. The co-pilot changed some fuses but he also was unable to remove the main fuse which he found was very hot. As he had no means of radio communication or navigation, the pilot-in-command considered that he could not continue on his route to Gatwick without incurring a collision risk and, more particularly, that it would be dangerous for him to try to descend to within visual reference of the ground, in view of the cloud bases of 120 to 200 m in the meteorological forecasts. He therefore decided to turn on to a southerly heading in order to descend below cloud over the sea and then to determine his position by identifying a town on the south coast of England. At 2053 hours, London Radar observed the left-hand turn of approximately 90' made by the aircraft. According to the pilot-in-command, the aircraft maintained a magnetic heading of 2000 for 15 minutes, which corresponds to a true track of 1710. At about 2108 hours the aircraft, which was then about 20 miles from the English coast south of Hastings, went on to an easterly heading and came down to 2 000 ft using the Beauvais QNH (1 012 mbs). After flying for 5 minutes on this heading, the pilot-in-command was still without any visual contact with the ground and he returned to a southerly heading, considering that the cloud base over France would be appreciably higher than over England. He came down to 1 000 ft and finally saw the lights of a ship and then the lights of a town (Le Tréport) which he failed to identify. The aircraft arrived in the vicinity of Le Tréport at 2140 hours. After flying over the town a number of times the crew fired Very lights but saw no response on the ground, although local authorities and members of the aero club went to En-Mers/Le Tréport airport and illuminated the landing strip with car headlights. During this time the pilot-in-command saw a beach lit up by the lights of a promenade and suitably orientated for a landing, taking into account the direction of the wind at the time. The pilot-in-command then decided that unless he could determine his position with certainty and therefore be able to reach Beauvais in absolute safety, it was preferable to attempt an emergency landing on such a beach rather than run the risk of landing, short of fuel, in the open in the French countryside without any visual reference to the ground and with the danger of colliding with some unknown obstruction. After having flown up and down the coast, in an attempt to determine his position, he finally decided to land when the starboard engine showed signs of fuel failure. He immediately switched the starboard engine on to the port main tank, which contained about 20 gallons more than the starboard main tank. He made his last circuit at about 500 ft, with the landing lights on and the undercarriage up, and came in to land on a WSW heading in the area lit up by the promenade lighting, as near as possible to the shore. The landing was relatively soft, although at the end of the run the port wing tip struck a concrete groyne. The accident occurred at 2240 hours GMT. The location of the beach was 50° 04 N 01° 23 E. All 33 occupants were evacuated and five of them were slightly injured.", "probable_cause": "The accident was due to the following causes: \r\n(a) The design of the aircraft's electrical installation in which no provision was made to prevent the total interruption of radio communication and radio navigation in the event of a failure at the level of the single main supply fuse. \r\n(b) The failure of the main supply fuse probably of insufficient rating and the fact that the crew was not able to rectify the failure. \r\n(c) The inadequate attention paid by the crew to its dead reckoning navigation, both before and after the radio failure. "}