{"url": "https://www.baaa-acro.com/crash/crash-atr72-600-pakse-49-killed", "date": "Oct 16, 2013 at 1555 LT", "type": "ATR72-600", "operator": "Lao-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Vientiane - Pakse", "msn": "1071", "yom": 2013, "flight_number": "LAO301", "city": "Pakse", "zone": "Champasak Province", "country": "Laos", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 44, "pax_fatalities": 44, "other_fatalities": 0, "total_fatalities": 49, "captain_hours": 5600, "captain_hours_type": 3200, "copilot_hours": 400, "copilot_hours_type": null, "aircraft_hours": 758, "circumstances": "A first approach procedure to runway 15 was aborted by the crew due to insufficient visibility. On the circuit to complete a second approach in bad weather conditions, the ATR72-600 crashed some 8 km short of runway and was completely submerged in the Mekong River. None of the 49 occupants (44 pax and 5 crew) survived, among them 7 French citizens and 6 Australians. Aircraft left Vientiane at 1445LT and should arrive in Pakse one hour later. Aircraft was built and delivered to Lao Airlines in March this year. First crash involving an ATR72-600 series. Up to date, worst accident in Laos.\r\nThe Laotian Authorities released the following key sentences of analysis: \r\n\"Under IMC conditions, with no reference to the ground, the SOPs lead to conducting an instrument approach. In Pakse the VOR DME approach procedure is in force. There is no radar service. The flight crew has to fly to the initial approach fix or the intermediate fix at an altitude above 4600ft, then start the descent to 2300ft until final approach fix. Finally the flight crew descends to the minima (990ft), if visual references with the ground are available and sufficient the flight crew may continue until touchdown. If ground visual references are not available or not sufficient, the flight crew may level off up to the missed approach point and then must start the missed approach procedure. From the FOR data, the flight crew set 600 ft as the minima. This is contrary to the published minima of 990 ft. Even if the flight crew had used the incorrect height as published in the JEPPESEN Chart at that time the minima should have been set to 645 ft or above. The choice of minima lower than the published minima considerably reduces the safety margins. Following the chart would lead the flight crew to fly on a parallel path 345 ft lower than the desired indicated altitude. The recordings show that the flight crew initiated a right turn according to the lateral missed approach trajectory without succeeding in reaching the vertical trajectory. Specifically, the flight crew didn't follow the vertical profile of missed approach as the missed approach altitude was set at 600 ft and the aircraft system went into altitude capture mode. When the flight crew realized that the altitude was too close to the ground, the PF over-reacted, which led to a high pitch attitude of 33°. The aircraft was mostly flying in the clouds during the last part of flight.\"", "probable_cause": "The probable cause of this accident were the sudden change of weather condition and the flight crew's failure to properly execute the published instrument approach, including the published missed approach procedure, which resulted in the aircraft impacting the terrain.\r\nThe following factors may have contributed to the accident:\r\n- The flight crew's decision to continue the approach below the published minima\r\n- The flight crew's selection of an altitude in the ALT SEL window below the minima, which led to misleading FD horizontal bar readings during the go-around\r\n- Possible Somatogravic illusions suffered by the PF\r\n- The automatic reappearance of the FD crossbars consistent with the operating logic of the aeroplane systems, but inappropriate for the go-around\r\n- The inadequate monitoring of primary flight parameters during the go-around, which may have been worsened by the PM's attention all tunneling on the management of the aircraft flap configuration\r\n- The flight crew's limited coordination that led to a mismatch of action plans between the PF and the PM during the final approach.\n"}