{"url": "https://www.baaa-acro.com/crash/crash-sikorsky-s-42b-san-juan-2-killed", "date": "Oct 3, 1941 at 1748 LT", "type": "Sikorsky S-42", "operator": "Pan%20Am.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Miami – Antilla – Port-au-Prince – San Pedro de Macorís – San Juan – Buenos Aires", "msn": "4206", "yom": 1936, "flight_number": "PA203", "city": "San Juan", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 21, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 11384, "captain_hours_type": 1500, "copilot_hours": 583, "copilot_hours_type": null, "aircraft_hours": 7832, "circumstances": "Following an uneventful flight, the crew completed the approach to the San Juan harbor in good weather conditions. Upon landing on water in a nose down attitude, the seaplane plunged into the water and came to rest. Two passengers were killed while all 25 other occupants were rescued. \r\nCrew:\r\nCharles A. Lorber, pilot,\r\nHarvey E. Breaux, copilot,\r\nJohn Donovan Donnelley, flight engineer, \r\nW. P. Mahoney, radio navigator,\r\nJoe Catala, steward,\r\nA. E. Calligari, steward. \r\nSource & photos: http://www.webstart.com/jed/house/NC15376/", "probable_cause": "It was concluded that the aircraft was landed in an unduly nose-low attitude, and second, that at the time of first contact while in that attitude, it was moving sideways relative to the water. It appears from the record that there were no extraneous turning forces which might have been caused by non-uniform application of power or by faulty rudder tab setting. On the basis of the foregoing findings and the entire record available to is at this time, investigation board found that the probable cause of the accident was the failure of the captain to exercise requisite caution and skill in landing. The smooth surface of the water which rendered difficult the captains depth perception as well as the exact determination of any lateral movement of the aircraft, constituted a substantial contributing factor. \n"}