{"url": "https://www.baaa-acro.com/crash/crash-martin-404-massena", "date": "Nov 14, 1957 at 1530 LT", "type": "Martin 404", "operator": "Eastern-Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Albany – Plattsburgh – Malone – Massena", "msn": "14240", "yom": 1952, "flight_number": "EA0183", "city": "Massena", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11870, "captain_hours_type": 535, "copilot_hours": 738, "copilot_hours_type": 155, "aircraft_hours": 15617, "circumstances": "Eastern Air Lines Flight 18 is a scheduled operation serving the carrier's route between New York City and Massena, New York, and its intermediate stops at Albany, Plattsburg, and Malone, New York. On November 14, at 1245, the flight originated on schedule, its flight crew consisting of Captain Joseph W. Harpham, First Officer Robert Casper and Flight Attendant Nancy A. Price. The flight followed routine preparation and was in accordance with an IFR (Instrument Flight Rules) flight plan. The general weather conditions over most of the route were forecast to be good. The flight proceeded through the intermediate stops in a routine manner, with most passengers deplaning at Albany and Flattsburg. Just prior to reaching Malone the instrument flight plan was canceled in good weather conditions. The flight landed at Malone at 1502. Continuing uneventfully, Flight 18 departed Malone at 1510. The gross takeoff weight of the Martin 404 was 35,977 pounds, 8,923 pounds under the maximum allowable. According to the load manifest the load was properly distributed within the center of gravity limitations. The first officer made the takeoff, climbed the aircraft approximately 2,500 feet, and flew it to Massena. Captain Harpham from his left seat, supervised the flight and performed the duties of copilot. At 1516, when about eight miles east of Richards Field, Captain Harpham reported the flight's position, then asked for and received landing information, which included the surface wind as “northeast 5 to 10 knots,\" and the active runway 4 (150 feet wide and 4,000 feet long). First Officer Casper established a downwind leg at 1,200 feet to execute a rectangular left-hand pattern for landing on runway 4. The flight was viewed briefly by ground observers during the pattern before reaching the final landing approach and it seemed entirely normal. As the aircraft drew closer to the threshold it seemed high and thereafter assumed an abnormally steep descent. As it approached the runway surface the aircraft assumed a flareout attitude, however, the rate of descent continued with little visible abatement. Consequently, N492A contacted the runway surface with great force at which time the right powerplant separated from the aircraft. The aircraft rebounded and again contacted with great force. It then rolled forward and gradually off the runway to the right. Before stopping it crossed a taxiway and the left powerplant fell free, accompanied by a small fire in the engine and the empty nacelle area. As the aircraft stopped Captain Harpham shut off the fuel and electrical services and ordered the loading ramp lowered. The passengers and crew quickly evacuated by this exit without difficulty or reported injury. At 1522, two minutes after the accident, weather conditions were reported as: Ceiling 4,000 feet broken, 10,000 feet, overcast; visibility 3 miles; haze; wind northeast 6 knots.", "probable_cause": "The Board determines that the probable cause of this accident was the captain's incorrect technique during the final approach which resulted in an abnormally steep nose-down attitude and high rate of descent, the latter not being sufficiently arrested before touchdown. The following findings were reported: \r\n- The first officer operated the aircraft in the traffic pattern,\r\n- During the turn to the base leg and while on base leg, an overriding was allowed to drift the aircraft closer to the airport,\r\n- From a higher and closer than normal position on final approach, the captain took control of the aircraft and continued the approach,\r\n- The throttles were closed, landing flap was extended, and the aircraft was slowed to 95 knots,\r\n- The aircraft descended in an abnormally steep nose-down attitude and at a high rate of descent,\r\n- The altitude remaining was insufficient for the aircraft in its existing configuration to regain adequate flareout speed,\r\n- The flareout attitude was accomplished; however, the rate of descent continued with little abatement,\r\n- The aircraft contacted the runway with great force causing major structural damage,\r\n- Important limits in the approach technique were not included as part of company pilot training,\r\n- There was no malfunction or failure of the aircraft prior to the runway contact."}