{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-cairns-8-killed", "date": "Sep 2, 1986 at 1408 LT", "type": "Piper PA-31-310 Navajo", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Cairns - Mount Isa", "msn": "31-249", "yom": 1968, "flight_number": null, "city": "Cairns", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot hired the aircraft privately from his employer to conduct a holiday flight during his leave. The journey commenced at Moorabbin on 25 August and the aircraft arrived at Cairns about midday 30 August, after stopovers at Coolangatta and Proserpine. The pilot and his passengers then spent the next three days at leisure in the Cairns area. On the day of the accident, the pilot attended the Cairns Briefing Office where he collected the relevant weather forecasts and submitted a flight plan. The flight plan indicated that the flight would be conducted in accordance with Instrument Flight Rules. It contained a deficiency in that no details were given for the first route segment from Cairns to Biboohra. It is apparent that the pilot had not noticed that the tracks to the west of Cairns, on the relevant enroute chart, emanate from Biboohra and not Cairns. There was no track line which joined Cairns and Biboohra. Such a line might have alerted the pilot at the time he planned the flight. The error in the flight plan was not detected when the plan was submitted. When the pilot was issued with an airways clearance prior to DEPARTURE it was apparent that he did not understand the terms of the clearance, which gave the initial tracking point as Biboohra. The location of this point was explained to the pilot and he subsequently accepted the clearance. He elected to depart using visual procedures, after being offered a choice of these or the published Standard Instrument DEPARTURE profile. A visual DEPARTURE from the particular runway in use allows an aircraft proceeding towards Biboorha to intercept the required track sooner than is possible with an instrument DEPARTURE. The aircraft was issued with takeoff instructions which included clearance for the pilot to make a right turn after takeoff. Witnesses observed that the aircraft complied with this clearance and headed in a southwesterly direction before turning to the north-west and subsequently entering cloud. The cloud base was estimated to be between 2000 and 2500 feet above mean sea level. No further communications were received from the aircraft and a search was commenced that afternoon. The search effort was hampered by the weather and the wreckage was not located until the following afternoon.", "probable_cause": " Inspection of the wreckage indicated that the aircraft struck the the top of a ridge line, 250 metres south-west of the highest point of the Mt Williams area. At the time, the aircraft was on a west-north-westerly heading, flying wings level and climbing at a angle of about five degrees. No fault was found with the aircraft that could have contributed to the occurrence. At the time the aircraft entered cloud, the pilot should have reverted to Instrument Flight Rules procedures. To comply with these procedures a pilot is required, inter alia, to ensure that adequate terrain clearance is achieved during climb to the lowest safe altitude. The relevant altitude for the route segment Cairns to Biboohra is 4500 feet above mean sea level (amsl). As the aircraft was apparently under control at the time of impact with the ground at about 3250 feet amsl, it was likely that the pilot had overlooked the lowest safe altitude requirements. "}