{"url": "https://www.baaa-acro.com/crash/crash-atr42-320f-madang", "date": "Oct 19, 2013 at 0915 LT", "type": "ATR42-300", "operator": "Air-Niugini-Cargo", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Madang – Tabubil – Kiunga", "msn": "87", "yom": 1988, "flight_number": "PX2900", "city": "Madang", "zone": "Madang", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7110, "captain_hours_type": 3433, "copilot_hours": 3020, "copilot_hours_type": 2420, "aircraft_hours": 24375, "circumstances": "On 19 October 2013, an Avions de Transport Régional ATR42-320 freighter, registered P2-PXY (PXY) and operated by Air Niugini, was scheduled to fly from Madang to Tabubil, Western Province, as flight PX2900 carrying a load tobacco for a client company. There were three persons on board; the pilot in command (PIC), a copilot, and a PNG experienced DHC-8 captain whose function was to provide guidance during the approach into Tabubil. The PIC was the handling pilot and the copilot was the support monitoring pilot. The flight crew taxied to the threshold end of runway 25 intending to use the full length of the runway. The take-off roll was normal until the PIC tried to rotate at VR (speed for rotation, which the flight crew had calculated to be 102 knots). He subsequently reported that the controls felt very heavy in pitch and he could not pull the control column back in the normal manner. Flight data recorder (FDR) information indicated that approximately 2 sec later the PIC aborted the takeoff and selected full reverse thrust. He reported later that he had applied full braking. It was not possible to stop the aircraft before the end of the runway and it continued over the embankment at the end of the runway and the right wing struck the perimeter fence. The aircraft was substantially damaged during the accident by the impact, the post-impact fire and partial immersion in salt water. The right outboard wing section was completely burned, and the extensively damaged and burnt right engine fell off the wing into the water. Both propellers were torn from the engine shafts and destroyed by the impact forces. ", "probable_cause": "The following findings were identified:\r\n- The investigation found that Air Niugini’s lack of robust loading procedures and supervision for the ATR 42/72 aircraft, and the inaccurate weights provided by the consignor/client company likely contributed to the overload. \r\n- The mass and the centre of gravity of the aircraft were not within the prescribed limits. \r\n- The aircraft total load exceeded the maximum permissible load and the load limit in the forward cargo zone ‘A’ exceeded the zone ‘A’ structural limit.\r\n- There was no evidence of any defect or malfunction in the aircraft that could have contributed to the accident. "}