{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-340-58-vienna-7-killed", "date": "Oct 11, 1955 at 1540 LT", "type": "Convair CV-340", "operator": "JAT%20Yugoslav%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Cairo – Athens – Belgrade – Vienna – Frankfurt – London", "msn": "178", "yom": 1955, "flight_number": null, "city": "Vienna", "zone": "Vienna", "country": "Austria", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 1, "pax_on_board": 25, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight departed Belgrade Airport in clear weather at approximately 1230 hours Greenwich Mean Time en route to Vienna carrying 25 passengers and a crew of 4. At 1425 hours the aircraft was transferred by area control to Vienna approach control. The pilot was advised to use the homer for approach and a QDM of 100° was given at 1429 hours. At 1430 the aircraft reported over radio beacon OEW and was instructed to remain 150 meters (500 feet) above the cloud top. A QDM of 123° was obtained at this time. At 1431 the aircraft was cleared to descend to 1,060 meters (3,500 feet) and instructed to report again at this altitude over beacon OEW. The flight was cleared then for an instrument approach, the pilot was given the QNH setting for his altimeter and instructed to use Runway 12. Bearings were taken and QDM's reported to the pilot, the last being: \"1439 hours: QDM 140°. As requested, this one was repeated. However, it was not acknowledged by the pilot. Shortly after, the aircraft, while flying In the direction of the airport, with landing gear down and flaps at the approach angle, gave full throttle for a moment, pulled up and crashed at 1440 hours into the northwest slope of the Kahlenberg, facing up- hill. Fire broke out following impact and the aircraft was completely destroyed. The pilot and five passengers were killed and one passenger received fatal injuries. The other occupants of the aircraft received injuries of varying degrees and seven passengers required no medical attention whatsoever.", "probable_cause": "The aircraft flew for a longer period on the outbound track and descended below the prescribed minimum altitude laid down at the time by the airline for operations into Schwechat aerodrome."}