{"url": "https://www.baaa-acro.com/crash/crash-learjet-23-ansonia-2-killed", "date": "Jan 18, 1990 at 0551 LT", "type": "Learjet 23", "operator": "Aeroflight Services", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Plain, Valley", "schedule": "Detroit - Louisville", "msn": "23-067", "yom": 1965, "flight_number": null, "city": "Ansonia", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 20000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5600, "circumstances": "At 0515 est, the flight was cleared for takeoff on a flight from Ypsilanti, MI to Louisville, KY. About 17 minutes later, the flight crew began to display indications of a deterioration of their ability to control the aircraft. At 1st, they deviated from instruments to hold west of the Findlay VOR at FL220. As the flight continued and was cleared to FL270, the crew displayed confusion about magnetic headings and basic instruments. At 1048 est, the aircraft deviated from the en route heading and the wrong heading was read back after a heading correction was given. Also, the aircraft continued climbing (to FL291), then radar and radio contact were lost at 0551 est. The controller noted the pilot's speech was slurred and some portions of the conversation were unintelligible. Subsequently, the aircraft crashed in a steep dive. No preimpact part failure was verified, though impact forces and post-crash fire resulted in extensive damage of the aircraft. The aircraft was equipped with oxygen and pressurization system. No audible warning was noted on ATC recordings to indicate the cabin altitude had exceeded 10,000 feet, though the aircraft was equipped with such a device. Both pilots were killed. ", "probable_cause": "The flight crew became incapacitated for undetermined reasons and lost control of the airplane."}