{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-australia-dha-3-drover-2-near-camooweal", "date": "Apr 26, 1957", "type": "De Havilland Australia DHA-3 Drover", "operator": "Northern Territory Medical Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Camooweal - Alice Springs", "msn": "5017", "yom": 1951, "flight_number": null, "city": "Camooweal", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Crash location was 57 miles south of Camooweal near the NT/Queensland border. TAA Captain Richard Paul was relieving TAA Captain Harry Moss as resident NTMS pilot at Alice Springs, NT. Paul had just departed Camooweal to return to Alice Springs, carrying the doctor and nurse. They had been asked to look out for a missing stockman on horseback. Some 40 miles out of Camooweal, the pilot sighted a lone horseman. Preparations were being made in the circling aircraft to drop a message in order to establish the rider’s identity when the aircraft struck level ground near the Border Fence and slid some 85 metres before coming to rest in a substantially damaged condition. The horse rider ignored the circling aircraft and rode away, unaware the aircraft had crashed. An RFDS Drover and ground parties reached the site later the same day. The two passengers were returned to Camooweal in a vehicle. However Dick Paul needed urgent medical attention, and was flown to Mount Isa hospital by the RFDS Drover. His condition required urgent transfer to Brisbane, and no airline flight was available. A BOAC Britannia on scheduled service Darwin-Brisbane agreed to divert to collect him but Mount Isa runways were unsuitable and nearest location with required runway length was Cloncurry. A TAA DC-3 carried him from Mount Isa to Cloncurry, but the Britannia's main wheels broke through the taxiway surface pavement after landing. It was unable to move. With no other choice, Captain Paul was re-loaded on board the TAA DC-3 which then took him to Brisbane, where he recovered in hospital.  The Britannia was stranded at Cloncurry for 3 days and its passengers accommodated with families in town. \nSource:\nhttp://www.goodall.com.au/australian-aviation/drover/drover.htm", "probable_cause": null}