{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-i-conway-2-killed", "date": "Jun 30, 2007 at 1450 LT", "type": "Cessna 500 Citation", "operator": "IHR Administrative Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Wichita Falls – Conway", "msn": "500-0206", "yom": 1974, "flight_number": null, "city": "Conway", "zone": "Arkansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 1, "total_fatalities": 2, "captain_hours": 5575, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4752, "circumstances": "The twin-engine turbojet airplane was attempting to land on a runway with standing water when the accident occurred. Before the landing attempt, the pilot was told that the runway was wet from a recent rain shower. Witnesses reported seeing the airplane on the runway traveling at a high speed and then increase engine power to abort the landing with about 1/4 of the runway remaining. The surviving passenger reported that the runway was \"soaked and shiny with water.\" He stated that the airplane landed hard and fishtailed during the landing roll. During the aborted landing the airplane impacted a jet-blast deflector located off the departure end of the runway. The airplane then proceeded through the airport perimeter fence and impacted a residential structure before coming to a stop. The airplane and residential structure were destroyed during a postaccident fire. An examination of the airframe and engines did not reveal any anomalies associated with a preimpact failure or malfunction. The airplane was not equipped with thrust reversers or an anti-skid braking system. Radar track data analysis indicated that when the airplane was about 1/4 mile from the end of the runway it was approximately 16 knots above its target landing reference speed (Vref) and had a descent rate of 1,150 feet per minute. The runway was 4,875 feet long. The calculated landing distance for a runway with standing water is 4,789 feet.", "probable_cause": "The pilot's failure to fly a stabilized approach and his delayed decision to abort the landing. Contributing to the accident was the standing water on the runway."}