{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-104b-irkoutsk-33-killed", "date": "Jul 13, 1963 at 0506 LT", "type": "Tupolev TU-104", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Beijing– Irkotsk – Omsk – Moscow", "msn": "0 2 16 05", "yom": 26, "flight_number": "SU012", "city": "Irkutsk-Intl", "zone": "Irkutsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 30, "pax_fatalities": 28, "other_fatalities": 0, "total_fatalities": 33, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2497, "circumstances": "On final approach to Irkustk-Intl Airport, the crew encountered poor weather conditions and a visibility below minima. The airplane lost height and struck approach lights located 2,450 meters short of runway 29 threshold. It then struck a hill, flew on a distance of 570 meters and eventually crashed in flames 1,880 meters short of runway. The aircraft was destroyed by impact forces and a post crash fire and two passengers were rescued while 33 other occupants were killed, among them the spouse of the Ambassador of Albania in China. ", "probable_cause": "It was determined that the sudden loss of altitude on final approach was the consequence of an excessive accumulation of water in the Pitot tubes, which resulted in the modification of several instrument settings and caused the aircraft to adopt an approach configuration not in accordance with the published procedures. It was reported that weather information related to Irkutsk Airport and transmitted to the crew were inaccurate and failed to reflect the truth. Also, the person in charge of the weather forecast bulletin at departure airport failed to double check the information and transmitted inaccurate data. At the time of the accident, the weather conditions at Irkutsk airport were poor and the visibility was below minima. Despite this situation, ATC at Irkutsk-Magan Airport cleared the crew to land and failed to instruct him to divert to another airport. "}