{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c18s-expeditor-waldron-1-killed", "date": "May 23, 1999 at 1915 LT", "type": "Beechcraft C18S", "operator": "Robert A. Younkin", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Beaumont – Springdale", "msn": "8205", "yom": 1945, "flight_number": null, "city": "Waldron", "zone": "Arkansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6860, "captain_hours_type": 860, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4400, "circumstances": "During a cross-country flight, the pilot of the twin-engine airplane reported to air traffic control that he has 'lost an engine.' A witness observed the right engine hanging from its lower mounts as the airplane turned right and headed towards the nearest airport. The airplane impacted trees approximately 1 mile short of the runway threshold. Examination of the right engine propeller revealed that one of its blades was separated about mid-span. The separated tip section of the blade was not recovered. Metallurgical examination of the fracture surface revealed that the blade failed as a result of a fatigue crack that originated from corrosion pits on the camber surface (face) of the blade. The failed blade was examined approximately 6 hours prior to the accident in accordance with an airworthiness directive (AD 81-13-06 R2) that called for inspections of the blade for corrosion and fatigue. However, the inspections called out in the AD were only applicable to the blade fillet and shank regions, well inboard of the fracture location on the failed blade. Overhaul of the propeller in accordance with the propeller manufacturer's manual includes grinding of each blade to 'remove all visual evidence of corrosion.' According to the airplane's owner, the propellers had not been overhauled in the eight years that he had owned the aircraft. The maintenance records were destroyed in the accident, which precluded determination of the date and time of the last propeller overhaul. The accident airplane was being operated under Title 14 CFR Part 91, and therefore, the propellers were not required to be overhauled at specified intervals.", "probable_cause": "The separation of a propeller blade in cruise flight as a result of fatigue cracking emanating from surface corrosion pitting. "}