{"url": "https://www.baaa-acro.com/crash/crash-antonov-12bp-luzino", "date": "Feb 24, 1996", "type": "Antonov AN-12", "operator": "Sakha%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Moscow – Omsk – Bratsk – Yakutsk", "msn": "6 4 019 06", "yom": 1966, "flight_number": "K29052", "city": "Luzino", "zone": "Omsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was completing a cargo flight from Moscow to Yakutsk with intermediate stops in Omsk and Bratsk, carrying three passengers, seven crew members and a load of 10,990 kilos of various goods (not declared before departure from Moscow). On approach to Omsk-Tsentralny Airport, at an altitude of 1,150 metres, all four engines failed simultaneously. The captain reduced his altitude and made a belly landing in a snow covered field located near Luzino, about 22 km west of the airport. After touchdown, the aircraft slid for few dozen metres, collided with a car and came to rest. All 10 occupants escaped uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "Failure of all four engines due to fuel exhaustion. The following contributing factors were reported:\r\n- Poor flight planning, \r\n- The crew failed to calculate the correct amount of fuel necessary for the all flight and reserves according to procedures, \r\n- The captain decided to initiate the descent prematurely, increasing the fuel consumption during the last portion of the flight, \r\n- The flight engineer failed to monitor the fuel consumption during flight, \r\n- Failure of the fuel pump n°5,\r\n- The captain failed to divert to an alternate airport while en route from Moscow to Omsk. "}