{"url": "https://www.baaa-acro.com/crash/crash-antonov-2-near-altayskoye-12-killed", "date": "Mar 7, 1975 at 1105 LT", "type": "Antonov AN-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Barnaul - Biisk - Altayskoye", "msn": "14547311", "yom": 1954, "flight_number": "SU361", "city": "Altayskoye", "zone": "Altai Krai", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 13, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17808, "circumstances": "The single engine airplane departed Barnaul Airport at 0945LT bound for Altayskoye with an intermediate stop at Biisk. For unknown reason, the crew did not land in Biisk and continued directly to Altayskoye. Approaching Altayskoye, the crew encountered marginal weather conditions with light snow and a visibility limited to 1,500 - 2,500 meters due to low clouds. While cruising at an altitude of 820 meters, the left wings struck tree tops. The pilot increased engine power and the airplane continued to fly for about 200 meters during six seconds when he reached a critical angle of attack, stalled and crashed on the south slope of the Mt Vereskovaya located 12,5 km from Altayskoye. As the airplane failed to arrive, SAR operations were conducted and the wreckage was found a day later, in the morning of March 8, at an altitude of 890 meters in a rocky area. The copilot and four passengers were seriously injured while 10 other occupants were killed. A day later, on March 9, the copilot and a passenger died from their injuries. ", "probable_cause": "Controlled flight into terrain after the crew lost his orientation while flying in poor visibility and below the minimum safe altitude. Lack of ATC assistance and a weather bulletin that was not reflecting the actual weather conditions published by the Barnaul weather bureau were considered as contributing factors. "}