{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-500tp-malibu-meridian-saranac-lake-4-killed", "date": "Aug 7, 2015 at 1750 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Majestic Air", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Saranac Lake – Rochester", "msn": "46-97117", "yom": 2001, "flight_number": null, "city": "Saranac Lake-Adirondack", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 4620, "captain_hours_type": 230, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The private pilot, who was experienced flying the accident airplane, was conducting a personal flight with three passengers on board the single-engine turboprop airplane. Earlier that day, the pilot flew uneventfully from his home airport to an airport about 1 hour away. During takeoff for the return flight, the airplane impacted wooded terrain about 0.5 mile northwest of the departure end of the runway. There were no witnesses to the accident, but the pilot's radio communications with flight service and on the common traffic advisory frequency were routine, and no distress calls were received. A postcrash fire consumed a majority of the wreckage, but no preimpact mechanical malfunctions were observed in the remaining wreckage. Examination of the propeller revealed that the propeller reversing lever guide pin had been installed backward. Without the guide pin installed correctly, the reversing lever and carbon block could dislodge from the beta ring and result in the propeller blades traveling to an uncommanded feathered position. However, examination of the propeller components indicated that the carbon block was in place and that the propeller was in the normal operating range at the time of impact. Additionally, the airplane had been operated for about 9 months and 100 flight hours since the most recent annual inspection had been completed, which was the last time the propeller was removed from and reinstalled on the engine. Therefore, the improper installation of the propeller reversing lever guide pin likely did not cause the accident. Review of the pilot's autopsy report revealed that he had severe coronary artery disease with 70 to 80 percent stenosis of the right coronary artery, 80 percent stenosis of the left anterior descending artery, and mitral annular calcification. The severe coronary artery disease combined with the mitral annular calcification placed the pilot at high risk for an acute cardiac event such as angina, a heart attack, or an arrhythmia. Such an event would have caused sudden symptoms such as chest pain, shortness of breath, palpitations, or fainting/loss of consciousness and would not have left any specific evidence to be found during the autopsy. It is likely that the pilot was acutely impaired or incapacitated at the time of the accident due to an acute cardiac event, which resulted in his loss of airplane control.", "probable_cause": "The pilot's loss of airplane control during takeoff, which resulted from his impairment or incapacitation due to an acute cardiac event.\n"}