{"url": "https://www.baaa-acro.com/crash/crash-airbus-a300b2-101-near-tirupati", "date": "Nov 15, 1993 at 0925 LT", "type": "Airbus A300", "operator": "Indian%20Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Madras - Hyderabad", "msn": "034", "yom": 1976, "flight_number": "IC440", "city": "Tirupati", "zone": "Andhra Pradesh", "country": "India", "region": "Asia", "crew_on_board": 12, "crew_fatalities": 0, "pax_on_board": 250, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17344, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Indian Airlines Airbus A-300 aircraft VT-EDV was operating scheduled flight IC-440 (Madras - Hyderabad sector) on 15.11.1993. There were a total of 262 persons were on board the aircraft including 247+3 passengers and 12 crew members. The aircraft could not land at Hyderabad due to low visibility and carried out a missed approach. After the missed approach, the aircraft reported \"Flap Problem\" and was holding overhead at Hyderabad during which the flight crew enquired visibility at nearby Air Force airfields which was also low. The aircraft then diverted to Madras. Due to flaps problem, the crew had to maintain low speed and low altitude as a result of which it experienced fuel shortage and sought permission from Madras control for landing at Tirupati. However, the aircraft could not reach even Tirupati airport and executed forced landing in an open paddy field about 14 nautical miles from Tirupati airport. The aircraft dragged on the soft paddy field before coming to final stop. There was no fire. Passenger evacuation was carried out by means of escape slides. All the persons on board escaped unhurt except four who received minor injuries.", "probable_cause": "The probable cause of accident has been attributed to:\r\n- The ill-conceived decision of the aircraft's Commander to divert to Madras, without ensuring that adequate fuel was available for reaching there, when he was faced with a flap-jam and poor\r\nvisibility at Hyderabad.\r\n- The failure of the aircraft's Commander and his Flight Crew to monitor fuel consumption correctly, and the failure of the Commander to revise his decision accordingly, until it became impossible to reach any airfield.\r\n-  A forced landing due to the eventual shortage of fuel."}