{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-marathon", "date": "Feb 20, 2003 at 1220 LT", "type": "Cessna 402", "operator": "Bel Air Transport", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Havana – Marathon – Miami", "msn": "402B-1308", "yom": 1977, "flight_number": null, "city": "Marathon", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4000, "captain_hours_type": 817, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11303, "circumstances": "The fuel tanks were filled the day before the accident date, and on the day of the accident, the airplane was flown from that airport to the Miami International Airport, where the pilot picked up 2 passengers and flew uneventfully to Cuba. He performed a preflight inspection of the airplane in Cuba and noted both auxiliary fuel tanks were more than half full and both main tanks were half full. The flight departed, climbed to 8,000 feet; and was normal while in Cuban airspace. When the flight arrived at TADPO intersection, he smelled strong/fumes of fuel in the cabin. The engine instruments were OK at that time. The flight continued and when it was 10-12 miles from Marathon, he smelled something burning in the cabin like plastic material/paper; engine indications at that time were normal. He declared \"PAN\" three times with the controller, and shortly thereafter the right engine began missing and surging. He then observed fire on top of the right engine cowling near the louvers. He secured the right engine however the odor of fuel and fumes got worse to the point of irritating his eyes. He declared an emergency with the controller, began descending at blue line airspeed, and the fumes/odor got worse. Approximately 5 minutes after the right engine began missing and surging, the left engine began acting the same way. He secured the left engine but the propeller did not completely feather. At 400 feet he lowered full flaps and (contrary to the Pilot's Operating Handbook and FAA Approved Airplane Flight Manual) the landing gear in preparation for ditching. He intentionally stalled the airplane when it was 5-7 feet above the water, evacuated the airplane with a life vest, donned then inflated it. The airplane sank within seconds and he was rescued approximately 20 minutes later. The pilot first reported 4 months and 19 days after the accident that his passport which was in the airplane at the time of the accident had burned pages. He was repeatedly asked for a signed, dated statement that explained where it was specifically located in the airplane, and that it was not burned before the accident flight; he did not provide a statement. Examination of the airplane by FAA and NTSB revealed no evidence of an in-flight fire to any portion of the airplane, including the right engine or engine compartment area, or upper right engine cowling. Examination of the left engine revealed no evidence of preimpact failure or malfunction. The left magneto operated satisfactorily on a test bench, while the right magneto had a broken distributor block; and the electrode tang which fits in a hole of the distributor gear; no determination was made as to when the distributor block fractured or the electrode tang became bent. The left propeller blades were in the  feathered position. Examination of the right engine revealed no evidence or preimpact failure or malfunction. The right hand stack assembly was fractured due to overload; no fatigue or through wall thickness erosion was noted. Both magnetos operated satisfactorily on a test bench. The right propeller was in the feathered position. An aluminum fuel line that was located in the cockpit that had been replaced the day before the accident was examined with no evidence or failure or malfunction; no fuel leakage was noted.", "probable_cause": "The loss of engine power to both engines for undetermined reasons.\n"}