{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t2-cheyenne-ii-xl-curitiba-4-killed", "date": "Nov 6, 2012 at 1725 LT", "type": "Piper PA-31 Cheyenne", "operator": "Taxi%20Aereo%20Hercules", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dourados – Curitiba", "msn": "31-8166067", "yom": 1981, "flight_number": null, "city": "Curitiba-Bacacheri", "zone": "Paraná", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 11088, "captain_hours_type": 618, "copilot_hours": 771, "copilot_hours_type": 16, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Dourados-Francisco de Matos Pereira Airport on an on-demand flight to Curitiba, carrying two passengers, two pilots and a load consisting of valuables. On final approach to Curitiba-Bacacheri Airport, both engines failed simultaneously. The crew attempted an emergency landing when the aircraft crashed in a field and came to rest near trees. A passenger was seriously injured while three other occupants were killed. The following day, the only survivor died from his injuries. ", "probable_cause": "The following findings were identified:\r\n- Fatigue is likely to have occurred, since there are reports of high workload, capable of affecting the perception, judgment, and decision making of the crew.\r\n- In view of the fact that the captain displayed an attitude of gratefulness toward the company which hired him, working for consecutive hours and many times more than was prescribed for his daily routine, it is possible that such high motivation may have been present in the accident flight, harming his capacity to evaluate the conditions required for a safe flight.\r\n- The crew neither gathered nor properly evaluated the available pieces of information for the correct refueling of the aircraft, something that led to their decision of not refueling the aircraft in SBDO.\r\n- The company crews did not usually keep fuel records, and made approximate calculations based on the fuel remaining from previous flights, whose control parameters were not dependable. Such attitudes reflected a work-group culture that became apparent in this accident.\r\n- The pilots were presumably undergoing a condition of stress on account of the company flight routine, in which they flew every day, with little time dedicated to rest or even holidays. Under such condition, the pilots may have had their cognitive processes affected, weakening their performance in flight.\r\n- The flights had the objective of transporting valuables, causing concern in relation to security issues involving the aircraft on the ground. Thus, it is suspected that decisions made by the pilots may have been affected by this complexity, such as, for example, deciding not to refuel the aircraft on certain locations.\r\n- The way the work was structured in the company was giving rise to overload due to the routine of many flights and few periods of rest or holidays. This situation may have affected the crew’s performance, interfering in the analysis of the conditions necessary for a safe flight.\r\n- The company did not monitor the performance of its pilots for the identification of contingent deviations from standard procedures, such as non-compliance with the MGO.\r\n- Failures in the application of operational norms, as well as in the communication between the crew members, may have occurred on account of inadequate management of tasks by each individual, such as, for example, the use of the checklist and the filling out of control forms relative to fuel consumption contained in the company MGO.\r\n- The crew judged that the amount of fuel existing in the aircraft was sufficient for the flight in question.\r\n- The fact that the fuel gauges were not indicating the correct quantity of fuel had direct influence on the flight outcome, since the planning factors and the pilots’ situational awareness were affected.\r\n- The crew did not analyze appropriately the amount of fuel necessary for the flight leg between SBDO and SBBI. The Mission Order did not establish the minimum amount of fuel necessary for the flight legs, and the crew had to take responsibility for the decision.\r\n- The company was not rigorous with the filling out of aircraft logbooks and cargo manifestos, resulting that it did not have control over the operational procedures performed by the crews, and this may have contributed to the aircraft taking off with an amount of fuel that was insufficient for the flight. Although the MGO had parameters established for calculating the endurance necessary for VFR/IFR flights, the company did not define the fuel necessary in the Mission Orders, transferring the responsibility for the decision to the aircraft captain."}