{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-mbs-tri-city-3-killed", "date": "Mar 5, 1992 at 1504 LT", "type": "Cessna 414 Chancellor", "operator": "Airborne Flying Services", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "MBS-Tri-City - Chicago", "msn": "414-0621", "yom": 1975, "flight_number": null, "city": "MBS-Tri-City (Midland, Bay City & Saginaw)", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2057, "captain_hours_type": 184, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4106, "circumstances": "While loading a patient & his personal gear in the aircraft for an air ambulance flight, the aircraft tipped onto its tail. As a result, the tail bumper was forced upward into the belly of the empennage. The pilot refused the offer to have a mechanic look at the damage, and remarked 'this has happened before.' after takeoff, the pilot radioed to the tower that he had a jammed elevator, and was coming around to land. While maneuvering on a base leg, control was lost & the airplane was observed to crash with one wing perpendicular to the ground. Another airplane was in the takeoff position on the runway. The airplane was configured with a hospital litter/stretcher and oxygen bottle on the right side of the cabin. There was no record for the approval for, or installation of, the stretcher. In addition, there was no weight & balance record for the airplane with the stretcher installation. All three occupants were killed.  ", "probable_cause": "The pilot's poor judgement in attempting flight after the airplane's fuselage was damaged during a loading operation. Factors which contributed to the accident were: the operator's failure to provide proper weight and balance data for the airplane, the pilot's failure to supervise the loading operation, and his failure to accept the services of a mechanic to inspect the damage."}