{"url": "https://www.baaa-acro.com/crash/crash-xian-ma60-kupang", "date": "Jun 10, 2013 at 0954 LT", "type": "Xian MA60", "operator": "Merpati-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bajawa - Kupang", "msn": "06 08", "yom": 2008, "flight_number": "MZ6517", "city": "Kupang", "zone": "East Nusa Tenggara", "country": "Indonesia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 46, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12530, "captain_hours_type": 2050, "copilot_hours": 311, "copilot_hours_type": 141, "aircraft_hours": 4486, "circumstances": "On 10 June 2013, a Xi ‘An MA60 aircraft registered PK-MZO was being operated by PT. Merpati Nusantara Airlines on a scheduled passenger flight as MZ 6517. The aircraft departed from Bajawa Airport (WATB) Nusa Tenggara Timur, at 0102 UTC to El Tari (WATT) Kupang, Nusa Tenggara Timur. On board this aircraft were 2 pilots, 2 flight attendants with 46 passengers consisted of 45 adults and 1 infant. The flight was the second sectors for the aircraft and the crew on that day. The first flight was from Kupang to Bajawa Airport. During the flight the Second in Command (SIC) acted as the Pilot Flying (PF) and the Pilot in Command (PIC) as the Pilot Monitoring (PM). The flight from the departure until commencing for approach was un-eventful. At 0122 UTC, the pilot made first communication with El Tari Control Tower controller (El Tari Tower) and reported their position was on radial 298° 110 Nm from KPG VOR and maintaining 11,500 ft. The pilot received information that the runway in use was 07 and the weather information (wind 110° 11 kts, visibility 10 km, weather NIL, cloud few 2,000 ft, temperature 30° C, dew point 22° C, QNH 1010 mbs and QFE 998 mbs). At 0133 UTC, the aircraft was on radial 297° 68 Nm from KPG VOR and the pilot ready to descend and approved by El Tari Tower to descend to 5,000 ft. At 0138 UTC, the pilot reported the aircraft was passing 10,500 ft and stated that the flight was on Visual Meteorological Condition (VMC). At 0150 UTC, the aircraft position was on left base runway 07 at 5 Nm from KPG VOR. The El Tari Tower had visual contact with the aircraft and issued a landing clearance with additional information that the wind condition was 120° at 14 kts, QNH 1010 mbs. At 0151 UTC, the pilot reported that their position was on final and the El Tari Tower re-issued the landing clearance. The Flight Data Recorder (FDR) recorded that the left power lever was in the range of BETA MODE while the aircraft altitude was approximately 112 ft and followed by the right power lever at 90 ft until hit the ground. At 0154 UTC, the aircraft touched down at about 58 meters and halted on the runway at about 261 meters from the beginning of runway 07. The vertical deceleration recorded on FDR was 5.99 G and followed by - 2.78 G. After the aircraft stopped, the flight attendants assessed the situation and decided to evacuate the passengers through the rear main entrance door. One pilot and four passengers who seated on row number three, seven and eight suffered serious injury.  On 11 June 2013, the aircraft was evacuated from the runway and moved to the Air Force hangar at 2100 UTC. ", "probable_cause": "The following contributing factors were identified:\r\n- The procedure of selecting Power Lever Lock to “OPEN” during approach was made without comprehensive risk assessment.\r\n- Both power levers entered BETA MODE at 90 feet due to the safety device namely Power Lever Lock has been opened during approach, which was in accordance to the operator procedure and lifting of Mechanical Power Lever Stop Slot which was not realized by the pilots.\r\n- The movement of power levers to BETA MODE resulted the pitch angle changed to low pitch angle which produced significant drag and made the aircraft loss of significant lift."}