{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-65-queen-air-near-orlando-5-killed", "date": "Dec 19, 1992 at 0739 LT", "type": "Beechcraft 65 Queen Air", "operator": "William J. Edwards", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Sanford – Fort Lauderdale", "msn": "LC-164", "yom": 1965, "flight_number": null, "city": "Orlando", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 8269, "captain_hours_type": 40, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3700, "circumstances": "Pilot reported level at 6,000 feet; no further transmissions were received. Radar data shows that after 5 minutes at cruise flight ground speed began to slow, and as speed reached 85 knots (VMC is 83 knots) aircraft made a rapid turn to the left and the speed dropped to 74 knots. Radar contact was then lost. Witnesses reported hearing and seeing aircraft with an engine sputtering and quitting, at which time no engine noise was audible. Engine would then restart, and at one point aircraft was observed initiating a climb after engine start. Engine restarted and obtained near full power, and a short time later sound of impact was heard. The left engine fuel servo was found contaminated with corrosion and dirt, and would not allow fuel flow to the engine. The fuel strainer for this engine was installed backwards allowing unfiltered fuel to enter the engine. The left propeller was not feathered and had no signs of rotation under power. Right engine fuel servo also contained corrosion and contamination. The aircraft did not have a current annual inspection. All five occupants were killed.  ", "probable_cause": "The pilot's failure to feather the propeller to maintain altitude following a loss of power of the left engine. The power loss was due to an improperly maintained fuel system. In addition, the right engine lost power for an undetermined reason(s)."}