{"url": "https://www.baaa-acro.com/crash/crash-bae-3201-jetstream-32ep-near-chulum-juarez-19-killed", "date": "Jul 8, 2000 at 1950 LT", "type": "BAe Jetstream 31", "operator": "Aerocaribe", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Tuxtla Gutiérrez – Villahermosa – Veracruz – Mérida", "msn": "912", "yom": 1990, "flight_number": "QA7831", "city": "Chulum Juárez", "zone": "Chiapas", "country": "Mexico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 17, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 19, "captain_hours": 5300, "captain_hours_type": 1100, "copilot_hours": 667, "copilot_hours_type": 40, "aircraft_hours": 12041, "circumstances": "The aircraft departed Tuxtla Gutiérrez Airport on a regular schedule flight to Mérida with intermediate stops in Villahermosa and Veracruz, carrying 17 passengers and two pilots. En route to Villahermosa-Carlos Rovirosa Pérez Airport, at an altitude of 16,000 feet and about 50 miles from the destination, the crew encountered poor weather conditions and deviated from the V3 Airway to the right for about 24 km. After he initiated the descent, the crew was instructed by ATC to report 25 DME. Shortly later, while descending in clouds, the twin engine aircraft struck the slope of a mountain located near Chulum Juárez, about 80 km southeast of Villahermosa Airport. The wreckage was found at an altitude of 1,890 metres. The aircraft disintegrated on impact and all 19 occupants were killed. ", "probable_cause": "Controlled flight into terrain. Combining instrument flight (IFR), with visual flight (VFR), the crew lost situational awareness, deviating 29.8 miles to the right of the Victor 3 airway due to bad weather, when the weather conditions imposed the application of the instrument flight rules (IFR), causing collision of the aircraft with the mountain at 6200 feet of elevation without loss of control (CFIT).\r\nThe following contributing factors were identified:\r\n- Severe weather conditions en route,\r\n- Persistence of the pilot in command, to continue the instrument flight (IFR) on visual flight (VFR),\r\n- Inconsistency in cockpit resource management (CRM),\r\n- Loss of situational awareness of the flight crew and the controllers, due to numerous deviations from the route, due to severe weather conditions and poor communication between the parties.\r\n- inadequate preparation of the flight plan, since in view of the very probable need to circumnavigate severe meteorological conditions, the flight altitudes that would continue outside of the controlled airspace (outside the v-3 airway) were not verified."}