{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b60-duke-fullerton-1-killed", "date": "Apr 18, 2019 at 1951 LT", "type": "Beechcraft 60 Duke", "operator": "KMA Technology Solutions", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Fullerton - Heber City", "msn": "P-314", "yom": 1975, "flight_number": null, "city": "Fullerton", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 380, "captain_hours_type": 87, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5419, "circumstances": "The pilot began the takeoff roll in visual meteorological conditions. The airplane was airborne about 1,300 ft down the runway, which was about 75% of the normal ground roll distance for the airplane’s weight and the takeoff environment. About 2 seconds after rotation, the airplane rolled left. Three seconds later, the airplane had reached an altitude of about 80 ft above ground level and was in a 90° left bank. The nose then dropped as the airplane rolled inverted and struck the ground in a right-wing-low, nose-down attitude. The airplane was destroyed. Postaccident examination did not reveal any anomalies with the airframe or engines that would have precluded normal operation. The landing gear, flap, and trim positions were appropriate for takeoff and flight control continuity was confirmed. The symmetry of damage between both propeller assemblies indicated that both engines were producing equal and high amounts of power at impact. The autopsy revealed no natural disease was present that could pose a significant hazard to flight safety. Review of surveillance video footage from before the accident revealed that the elevator was in the almost full nose-up (or trailing edge up) position during the taxi and the beginning of the takeoff roll. Surveillance footage also showed that the pilot did not perform a preflight inspection of the airplane or control check before the accident flight. According to the pilot’s friend who was also in the hangar, as the accident pilot was pushing the airplane back into his hangar on the night before the accident, he manipulated and locked the elevator in the trailing edge up position to clear an obstacle in the hangar. However, no evidence of an installed elevator control lock was found in the cabin after the accident. The loss of control during takeoff was likely due to the pilot’s use of an unapproved elevator control lock device. Despite video evidence of the elevator locked in the trailing edge up  position before the accident, an examination revealed no evidence of an installed control lock in the cabin. Therefore, during the night before the accident, the pilot likely placed an unapproved object between the elevator balance weight and the trailing edge of the horizontal stabilizer to lock the elevator in the trailing edge up position. The loss of control was also due to the pilot’s failure to correctly position the elevator before takeoff. The pilot’s friend at the hangar also reported that the pilot was running about one hour late; the night before, he was trying to troubleshoot an electrical issue in the airplane that caused a circuit breaker to keep tripping, which may have become a distraction to the pilot. The pilot had the opportunity to detect his error in not freeing the elevator both before boarding the airplane and again while in the airplane, either via a control check or detecting an anomalous aft position of the yoke. The pilot directed his attention to the arrival of a motorbike in the hangar alley shortly after he pulled the airplane out of the hangar, which likely distracted the pilot and further delayed his departure. He did not conduct a preflight inspection of the airplane or control check before the accident flight, due either to distraction or time pressure. ", "probable_cause": "The pilot’s use of an unapproved elevator control lock device, and his failure to remove that device and correctly position the elevator before flight, which resulted in a loss of control during takeoff. Contributing to the accident was his failure to perform a preflight inspection and control check, likely in part because of distractions before boarding and his late departure time."}