{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-marlinton-1-killed", "date": "Nov 28, 1995 at 0940 LT", "type": "Cessna 414 Chancellor", "operator": "Casey%20Industrial", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Mountains", "schedule": "Sutton - Lynchburg", "msn": "414-0353", "yom": 1972, "flight_number": null, "city": "Marlinton", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4850, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3378, "circumstances": "The pilot took off from an uncontrolled airport. He attempted to obtain an IFR clearance and reported that he was VFR at 3,500 feet. While air traffic control personnel were locating the flight plan and coordinating the IFR clearance, they lost radio contact with the pilot. The pilot continued to fly towards his destination, transiting rising mountainous terrain which was partially obscured by clouds. Wreckage was located about 28 nautical miles from the departure airport, at the 4,050-foot level. There was no evidence of mechanical failure or malfunction. According to FAR Part 91.3, the pilot had the ultimate authority for the operation of the airplane, and in the case of an in-flight emergency, had the authority to deviate from flight rules \"to the extent required to meet that emergency.\" According to the AIM, an emergency could be either \"a distress or an urgency condition.\" An urgency condition would exist \"the moment the pilot becomes doubtful about position... weather, or any other condition that could adversely affect flight safety.\" Under FAR Part 91.3, the pilot would have been authorized to climb the airplane under IFR conditions, even if he were to enter controlled airspace.", "probable_cause": "The pilot's continued VFR flight into obscured, rising mountainous terrain, and his failure to climb the airplane as conditions worsened. Factors included the rising terrain and the weather obscuration."}