{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46a-40-cu-commando-rio-cuarto", "date": "Jan 27, 1966", "type": "Curtiss C-46 Commando", "operator": "Aerovias Halcón", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rio Grande – Río Gallegos – Río Cuarto – Buenos Aires", "msn": "26961", "yom": 1944, "flight_number": null, "city": "Río Cuarto", "zone": "Córdoba", "country": "Argentina", "region": "South America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The cargo flight Rio Grande - Río Gallegos - Río Cuarto - Buenos Aires, which had to be completed in daylight, ran late due to delays in the loading of 99 sheep. It was dark outside by the time the aircraft left Río Gallegos. The destination had been changed to Villa Reynolds, which had electric lighting instead of kerosene putts at Río Cuarto. Although weather was worsening, the crew didn't change to an IFR flight plan. Various attempts to contact Villa Reynolds failed so the crew decided to divert to Río Cuarto by following a roadway, illuminated from time to time by lightning flashes and headlights of automobile traffic. The crew managed to find the airport and overflew it first. The airport employees meanwhile weren't able to keep the kerosene putts alight due to rain and wind. Four vehicles were dispatched to mark the runway threshold with their headlights. The crew got lost and asked the controller to determine their position relative to the airport by the noise of the engines. While attempting a second run over the field to locate the runway, the aircraft descended into the ground and slid on flat ground for 300 m, broke a wire fence and came to rest in a cornfield 5 km NE of the airport. All four occupants were rescued while the aircraft was damaged beyond repair. \r\nSource: ASN", "probable_cause": "Collision with terrain while trying to land in adverse and unstable conditions due to continuation of the flight at night in known and visible adverse meteorological conditions, aggravated by the lack of an alternate aerodrome or sufficient endurance to effect a diversion."}