{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-yea", "date": "Mar 16, 1995 at 1400 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Leafair", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Yea - Yea", "msn": "883", "yom": 1956, "flight_number": null, "city": "Yea", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1468, "captain_hours_type": 244, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot reported that the flight departed from an agricultural strip located in a valley surrounded by hills. The aircraft carried a full load of superphosphate to be spread on a property approximately one mile from the strip. The pilot had previously surveyed the property and the flight path. He had selected a route that took him up through a valley between hills and then over a low ridge to the property. After take off the pilot set climb power and selected climb flap in order to follow his predetermined route to the property. The pilot advised that as the aircraft flew towards the low ridge it appeared to be descending rather than climbing. He elected to carryout a partial dump and to apply extra flap to clear a clump of trees. The speed deteriorated to 60 knots from the initial climb speed of 70 knots. The pilot did not increase power. Some 300 metres later another partial dump was carried out to clear another tree. As that tree was cleared the pilot again initiated a partial dump and turned to the right in an endeavour to escape from a rapidly deteriorating situation. Immediately the turn was initiated the right wing dropped and the aircraft stalled, impacting the ground onto the right wing and cartwheeled to a stop some 50 metres from the initial impact. The company chief pilot examined the accident site and advised that the flight path through the valley was in a classic false horizon situation whereby the surrounding hills caused the pilot to consider that the flight path was over flat terrain whilst in reality the terrain was rising approximately 5 degrees up to the ridge. The chief pilot also advised that the aircraft would not have been able to outclimb the terrain at high gross weight with only cruise power set.", "probable_cause": "Examination of the wreckage did not disclose any pre-impact factors that may have contributed to the accident. Weather and pilot workload were not considered to be factors in this accident.\r\nThe pilot had flown approximately 1200 hours on agricultural operations and 244 hours on the type. His loss of situational awareness could be due in part to his relatively low experience.\r\nThe following factors were considered relevant to the development of the accident:\r\n- At high weight, and with climb power applied, the pilot flew the aircraft on an inappropriate flight path into rising terrain.\r\n- The pilot did not take appropriate remedial actions when the aircraft could not outclimb the terrain and the aircraft speed deteriorated.\r\n- The pilot lost control of the aircraft while attempting a turn at low speed."}