{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-la-grande-2-killed", "date": "Jul 24, 2010 at 1053 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Nordair%20Quebec%202000", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "La Grande - Lac Eau Claire", "msn": "123", "yom": 1951, "flight_number": null, "city": "La Grande-Rivière", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3800, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 23808, "circumstances": "At approximately 1053 Eastern Daylight Time, de Havilland DHC-2 Mk. 1 amphibious floatplane (registration C-FGYK, serial number 123), operated by Nordair Québec 2000 Inc., took off from runway 31 at La Grande-Rivière Airport, Quebec, for a visual flight rules flight to l’Eau Claire Lake, Quebec, about 190 nautical miles to the north. The take-off run was longer than usual. The aircraft became airborne but was unable to gain altitude. At the runway end, at approximately 50 feet above ground level, the aircraft pitched up and banked left. It then nosed down and crashed in a small shallow lake. The pilot and 1 front-seat passenger were fatally injured and the 3 rear-seat passengers sustained serious injuries. The aircraft broke up on impact, and the forward part of the cockpit was partly submerged. The emergency locator transmitter activated on impact.", "probable_cause": "Findings as to Causes and Contributing Factors:  \r\n1. The aircraft was overloaded and its centre of gravity was beyond the aft limit. The aircraft pitched up and stalled at an altitude that did not allow the pilot to execute the stall recovery manoeuvre.  \r\n2. The baggage was not secured. Shifting of the baggage caused the triple seat to pivot forward, propelling the 3 rear-seat passengers against the pilot and front-seat passenger during impact. \r\n3. Although the design of the triple seat met aviation standards, it separated from the floor at the time of impact, principally due to the fact that the heavy cargo shifted. \r\n4. The action taken by TC did not have the desired outcomes to ensure regulatory compliance; consequently, unsafe practices persisted. \r\nFinding as to Risk:\r\n1. Operating an aircraft outside the limits and conditions under which a permit is issued can increase the risk of an accident "}