{"url": "https://www.baaa-acro.com/crash/crash-bae-nimrod-mr2-near-kandahar-14-killed", "date": "Sep 2, 2006 at 1547 LT", "type": "BAe Nimrod", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Plain, Valley", "schedule": "Muscat - Muscat", "msn": "8005", "yom": 1969, "flight_number": null, "city": "Kandahar", "zone": "Kandahar", "country": "Afghanistan", "region": "Asia", "crew_on_board": 14, "crew_fatalities": 14, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed at 13:43 for a mission over Afghanistan, in support of coalition forces engaging the Taliban. At 15:30 the airplane rendezvoused with an RAF Lockheed TriStar tanker and received fuel in an air-to-air refuelling procedure that lasted 10 minutes. Air-to-air refuelling appeared to pass without incident and XV230's crew prepared to turn east, towards their operational area. Eleven minutes later a bomb bay fire warning, either coincident with, or followed immediately by, an elevator bay underfloor smoke warning, was reported. The crew also reported smoke entering the aircraft’s cabin, from both elevator and aileron bays. Within a minute the aircraft depressurised as the fire breached the aircraft’s pressure hull requiring the crew to don their oxygen masks. The captain began to turn the aircraft towards Kandahar, declared a MAYDAY and began a descent. Meanwhile a crew member reported a fire 'from the rear of the starboard engines'. Another crew member reported a fire within the aileron bay. Last radio contact was at 15:46 when the crew acknowledged the Kandahar weather for landing. About the same time, a Harrier GR7 pilot, who was several thousand feet above, reported an intense fire close to the starboard fuselage and stretching out between where the wing joins the aircraft fuselage to the starboard engine; there was a second fire that stretched behind the aircraft from a point on the side of the rear body of the aircraft. At 15:47 the Harrier pilot reported that he saw the Nimrod explode. It broke into 4 sections, at a height of between 750 feet and 1000 feet. All 14 crew members were killed. \r\nCrew:\r\nF/Sgt Gary Wayne Andrews,\r\nF/Sgt Stephen Beattie,\r\nF/Sgt Gerard Martin Bell,\r\nF/Sgt Adrian Davies,\r\nL/Cpl Oliver Simon Dicketts,\r\nF/Lt Steven Johnson,\r\nSgt Benjamin James Knight,\r\nF/Lt Leigh Anthony Mitchelmore,\r\nF/Lt Gareth Rodney Nicholas,\r\nSgt John Joseph Langton,\r\nSgt Gary Paul Quilliam,\r\nF/Lt Allan James Squires,\r\nF/Lt Steven Swarbrick,\r\nMne Joseph David Windall.\n", "probable_cause": "As the Board was unable to investigate XV230's wreckage at the crash site and it proved impossible to recover more than a few small components from the aircraft, the Board has been unable to determine positively the source or cause of the fire which led to the loss of XV230 and its crew. Nonetheless, through investigation of the limited data available, the Board was able to deduce the most probable location of the fire, a number of probable causes of that event and factors which possibly contributed to it:\r\na. The escape of fuel during AAR, occasioned by an overflow from No 1 tank, or a leak from the fuel system (fuel coupling or pipe), led to an accumulation of fuel within the No 7 tank dry bay. Although of a lower probability, the fuel leak could have been caused by a hot air leak damaging fuel system seals.\r\nb. The ignition of that fuel following contact with an exposed element of the aircraft's crossfeed/ SCP pipe work.\r\nContributory factors:\r\na. The age of the Nimrod MR2's non-structural system components.\r\nb. Nimrod MR2 maintenance policy in relation to fuel and hot air systems.\r\nc. The lack of a fire detection and suppression system within the No 7 tank dry bay.\r\nd. The fact that hazard analysis did not correctly categorize the potential threat to the aircraft caused by the collocation of fuel and hot air system components within the No 7 tank dry bay.\r\ne. The formal incorporation of AAR capability within the Nimrod did not identify the full implications of successive changes to the fuel system and associated procedures.\r\nAggravating factor:\r\na. The loss of flying controls through fire damage to the hydraulic systems or cables and pulleys."}