{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-15-ustica-island-81-killed", "date": "Jun 27, 1980 at 2059 LT", "type": "Douglas DC-9", "operator": "Aerolinee-Itavia-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Bologna - Palermo", "msn": "45724/22", "yom": 1966, "flight_number": "IH870", "city": "Ustica", "zone": "Sicily", "country": "Italy", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 77, "pax_fatalities": 77, "other_fatalities": 0, "total_fatalities": 81, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 29544, "circumstances": "The airplane departed Bologna Airport at 2008LT on a regular schedule service to Palermo, carrying 77 passengers and a crew of four. While cruising at an altitude of 24,000 feet, the airplane disappeared from radar screens and the crew was unable to send any distress call. SAR operations were initiated and few debris and dead bodies were found floating on water about 25 km northeast of Ustica Island, north of Sicily. The main wreckage sank by a depth of 3,500 meters. The cause o the accident could not be determined. On 28 April 1987, Italian authorities decided to refloat the wreckage and traces of T4 explosive was found and several debris. In reference to ATC testimony, two unidentified objects were flying in the area at the time of the accident and it is believed this was two Libyan fighters. One of the pilot probably decided to leave and placed his plane below the DC-9 that exploded when the second pilot tried to shot him down. After the air-air missile was shot, the first fighter leaved the area, causing the missile to struck the DC-9. In 1994, Italian Authorities questioned this theory when a new official document reported that the DC-9 exploded in mid-air due to the denotation of an explosive device placed on board. In 2000, the real cause of this tragedy was still unknown. In 2008, following statements from the ex President of the Italian Republic Francesco Cossiga, the assumption that the airplane may have been shot down by a French missile was rediscussed. The President stated that French and US Authorities thought that the Libyan President Mouammar Kadhafi was on board and must be killed. Many theories were published since 1980 and the exact cause and circumstances of this tragedy remain unknown to date. ", "probable_cause": "Undetermined. "}