{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-caravan-i-oslo-1-killed", "date": "Dec 4, 1994 at 0502 LT", "type": "Cessna 208B Grand Caravan", "operator": "Air Team", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Oslo - Bergen", "msn": "208B-0310", "yom": 1992, "flight_number": null, "city": "Oslo-Gardermoen", "zone": "Akershus", "country": "Norway", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1676, "captain_hours_type": 327, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2193, "circumstances": "The aircraft was completing a cargo flight to Bergen, carrying one pilot and 1,389 kilos of newspapers. Following a night takeoff from runway 19, while climbing in poor weather conditions at an altitude of about 390 metres, the single engine aircraft stalled and crashed in a wooded area located 1,5 km from the airport. The pilot, sole on board, was killed. ", "probable_cause": "The accident was the consequence of a stall during initial climb to an excessive accumulation of ice on wings and tail as the aircraft had not been deiced prior to departure. The following contributing factors were reported: \r\n- The plane was outdoors for an estimated time of 20 minutes under conditions in which ice could adhere on the surface of the plane's hull, wings and tail surfaces.\r\n- The plane was not de-iced by the pilot prior to departure.\r\n- The company had not developed adequate written instructions for de-icing. The company had no written instructions to prevent icing during ground stay.\r\n- The company had no sufficient equipment available, or added conditions sufficiently organized so that icin accretion be prevented or removed before departure from Gardermoen.\r\n- The plane took off with ice on the surface of the wings and tail surfaces\r\n- Ice on the surface of the wings and tail surfaces reduced flight characteristics in such a degree that the pilot did not manage to gain height after departure and therefore crashed."}