{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-ahmic-lake", "date": "Jul 3, 1988", "type": "De Havilland DHC-2 Beaver", "operator": "De-Havilland-Aircraft-of-Canada", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": null, "msn": "1525TB1", "yom": 1963, "flight_number": null, "city": "Ahmic Lake", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": 6, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot had successfully completed 10 or 12 landings in other parts of the large lake. He flew the aircraft to the southeast end of the lake and carried out a successful touch-and-go landing and initiated another circuit and approach to land in the same area. Following touchdown, the right outer wing struck the water, and the aircraft nosed over and began to sink. The pilot was able to escape from the aircraft before it submerged. The pilot held a valid Airline Transport Pilot Licence and was acquiring solo time in order to obtain a float endorsement. He had completed 6.1 hours of time on the aircraft, 3.1 of this solo time. The pilot had not reported any difficulty with the previous landings; prior to this touchdown, he had to adjust his approach slightly to the right of his intended landing path to avoid water traffic. The pilot reported that the wind was blowing from about 330° at 5 to 10 knots which would have resulted in a 20° crosswind from the right of his landing path. Weather observations taken at Muskoka Airport and North Bay Airport at about the time of the occurrence reported the wind direction and speed to be 280° true at 10 gusting to 15 knots and 240° at nine knots respectively. Ahmic Lake is equidistant from these two airports, that is about 35 miles from each. Using these reported winds, this would result in a crosswind component of between 30 and 70° from the left. Damage to the aircraft's right wing and float suggested that, on touchdown, the aircraft may have been drifting to the right, resulting in the right float ploughing into the water, followed by the right wing striking the surface of the lake. Careful examination of the damaged right float confirmed that there was no evidence of collision with a floating or submerged object. The float bow had been driven upwards and inwards, resulting in overload failures in the float structure ahead of the spreader strut attachments. This damage pattern is consistent with that which would result from hydrodynamic forces acting on the float structure at touchdown with the aircraft in in a slightly nose-down attitude and drifting to the right. Damage to the right wing was also due to water impact. All float attach brackets and struts had failed under overload conditions when the aircraft nosed over. The pilot had limited experience on float-equipped aircraft and may not have recognized drift or wind direction prior to touchdown. The lake was large enough for an into wind landing. No faults were found in the aircraft's control systems or float structure which would have contributed to the accident. The damage pattern indicated that the aircraft touched down in a slightly nose-down attitude, drifting to the right. Hydrodynamic forces acting on the right float following touchdown resulted in the right outer wing striking the water. The aircraft, as a result, nosed over and sank.\r\nSource: www.dhc-2.com", "probable_cause": null}