{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-120rt-brasilia-bethel", "date": "Oct 16, 2001 at 2130 LT", "type": "Embraer EMB-120 Brasília", "operator": "ACE%20Air%20Cargo", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Anchorage - Bethel", "msn": "120-164", "yom": 1989, "flight_number": null, "city": "Bethel", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8526, "captain_hours_type": 961, "copilot_hours": 2725, "copilot_hours_type": 644, "aircraft_hours": 26295, "circumstances": "The captain and first officer were conducting a localizer DME back course approach to runway 36 in a twin-engine turboprop airplane during a night cargo flight under IFR conditions. The minimum visibility for the approach was one mile, and the minimum descent altitude (MDA) was 460 feet msl (338 feet agl). Prior to leaving their cruise altitude, the first officer listened to the ATIS information which included an altimeter setting of 29.30 inHg. No other altimeter information was received until the crew reported they were inbound on the approach. At that time, tower personnel told the crew that the visibility was one mile in light snow, the wind was from 040 degrees at 22 knots, and the altimeter setting was 29.22 inHg. The crew did not reset the airplane altimeters from 29.30 to 29.22. At the final approach fix (5 miles from the runway), the captain began a descent to the MDA. Thirty-six seconds before impact, the first officer cautioned the captain about the airplane's high airspeed. Due to strong crosswinds, the captain disconnected the autopilot 22 seconds before impact. He said he pushed the altitude hold feature on the flight director at the MDA. Eighteen seconds before impact, the airplane leveled off about 471 feet indicated altitude, but then descended again 9 seconds later. The descent continued until the airplane collided with the ground, 3.5 miles from the runway. The crew said that neither the airport, or the snow-covered terrain, was observed before impact. The crew reported that the landing lights were off. The airplane was not equipped with a ground proximity warning system.", "probable_cause": "The captain's continued descent below the minimum descent altitude which resulted in impact with terrain during an instrument landing approach. Factors contributing to the accident were the flightcrew's failure to reset the altimeters to the correct altimeter setting, and meteorological conditions consisting of snow obscuration that limited visibility, and the ambient night light conditions."}