{"url": "https://www.baaa-acro.com/crash/crash-bac-111-203ae-rochester", "date": "Jul 9, 1978 at 1730 LT", "type": "BAc 111", "operator": "Allegheny-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Boston - Rochester - Montreal", "msn": "44", "yom": 1965, "flight_number": "AL453", "city": "Rochester", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 73, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13461, "captain_hours_type": 7008, "copilot_hours": 8746, "copilot_hours_type": 4687, "aircraft_hours": 33693, "circumstances": "The pilot-in-command adopted a wrong approach configuration and passed over the runway 28 threshold at an excessive speed of 184 knots (61 knots above the Vref) in a nose down attitude. The nose gear landed first at a speed of 163 knots (40-45 knots above normal touchdown speed) 2,540 feet past the runway threshold (runway 28 is 5,500 feet long). Unable to stop within the remaining distance, the airplane overran, struck a drainage ditch, lost its undercarriage and came to rest 728 past the runway end. All 77 occupants were evacuated safely, one of them was slightly injured.", "probable_cause": "The captain's lack of awareness of airspeed, vertical speed, and aircraft performance throughout an ILS approach and landing in visual meteorological conditions which resulted in his landing the aircraft at an excessively high speed and with insufficient runway remaining for stopping the aircraft, but with sufficient aircraft performance capability to reject the landing well after touchdown. Contributing to the accident was the first officer's failure to provide required callouts which might have alerted the captain to the airspeed and sink rate deviations. The Safety Board was unable to determine the reasons for the captain's lack of awareness or the first officer's failure to provide required callouts."}