{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-159-gulfstream-i-busia-3-killed", "date": "Jan 24, 2003 at 1645 LT", "type": "Grumman G-159 Gulfstream I", "operator": "African%20Commuter%20Services", "flight_phase": "Takeoff (climb)", "flight_type": "Government", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Busia – Nairobi", "msn": "158", "yom": 1965, "flight_number": null, "city": "Busia", "zone": "Eastern", "country": "Kenya", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 9, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft was returning from Busia to Nairobi, carrying a delegation of the Kenyan Government who made a local visit in Busia following the national elections. Shortly after takeoff from runway 13/31 which is 3,281 feet long, the aircraft encountered difficulties to gain height. It struck power cables and crashed onto a house. Both pilots and a passenger, the Labour Minister Ahmed Mohamed Khalif were killed while nine other occupants were seriously injured. The aircraft was destroyed. There were no casualties on the ground. ", "probable_cause": "The following findings were identified:\r\n- Poor flight preparation on part of the crew, \r\n- The total weight of the aircraft was estimated to be over 16 tons, well above the MTOW,\r\n- Aircraft above 5,7 tons are not allowed to land at Busia Airport, \r\n- According to circumstances, a minimum runway length of 3,900 feet was required, \r\n- The captain's licences were not up to date, \r\n- The aircraft documentation was not up to date and failed to comply with Kenyan regulations, \r\n- The aircraft's maintenance was performed by technicians who did not have the proper licence and training, \r\n- The aircraft already had in the past several accidents in Congo and Sudan, \r\n- Following one accident in Sudan in 2000, the aircraft was considered as written off by the insurance and the owner, MIA International Ltd, purchased the hull from the insurers, repaired the aircraft and re-registered it, changing the registration from 5Y-MIA to 5Y-EMJ."}