{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-el-questro-2-killed", "date": "Aug 30, 2004 at 1200 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Peter Quilliam", "flight_phase": "Takeoff (climb)", "flight_type": "Delivery", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "El Questro – Broome", "msn": "421C-0633", "yom": 1974, "flight_number": null, "city": "El Questro", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2128, "captain_hours_type": 975, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3254, "circumstances": "On 30 August 2004, shortly before 1200 Western Standard Time, the owner-pilot of a twin-engine Cessna Aircraft Company 421C Golden Eagle (C421) aircraft, registered HB-LRW, commenced his takeoff from runway 32 at El Questro Aircraft Landing Area (ALA). The private flight was to Broome, where the pilot intended resuming the aircraft delivery flight from Switzerland to Perth. The available documentation indicated that the flight segments en route to Australia had all been to international or major aerodromes. The pilot of a Cessna Aircraft Company 210 (C210) and his two passengers in the runway 32 parking area witnessed the takeoff. Those witnesses reported that the C421 pilot carried out a pre-flight inspection of the aircraft prior to boarding for the takeoff. During that inspection, he was observed preparing for, and conducting a fuel drain check under the left wing, and to have removed some weed-like material from the right main wheel. He then loaded a small amount of personal luggage into the aircraft cabin, before he and the sole passenger boarded. The C210 pilot witness, who reported having observed a number of twin-engine aircraft operations at another aerodrome, did not comment on the nature of the pilot's start and engines run-up checks. The passenger witnesses reported that the pilot of the C421 made a number of unsuccessful attempts to start the left engine, before reverting to starting the right engine. He then started the left engine and moved the aircraft clear of the C210 in order to conduct his engine run-up checks. The passenger witnesses reported that during those checks they heard a 'frequency vibration' as the C421 pilot manipulated the engines' controls. The witnesses at the parking area reported that the C421 pilot taxied the aircraft onto the runway and applied power to commence a rolling takeoff. They, together with a hearing witness located to the north of the ALA indicated that the engines sounded 'normal' throughout the takeoff. Witnesses who observed the takeoff reported that the aircraft accelerated away 'briskly'. The pilot witness stated that the take-off roll and lift-off from the runway appeared similar to other twin-engine aircraft takeoffs that he had observed. The witnesses at the parking area also stated that, shortly after lift-off from the runway, the aircraft banked slightly to the left at an estimated 10 to 15 degrees angle of bank and drifted left before striking the trees along the side of the runway and impacting the ground. There was no report of any objects falling from the aircraft, or of any smoke or vapour emanating from the aircraft during the takeoff. The aircraft was destroyed by the impact forces and post-impact fire. The pilot and passenger were fatally injured.", "probable_cause": "For reasons that could not be determined, the aircraft commenced a slight left angle of bank and drifted left after lift-off at a height from which the pilot was unable to recover prior to striking trees to the left of the runway."}