{"url": "https://www.baaa-acro.com/crash/crash-learjet-24d-saint-louis", "date": "Nov 12, 2003 at 0645 LT", "type": "Learjet 24", "operator": "Multi-Aero", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Saint Louis – North Platte", "msn": "24-286", "yom": 1974, "flight_number": null, "city": "Saint Louis-Downtown", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9054, "captain_hours_type": 760, "copilot_hours": 3400, "copilot_hours_type": 150, "aircraft_hours": 6653, "circumstances": "The turbojet airplane was destroyed during a forced landing and post accident fire after a loss of power in both engines during takeoff climb. The pilot reported that both engines operated\r\nnormally during taxi and pre-takeoff checks. He reported that, \"We rotated positive rate gear up, V2 plus 30 flaps up, and at that point we struck birds taking No. 2 engine out. Upon losing No. 2 engine I advanced thrust levers forward and realized that the No. 1 engine was only producing approximately 70% RPM with EGT over read line.\" He executed a forced landing to a field and the crew and passengers evacuated the burning airplane. The copilot reported, \"At approximately 500 to 1,000 ft. above ground level, I observed a large flock of birds straight ahead of us, and then passing just off our nose to the left side. I immediately heard an engine flameout. As I started to go to the checklist for single engine operations, I quickly realized that we were loosing airspeed and unable to maintain altitude. The PIC said we were going down and heading for the best emergency-landing stop.\" The Cockpit Voice Recorder (CVR) recorded the pilot stating, \"We hit a bird,\" and the copilot stating, \"Yep,\" immediately following the CVR recording a \"sound similar to decrease in engine RPM.\" The inspection of the airplane's fuel system, pneumatic system, engines, fuel controls and fuel pumps revealed no pre-impact anomaly. No physical evidence of bird ingestion was found in either engine. A CVR sound spectrum plot and a flight profile analysis revealed that one engine flamed out almost immediately after the sound of a \"thump\" on the CVR. The other engine's speed decreased and experienced stalls until the engine speed was reduced to flight idle. The original engine certification tests indicated that compressor stalls occurred when a 2-4 ounce starling was shot ingested into the engine, but physical damage from bird ingestion was very slight due to the all steel construction and geometry of the engine. Engine flameouts, however, were not recorded during the certification tests. A wildlife specialist conducted a bird count at the accident airport two days after the accident occurred, and he reported counting a flock of about 800 European Starlings. ", "probable_cause": "The total loss of power to the right engine and the partial loss of power to the left engine after the airplane encountered a flock of birds during initial climb out, resulting in impeded ram induction airflow.\n"}