{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-bishop-3-killed", "date": "Mar 3, 2020 at 1634 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Triple 4 Aviation", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Columbia – Tuscaloosa", "msn": "46-8408028", "yom": 1984, "flight_number": null, "city": "Bishop", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1178, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot departed on an instrument flight rules cross-country flight with three passengers. While enroute at a cruise altitude about 6,000 ft mean sea level (msl), the pilot discussed routing and weather avoidance with the controller. The controller advised the pilot there was a gap in the line of weather showing light precipitation, and that the pilot could pass through it and then proceed on course. The controller assigned the pilot a heading, which the pilot initially acknowledged, but shortly thereafter, he advised the controller that the airplane was pointed directly at a convective cell. The controller explained that the heading would keep the pilot out of the heavy precipitation and that he would then turn the airplane through an area of light precipitation. The pilot responded, saying that the area seemed to be closing in fast, the controller acknowledged and advised the pilot if he did not want to accept that routing, he could be rerouted. The pilot elected to turn toward a gap that he saw and felt he could fly straight through it. The controller acknowledged and advised the pilot that course would take him through moderate precipitation starting in about one mile extending for about four miles; the pilot acknowledged. Radar information indicated that the airplane entered an area of heavy to very heavy precipitation, likely a rain shower updraft, while in instrument meteorological conditions, then entered a right, descending spiral and broke up in flight. Examination of the wreckage revealed no evidence of a preaccident  malfunction or failure that would have prevented normal operation. The airplane was equipped with the capability to display weather radar \"mosaic\" imagery created from Next Generation Radar (NEXRAD) data and it is likely that the pilot was using this information to navigate around precipitation when the airplane encountered a rain shower updraft with likely severe turbulence. Due to latencies inherent in processes used to detect and deliver the NEXRAD data from the ground site, as well as the frequency of the mosaic-creation process used by the service provider, NEXRAD data can age significantly by the time the mosaic image is created. The pilot elected to navigate the hazardous weather along his route of flight based on the data displayed to him instead of the routing suggested by the controller, which resulted in the penetration of a rain shower updraft, a loss of airplane control, and a subsequent inflight breakup.\n", "probable_cause": "The pilot’s encounter with a rain shower updraft and severe turbulence, which resulted in a loss of airplane control and an inflight breakup. Contributing to the accident was the pilot’s reliance on outdated weather information on his in-cockpit weather display."}