{"url": "https://www.baaa-acro.com/crash/crash-convair-b-36b-15-cf-peacemaker-mt-kologet-5-killed", "date": "Feb 14, 1950 at 0254 LT", "type": "Convair B-36 Peacemaker", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Military", "survivors": "Yes", "site": "Mountains", "schedule": "Eielson - Carswell", "msn": "72", "yom": null, "flight_number": null, "city": "Mt Kologet", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 16, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft and its crew were taking part in an air exercise intended to ascertain the feasibility of operations against the Soviet Union in wintertime. Seven hours into the planned 24-hour flight, and over the Northern Pacific Ocean, three of the giant bomber's six engines caught fire owing to carburetor icing in the intense cold and had to be shut down. The three remaining engines were only producing limited power and the plane could not maintain height. The Mark IV atomic bomb being carried was jettisoned at 8,000 feet inside Canadian waters, and its high explosive detonator created a large shock wave that was visible on the surface. A dummy core was inserted in the bomb before it was dropped, so there was no nuclear explosion. To give his crew a chance of survival the captain took the B-36 to Princess Royal Island where the 16 crew members and one observer bailed out. 12 of the 17 survived their ordeal, but the first 4 to jump were never found, and are presumed to have descended into the freezing sea and died. Capt. Schreier's body was recovered from the crash site in the summer of 1954. The aircraft flew on for another 210 miles with Capt. Schreier at the controls before crashing on the side of Mount Kologet, in British Columbia, 6,000 feet above sea level and northwest of Hazelton. The resting place of 44-92075 went unknown until September 1953 when the wreckage was sighted during an unrelated air search.\r\nCrew killed were:\r\nCpt Theodore F. Schreier, copilot,\r\nCpt William Phillips, navigator,\r\n1st Lt Holiel Ascol, bombardier, \r\nS/Sgt Neal A. Straley, gunner,  \r\nS/Sgt Elbert W. Pollard, gunner. \r\nSource: ASN ", "probable_cause": "Engine fire and icing. "}