{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-c-aldinga", "date": "Jan 29, 2014 at 1132 LT", "type": "Piper PA-31-310 Navajo", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Aldinga - Kangaroo Island", "msn": "31-7812064", "yom": 1978, "flight_number": null, "city": "Aldinga", "zone": "South Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 29 January 2014, at about 1100 Central Daylight-savings Time, the pilot prepared a Piper PA-31 aircraft, registered VHOFF, for a private flight from Aldinga aeroplane landing area (ALA) to Kangaroo Island, South Australia. To check fuel quantities, the pilot entered the cockpit, turned on the master switch and placed the left and right fuel selectors onto the main tank (inboard) position. The gauge for each tank showed just under half full. He then placed each fuel selector onto the auxiliary (outboard) tank position, where the gauge indicated the right and left auxiliary tanks were each about a quarter full. He did not return the selectors to the main tanks. He estimated that refuelling the main tanks would allow sufficient fuel for the flight with over an hour in reserve. He exited the aircraft while it was refuelled and continued preparing for the flight. Once refuelling was completed, the pilot conducted a pre-flight inspection, and finished loading the aircraft. The pilot and passenger then boarded. The pilot was familiar with Aldinga ALA, which is a non-controlled airport. At uncontrolled airports, unless a restriction or preference is listed for a certain runway in either the Airservices en route supplement Australia (ERSA), or other relevant publications, selection of the runway is the responsibility of the pilot. Operational considerations such as wind direction, other traffic, runway surface and length, performance requirements for the aircraft on that day, and suitable emergency landing areas in the event of an aircraft malfunction are all taken into consideration. On this day, the pilot assessed the wind to be favoring runway 14, which already had an aircraft in the circuit intending to land. However, he decided to use runway 03 due to the availability of a landing area in case of an emergency. He then completed a full run-up check of the engines, propellers and magnetos prior to lining up for departure. The pilot reported that all of the pre-take-off checks were normal. Once the aircraft landing on runway 14 was clear of the runway, the pilot went through his usual memory checklist prior to take-off. He scanned and crosschecked the flight and panel instruments, power quadrant settings and trims, but did not complete his usual final check, which was to reach down with his right hand and confirm that the fuel selector levers were on the main tanks. After broadcasting on the common traffic advisory frequency (CTAF) he commenced the take-off. At the appropriate speed, he rotated the aircraft as it passed the intersection of the 14 and 03 runways. Almost immediately both engines began surging, there was a loss of power, the power gauges fluctuated and the aircraft yawed from side to side. Due to the surging, fluctuating gauges and aircraft yaw, the pilot found it difficult to identify what he thought was a non-performing engine. He reported there were no warning lights so he retracted the landing gear, with the intent of getting the aircraft to attain a positive rate of climb, so he could trouble shoot further at a safe altitude. When a little over 50 ft above ground level (AGL), he realized the aircraft was not performing sufficiently, so he selected a suitable landing area. He focused on maintaining a safe airspeed and landed straight ahead. The aircraft touched down and slid about another 75-100 metres before coming to rest. The impact marks of the propellers suggest the aircraft touched the ground facing north-easterly and rotated to the north-west prior to stopping. The pilot turned off the master switch and both he and the passenger exited the aircraft. After a few minutes he re-entered the cockpit and completed the shutdown. Police and fire service attended shortly after the accident.", "probable_cause": "Engine malfunction due to fuel starvation. "}