{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-huntsville-1-killed", "date": "Apr 25, 2017 at 1038 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Klass Enterprises", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Conroe – College Station", "msn": "421C-0601", "yom": 1979, "flight_number": null, "city": "Huntsville", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1567, "captain_hours_type": 219, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7647, "circumstances": "While conducting a post maintenance test flight in visual flight rules conditions, the private pilot of the multi-engine airplane reported an oil leak to air traffic control. The controller provided vectors for the pilot to enter a right base leg for a landing to the south at the nearest airport, about 7 miles away. The pilot turned toward the airport but indicated that he did not have the airport in sight. Further, while maneuvering toward the airport, the pilot reported that the engine was \"dead,\" and he still did not see the airport. The final radar data point recorded the airplane's position about 3.5 miles west-northwest of the approach end of the runway; the wreckage site was located about 4 miles northeast of the runway, indicating that the pilot flew past the airport rather than turning onto a final approach for landing. The reason that the pilot did not see the runway during the approach to the alternate airport, given that the airplane was operating in visual conditions and the controller was issuing guidance information, could not be determined. Regardless, the pilot did not execute a precautionary landing in a timely manner and lost control of the airplane. Examination of the airplane's left engine revealed that the No. 2 connecting rod was broken. The connecting rod bearings exhibited signs of heat distress and discoloration consistent with a lack of lubrication. The engine's oil pump was intact, and the gears were wet with oil.  Based on the available evidence, the engine failure was the result of oil starvation; however, examination could not identify the reason for the starvation. ", "probable_cause": "The pilot's failure to identify the alternate runway, to perform a timely precautionary landing, and to maintain airplane control. Contributing to the accident was the failure of the left engine due to oil starvation for reasons that could not be determined based on the post accident examination.\n"}