{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-4q8-ujung-pandang-102-killed", "date": "Jan 1, 2007 at 1459 LT", "type": "Boeing 737-400", "operator": "Adamair_0", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Jakarta – Surabaya – Manado", "msn": "24070", "yom": 1989, "flight_number": "DHI574", "city": "Makassar (Ujung Pandang)", "zone": "South Sulawesi", "country": "Indonesia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 96, "pax_fatalities": 96, "other_fatalities": 0, "total_fatalities": 102, "captain_hours": 13356, "captain_hours_type": 3856, "copilot_hours": 4200, "copilot_hours_type": 998, "aircraft_hours": 45371, "circumstances": "On 1 January 2007, a Boeing Company 737-4Q8 aircraft, registered PK-KKW, operated by Adam SkyConnection Airlines (AdamAir) as flight number DHI574, was on a scheduled passenger flight from Surabaya (SUB), East Java to Manado (MDC), Sulawesi, at FL350 (35,000 feet) when it disappeared from radar. The aircraft departed from Djuanda Airport, Surabaya at 05:59 Coordinated Universal Time (UTC) under the instrument flight rules (IFR), with an estimated time of arrival (ETA) at Sam Ratulangi Airport, Manado of 08:14. The fuel endurance on departure from Surabaya was hours 30 minutes, and the crew had flight planned for an alternate of Gorontalo (GTO). The pilot in command (PIC) was the pilot flying for the sector to Manado and the copilot was the monitoring/support pilot. There were 102 people on board; two pilots, 4 cabin crew, and 96 passengers comprised of 85 adults, 7 children and 4 infants.", "probable_cause": "The following findings were identified:\r\n1) Flight crew coordination was less than effective. The PIC did not manage the task sharing; crew resource management practices were not followed.\r\n2) The crew focused their attention on troubleshooting the Inertial Reference System (IRS) failure and neither pilot was flying the aircraft.\r\n3) After the autopilot disengaged and the aircraft exceeded 30 degrees right bank, the pilots appeared to have become spatially disoriented.\r\n4) The AdamAir syllabus of pilot training did not cover complete or partial IRS failure.\r\n5) The pilots had not received training in aircraft upset recovery, including spatial disorientation. \r\nOther Causal Factors:\r\n1) At the time of the accident, AdamAir had not resolved the airworthiness problems with the IRS that had been reoccurring on their Boeing 737 fleet for more than 3 months.\r\n2) The AdamAir maintenance engineering supervision and oversight was not effective and did not ensure that repetitive defects were rectified. "}