{"url": "https://www.baaa-acro.com/crash/crash-travel-air-4000-palmer-lake-2-killed", "date": "Mar 2, 2016 at 0800 LT", "type": "Travel Air 4000", "operator": "Daniel J. Murray", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Longmont – Casa Grande", "msn": "785", "yom": 1928, "flight_number": null, "city": "Palmer Lake", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The commercial pilot and the pilot-rated passenger were flying the biplane to a fly-in gathering in another state. Witnesses saw the airplane flying over a frozen lake at a low altitude and low airspeed. One witness saw the airplane \"listing\" left and right before it entered a left turn, and he lost sight of it. Other witnesses saw the airplane turn left and nose-dive into the ground. A postimpact fire consumed most of the airplane. Damage to the wreckage indicated that the airplane impacted the ground in a nose down attitude. The examination did not reveal evidence of any preimpact anomalies with the airframe, engine, or the control system of the airplane. A witness reported that, at the time of the accident, the wind was from the south about 30 miles per hour. However, a burnt area extending east from the airplane's impact point indicated the wind was from the west. Additionally, although wind information from nearby weather stations varied in direction and intensity. One station, about 14 miles west-northwest of the accident site reported calm wind., However, another station, located about 11 miles south of the accident site, recorded wind from the west at 11 knots with gusts to 27 knots about the time of the accident and wind from the west at 33 knots with gusts to 48 knots about an hour after the accident. Further, the forecast for the accident area called for wind gusts to 40 knots from the west-northwest. Therefore, it is likely that strong gusty west winds prevailed in the accident area at the time of the accident. Although some witnesses speculated that the pilot may have been attempting to land the airplane on the frozen lake, the airplane was not equipped to land on ice, and the reason the pilot was maneuvering at a low altitude in strong gusty winds could not be determined. Based on the witness observations and the damage to the wreckage, it is likely that the pilot allowed the airspeed to decrease to a point where the critical angle of attack was exceeded, and the airplane entered an aerodynamic stall/spin. Although the pilot was known to have heart disease, it is unlikely that his medical condition contributed to the accident. The witness observations indicate that the pilot was actively flying the airplane before the loss of control. Toxicology testing showed the presence of chlorpheniramine in the pilot's blood at a level that was likely in the therapeutic range. Chlorpheniramine is a sedating antihistamine available in a number of over the counter products, and it carries the warning, \"May impair mental and/or physical ability required for the performance of potentially hazardous tasks (e.g., driving, operating heavy machinery).\" Because of its sedating effect, chlorpheniramine may slow psychomotor functioning and cause drowsiness. It has also been shown in a driving simulator (after a single dose) to suppress visual-spatial cognition and visual-motor coordinating functions when compared to placebo. Such functions would have been necessary for the pilot to maintain control of the airplane while maneuvering close  to the ground in the strong gusty wind conditions. Therefore, it is likely that the pilot's ability to safely operate the plane was impaired by the effects of chlorpheniramine.", "probable_cause": "The pilot's failure to maintain sufficient airspeed while maneuvering at low altitude in strong gusting winds, which resulted in exceedance of the airplane's critical angle of attack and an aerodynamic stall/spin. Contributing to the accident was the pilot's impairment due to the effects of a sedating antihistamine."}