{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-30c-new-york", "date": "Nov 12, 1975 at 1310 LT", "type": "Douglas DC-10", "operator": "Overseas%20National%20Airways.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York - Frankfurt - Jeddah", "msn": "46826", "yom": 1974, "flight_number": "OV032", "city": "New York-JFK", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 11, "crew_fatalities": 0, "pax_on_board": 128, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 25000, "captain_hours_type": 2000, "copilot_hours": 14500, "copilot_hours_type": 450, "aircraft_hours": 8193, "circumstances": "The airplane was engaged in a positioning flight from New York to Jeddah via Frankfurt, carrying ONA employees only. The aircraft taxied to runway 13R and commenced takeoff at 13:10. Shortly after accelerating through 100 knots, but before reaching the V1 speed, a flock of birds were seen to rise from the runway. The aircraft struck many birds and the takeoff was rejected. Bird strikes had damaged the no. 3 engine's fan blades, causing rotor imbalance. Fan-booster stage blades began rubbing on the epoxy micro balloon shroud material; pulverized material then entered into the engine's HPC area, ignited and caused the compressor case to separate. A fire erupted in the right wing and no. 3 engine pylon. The aircraft couldn't be stopped on the runway. The pilot-in-command steered the aircraft off the runway onto taxiway Z at a 40 knots speed. The main undercarriage collapsed and the aircraft came to rest against the shoulder of the taxiway. The successful evacuation may be partially attributed to the fact that nearly all passengers were trained crew members.", "probable_cause": "The disintegration and subsequent fire in the No.3 engine when it ingested a large number of seagulls. Following the disintegration of the engine, the aircraft failed to decelerate effectively because: \r\n- The n°3 hydraulic system was inoperative, which caused the loss of the n°2 brake system and braking torque to be reduced 50%,\r\n- The n°3 engine thrust reversers were inoperative,\r\n- At least three tyres disintegrated,\r\n- The n°3 system spoiler panels on each wing could not deploy,\r\n- The runway surface was wet. \r\nThe following factors contributed to the accident: \r\n- The bird-control program at John F. Kennedy airport did not effectively control the bird hazard on the airport,\r\n- The FAA and the General Electric Company failed to consider the effects of rotor imbalance on the abradable epoxy shroud material when the engine was tested for certification."}