{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-2-112-near-albuquerque", "date": "Aug 3, 1935 at 1255 LT", "type": "Douglas DC-2", "operator": "TWA-1", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Los Angeles – Albuquerque – Amarillo – Kansas City – Columbus – Pittsburgh – Newark", "msn": "1248", "yom": 1934, "flight_number": "TW006", "city": "Albuquerque", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane departed Albuquerque Airport at 1231LT and climbed to 9,300 feet. While the crew was trying to change the fuel feed to the left auxiliary tank, the left engine failed. Shortly later, the right engine failed as well. The crew reduced his altitude and attempted to make an emergency landing. Unfortunately, the aircraft was cruising over a wooded area. It impacted trees and crashed in a rocky field located some 48 km east from Albuquerque. All 11 occupants were injured and the aircraft was damaged beyond repair. The failure of the engines was found to be due to the presence of a large amount of water in the 80 octane fuel with which the plane had been serviced at Albuquerque Airport. A check of the fuel storage system at Albuquerque disclosed that on 5,000 gallon underground tank contained about 200 gallons of water. After extensive tests, it was found that with a certain amount of water in the fuel pit, pumping fuel from the underground storage tank would cause water to syphen from the fuel pit into the tank through an air vent running between the two. On the afternoon of the preceding day there had been an unusual amount of rainfall which had flooded the concrete apron and filled the fuel pit with water. ", "probable_cause": "It is the opinion, of the Accident Board that the probable cause of this accident was an abnormal amount of water in the left main fuel tank of the aircraft due to accidental entry of water into an underground fuel storage. The manner in which water got into this underground tank was very unusual and immediate steps were taken on all air lines to prevent a recurrence. "}