{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-73-mallard-near-shreveport-12-killed", "date": "Jan 10, 1954 at 1750 LT", "type": "Grumman G-73 Mallard", "operator": "United Producing Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Lower Mud Lake - Shreveport", "msn": "J-16", "yom": 1947, "flight_number": null, "city": "Shreveport", "zone": "Louisiana", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 6852, "captain_hours_type": 1114, "copilot_hours": 3144, "copilot_hours_type": 1020, "aircraft_hours": 1730, "circumstances": "This flight was for the purpose of transporting 10 men from a private duck hunting camp at Lower Mud Lake, Louisiana, near the mouth of the Mermentau River, to Shreveport, Louisiana, about 190 miles north-northwest. There were ten in the hunting party; the other four and baggage for all 14 were flown to Shreveport in another company airplane from the Lake Charles, Louisiana Airport some 30 miles from Lower Mud Lake. At the time of takeoff, weather over the route was overcast with the base of clouds at 800 or 900 feet, and tops sloping from about 2,500 feet at Lower Mud Lake to 7,000 feet at Shreveport. The 1628 weather at Lake Charles Airport, 160 miles from Shreveport, and on course, was: measured ceiling 900 feet, overcast; visibility 10 miles; temperature 47 degrees; dew point 44; wind northeast 17; altimeter 29.92. The gross weight at takeoff was approximately the prescribed maximum of 12,750 pounds; the C. G. was located within prescribed limits. The pilot was W. C. Huddleston, the copilot L. R. Schexnaydre. Takeoff was made at about 1635 from Lower Mud Lake. The aircraft first reported at 1704 to the CAA Alexandria radio station, giving its position as on top (of clouds) over DeRidder, Louisiana, approximately 76 miles from the point of departure and on course. At this time the pilot requested and received Shreveport weather: measured ceiling 600 feet, variable, overcast; visibility 2 miles: drizzle, fog; temperature 36; dew point 34; wind west-northwest 17; altimeter 30.02; ceiling variable 400 to 800 feet. Alexandria radio also advised that it was very possible the drizzle would turn into freezing drizzle because of low temperature in the Shreveport area. The pilot acknowledged and said that he was going to fly on top to Elmgrove, a fan marker about 16 miles southeast of Shreveport, then file an instrument let-down to Shreveport. He then reported that he was in the clear and cloud tops were at 4,500 to 5,000 feet. At 1719 the flight reported to Shreveport Approach Control as being 30 miles southwest of Natchitoches, Louisiana, about 70 miles from Shreveport, altitude 5,500 feet, 500 on top, inbound to Shreveport, and asked for an Instrument Flight Rules clearance for approach. The flight was then issued a 500-feet-on-top clearance to Shreveport Instrument Landing System outer marker, and the pilot replied that he was estimating the outer marker at 1750. At approximately 1729 Approach Control again checked with Fort Worth Air Route Traffic Control to ascertain if any traffic in the vicinity would prevent descent from 500 feet on top to 2,000 feet, with a new clearance to Forbing, Louisiana, a range intersection about 10 miles southwest of the Shreveport Airport. ARTC advised that if the aircraft was above 5,000 feet to start it down immediately. Approach Control then asked the pilot has altitude; he replied that he was now at 6,000 feet, more than 500 feet on top. Approach Control then cleared him to descend to 2,000 feet, maintaining 2,000 feet to Forbing, with no delay expected, to report leaving the 6,000-foot altitude and when passing 5,000 feet, and to start descent immediately. The flight was then advised of reported icing at 4,000 feet and above and given the 1704 Shreveport weather: 300 feet scattered, measured 600 variable, overcast, 2 miles visibility, light snow and fog. This was acknowledged. The flight left 6,000 feet at 1730 and 5,000 feet at 1732 reporting temperatures of 40 degrees F. and 32 degrees F., respectively. At 1745 the flight advised that it was at 2,000 feet and had picked up a \"load\" of ice. It was cleared to 1,500 feet, the minimum safe altitude, at which time the pilot said he was on the back course of the localiser. The flight was then requested to report when passing the localiser upon winch Approach Control would bring it in. The pilot requested the ground temperature, which was given as 34 degrees F. The next contact advised being at 1,200 feet which was all he \"could hold.\" At 1747 the flight was cleared for an approach and was asked for an arrival estimate at the outer marker. At 1749, the last radio contact with the flight, it reported being contact below the clouds with Wallace Lake in sight and \"going in.\" No emergency, as such, was declared. Several persons near the crash site heard the engines and then saw the aircraft just below the overcast some 400 to 500 feet above the ground. It descended steeply, banking sharply from side to side several times with very loud but normal engine noise. It passed from view beyond trees; almost immediately a crash was heard and a glare seen.", "probable_cause": "The Board determines that the probable cause of this accident was the rapid accumulation of wing ice to such a degree that the aircraft could not maintain altitude. A contributing factor was the pilot's failure to acquaint himself with the pertinent weather forecasts. The following findings were reported:\r\n- The aircraft did not have wing or windshield deicing equipment,\r\n- The US Weather Bureau area forecast for the time and place of the accident included occasional severe icing,\r\n- The pilot did not obtain sufficient weather information to conduct this flight safely,\r\n- The aircraft quickly acquired so much ice that it could no longer maintain altitude."}