{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226ac-metro-ii-norway-house", "date": "Nov 8, 2006 at 0834 LT", "type": "Swearingen SA226 Metro II", "operator": "Perimeter%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Winnipeg – Norway House", "msn": "TC-239E", "yom": 1977, "flight_number": "PAG105", "city": "Norway House", "zone": "Manitoba", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6000, "captain_hours_type": 4500, "copilot_hours": 4000, "copilot_hours_type": 15, "aircraft_hours": null, "circumstances": "The aircraft was on a flight from Winnipeg, Manitoba, to Norway House, Manitoba, with two crew members and seven passengers on board. After touchdown on Runway 05, when propeller reverse was selected, the aircraft veered to the left. The crew attempted to regain directional control; however, the aircraft departed the left side of the runway surface, entered an area of loose snow, traversed a shallow ditch, climbed a rocky embankment, and came to rest on its belly with all three landing gears collapsed. The crew and passengers exited the aircraft through the main door stairway and the over-wing exits. There were no reported injuries. The accident occurred during daylight hours at 0834 central standard time. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The left engine fuel control support assembly failed in fatigue and released one of three attachment bolts, which resulted in a slight displacement of the fuel control and changed the propeller control dimension. As a result, Beta pressure was achieved and propeller reverse was available for the left engine before it was available for the right engine.\r\n2. The pilot selected thrust reverse without confirmation that the Beta lights were on for both engines, and the aircraft veered from the runway, most likely as a result of temporary asymmetric thrust. \r\nFinding as to Risk:\r\n1. There is no requirement to include the Beta light call as part of the pre-landing briefing. Briefing this item would remind the pilots of the need to confirm Beta light activation for both engines before application of thrust reverse. "}