{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-8kv-sabashahr-176-killed", "date": "Jan 8, 2020 at 0618 LT", "type": "Boeing 737-800", "operator": "Ukraine%20International%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Tehran - Kiev", "msn": "38124", "yom": 2016, "flight_number": "PS752", "city": "Sabashahr", "zone": "Tehran City District", "country": "Iran", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 167, "pax_fatalities": 167, "other_fatalities": 0, "total_fatalities": 176, "captain_hours": 11590, "captain_hours_type": 8428, "copilot_hours": 7633, "copilot_hours_type": 3642, "aircraft_hours": null, "circumstances": "On Wednesday, January 08, 2020, at 00:53, the inbound flight No. 751 of Ukraine International, Boeing 737-800, UR-PSR, en route to Tehran Imam Khomeini INTL. Airport from Kyiv Boryspyl INTL. Airport was cleared for landing, and after four minutes landed on the IKA runway. After disembarking 58 passengers and refueling, the flight crew went on to check into the hotel located at IKA. From 01:16 to 01:38, the aircraft was refueled with 9510 kg (11800 liters) of fuel. Once the total weight of the cargo received from passengers (310 packages weighing 6794 kg) was determined, in order to comply with the maximum takeoff weight allowed for aircraft, 82 packages in 2094 kg in weight, were separated by Airport Service Company, that is, they were not loaded. Initially, 78 packages of the passenger's luggage were not loaded first, then due to the large volume of passengers' hand luggage, the flight attendants passed some of them on to the Airport Service Company personnel to be placed in the aircraft cargo. After that, 4 packages belonging to the passengers were removed from the aft cargo door, where the hand luggage was placed. At 04:35, the flight crew embarked on the aircraft. After checking the aircraft and cabin, boarding was announced at 04:45, and passengers started to board the plane. Based on the available documents, 167 passengers proceeded to the Airport Services Co. counter at the airport terminal, all of whom went on board. Only one of the passengers who received the boarding pass online the night before the flight, due to the delay in arriving in Tehran from another city did not go to the airport in person, and therefore had been removed from the list of passengers provided by the UIA. At 05:13, the pilot made his first radio contact with the IKA's control tower ground unit and requested the initial clearance for flying, which was issued by the controller subsequently. At 05:48, all the aircraft documents required to start the flight operations were filled out, and all the doors were then closed at 05:49. The flight was initially scheduled for 05:15, and based on the flight coordinator's report form, the reason given for its delay was the aircraft being overweight and the decision not to load the passengers' lugga for reducing the aircraft weight. At 05:51 the pilot notified his position at the airport parking, declared his readiness to exit the parking and start up the aircraft. The IKA tower asked him to wait for receiving the clearance since they wanted to make the coordination required with other relevant units. At 05:52, the IKA tower made the necessary coordination with the Mehrabad approach unit, who contacted Tehran ACC asking for clearance. Accordingly, the controller in ACC made coordination on Ukrainian flight clearance with the CMOCC. The clearance was issued by the CMOCC. At 05:54, the Mehrabad approach unit, received the FL260 clearance for the flight AUI752 from ACC, and forwarded it to IKA via the telecommunication system. Flight no. 752 was detached from the A1 Jet Bridge and at about 05:55 started to leave its parking position, NO 116 on the right, by a pushback truck. Following that, at 05:55 the ground controller cleared the AUI752 flight for startup and exiting the parking, which was read back by the pilot. At 06:12, the aircraft took off from the Runway 29 Right of IKA and was delivered to the Mehrabad approach unit. The pilot contacted the approach unit, and announced the IKA 1A radar procedure as SID procedure. Next, the Mehrabad approach identified and cleared the flight to climb to FL260. The controller instructed the pilot to turn to the right after 6,000 feet, and continue straight to PAROT. After it was read back by the pilot, the controller again instructed the pilot to continue to PAROT point once passing the 6000-foot altitude, which was read back by the pilot. From 06:17 onwards, upon the disappearance of the PS752 information from the radarscope, the controller called the captain repeatedly, but received no response. According to the data extracted from the surveillance systems and FDR, the aircraft climbed to an altitude of 8,100 feet; thereafter, the label including the call sign and altitude of aircraft disappeared from the radarscope, yet no radio contact indicating unusual conditions was received from the pilot. FDR recording terminated at 06:14:56. This time corresponds to the termination of Secondary Surveillance Radar (SSR) and ADS-B information. After the mentioned time, the aircraft was still being detected by the Primary Surveillance Radar (PSR), according to which the aircraft veered right and after approximately three minutes of flying, it disappeared from the PSR at 06:18 too. The aircraft was conducting the flight under the Instrument Flight Rules (IFR) and the accident occurred around half an hour before the sunset.", "probable_cause": "Cause of the Accident:\r\n- The air defense's launching two surface-to-air missiles at the flight PS752, UR-PSR aircraft the detonation of the first missile warhead in proximity of the aircraft caused damage to the aircraft systems and the intensification of damage led the aircraft to crash into the ground and explode instantly.\n\r\nOther Contributing Factors:\r\n- The mitigating measures and defense layers in risk management proved to be ineffective due to the occurrence of an unanticipated error in threat identifications, and ultimately failed to protect the flight safety against the threats caused by the alertness of defense forces."}