{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-7cf-biorka-island", "date": "Oct 22, 1962 at 1252 LT", "type": "Douglas DC-7", "operator": "Northwest%20Airlines2", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "McChord – Elmendorf", "msn": "45204", "yom": 1957, "flight_number": "NW293", "city": "Biorka Island", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 95, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15772, "captain_hours_type": 1579, "copilot_hours": 12579, "copilot_hours_type": 1925, "aircraft_hours": 17175, "circumstances": "A Northwest Airlines DC-7CF, N285, was ditched near Biorka Island, Sitka Sound, Alaska, on October 22, 1962, about 2052 G.m.t. All 95 passengers and 7 crew members successfully evacuated and were quickly rescued. No serious injuries were reported. The flight was operating as Military Air Transport Charter Flight No. 293 en route from McChord Air Force Base, Tacoma, Washington, to Elmendorf AFB, Anchorage, Alaska. While cruising at an altitude of 20,000 feet No. 2 engine lost power. Remedial measures failed, the propeller oversped and the engine seized. Attempts at feathering failed and the flight radioed a declaration of emergency and started descent toward Sitka Sound, Alaska. Other futile attempts were made to feather as the No. 2 engine became dangerously hot and shed parts. The captain elected to ditch. Passengers were moved aft and away from the plane of rotation of No. 2 propeller, crew members issued ditching instructions, and occupants and flotation gear were readied. The aircraft was put down skillfully under favorable conditions of weather and sea during daylight, and all occupants were quickly in liferafts. Previously alerted marine craft were nearby and took all hands aboard. Amphibious rescue aircraft were also close by. The aircraft sank in water 250 feet deep in about 24 minutes.", "probable_cause": "The Board determines that the probable cause of the accident was an uncontrollable overspeeding propeller due to failure in the blower section of No. 2 engine."}