{"url": "https://www.baaa-acro.com/crash/crash-lockheed-p-3a-60-lo-orion-near-battle-creek-4-killed", "date": "Jul 4, 1966 at 2040 LT", "type": "Lockheed P-3 Orion", "operator": "US%20Navy", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Plain, Valley", "schedule": "Floyd Bennett Field – Glenview – Moffett", "msn": "185-5142", "yom": 1965, "flight_number": "PE-05", "city": "Battle Creek", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew departed Floyd Bennett Field Airport in New York on a flight to Moffett Airbase, California, with an intermediate stop at Glenview Airport, Illinois, under call sign PE-05. At 2035LT, while cruising at an altitude of 22,000 feet, the crew informed ATC about his position. Shortly later, the airplane entered a spin, crossed the last cloud layer at an altitude of 3,000 feet in a right turn and struck the ground in a 60° nose down attitude at a speed of 800 km/h. The aircraft disintegrated on impact and all four crew members were killed. The wreckage was found seven miles northeast of Battle Creek.\r\nCrew:\r\nLt William E. Xiques, pilot,\r\nLt John P. Fitzmaurice III, copilot,\r\nADJ2 Charles J. Lurvey, flight engineer,\r\nADJ3 Larry W. Battson, flight engineer. ", "probable_cause": "Investigations determined that there was no in-flight fire and no major structural failure had occurred. The plane was only about a year old at the time of the accident. The only clues were unintelligible voice transmissions at 2037 and again at 2039. The voice was masked by extreme high frequency background noise. Despite attempted computer analysis of the voice and an extended accident investigation, the cause was never determined. It was believed that some kind of catastrophic failure had occurred that incapacitated the crew. It was also surmised that it was possible that the windshield failed in-flight under decompression forces causing sound comparable to high velocity air in the cockpit. Not enough of the windshield was recovered to perform an analysis and come to any conclusions about this possibility."}