{"url": "https://www.baaa-acro.com/crash/crash-learjet-25b-toluca-2-killed", "date": "May 17, 2017 at 1525 LT", "type": "Learjet 25", "operator": "Aerotransportes-Huitzilin", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Toluca - Durango", "msn": "25-114", "yom": 1973, "flight_number": null, "city": "Toluca", "zone": "México", "country": "Mexico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14654, "circumstances": "During the takeoff roll on runway 15 at Toluca-Licendiado Adolfo López Mateos, after the airplane passed the V1 speed, the warning light came on in the cockpit panel, informing the crew about the deployment of the reverse on the left engine. According to published procedures, the crew continued the takeoff and shortly after rotation, during initiale climb, the aircraft rolled to the left and crashed in an open field, bursting into flames. The wreckage was found about 200 metres past the runway end. The aircraft was destroyed and both pilots were killed. ", "probable_cause": "Probable Cause:\r\nLoss of control of the aircraft during the emergency procedure of indication of the deployment of the reverse of the engine number one during the takeoff roll above V1, which was consistent with the training and standard operating procedures that call to continue the takeoff, causing the collapse of the aircraft, by low speed and the operation of abrupt maneuvers and turns towards the engine side in idle position and commanded opening of the Drag Shut due to poor CRM.\r\nContributing factors:\r\n- False indication of reverse display of dwelling position number one.\r\n- Failure of pilots of previous flights not to refer failures to indicate the deployment of reverses for maintenance actions."}