{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-lewiston-1-killed", "date": "Feb 11, 2000 at 0815 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "American Check Transport", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Boise – Lewiston", "msn": "1537", "yom": 1982, "flight_number": "BKJ152", "city": "Lewiston", "zone": "Idaho", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 21000, "captain_hours_type": 1500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5460, "circumstances": "The airplane impacted a ridgeline about 1.5 miles from the runway and approximately 7 to 14 seconds after the pilot reported a dual engine flameout. The airplane's altitude was about 400 feet agl when the pilot reported the flameout. The inspection of the airplane revealed no preexisting anomalies. Icing conditions were forecast and PIREPS indicated that light to moderate rime/mixed icing conditions existed along the route of flight. The Continuous Ignition switches were found in the OFF position. The Approach procedures listed in the Airplane's Flight Manual stated, 'CONTINUOUS IGNITION SHALL BE SELECTED TO ON DURING APPROACH AND LANDING WHILE IN OR SHORTLY FOLLOWING FLIGHT IN ACTUAL OR POTENTIAL ICING CONDITIONS.' The aircraft manufacturer had issued a Service Bulletin in 1995 for the installation of an auto-ignition system to '... reduce the possibility of engine flame-out when icing conditions are encountered and the continuous ignition is not selected.' The operator had not installed the non-mandatory service bulletin. On May 5, 2000, the FAA issued an Airworthiness Directive that required the installation of an auto-ignition system. The toxicology test detected extremely high levels of dihydrocodeine in the pilot's blood. The pilot received a special issuance second-class medical certificate on August 22, 1995, after receiving treatment for a self disclosed history of drug abuse. The drug testing that this pilot underwent as a consequence of his previous self disclosed history of drug abuse would not have detected these substances. ", "probable_cause": "The pilot failed to follow the flight manual procedures and did not engage the Continuous Ignition system resulting in both engines flaming out when the air induction system was blocked with ice. Additional factors to the accident included the hilly terrain, the icing conditions, and the operator not complying with a Service Bulletin for the installation of an auto-ignition system. "}