{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-300lw-super-king-air-piz-sarsura-2-killed", "date": "Feb 14, 2002 at 1720 LT", "type": "Beechcraft 300 Super King Air", "operator": "Kronospan", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Mountains", "schedule": "Poznań – Samedan", "msn": "FA-227", "yom": 1993, "flight_number": null, "city": "Piz Sarsura", "zone": "Graubünden", "country": "Switzerland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4158, "captain_hours_type": 1835, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4141, "circumstances": "D-ICBC was refuelled in Poznan to its maximum capacity of 2040 litres. An ATC flight plan was filed for an IFR flight. After the RENTA waypoint, VFR had actually been entered, but the crew had not filed the flight plan as a Y flight plan, as is prescribed for flights which begin under IFR rules and then end as a VFR flight. However, the flight plan was entered and transmitted as a Y flight plan by the competent unit in Brussels. Take-off time was scheduled for 14:20 UTC. Take-off actually took place at 14:35 UTC. No details are known about the history of the first part of the flight. The aircraft reached the border with Italian airspace in the planned air corridor M736 at flight level 250. The crew reported at 15:54:14 UTC to Padua ACC, sector LOW NORD on frequency 125.900 MHz: “..ua Buongiorno D-ICBC, Flight level 250, appro…approaching LIZUM Point” The air traffic controller instructed the crew to fly “LIZUM, LUSIL direct”. The crew confirmed “LIZUM .... direct DBC”. On enquiring, they received the information that they would be able to descend in about 10 miles. On the radar plot it can be seen that the aircraft did not fly as required direction LUSIL, but turned onto a heading of approximately 240° and was flying in the direction of Samedan. At 15:59:18 UTC, the clearance to flight level 170 was given; which is the lowest IFR flight level (minimum enroute altitude – MEA) in this area. At 16:02:03 UTC, the crew of D-ICBC was asked whether they were flying direct to Samedan. This was confirmed by them. They were then requested to report as soon as they wished to change from instrument flight rules to visual flight rules. At 16:05:16 UTC, the crew change from instrument flight rules to visual flight rules and were requested to contact Samedan Tower on frequency 135.325 MHz, which they did after a brief delay. The Samedan air traffic controller informed the crew that runway 21 was in use and that the QNH was 1012 hPa. He additionally requested them to report as soon as they flew into the valley. After leaving flight level 170, the aircraft turned slightly to the right onto a course of approximately 265° and maintained its continuous descent. At 16:11:25 UTC, the aircraft passed flight level 130 and began to turn slowly to the left. This turn brought the aircraft precisely onto the extended centre line of runway 21 in Samedan. The aircraft was last captured by the radar at 16:15:24. The last flight level indicated on the secondary radar was FL 101. A little later, the aircraft collided with the elevated terrain of the Sarsura glacier at an elevation of 9640 ft AMSL. Both pilots were killed immediately. The aircraft was destroyed. ", "probable_cause": "The accident is caused by the fact that the crew on its approach according to visual flight rules to Samedan aerodrome, under critical weather conditions and applying inappropriate flying tactics lost the situational awareness and theby the aircraft D-ICBC collided with the terrain.\r\nThe following findings were identified:\r\n- The pilot was in possession of a senior commercial pilots licence, issued by the Polish authorities.\r\n- There are no indications of any health problems affecting the pilot during the flight involved in the accident.\r\n- The aircraft was admitted for traffic.\r\n- The investigation produced no indications of any pre-existing technical faults which might have caused the accident.\r\n- The mass and centre of gravity at the time of the accident were within the prescribed limits.\r\n- As weather information, only METAR and TAF for Innsbruck, Zurich, Milan Malpensa and Milan Linate were found.\r\n- No documentation for visual approaches to Samedan were found in the aircraft.\r\n- In the documentation which was available to the investigators, it was not evident that any of the crew members had previously flown to Samedan. "}