{"url": "https://www.baaa-acro.com/crash/crash-antonov-2-kapan-1-killed", "date": "Aug 31, 1963 at 1547 LT", "type": "Antonov AN-2", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Kapan – Goris – Sisian – Yerevan", "msn": "180 473 09", "yom": 1957, "flight_number": null, "city": "Kapan", "zone": "Syunik", "country": "Armenia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 14, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4305, "circumstances": "The single engine aircraft departed Kapan Airport at 1438LT on a return flight to Yerevan with intermediate stops at Goris and Sisian, carrying 14 passengers (11 adults and three children) and a crew of two. After takeoff, the captain performed a straight-in climb up to 200 meters then turned sharply to the right with a bank of 40°. The airplane failed to climb properly and the pilot-in-command went into a gorge. The copilot attempted to regain control but the captain maintained a certain pressure and failed to follow the procedure. When he saw the mountain facing him, he made a turn to the right when the airplane struck trees and crashed in flames in a wooded area. A adult passenger was killed while all 15 other occupants were injured. The aircraft was destroyed. The wreckage was found 5,5 km from the intended route. ", "probable_cause": "Investigations revealed that the captain made pressure on the copilot asking him to give a wrong testimony to the board of inquiry, saying that the accident was the consequence of an engine failure. Engine analysis did not show any anomalies and the copilot later admitted that his testimony did not reflect the truth and that the captain failed to follow the published departure procedures at Kapan Airport. The high temperature was considered as a contributing factor. "}