{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1011-385-tristar-1-dallas-135-killed", "date": "Aug 2, 1985 at 1805 LT", "type": "Lockheed L-1011 TriStar", "operator": "Delta-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Lauderdale - Dallas - Los Angeles", "msn": "193C-1163", "yom": 1979, "flight_number": "DL191", "city": "Dallas-Fort Worth", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 11, "crew_fatalities": 8, "pax_on_board": 152, "pax_fatalities": 126, "other_fatalities": 1, "total_fatalities": 135, "captain_hours": 29300, "captain_hours_type": 3000, "copilot_hours": 6500, "copilot_hours_type": 1200, "aircraft_hours": 20555, "circumstances": "Delta Air Lines flight 191 was a regularly scheduled passenger flight between Fort Lauderdale, FL (FLL), and Los Angeles, CA (LAX), with an en route stop at the Dallas/Fort Worth International Airport, TX (DFW). Flight 191, a Lockheed L-1011 TriStar airplane, departed Fort Lauderdale on an IFR flight plan with 152 passengers and a crew of 11 on board at 15:10 EDT. The DFW Airport terminal weather forecast contained in the flightcrew's dispatch document package stated, in part, that there was a possibility of widely scattered rain showers and thunderstorms, becoming isolated after 20:00 CDT. The flight was uneventful until passing New Orleans, Louisiana. A line of weather along the Texas-Louisiana gulf coast had intensified. The flightcrew elected to change their route of flight to the more northerly Blue Ridge arrival route to avoid the developing weather to the south. This change necessitated a 10 to 15-minute hold at the Texarkana, Arkansas, VORTAC for arrival sequencing at the DFW Airport. At 17:35, the flightcrew received the following ATIS broadcast: \"DFW arrival information romeo, two one four seven Greenwich, weather six thousand scattered, two one thousand scattered, visibility one zero, temperature one zero one, dew point six seven, wind calm, altimeter two niner niner two, runway one eight right one seven left, visual approaches in progress, advise approach control that you have romeo\". Fort Worth Air Route Traffic Control Center (ARTCC) then cleared flight 191 to the Blue Ridge, Texas, VORTAC for the Blue Ridge Nine arrival, and to begin its descent. At 17:43:45, Fort Worth ARTCC cleared flight 191 to descend to 10,000 feet, gave it a 29.92 in Hg altimeter setting, and suggested that the flight turn to a heading-of 250 degrees \"to join the Blue Ridge zero one zero radial inbound and we have a good area there to go through.!' The captain replied that he was looking at a \"pretty good size\" weather cell, \"at a heading of two five five ... and I'd rather not go through it, I'd rather go around it one way or the other.\" Fort Worth ARTCC then gave the flight another heading and stated \"when I can I'll turn you into Blue Ridge, it'll be about the zero one zero radial.\" At 17:46, the center cleared flight 191 direct to Blue Ridge and to descend to 9,000 feet, and flight 191 acknowledged receipt of the clearance. At 17:48, the captain told the first officer, \"You're in good shape. I'm glad we didn't have to go through that mess. I thought sure he was going to send us through it.\" Three minutes later, the flight engineer said, \"Looks like it's raining over Fort Worth.\" At 17:51, Forth Worth ARTCC instructed flight 191 to contact DFW Airport Approach Control. At 17:56:28, Regional Approach Control's Feeder East controller transmitted an all aircraft message which was received by flight 191. The message stated in part, \"Attention, all aircraft listening... there's a little rainshower just north of the airport and they're starting to make ILS approaches ... tune up one oh nine one for one seven left.\" At 17:59, the first officer stated, \"We're gonna get our airplane washed,\" and the captain switched to Regional Approach Control's Arrival Radar-1 (AR-1) frequency and told the controller that they were at 5,000 feet. At 18:00, the approach controller asked American Air Lines flight 351 if it was able to see the airport. (Flight 351 was two airplanes ahead of flight 191 in the landing sequence for runway 17L.) Flight 351 replied, \"As soon as we break out of this rainshower we will.\" The controller then told flight 351 that it was 4 miles from the outer marker, and to join the localizer at 2,300 feet; the controller then cleared the flight for the ILS approach to runway 17L. At 18:00, the approach controller asked flight 191 to reduce its airspeed to 170 knots, and to turn left to 270 degrees; flight 191 then acknowledged receipt of the clearance. Flight 191 had been sequenced behind a Learjet 25 for landing on runway 17L. At 18:02, the approach controller told flight 191 that it was 6 miles from the outer marker, requested that it turn to 180 degrees to join the localizer at or above 2,300 feet, and stated, \"Cleared for ILS one seven left approach.\" The flight acknowledged receipt of the transmission. At 18:03:03, the approach controller requested flight 191 \"to reduce your speed to one six zero please,\" and the captain replied, \"Be glad to.\" Thereafter, at 18:03:30, he broadcast, \"And we're getting some variable winds out there due to a shower... out there north end of DFW.\" This transmission was received by flight 191. At 18:03:46, the approach controller requested flight 191 to slow to 150 KIAS, and to contact the DFW Airport tower. At 18:03:58, the captain, after switching to the tower's radio frequency, stated, \"Tower, Delta one ninety one heavy, out here in the rain, feels good.\" The tower cleared the flight to land and informed it, \"wind zero nine zero at five, gusts to one five.\" At 18:04:07, the first officer called for the before-landing check. The flightcrew confirmed that the landing gear was down and that the flaps were extended to 33 degrees, the landing flap setting. At 18:04:18, the first officer said, \"Lightning coming out of that one.\" The captain asked, \"What?\" and the first officer repeated \"Lightning coming out of that one.\" The captain asked, and at 18:04:23, the first officer replied, \"Right ahead of us.\" Flight 191 continued descending along the final approach course. At 18:05:05 the captain called out \"1,000 feet.\" At 18:05:19, the captain cautioned the first officer to watch his indicated airspeed and a sound identified as rain began. The captain then warned the first officer, \"You're gonna lose it all of a sudden, there it is.\" The captain stated, \"Push it up, push it way up.\" At 18:05:29, the sound of engines at high rpm was heard on the CVR, and the captain said \"That's it.\" At 18:05:44, the Ground Proximity Warning System's (GPWS) \"Whoop whoop pull up\" alert sounded and the captain commanded \"TOGA\". The CVR recording ended at 18:05:58. Witnesses on or near State Highway 114 north of the airport saw flight 191 emerge from the rain about 1.25 miles from the end of runway 17L and then strike an automobile in the westbound lane of State Highway 114. Subsequent investigation showed that the airplane had touched down earlier and became airborne again before striking the automobile. After the plane struck the car and a light pole on the highway, other witnesses saw fire on the left side of the airplane in the vicinity of the wing root. The witnesses generally agreed that the airplane struck the ground in a left-wing-low attitude, and that the fuselage rotated counterclockwise after the left wing and cockpit area struck a water tank on the airport. A large explosion obscured the witnesses' view momentarily, and then the tail section emerged from the fireball, skidding backwards. The tail section finally came to rest on its left side with the empennage pointing south and was subsequently blown to an upright position by wind gusts. One hundred and thirty-four persons on board the airplane and the driver of the automobile which was struck by the airplane were killed in the accident; 27 persons on board the airplane and 1 rescue worker at the accident site were injured, 2 passengers on the airplane were uninjured.", "probable_cause": "The flight crew's decision to initiate and continue the approach into a cumulonimbus cloud which they observed to contain visible lightning; the lack of specific guidelines, procedures and training for avoiding and escaping from low-level windshear; and the lack of definitive, real-time windshear hazard information. This resulted in the aircraft's encounter at low altitude with a microburst-induced, severe windshear from a rapidly developing thunderstorm located on the final approach course."}