{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-2l9-lisa-117-killed", "date": "Oct 22, 2005 at 2040 LT", "type": "Boeing 737-200", "operator": "Bellview%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Abidjan – Accra – Lagos – Abuja", "msn": "22734", "yom": 1981, "flight_number": "BLV210", "city": "Lisa", "zone": "Ogun", "country": "Nigeria", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 111, "pax_fatalities": 111, "other_fatalities": 0, "total_fatalities": 117, "captain_hours": 13429, "captain_hours_type": 153, "copilot_hours": 762, "copilot_hours_type": 451, "aircraft_hours": 55772, "circumstances": "The accident was reported to erstwhile Accident Investigation and Prevention Bureau (AIPB) now Accident Investigation Bureau (AIB) on Saturday 22nd of October, 2005. The site of the wreckage was located on the 23rd of October, 2005 and investigation began the same day. On October 22, 2005, at 2040 hrs, Bellview Airlines (BLV) Flight 210, a Boeing B737-200, 5N-BFN, crashed while climbing to cruise altitude shortly after take-off from Murtala Muhammed Airport, Lagos (LOS). The flight was operating under the provisions of the Nigerian Civil Aviation Authority (NCAA) Air Navigation Regulations (ANRs) as a scheduled domestic passenger flight from LOS to Abuja International Airport (ABV). The flight departed LOS for ABV at 2035 hrs, with 2 pilots, 1 licensed engineer, 3 flight attendants, and 111 passengers on board. The airplane entered a descent and impacted open terrain at Lisa Village, Ogun State. All 117 persons were killed and the airplane was destroyed by impact forces and fire. Instrument meteorological conditions prevailed. The airplane was operated on an Instrument Flight Rule (IFR) plan. The accident occurred on the final leg of a one-day round trip from Abuja to Abidjan with intermediate stops at Lagos and Accra for both the outbound and inbound segments. The trip through the second stop at Accra (the fourth leg) was reported without incident. On the fifth leg, during the taxi for takeoff at Accra, the pilot and the engineer discussed the low pressure reading of 650 psi in the brake accumulator system according to the pilot that flew the aircraft from Accra to Lagos. Normal accumulator brake pressure is 1000 psi. The captain continued the flight to the destination, LOS, without incident, where the discrepancy was logged. The engineer briefed the maintenance crew about the low pressure reading. The crew consisted of two Licensed Aircraft Engineers (LAEs) and the outbound engineer for Flight 210. LAEs and engineer on riding coverage worked together to troubleshoot the brake system, which included verifying the pressure reading with the pressure gauge from another Boeing 737 (5N-BFM) in the fleet. It was determined that the source of the low pressure was due to a faulty brake accumulator. On checking the Minimum Equipment List (MEL), the maintenance engineers decided that the aircraft could be released for operation with the fault. Before Flight 210 departed, the captain discussed en-route weather with another pilot who had just completed a flight from Port Harcourt to Lagos. The other pilot informed the accident captain of a squall line in the vicinity of Benin. The accident captain indicated that he experienced the same weather condition on his previous flight from Abuja to Lagos. The chronology of the flight was determined from the transcript of the recorded radio communications between Air Traffic Control and Flight 210 and post accident interviews of air traffic personnel. According to the transcript, the pilot of Flight 210 contacted the tower at 1917:02 UTC and requested for startup and clearance was given. The controller gave him the temperature and QNH, which were 27 degrees Centigrade and 1010 millibars respectively. At 1924:08 UTC, the Pilot requested and got approval for taxi to Runway 18L. At 1927 UTC, the tower requested for Persons on Board (POB), endurance and registration. In response, the pilot indicated the number of persons on board as 114 minus 6 crew, fuel endurance as 3 hours and 50 minutes and registration 5N-BFN. The tower acknowledged the information and issued the route clearance via Airway UR778, Flight Level 250, with a right turn-out on course. The pilot read back the clearance and the controller acknowledged and instructed the pilot to report when ready for takeoff. At 1927:55 UTC, the pilot requested “can we have a left turn out please?” and soon afterwards his request was granted by the controller. At 1928:08 UTC, the tower cleared BLV 210 as follows: \"BLV 210 RUNWAY HEADING 3500FT LEFT TURN ON COURSE\" At 1928;12 UTC, BLV 210 replied \"3500FT LEFT TURN ON COURSE 210\". 1928:47 UTC, the pilot reported ready for takeoff, and after given the wind condition as 270 degrees at 7 knots the controller cleared Flight 210 for departure at 1928:50 UTC. The pilot acknowledged the clearance, and at 1929:14 UTC requested “And correction, Bellview 210, please we will take a right turn out. We just had a sweep around the weather and right turn out will be okay for us.” The controller responded “right turn after departure, right turn on course” and the pilot acknowledged. According to the transcript, at 1931:52 UTC, the controller reported Flight 210 as airborne and instructed the pilot to contact LOS Approach Control. During the post-crash interview, the controller indicated he saw the airplane turn right, but was unable to determine its attitude due to darkness. He indicated the airplane sounded and appeared normal. At 1932:22 UTC, the pilot made initial contact with Approach Control and reported “Approach, Bellview 210 is with you on a right turn coming out of 1600 (feet)”. The Approach Control replied “report again passing one three zero.” The pilot acknowledged at 1932:35 UTC, and that was the last known transmission from the flight. According to the transcript, the controller attempted to regain contact with the flight at 19:43:46 UTC. Repeated attempts were unsuccessful. Emergency alert was then sent out to relevant agencies including the National Emergency Management Agency (NEMA) for search and rescue operations to commence. The airplane struck the ground on flat terrain in a relatively open and wooded area, 14NM north of the airport (6˚ 48’ 43” N and 3˚ 18’ 19” E).", "probable_cause": "The AIB, after an extensive investigation, could not identify conclusive evidence to explain the cause of the accident involving Bellview Flight 210. The investigation considered several factors that could explain the accident. They include the PIC training of the Captain before taking Command on the B737 aircraft which was inadequate, the cumulative flight hours of the pilot in the days before the accident which was indicative of excessive workload that could lead to fatigue. Furthermore, the investigation revealed that the airplane had technical defects. The airplane should not have been dispatched for either the accident flight or earlier flights. The absence of forensic evidence prevented the determination of the captain’s medical condition at the time of the accident. The missing flight recorders to reconstruct the flight also precluded the determination of his performance during the flight. Due to lack of evidence, the investigation could not determine the effect, if any, of the atmospheric disturbances on the airplane or the flight crew’s ability to maintain continued flight. The operator could not maintain the continuing airworthiness of its aircraft, in ensuring compliance of its flight and maintenance personnel with the regulatory requirements. The Civil Aviation Authority’s safety oversight of the operator’s procedures and operations was inadequate."}