{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-2b5f-stansted-4-killed", "date": "Dec 22, 1999 at 1839 LT", "type": "Boeing 747-200", "operator": "Korean%20Air%20Cargo2", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Stansted - Milan - Seoul", "msn": "22480", "yom": 1980, "flight_number": "KE8509", "city": "Stansted", "zone": "Essex", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 13490, "captain_hours_type": 8495, "copilot_hours": 1406, "copilot_hours_type": 195, "aircraft_hours": 83011, "circumstances": "Boeing 747 HL-7451 arrived at Stansted at 15:05 after a flight from Tashkent. Prior to leaving the aircraft, the flight engineer made an entry in the Technical Log stating \"Captain's ADI [Attitude Director Indicator] unreliable in roll' he also verbally passed the details to the operator's ground engineer who met the aircraft on arrival. During turnover repair works on the ADI were carried out. Some cargo was offloaded and other cargo loaded for the flight to Milan-Malpensa (takeoff weight was 548,352 lb including 68,300 lb of fuel) and a new crew boarded the aircraft. After a delay of an hour, because ATC had not received the flight plan, Flight 8509 was cleared to depart Stand Alpha 6 and taxi to runway 23 holding point at 18:25. Subsequently, at 18:36 KAL 8509 was cleared to takeoff with a reported surface wind of 190deg/18 kt. The Dover 6R Standard Instrument Departure called for a climb ahead to 1.5 miles DME, then a left turn onto the 158 inbound radial to the Detling VOR. Climbing through 900 feet, the ADI 'Comparator' buzzer sounded three times. Shortly afterwards, the warning sounded a further two times, coincident with the captain expressing concerns over his DME indication. Climbing through 1400 feet, ATC instructed the crew to contact 'London Control'. And as the captain initiated the procedure turn to the left, the 'Comparator' warning sounded again some 9 times. The maximum altitude reached was 2,532 feet amsl. The aircraft then banked left progressively and entered a descent until it struck the ground in a approx. 40deg nose down pitch and 90deg bank to the left; the speed was high in the region of 250 to 300 kt.", "probable_cause": "The following causal factors were identified:\r\n- The pilots did not respond appropriately to the comparator warnings during the climb after takeoff from Stansted despite prompts from the flight engineer,\r\n- The commander, as the handling pilot, maintained a left roll control input, rolling the aircraft to approximately 90° of left bank and there was no control input to correct the pitch attitude throughout the turn,\r\n- The first officer either did not monitor the aircraft attitude during the climbing turn or, having done so, did not alert the commander to the extreme unsafe attitude that developed,\r\n- The maintenance activity at Stansted was misdirected, despite the fault having been correctly reported using the Fault Reporting Manual. Consequently the aircraft was presented for service with the same fault experienced on the previous sector; the No 1 INU roll signal driving the captain's ADI was erroneous,\r\n- The agreement for local engineering support of the Operator's engineering personnel, was unclear on the division of responsibility, resulting in erroneous defect identification, and misdirected maintenance action."}