{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-ii-mayaguana-3-killed", "date": "Apr 4, 2013 at 0100 LT", "type": "Cessna 402", "operator": "LeAir%20Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nassau - Mayaguana", "msn": "402C-0106", "yom": 1979, "flight_number": null, "city": "Mayaguana", "zone": "Mayaguana", "country": "Bahamas", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 3, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On Thursday April 4, 2013 at approximately1:00AM DST (0500 UTC) a fixed wing, twin-engine, Cessna 402C aircraft Bahamas registration C6-BGJ, serial number 402C0106, crashed into obstacles (vehicles) while landing on Runway 06 at Mayaguana International Airport (MYMM), Abraham’s Bay, Mayaguana, Bahamas. The pilot in command stated that on April 3, 2013, he received a call at approximately 9:30PM from the Princess Margaret Hospital requesting emergency air ambulance services out of Mayaguana. The local police on the island was contacted to confirm lighting approval and availability in order to conduct the emergency flight. After confirming lighting arrangements with Nassau Air Traffic Control Services, and obtaining the necessary clearance, the pilot in command, along with a copilot and one passenger, (a nurse), proceeded with the flight to Mayaguana. The flight departed Lynden Pindling International Airport at approximately  1:30PM DST (0330UTC). The destination was Abraham’s Bay, Mayaguana, Bahamas. The pilot in command also reported “about 1 hour and 40 minutes later we arrived at Mayaguana Airport, leveled off at 1500 feet and about 4 miles left base Runway 06, we had the runway in sight via lighting from vehicles.” The crew continued with the landing procedures. The aircraft touch down approximately 300 feet from the threshold on runway 06, the pilot in command reported that prior to the nose gear making contact with the runway “the right wing hit an object (vehicle), causing the aircraft to veer out of control to the right eventually colliding with a second vehicle approximately 300 to 400 feet on the right side (southern) of Runway 06.” The impact of the right wing of the aircraft with the second vehicle, caused the right wing (outboard of the engine nacelle) and right fuel sealed wet wing tank to rupture releasing the aircraft fuel in that wing, which caused an explosion engulfing the vehicle in flames. The force of the impact with the second vehicle caused the right main gear to break away from the aircraft and it was flung ahead and to the left side of the runway approximately 200 feet from the point of impact with the truck. As the right main gear of the aircraft was no longer attached, the aircraft collapsed on its right side, slid onto the gravel south (right) of the runway and somewhere during this process, the nose gear also collapsed. The pilot immediately shut off the fuel valve of the aircraft and once the engines and the aircraft came to a stop, the three occupants evacuated the aircraft. The occupants of the aircraft did not sustain any visible injuries requiring medical attention or hospitalization. However, three (3) occupants of the second vehicle that was struck, were fatally injured. The airplane sustained substantial damages as a result of the impact and post impact crash sequence. The impact with the  first vehicle occurred at approximately 427 feet from the threshold of runway 06 and at coordinates 28˚ 22’30”N and 073˚ 01’15’W. The flight was operated on an Instrument Flight Rules flight plan. Instrument Meteorological Conditions (night) prevailed at the time of the accident.", "probable_cause": "Breakdown in communication during the planning and execution of an unapproved procedure has been determined to be the probable cause of this accident.\r\nOther contributing factors:\r\n- Use of an unapproved procedure to aid in a maneuver that was critical,\r\n- Too many persons were planning the maneuver and not coordinating their actions,\r\n- Failure of planners of the maneuver to verify whether participants were in the right position,\r\n- Inexperienced persons used in the execution of a maneuver that was not approved,\r\n- Vehicle parked to close to the side of the runway,\r\n- Vehicle left with engine running while parked near the runway."}