{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-7-grand-canyon-58-killed", "date": "Jun 30, 1956 at 1032 LT", "type": "Douglas DC-7", "operator": "United-Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Los Angeles – Chicago – New York", "msn": "44288", "yom": 1955, "flight_number": "UA718", "city": "Grand Canyon", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 53, "pax_fatalities": 53, "other_fatalities": 0, "total_fatalities": 58, "captain_hours": 16492, "captain_hours_type": 1238, "copilot_hours": 4540, "copilot_hours_type": 230, "aircraft_hours": 5115, "circumstances": "United Air Lines Flight 718 was regularly scheduled from Los Angeles to Chicago, Illinois. On June 30, 1956, it took off from runway 25L (left) of the Los Angeles International Airport at 0904 (three minutes after TWA 2). Flight 718 was on an IFR flight plan to Chicago via Green Airway 5 Palm Springs inter-section, direct Needles, direct Painted Desert, direct Durango, direct Pueblo, direct St. Joseph. Victor Airway 116 Joliet, Victor Airway 84 Chicago Midway Airport. The flight plan proposed a .JPG\"> airspeed of 288 knots., a cruising altitude of 21,000 feet, and a departure time of 0845. The flight crew consisted of Captain Robert F. Shirley, First Officer Robert W. Harms, Flight Engineer Gerard Flore, and Stewardesses Nancy L. Kemnitz and Margaret A. Shoudt. Flight preparations and dispatch of United 718 were routine and the aircraft departed with 3,850 gallons of fuel. The company load manifest showed the gross weight of the aircraft at takeoff to be 105,835 pounds, which was less than the maximum allowable of 114,060 pounds; the latter weight was restricted from a maximum of 122,200 pounds for the aircraft because of a landing limitation at Chicago. The load was properly distributed with respect to the center of gravity limitations of the aircraft. After takeoff the flight contacted the Los Angeles tower radar controller, who vectored it through the overcast over the same departure course as TWA 2. United 718 reported \"on top\" and changed to Los Angeles Center frequency for its en route clearance. This corresponded to the flight plan as filed; however, the controller specified that the climb to assigned altitude be in VER conditions. Flight 718 made position reports to Aeronautical Radio, Inc., which serves under contract as United company radio. It reported passing over Riverside and later over Palm Springs intersection. The latter report indicated that United 718 was still climbing to 21,000 and estimated it would reach Needles at 1000 and the Painted Desert at 1034. At approximately 0958 United 718 made a position report to the CAA communications station located at Needles. This report stated that the flight was over Needles at 0958, at 21,000 feet, and estimated the Painted Desert at 1031, with Durango next. At 1031 an unidentified radio transmission was heard by Aeronautical Radio communicators at Salt Lake City and San Francisco. They were not able to understand the message when it was received but it was later determined by playing back the recorded transmission that the message was from United 718. Context was interpreted as: \"Salt Lake, United 718 . . . ah . . . we're going in.\"", "probable_cause": "The Board determines that the probable cause of this mid-air collision was that the pilots did not see each other in time to avoid the collision. It is not possible to determine why the pilots did not see each other, but the evidence suggests that it resulted from any one or a combination of the following factors: Intervening clouds reducing time for visual separation, visual limitations due to cockpit visibility, and preoccupation with normal cockpit duties, preoccupation with matters unrelated to cockpit duties such as attempting to provide the passengers with a more scenic view of the Grand Canyon area, physiological limits to human vision reducing the time opportunity to see and avoid the other aircraft, or insufficiency of en route air traffic advisory information due to inadequacy of facilities and lack of personnel in air traffic control. The following findings were reported: \r\n- Approaching Daggett, TWA 2 requested its company radio to obtain 21,000 feet as an assigned altitude, or 1,000 on top,\r\n- Company radio requested 21,000 feet IFR from ARTC. This vas denied by ARTC. Request was then made for 1,000 on top. This was approved and clearance issued. The flight climbed to and proceeded at 21,000 feet,\r\n- As an explanation for the denial of 21,000 feet, TWA 2 was furnished pertinent information on UA718,\r\n- The last position report by each flight indicated it was at that time at 21,000, estimating the Painted Desert line of position at 1031,\r\n- The Salt Lake controller possessed both position reports at approximately 1013, at which time both flights were in uncontrolled airspace,\r\n- Traffic control services are not provided in the uncontrolled airspace and according to existing Air Traffic Control policies and procedures the Salt Lake controller was not required to issue traffic information; none was issued voluntarily,\r\n- A general overcast with some breaks existed at 15,000 feet in the Grand Canyon area,\r\n- Several cumulus buildups extending above flight level existed; one was nearly over Grand Canyon Village and others were north and northeast in the area of the collision,\r\n- The collision occurred at approximately 1031 in visual flight rule weather conditions at about 21,000 feet,\r\n- The collision in space was above a position a short distance west of the TWA wreckage area, 17 miles west of or approximately 3-1/2 minutes' flying time from the Painted Desert line of position,\r\n- Under visual flight rule weather conditions it is the pilot's responsibility to maintain separation from other aircraft,\r\n- At impact the aircraft relative to each other converged at an angle of about 25 degrees with the DC-7 to the right of the L-1049. The DC-7 was rolled about 20 degrees right wing down and pitched about 10 degrees nose down relative to the L-1049,\r\n- There was no evidence found to indicate that malfunction or failure of the aircraft or their components was a factor in the accident."}