{"url": "https://www.baaa-acro.com/crash/crash-vickers-951-vanguard-london-36-killed", "date": "Oct 27, 1965 at 0223 LT", "type": "Vickers Vanguard", "operator": "BEA", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Edinburgh - London", "msn": "708", "yom": 1960, "flight_number": null, "city": "London-Heathrow", "zone": "London Metropolis", "country": "United Kingdom", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 30, "pax_fatalities": 30, "other_fatalities": 0, "total_fatalities": 36, "captain_hours": 12000, "captain_hours_type": 1049, "copilot_hours": 1381, "copilot_hours_type": 1155, "aircraft_hours": null, "circumstances": "The aircraft was on a scheduled domestic flight from Turnhouse Airport, Edinburgh to Heathrow Airport, London. The flight departed Edinburgh at 23:17 hours UTC on October 26 for an domestic flight to London. The flight was uneventful until Garston VOR, the holding point. At 00:15 the captain decided to attempt a landing on runway 28R. The co-pilot was probably making the ILS approach, monitored on PAR by the air traffic control officer, while the pilot-in-command would be seeking a visual reference to enable him if possible to take over control and land. RVR on this runway was reported as 350 m (1140 feet). At 00:23 the captain informed ATC that he was overshooting. He then decided to make a second attempt, this time on runway 28L for which the RVR was reported as 500 m (1634 feet). Since the ILS was operating on glide path only and not in azimuth, ATC provided a full taIkdown. At half a mile from touchdown the PAR Controller was not entirely satisfied with the positioning of the aircraft in azimuth and was about to give instructions to overshoot when he observed that the pilot had in fact instituted na overshoot procedure. At 00:35 hours the pilot-in-command reported that they overshot because they did not see anything. He then requested to join one of the stacks and hold for a little while. This request was granted. The pilot-in-command decided to wait for half an hour at the Garston holding point. At 00:46 another Vanguard landed successfully on runway 28R. At 01:11, although there had been no improvement in the weather conditions, the pilot-in-command probably stimulated by the other aircraft's success, asked permission to make another attempt to land on runway 28R. Meanwhile another Vanguard aircraft had overshot on 28R. However, the captain started another monitored ILS final approach on runway 28R at 01:18. At 01:22 the PAR controller passed the information that the aircraft was 3/4 of a mile from touchdown and on the centre line. Twenty-two seconds later the pilot-in-command reported they were overshooting. The copilot rotated the airplane abruptly and the captain raised the flaps. Instead of selecting the flaps to 20 degrees, he selected 5 degrees or fully up. Because the speed was not building up, the copilot relaxed pressure on the elevator. Speed increased to 137 kts and the vertical speed indicator showed a rate of climb of 850 feet/min. The copilot therefore put the aircraft's nose further down. At four seconds before impact the VSI was probably showing a substantial rate of climb and the altimeter a gain in height, although the airplane was in fact losing height. The copilot was misled into continuing his down pressure on the elevator. The vanguard had by then entered a steep dive. The aircraft hit the runway about 2600 feet from the threshold.", "probable_cause": "The cause of the accident was attributed to pilot error due to the following combination of events:\r\n- low visibility (less than 50 meters),\r\n- tiredness,\r\n- anxiety,\r\n- disorientation,\r\n- lack of experience of overshooting in fog,\r\n- over-reliance on pressure instruments,\r\n- position error in pressure instruments,\r\n- lacunae in training,\r\n- unsatisfactory overshoot procedure,\r\n- indifferent flap selector mechanism design,\r\n- wrong flap selection."}