{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-32-mt-la-aguada-45-killed", "date": "Mar 5, 1991 at 1617 LT", "type": "Douglas DC-9", "operator": "Aeropostal-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Maracaibo – Santa Bárbara de Zulia", "msn": "47720", "yom": 1976, "flight_number": "LV108", "city": "Mt La Aguada", "zone": "Trujillo", "country": "Venezuela", "region": "South America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 40, "pax_fatalities": 40, "other_fatalities": 0, "total_fatalities": 45, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 32452, "circumstances": "After departure from Maracaibo-La Chinita Airport, the crew followed a wrong heading to Santa Bárbara de Zulia (153° instead of 193°), which caused the aircraft to fly to the southeast over the lake of Maracaibo. While cruising at an altitude of 16,500 feet, the crew was cleared by ATC to descend to 5,500 feet. The crew reported to ATC that the VOR seemed to be inoperative but this was denied by the air traffic controller. At an altitude of 9,900 feet, the captain realized something was wrong about the heading selection, stopped the descent and initiated a right turn to gain height when the GPWS alarm sounded. Shortly later, the aircraft struck the slope of Mt La Aguada (3,320 meters high) located about 27 km northeast of Valera, some 170 km northeast of Santa Bárbara de Zulia. The aircraft disintegrated on impact and all 45 occupants were killed. ", "probable_cause": "The accident was the consequence of the combination of the following factors: \r\n- The crew failed to prepare the flight according to published procedures and failed to follow various checklists,\r\n- The crew failed to realize he was following a wrong heading after takeoff and failed to proceed to the en-route checks as required, \r\n- The crew was distracted by conversations with a third person who was seating on the jumpseat all flight,\r\n- The crew failed to supervise the flight according to standard operations, \r\n- Poor crew coordination, \r\n- Lack of discipline, \r\n- At the time of impact, the aircraft was flying under VFR mode in IMC conditions, \r\n- Poor visibility due to low clouds surroundings the mountains struck by the airplane. "}