{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200gt-super-king-air-baker-1-killed", "date": "Jun 7, 2013 at 1310 LT", "type": "Beechcraft 200 Super King Air", "operator": "Osage Air", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Baton Rouge - McComb", "msn": "BY-24", "yom": 2007, "flight_number": null, "city": "Baton Rouge", "zone": "Louisiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 15925, "captain_hours_type": 5200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 974, "circumstances": "The accident pilot and two passengers had just completed a ferry flight on the recently purchased airplane. A review of the airplane’s cockpit voice recorder audio information revealed that, during the ferry flight, one of the passengers, who was also a pilot, was pointing out features of the new airplane, including the avionics suite, to the accident pilot. The pilot had previously flown another similar model airplane, but it was slightly older and had a different avionics package; the new airplane’s avionics and flight management system were new to the pilot. After completing the ferry flight and dropping off the passengers, the pilot departed for a short cross-country flight in the airplane. According to air traffic control recordings, shortly after takeoff, an air traffic controller assigned the pilot a heading and altitude. The pilot acknowledged the transmission and indicated that he would turn to a 045 heading. The radio transmission sounded routine, and no concern was noted in the pilot’s voice. However, an audio tone consistent with the airplane’s stall warning horn was heard in the background of the pilot’s radio transmission. The pilot then made a radio transmission stating that he was going to crash. The audio tone was again heard in the background, and distress was noted in the pilot’s voice. The airplane impacted homes in a residential neighborhood; a postcrash fire ensued. A review of radar data revealed that the airplane made a climbing right turn after departure and then slowed and descended. The final radar return showed the airplane at a ground speed of 102 knots and an altitude of 400 feet. Examination of the engines and propellers indicated that the engines were rotating at the time of impact; however, the amount of power the engines were producing could not be determined. The examination of the airplane did not reveal any abnormalities that would have precluded normal operation. It is likely that the accident pilot failed to maintain adequate airspeed during departure, which resulted in an aerodynamic stall and subsequent impact with terrain, and that his lack of specific knowledge of the airplane’s avionics contributed to the accident. ", "probable_cause": "The pilot’s failure to maintain adequate airspeed during departure, which resulted in an aerodynamic stall and subsequent impact with terrain. Contributing to the accident was the pilot’s lack of specific knowledge of the airplane’s avionics."}