{"url": "https://www.baaa-acro.com/crash/crash-pacific-aerospace-pac-750xl-tekin", "date": "Jan 18, 2022 at 0926 LT", "type": "PAC 750XL - Pacific Aerospace Corporation", "operator": "Niugini%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kiunga – Oksapmin", "msn": "161", "yom": 2009, "flight_number": null, "city": "Oksapmin (Tekin)", "zone": "Western (Fly)", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9305, "captain_hours_type": 332, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7549, "circumstances": "The airplane was conducting a single pilot VFR charter flight from Kiunga Airport, Western Province to Tekin Airstrip, Sandaun Province, Papua New Guinea when during the landing roll, the aircraft sustained a left Main Landing Gear (MLG) assembly collapse and subsequent runway excursion. There were eight persons onboard: one pilot and seven passengers. At 08:43, P2-BWE departed Kiunga Airport and arrived at Tekin Airstrip circuit at 09:18. The pilot then tracked towards the Northwest of the airstrip and made a left base turn for approach. The pilot stated that he established the aircraft on final approach with an airspeed of 120 kts. He subsequently configured the aircraft for landing; propeller pitch set to full fine, power set to maintain nominated approach speed, and full flap. The pilot indicated that he reduced airspeed while on approach and maintained an airspeed between 85 and 90 kts. As he flared the aircraft to land, the airspeed was between 75 to 80 kts. The touchdown speed, as he recalled, was 75 kts. The aircraft touched down two metres short of the designated landing threshold of runway18, which had an elevation of 15cm. Reviewing the flight records of the pilot, and from his interview, the AIC deduced that the pilot was not adequately familiar with Tekin Airstrip. The aircraft sustained substantial damaged. All the passengers and pilot evacuated the aircraft without injuries.", "probable_cause": "The investigation identified that during touchdown, the aircraft’s main landing gear tyre hit the 15cm elevation at the edge of runway18, resulting in the left MLG assembly weakening. The investigation determined that due to less damping effect on the oleo or the tyre, the landing impact force could have transferred up through the structure and concurrently causing the left MLG assembly to collapse. Following the collapse of the left MLG assembly, the left-wing assembly dropped and hit the ground, the flap detached and began to drag on the surface of the strip creating markings. The aircraft immediately began veering left, towards the edge (boundary) of the airstrip and impacted the drainage ditch adjacent to the runway where it came to rest. "}