{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-20-dk-nagpur-10-killed", "date": "Feb 2, 1955 at 0350 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Indian%20Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Madras – Nagpur – New Delhi", "msn": "13037", "yom": 1944, "flight_number": null, "city": "Nagpur", "zone": "Maharashtra", "country": "India", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 5867, "captain_hours_type": 2778, "copilot_hours": 3671, "copilot_hours_type": 268, "aircraft_hours": null, "circumstances": "The aircraft departed Nagpur Airport runway 09 at 0348LT on a flight to New Delhi. Two minutes later, while climbing at low height, the pilot-in-command attempted a steep turn to the left when the aircraft stalled and crashed in a huge explosion in an open field located 5,650 feet from the runway end. The aircraft was destroyed by impact forces and a post crash fire and all ten occupants were killed. ", "probable_cause": "The aircraft crashed as a result of slipping into the ground in the course of a badly executed steep turn to port carried out at night at a low altitude. No importance need be attached to the fact that the captain took a turn to the left instead of to the right, as is generally done by most of the pilots when taking off for Delhi from Runway 27. We find from the record that it was not unusual for the pilot in question to take a turn to the left but the mistake lay in badly executing a turn. The reason for such a steep turn is not easy to ascertain. It is possible that the pilot may have done so in order to get on course quickly. It is also possible that he relied on visual reference instead of flying entirely on instruments as he should have done, thereby going into a turn steeper than intended, or it may be that he was misled by the instruments."}