{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690a-norfolk-4-killed", "date": "Jul 30, 1993 at 1700 LT", "type": "Rockwell Grand Commander 690", "operator": "Motel Developers Inc.", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Mountain Home - Norfolk", "msn": "690-11326", "yom": 1976, "flight_number": null, "city": "Norfolk-Karl Stefan", "zone": "Nebraska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 17770, "captain_hours_type": 414, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Rockwell 690A, N707BP, was flying a straight-in entry to a downwind leg for runway 19 at the non-controlled airport. The only radio call heard from the Rockwell was a request for an airport advisory when it was about 20 miles southeast. The Piper PA-28R, N33056, had departed from runway 19. No radio calls were heard from the Piper. Witnesses observed the Rockwell heading north and the Piper heading east moments before the collision. The witnesses stated the Piper pitched up and banked steeply moments before the collision. The collision occurred approximately 2 miles east-southeast of the airport. On-scene investigation showed that the Piper's left main landing gear tire had made an imprint on the bottom of the Rockwell's outboard left wing. Paint color from the Rockwell had transferred to the Piper's left wing skin. All six people in both aircraft were killed.  ", "probable_cause": "The failure of the pilots of the Rockwell 690A, N707BP, and the Piper PA28R, N33056, to see and avoid each other. A factor which contributed to the accident was the failure of both pilot's to follow recommended communication procedures contained in the airman's information manual for operating at an airport without an operating control tower."}