{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-lynchburg-5-killed", "date": "Aug 28, 1989 at 0045 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Bay Land Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Salisbury - Lynchburg", "msn": "31-7952021", "yom": 1979, "flight_number": null, "city": "Lynchburg-Falwell", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 1345, "captain_hours_type": 190, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot unsuccessfully tried twice to land on runway 03. He did a visual approach and then an ILS approach. The pilot and witnesses reported foggy conditions at the airport. The pilot flew the ILS approach as a third attempt to land when the crash occurred. Radar data showed the aircraft descended to 1,100 feet msl on the approach, about 1/2 mile from the runway. The published decision height was 1,118 feet. The radar data indicated the aircraft passed east of the runway threshold at an altitude of 1,000 feet msl. The next and last radar data shows the aircraft about 2,300 feet beyond and 400 feet east of the runway. The investigation revealed the aircraft struck trees east of the runway and then crashed in a cornfield. An examination did not disclose evidence of a malfunction. The landing gear was retracted and the flaps were extended 10°. All five occupants were killed. ", "probable_cause": "Pilot's failure to maintain clearance from obstructions because of improper ifr operation. Contributing to the accident was descent below decision height, delay in initiating the missed approach, and fog conditions."}