{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-0-fort-leonard-wood-afb-30-killed", "date": "Aug 4, 1955 at 1223 LT", "type": "Convair CV-240", "operator": "American-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tulsa – Joplin – Springfield – Saint Louis – New York", "msn": "40", "yom": 1948, "flight_number": "AA476", "city": "Fort Leonard Wood", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 27, "pax_fatalities": 27, "other_fatalities": 0, "total_fatalities": 30, "captain_hours": 15540, "captain_hours_type": 5000, "copilot_hours": 8500, "copilot_hours_type": 2500, "aircraft_hours": 14865, "circumstances": "Flight 476 of August 4 was a scheduled operation between Tulsa, Oklahoma, and La Guardia Field, New York, with several intermediate stops including Joplin, Springfield, and St. Louis, Missouri. The flight departed Tulsa at 1006 (one minute behind schedule) with Captain Hugh C. Barren, First Officer William G. Gates, and Stewardess Thelma R. Ballard as crew. En route stops were made at Joplin and Springfield, and no discrepancies were reported or noted at either point. However, a traffic delay in the Joplin area resulted in the flight arriving and departing Springfield 21 minutes behind schedule. Two of the eight passengers deplaned at Springfield, 21 passengers boarded the flight there. Gross weight of the aircraft at takeoff was 38,663 pounds, 2,302 pounds under that allowable, and the center of gravity was located within prescribed limits. Flight 476 departed Springfield VFR for St. Louis, its next scheduled stop, at 1153 via Victor Airway 14 to cruise at 7,000 feet. It was off the ground at 1156. Twenty-one minutes later (1217) the crew initiated a general call asking, \"Does anyone read 476?\" Springfield company radio acknowledged but received no reply. Two other American Airlines flights, one cruising in the vicinity of Springfield at 7,000 feet, the other 30 miles north-northeast of St. Louis, heard a transmission from Flight 476 that No. 2 engine was on fire. This message was also heard by American's ground station at St. Louis. Three minutes later the American flight in the Springfield area intercepted the following message, \"Springfield, are you reading 476? We have bad engine fire.\" This was the last message heard from the flight. All transmissions were on company frequency. During this interval numerous witnesses on the ground back along the flight path saw the aircraft with smoke and flame coming from the right engine. The aircraft was also tracked by a military radar installation near Springfield until it disappeared from the scope in the vicinity of Fort Leonard Wood. At approximately 1222 the operations officer on duty at Forney Field, Fort Leonard Wood, received a radio message from an Army pilot flying nearby that a two-engine aircraft with a fire in the right engine was on final approach to runway 14. The tower operator at Forney Field saw the approaching aircraft and gave it clearance to land. Before the operations officer could alert the crash crew another call from the Army pilot informed him that the airplane had crashed short of the runway. The time was 1223. Army personnel with portable fire-fighting equipment reached the wreckage on foot. There were no survivors. Heavy fire-fighting equipment and ambulances could not reach the scene until the Army engineers had bulldozed a road through the densely wooded area in which the crash occurred.", "probable_cause": "The Board determines that the probable cause of this accident was installation of an unairworthy cylinder, the failure of which resulted in an uncontrollable fire and subsequent loss of a wing in flight. The following findings were reported: \r\n- Weather was not a factor,\r\n- N° 12 cylinder of the right engine was not airworthy and failed near its base after less than six hours of operation, causing a fire that the crew could not control,\r\n- Visual inspection procedures being used by the carrier did not reveal the unairworthy condition of the cylinder,\r\n- The right main tank fuel shutoff valve was open, which greatly increased the intensity and duration of the fire,\r\n- Fire damage prevented the closing of this valve,\r\n- Procedures recommended by the manufacturer and specified in the carrier's overhaul manual had been countermanded by verbal instructions approved by the carrier's engineering department and were not being followed by the carrier's inspectors with respect to the handling of cylinders."}