{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-kelso-5-killed", "date": "Oct 29, 2003 at 1222 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Robert S. Brown", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Bullhead City – Van Nuys", "msn": "421B-0367", "yom": 1973, "flight_number": null, "city": "Kelso", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 11371, "captain_hours_type": 1237, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3114, "circumstances": "The aircraft broke up in-flight during a high speed descent after encountering clouds and reduced visibilities aloft. The weather conditions included multiple cloud layers at 9,000, 12,000 and 16,000 feet, and reduced visibility aloft from smoke and haze from wilderness wild fires that were occurring over large portions of Southern California. The aircraft departed the airport toward a VORTAC to the west, approximately 30 nautical miles (nm) away. The first radar contact was at 1159, and the aircraft's Mode C transponder reported an altitude of 3,500 feet mean sea level (msl). By the time the aircraft reached the VORTAC, the altitude had increased to 4,900 feet msl. The aircraft continued to climb, passing through the VFR flight plan filed altitude of 8,500 feet msl, until it reached an altitude of 12,900 feet msl. The last 6 minutes of radar data reported the aircraft at various altitudes, starting at 11,000 feet msl and climbing to a maximum altitude of 12,700 feet msl. During the last 3 minutes of flight, radar data showed the aircraft made numerous left and right climbing and descending turns, eventually reversing course. The next to last radar return at 1221:24 indicated an altitude of 11,900 feet msl. Nineteen seconds later, the last radar return reported an altitude of 7,700 feet msl. The computed vertical speed between the last two radar returns was 13,263 feet per minute. The wreckage was distributed over a 0.2-nm distance, with the main wreckage approximately 0.5 miles northwest of the last radar return. The northern end of the debris path began with pieces of the left elevator, followed by sections of the right stabilizer and elevator, and more sections from both horizontal empennage surfaces. Pieces of the vertical stabilizer, rudder, and both ailerons were also found along the debris path. The southern 100 feet of the debris path contained the fuselage and both sets of wings, engines, and propellers. The aircraft impacted the ground inverted. The wings separated just outboard of the nacelles at the initial point of impact. Examination of the wreckage showed that all structural failures were the result of overload.", "probable_cause": "The pilot's continued VFR flight into instrument conditions between cloud layers and with reduced visibility due to smoke that resulted in an in-flight loss of control from spatial  disorientation, and the structural overload of the airframe during the subsequent high speed descent."}