{"url": "https://www.baaa-acro.com/crash/crash-lockheed-18-50-lodestar-st-petersburg", "date": "Jan 10, 1955 at 0938 LT", "type": "Lockheed 18 LodeStar", "operator": "National-Airlines-4", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Orlando – Lakeland – Tampa – Saint Petersburg – Sarasota – Fort Myers – West Palm Beach – Miami", "msn": "2414", "yom": 1943, "flight_number": "NA001", "city": "Saint Petersburg", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13427, "captain_hours_type": 410, "copilot_hours": 3639, "copilot_hours_type": 43, "aircraft_hours": 20627, "circumstances": "After a normal run-up the copilot taxied the aircraft to the end of the 5,010-foot runway. The aircraft was then lined up with the runway slightly to the right of the centerline, the tail wheel was locked, and power was applied. As the aircraft progressed down the runway the tail came up and the copilot applied forward pressure to the control column. Shortly thereafter the airplane began to swerve to the left and when this was corrected it went too far to the right. A series of over-corrections followed which resulted in several swerves in both directions. As these maneuvers began the crew noted a five-inch drop in the manifold pressure of the left engine. At a speed of approximately 80 knots the aircraft again began turning to the left. The captain immediately took over the controls when he noticed a second drop of 25 inches in manifold pressure of the same engine. Both throttles were closed at once and he tried unsuccessfully to stop the turn. The turn developed into a skid and the main landing gear of the aircraft collapsed, rupturing the right wing fuel tank. The airplane cam to rest on the sodded area, off the runway, heading 180 degrees from its original takeoff position. Fire immediately occurred near the right engine nacelle. Under the supervision of the stewardess all passengers left the aircraft in a rapid, orderly manner through the main cabin door. The pilots left through the cockpit windows. The captain and copilot entered the cabin and made a recheck after all passengers were reported out and away from the aircraft. Local weather conditions at the time were: Ceiling 30,000 feet scattered, 600 feet scattered, visibility 12 miles, temperature 70, dewpoint 67, wind south 7. Atmospheric conditions were not conducive to carburetor ice.", "probable_cause": "The Board determines that the probable cause of this accident was the copilot's loss of directional control during the takeoff run and the inability of the captain to regain control of the aircraft, the latter possibly due to failure of the pedal mechanism. The following findings were reported:\n- Directional control was lost in the takeoff run which resulted in a violent groundloop off the runway,\n- There is no evidence indicating that structural failure or malfunction of controls occurred. However, there exists the indeterminable possibility that during takeoff run there was a failure of the pedal assembly,\n- Subsequent engine tests gave no evidence of other than normal operation of the left engine. The right engine operated normally throughout the attempted takeoff."}