{"url": "https://www.baaa-acro.com/crash/ground-accident-saab-340a-mendoza", "date": "Jan 2, 2013 at 1011 LT", "type": "Saab 340", "operator": "SOL%20Lineas%20Aereas", "flight_phase": "Taxiing", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Mendoza - Neuquén", "msn": "123", "yom": 1988, "flight_number": "OLS5420", "city": "Mendoza-El Plumerillo", "zone": "Mendoza", "country": "Argentina", "region": "South America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 30, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7000, "captain_hours_type": 600, "copilot_hours": 1818, "copilot_hours_type": 110, "aircraft_hours": 47798, "circumstances": "While taxiing to runway 18 for a departure to Neuquén, the twin engine aircraft went out of control, veered off taxiway to the left and rolled onto a soft ground four about 40 metres before coming to rest. The nose gear sank in soft ground, causing both propeller blades to struck the ground and to be partially torn off. The fuselage was hit by debris. All 33 occupants evacuated safely and the aircraft was damaged beyond repair.", "probable_cause": "The loss of control during taxiing was the consequence of the combination of the following factors:\r\n- The electric pump which controls fluid pressure in the hydraulic system was not operational, generating a deficit of fluid pressure in the hydraulic system.\r\n- The low fluid pressure warning in the hydraulic system was not recognized by the crew.\r\n- The crew could not control the path of the aircraft due to the unavailability of nose wheel steering.\r\n- The persistence of an informal practice among the crews of the operator on the operation of the hydraulic system, contrary to the concept of operation of the hydraulic system established by the manufacturer.\r\n- The lack of detection of the informal practice on the operation of the hydraulic system by the operator's safety monitoring mechanisms."}