{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-fort-lauderdale-4-killed", "date": "Nov 19, 2013 at 1956 LT", "type": "Learjet 35", "operator": "AeroJL", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Fort Lauderdale - Cozumel", "msn": "35A-255", "yom": 1979, "flight_number": null, "city": "Fort Lauderdale-Hollywood", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 10091, "captain_hours_type": 1400, "copilot_hours": 1235, "copilot_hours_type": 175, "aircraft_hours": 6842, "circumstances": "During takeoff to the east over the ocean, after the twin-engine jet climbed straight ahead to about 2,200 ft and 200 knots groundspeed, the copilot requested radar vectors back to the departure airport due to an \"engine failure.\" The controller assigned an altitude and heading, and the copilot replied, \"not possible,\" and requested a 180-degree turn back to the airport, which the controller acknowledged and approved. However, the airplane continued a gradual left turn to the north as it slowed and descended. The copilot subsequently declared a \"mayday\" and again requested vectors back to the departure airport. During the next 3 minutes, the copilot requested, received, and acknowledged multiple instructions from the controller to turn left to the southwest to return to the airport. However, the airplane continued its slow left turn and descent to the north. The airplane slowed to 140 knots and descended to 900 ft as it flew northbound, parallel to the shoreline, and away from the airport. Eventually, the airplane tracked in the direction of the airport, but it continued to descend and impacted the ocean about 1 mile offshore. According to conversations recorded on the airplane's cockpit voice recorder (CVR), no checklists were called for, offered, or used by either flight crewmember during normal operations (before or during engine start, taxi, and takeoff) or following the announced in-flight emergency. After the \"engine failure\" was declared to the air traffic controller, the pilot asked the copilot for unspecified \"help\" because he did not \"know what's going on,\" and he could not identify the emergency or direct the copilot in any way with regard to managing or responding to the emergency. At no time did the copilot identify or verify a specific emergency or malfunction, and he did not provide any guidance or assistance to the pilot. Examination of the recovered wreckage revealed damage to the left engine's thrust reverser components, including separation of the lower blocker door, and the stretched filament of the left engine's thrust reverser \"UNLOCK\" status light, which indicated that the light bulb was illuminated at the time of the airplane's impact. Such evidence demonstrated that the left engine's thrust reverser became unlocked and deployed (at least partially and possibly fully) in flight. Impact damage precluded testing for electrical, pneumatic, and mechanical continuity of the thrust reverser system, and the reason the left thrust reverser deployed in flight could not be determined. No previous instances of the inflight deployment of a thrust reverser on this make and model airplane have been documented. The airplane's flight manual supplement for the thrust reverser system contained emergency procedures for responding to the inadvertent deployment of a thrust reverser during takeoff. For a deployment occurring above V1 (takeoff safety speed), the procedure included maintaining control of the airplane, placing the thrust reverser rocker switch in the \"EMER STOW\" position, performing an engine shutdown, and then performing a single-engine landing. Based on the wreckage evidence and data recovered from the left engine's digital electronic engine control (DEEC), the thrust reverser rocker switch was not placed in the \"EMER STOW\" position, and the left engine was not shut down. The DEEC data showed a reduction in N1 about 100 seconds after takeoff followed by a rise in N1 about 35 seconds later. The data were consistent with the thrust reverser deploying in flight (resulting in the reduction in N1) followed by the inflight separation of the lower blocker door (resulting in the rise in N1 as some direct exhaust flow was restored). Further, the DEEC data revealed full engine power application throughout the flight. Although neither flight crewmember recognized that the problem was an inflight deployment of the left thrust reverser, certification flight test data indicated that the airplane would have been controllable as it was configured on the accident flight. If the crew had applied the \"engine failure\" emergency procedure (the perceived problem that the copilot reported to the air traffic controller), the airplane would have been more easily controlled and could have been successfully landed. The airplane required two fully-qualified flight crewmembers; however, the copilot was not qualified to act as second-in-command on the airplane, and he provided no meaningful assistance to the pilot in handling the emergency. Further, although the pilot's records indicated considerable experience in similar model airplanes, the pilot's performance during the flight was highly deficient. Based on the CVR transcript, the pilot did not adhere to industry best practices involving the execution of checklists during normal operations, was unprepared to identify and handle the emergency, did not refer to the appropriate procedures checklists to properly configure and control the airplane once a problem was detected, and did not direct the copilot to the appropriate checklists. ", "probable_cause": "The pilot's failure to maintain control of the airplane following an inflight deployment of the left engine thrust reverser. Contributing to the accident was the flight crew's failure to perform the appropriate emergency procedures, the copilot's lack of qualification and capability to act as a required flight crewmember for the flight, and the inflight deployment of the left engine thrust reverser for reasons that could not be determined through postaccident investigation."}