{"url": "https://www.baaa-acro.com/crash/crash-epic-lt-port-orange-2-killed", "date": "Dec 27, 2016 at 1756 LT", "type": "Epic LT", "operator": "Independent Technologies", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Millington – Port Orange", "msn": "029", "yom": 2009, "flight_number": null, "city": "Port Orange-Spruce Creek", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4246, "captain_hours_type": 956, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 822, "circumstances": "The private pilot obtained a full weather briefing before departing on a long cross-country flight. The destination airport was forecast to be under visual meteorological conditions, but there was an AIRMET and Center Weather Advisory (CWA) issued for low instrument flight rules (IFR) conditions later that day. The briefer told the pilot to check the weather again en route to see if the AIRMET and CWA had been updated. At the time the pilot stopped for fuel, another CWA was issued for low IFR conditions at his destination airport; however, there were no records to indicate that the pilot obtained this information during the fuel stop or after departing on the last leg of the flight. A review of air traffic control communications revealed that, about 10 minutes before arriving at the airport, the pilot reported that he had obtained the current weather conditions at his destination airport. The most recent observation, about 1 hour before the accident indicated good visibility; however, the weather reporting equipment did not provide ceiling heights. It is unknown if the pilot obtained weather information from nearby airports, which were reporting low instrument meteorological conditions (visibility between 1/4 and 1/2 mile and ceilings 200-300 ft above ground level [agl]). Additionally, three pilot reports (PIREPs) describing the poor weather conditions were filed within the hour before the accident. The controller did not relay the PIREPs or the CWA information to the pilot, so the pilot was likely unaware of the deteriorating conditions. Based on radar information and statements from witnesses, the pilot's approach to the airport was unstabilized. He descended below the minimum descent altitude of 440 ft, and, after breaking through the fog about 100 ft agl, the airplane reentered the fog and completed a 360° right turn near the approach end of the runway, during which its altitude varied from 100 ft to 300 ft. The airplane then climbed to an altitude about 800 ft before radar contact was lost near the accident site. The airplane came to rest inverted, consistent with one witness's statement that it descended through the clouds in a spin before impact; post accident examination revealed no preimpact anomalies with the airplane or engine that would have precluded normal operation. Although the pilot was instrument rated, his recent instrument experience could not be established. The circumstances of the accident, including the restricted visibility conditions and the pilot's maneuvering of the airplane before the impact, are consistent with a spatial disorientation event. It is likely that the pilot experienced a loss of control due to spatial disorientation, which resulted in an aerodynamic stall and spin.", "probable_cause": "The pilot's loss of airplane control due to spatial disorientation, which resulted in the exceedance of the airplane's critical angle of attack and an aerodynamic stall/spin. Contributing to the accident was the pilot's failure to fly a stabilized approach consistent with the published instrument approach procedure."}