{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-augusta-3-killed", "date": "Aug 4, 2000 at 0745 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Medical Enterprises", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Augusta – Atlantic City", "msn": "46-36133", "yom": 1998, "flight_number": null, "city": "Augusta-Daniel Field", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 6000, "captain_hours_type": 80, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 451, "circumstances": "Witness's reported that the airplane took off from runway 05, which has an up slope of 1.2 degrees. The airplane was observed at approximately 10 feet above ground level, in a nose high attitude traveling parallel to the ground and not climbing. The airplane narrowly cleared a 6- foot fence off the departure end of runway 05. Shortly thereafter, the airplane impacted a utility pole, the roof of a bus stop, which was followed by a brick wall. At the time of the accident runway 23, which has a 1.2-degree down slope and has a clear-cut area on the departure end, was available for use. The basic empty weight for this airplane is 3,097 pounds; the useful load is 1,201.7 pounds. The actual load at the time of the accident was in excess of the useful load. There is no record of the pilot completing a weight and balance computation prior to take-off. The toxicology examinations were negative for carbon monoxide, cyanide, drugs and alcohol. The toxicology examination revealed that 1175(mg/dl) glucose was detected in the urine. Examination of the airplane and subsystems failed to disclose any mechanical or component failures.", "probable_cause": "Improper preflight planning/preparation by the pilot, which resulted in taking off with the airplane exceeding the weight and balance limitations. Factors to the accident were the improper loading of the airplane, taking off from a short, up sloping runway and the pilot's elevated glucose level. "}