{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-nassau-1-killed", "date": "Dec 2, 2014 at 0845 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Fergs-Air-Charter", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Governor’s Harbour – Nassau", "msn": "31-7652062", "yom": 1976, "flight_number": "302", "city": "Nassau", "zone": "New Providence", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7650, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11744, "circumstances": "On Tuesday December 2nd, 2014 at approximately 8:45 am (1345Z) a Ferg’s Air Limited, Piper PA-31-350 Navajo aircraft, registration C6-REV, operated as Southern Air Limited Flight 302, ditched in waters approximately 6nm from shore in the southwestern district of New Providence. The flight originated at Governor’s Harbour, Eleuthera (MYEM) with 10+1 persons on board at approximately 8:15 am in Visual Meteorological Conditions (VMC). At around 8:30am, the aircraft 15 nautical miles east of Lynden Pindling International Airport at 4,500 feet contacted Nassau Air Traffic Control Tower. The aircraft was instructed that runway 09 was in use and they can expect a landing on that runway. Upon final approach to runway 09, with the landing gears selected to the “EXTEND” position, only the nose and right main landing gear lights indicated the “down and locked” position. The left main landing gear light did not illuminate to indicate the “down and locked” position, so the landing was aborted and the pilot requested to go around so he could recycle and troubleshoot the landing gear issue. The pilot made a left turn, flew over the north western shoreline and recycled the landing gears a few times and also tried the emergency hand pump in an attempt to extend the gear. Despite all efforts, the left main landing gear light still did not illuminate to indicated the gear was in the safe “down and locked” position. At this time the aircraft was allowed to fly by the tower so that the controller may make a visual check of the landing gears to see if they were in the extended position. The controller advised the pilot that all gears “appeared to be extended”. Once again the pilot proceeded outbound to make another attempt for landing. For this approach the pilot made a right turn over the southwestern shoreline and proceeded downwind to runway 09. While on the downwind to runway 09 the pilot stated he began to experience problems with the right engine. The engine eventually stopped and all attempts to restart were unsuccessful. As a result of single engine operation, level flight could not be maintained even after retracting the gears and cleaning up the airplane. The decision was made by the pilot to ditch in the water vs. attempting to make the airport where numerous trees and obstacles would make the landing more difficult if the runway could not be made. After touching down on the water the most of the occupants were able to evacuate the aircraft through the normal and emergency exits before the aircraft sank into the ocean. One passenger died during the process. Witness stated that “the plane skipped across the water three times before rotating and hitting with a severe impact. The port (left) tail section received the bulk of the impact as did the port side of the plane.” Eye witness further stated that the passenger that died and “luggage from the baggage compartment were ejected from the rear of the plane on the port side.” “Multiple passengers could not swim or were extremely limited in their ability to swim.” Despite the plane having the full complement of survival equipment (life vests), only two were taken out of the aircraft. Passengers were holding on to bags and other debris that floated out of the aircraft as it submerged. Passengers helped each other until rescuers arrived to assist. Estimates from eye witness were that “the entire plane disappeared under water from 30 to 60 seconds after impact.” The depth where the aircraft came to rest on the water was reported as in excess of 6,500 feet. Once the aircraft settled, it submerged and was not able to be recovered. Safety concerns raised by eye witness could not be confirmed as the plane was never recovered.", "probable_cause": "The AAIPU determines that the probable causes of this accident as:\r\n- Engine failure and the inability of the aircraft to maintain a safe altitude.\r\nContributing Factors includes:\r\n- Failure of the left main landing gear.\r\nThe following findings were identified:\r\n1. Weather was not a factor in the accident.\r\n2. Air Traffic Services were proper and did not contribute to the cause of the accident.\r\n3. The pilot was properly certified, trained and qualified for the flight.\r\n4. The loss of power on the right engine resulted in the aircraft inability to maintain a safe altitude.\r\n5. The Police and other emergency services response were timely and effective.\r\n6. The depth of the water where the aircraft came to rest made it impossible for the aircraft to be recovered.\r\n7. The aircraft was properly maintained in accordance with Bahamas and United States regulations and maintenance practices.\n"}