{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-100-goose-bay-4-killed", "date": "Oct 11, 1984 at 1737 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Labrador%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Saint Anthony - Goose Bay", "msn": "34", "yom": 1967, "flight_number": null, "city": "Goose Bay", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17585, "circumstances": "The Twin Otter departed Goose Bay on a medical evacuation flight to St. Anthony. The flight was uneventful and landed in St. Anthony at 15:24. At 16:02, the aircraft departed St. Anthony on a VFR flight back to Goose Bay. On board were the two pilots and the doctor and nurse. Approaching the Goose Bay Airport, weather became marginal, but the crew continued visual flight. The crew likely encountered near zero forward visibility in snow showers and fog; it is probable that they were able to maintain vertical contact with the ground and were confident they could continue flight with visual reference to the ground. The crew may not have been able to see terrain ahead and therefore may not have been able to determine if the aircraft would clear the hills, particularly, when steep hills were encountered. The plane struck a rock outcropping 100 feet below the summit of a 2,050-foot mountain. After bouncing twice, the Twin Otter had come to rest in a small, wooded gully, approximately 350 feet from the initial point of impact.", "probable_cause": "It was determined that the flight was attempted in mountainous terrain in marginal weather conditions. The aircraft was flown at an altitude which did not provide terrain clearance, and the aircraft struck a mountain for undetermined reasons."}