{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-6b2-h4-turbo-porter-cecina-2-killed", "date": "Jun 11, 2016 at 1230 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "Skydive-Toscana", "flight_phase": "Flight", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Cecina - Cecina", "msn": "932", "yom": 2000, "flight_number": null, "city": "Cecina", "zone": "Tuscany", "country": "Italy", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 670, "captain_hours_type": null, "copilot_hours": 3300, "copilot_hours_type": 1700, "aircraft_hours": 6705, "circumstances": "The aircraft, operated by Skydive Kalifornia (aka Skydive Toscana) was involved in a local skydiving flight from Cecina Airfield. When the aircraft reached the assigned altitude, six of the seven skydivers bailed out. When the seventh skydiver elected to jump, his auxiliary parachute accidentally opened while the skydiver was still in the cabin. He was sucked outside and collided with the right horizontal stabilizer that later detached. The aircraft entered an uncontrolled descent and crashed in a field. The aircraft was destroyed by impact forces and both pilots were killed. There was no fire. All seven skydivers were uninjured. ", "probable_cause": "The cause of the accident is attributable to the detachment of the horizontal stabilizer following the impact with a skydiver dragged by his auxiliary parachute that accidentally opened while he was still inside the aircraft. This detachment led to the loss of governability of the aircraft. \r\nThe following factors contributed to the incident: \r\n- The conformation of the throwing material, with closing flap of the safety flap covering the pin, which, tending to come out of its seat, did not guarantee adequate protection of the locking pin from accidental interference.\r\n- The conformation of the structure of the right front seat, which interferes with the closing system of the auxiliary parachute bag, which determined the opening.\r\n- The non-optimal disposition of the skydivers and the DL on board the aircraft (first skydiver to go out not immediately to the door and DL with his back addressed to the skydiver student)."}