{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-peachtree-city-2-killed", "date": "Jan 16, 1996 at 0900 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Toki Leasing Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Lakeland – Peachtree City", "msn": "46-22119", "yom": 1991, "flight_number": null, "city": "Peachtree City-Falcon Field", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1080, "captain_hours_type": 92, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1064, "circumstances": "During the preflight briefing, the pilot was informed of reduced visibility and low ceiling in the vicinity of the destination airport, at the approximate time of the planned arrival. Upon arriving in the Atlanta area, the pilot was issued radar vectors to a final for the localizer runway 31 approach. The pilot was also given the current Atlanta altimeter setting, and was cleared for the localizer runway 31 approach. The airplane collided with a 60-foot tall light pole at a nearby baseball complex 2 miles short of the runway. The weather observation from the Hartsfield International Airport indicated that visual weather conditions prevailed at the time of the accident. However, according to a witness at the accident site, the weather conditions were foggy with reduced visibility. The wreckage distribution path was 2,467 feet right of the localizer course. The minimum descent altitude for this approach, using Atlanta's altimeter setting, was 1260 feet. The ground check of the localizer and DME facility was within normal operating range. Examination of the aircraft navigational radios also tested within normal ranges. The average field elevation in the vicinity of the accident site is 800 feet. The pilot's toxicological examinations detected pseudoephedrine (decongestant), phenylpropanolamine (decongestant), and chlorpheniramine (antihistamine). No samples were available to quantify the blood levels of these medications. ", "probable_cause": "The pilot's failure to follow the published instrument approach procedure. The fog was a factor. "}