{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130h-hercules-baghdad", "date": "Jun 27, 2008 at 1235 LT", "type": "Lockheed C-130 Hercules", "operator": "United%20States%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "5098", "yom": 1987, "flight_number": null, "city": "Baghdad", "zone": "Baghdād (بغداد)", "country": "Iraq", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 34, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine aircraft departed Baghdad Airport on a support mission, carrying 32 passengers and a crew of six. Sixty seconds after takeoff, while climbing to a height of 313 feet and at a speed of 163 knots, the airplane's defensive system activated. The pilot reacted in accordance with applicable directives and after reacting to the defensive alert, the crew realized that all three engines n°1, 3 and 4 lost 60% of power. The crew attempted an emergency landing in an open field located 7,5 km north of the airport. The aircraft was damaged beyond repair and all 38 occupants escaped uninjured. U.S. Air Force Maintenance and Explosive Ordnance Disposal personnel from the 447th Air Expeditionary Group were called in. They placed explosive charges on the plane and blew up the Hercules on July 7.", "probable_cause": "The Board President could not find clear and convincing evidence to determine the exact cause of the engine power loss. He did find evidence to conclude that several factors combined to significantly contribute to the Mishap Airplane (MA) landing partially gear down. Specifically, a defensive system alert, the aircraft's low altitude and airspeed at the time of the malfunction, and the decision to respond to the alert at low altitude and airspeed combined to result in the MA landing partially gear down. All MA systems and performance were normal prior to the defensive system alert. An undetermined malfunction occurred during the defensive reaction that caused three of the MA's four engines to stabilize at an RPM (60%) which was not sufficient to maintain flight and the low altitude and airspeed at the time of the malfunction limited the time available for situation analysis and recovery. The Mishap Crew (MC) had never been exposed to a loss of three or four engines on takeoff in the C-130H2 simulator which resulted in an emergency situation the MC had not seen before at a low altitude and airspeed. Checklist actions taken by the MC did not recover the engines and the Mishap Pilot (MP) appropriately performed a limited power, controlled descent, and forced landing resulting in only minor injuries."}