{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226at-merlin-iv-manchester-1-killed", "date": "Dec 10, 2021 at 2330 LT", "type": "Swearingen SA226AT Merlin IV", "operator": "Castle%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Fairfield – Manchester", "msn": "AT-34", "yom": 1975, "flight_number": "CSJ921", "city": "Manchester", "zone": "New Hampshire", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On December 10, 2021, about 2330 eastern standard time, a Swearingen SA-226AT, N54GP, was destroyed when it was involved in an accident near Bedford, New Hampshire. The commercial pilot was fatally injured. The airplane was operated as a Title 14 Code of Federal Regulations Part 135 ondemand cargo flight. According to preliminary information from the Federal Aviation Administration, the airplane was on the instrument landing system approach to runway 6 at Manchester Boston Regional Airport (MHT), Manchester, New Hampshire. During the approach, the pilot reported an engine failure at 2330:42 but did not specify which engine. Radio and radar contact were lost at 2330:51, when the airplane was about 1/4 mile from the runway. The wreckage was located on a river sand jetty, oriented north, and a postcrash fire consumed the cockpit, cabin, and both wings. No debris path was observed. A crater about 6 ft long, 3 ft wide, and 2 ft deep was observed at the beginning of the sand jetty. The left aileron was recovered in the water near the crater. The empennage was located just beyond the crater. The empennage remained intact, with the elevator and rudder attached and undamaged except for the right elevator tip. The right wingtip was located near the empennage and an outboard left-wing section was located 60 ft left of the main wreckage. Three landing gear were located near the main wreckage and the radome was located at the end of the sand jetty, in water. Elevator control continuity was confirmed from the elevator to the cockpit area. Rudder control continuity was confirmed from the rudder to the cabin area. No aileron cables were identified. The left engine was located in the main wreckage. The left propeller had separated and was partially embedded in mud to the left of the left engine. All three blades remained attached to the hub and did not exhibit rotational damage. The right engine was located forward and left of the main wreckage. The right propeller remained attached to the right engine and all three propeller blade roots remained attached to the hub and were charred. The right propeller blades appeared to be at or near the feathered position. Both engines and propellers were retained for further examination. A copy of residential security camera video which recorded a portion of the airplane’s approach was obtained for further examination.", "probable_cause": null}