{"url": "https://www.baaa-acro.com/crash/crash-douglas-digby-i-gander-6-killed", "date": "Jul 26, 1941 at 0040 LT", "type": "Douglas B-18 Bolo", "operator": "Royal-Canadian-Air-Force-31", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Gander - Gander", "msn": "1634", "yom": 1936, "flight_number": null, "city": "Gander", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 630, "captain_hours_type": 300, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 1856 GMT on 24 July 1941, RCAF Douglas Digby 742 left Gander with a crew of six for the purpose of convoy patrols. At 2320 GMT the weather began to deteriorate and the Meteorological Office predicted that the ceiling would remain at about 1500 feet with showers. At 2326 GMT the aircraft was recalled, but Digby 742 did not immediately respond. The recall notice was repeated four times by Gander Station and twice by RCAF Station, Sydney. The recall was acknowledged at 0030 GMT and at 0151 GMT the aircraft was in range of the Gander airbase. Digby 742 was spotted by Airport Control, but the aircraft reported that it could not see the airport. By this time, the ceiling had deteriorated to 200 feet with rain and increased wind and the cloud had begun to blow across the runway. When Digby 742 arrived, RCAF Digby 756 was attempting to land at Gander and Digby 742 was instructed to circle until Digby 756 had landed. Digby 756 landed safely at 0219 GMT but for approximately the next twenty minutes, Digby 742 was out of communication range. Captain Tomsett was instructed to proceed to Dartmouth where the weather conditions were more favourable but the Captain stated that he would attempt to land at Gander one final time and would proceed to Dartmouth if that landing was unsuccessful. At 0310 GMT a loud explosion was heard and there was no further communication with the aircraft. At 0330 GMT, the ceiling began to steadily rise becoming 1400 feet by 0530 GMT.\r\nCrew:\r\nF/Lt Martin Edward Tomsett, pilot, \r\nP/O William Hume Mather, pilot, \r\nP/O Allan Gower Pratt, navigator,\r\nCpl Thomas James Larmour Crawford, wireless operator, \r\nSgt Mervyn Samuel Hunt, air gunner, \r\nSgt Ronald Laird McDavid, air gunner.\r\nSource & photo: \r\nhttp://www.planecrashgirl.ca/2016/02/19/rcaf-digby-742/", "probable_cause": "Although weather conditions had deteriorated, at this time there were no regulations for minimum ceiling. The conditions that were present at the time of the crash were poor and landing should only have been attempted by an experience pilot. As a result of this crash, recommendations were made to the RCAF to put in place regulations for landing in poor conditions based on the time of day (day or night flying) and the experience of the pilot; an experienced pilot is considered to have completed at least 300 hours of flying on that specific type of aircraft. The determination that weather conditions are poor would be based on the ceiling level and at the discretion of the Aerodrome Control Officer."}