{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31p-425-pressurized-navajo-oxford-2-killed", "date": "Jan 15, 2010 at 1407 LT", "type": "Piper PA-31-310 Navajo", "operator": "Southern%20Aircraft%20Consultancy_0", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Oxford - Oxford", "msn": "31-7400221", "yom": 1974, "flight_number": null, "city": "Oxford-Kidlington", "zone": "Oxfordshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 12500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft had recently been purchased in Germany and was flown to the United Kingdom on 11 December 2009 by the pilot of the accident flight. The new owner, who accompanied him for the flight from Germany, was  a private pilot himself and was the passenger in the accident. The aircraft landed at Oxford on the evening of 11 December. The pilot reported to a maintenance organisation that there had been a problem with the brakes after landing and the aircraft was left parked outside a hangar. Minor maintenance was carried out on 20 December 2009 and on 9 January 2010 the aircraft was refuelled, but it was not flown again until the accident flight. On the morning of 15 January 2010 the pilot and his passenger met at Oxford Airport and prepared the aircraft for flight. The plan was to carry out an air test, although its exact nature was not established. The flight was pre‑notified to Royal Air Force (RAF) Brize Norton as an air test with a requested level of FL190. At 1344 hrs the aircraft taxied out to Holding Point C for Runway 19 at Oxford. The pilot reported ‘READY FOR DEPARTURE’ at 1400 hrs and was given a clearance for a right turn after takeoff with a climb initially to FL80. The pilot then requested the latest weather information and the tower controller provided the following information: ‘........TWO THOUSAND METRES IN MIST AND CLOUD IS BROKEN AT 200 FEET.’ At 1403 hrs the takeoff commenced and shortly after liftoff Oxford ATC suggested that the pilot should contact Brize Radar on 124.275 Megahertz (MHz). The pilot made contact with Brize Radar at 1404 hrs, two-way communication was established and the provision of a Deconfliction Service was agreed. On the radar screen the Brize Norton controller observed the ‘Mode C’ (altitude) return increase to around 1,500 ft and then noticed it decrease, seeing returns of 1,300 ft and 900 ft, before the secondary return disappeared. At 1406 hrs the Brize Norton controller contacted Oxford ATC to ask if the aircraft had landed back there and was advised that it had not done so, but that it could be heard overhead. The Brize Norton controller told Oxford ATC that they had a continuing contact, but no Secondary Surveillance Radar (SSR). The Oxford controller could still hear an aircraft in the vicinity and agreed with the Brize Norton controller to attempt to make contact. At 1407 hrs Oxford ATC made several calls to the aircraft but there was no reply. The Oxford controller told the Brize Norton controller there was  no reply and was informed in return that there was no longer any radar contact either. The Brize Norton controller also attempted to call the aircraft at 1407 hrs but without success. At 1410 hrs the Oxford controller advised the Brize Norton controller that there was smoke visible to the west of the airfield and they would alert both the airport and local emergency services. In the meantime several witnesses saw the aircraft crash into a field to the west of Oxford Airport. A severe fire started soon afterwards and bystanders who arrived at the scene were not able to get close to the aircraft. The local emergency services were notified of the accident by witnesses at 1407 hrs.", "probable_cause": "The post-mortem examination showed that the pilot had severe coronary heart disease and there was evidence to suggest that he may have been incapacitated, or died, prior to the collision with the ground. The passenger was a qualified private pilot but was not experienced with either the aircraft or flight in IMC."}