{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-arlington-2-killed", "date": "Feb 23, 2004 at 0849 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Robert M. Compton", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Panama City – Tulsa", "msn": "46-08028", "yom": 1986, "flight_number": null, "city": "Arlington", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5021, "captain_hours_type": 884, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2155, "circumstances": "The pilot received a preflight briefing from the Gainesville Automated Flight Service Station before departing on the instrument flight. The briefer advised the pilot of the potential for occasional moderate turbulence between 24,000 and 37,000 feet and on the current Convective SIGMET for embedded thunderstorms over southern Mississippi. The flight was in cruise flight at 24, 000 feet when the airplane encountered moderate to severe turbulence and heavy rain. The airplane descended from 24,000 feet to 3,100 feet in a descending right turn in 2 minutes and 10 seconds before radar contact was lost. The airplane was located 8 hours 26 minutes after the accident along a crash debris line that extended between 1.31 miles and 1.53 miles northwest of Arlington, Alabama. Airframe components recovered from the accident site were submitted to the NTSB Materials laboratory for examination. The examinations revealed all failures were consistent with overstress fracturing and there was no evidence of pre-existing conditions or fatigue damage. Examination of the airframe revealed that the airframe design limits were exceeded. The Pilot's Operating Handbook states the maximum structural cruising speed is 173 knots indicated airspeed or 170 knots calibrated airspeed. The co-pilot airspeed indicator at the crash site indicated 180 knots calibrated airspeed. The design maneuvering speed is 135 knots indicated airspeed or 133 knots calibrated airspeed. ", "probable_cause": "The pilots inadequate in-flight planning/decision and his failure to maintain aircraft control, resulting in an in-flight encounter with a thunderstorm and exceeding the design limits of the aircraft."}