{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-palwaukee", "date": "Aug 5, 2005 at 1225 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Golden Eagle Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Palwaukee - Mackinac Island", "msn": "421C-0028", "yom": 1976, "flight_number": null, "city": "Chicago-Executive (Palwaukee)", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 728, "captain_hours_type": 28, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6835, "circumstances": "The twin-engine airplane sustained substantial damage when it impacted the top of a single story industrial building and then impacted a landscape embankment and trees during an attempted single-engine go-around. The pilot reported that the left engine failed during initial climb. He feathered the left propeller and returned to the airport to execute an emergency landing. The pilot reported that he had \"excessive speed\" on final approach and \"overshot the runway.\" When the airplane was at mid-field, the pilot elected to do a go-around. He did not raise the landing gear and the flaps remained about 15-degrees down. The airplane lost altitude and impacted the terrain about .5 miles from the airport. A witness reported seeing the airplane attempt to land on the runway twice during the same approach, but ballooned both times before executing the go-around. The Pilot's Operating Handbook (POH) \"Rate-of-Climb One Engine Inoperative\" chart indicated that about a 450-foot rate-of-climb was possible during the single-engine go-around if the airplane was in a clean configuration. The chart also indicated that a 350-foot penalty would be subtracted from the rate-of-climb if the landing gear were in the DOWN position, and additionally, a 200-foot penalty would be subtracted from the rate-of-climb if the flaps were in the 15-degree DOWN position. Inspection of the left engine revealed that the starter adapter shaft gear had failed. Inspection of the engine maintenance logbooks revealed that the Teledyne Continental Motors Service Bulletin CSB94-4, and subsequent revisions including the Mandatory Service Bulletin MSB94- 4F, issued on July 5, 2005, had not been complied with since the last engine overhaul on July 17, 1998. The service bulletin required a visual inspection of the starter adapter every 400 hours. The engine logbook indicated that the engine had accumulated about 1,270 hours since the last overhaul. The service bulletin contained a WARNING that stated, \"Compliance with this bulletin is required to prevent possible failure of the starter adapter shaft gear and/or crankshaft gear which can result in metal contamination and/or engine failure.\"", "probable_cause": "The pilot's improper in-flight decision to execute a go-around without raising the landing gear and raising the flaps to the full UP position, resulting in low airspeed and the airplane stalling.  Contributing factors to the accident included the pilot's failure to comply with the manufacturer's mandatory service bulletin and the failure of the starter adapter shaft gear which resulted in the loss of power to the left engine, and the collision with the building. "}