{"url": "https://www.baaa-acro.com/crash/crash-bae-146-300-yinchuan-55-killed", "date": "Jul 23, 1993 at 1441 LT", "type": "BAe 146", "operator": "China%20Northwest%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yinchuan - Beijing", "msn": "E3215", "yom": 1992, "flight_number": "WH2119", "city": "Yinchuan", "zone": "Ningxia Hui", "country": "China", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 1, "pax_on_board": 108, "pax_fatalities": 54, "other_fatalities": 0, "total_fatalities": 55, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During the takeoff roll on runway 36 at Yinchuan Airport, at Vr speed, the pilot-in-command pull up the control column to rotate but the aircraft failed to respond. Following a lack of crew coordination and inappropriate decisions, the crew failed to abort the takeoff procedure. After a long roll, the nose gear lifted off but the aircraft entered a high nose attitude, causing the tail to struck the runway surface. The aircraft then overran runway 36, collided with various obstacles and eventually crashed in a lake. 58 occupants were injured while 55 others were killed, among them one crew member. Weather conditions were good with OAT +27° C and an excellent visibility. Runway 36 is 2,160 metres long. ", "probable_cause": "It was determined that the accident was the consequence of a wrong takeoff configuration on part of the crew. For unknown reasons, both leading edge and trailing edge flaps were not properly deployed for the takeoff procedure. Due to lack of coordination, the crew failed to proceed to cross checks prior to departure and failed to realize that the aircraft was not properly configured for takeoff. Nevertheless, it was not established if the flaps warning sounded or not prior to the accident."}