{"url": "https://www.baaa-acro.com/crash/crash-casa-nurtanio-cn-235-200-iptn-malaga-4-killed", "date": "Aug 29, 2001 at 1016 LT", "type": "Casa-Nurtanio CN-235 (IPTN)", "operator": "Binter%20Mediterraneo", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Melilla – Málaga", "msn": "C-033", "yom": 1990, "flight_number": "AX8261", "city": "Málaga", "zone": "Andalusia", "country": "Spain", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 44, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 7372, "captain_hours_type": 4166, "copilot_hours": 8485, "copilot_hours_type": 4885, "aircraft_hours": 14577, "circumstances": "Following an uneventful flight from Melilla, the crew was cleared to descend to Málaga-Pablo Ruiz Picasso Airport. On final approach to runway 32, the crew encountered an unexpected situation when the engine fire warning light came on in the cockpit panel, indicating a fire on the left engine. The copilot informed ATC and after he declared an emergency, was cleared to land on runway 32. On short final, both engines stopped. The aircraft stalled and crashed 538 metres short of runway threshold and came to rest against the embankment of a motorway. The captain and three passengers were killed while all other occupants were injured, some of them seriously. The aircraft was destroyed. ", "probable_cause": "It is considered that the cause of the accident was the incorrect execution, by the crew, of the emergency procedure of fire or serious damage to an engine contained in the Flight Operations Manual that was on board the aircraft, causing the consecutive shutdown of both engines with the consequent total loss of thrust, so that the progression of the flight was impeded. The activation of the emergency procedure occurred as a consequence of a left engine fire warning which turned out to be false. The appearance of the false fire warning could be caused by the presence of moisture and/or dirt in the connectors of the fire detector circuit. It is considered that a contributing factor to these circumstances could be the definition of maintenance tasks for that system in the Aircraft Maintenance Manual, which was not compliant to the methods recommended by the manufacturer of the fire detection system to avoid the existence of humidity in the installation. As factors that could have contributed to the incorrect performance of the crew during the application of the emergency procedure, the following are considered:\r\n- A lack of coordination in the piloting tasks, carried out in the absence of 'Crew Resource Management\" criteria.\r\n- Insufficient training for the cockpit change received by the copilot, which did not include simulator training for the application of emergency procedures."}