{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-347-wamena", "date": "Sep 13, 2016 at 0733 LT", "type": "Boeing 737-300", "operator": "Trigana%20Air2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jayapura – Wamena", "msn": "23597/1287", "yom": 1986, "flight_number": "TGN7321", "city": "Wamena", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 23823, "captain_hours_type": 9627, "copilot_hours": 650, "copilot_hours_type": 480, "aircraft_hours": 59420, "circumstances": "On 13 September 2016, a Boeing 737-300 Freighter, registered PK-YSY was being operated by PT. Trigana Air Service on a scheduled cargo flight from Sentani Airport, Jayapura (WAJJ) to Wamena Airport, Wamena (WAVV), Papua, Indonesia. Approximately 2130 UTC, during the flight preparation, the pilot received weather information which stated that on the right base runway 15 of Wamena Airport, on the area of Mount Pikei, low cloud was observed with the cloud base was increasing from 200 to 1000 feet and the visibility was 3 km. At 2145 UTC, the aircraft departed Sentani Airport with flight number IL 7321 and cruised at altitude 18,000 feet. On board the aircraft was two pilots and one Flight Operation Officer (FOO) acted as loadmaster. The aircraft carried 14,913 kg of cargo. The Pilot in Command (PIC) acted as Pilot Flying (PF) while the Second in Command (SIC) acted as Pilot Monitoring (PM). There was no reported or recorded aircraft system abnormality during the flight until the time of occurrence. After passing point MALIO, the aircraft started to descend. The pilot observed the weather met the criteria of Visual Meteorological Condition (VMC). The pilots able to identify another Trigana flight from Sentani to Wamena in front of them. While passing altitude 13,500 feet, approximately over PASS VALLEY, the Wamena Tower controller instructed the pilot to report position over JIWIKA. When the aircraft position was over point JIWIKA, the Wamena Tower controller informed to the pilot that the flight was on sequence number three for landing and instructed the pilot to make orbit over point X, which located at 8 Nm from runway 15. The pilot made two orbits over Point X to make adequate separation with the aircraft ahead prior to received approach clearance. About 7,000 feet (about 2,000 feet above airport elevation), the pilot could not identify visual checkpoint mount PIKEI and attempted to identify a church which was a check point of right base runway 15. The pilot felt that the aircraft position was on right side of runway centerline. About 6,200 feet (about 1,000 feet above airport elevation), the PF reduced the rate of descend and continued the approach. The PM informed to the PF that runway was not in sight and advised to go around. The PF was confident that the aircraft could be landed safely as the aircraft ahead had landed. Approximately 5,600 feet altitude (about 500 feet above airport elevation) and about 2 Nm from runway threshold the PF was able to see the runway and increased the rate of descend. The pilot noticed that the Enhanced Ground Proximity Warning  System (EGPWS) aural warning “SINK RATE” active and the PF reduced the rate of descend. While the aircraft passing threshold, the pilot felt the aircraft sunk and touched down at approximately 125 meters from the beginning runway 15. The Flight Data Recorder recorded the vertical acceleration was 3.25 g on touchdown at 2230 UTC. Both of main landings gear collapsed. The left main landing gear detached and found on runway. The engine and lower fuselage contacted to the runway surface. The aircraft veer to the right and stopped approximately 1,890 meters from the beginning of the runway 15. No one was injured on this occurrence and the aircraft had substantially damage. Both pilots and the load master evacuated the aircraft via the forward left main cargo door used a rope.", "probable_cause": "Refer to the previous aircraft that was landed safely, the pilot confidence that a safe landing could be made and disregarding several conditions required for go around. "}