{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-325-navajo-cr-palm-beach-2-killed", "date": "Jun 24, 1994 at 0905 LT", "type": "Piper PA-31-310 Navajo", "operator": "Roscoe M. Thorne", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Palm Beach - Palm Beach", "msn": "31-7912031", "yom": 1979, "flight_number": null, "city": "Palm Beach County Park-Lantana", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1000, "captain_hours_type": 3, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane was observed to rotate about 3,217 feet down the 3,746-feet runway. One or both engines were heard running rough. The airplane climbed to about 300 feet agl, banked left, pitched nose down and impacted the ground. During the investigation, the left engine operated to full rated rpm after replacement of the damaged ignition harness, adjustment of the turbocharger density controller, and adjustment of the magneto-to-engine timing. The right engine also operated normally after replacement of the magneto, ignition harness, and engine-driven fuel pump. The density controller required adjustment to obtain full rated rpm. The #3 cylinder fuel injector nozzle was also partially blocked by contaminant. The right engine magneto contact assemblies operationally checked ok. The capacitors were heat damaged. Right engine magneto-to-engine timing and internal timing of the magneto were not determined. Pilot's toxicological results were positive for butalbital (1.768 ug/ml blood, 0.553 ug/ml urine), and also positive for acetaminophen and salicylate (aspirin) in urine. Butalbital is a prescription medication (barbiturate) not approved for flying. Both occupants were killed. ", "probable_cause": "The pilot's impairment of judgment and performance due to drugs, his failure to abort the takeoff after experiencing reduced takeoff performance, and his failure to maintain minimum control speed. Factors in the accident were: a partial loss of engine power due to improper magneto-to-engine timing, and a partially blocked fuel nozzle."}