{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-277b-near-burbank-24-killed", "date": "Jan 10, 1945 at 0410 LT", "type": "Douglas DC-3", "operator": "American-Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "New York – Washington DC – Cincinnati – Memphis – Dallas – El Paso – Phoenix – Burbank", "msn": "2215", "yom": 1940, "flight_number": "AA6001", "city": "Burbank", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 21, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": 6315, "captain_hours_type": 4660, "copilot_hours": 2113, "copilot_hours_type": 1792, "aircraft_hours": 14888, "circumstances": "Following an uneventful flight from El Paso, the crew started the approach to Burbank-Hollywood-Lockheed Air Terminal by night. Due to low visibility caused by poor weather conditions, the pilot was unable to localize the airport and decided to proceed to the alternate airfield, Palmdale. Few minutes later, as it was flying at a too low altitude, the aircraft hit tree tops and crashed on the slope of a wooded area located in the Verdigo mountains, some 4 miles northeast of the Burbank Airport. All 24 occupants were killed. ", "probable_cause": "The possibility of an accident became a potentiality when the company ground personnel failed to obtain and transmit important weather to the pilot. Failure to obtain and transmit this information to the pilot constitutes negligence on the part of the company. This, however, did not relieve the pilot of his responsibility to conduct a safe flight although it did place him in a disadvantageous position. Had no properly execution the \"missed-approach\" procedure it is unlikely that the accident would have occurred. The Board, therefore, determines that the probable cause of this accident was \"the pilot's attempt to use the standard 'missed-approach' procedure after having followed another course up to a point there it was impossible to apply this procedure safely.\""}