{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-hilton-head-2-killed", "date": "Aug 31, 2003 at 1529 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Hickory Travel", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Hilton Head – Myrtle Beach", "msn": "46-8608001", "yom": 1986, "flight_number": null, "city": "Hilton Head", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2536, "captain_hours_type": 186, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2676, "circumstances": "The airplane was returning to the airport for landing. A witness reported it was flying erratically streaming a whitish \"vapor trail\" from the left wing. Another witness reported the airplane banked abruptly into a steep turn to the left, the nose pitched up, and the airplane sank from view behind the trees. The witness then heard a crash and saw smoke. Examination revealed no evidence of flight control, engine, or propeller malfunction. The left inboard fuel cap was absent from the filler port, and a ground search found the left inboard fuel cap in the grass beside the runway. The JetProp LLC, JetProp DLX Supplemental Flight Manual, Section 4, Normal Procedures Checklist, states, \"Left Wing 4.9e, ... Inboard Fuel Tank ... CHECK Supply Visually & SECURE CAP ...\" Examination of the JetProp LLC, JetProp DLX Supplemental Flight Manual and the Piper Malibu PA-46-310P Information Manual revealed the following instructions on how to secure the fuel caps: \"Replace cap securely.\" There was no evidence of mechanical malfunction with the fuel cap or the filler port.", "probable_cause": "The pilot's failure to maintain control of the airplane during a VFR pattern for a precautionary landing, which resulted in an uncontrolled descent and subsequent collision with terrain. Also causal was the pilot's inadequate preflight inspection of the aircraft, which resulted in his failure to secure the fuel cap."}