{"url": "https://www.baaa-acro.com/crash/crash-yakovlev-yak-40-tashkent-37-killed", "date": "Jan 13, 2004 at 1927 LT", "type": "Yakovlev Yak-40", "operator": "Uzbekistan%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Termez - Tashkent", "msn": "9 54 08 44", "yom": 1975, "flight_number": "UZB1154", "city": "Tashkent-Yuzhny", "zone": "Tashkent Province (Toshkent viloyati)", "country": "Uzbekistan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 32, "pax_fatalities": 32, "other_fatalities": 0, "total_fatalities": 37, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 37000, "circumstances": "Following an uneventful flight from Termez, the crew started the descent to Tashkent-Yuzhny Airport by night and marginal weather conditions. The visibility was limited due to foggy conditions with an RVR between 600 and 900 metres for runway 08L. The captain continued the approach with an excessive rate of descent, causing the aircraft to pass below the MDA without any visual contact with the ground. At an altitude of 165-170 metres, the captain positioned the airplane in a flat attitude then continued the descent at a distance of 2 km from the runway threshold, but this time with an insufficient rate of descent. The aircraft passed over the runway threshold at a height of about 30-40 metres and flew over the runway for a distance of 3,3 km. The captain established a visual contact with the runway lights, elected to land but failed to realize he was in fact approaching the end of the runway which is 4 km long. He reduced both engines power to idle, activated the thrust reversers when he realized his mistake and attempted a go-around. The aircraft collided with a 2 metres high concrete wall located 260 metres past the runway end, lost its right wing and crashed in a drainage ditch located along the perimeter fence, bursting into flames. The aircraft was totally destroyed and all 37 occupants were killed, among them Richard Conroy, special UNO representative in Uzbekistan. ", "probable_cause": "The following factors were identified:\r\n- The crew failed to maintain a correct approach pattern maybe following a wrong setting of the approach selector in SP mode instead of ILS mode, \r\n- The crew decided to continue the approach without establishing any visual contact with the approach light and runway light system,\r\n- The crew failed to comply with published procedures, \r\n- The crew failed to initiate a go-around procedure. "}