{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61p-aerostar-ted-smith-aerostar-601-mount-storm", "date": "Jan 27, 1996 at 0120 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Grand%20Aire_0", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Grand Rapids – Norfolk", "msn": "61-0050-095", "yom": 1970, "flight_number": null, "city": "Mount Storm", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4048, "captain_hours_type": 70, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5791, "circumstances": "The pilot stated that the airplane was in cruise flight at 8,000 feet MSL, when the right engine lost power. He advised ATC of the loss of power and received radar vectors toward an airport. The pilot said he maintained the best single-engine rate-of-climb speed, but the airplane's altitude 'drifted down.' When the airplane entered clouds, it began to accumulate structural icing and would not maintain sufficient altitude. The airplane impacted mountainous terrain about 16 miles northwest of the airport. The pilot stated that he had departed on the cargo flight with 5 hours of fuel on board for what he estimated to be a 2 1/2 hour flight. Also, he reported that conditions were dark and foggy, when the accident occurred. Postaccident examination of the engines and their systems revealed no evidence of preimpact mechanical malfunction. Examination of the airplane wreckage revealed no evidence of preimpact failure of the airframe or its systems. During a  postaccident engine test run, the right engine started normally and operated satisfactorily.", "probable_cause": "Loss of power in the right engine for undetermined reason(s), and the accumulation of structural ice on the airplane, which resulted in an increased rate of descent and a subsequent forced landing before the pilot could reach an alternate airport. Factors relating to the accident were: the adverse weather (icing) conditions, darkness, fog, and the lack of suitable terrain in the emergency landing area. "}