{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-61-jeddah-261-killed", "date": "Jul 11, 1991 at 0838 LT", "type": "Douglas DC-8", "operator": "Nigeria%20Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Jeddah - Sokoto", "msn": "45982", "yom": 1968, "flight_number": "WT2120", "city": "Jeddah-King Abdulaziz", "zone": "Makkah l-Mukarramah (مكة المكرمة)", "country": "Saudi Arabia", "region": "Asia", "crew_on_board": 14, "crew_fatalities": 14, "pax_on_board": 247, "pax_fatalities": 247, "other_fatalities": 0, "total_fatalities": 261, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 49318, "circumstances": "A McDonnell Douglas DC-8-61 passenger plane, registered C-GMXQ was destroyed in an accident near Jeddah-King Abdulaziz International Airport (JED), Saudi Arabia. All 261 on board were killed. The DC-8 jetliner was owned by Canadian airline Nationair which operated the plane on behalf of Nigeria Airways to fly hajj pilgrims between Nigeria and Saudi Arabia. Nigeria Airways flight 2120 took off from Jeddah's runway 34L at 08:28, bound for Sokoto (SKO), Nigeria. About 15 seconds after brake release an oscillating sound was heard in the cockpit. Within two seconds, the flight engineer said: \"What's that?\" The first officer replied: \"We gotta flat tire, you figure?\" Two seconds later, an oscillating sound was again heard. The captain asked the first officer: \"You're not leaning on the brakes, eh?\" The first officer responded: \"No, I 'm not, I got my feet on the bottom of the rudder.\" By this time, the aircraft had accelerated to about 80 knots. Marks on the runway showed that the No.1 wheel started to break up at about this time. In addition, the left and right flanges of No.2 wheel began to trace on the runway; rubber deposit from No.2 tire continued which appeared to be from a deflated tire between the flanges. At 28 seconds after brake release, a speed of 90 knots was called by the captain and acknowledged by the first officer. The captain called V1 about 45 seconds after brake release. Two seconds later, the first officer noted \"sort of a shimmy like if you're riding on one of those ah thingamajigs.\" The captain called \"rotate\" 51 seconds after brake release and the airplane lifted off the runway. Witnesses noticed flames in the area of the left main landing gear. The flames disappeared when the undercarriage was retracted. During the next three minutes several indications of system anomalies occurred, which included a pressurization system failure, a gear unsafe light and a loss of hydraulics. The captain requested a level-off at 2000 feet because of the pressurization problem. In his radio call the captain used the callsign \"Nationair 2120\" instead of \"Nigerian 2120\" and the controller mistook the transmission to be from a Saudi flight returning to Jeddah and cleared The Jeddah bound aircraft to 3000 feet. The captain of the accident aircraft, however, acknowledged the ATC transmission without a call sign, saying \"understand you want us up to 3000 feet.\" This misunderstanding continued for the next three minutes with ATC assuming that all calls were from the Saudi flight, not from the accident aircraft. About four minutes after brake release the captain called ATC and reported that the aircraft was leveling at 3000 feet. The first officer then interrupted with \" ... declaring an emergency. We 're declaring an emergency at this time. We believe we have ah, blown tires.\" As the aircraft continued on the downwind heading, a flight attendant came into the cockpit and reported \"smoke in the back ... real bad.\" A few moments later, the first officer said \"I've got no ailerons.\" The captain responded: \"OK, hang on, I've got it.\" It was the last record on the CVR, which failed (along with the flight data recorder [FDR]) at 08:33:33. The ATC controller gave a heading to intercept the final approach and thereafter continued to give heading information. Meanwhile, during the downwind and base legs, the fire had consumed the cabin floor above the wheel wells , permitting cabin furnishing to sag into the wheel wells. When the gear was probably extended at 11 miles on the final approach, the first body fell out because fire had burned through the seat harness. Subsequently, with the gear down and a forceful air supply through the open gear doors, rapid destruction of more floor structure permitted the loss of more bodies and seat assemblies. Despite the considerable destruction to the airframe, the aircraft appeared to be controllable. Eight minutes after brake release and 10 miles from the runway, the captain declared an emergency for the third time, saying, \"Nigeria 2120 declaring an emergency, we are on fire, we are on fire, we are returning to base immediately.\" The aircraft came in nose down and crashed 9,433 feet (2,875 meters) short of the runway at 08:38.", "probable_cause": "The following findings were reported:\r\n1. The organisational structure for the deployment team was ill-defined and fragmented.\r\n2. Deployment maintenance personnel were not qualified or authorised to perform the function of releasing the aircraft as being fit to fly.\r\n3. The release of the aircraft as being fit to fly was delegated to non-practising Aircraft Maintenance Engineers whose primary function was to operate the aircraft as flight crew members.\r\n4. The aircraft was signed-off as fit for flight, in an unairworthy condition, by the operating flight engineer who had no involvement in the aircraft servicing.\r\n5. The #2 and #4 tyre pressures were below the minimum for flight dispatch. Other tyres may also have been below minimum pressures.\r\n6. Maintenance personnel were aware of the low tyre pressures but failed to rectify the faults.\r\n7. The mechanic altered the only record of the actual low pressures, measured by the avionics specialist on 7 July, four days before the accident.\r\n8. There was no evidence that the tyre pressures had been checked, using a tyre pressure gauge, after 7 July.\r\n9. The lead mechanic was aware of the low tyre pressures.\r\n10. The persons who were aware of the low pressures had insufficient knowledge of the hazards of operating at low tyre pressures.\r\n11. The project manager was aware of a low tyre pressure but was not qualified to assess its importance.\r\n12. The project manager was responsible for the aircraft schedule and directed that the aircraft depart without servicing the tyre.\r\n13. The lead mechanic who was aware of the requirement for, and had requested nitrogen for tyre servicing, did not countermand the decision of the project manager.\r\n14. There was no evidence to indicate that this flight crew were ever informed of the low tyre pressures.\r\n15. The aircraft departed the ramp in an unairworthy condition.\r\n16. During the taxi from the ramp to the runway, the transfer of the load from the under-inflated #2 tyre to #1 tyre on the same axle, resulted in over deflection, over-heating and structural weakening of the #1 tyre.\r\n17. The #1 tyre failed very early on the take-off roll due to degeneration of the structure, caused by over-deflection.\r\n18. The #2 tyre failed almost immediately after #1 due to over-deflection and rapid overheating when the load was transferred from the #1 tyre.\r\n19. The #2 wheel stopped rotating for reasons not established. Friction between the wheel/brake assembly and the runway generated sufficient heat to raise the temperature of tyre remnants above that required for a tyre fire to be self-sustaining. Rubber remnants ignited during the take-off roll.\r\n20. Numbers 1 and 2 wheels were severely damaged and at least one piece of #1 wheel rim struck the airframe, becoming embedded in the left flap.\r\n21. The crew were aware of unusual symptoms early and throughout the takeoff roll; the captain continued the take-off.\r\n22. The aircraft was not equipped with warning systems which would have provided the flight crew with adequate information on which to make a decision to reject the take-off after tyre(s) failure.\r\n23. The captain did not receive sufficient cues to convince him that a rejected take-off was warranted.\r\n24. The crew retracted the gear, consistent with company procedures, and burning rubber was brought into close proximity with hydraulic and electrical system components.\r\n25. The evidence indicates that the wheel well fire involved tyres, hydraulic fluid, magnesium alloy and fuel. The fuel was probably introduced as a result of \"burn through\" of the centre fuel tank.\r\n26. Fire within the wheel wells spread and intensified until the cabin floor was breached and control systems were disabled.\r\n27. The fuel increased the intensity of the fire until, shortly before impact, airframe structural integrity was lost.\r\n28. Tyre characteristics and performance are not adequately addressed during training and licensing of both flight crews and technical personnel.\r\n29. The aircraft operator's tyre inflation pressures did not accurately reflect what was contained in the aircraft manufacturer's maintenance manual.\r\n30. The operator's maintenance and operating documentation for the DC-8 does not contain adequate information for the proper maintenance and operation of aircraft tyres."}