{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-15-sioux-city", "date": "Dec 27, 1968 at 0711 LT", "type": "Douglas DC-9", "operator": "Ozark%20Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sioux Falls – Sioux City – Chicago", "msn": "47034/162", "yom": 1967, "flight_number": "OZ982", "city": "Sioux City", "zone": "Iowa", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 64, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 19146, "captain_hours_type": 63, "copilot_hours": 6048, "copilot_hours_type": 20, "aircraft_hours": 3458, "circumstances": "At approximately 0711LT, the aircraft crashed while taking off from the Sioux City Airport, Iowa. There were no fatalities. Among the 64 passengers and four crewmembers, 10 passengers were hospitalized with minor injuries and three crew members received serious injuries. The aircraft was destroyed in the crash. There was no fire. Flight 982 began its takeoff on Runway 35 with the flight crew aware that ice was present on the wings. The aircraft lifted off and the landing gear was selected to the up position by the first officer. The captain began turning off the landing and taxi lights. As the landing gear began to retract, the aircraft rolled abruptly and violently to the right to an angle of bank estimated by the flight crew to have reached 900. The captain applied additional power and left rudder in an attempt to level the wings. When no immediate response was noted, he then applied left aileron. With the application of left aileron, the right wing came up; however, the roll continued to the left until the left wing contacted the runway. At this point, the captain discontinued the takeoff. He approximately 110 feet beyond the departure threshold of Runway 35. succeeded in leveling the wings prior to final ground contact, The aircraft came to rest in a grove of trees approximately 1,181 feet beyond the departure end of Runway 35.", "probable_cause": "A stall near the upper limits of ground effect, with subsequent loss of control as a result of aerodynamic and weight penalties of airfoil icing. The flight crew failed to have the airfoil ice removed prior to the attempted take-off from Sioux City. The Board also finds that the crew selected an improper takeoff thrust for the existing gross weight condition of the aircraft."}