{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-shaver-lake-2-killed", "date": "Nov 10, 2012 at 1920 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Scott H. Clarke", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Salinas - Omaha", "msn": "421C-1010", "yom": 1980, "flight_number": null, "city": "Shaver Lake", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 637, "captain_hours_type": 102, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5118, "circumstances": "The aircraft impacted terrain following an in-flight breakup near Shaver Lake, California. The private pilot/registered owner was operating the airplane under the provisions of 14 Code of Federal Regulations Part 91. The pilot and passenger sustained fatal injuries. The airplane sustained substantial damage during the accident sequence, and was partially consumed by postimpact fire. The cross-country flight departed Salinas Municipal Airport, Salinas, California, at 1837, with a planned destination of Eppley Airfield, Omaha, Nebraska. Visual meteorological conditions prevailed, and an instrument flight rules (IFR) flight plan had been filed. The pilot was the son of the passenger. Both had spent the weekend attending a driving academy at the Laguna Seca Raceway, having arrived in the accident airplane earlier in the week. According to the pilot's wife, they had encountered strong headwinds during the outbound flight from Omaha, and had decided to take advantage of tailwinds for the return flight that night, rather than stay in a hotel. The pilot planned to return his father to Omaha, and then fly to his residence in Missouri the following day. Radar and voice communication data provided by the Federal Aviation Administration (FAA) revealed that prior to departure, the pilot was given an IFR clearance to Omaha, and that during his interaction with clearance delivery personnel he read back the clearance correctly. A few minutes after departing Salinas the airplane was cleared to fly direct to the Panoche VORTAC (co-located very high frequency omnidirectional range (VOR) beacon and tactical air navigation system). The airplane followed a direct course of 60 degrees; reaching Panoche at a mode C reported altitude of 17,200 feet, about 14 minutes later. The airplane continued on that course, reaching the Clovis VOR at 1912, coincident to attaining the pilots stated cruise altitude of 27,000 feet. The pilot reported leveling for cruise, and flying direct to Omaha. The sector controller reported that the pilot should fly direct to the Coaldale VOR and then to Omaha, and the pilot responded, acknowledging the correction. For the next 5 minutes, the airplane continued at the same altitude and heading, with no further transmissions from the pilot. The airplane then began a descending turn to the right, with a final mode C reported radar target recorded 60 seconds later. During that period, it descended to 22,600 feet, with an accompanying increase in ground speed from about 190 to 375 knots. For the remaining 6 minutes, a 6.5-mile-long cluster of primary targets (no altitude information) was observed emanating from the airplane's last location, on a heading of about 150 degrees. Following the initial route deviation, the air traffic controller made five attempts to make contact with the pilot with no success. Throughout the climb and cruise portion of the flight, the airplane flew directly to the assigned waypoints with minimal course variation, in a manner consistent with the pilot utilizing the autopilot.", "probable_cause": "The pilot's failure to regain airplane control following a sudden rapid descent during cruise, which resulted in an in-flight breakup. Contributing to the accident was the pilot's decision to make the flight with a failed vacuum pump, particularly at high altitude in night conditions."}