{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-spearfish-4-killed", "date": "Aug 4, 1998 at 1345 LT", "type": "Socata TBM-700", "operator": "Eagle Flight Center", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Lawrence – Madison – Spearfish", "msn": "10", "yom": 1991, "flight_number": null, "city": "Spearfish-Black Hills-Clyde Ice", "zone": "South Dakota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3150, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1695, "circumstances": "Witnesses observed the flight enter downwind for runway 30, after it had completed a published approach to runway 12, with a circle to land on runway 30. The witnesses, one of which was a commercial pilot said that there were jagged ceilings at the time about 400 to 500 feet above the ground. He and two other men with him saw the airplane below the clouds. As the airplane proceeded downwind, it momentarily entered a cloud. As the airplane came out of the cloud, it turned left in about a 30 degree turn. The angle of bank increased to about 70 to 80 degrees, the tail of the airplane came up, and the airplane impacted the ground nose first. Several pilots at the airport heard someone from N69BS make a radio transmission on the UNICOM frequency. What was heard by several people was that N69BS had broken out at 2200 feet. They then heard, 'N69BS turning base,' immediately followed by 'lookout' and 'oh ....' All of the eye witnesses agreed that at no time did they see or hear any problems with the engine. They all said that the sounds coming from the engine never changed. The published approach in use at the time of the accident was the GPS (global positioning system) runway 12. The pilot made his initial approach to runway 12, broke off the approach to the right, entered a right downwind for a landing on runway 30. The published circling minimums for the approach were MDA (minimum descent altitude) 4,800 feet, HAT (height above terrain) 869 feet. Using an approach speed of 90 knots, the minimum visibility was 1 mile. Using an approach speed of 120 knots, the minimum visibility was 1 1/4 miles. The field elevation was 3,931 feet. The profile for the GPS runway 12 approach showed that after the IAF (Jesee way point), the course was 204 degrees, at 7,000 feet, to the Dezzi way point, from Dezzi the course was 114 degrees, descend to 5,600, to Sophi way point, after Sophi descend to 4,800 feet to the missed approach point at the Ruste way point. The distance from Dezzi to Ruste was 10 miles. ", "probable_cause": "The pilot's failure to maintain control of the airplane while turning to base leg. Contributing factors were low ceilings, clouds, and the pilot's failure to adhere to both the published approach procedures and the published minimum descent altitude. "}