{"url": "https://www.baaa-acro.com/crash/crash-airbus-a319-new-york", "date": "Jan 19, 2003 at 0715 LT", "type": "Airbus A319", "operator": "Northwest%20Airlines2", "flight_phase": "Taxiing", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "1186", "yom": 2000, "flight_number": null, "city": "New York-LaGuardia", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Two maintenance technicians where on board Northwest Airlines' Airbus A319 N313NB which was taxied from a maintenance area to Gate 10. When they arrived in the vicinity of gate 10, the mechanic who was steering the plane, activated the parking brake and waited for ground personnel and a jetway operator to arrive. After the ground personnel arrived he released the parking brake. The airplane did not move and he advanced the throttles out of their idle detents \"a couple of inches, about halfway.\" The airplane began to move at a \"fairly decent speed,\" and he realized the throttles were still out of the idle detent position. He pulled the throttle back and applied brakes; however, the airplane did not slow and continued until it struck the concrete support column of the jetway, and the left wing contacted the right side of a Boeing 757-251 (N550NW, parked at gate 9). The nose gear sheared off the Airbus, and the right side of the Boeing sustained a 6-foot long, 2-foot wide gash, just aft of the R1 door. The mechanic estimated that the airplane was about halfway down the parking line when he pulled back the throttles. Initial review of the flight data recorder for the time period surrounding the accident revealed that about 10 seconds after the parking brake was released, the thrust lever angles for both engines were increased to about 17 degrees for about 8 seconds, before they were returned to the idle position. During that time, the engines N1 and N2 speeds increased to about 71, and 85 percent, respectively.", "probable_cause": "Maintenance personnel failure to maintain aircraft control as a result of excessive throttle input."}