{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-gii-little-rock-7-killed", "date": "Jan 19, 1990 at 1710 LT", "type": "Gulfstream GII", "operator": "Kodak", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Longview - Little Rock", "msn": "243", "yom": 1979, "flight_number": null, "city": "Little Rock-Bill & Hillary Clinton", "zone": "Arkansas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 20000, "captain_hours_type": 160, "copilot_hours": 20000, "copilot_hours_type": 160, "aircraft_hours": 5812, "circumstances": "During arrival, heavy rain showers were reported west of airport. At the airport, the weather was about 200 feet obscured with fog and drizzle, wnd was easterly at 5 to 7 knots. The pilots intended to land on runway 22, but after being told the wind was gusting to 27 knots, they elected to land on runway 04. The actual wind was not gusty. The erroneous gust indication was from a malfunction of the LLWAS. On final approach for an ILS runway 04 approach, the flight was advised the wind was from 030° at 5 knots and the RVR was 1,800 feet. Minimum RVR for the approach was 2,400 feet. The crew acknowledged; 22 seconds later, the ELT activated as the aircraft touched down 1,600 feet short of runway 04 and hit approach lighting system, railroad tracks and a fence. Investigations revealed the aircraft descended thru windshear. While maneuvering onto final approach; ground speed varied between 320 and 190 knots as aircraft was maneuvered thru tailwind to headwind near faf. CVR data verified a delay in descent from 4,000 feet to 1,900 feet before reaching faf and that the gear warning horn sounded before extension of gear and speed brakes. There was evidence of low engine rpm during impact, but no preimpact mechanical problem was found. Each pilot had over 10,000 hours of flight time, but only about 160 hours each in jet aircraft. All seven occupants were killed. ", "probable_cause": "Failure of the pilot-in-command to follow IFR procedures (maintain an ILS glide path or initiate a missed approach) during an ifr arrival to the airport. Factors related to the accident were: \r\n- Unfavorable weather conditions, \r\n- An erroneous wind indication from the low level windshear alert system (LLWAS), which resulted in an inaccurate weather (wind) observation, and \r\n- Failure of the pilots to take adequate remedial action."}