{"url": "https://www.baaa-acro.com/crash/crash-iai-1124a-westwind-ii-manila-8-killed", "date": "Mar 29, 2020 at 2000 LT", "type": "IAI 1124 Westwind", "operator": "Lionair%20Inc", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Manila - Tokyo", "msn": "353", "yom": 1981, "flight_number": null, "city": "Manila-Ninoy Aquino", "zone": "Metro Manila", "country": "Philippines", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "An IAI Westwind II 1124A type of aircraft with registry number RP-C5880, was destroyed following a runway excursion while taking-off at RWY 06, Ninoy Aquino International Airport (NAIA), Manila Philippines. All eight (8) occupants (six (6) Filipino, one (1) Canadian and one (1) American citizen are fatally injured. The aircraft is being operated by Lionair Inc. and was bound for Haneda, Japan on a medical evacuation flight. While the aircraft was on take-off roll before reaching taxiway R2, sparks were noted at the runway, it continued until the aircraft came to complete stop and engulfed by fire. Chunks of rubber and metal debris were present on the runway. Scrape marks coming from the right hand (RH) wheel hub were also visible. Tire marks followed by scrape marks on the runway coming from the LH tire and wheel hub were also seen after taxiway H1 intersection. Large portion of the remaining LH tire was recovered from the grassy portion near taxiway H1. After exiting from the asphalted portion of runway safety area, the aircraft initially run over two (2) runway edge lights then impacted into a concrete electric junction box and came to a complete stop at the runway secondary fence. The aircraft settled almost 172 meters away from the end of RWY 06, in an upright position at 14°30'53.50\"N; 121°1'48.48\"E and heading of 170 degrees. The flight was on Instrument Flight Rules (IFR) condition. A Notice to Airmen (NOTAM) of NAIA RWY 06/24 closure for aircraft operation was declared at 2000H and opened for operation at 0420H, March 30, 2020.", "probable_cause": "The accident was the caused by the combination of the decision of the PF to abort the take-off after VR that resulted to runway excursion and incorrect pilot techniques or procedures in the high-speed rejected take-off.\r\nThe following contributing factors were identified: \r\n- Operational pressures related to the delay of schedule due to late filing of the flight plan compelling the crew to rush and meet the schedule demand.\r\n- The crew's complacency by skipping required briefing item in the before take-off checklist, in this case, the considerations in the event of a malfunction before/after V1."}