{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-terrace-7-killed", "date": "Sep 26, 1989 at 0828 LT", "type": "Swearingen SA227 Metro III", "operator": "Skylink Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Prince Rupert - Terrace", "msn": "AC-481", "yom": 1981, "flight_number": "SLK070", "city": "Terrace", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11177, "circumstances": "A Swearingen SA227-AC Metro III passenger plane, operating as Skylink Flight 070 was destroyed in accident at Terrace Airport, BC (YXT), Canada. All five passengers and two crew members were killed. Flight 070 took off from Vancouver, BC (YVR) at 06:51 on a scheduled domestic flight to Terrace, BC. At 08:20 Flight 070 was cleared for an approach at Terrace. At 08:27, at an altitude of 1,200 feet asl and just prior to reaching the published missed approach point (MAP), the captain stated \"OK, I got the button here.\" Fourteen seconds after this, the captain saw the button of runway 27. At approximately this same time, the aircraft was observed on what corresponded to a downwind leg for runway 15 at about 500 feet above ground level (agl), flying straight and level over the threshold of runway 27, with the landing gear down. The aircraft crossed the localizer transmitter at an altitude of 1,100 feet asl and at an airspeed of 140 knots. Approximately 30 seconds after crossing the localizer transmitter, the aircraft commenced a descent out of 1,100 feet, and the flaps were lowered to the full position. The aircraft then levelled at an altitude of approximately 900 feet. At or about this same time, the aircraft was observed on base leg for runway 15 at a low altitude, close to the east/west ridge located about 1.5 miles north of the airport. Twenty-six seconds after full flap was selected, a missed approach was initiated, and the landing gear and flaps were selected up. Within five seconds of the initiation of the missed approach, the aircraft began to accelerate and a rate of climb of approximately 1,200 feet per minute was established. This rate of climb quickly diminished to zero, followed by the start of a descent which quickly increased to 3,000 feet per minute. As the aircraft descended, the co-pilot called \"descending\" twice. A few seconds later, the aircraft struck trees on the west side of runway 15 just inside the airport perimeter. A second and final impact with the ground occurred just outside the airport perimeter approximately 800 feet from the initial tree strike. A fire erupted following the ground impact.", "probable_cause": "The crew continued with the approach beyond the missed approach point without establishing the required visual references. The evidence indicates that, while subsequently carrying out a missed approach in IFR conditions, the aircraft was flown into the ground in a manner consistent with disorientation. Contributing to the occurrence were the inadequacy of the company's operating procedures, the reduced operating standards, and the inadequate definition of the visual references required for a circling approach."}