{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-6b2-h4-turbo-porter-muaritan-2-killed", "date": "Apr 25, 2012 at 1730 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "Susi%20Air", "flight_phase": "Flight", "flight_type": "Aerial photography", "survivors": "No", "site": "Plain, Valley", "schedule": "Balikpapan - Balikpapan", "msn": "965", "yom": 2009, "flight_number": null, "city": "Muaritan", "zone": "West Kalimantan", "country": "Indonesia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1912, "captain_hours_type": 81, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2397, "circumstances": "The Pilatus Porter PC-6 aircraft operated by PT. Puji Astuti Aviation (Susi Air) registered PK-VVQ on Areal Survey Flight, departed from Sepinggan-Balikpapan to Melak Area on 25 April 2012 at 0440 UTC (Universal Time Coordinate) or 1240 LT. There were one pilot and one pasenger on board, the estimate flight endurance was seven hours. At 0505 the aircraft reported leaving Balikpapan Approach. At 0910 the aircraft was reported to Melak Radio on radial 060 at the altitude of 3,500 feet, and that it would be leaving Survey after a further twenty minutes. Melak Radio reported that the aircraft lost contact at 0930. At 0922 a text message was sent by the passenger to his employer stating “Run out of fuel, landing on road”. The Search and Rescue Bureau informed that a distress signal was tetected on 1025 at the position of 00 25’.02” N 116.02’.48”E. On 26 April 2012 at 1730 UTC the aircraft was found in Muaritan – Kecamatan Tabang, Kutai Karta Negara at the position 00 25’.03” N 116.01’.55”E. The aircraft was substantially damaged, the pilot and the passenger were fatally injured.", "probable_cause": "The engine flamed out caused by lack of fuel supply from main fuel tank to the engine. The pilot likely fixated on the survey flight execution and lost awareness of his fuel situation. The transferring of fuel from the auxiliary tank was not performed during the flight as required. The combination of inexperience of the pilot related to survey flying, fatigue and the highly demanding survey operator contributed to this sequence of events. \n"}