{"url": "https://www.baaa-acro.com/crash/crash-antonov-12bp-mexico-city-10-killed", "date": "Feb 9, 1967 at 0516 LT", "type": "Antonov AN-12", "operator": "Cubana-de-Aviacion-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Havana - Mexico City", "msn": "4 015 04", "yom": 1964, "flight_number": null, "city": "Mexico City-Benito Juarez", "zone": "Federal District of Mexico City", "country": "Mexico", "region": "Central America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 10830, "captain_hours_type": 701, "copilot_hours": 15240, "copilot_hours_type": 153, "aircraft_hours": 993, "circumstances": "The aircraft was carrying out a non-scheduled international cargo flight from Rancho Boyeros Airport, Havana, Cuba, to Mexico City International Airport, Mexico. It departed Rancho Boyeros Airport at approximately 0100 hours Mexico time and its estimated time of arrival at Mexico was 0450 hours. At 0400 hours, when reaching the BX intersection, the aircraft contacted the Mexico Control Centre and requested authorization to enter the control area. This was granted and the latest weather information for Mexico Airport was transmitted to the aircraft but no acknowledgement was received. Subsequent transmissions from the aircraft on 118.7 MHz were unintelligible and it was instructed to change to 120.1 MHz. The c clearance and weather information were again passed to the aircraft on that frequency. The aircraft reported over Nautla and Tulanciago and was informed that visibility at Mexico City was 14 miles because of fog. It was then instructed to descend from 18 000 to 12 000 ft and change to approach frequency 119.7 MHz. It was also advised that the runway would be 23L and that the wind was calm. At 0458 hours the aircraft reported over Tepexpan and was instructed to descend to 11 000 ft and report over the VOR where it could initiate a standard descent. At 0500 hours the aircraft reported over the VOR leaving 11 000 ft and was instructed to change to 118.1 MHz, the control tower frequency. This was the last contact with the aircraft. It did not establish contact on the tower frequency. The aircraft crashed in flames 18 km from runway threshold and 400 meters to the right of its extended centerline. The aircraft was destroyed and all 10 occupants were killed. ", "probable_cause": "The probable cause of the accident was pilot error in that: \r\n- He executed an IFR descent procedure other than that which was established for Mexico City International Airport; and \r\n- He discontinued IFR flight during the descent outside the area protected for VFR flight at that time of day and in the reported weather conditions, below the absolute minima established for descent. \r\nThe following findings were reported: \r\n- The aircraft struck the ground nose first in an almost 24° nose down attitude and with a left bank of approximately 25°,\r\n- No evidence of fire or explosion prior to impact was found,\r\n- Fire occurred when the left wing broke and fuel came in contact with the exhaust of No. 1 and No. 2 engines,\r\n- There was no evidence of the aircraft being out of control during the procedure turn and descent,\r\n- The aircraft was not in the landing configuration,\r\n- Communications between the aircraft and the Control Centre were normal up to fixing on the Mexico City VOR,\r\n- The aircraft never contacted the control Tower on the frequency indicated (118.1 MHz),\r\n- Although the weather conditions were not good at the time of the accident, the crew apparently discontinued instrument flight and tried to make a visual approach.\r\n- The aircraft did not follow the procedure established for instrument descent at Mexico City International Airport and at the moment of impact it was effecting an approach descent and attempting to intercept QDM 228° for final approach to runway 23 left."}