{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-rossfjordstraumen", "date": "Mar 28, 1968", "type": "De Havilland DHC-3 Otter", "operator": "Wideroe_1", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Tromsø – Harstad", "msn": "18", "yom": 1953, "flight_number": null, "city": "Rossfjordstraumen", "zone": "Troms", "country": "Norway", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft on amphibious floats departed from Tromso at 1015 hours for a scheduled flight to Harstad. In addition to the pilot, a company mechanic was on board as an assistant   and there were three passengers. The weather was not good, with low cloud, heavy snow showers and reduced visibility. Due to the conditions, the pilot elected to divert from the track laid out in the company's route manual. This change of route however was not reported to air traffic control because of poor radio coverage at low altitude. This is a very rugged coastal area with numerous fjords and inlets amidst mountains rising to four thousand feet. As the Otter flew in on the west side of Rossfjord, some 45 kilometres south-west of Tromso, visibility dropped and the pilot said to his assistant “We'll cut across here, I know this area” and started a right turn. Eye witness reports put the aircraft at this time at between 100 feet and 25 feet above the ice-covered fjord, although the pilot was later to claim he was flying at 500 feet. Immediately after starting the turn, the right wingtip and float made contact with the ground. The aircraft was thrown to the left at the first impact and crashed at a 35 degree angle to its direction of travel. It caught fire and was burnt to destruction. All five occupants survived the crash but one passenger and the pilot's assistant suffered severe burns and were flown by helicopter to hospital in Tromso.\r\nSource: https://www.dhc-3archive.com", "probable_cause": "The Accident investigation Board was not able to determine whether the pilot meant to make a 180 degree turn and fly back out of the fjord, or initiate a climb to get across a low mountain ridge and out into the next fjord to the west. The Board concluded that the accident was caused by the pilot’s decision to turn towards higher terrain. If the purpose was to exit the fjord, it should have been made to the left over the fjord. If it was to climb across the ridge, it would not have been possible to clear the terrain, given the aircraft’s weight and performance."}