{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-bravo-lismore", "date": "Sep 25, 2015 at 1300 LT", "type": "Cessna 550 Citation Bravo", "operator": "Yulgilbar", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lismore - Baryulgil", "msn": "550-0852", "yom": 1998, "flight_number": null, "city": "Lismore", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5937, "captain_hours_type": null, "copilot_hours": 377, "copilot_hours_type": null, "aircraft_hours": 2768, "circumstances": "On the morning of 25 September 2015, the captain and copilot of a Cessna 550 aircraft (Citation Bravo), registered VH-FGK, prepared to conduct a private flight from Lismore Airport to Baryulgil, about 40 NM south-west of Lismore, New South Wales. The aircraft had been parked at the northern end of the airport overnight, with engine covers and control locks on. After arriving at the airport, the flight crew conducted a pre-flight inspection, with no abnormalities identified. They then commenced the normal pre-start checks, which included the disengagement of the flight control locks. The crew elected to use runway 15 for take-off, and used the Cessna simplified take-off performance criteria (see Take-off performance simplified criteria) to determine the thrust settings and take-off reference speeds. The resultant reference speeds were 105 kt for the decision speed (V1) and 108 kt for the rotation speed (VR). At about 1300 Eastern Standard Time, the flight crew started the engines and performed the associated checks, with all indications normal. The crew reported that they completed the after start checks, and the captain then taxied the aircraft to the holding point for runway 15, less than 200 m from where the aircraft was parked. While stopped at the holding point, the crew completed the taxi and pre-take-off checks, the copilot broadcast the standard calls on the common traffic advisory frequency, and the captain communicated with air traffic control (ATC). The captain taxied the aircraft onto the runway, and turned left onto the runway centreline to commence the take-off run from the intersection. While rolling along the runway, the captain advanced the thrust levers to the approximate take-off setting. The captain then called ‘set thrust’, and the copilot set the thrust levers to the more precise position needed to achieve the planned engine thrust for the take-off. As the aircraft accelerated, the copilot called ‘80 knots’ and crosschecked the two airspeed indicators were in agreement and reading 80 kt. The copilot called ‘V1’ and the captain moved their hands from the thrust levers to the control column in accordance with the operator’s normal procedure. A few seconds later, the copilot called ‘rotate’ and the captain initiated a normal rotate action on the control column. The crew reported that the aircraft did not rotate and that they did not feel any indication that the aircraft would lift off. The copilot looked outside and did not detect any change in the aircraft’s attitude as would normally occur at that stage. The captain stated to the copilot that the aircraft would not rotate, and pulled back harder on the control column. The copilot looked across and saw the captain had pulled the control column firmly into their stomach. Although the aircraft’s speed was then about 112 kt, and above VR, the crew did not detect any movement of the attitude director indicator or the nose wheel lifting off the ground, so the captain rejected the take-off; applied full brakes, and set the thrust levers to idle and then into reverse thrust. The aircraft continued to the end of the sealed runway and onto the grass in the runway end safety area (RESA), coming to rest slightly left of the extended centreline, about 100 m beyond the end of the runway. The aircraft sustained substantial damage and the flight crew, who were the only occupants of the aircraft, were uninjured. The nose landing gear separated from the aircraft during the overrun, and there was significant structural damage to the fuselage and wings. The right wheel tyre had deflated due to an apparent wheel lockup and flat spot, which had progressed to a point that a large hole had been worn in the tyre.", "probable_cause": "Contributing factors:\r\n- There was probably residual braking pressure in the wheel brakes during the take-off run.\r\n- The aircraft’s parking brake was probably applied while at the holding point and not disengaged before taxing onto the runway for take-off.\r\n- The Citation aircraft did not have an annunciator light to show that the parking brake is engaged, and the manufacturer’s before take-off checklist did not include a check to ensure the parking brake is disengaged.\r\n- The aircraft experienced a retarded acceleration during the take-off run, and did not rotate as normal when the appropriate rotate speed was reached, resulting in a critical rejected take-off\r\nand a runway overrun."}