{"url": "https://www.baaa-acro.com/crash/crash-cessna-207a-stationair-7-ii-kwigillingok", "date": "Nov 7, 2011 at 1830 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Hageland-Aviation-Services-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kwigillingok – Bethel", "msn": "207-0478", "yom": 1978, "flight_number": null, "city": "Kwigillingok", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1833, "captain_hours_type": 349, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot departed on a scheduled commuter flight at night from an unlit, rough and uneven snow-covered runway with five passengers and baggage. During the takeoff roll, the airplane bounced twice and became airborne, but it failed to climb. As the airplane neared the departure end of the runway, it began to veer to the left, and the pilot applied full right aileron, but the airplane continued to the left as it passed over the runway threshold. The airplane subsequently settled into an area of snow and tundra-covered terrain about 100 yards south of the runway threshold and nosed over. Official sunset on the day of the accident was 48 minutes before the accident, and the end of civil twilight was one minute before the accident. The Federal Aviation Administration's (FAA) Airport/Facility Directory, Alaska Supplement listing for the airport, includes the following notation: \"Airport Remarks - Unattended. Night operations prohibited, except rotary wing aircraft. Runway condition not monitored, recommend visual inspection prior to using. Safety areas eroded and soft. Windsock unreliable.\" A postaccident examination of the airplane and engine revealed no mechanical anomalies that would have precluded normal operation. Given the lack of mechanical deficiencies with the airplane's engine or flight controls, it is likely the pilot failed to maintain control during the takeoff roll and initial climb after takeoff.\n", "probable_cause": "The pilot's failure to abort the takeoff when he realized the airplane could not attain sufficient takeoff and climb performance and his improper decision to depart from an airport where night operations were prohibited.\n"}