{"url": "https://www.baaa-acro.com/crash/crash-cessna-441-conquest-sunriver-1-killed", "date": "Jul 16, 2008 at 1015 LT", "type": "Cessna 441 Conquest", "operator": "Prosoft%20Technology", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bakersfield - Sunriver", "msn": "441-0336", "yom": 1984, "flight_number": null, "city": "Sunriver", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 965, "captain_hours_type": 277, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5643, "circumstances": "The pilot was executing a day visual flight rules full-stop landing and touched down on the main landing gear near the approach end of the runway. Soon after the initial touchdown, the airplane became airborne again. Instead of initiating a go-around, the pilot attempted to continue the landing sequence. During that attempt, the airplane bounced on the runway three or four times, each time the rebound back into the air and the runway contact was more severe. During the last contact the airplane impacted the runway with sufficient force to result in the failure of the right main landing gear actuator rod, and in the right propeller contacting the runway surface multiple times. The pilot then initiated a go-around, but since the right engine had failed due to the multiple propeller strikes, the airplane produced asymmetrical thrust and began to roll to the right, veering off the right side of the runway.  Soon thereafter its right wing collided with a tree and the airplane impacted terrain in an open field. The airplane was consumed by fire shortly after the collision. Post crash inspection found no evidence of mechanical failure or malfunction with the airframe or either engine.", "probable_cause": "The pilot's misjudged landing flare and improper recovery from a bounced landing, and the pilot's failure to maintain directional control during the go-around after one of the airplane's propellers struck the runway."}