{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3c-manila-4-killed", "date": "Oct 17, 2009 at 1214 LT", "type": "Douglas DC-3", "operator": "Victoria Air - Philippines", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Manila - Puerto Princesa", "msn": "14292/25737", "yom": 1944, "flight_number": null, "city": "Manila-Ninoy Aquino", "zone": "Metro Manila", "country": "Philippines", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On October 17, 2009at about 12:04 pm, RP-C550 a DC-3type of aircraft took off from Manila Domestic airport bound for Puerto Princesa, Palawan. Approximately 5 mins after airborne, the Pilot-in-Command (PIC) informed Manila Tower that they were turning back due to technical problem. The PIC was asked by the air controller whether he was declaring an “emergency” and the response was negative. The PIC was directed to proceed South Mall and wait for further instruction (a standard procedures for VFR arrivals for runway 13). At South Mall, RP-C550 was cleared to cross the end of runway 06, still without declaring an emergency. The tower controller sensed that something was wrong with the aircraft due to its very low altitude, immediately granted clearance to land runway 06. However, the aircraft was not able to make it to runway 06. At about 12:14, RP-C550 crashed at an abandoned warehouse in Villa Fidela Subd., Brgy. Elias Aldana Las Piñas City about 4 kms. from the threshold of runway 06. As a result, the aircraft was totally destroyed and all aboard suffered fatal injuries due to impact and post crash fire. ", "probable_cause": "The Aircraft Accident Investigation and Inquiry Board determine that the probable causes of this accident were the following:\r\n- Non-procedural application of power during take-off and initial climb that led to left engine malfunction.\r\n- The questionable qualifications of the flight crew.\r\n- Low level of competence of the pilots. \r\n- Not feathering the left engine.\r\n- Turning towards the bad engine.\r\n- Not declaring an emergency. "}