{"url": "https://www.baaa-acro.com/crash/crash-douglas-ec-47p-phu-cat-6-killed", "date": "Oct 8, 1969", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Mountains", "schedule": "Phù Cát - Phù Cát", "msn": "14916/26361", "yom": 1944, "flight_number": "Prong 33", "city": "Phù Cát", "zone": "Bình Định Province", "country": "Vietnam", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Prong 33 took off from Phù Cát on the afternoon of the 8th on a planned seven-hour RDF mission. However, just 20 minutes after take off the pilot radioed that he was returning to base because of a problem with the doppler navigation equipment. The aircraft landed safely and although the doppler was fixed, the aircraft weather radar was found to be unusable. Despite bad weather in the flight area, the pilot was told to take off again but to return before dark if the weather worsened. When the aircraft reached its intended area or operations it was found that the weather was too bad to operate safely sot 1st Lt Knight flew towards the coast to return to Phù Cát. The pilot was guided through bad weather  towards Phù Cát by the GCA controller but during the approach, 1st Lt Knight reported an inverter fire followed by the loss of his gyros and attitude indicators. The GCA controller gave instructions to direct the aircraft to the airfield but radio and radar contact was lost during the approach. Search operations were hampered by bad weather and it was not until 12 October that the wreckage was located by a SAR helicopter about 15 miles southeast of Phù Cát. All six crew members were killed.\r\nCrew:\r\n1st Lt Ronald Harold Knight,\r\n1st Lt Max Emmanuel Rosen,\r\nCpt Bradley Rogers Ransom,\r\nT/Sgt Sylvester William Redman,\r\nS/Sgt Elmore L. Hall,\r\nS/Sgt Michael L. Stiglich. \r\nSource. Chris Hobson", "probable_cause": "Instruments failure during an approach in poor weather conditions. "}