{"url": "https://www.baaa-acro.com/crash/crash-baade-152-ottendorf-okrilla-4-killed", "date": "Mar 5, 1959 at 1355 LT", "type": "Baade 152", "operator": "Baade Flugzeuge", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dresden - Dresden ", "msn": "V1", "yom": 4, "flight_number": null, "city": "Dresden-Klotzsche", "zone": "Saxony", "country": "Germany", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1, "circumstances": "First prototype, the Baade 152 left Dresden-Klotzsche Airport at 1255LT for its second test flight with a crew of four. After several manoeuvres conducted at an assigned altitude of 6,000 meters (gear down), the crew was supposed to descent to 3,000 meters and to increase engine power to arrest the descent and to test the airplane's response to power settings. For unknown reason, the crew failed to follow the program and instead of increasing engine power, he contacted ground and requested permission for an unplanned low pass with gear and flaps up. While descending to the altitude of 600 meters, the aircraft's speed was close to stall value when the crew decided to lower the gear and to increase engine power. The four engines provided power for about 8 to 10 seconds went control was lost. The airplane entered a nose down attitude and plunged into the earth, crashing in a field by an angle of 70°. The aircraft disintegrated on impact and all four crew members were killed. ", "probable_cause": "It is believed the accident was the consequence of a pilot error but it was also determined that the loss of control was caused by the simultaneous failure of all four engines because they were not supplied with fuel during a high rate of descent. Investigations revealed on other flight tests that the engines were not properly supplied with fuel when the aircraft reached a nose-down angle equal or above 16°, which was considered as a design fault. "}