{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-500a-mcdade-1-killed", "date": "Nov 23, 2014 at 0945 LT", "type": "Rockwell Aero Commander 500", "operator": "Aerial-Viewpoint", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Plain, Valley", "schedule": "Tomball – Austin", "msn": "500-914-22", "yom": 1960, "flight_number": null, "city": "McDade", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7075, "captain_hours_type": 168, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12859, "circumstances": "The airline transport pilot was conducting a cross-country repositioning flight. While en route to the destination airport, the pilot contacted air traffic control and stated that he was beginning to descend. No further radio transmissions were made by the pilot. Radar and GPS information showed, about the same time as the pilot's last transmission, the airplane's flightpath began descending in a westerly direction. The last recorded GPS point showed the airplane about 200 ft southwest of the initial impact point, 90 ft above ground level, and at a groundspeed of 66 knots. The airplane wreckage was located in an open field and impact signatures were consistent with a stall/spin, which had resulted in a near-vertical impact at a slow airspeed. The right propeller blades were found in the feathered position. Examination of the right engine found that the oil gauge housing extension was improperly secured to the oil gauge housing, which resulted in a loss of engine oil. Additionally, the examination revealed a hole in the right engine's crankcase, metal material in the oil sump, and signatures consistent with the lack of lubrication. Cockpit switches were positioned in accordance with the in-flight shutdown of the right engine. No anomalies were found with the left engine or airframe that would have precluded normal operation. Another pilot who had flown with the accident pilot reported that the pilot typically used the autopilot, and the autopilot system was found with the roll, heading, and pitch modes active. During the descent, no significant changes of heading were recorded, and the direction of travel before the stall was not optimal for the airplane to land before a fence line. It is likely that the autopilot was controlling the airplane's flightpath before the stall. Despite one operating engine, the pilot did not maintain adequate airspeed and exceeded the airplane's critical angle-of-attack (AOA), which resulted in an aerodynamic stall/spin. Correcting the last GPS recorded airspeed for prevailing wind, the airplane's indicated airspeed would have been about 72 knots, which is above the airplane's 0-bank stall speed, but an undetermined  mount of bank would have been applied to maintain heading, which would have accelerated the stall speed. It could not be determined why the pilot did not maintain adequate airspeed or notify air traffic controller of an engine problem.  Although a review of the pilot's medical records revealed that he had several historical medical conditions and the toxicology tests detected several sedating allergy medications in his system, it was inconclusive whether the medical conditions or medications impaired the pilot's ability to fly the airplane or if the pilot was incapacitated. It is also possible that the pilot was distracted by the loss of oil from the right engine and that this resulted in his failure to maintain adequate airspeed, his exceedance of the airplane's critical AOA, and a subsequent stall/spin; however, based on the available evidence, the investigation could not determine the reason for the pilot's lack of corrective actions.", "probable_cause": "The pilot's failure to maintain adequate airspeed and his exceedance of the airplane's critical angle-of-attack for reasons that could not be determined based on the available evidence, which resulted in an aerodynamic stall/spin. Contributing to the accident was the improperly installed oil gauge housing extension, which resulted in a loss of oil quantity and right engine power."}