{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-83-lagos-159-killed", "date": "Jun 3, 2012 at 1545 LT", "type": "McDonnell Douglas MD-83", "operator": "Dana%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "City", "schedule": "Abuja - Lagos", "msn": "53019/1783", "yom": 1990, "flight_number": "DAV992", "city": "Lagos-Murtala Muhammed", "zone": "Lagos", "country": "Nigeria", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 147, "pax_fatalities": 147, "other_fatalities": 6, "total_fatalities": 159, "captain_hours": 18116, "captain_hours_type": 7466, "copilot_hours": 1143, "copilot_hours_type": 808, "aircraft_hours": 60850, "circumstances": "On 3rd June, 2012 at about 1545:00hrs, 5N-RAM, a Boeing MD-83, a domestic scheduled commercial flight, operated by Dana Airlines (Nig.) Limited as flight 0992 (DANACO 0992), crashed into a densely populated area of Iju-Ishaga, a suburb of Lagos, following engine number 1 loss of power seventeen minutes into the flight and engine number 2 loss of power while on final approach to Murtala Muhammed Airport Lagos, Nigeria. Visual Meteorological Conditions prevailed at the time and the airplane was on an instrument flight plan. All 153 persons onboard the airplane, including the six crew were fatally injured. There were also six confirmed ground fatalities. The airplane was destroyed. There was post impact fire. The flight originated at Abuja (ABV) and the destination was Lagos (LOS). The airplane was on the fourth flight segment of the day, consisting of two round-trips between Lagos and Abuja. The accident occurred during the return leg of the second trip. DANACO 0992 was on final approach to runway 18R at LOS when the crew declared a Mayday call “Dual Engine Failure – negative response from the throttles.” According to records, the flight arrived ABV as Dana Air flight 0993 at about 1350:00hrs and routine turn-around activities were carried out. DANACO 0992 initiated engine start up at 1436:00hrs. Abuja Control Tower cleared the aircraft to taxi to the holding point of runway 04. En-route ATC clearance was passed on to DANACO 0992 on approaching holding point of runway 04. According to the ATC ground recorder transcript, the aircraft was cleared to line-up on runway 04 and wait, but the crew requested for some time before lining-up. DANACO 0992 was airborne at 1458:00hrs after reporting a fuel endurance of 3 hours 30 minutes. The aircraft made contact with Lagos Area Control Centre at 1518:00hrs and reported 1545:00hrs as the estimated time of arrival at LOS at cruising altitude of 26,000 ft. The Cockpit Voice Recorder (CVR) retained about 30 minutes 53 seconds of the flight and started recording at 1513:44hrs by which time the Captain and First Officer (F/O) were in a discussion of a non-normal condition regarding the correlation between the engine throttle setting and an engine power indication. However, they did not voice concerns then that the condition would affect the continuation of the flight. The flight crew continued to monitor the condition and became increasingly concerned as the flight transitioned through the initial descent from cruise altitude at 1522:00hrs and the subsequent approach phase. DANACO 0992 reported passing 18,100ft and 7,700ft, at 1530:00hrs and 1540:00hrs respectively. After receiving radar vectors in heading and altitude from the Controller, the aircraft was issued the final heading to intercept the final approach course for runway 18R. According to CVR transcript, at 1527:30hrs the F/O advised the Captain to use runway 18R for landing and the request was made at 1531:49hrs and subsequently approved by the Radar Controller. The crew accordingly changed the decision height to correspond with runway 18R. At 1531:12hrs, the crew confirmed that there was no throttle response on the left engine and subsequently the Captain took over control as Pilot Flying (PF) at 1531:27hrs. The flight was however continued towards Lagos with no declaration of any distress message. With the confirmation of throttle response on the right engine, the engine anti-ice, ignition and bleed-air were all switched off. At 1532:05hrs, the crew observed the loss of thrust in No.1 Engine of the aircraft. During the period between 1537:00hrs and 1541:00hrs, the flight crew engaged in prelanding tasks including deployment of the slats, and extension of the flaps and landing gears. At 1541:46hrs the First Officer inquired, \"both engines coming up?\" and the Captain replied “negative” at 1541:48hrs. The flight crew subsequently discussed and agreed to declare an emergency. At 1542:10hrs, DANACO 0992 radioed an emergency distress call indicating \"dual engine failure . . . negative response from throttle.\" At 1542:35hrs, the flight crew lowered the flaps further and continued with the approach and discussed landing alternatively on runway 18L. At 1542:45hrs, the Captain reported the runway in sight and instructed the F/O to retract the flaps and four seconds later to retract the landing gears. At 1543:27hrs, the Captain informed the F/O, \"we just lost everything, we lost an engine. I lost both engines\". During the next 25 seconds until the end of the CVR recording, the flight crew attempted to recover engine power without reference to any Checklist. The airplane crashed into a densely populated residential area about 5.8 miles north of LOS. The airplane wreckage was approximately on the extended centreline of runway 18R, with the main wreckage concentrated at N 06o 40.310’ E 003o 18.837' coordinates, with elevation of 177ft. During the impact sequence, the airplane struck an uncompleted building, two trees and three other buildings. The wreckage was confined in a small area, with the separated tail section and engines located at the beginning of the debris trail. The airplane was mostly consumed by post crash fire. The tail section, both engines and portions of both wings representing only about 15% of the airplane, were recovered from the accident site for further examination.", "probable_cause": "Probable Causal Factors:\r\n1. Engine number 1 lost power seventeen minutes into the flight, and thereafter on final approach, Engine number 2 lost power and failed to respond to throttle movement on demand for increased power to sustain the aircraft in its flight configuration.\r\n2. The inappropriate omission of the use of the Checklist, and the crew’s inability to appreciate the severity of the power-related problem, and their subsequent failure to land at the nearest suitable airfield.\r\n3. Lack of situation awareness, inappropriate decision making, and poor airmanship.\n\r\nTear down of the engines showed that the no.1 engine was overhauled in the U.S in August 2011 and was not in compliance with Service Bulletin SB 6452. Both engines had primary and secondary fuel manifold assemblies fractured, cracked, bent, twisted or pinched which led to fuel leaks, fuel discharge to bypass duct, loss of engine thrust and obvious failure of engine responding to\r\nthrottle movement. This condition was similar to the no.1 engine of a different Dana Air MD-80, 5N-SAI, that was involved in an incident in October 2013 when the aircraft returned to the departure airport with the engine not responding th throttle movements. This engine also was not in compliance with Service Bulletin SB 6452. This bulletin was issued in 2003 and called for the installation of new secondary fuel manifold assemblies, incorporating tubes fabricated from new material which has a fatigue life that was approximately 2 times greater than the previous tube material."}