{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950m-okoroire-1-killed", "date": "Nov 12, 1984 at 1125 LT", "type": "Fletcher FU-24", "operator": "Fieldair", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Okoroire - Okoroire", "msn": "38", "yom": 1957, "flight_number": null, "city": "Okoroire", "zone": "Waikato Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was engaged in an aerial topdressing operation on a farm near Matamata, sowing a mixture of superphosphate and lime along with some other ingredients. After about two hours of normal operations a break was taken while the farm fertilizer bin was replenished from a truck. This was taken as an opportunity to refuel the aircraft. After the truck had departed the aircraft was loaded with 22 hundredweight ( cwt ) of fertilizer mixture and the 14th flight of the day was commenced. The loader driver lost sight of the plane after it took off and was reloading for the next sortie when he noticed that the fertilizer truck had stopped halfway down the farm road. The truck driver came running back to say that the plane had crashed. The aircraft was found on the side of a gully about 250 metres from the end of the airstrip. It was completely wrecked but there was no fire. This was not a survivable accident. The pilot was killed instantly. Evidence showed that the plane had failed to attain takeoff speed and had lifted off briefly then settled back, striking the rear fuselage heavily against the ground and then running through the fence at the end of the strip in a nose high attitude. It became airborne again colliding with a tree while in a 90-degree bank to the right and dived steeply into the gully. The weather was partly cloudy with a northerly wind of 3 to 5 knots. The visibility was good. Weather does not seem to be a factor.", "probable_cause": "The investigator found that the aircraft was grossly overloaded and that the C of G was 28 mm beyond the aft limit. This overloading was believed to be due to approx. 200 kg (3.92 cwt) of fertilizer remaining in the hopper from previous flights and the fact that the weighing equipment on the loader was under-reading. When both pilot and loader driver believed that there was 22 cwt aboard there was actually an estimated hopper load of 27.68 cwt."}