{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-216-new-orleans-16-killed", "date": "Mar 20, 1969 at 0655 LT", "type": "Douglas DC-3", "operator": "Avion Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Memphis - New Orleans - Belize City", "msn": "1946", "yom": 1937, "flight_number": null, "city": "New Orleans-Louis Armstrong (Moisant)", "zone": "Louisiana", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 24, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": 15300, "captain_hours_type": 1600, "copilot_hours": 900, "copilot_hours_type": null, "aircraft_hours": 7584, "circumstances": "William Jackson of Travel Associates leased DC-3 N142D from Avion Airways for the purpose of transporting sportsmen from Memphis to Belize. The aircraft departed Memphis at 04:36 on an IFR flight to New Orleans. At 06:35 the crew contacted New Orleans approach control: \"... out of three point four for three thousand.\" The approach controller told the crew to maintain 3000 feet and proceed direct to the ILS outer compass locator. He gave the weather as \"sky partially obscured visibility 1/16 fog and smoke, altimeter 30.00, runway 10 runway visual range less than 600 feet\". The pilot elected to carry out the approach despite the fact that minimum visibility for an approach was 2400 feet and that the centerline lights were inoperative. After being given vectors for the runway 10 approach he decided to carry out a low pass and continue if runway lights became visible. Apparently the pilot continued the descent. The aircraft contacted the runway very hard 1198 feet past the threshold, bounced and after power was applied, the DC-3 struck the ground again 3100 feet further on. The airplane cartwheeled and caught fire.", "probable_cause": "The controlled descent of the aircraft into known below minima weather conditions and the failure of the crew to discontinue the landing attempt upon reaching the decision height. Contributing to the cause are existing regulations which permit an approach to be initiated in conditions well below minima, lack of clarity in the regulations in describing missed approach procedures while following visual cues to the runway, misinterpretation by the crew of information received from the approach controller (in this case, the legality of landing in low visibility conditions), improper crew action at the time of initial runway contact , and poor crew judgement partially induced by fatigue, and the lack of management required for such an operation."}