{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950-fairlie", "date": "Aug 30, 1997 at 0730 LT", "type": "Fletcher FU-24", "operator": "South Canterbury Aerial Co-op", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "Yes", "site": "Plain, Valley", "schedule": null, "msn": "175", "yom": 1972, "flight_number": null, "city": "Fairlie", "zone": "Canterbury Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While turning onto the sowing run, at about 300 feet agl, a significant downdraught was encountered, together with a loss of at least 5 knots airspeed. The pilot responded by pushing the control column aggressively forward and turning towards the lower ground. At the same time, he operated the jettison lever. The rate of dump and the recovery from the downdraught were far less than anticipated, and the pilot found himself about to collide with rocks in a paddock. He pulled hard back, but was unable to avoid hitting the ground with the left wing. The aircraft flipped and slid backwards to a halt. The pilot's instructor was operating a second Fletcher on the same job, saw that there had been a crash, and, after jettisoning his own load, landed nearby and went to the pilot's assistance. Meteorological conditions were favourable for topdressing, but katabatic winds were likely to have been present in the valley, after a clear, cool night. By the time of these flights, a light northwesterly was in place, which could have added to a katabatic flow. There was very light turbulence. Shortly after the accident, light wind gusts were noted; a steady, stronger wind down the valley was established by mid morning. The accident pilot's training had been completed only the day before, and foremost in his mind was the need to avoid a stall. The combination of pushing forward more than necessary, and a turning flight-path, made the jettison ineffective. In the pull-up to avoid hitting the ground the jettison rate increased, but about one third of the load remained aboard after the accident. It was recommended, and accepted, that the pilot receive more dual training on the stall characteristics of the aircraft, with an emphasis on the speed margins available when manoeuvring at low speed. The agricultural operators association was to be asked to remind members of the effect of manoeuvring on jettison characteristics.", "probable_cause": null}