{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-188a-electra-near-buffalo-34-killed", "date": "Sep 29, 1959 at 2309 LT", "type": "Lockheed L-188 Electra", "operator": "Braniff-International-Airways-1", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Houston – Dallas – Washington DC – New York", "msn": "1090", "yom": 1959, "flight_number": "BN542", "city": "Buffalo", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 28, "pax_fatalities": 28, "other_fatalities": 0, "total_fatalities": 34, "captain_hours": 20726, "captain_hours_type": 68, "copilot_hours": 11316, "copilot_hours_type": 95, "aircraft_hours": 132, "circumstances": "Flight 542 departed the ramp at Houston at 2237LT, 22 minutes behind schedule with a total of 34 persons including a crew of six consisting of Captain Wilson Elza Stone, First Officer Dan Hollowell, Second Officer Roland Longhill, and Stewardesses Alvilyn Harrison, Betty Rusch and Leona Winkler, none of whom survived. The delayed departure was due to a mechanical discrepancy involving No. 3 generator. This generator was inoperative on arrival of N9705C at Houston. Prior to departure from Houston the Nos. 3 and 4 voltage regulators were interchanged. Actual gross weight upon departure was calculated at 83,252 pounds, including 17,000 pounds of fuel, and was 16,548 pounds less than the authorized gross weight of 99,800 pounds. The estimated time en route to Dallas was 41 minutes. The flight was given an instrument-flight-rules clearance which was to the Leona omni, via Victor Airway 13 west to the Gulf Coast intersection, direct to Leona, to maintain 2,300 feet altitude to Gulf Coast, then to climb to and maintain 9,000. At approximately 2240 the flight was cleared for takeoff and at 2242 it reported ready for takeoff and was airborne at 2244. After takeoff Houston departure control advised that it had the flight in radar contact and requested it to report when established outbound on the 345-degree radial of the Houston omni. Flight 542 complied and subsequently was cleared to 9,000 feet and advised to contact San Antonio Center on 121.1 mcs. upon passing the Gulf Coast intersection. Flight 542 reported to company radio at 2251 as blocking out of Houston at 37, taking off at 42, to cruise at 15,000 feet when so cleared, estimating Dallas at 2325, and that the Center had this information. At approximately 2252 Flight 542 reported to San Antonio Center as being over Gulf Coast intersection at 9,000 feet. The flight was then issued its destination clearance to the Dallas Airport via direct to Leona, direct to Trinidad, direct to Forney, direct to Dallas, to maintain 15,000 feet. The flight was cleared to climb to its cruising altitude. The next transmission from Flight 542 was to the San Antonio, Center, giving the time over Leona as 05 at 15,000. San Antonio Center acknowledged, and requested Flight 542 to change over and monitor the Fort Worth frequency of 120.8 mcs. at this time. The flight acknowledged. Shortly thereafter Flight 542 contacted company radio with a message for maintenance, advising that the generators were then OK out that there had been insufficient time for maintenance to insulate the terminal strip on No. 3 propeller at Houston and it would like to have it done in Dallas. At this time the flight also said it would give the communication center a Dallas estimate of 25. This was then followed by one other item for maintenance, which was that No. 3 sump pump was inoperative. This was the final transmission from the flight and was logged as completed at 2307. Structural failure of the aircraft occurred at approximately 2309 on course to the next fix, Trinidad intersection. The radial from Leona omni to Trinidad intersection is 344 degrees. The main wreckage was located 19.7 miles 2 north of Leona omni, 3.19 miles east-southeast of Buffalo, Texas. The time, 2309, correlates closely with the information obtained from witnesses to the accident as well as the time indicated on impact-stopped watches recovered at the scene. The aircraft was destroyed upon impact and all 34 occupants were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was structural failure of the left wing resulting from forces generated by undampened propeller whirl mode."}