{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-20-dk-cowombat-ridge-1-killed", "date": "Aug 24, 1954 at 1100 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Royal-Australian-Air-Force-3", "flight_phase": "Flight", "flight_type": "Military", "survivors": "Yes", "site": "Mountains", "schedule": "Sale – Bathurst – Richmond – Canberra – Sale", "msn": "13082", "yom": 1944, "flight_number": null, "city": "Cowombat Ridge", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off from Sale bound for Bathurst and Richmond. During the flight the starboard engine lost power but the plane was able to make a safe landing at Canberra. No cause for the engine failure could be found and the next morning the DC-3 departed Canberra for Sale (East Sale Airbase). At approximately 11am, just before reaching Mt Kosciuszko, the starboard engine again failed. This time however the plane lost altitude dramatically and was subject to severe turbulence. The only option was to attempt a forced landing. At that point an open flat appeared amongst the mass of forested mountains. Laurie Hawes and Bernie Mullen struggled to control the stricken aircraft while Frank Howie sent out a distress signal. They circled the flat and made their approach. Before the Dakota could land it had to clear a ridge which resulted in too much height and speed for landing on the open ground. The Murray River had to be negotiated, which runs across the flat as a small gully, as well as the severe turbulence and only one functioning engine. In the few remaining seconds Laurie made the decision to stall the plane into the timber on the south-western side of the flat. There was a group of three trees in a triangle, which he attempted to position the plane between. Hopefully they would take the force of the wings and nose. One of the trees was a little further forward than anticipated and as the Dakota hit the timber it skewed around. A large eucalyptus crashed into the cockpit destroying the starboard side where Bernie Mullen sat. The port wing sheared off and one of the blades of the starboard propeller sliced through the floor of the signaler's compartment. Finally the plane came to a halt. Laurie recalls \"the silence was deafening\". Frank and Eric escaped with slight lacerations and they released Laurie who was trapped by his legs and had sustained a deep laceration to his calf. All were suffering from shock but fearing an explosion they dragged the unconscious Bernie away from the wreckage. Nothing could be done for him. He had multiple injuries and died a few minutes after the impact. The survivors set about finding some shelter and wondered if they would be rescued from this remote location and when it might be. The weather was cold and miserable. The only shelter was the chimney of an old stockman's hut ruin on the northern side of the flat. Fortunately the distress signal that Frank sent immediately prior to the crash had been received. A little over one hour after impact a RAAF search plane piloted by Flight Sergeant Frank Daniel located the survivors. Through a series of weighted paper messages search planes were able to communicate with those on the ground and drop them survival rations. Two ground search parties then set out. The first was led by Omeo policeman Lionel Baddeley and contained several men with local knowledge, amongst them four of the Pendergasts, one of the local pioneering mountain families. The second party was the RAAF search party led by Group Captain W. N. Gibson. Baddeley's party camped out then pushed on in the early hours of August 26. They drove as far as they could and then continued on foot via an old overgrown mining track for another 10 miles. Late that morning they reached the survivors. After a short rest the long trek out began. The airmen were stiff, sore and no doubt still in shock. Their rescuers were tired having already covered the rugged, densely vegetated terrain. In addition they had to carry out Bernie Mullen's body on a bush stretcher made from saplings. All found the trip arduous. Just before nightfall they reached the vehicles. From there they drove to Benambra and spent the night at the pub. Frank Howie recalls \"After the hospitality of the locals in the public bar no one needed rocking that night.\" The next day the airmen returned to Sale. Before long Laurie Hawes was flying again. It was business as normal and the flat at the headwaters of the Murray returned to its former tranquility. Nowadays there is little left of Dakota DC3, A65-50. The RAAF removed parts for the crash investigation and the Snowy Mountains Authority built a hut using materials salvaged from the shell. People wanting a souvenir of the site took the remainder piece by piece. With so little of the aircraft left, the story of Dakota DC-3, A65-50 was likely to be lost and with it another part of our alpine heritage. Historian's Noel Gough and Dianne Carroll have spent a great deal of time and effort researching this story and documenting it. They tracked down survivors of the crash and their rescuers and a reunion was held to mark the event on 15th and 16th March this year at the Benambra Hotel, where the aircrew was first taken after their ordeal. Staff attended the gathering from Alpine and Kosciuszko National Parks who now manage the grassy flat where the DC-3 came to rest. As one of the attendees at the reunion, it was a privilege to hear the survivors and rescuers recount their versions of the events first hand. A commemorative souvenir has been produced which gives a full account of this story. It is available from Dianne Carrol.\r\nCrew: \r\nF/Lt Laurie Hawes, pilot,\r\nF/O Bernard Mullein, copilot, †\r\nF/Lt Eric Walker, navigator, \r\nP/O Frank Howie, signaler. \r\nSource:\r\nAmanda Carey Ranger\r\nNamadgi National Park\r\nACT Parks & Conservation Service\r\nDespite the credit given above to Gough and Carroll, it was Canberra historian Matthew Higgins who researched and wrote the story of the plane’s last flight, the crash, and the rescue. It is his article that appears in the commemorative souvenir booklet, though without adequate acknowledgement.", "probable_cause": "Failure of the right engine in flight."}