{"url": "https://www.baaa-acro.com/crash/crash-comp-air-ca-8-merritt-island", "date": "Nov 28, 2012 at 1435 LT", "type": "Comp Air CA-8", "operator": "Bog-Hog-Mud-Motors", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Merritt Island - Merritt Island", "msn": "998205", "yom": 2001, "flight_number": null, "city": "Merritt Island", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5569, "captain_hours_type": 102, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 923, "circumstances": "On November 28, 2012, about 1435 eastern standard time, an experimental amateur-built Comp Air 8 (CA-8), N155JD, operated by a private individual, was substantially damaged during a go-around, while attempting to land at the Merritt Island Airport (COI), Merritt Island, Florida. The certificated commercial pilot sustained serious injuries and a passenger sustained minor injuries. Visual meteorological conditions prevailed and no flight plan was filed for the personal flight that was conducted under the provisions of 14 Code of Federal Regulations Part 91. The pilot reported that he flew from Smithfield, North Carolina, to Marion, South Carolina (MAO), without incident. After refueling, he departed MAO for COI. While en route, approximately 150 miles north of Ormond Beach, Florida, the airplane began to experience a left rolling tendency, which required right aileron control inputs to counteract. He configured the fuel selector to the left fuel tank in an attempt to lighten the wing and compensate for the turning tendency; however, the force required to maintain directional control became greater as the flight progressed. The pilot subsequently entered the traffic pattern at COI for runway 29, a 3,601-foot-long, 75- foot-wide, asphalt runway. While maneuvering in the traffic pattern, full right aileron control was required to maintain straight and level flight, and only a slight relaxing of right aileron control was needed to turn left. The pilot had difficulty compensating for a northwest crosswind, which resulted in the airplane drifting to the southern edge of the runway. He performed a go-around and lined-up on the northern side of the runway 29 approach course for a second landing attempt, which again resulted in a go-around. When the pilot applied engine power, the airplane began to slowly roll to the left despite right aileron and rudder control inputs. He decreased engine power; however, the airplane's left wing struck the ground and the airplane flipped-over. The left wing, propeller, and empennage separated during the impact sequence. The airplane's flight controls were electrically actuated. On site examination of the airplane by a Federal Aviation Administration (FAA) inspector did not reveal any preimpact malfunctions, which would have precluded normal operation. The fuel tanks were compromised during the accident. The airplane's rudder, elevator, and aileron control servos were removed for further examination. According to the FAA inspector, the rudder and elevator control servos functioned normally; however, the aileron control servo sustained impact damage during the accident sequence and could not be tested. The six seat, high-wing, tail-wheel, turboprop airplane, serial number 998205, was constructed primarily of composite material and was equipped with a Walter M601D series, 650 horsepower engine, with an AVIA 3-bladed constant-speed propeller. According to FAA records, the airplane was issued an experimental airworthiness certificate on April 26, 2001. The airplane was purchased from one of the builders, by the commercial pilot, through a corporation, on September 30, 2012. At that time, the airplane had been operated for about 925 total hours and had undergone a condition inspection. The pilot reported about 5,570 hours of total flight experience, which included about 100 hours in the same make and model as the accident airplane. In addition, the pilot had accumulated about 23 hours and 5 hours in make and model, during the 30 and 90 days preceding the accident, respectively. Winds reported at an airport located about 8 miles southeast of the accident site, about the time of the accident, were from 340 degrees at 16 knots.", "probable_cause": "The pilot's improper decision to continue a cross-country flight as a primary control (aileron) system anomaly progressively worsened. Contributing to the accident was an aileron control system anomaly, the reason for which could not be determined because the aileron control system could not be tested due to impact damage, and the pilot’s inability to compensate for crosswind conditions encountered during the approach due to the aileron problem."}