{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-giv-sp-santo-domingo-9-killed", "date": "Dec 15, 2021 at 1722 LT", "type": "Gulfstream GIV", "operator": "Helidosa", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "La Isabela - Orlando", "msn": "1482", "yom": 2002, "flight_number": null, "city": "Santo Domingo-Las Américas", "zone": "Santo Domingo", "country": "Dominican Republic", "region": "Central America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed La Isabela-Dr. Joaquín Balaguer Airport on a charter flight to Orlando, carrying six passengers and three crew members. Shortly after takeoff, the crew informed ATC about technical problems and was cleared to divert to Santo Domingo-Las Américas Airport for an emergency landing. On approach, the aircraft went out of control and crashed, bursting into flames. The aircraft disintegrated on impact and all nine occupants were killed, among them the Portorican music artist José Angel Hernández aka Flow La Movie. According to a preliminary report, the crew encountered technical problems with the spoilers and maintenance was performed to change the ground spoiler actuators. After maintenance, the crew completed a ground check and while all spoilers properly deployed on both wings, only the spoilers on the left wing retracted as the spoilers on the right wing remained deployed. The crew failed to notice this asymetry. Immediately after takeoff, the crew reported controllability problems and elected to return but finally decided to divert to Las Américas Airport. The aircraft eventually went out of control and crashed 16 minutes after takeoff. ", "probable_cause": null}