{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-32-port-harcourt-108-killed", "date": "Dec 10, 2005 at 1408 LT", "type": "Douglas DC-9", "operator": "Sosoliso-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Abuja - Port Harcourt", "msn": "47562", "yom": 1972, "flight_number": "SO1145", "city": "Port Harcourt", "zone": "Rivers", "country": "Nigeria", "region": "Africa", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 103, "pax_fatalities": 101, "other_fatalities": 0, "total_fatalities": 108, "captain_hours": 10050, "captain_hours_type": 1900, "copilot_hours": 920, "copilot_hours_type": 670, "aircraft_hours": 51051, "circumstances": "The aircraft with call sign OSL 1 145 which departed Abuja at 1225 hrs UTC (1.25 pm local time) with endurance of 2 hours 40 minutes was on a scheduled passenger flight enroute Port Harcourt with 110 Persons on Board (103 Passengers and 7 Crew) and the flight continued normally. At 1241 hours UTC, the aircraft cruising at FL240 (24,000ft) Above Sea Level (ASL) got in contact with Port Harcourt Approach Control. The Approach control gave the OSL 1145 in - bound clearance to expect no delay on ILS Approach to runway 21, QNH of 1008 and temperature of 33° C. At about 1242 hours UTC (1.42pm local), the Approach controller passed the 1230 hours UTC weather report to the aircraft as follows: Wind - 260° /02kts Visibility - 12km Weather - Nil Cloud - BKN 420m, few CB (N-SE) at 690m QNH - 1008HPA Temperature - 33° C. About 1250 hours UTC (1.50 pm local), the aircraft, which was 90 nautical miles to the station, contacted Approach Control for initial descent clearance and was cleared down to FL 160. The aircraft continued its descent until about 1300 hours UTC (2.00 pm local) when the crew asked Approach Control whether it was raining over the station to which the controller reported negative rain but scattered CB and the crew acknowledged. At 1304 hours UTC, the crew reported established on the glide and the localizer at 8 nautical miles to touch down. Then the Approach controller informed the aircraft of precipitation approaching the station from the direction of runway 21 and passed the aircraft to Tower for landing instructions. At 1305 hours UTC, the aircraft contacted Tower and reported established on glide and localizer at 6 nautical miles to touch down. The controller then cleared the airplane to land on runway 21 but to exercise caution as the runway surface was slightly wet and the pilot acknowledged. At about 1308 hours UTC, the aircraft made impact with the grass strip between runway 21 and taxiway i.e. 70m to the left of the runway edge, and 540m from the runway 21 threshold. At about 60m from the first impact, the aircraft tail section impacted heavily with a concrete drainage culvert. The airplane then disintegrated and caught fire along its path spanning over 790m. The cockpit section and the forward fuselage were found at about 330m from the rest of the wreckage further down on the taxiway creating a total wreckage trail of 1 120m. Fire and rescue operations were carried out after which 7 survivors and 103 bodies were recovered. Five of the survivors died later in the hospital. The accident occurred in `Instrument Meteorological Conditions' (IMC) during the day. ", "probable_cause": "The probable cause of the accident was the crew's decision to continue the approach beyond the Decision Altitude without having the runway and/or airport in sight.\r\nThe contributory factors were:\r\n- The crew's delayed decision to carry out a missed approach and the application of improper procedure while executing the go-around.\r\n- The aircraft encountered adverse weather conditions with the ingredients of wind shear activity on approach.\r\n- The reducing visibility in thunderstorm and rain as at the time the aircraft came in to land was also a contributory factor to the accident. And the fact the airfield lightings were not on may also have impaired the pilot from sighting the runway.\r\n- Another contributory factor was the fact that the aircraft had an impact with the exposed drainage concrete culvert which led to its disintegration and subsequent tire outbreak. "}