{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-dakota-iii-raf-zeals-20-killed", "date": "Feb 19, 1945 at 1526 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Royal-Air-Force-4", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Zeals - Leicester", "msn": "19349", "yom": 1943, "flight_number": null, "city": "Zeals AFB", "zone": "Wiltshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 17, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was assigned to the Glider Pick-Up Training Flt, whose role was to train crews in the 'snatch take-off method for retrieving gliders. Those on board were mostly returning to their base in Leicester, on completion of the course of instruction at Zeals. The aircraft took off at 1523LT in conditions of broken cloud, with some patches down to 100 feet and generally overcast, a westerly wind at 10 mph and visibility of 1 to 2 miles at ground level. The pilot made a quarter circuit of the airfield and then set course to the north-east. Three minutes later, whilst flying in and out of the broken cloud and whilst in level flight, the aircraft flew into a clump of 60 foot tall beech trees on top of a knoll. The impact ripped 10 feet off the port wing and the aircraft rolled to port, hit two more trees and then impaled itself on a cluster of four mature trees, caught fire and disintegrated, scattering wreckage over a distance of 300 yards on the far side of the knoll. Destruction of the aircraft was complete but investigation revealed the engines to have been at a high power setting on impact.\nCrew:\nF/Lt Reed Tilton Hyde, pilot,\nF/O James Cassells Howden, pilot, \nF/O Gerard Jean Guay, wireless operator,\nF/O Mervyn Esmond Llewellyn Scovell, navigator.\nPassengers:\nF/Sgt Alan Geoffrey Shaddick, pilot,\nF/Sgt John Ogilvy Allen, wireless operator,\nF/Sgt Leslie Daniel Slipper, pilot,\nF/Lt Thomas Arthur Evans, pilot,\nF/Lt Alan James Roberts, pilot,\nF/O Sidney Graham Williams, navigator,\nF/Sgt Donald Grant, navigator,\nF/Sgt Maxwell Vernon Gilder, \nF/Sgt James Ross, flight engineer,\nF/Sgt Ronald Edward Jelfs, flight engineer,\nF/Lt Douglas Elliott Turnbull, wireless operator,\nF/Lt John Heywood, equipment officer,\nCpl Kenneth Stanley Anderson, \nLAC Reginald Ernest Suggars, \nLAC Walter James Colby, \nF/Lt Frank Joseph Plant, navigator.\nSource: http://ww2talk.com/", "probable_cause": "The Accident Report, published on 17 May 45, suggests that the pilot who was the sole survivor, had failed to climb to a safe height when flying in poor visibility, although the knoll was a well known obstruction in close proximity to the airfield. The tragic sequel to this loss is that the pilot, who had been awarded the DFC for his gallantry on operations, followed a restless career afterwards leaving and returning to the RAF until finally joining the Foreign Service and being appointed an Assistant District Officer. While on assignment in Kenya, he committed suicide."}