{"url": "https://www.baaa-acro.com/crash/crash-canadair-regional-jet-crj-200pf-near-akkajaure-lake-2-killed", "date": "Jan 8, 2016 at 0020 LT", "type": "Canadair RegionalJet CRJ-200", "operator": "West-Air-Sweden.gif", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Oslo – Tromsø", "msn": "7010", "yom": 1993, "flight_number": "SWN294", "city": "Akkajaure Lake", "zone": "Norrbotten", "country": "Sweden", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3365, "captain_hours_type": 2208, "copilot_hours": 3232, "copilot_hours_type": 1064, "aircraft_hours": 38601, "circumstances": "The flight was uneventful until the start of the event, which occurred during the approach briefing in level flight at FL 330. The event started at 00:19:20 hrs during darkness without moonlight, clouds or turbulence. The lack of external visual references meant that the pilots were totally dependent on their instruments which, inter alia consisted of three independent attitude indicators. According to recorded data and simulations a very fast increase in pitch was displayed on the left attitude indicator. The pilot in command, who was the pilot flying and seated in the left seat exclaimed a strong expression. The displayed pitch change meant that the pilot in command was subjected to a surprise effect and a degradation of spatial orientation The autopilot was, most probably, disconnected automatically, a “cavalry charge” aural warning and a single chime was heard, the latter most likely as a result of miscompare between the left and right pilots’ flying displays (PFD). Both elevators moved towards nose down and nose down stabilizer trim was gradually activated from the left control wheel trim switch. The airplane started to descend, the angle  of attack and G-loads became negative. Both pilots exclaimed strong expressions and the co-pilot said “come up”. About 13 seconds after the start of the event the crew were presented with two contradictory attitude indicators with red chevrons pointing in opposite directions. At the same time none of the instruments displayed any comparator caution due to the PFDs declutter function in unusual attitude. Bank angle warnings were heard and the maximum operating speed and Mach number were exceeded 17 seconds after the start of the event, which activated the overspeed warning. The speed continued to increase, a distress call was transmitted and acknowledged by the air traffic control and the engine thrust was reduced to flight idle. The crew was active during the entire event. The dialogue between the pilots consisted mainly of different perceptions regarding turn directions. They also expressed the need to climb. At this stage, the pilots were probably subjected to spatial disorientation. The aircraft collided with the ground one minute and twenty seconds after the initial height loss. The two pilots were fatally injured and the airplane was destroyed.", "probable_cause": "The erroneous attitude indication on PFD 1 was caused by a malfunction of the Inertial Reference Unit (IRU 1). The pitch and roll comparator indications of the PFDs were removed when the attitude indicators displayed unusual attitudes. In the simulator, in which the crew had trained, the corresponding indications were not removed. During the event the pilots initially became communicatively isolated from each other. The current flight operational system lacked essential elements which are necessary. In this occurrence a system for efficient communication was not in place. SHK considers that a general system of initial standard calls for the handling of abnormal and emergency procedures and also for unusual and unexpected situations should be incorporated in commercial aviation. The accident was caused by insufficient operational prerequisites for the management of a failure in a redundant system.\r\nContributing factors were:\r\n- The absence of an effective system for communication in abnormal and emergency situations,\r\n- The flight instrument system provided insufficient guidance about malfunctions that occurred,\r\n- The initial maneuver that resulted in negative G-loads probably affected the pilots' ability to manage the situation in a rational manner."}