{"url": "https://www.baaa-acro.com/crash/crash-avro-691-lancastrian-iii-mt-tupungato-11-killed", "date": "Aug 2, 1947 at 1441 LT", "type": "Avro 691 Lancastrian", "operator": "BSAA", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "London – Lisbon – Banjul – Natal – Buenos Aires – Santiago de Chile", "msn": "1280", "yom": 1945, "flight_number": "CS59", "city": "Mt Tupungato", "zone": "Mendoza", "country": "Argentina", "region": "South America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 1971, "captain_hours_type": 473, "copilot_hours": 2129, "copilot_hours_type": 127, "aircraft_hours": 1655, "circumstances": "After passing over Mendoza, enroute to Santiago de Chile, the crew encountered poor weather conditions with strong winds (up to 180 km/h) and heavy snow falls. While cruising at an altitude of 15,000 feet, the four engine aircraft christened 'Star Dust' hit the slope of Mt Tupungaro located in the Argentinian Andes. As the airplane failed to arrive, SAR operations were conducted but eventually suspended few days later as no trace of the aircraft nor the crew was found. About 53 years later, in 2000, an official mission conducted by Argentinian Army Officers and Scientists was organized to find the aircraft. Few debris and three bodies were found and repatriated down to the valley. ", "probable_cause": "In 1947, through lack of evidence due to no wreckage having been found, the cause of the accident remained obscure. The possibility of severe icing cannot be ignored. Later, in 2001, an investigation commission conducted by Argentinian and British experts concluded that the accident was probably caused by a premature descent on part of the crew due to strong head winds. The presence of strong winds at high altitude reduced the speed of the aircraft and the crew was not aware of these winds. Due to lack of visibility, the crew started the descent and was not able to distinguish the mountains. "}