{"url": "https://www.baaa-acro.com/crash/crash-cessna-207a-skywagon-neat-twin-hills-1-killed", "date": "Sep 26, 1997 at 1306 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Yute%20Air", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Manokotak - Togiak", "msn": "207-0774", "yom": 1984, "flight_number": null, "city": "Twin Hills", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7470, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14089, "circumstances": "The flight departed with 180 pounds of cargo after deplaning a passenger. Three company pilots overheard the accident pilot report that he was 13 minutes from his destination. The overdue aircraft was located by company airplanes about 700 feet MSL, on the east (downwind) side of an 890 feet msl pass. The airplane impacted on a 330 degree heading and perpendicular to the axis of the canyon/pass (oriented east-west), in a flat attitude, with no ground scars leading to the wreckage. No anomalies were found with the airplane, and all blades on the propeller exhibited torsional twisting and leading edge gouging. A westerly wind of seven to nine knots existed and numerous pilots reported the mountain passes were not obscured by clouds. Photographs from the pilot's camera depicted views of the accident canyon, with the pass and accident site above the altitude from which the photographs were taken. These photographs contained the date of the accident. Numerous depressant and stimulant, over-the-counter cold and asthma medications were found in the pilot's flight bag. Toxicological tests detected several over-the counter medications used for cold and asthma symptoms with illness effect of distraction or sensory disturbance. As a result of the condition for which the drugs were ingested may have also played a role in the accident. ", "probable_cause": "Improper in-flight planning/decision by the pilot, and his failure to maintain sufficient altitude over mountainous terrain. Factors related to the accident were downdraft conditions, mountainous/hilly terrain, and the use of over-the-counter medications."}