{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-20cc-thomson-2-killed", "date": "Oct 5, 2021 at 0544 LT", "type": "Dassault Falcon 20", "operator": "Career Aviation (Pak West Airlines)", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Lubbock - Thomson", "msn": "83", "yom": 1967, "flight_number": "PKW887", "city": "Thomson-McDuffie County", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On October 5, 2021, at 0544 eastern daylight time, a Dassault Fanjet Falcon airplane, N283SA, was destroyed when it was involved in an accident near the Thomson-McDuffie County Airport (HQU), Thomson, Georgia. The captain and first officer were fatally injured. The airplane was operated as Pak West Airlines Flight 887 dba Sierra West Airlines, as an on-demand cargo flight under the provisions of Title 14 Code of Federal Regulations Part 135. According to operator records, the flight crew initiated the first flight of the night at 2132 mountain daylight time from their home base of El Paso International Airport (ELP), El Paso, Texas to Lubbock Preston Smith International Airport (LBB), Lubbock, Texas. After about a 2 hour and 20-minute ground delay waiting for the freight, the accident flight was initiated from LBB to HQU. Review of preliminary air traffic control communications provided by the Federal Aviation Administration (FAA) revealed that the flight was in contact with the Atlanta Air Route Traffic Control Center (ATL center) for about the final 40 minutes of the flight. At 0503 eastern daylight time, Pak West Flight 887 (PKW887) requested information about the Notices to Airman (NOTAMs) for the instrument landing system (ILS) localizer runway 10 instrument approach procedure at HQU. ATL Center informed the flight crew of two NOTAMs; the first pertained to the ILS runway 10 glidepath being unserviceable and the second applied to the localizer being unserviceable. The controller informed the flight crew that the localizer NOTAM was not in effect until later in the morning after their expected arrival, which was consistent with the published NOTAM. About 0525, ATL center asked PKW887 which approach they would like, to which they responded with the “ILS runway one zero approach.” The controller responded, “roger, standby for that.” At 0526, ATL center cleared PKW887 to CEDAR intersection which was the initial approach fix for the ILS or localizer/non-directional beacon (NDB) runway 10 approach. About 0537, ATL center informed PKW887 that they were 15 miles southwest from CEDAR and “cross CEDAR at or above 3,000 cleared ILS localizer one zero into Thomson McDuffie.” PKW887 readback the clearance and the controller stated it was a “good readback”, however, the controller informed the flight crew that they were transmitting on the “guard” emergency frequency of 121.5, rather than the center frequency. About 1 minute later, the controller advised PKW887 of a telephone number to call to cancel their instrument flight rules (IFR) clearance once on the ground; however, about 0543, PKW887 had just crossed CEDAR and requested to cancel their IFR clearance. The controller advised PKW887 to “squawk vfr” and no further communications were received. Surveillance video located at HQU showed that about 0539 the airport and runway lights were activated from off to on. About 0542 the airplane’s landing lights came into view in the pitchblack horizon and were subsequently visible for about 2 minutes. The video showed the airplane approaching runway 10 in a relatively constant descent and heading; however, about 25 seconds before the airplane’s landing lights disappeared, a momentary right turn, followed by a left turn and increased descent rate was observed. No explosion or glow of fire was observed when the landing lights disappeared about 0544. Review of preliminary FAA Automatic Dependent Surveillance – Broadcast (ADS-B) data revealed that the airplane crossed CEDAR intersection about 2,500 ft mean sea level (msl). The airplane continued toward runway 10 in a descent; the final data recorded was at 0543:54 with the airplane at 800 ft msl and 1.36 nautical miles from the runway threshold. Figure 1 provides an overview of the ADS-B data from the approach and the location of the wreckage. A search was initiated for the airplane based upon inquiries from the operator’s dispatch to the airport and an active emergency locator beacon near the runway. The airplane was located about .70 nautical mile from runway 10 about 0630. According to FAA airman and operator records, the captain held an airline transport pilot certificate with a type rating in the accident airplane. He was issued a first-class medical certificate in January 2021. He had accumulated a total flight experience of about 12,000 hours, with 1,665 hours in the accident make and model airplane, of which 1,325 hours were The first officer held a second-in-command type rating in the accident airplane. He was issued a second-class medical certificate in March 2021. He had accumulated a total flight experience of about 11,000 hours, of which 1,250 hours were in the accident make and model airplane. The initial impact point coincided with broken pine tree branches among a forest where the trees were about 150 ft tall. The debris path was oriented on a heading of about 100° and spanned about 880 ft from the initial impact to the main wreckage area. The airplane was heavily fragmented, however, there was no evidence of fire. The largest fragments of wreckage were concentrated in three primary areas overviewed in Figure 2. The figure shows the initial impact point and a pop-out drone image that describes the three areas. All major components of the airplane were located in the debris path. Flight control continuity could not be determined from the control surfaces to the cockpit due to the heavy fragmentation, however, within the fragmented flight control areas continuity was observed. The flaps were observed to be extended, and the right landing gear was observed to be down. The horizontal stabilizer and its jack screw were found to be within a normal envelope. Examination of the cockpit found the flap selector in the full flaps 40° position and the landing gear handle was selected down. Both engines exhibited impact damage and varying degrees of foreign object debris ingestion that had the appearance of wood chips and green vegetation in the center core of the engine when viewed with a borescope. Several fan blades exhibited leading edge gouging, knicks, and torsional twisting. The airplane was not required to be equipped with a cockpit voice recorder (CVR); however, a CVR was installed. It was located in the debris path near the empennage and was retained for read-out and transcription. The airplane was not equipped with a flight data recorder, nor was it required.", "probable_cause": null}