{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-shreveport-2-killed", "date": "Feb 28, 2019 at 1039 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Lennard%20Properties.png", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Shreveport - Vernon", "msn": "46-36232", "yom": 1999, "flight_number": null, "city": "Shreveport-Downtown", "zone": "Louisiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1393, "captain_hours_type": 323, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1901, "circumstances": "The instrument-rated private pilot and passenger departed into instrument meteorological conditions with a 600-ft cloud ceiling in an airplane that was about 550 lbs over gross weight. Air traffic control data showed the airplane in a climbing left turn that continued beyond the assigned heading. After reaching 1,400 ft msl, the airplane continued turning left and its altitude and speed began to vary. The airplane continued in a left spiral, completing more than two full circles, then decelerated in a right turn and rapidly descended until impact with terrain. Examination of the flight control system revealed no evidence of mechanical malfunctions and downloaded engine data indicated normal engine operation. Downloaded data from the autopilot system revealed three in-flight error codes. The first error code, which likely occurred about 1 minute after takeoff, would have resulted in the autopilot, if it was engaged at the time, disengaging. The subsequent error codes likely occurred during the erratic flight profile, with the autopilot disengaged. Before the accident flight, the pilot had informed a mechanic, who is also a pilot, of intermittent issues with the autopilot system and that these issues were unresolved. The mechanic had flown with the accident pilot previously and assessed his instrument flying skills as weak. The flight instructor who provided initial flight training for the turbine engine transition stated the pilot's instrument flying proficiency was poor when he was hand flying the airplane. Toxicology testing revealed that the pilot had used marijuana, and his girlfriend stated the pilot would take a marijuana gummy before bedtime to sleep more soundly. However, given that no psychoactive compounds were found in blood specimens, it is unlikely that the pilot was impaired at the time of the accident. The instrument conditions at the time of the accident, the airplane's erratic flightpath, and the pilot's reported lack of instrument proficiency when flying by hand support the likelihood that the pilot experienced spatial disorientation sometime after takeoff. In addition, given the reports of the intermittently malfunctioning autopilot that had not been fixed, it is likely the pilot experienced an increased workload during a critical phase of flight that, in combination with spatial disorientation, led to the pilot's loss of airplane control.", "probable_cause": "The pilot's conduct of a departure into instrument meteorological conditions (IMC), which resulted in spatial disorientation and subsequent loss of airplane control. Contributing to the accident was the pilot's poor instrument flying skills and his decision to depart into IMC with an unresolved autopilot maintenance issue.\n"}