{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-53-lisbon-61-killed", "date": "May 30, 1961 at 0120 LT", "type": "Douglas DC-8", "operator": "Viasa", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Rome – Madrid – Lisbon – Santa Maria – Caracas", "msn": "45615", "yom": 1961, "flight_number": "VA897", "city": "Lisbon-Portela de Sacavém", "zone": "Estremadura - Lisbon District", "country": "Portugal", "region": "Europe", "crew_on_board": 14, "crew_fatalities": 14, "pax_on_board": 47, "pax_fatalities": 47, "other_fatalities": 0, "total_fatalities": 61, "captain_hours": 12886, "captain_hours_type": 189, "copilot_hours": 12913, "copilot_hours_type": 78, "aircraft_hours": 209, "circumstances": "VIASA Flight 897 operated on the route Rome - Madrid (MAD) - Lisbon (LIS) - Santa Maria (SMA) - Caracas (CCS) when it landed at Lisbon at 00:06 UTC. Following a crew change and inspection by KLM maintenance personnel the flight was cleared for a runway 23 departure. The DC-8 took off at 01:15, heading the Capiraca (LS) NDB. At 01:18:37 the aircraft advised that the cloud base was at 3700 ft and changed to the Lisbon area control frequency. It reported again at 01:19 :25 to Lisbon Control that it was \"over LS at 19 climbing through FL 60\". This message ended with two quickly spoken sentences. This was the last radio contact with the flight. The DC-8 entered a spiral dive to the left during the last message, banking to the left to 90° within about 20 seconds and striking the water after another 15 seconds . During the last 15 seconds, the bank was over-corrected to the right. It struck the sea with a pitch angle of approximately 25° nose down, while it was probably banking 30° to the right.", "probable_cause": "Notwithstanding a very thorough, time-consuming investigation, in which many authorities and experts co-operated, it was not possible to establish a probable cause of the accident. The Netherlands, as state of registry commented: Though there are no direct indications in this respect, the Board regards it as possible that the accident was due to the pilot or pilots being misled by instrument failure, in particular of the artificial horizon, or to the pilot having been distracted, so that a serious deviation from the normal flight path was not discovered in time."}