{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-230-medan-149-killed", "date": "Sep 5, 2005 at 1015 LT", "type": "Boeing 737-200", "operator": "Mandala", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "City", "schedule": "Medan - Jakarta", "msn": "22136", "yom": 1981, "flight_number": "RI091", "city": "Medan-Polonia", "zone": "North Sumatra", "country": "Indonesia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 112, "pax_fatalities": 95, "other_fatalities": 49, "total_fatalities": 149, "captain_hours": 7522, "captain_hours_type": 7302, "copilot_hours": 2353, "copilot_hours_type": 685, "aircraft_hours": 51599, "circumstances": "On 5 September 2005, at 03:15 UTC, Mandala Airlines registered PK-RIM, operating as flight number MDL 091, a Boeing 737-200 departing for Soekarno-Hatta Airport, Jakarta from Medan. The previous flight was from Jakarta and arrived at Medan uneventfully. The same crew have flight schedule on the same day and returned to Jakarta. The flight was a regular scheduled passenger flight and was attempted to take-off from Polonia Airport, Medan, North Sumatra to Jakarta and it was the second trip of the day for the crew. At 02.40 UTC information from dispatcher, those embarking passengers, cargo process and all flight documents were ready. At 02.52 UTC, Mandala/MDL 091 asked for push back and start up clearance bound for Jakarta from the Air Traffic Controller/ATC, after received the approval from the ATC they began starting the engines. At 02.56 UTC, the controller cleared MDL 091 taxi into position on runway 23 via Alpha. At 03.02 UTC, MDL 091 received clearance for take off with additional clearance from ATC to turn left heading 120º and maintain 1500 ft. The MDL 091 read back the clearance heading 120º and maintains 1000 ft. The ATC corrected the clearance one thousand five hundred feet. The MDL 091 reread back as 1500 ft. Some of the passengers and other witnesses stated that the aircraft has lifted its nose in an up attitude and take off roll was longer than that normally made by similar airplanes. Most of them stated that the aircraft nose began to lift-off about few meters from the end of the runway. The ATC tower controller recalled that after rotation the plane began to “roll” or veer to the left and to the right. Some witnesses on the ground recalled that the airplane left wing struck a building before it struck in the busy road, then heard two big explosions and saw the flames. Persons on board in MDL 091, 5 crew and 95 passengers were killed, 15 passengers seriously injured and 2 passengers (a mother and child) were reported survived without any injuries; and other 49 persons on ground were killed and 26 grounds were serious injured. ", "probable_cause": "The National Transportation Safety Committee determines that probable causes of this accident are:\r\n• The aircraft took-off with improper take off configuration namely with retracted flaps and slats causing the aircraft failed to lift off.\r\n• Improper checklist procedure execution had lead to failure to identify the flap in retract position.\r\n• The aircraft’s take off warning horn was not heard on the CAM channel of the CVR. It is possible that the take-off configuration warning horn was not sounding. "}