{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2-surgut-14-killed", "date": "Nov 1, 1974 at 1456 LT", "type": "PZL-Mielec AN-2", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Khanty-Mansiysk - Surgut", "msn": "1G132-21", "yom": 1971, "flight_number": "SU662", "city": "Surgut", "zone": "Khantia-Mansia okrug", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2591, "circumstances": "Following an uneventful flight from Khanty-Mansiysk, the crew was cleared to continue the approach to runway 25 when he encountered marginal weather conditions with low clouds (130 meters above the ground) and limited visibility. While on approach at an altitude of 150 metres, the single engine airplane collided with a Mil Mi-8T. Registered CCCP-25686, it just took off from Surgut Airport bound to Nefteyugansk with 21 passengers and three crew members on board. Following the collision, both airplanes crashed in a wooded area, 600 meters from each other. Both machines were destroyed and none of the 38 occupants survived the collision. ", "probable_cause": "The collision was the consequence of wrong decisions on part of ATC at Surgut Airport who cleared the Antonov AN-2 crew to continue the descent while they actually had no idea of his real position. Following an accumulation of negligences, ATC failed to coordinate both movements, failed to inform both crews about the presence of a second aircraft in the traffic pattern and authorized the crew of the helicopter to take off while they did no have any idea about the exact position of the Antonov. The lack of visibility caused by the presence of low clouds remained a contributing factor, as well as the fact that the Antonov AN-2 crew continued the descent below weather minima."}