{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-hayden-2-killed", "date": "Dec 22, 2008 at 1218 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Joseph F. Brumleve", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Hutchinson – Hayden", "msn": "46-8608039", "yom": 1986, "flight_number": null, "city": "Hayden-Yampa Valley", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1967, "captain_hours_type": 823, "copilot_hours": 2067, "copilot_hours_type": 798, "aircraft_hours": 3302, "circumstances": "Radar data showed the airplane proceeding outbound for the procedure turn. The pilot reported that they were having trouble extending the landing gear and stated, \" ... we’re trying to turn back in and do our gear here all at the same time.\" Shortly thereafter, the other pilot reported that they had extended the gear and had \"three good, three green lights, so we’re hoping the gear is down.\" The pilot also said, \"we are now turned inbound.\" She was told to contact Unicom. This was the last recorded radio transmission from the flight. The Unicom operator said that she heard the pilot say that they were \"coming in.\" Radar data indicated the airplane crossed the localizer at almost a 90-degree angle and continued turning right until it started to intercept the localizer. The data then indicated that the airplane made a left turn away from the localizer that continued and terminated near the accident site. The turn was captured by six plots. The first plot showed the airplane had descended from 9,400 feet to 9,200 feet and its ground speed had increased from 85 knots to 152 knots. The second plot showed the altitude had increased to 9,700 feet and ground speed had decreased to 132 knots. The third plot showed the altitude had increased further to 10,200 feet and ground speed had dropped to 76 knots. The fourth plot showed the airplane had made almost a 180-degree turn and was at 8,900 feet and at a ground speed of 120 knots. The fifth plot showed the airplane was at 8,700 feet and 20 knots. The sixth and final plot showed the airplane at 8,400 feet and 38 knots. An examination of the airplane showed both wing flap jackscrews retracted and the landing gear actuators extended. The landing gear control switch was in the down position and the emergency gear extension knob was pulled out to full travel. Reduced visibility and clouds were in the vicinity of the airport at the time of the accident.", "probable_cause": "The pilot's loss of situational awareness while maneuvering in adverse weather conditions, resulting in spatial disorientation."}