{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-049e-constellation-richmond-77-killed", "date": "Nov 8, 1961 at 2124 LT", "type": "Lockheed L-049 Constellation", "operator": "Imperial Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Newark – Wilkes Barre – Baltimore – Columbia ", "msn": "1976", "yom": 1946, "flight_number": "IM201", "city": "Richmond", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 3, "pax_on_board": 74, "pax_fatalities": 74, "other_fatalities": 0, "total_fatalities": 77, "captain_hours": 4433, "captain_hours_type": 293, "copilot_hours": 17841, "copilot_hours_type": 352, "aircraft_hours": 32589, "circumstances": "On November 8, 1961, at 2124 e.s.t., an Imperial Airlines, Lockheed L-49, crashed and burned during an attempted landing at Byrd Field, Richmond, Virginia. Seventy-four passengers and three flight crew members died as a result of carbon monoxide poisoning. Two members of the flight crew escaped from the burning wreckage. The aircraft was totally destroyed. The flight was en route from Baltimore, Maryland, to Columbia, South Carolina, when in the vicinity of Richmond the crew as a result of fuel mismanagement allowed the Nos. 3 and 4 engines to run the No. 4 fuel tank dry. When they were unable to restart the two engines, they feathered the propellers and elected to land at Richmond. As the flight approached the airport for its intended landing on runway, Captain Greenlee, who was acting as copilot, without warning to the captain in command, turned the aircraft to attempt a landing on runway 02 and put the landing gear selector in the down position. When the landing gear did not extend due to crew mismanagement of the hydraulic system, a go-around was attempted with only the Nos. 1 and 2 engines operating. During the go-around, which was poorly executed, the No. 1 engine failed as a result of overboosting. With only one engine remaining in operation it was impossible to maintain flight. The crew also misjudged the aircraft flight path, overshot the extended centerline of runway 33 and crashed one-half mile to the left of the final approach path and one mile from the runway threshold.", "probable_cause": "The Board determines the probable cause of this accident was the lack of command coordination and decision, lack of judgment, and lack of knowledge of the equipment resulting in loss of power in three engines creating an emergency situation which the crew could not handle."}