{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-fitchburg-6-killed", "date": "Apr 4, 2003 at 0935 LT", "type": "Beechcraft 200 Super King Air", "operator": "FS Corsair", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York-LaGuardia – Fitchburg", "msn": "BB-1739", "yom": 2000, "flight_number": null, "city": "Fitchburg", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 6100, "captain_hours_type": 1334, "copilot_hours": 1080, "copilot_hours_type": 4, "aircraft_hours": 359, "circumstances": "While on approach to the airport, the airplane entered a left turn, which the surviving passenger described as \"almost completely upside down.\" The airplane briefly leveled, then entered another left turn with a bank angle of the same severity. The airplane seemed to roll level, then entered a steep dive, until it impacted a building. The passenger reported that the engines were running normally throughout the entire flight, and the steep turns performed by the pilot did not concern her, as she had flown with him before and knew he \"liked to make sharp turns.\" Examination of the airplane and engines revealed no pre-impact mechanical anomalies, and weather at the time of the accident included a broken cloud ceiling of 1,100 feet, with 3 miles visibility in mist. According to the FAA, Airplane Flying Handbook,\"...[An] airplane will stall at a higher indicated airspeed when excessive maneuvering loads are imposed by steep turns, pull-ups, or other abrupt changes in its flightpath.\" A review of the \"Stall Speeds - Power Idle\" chart from the POH revealed that with approach flaps selected, at a bank angle of 60 degrees, the airplane would stall at about 123 knots. Radar data indicated the airplane descended along the approach course at an average speed of 120 knots. Toxicology testing performed on the pilot revealed imipramine and carbamazepine in the pilot's urine and blood, and morphine in the pilot's urine. According to the pilot's medical and pharmacy records, he suffered from a severe neurological disorder, possibly a seizure disorder, which resulted in frequent, unpredictable episodes of debilitating pain. Additionally, approximately three months prior to the accident, the pilot was diagnosed with viral meningitis, and a severe skin infection with multiple abscesses on his extremities. The pilot had been prescribed imipramine, an antidepressant that has detrimental effects on driving skills and other cognitive functions. He had also been prescribed carbamazepine, typically used to control seizures or treat certain chronically painful conditions. Carbamazepine has measurable impairment of performance on a variety of psychomotor tests. Morphine, a prescription opiate painkiller, is also a metabolite of heroin and many prescription medications, such as codeine, used to control moderate pain. No indication was observed in the pilot's medical records that he was recently prescribed any opiates. Neither the pilot's medical condition, nor the medication he was routinely taking was reported on his application for an airman medical certificate.", "probable_cause": "The pilot's low altitude maneuver using an excessive bank angle, and his failure to maintain airspeed which resulted in an inadvertent stall and subsequent collision with a building. A factor was the pilot's impairment from prescription medications.\n"}