{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130k-hercules-near-baghdad-10-killed", "date": "Jan 30, 2005 at 1630 LT", "type": "Lockheed C-130 Hercules", "operator": "Royal-Air-Force-4", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "No", "site": "Plain, Valley", "schedule": "Baghdad - Balad", "msn": "4195", "yom": 1967, "flight_number": null, "city": "Baghdad", "zone": "Baghdād (بغداد)", "country": "Iraq", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 24200, "circumstances": "The aircraft was performing, according to the RAF, an administrative flight from Baghdad to Balad, an Air Base located 65 km northwest of Baghdad. While climbing, the aircraft was hit by enemy fire and crashed near Al Taji, about 30 km northwest of Baghdad. The aircraft was destroyed and all 10 occupants were killed.", "probable_cause": "The Board concluded that XV179 crashed because the ac became uncontrollable after hostile action caused the explosive separation of the outboard 23 feet of the right-hand wing. Furthermore the Board conclude that the explosive separation could have been caused solely by [blanked out] or a combination of [blanked out] and another [blanked out] impacting the wing in the vicinity of the separation boundary.\r\nThe following contributing factors were identified:\r\n- Flying at low level and in daylight made the ac vulnerable to [blanked out],\r\n- The lack of any fire retarding technology, either foam or inert gas, in the fuel tanks allowed an explosive fuel/air mix to develop in the ullage,\r\n- The ACHQ did not have sight of Op [blanked out] tasking and this reduced their ability to provide relevant intelligence support,\r\n- The SAFIRE reporting, collating and dissemination chain was not efficient enough to provide aircrew with the time-sensitive intelligence they need,\r\n- The lack of a procedure to pass up-to-the-minute and relevant threat information to the C-130 left crew unaware of the recent SAFIRE site between BIAP and BSE."}