{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-4-la-guardia-43-killed", "date": "May 29, 1947 at 1905 LT", "type": "Douglas DC-4", "operator": "United-Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Cleveland", "msn": "18324", "yom": 1944, "flight_number": "UA521", "city": "New York-LaGuardia", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 44, "pax_fatalities": 41, "other_fatalities": 0, "total_fatalities": 43, "captain_hours": 8703, "captain_hours_type": 336, "copilot_hours": 2323, "copilot_hours_type": 256, "aircraft_hours": 5950, "circumstances": "Flight 521 taxied from its parked position, rolled onto Runway 18, and without pause or hesitation accelerated for take-off. The throttles were advanced. Air speed increased to above 90 miles per hour. Captain Baldwin applied back pressure to the control column, but the \"feel\" of the controls was \"heavy,\" and the aircraft did not respond. As the aircraft raced toward the boundary of the field, Captain Baldwin decided to discontinue his take-off. About 1,000 feet from the south and of the runway he applied brakes, ordering the co-pilot at the same time to cut the engines. A ground-loop was attempted by heavy application of left brake. The aircraft, however, proceeded to roll straight ahead. Then, in the both brakes locked it continued over the remainder of the runway, crashed through the fence at the airport boundary, and half-bounced, half-flew across the Grand Central Parkway. The aircraft finally came to rest immediately east of the Casey Jones School of Aeronautics, a distance of 800 feet from the end of Runway 18 and 1,700 feet from the point at which brakes were first applied. It was almost immediate enveloped in flames. The captain, another crew member and three passengers were rescued while 43 other occupants were killed.", "probable_cause": "The Board determines that the probable cause of this accident was either the failure of the pilot to release the gust lock before take-off, or his decision to discontinue the take-off because of apprehension resulting from rapid use of a short runway under a possible calm wind condition."}