{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-680e-boise", "date": "Sep 21, 2015 at 1620 LT", "type": "Rockwell Grand Commander 680", "operator": "James R. Metzger", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Weiser - Boise", "msn": "680E-721-28", "yom": 1959, "flight_number": null, "city": "Boise", "zone": "Idaho", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 18000, "captain_hours_type": 2500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7500, "circumstances": "The commercial pilot was conducting a personal flight. He reported that he did not recall what happened the day of the accident. One witness, who was former pilot, reported that he saw the airplane fly over his house and that the engines sounded as if they were \"out of sync.\" A second witness, who lived about 5 miles away from the airport, reported that she saw the airplane flying unusually low. She added that the engines sounded terrible and that they were \"popping and banging.\" A third witness, who was holding short of the runway waiting to take off, reported that he saw the airplane approaching the runway about 75 ft above ground level (agl). He then saw the airplane descend to about 50 ft agl and then climb back to about 75 ft agl, at which point the airplane made a hard, right turn and then impacted terrain. Although a postaccident examination of both engines revealed no evidence of a mechanical failure or malfunction that would have precluded normal operation, the witnesses' described what appeared to be an engine problem. It is likely that one or both of the engines was experiencing some kind of problem and that the pilot subsequently lost airplane control. The pilot reported in a written statement several months after the accident that, when he moved the left rudder pedal back and forth multiple times after the accident, neither the torque tubes nor the rudder would move, that he found several of the rivets sheared from the left pedal, and that he believed the rudder had failed. However, postaccident examination of the fractured rivets showed that they exhibited deformation patterns consistent with overstress shearing that occurred during the accident sequence. No preimpact anomalies with the rudder were found.", "probable_cause": "The pilot's failure to maintain airplane control following an engine problem for reasons that could not be determined because postaccident examination of both engines and the rudder revealed no malfunctions or anomalies that would have precluded normal operation."}