{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-580-cincinnati-1-killed", "date": "Aug 13, 2004 at 0049 LT", "type": "Convair CV-580", "operator": "Air%20Tahoma", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Memphis - Cincinnati", "msn": "68", "yom": 1953, "flight_number": "HMA185", "city": "Cincinnati-Northern Kentucky", "zone": "Kentucky", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2500, "captain_hours_type": 1337, "copilot_hours": 924, "copilot_hours_type": 145, "aircraft_hours": 67886, "circumstances": "On August 13, 2004, about 0049 eastern daylight time, Air Tahoma, Inc., flight 185, a Convair 580, N586P, crashed about 1 mile south of Cincinnati/Northern Kentucky International Airport (CVG), Covington, Kentucky, while on approach to runway 36R. The first officer was killed, and the captain received minor injuries. The airplane was destroyed by impact forces. The flight was operating under the provisions of 14 Code of Federal Regulations (CFR) Part 121 as a cargo flight for DHL Express from Memphis International Airport (MEM), Memphis, Tennessee, to CVG. Visual meteorological conditions prevailed for the flight, which operated on an instrument flight rules flight plan. The flight crew was scheduled to fly the accident airplane on a roundtrip sequence from MEM to CVG. Flight 185 departed MEM about 2329. The first officer was the flying pilot, and the captain performed the non flying pilot duties. During postaccident interviews, the captain stated that the takeoff and climb portions of the flight were normal. According to the cockpit voice recorder (CVR) transcript, at 0017:49, the captain stated that he was just going to “balance out the fuel here.” The first officer acknowledged. From 0026:30 to 0027:08, the CVR recorded the captain discussing the airplane’s weight and balance with the first officer. Specifically, the captain stated, “couldn’t figure out why on the landing I was out and I was okay on the takeoff.” The captain added, “the momentum is one six six seven and I…put one zero six seven and I couldn’t work it.” He then stated, “so…we were okay all along.” At 0030:40, the first officer stated, “weird.” At 0032:31, the captain stated, “okay just let me finish this [the weight and balance paperwork] off and…I’m happy,” and, about 2 minutes later, he stated, “okay, back with you here.” At 0037:08, the captain contacted Cincinnati Terminal Radar Approach Control (TRACON) and reported an altitude of 11,000 feet mean sea level. About 1 minute later, the first officer stated, “something’s messed up with this thing,” and, at 0039:07, he asked “why is this thing?” At 0041:21, the first officer stated that the control wheel felt “funny.” He added, “feels like I need a lot of force. it is pushing to the right for some reason. I don’t know why…I don’t know what’s going on.” The first officer then repeated twice that it felt like he needed “a lot of force.” The CVR did not record the captain responding to any of these comments. At 0043:53, when the airplane was at an altitude of about 4,000 feet, the captain reported to Cincinnati TRACON that he had the runway in sight. The approach controller cleared flight 185 for a visual approach to runway 36R and added, “keep your speed up.” The captain acknowledged the clearance and the instruction. The first officer then stated, “what in the world is going on with this plane? sucker is acting so funny.” The captain replied, “we’ll do a full control check on the ground.” At 0044:43, the approach controller again told the captain to “keep your speed up” and instructed him to contact the CVG Air Traffic Control Tower (ATCT). At 0045:11, the captain contacted the CVG ATCT and requested clearance to land on runway 36R, and the local control west controller issued the landing clearance. Flight data recorder (FDR) data indicated that, shortly afterward, the airplane passed through about 3,200 feet, and its airspeed began to decrease from about 240 knots indicated airspeed. At 0045:37, when the airplane was at an altitude of about 3,000 feet, the captain started the in-range checklist,  stating, “bypass is down. hydraulic pressure. quantity checks. AC [alternating current] pump is on. green light. fuel panel. boost pumps on.” About 0046, the first officer stated, “I’m telling you, what is wrong with this plane? it is really funny. I got something all messed up here.” The captain replied, “yeah.” The first officer then asked, “can you feel it? it’s like swinging back and forth.” The captain replied, “we’ve got an imbalance on this…crossfeed I left open.” The first officer responded, “oh, is that what it is?” A few seconds later, the first officer stated, “we’re gonna flame out.” The captain responded, “I got the crossfeed open. just keep power on.” At 0046:45, the CVR recorded a sound similar to decreasing engine rpm. Immediately thereafter, the first officer stated, “we’re losing power.” At 0046:52, the first officer stated, “we’ve lost both of them. did we?” The captain responded, “nope.” FDR data showed that, about 1 second later, a momentary electrical power interruption occurred when the airplane was at an altitude of about 2,400 feet. At 0046:55, the CVR stopped recording. Airplane performance calculations indicated that, shortly after the power interruption, the airplane’s descent rate was about 900 feet per minute (fpm). According to air traffic control (ATC) transcripts, at 0047:12, the captain reported to the CVG ATCT that the airplane was “having engine problems.” The local control west controller asked, “you’re having engine problems?” The captain replied, “affirmative.” At 0047:28, the controller asked the captain if he needed emergency equipment, and the captain replied, “negative.’” This was the last transmission received by ATC from the accident flight crew. The FDR continued recording until about 0049. The wreckage was located about 1.2 miles short of runway 36R.", "probable_cause": "Fuel starvation resulting from the captain’s decision not to follow approved fuel crossfeed procedures. Contributing to the accident were the captain's inadequate preflight planning, his subsequent distraction during the flight, and his late initiation of the in-range checklist. Further contributing to the accident was the flight crew’s failure to monitor the fuel gauges and to recognize that the airplane’s changing handling characteristics were caused by a fuel imbalance."}