{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-21a-goose-old-harbor-1-killed", "date": "Dec 24, 1961 at 1050 LT", "type": "Grumman G-21A Goose", "operator": "Kodiak-Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Kodiak – Old Harbor – Kaguyak – Lazy Bay – Moser Bay – Olga Bay – Kodiak", "msn": "1020", "yom": 1938, "flight_number": null, "city": "Old Harbor (Kodiak Island)", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6809, "captain_hours_type": 1160, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8694, "circumstances": "On December 24, 1961, N1503V, a Kodiak Airways, Inc., Grumman G-21A, a twin engine six-place amphibian crashed shortly after initial lift-off while making a water takeoff from Old Harbor, Kodiak Island, Alaska. One passenger seated in the cockpit was thrown into the water and drowned. The pilot, who was also thrown from the aircraft, and the remaining three cabin passengers, who exited through the main cabin door, were rescued within a few minutes. The aircraft was totally destroyed at impact and sank in 75 feet of water. Ceiling and visibility were unrestricted and the sea was relatively calm. At approximately 1050 a.s.t., the aircraft started its takeoff in a southwesterly direction. The initial takeoff appeared to be normal, but immediately after lift-off the aircraft was observed to descend, strike the water, and climb steeply. The aircraft then pitched down abruptly and crashed, with the nose and tail breaking off at impact.", "probable_cause": "The Board determines that the probable cause of this accident was an improperly executed takeoff which resulted in an inadvertent descent into the water. This produced a high-speed low-angle porpoise from which the pilot was unable to recover."}