{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-580-auckland-3-killed", "date": "Jul 31, 1989 at 2200 LT", "type": "Convair CV-580", "operator": "Air%20Freight%20NZ", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Palmerston North – Auckland – Christchurch", "msn": "180", "yom": 1968, "flight_number": "AFZ001", "city": "Auckland", "zone": "Auckland Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3760, "captain_hours_type": 140, "copilot_hours": 1086, "copilot_hours_type": 6, "aircraft_hours": 29999, "circumstances": "Flight Air Freight 1 was a scheduled night freight flight between Palmerston North, Auckland and Christchurch. The crew consisted of a training captain and two new co-pilots who were to fly alternate legs as co-pilot and observer. The co-pilot’s ADI of the Convair CV-580 in question had a known intermittent defect, but had been retained in service. The aircraft’s MEL however did not permit this flight to be undertaken with an unserviceable ADI. The aircraft nevertheless departed Palmerston North and arrived at Auckland at about 20:30. It was unloaded and reloaded with 11 pallets of cargo. On the next leg, to Christchurch, the handling pilot was to be the other co-pilot. Although she had completed her type rating on the Convair 580 this was her first line flight as a crew member. The flight was cleared to taxi to runway 23 for departure. Takeoff was commenced at 21:59. The aircraft climbed to a height of approx. 400 feet when it pitched down. It entered a gradual descent until it contacted the ground 387 m beyond the end of runway 23 and 91 m left of the extended centreline. The aircraft then crashed and broke up in the tidal waters of Manukau Harbour. The aircraft disintegrated on impact and all three crew members were killed. ", "probable_cause": "The probable cause of this accident was the training captain’s failure to monitor the aircraft’s climb flightpath during the critical stage of the climb after take-off."}