{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-602p-mcfarland-3-killed", "date": "Nov 9, 2007 at 1200 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "Midwestern Restaurants", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Roseburg – Bakersfield", "msn": "62-0918-8165043", "yom": 1981, "flight_number": null, "city": "McFarland", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1500, "captain_hours_type": 15, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3780, "circumstances": "The accident flight was the pilot's first 700 nm cross-country flight in the newly purchased airplane. Prior to departing he had the airplane refueled with the airplane on a slope. The individual who refueled the airplane estimated that the left wing tip was 12 to 14 inches lower than the right wing tip. He stated that the pilot was very concerned about getting as much fuel in the airplane as possible because of his up-coming flight. After climbing to his assigned cruising altitude of 21,000 feet and about two hours into the flight the pilot reported to ATC that he needed to divert. During the descent the pilot reported that he was experiencing a fuel problem and that one engine was sputtering. Two minutes later the pilot declared an emergency and reported that both engines were sputtering. The pilot reported at that time that he had 15 total gallons of fuel remaining A witness to the accident reported that he saw the airplane flying southbound and that the wings were rocking side-to-side. The airplane then rolled to the right before crashing into the citrus grove. Examination of the airframe revealed no pre-impact failure to any flight control surface or control system component. The power plant investigation did not disclose any pre-impact mechanical failure of any rotating or reciprocating component of the engine. Interviews with pilots who had flown with the accident pilot indicated that this was his first flight above 13,000 feet in the accident airplane, and was probably his longest distance attempted flight since he had purchased the airplane. According to information contained within the Pilot's Operating Handbook and FAA Approved Airplane Flight Manual (VB-1190), \"The full amount of usable fuel is based on the airplane sitting on a level ramp, laterally level, and longitudinally (approximately 1 1/2 degree nose up) with each tank fueled to 0.6 inches below filler neck. The wing tanks are extremely sensitive to attitude and if not level, they cannot be fueled to the full usable capacity.\" This information is also included in the FAA Type Certificate Data Sheet No. A17WE under the section Data Pertinent to All Models, Note 1.", "probable_cause": "The pilot's inadequate preflight preparation and improper fueling procedures that led to fuel exhaustion."}