{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-52d-40-bw-stratofortress-fairchild-afb-5-killed", "date": "Sep 8, 1958 at 1920 LT", "type": "Boeing B-52 Stratofortress", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fairchild - Fairchild", "msn": "464052", "yom": 1956, "flight_number": null, "city": "Fairchild AFB (Spokane)", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was engaged in a local training flight at Spokane AFB, consisting of visual and instruments approaches and landings. While approaching runway 23, at a distance of about three miles from the threshold, the crew cancelled his instruments approach to continue on visual mode. In the mean time, the second B-52 registered 56-0661 which was on second position must switch from visual mode to instruments approach procedures. To follow the approach procedures and as both crews were not coordinated, the approach controller instructed the first crew to gain altitude while turning to the right and instructed the second crew to reduce his altitude while turning to the left. Few seconds later, at an altitude of 900 feet, both aircraft collided and crashed. On board 56-0681, five crew members were killed while two others were seriously injured. On board 56-0661, only one crew survived, all eight others have been killed. ", "probable_cause": "The collision was the result of the approach procedures not being followed by the crew. The two bombers were practicing landing and takeoff maneuvers that included using instrument rules for parts of their flights and visual rules for other parts. The B-52 closer to the runway had just switched off its instrument maneuvers the B-52 farther away had not yet switched on its instruments. The control tower didn’t pick up the more distant B-52 until it was about three miles from the runway, when the closer bomber was on its final approach. The tower ordered the first plane to go up and to the right – a standard breakaway maneuver – while the closer one should have followed procedures to go down and to the left, to land. Instead, both planes pulled up and to the right, and into each other. Investigations were unable to determine the reason why the crew failed to follow the standard procedures and ATC instructions. "}