{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-17g-15-dl-raf-bovingdon-4-killed", "date": "Mar 31, 1945 at 1600 LT", "type": "Boeing B-17 Flying Fortress", "operator": "USAAF", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bovingdon - Bovingdon", "msn": "8636", "yom": 1942, "flight_number": null, "city": "Bovingdon AFB", "zone": "Hertfordshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1298, "captain_hours_type": 11, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a local CFR flight circling the field at approximately 800 feet altitude with gear down. At a point in the traffic pattern 2 miles south of the field, and while turning downward, the B-17 collided with a C-47 (registered 43-48506) which had just taken off on local flight. The B-17 was slightly higher and behind the C-47 as it approached the C-47 from the port quarter astern. The B-17 was seen to make a sudden maneuver to avoid collision but too late to avoid the C-47. The C-47 was hit by the number 4 engine of the B-17 just forward of the tail fairing on the top of the fuselage resulting in complete loss of the tail empennage of the C-47. The C-47 then went into an uncontrolled spin and crashed about 2,5 miles south of the field, resulting in death of the two occupants. The tail unit came down in the same vicinity in a comparatively intact condition with vertical and horizontal control surfaces still in place. The left wing of the C-47 was severely crumpled by the impact. The B-17 was seen to make a violent maneuver to avoid collision but too late to avoid hitting the C-47. The B-17 then evidently stalled cut due to loss of flying speed resulting either from the maneuver to avoid collision or as a result of the impact, or a combination of both. The B-17 was seen to lower the left wing and then plunge straight down without spinning. It crashed into the ground at an estimated angle of 80° from horizontal. The collision occurred at an estimated height of 800 feet above the ground. \r\nCrew in B-17:\r\nCpt Walter P. Hottenstein,\r\n2nd Lt Joseph Cotterman, \r\nPvt James C. Shelton, \r\nPfc Eron J. Windham. ", "probable_cause": "The pilot of the B-17 evidently failed to observe the take-off of the C-47 or failed to keep it in sight while circling the field. The weather was good at the time except for moderate turbulence at low levels but with good visibility. Both planes were in the clear at all times. It seems probable that the C-47 was beneath the B-17 in such a position that it was in a blind spot. Local field regulations require that a left hand circuit of the field be made. An accident of this nature will serve to remind pilots of the constant necessity of observing traffic taking off as well as traffic already in the air. Pilots are being warned again to employ extra crew members as look-outs especially when in the vicinity of the airport. "}