{"url": "https://www.baaa-acro.com/crash/crash-xian-ma60-kawthaung", "date": "Jun 10, 2013 at 1255 LT", "type": "Xian MA60", "operator": "Myanma-Airways-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yangon – Mawlamyine – Kawthaung", "msn": "08 07", "yom": 2010, "flight_number": "UB609", "city": "Kawthaung", "zone": "Tanintharyi Region", "country": "Myanmar", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 60, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7815, "captain_hours_type": 2502, "copilot_hours": 3169, "copilot_hours_type": 361, "aircraft_hours": 4395, "circumstances": "On 10 June 2013, at 6:55 local time, Myanma Airways MA-60 (XY-AIP) departed from Yangon to Mawlamyine- Kawthaung and back with 4 crews and 27 passengers. During climbing, hydraulic pressure low warning (LEDPL), intermittently illuminated and aircraft returned back to Yangon. After snag rectification, aircraft departed to Mawlamyine at about 10:15 local time. During final approach, while landing gear down hydraulic pressure low warning illuminated and disappeared at aircraft parking. At about 11:10, aircraft departed from Mawlamyine with 4 crews and 60 passengers. During the route Mawlamyine to Kawthaung, no warning light illuminated. While approaching to Kawthaung RW, PIC check hydraulic quantity and flap down to 5°, landing gear down and final turn to runway 02. During final approach, LEDPL warning light was come again. PIC set flaps 15° to 30° respectively, but he noticed flaps position was not fully extended. As soon as aircraft touch down, PIC apply reverse power at about 2,500 ft from runway end. After recognition of aircraft swing, PIC changed power lever to GI position and applied brake and changed nose wheel to taxi mode and steering.  Aircraft cannot able to steer and veer off left side of runway at about 3,200 ft. Firstly aircraft stroke two fence pillars with propellers and nose wheel, then aircraft turned 90° to left and stopped after striking to tree with left wing. There was no injury to crews and passengers due to accident. The aircraft was damaged beyond repair.", "probable_cause": "Primary cause:\r\n- During landing roll, due to hydraulic system pressure low, nose wheel steering mechanism and braking action are not effectively operated and aircraft veer off runway left side.\r\n- PIC did not operated the emergency hydraulic pump while hydraulic low pressure warning come on.\r\nSecondary cause:\r\n- Hydraulic system pressure low due to hydraulic tank fluid level more than normal and tank pressurize compress air line filter blockage. "}