{"url": "https://www.baaa-acro.com/crash/crash-saab-340b-porto", "date": "May 14, 1997 at 1628 LT", "type": "Saab 340", "operator": "Regional Lineas Aéreas", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Madrid - Porto", "msn": "315", "yom": 1992, "flight_number": "RGN1335", "city": "Porto-Francisco Sá Carneiro", "zone": "Douro Litoral", "country": "Portugal", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 34, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3225, "captain_hours_type": 1292, "copilot_hours": 1985, "copilot_hours_type": 904, "aircraft_hours": 7226, "circumstances": "Because of construction works on runway 35, the threshold at Porto was displaced by 760 metres. This was published in a Notam but during the flight preparation at Madrid-Barajas Airport, the crew was not informed about this notice. Following an uneventful flight, the crew was cleared to descent and received instructions for a landing on runway 35 but no information about the displaced threshold. On final approach, the controller realized that the aircraft was approaching too low and instructed the crew to 'overshoot please'. The crew did not react to this instruction and continued the approach when the aircraft undershot the displaced threshold and landed in the construction area. It struck several trenches which caused the undercarriage to be torn off and slid for few dozen metres before coming to rest on the runway. All 37 occupants were evacuated safely and the aircraft was damaged beyond repair.", "probable_cause": "The following factors were identified: \r\n- While preparing the flight in Madrid, the crew have not been informed about the Notam published by the Porto Airport Authority reporting that the runway 35 threshold has been temporary displaced of 760 metres due to construction works, \r\n- The existence of two markings on the runway 35 threshold, which may have confused the crew,\r\n- Lack of concentration of the crew during the flight,\r\n- The controller did not effectively alert the crew about work in progress, \r\n- The controller, trying to alert the crew, did not use a correct phraseology."}