{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a60-duke-santa-rosa-2-killed-0", "date": "May 5, 2019 at 1600 LT", "type": "Beechcraft 60 Duke", "operator": "Roberto Decena", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Arlington - Santa Fe", "msn": "P-217", "yom": 1973, "flight_number": null, "city": "Santa Rosa-Route 66", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4100, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was performing a personal cross-country flight. While en route to the intended destination, the pilot contacted air traffic control to report that the airplane was having a fuel pump issue and requested to divert to the nearest airport. The pilot stated that the request was only precautionary and did not declare an emergency during the flight; he provided no further information about the fuel pump. As the airplane approached the diversion airport, witnesses observed the airplane flying low and rolling to the left just before impacting terrain, after which a postcrash fire ensued. An examination of the airframe revealed no preimpact mechanical malfunctions or failures that would have precluded normal operation. A postaccident examination and review of recorded data indicated that the left engine was secured and in the feather position, and that the right engine was operating at a high RPM setting. The left engine-driven fuel pump was found fractured. Further examination of the fuel pump revealed fatigue failure of the pressure relief valve. The fatigue failure initiated in upward bending on one side of the valve disk and progressed around both sides of the valve stem. As the cracks grew, the stem separated from the disk on one side and began to tilt in relation to the disk and the valve guide due to the non-symmetric support, which caused the lower end of the stem to rub against the valve guide, creating wear marks. The increasing stem tilt would have impinged against the valve guide, and the valve might have begun to stick in the closed position. If the valve were stuck in the closed position, it would not be able to open, and the outlet fuel pressure could rise above the set point pressure. Because the pump was driven by the engine, there would not be a way for the pilot to shut it off, disconnect it, or bypass it. Instead, the fuel pressure would continue to rise until the valve were to unstick. Thus, the pilot was likely experiencing variable fuel pressure as the valve became stuck and unstuck. Examination of the spring seat and the diaphragm plate, which were in contact with each other in the fuel pump assembly, revealed wear marks on the surface of each component, with one mark on the diaphragm plate and two wear marks on the spring seat. The two wear marks on the spring seat were distinct features separated by material with no wear indications in between. The only way that these  wear marks could have occurred were if the spring seat was separated from the diaphragm plate and reinstalled in a different orientation. Thus, it is likely that the pilot had encountered a fuel pump problem before the accident flight and that someone tried to troubleshoot the problem. The last radar data point indicated that the airplane was traveling at a groundspeed of about 98 knots, and had passed north of the airport, traveling to the southwest. The minimum control speed for the airplane with single-engine operation was 88 knots. However, it is likely that if the pilot initiated a left turn back toward the airport, that the right engine torque and the 14 knot wind with gusts to 24 knots would have necessitated a higher speed. Because appropriate control inputs and airspeed were not maintained, the airplane rolled in the direction of the feathered engine (due to the left fuel pump problem), resulting in a loss of control. The pilot's toxicology report was positive for cetirizine, sumatriptan, gabapentin, topiramate, and duloxetine. All of these drugs act in the central nervous system and can be impairing alone or in combination. Although this investigation could not determine the reason(s) for the pilot's use of these drugs, they are commonly used to treat chronic pain syndromes or seizures. It is likely that the pilot was experiencing some impairment because of multiple impairing medications and was unable to successfully respond to the in-flight urgent situation and safely land the airplane.", "probable_cause": "The pilot's loss of airplane control due to his failure to maintain appropriate control inputs and airspeed after shutting down an engine because of a progressive failure of the pressure relief valve in the fuel pump, which resulted in variable fuel pressure in the engine. Contributing to the loss of control was the pilot's use of multiple impairing medications."}