{"url": "https://www.baaa-acro.com/crash/crash-raytheon-390-premier-lewistown", "date": "Dec 23, 2008 at 1500 LT", "type": "Raytheon 390 Premier I", "operator": "CNS Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kansas City - Lewistown", "msn": "RB-106", "yom": 2004, "flight_number": null, "city": "Lewistown", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13750, "captain_hours_type": 1927, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1927, "circumstances": "Prior to departure, the pilot was informed that it had been raining; the roads were wet, but no mention of ice at his destination. During the approach to the destination airport, the runway appeared \"wet\", and a normal approach and landing was attempted. The airplane touched down at 110 knots, the pilot \"then deployed lift dump and [then applied the] brakes\". Unable to get braking action, the pilot tried to slide the airplane \"left and right\" to get traction, but could not. The airplane departed the south end of the 4,370-foot-long runway, went over the edge of an embankment and stopped next to a levee. There were no reported pre-impact malfunctions with the airplane. The Manufacturer Approved Airplane Flight Manual Supplement for Airplanes Operating on Wet and contaminated Runways; General Information Section, states operations on runways contaminated with ice or wet ice are not recommended and no operational information is provided. Using the supplement, the anticipated landing distance on a wet runway was calculated to be about 3,400 feet, the anticipated landing distance on an uncontaminated runway was calculated to be approximately 2,800 feet, and the prescribed landing speed (Vref) was determined to be about 111 knots. A braking action (runway condition) report for the private airfield's runway did not exist, nor  was one required.", "probable_cause": "The pilot's loss of directional control during landing on an ice-contaminated runway."}