{"url": "https://www.baaa-acro.com/crash/crash-fairchild-c-82a-20-fa-packet-boca-raton-5-killed", "date": "Aug 8, 1956 at 0505 LT", "type": "Fairchild C-82 Packet", "operator": "Sky Spray", "flight_phase": "Landing (descent or approach)", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Miami - Boca Raton", "msn": "10070", "yom": 1944, "flight_number": null, "city": "Boca Raton", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 4976, "captain_hours_type": 186, "copilot_hours": 3179, "copilot_hours_type": 170, "aircraft_hours": 1016, "circumstances": "N4832V departed Masters Field, Miami, Florida, for Boca Raton Airport at 0448, August 8, 1956. Aboard the aircraft were Pilot Charles W. Day, Copilot Rae F. Howry, and three company insecticide-mixer personnel. The purpose of the direct 36-mile flight was the movement of the aircraft, crew and mixer personnel to the Boca Raton Airport from which the spraying operation was to be conducted. The takeoff of N4832V was followed immediately by another company operated C-82, N4829V and the two aircraft proceeded at an altitude of approximately 500 feet. N4829V flew to the left, slightly above and to the rear of N4832V until reaching Boca Raton. Both aircraft arrived over the city of Boca Raton shortly after 0500 and proceeded north and west the mile or so to the airport. Dawn was breaking and the runways, although unlighted, were plainly visible. N4832V made a eight turn for approach to runway 04. After passing over more than one-third of the length of the 5,000-foot runway a go-around was initiated. The aircraft then Immediately went into a climbing left turn. During this turn the aircraft stalled and crashed, killing all five occupants. ", "probable_cause": "The Board determines that the probable cause of this accident ins loss of power on the left engine and the drag-induced effect of the unfeathered left propeller, resulting in loss of directional control daring an attempted go-around. The following findings were reported: \r\n- During approach to the airport serious malfunctioning of the left engine occurred,\r\n- An improperly planned final approach resulted in runway misalignment and necessitated a go-around,\r\n- During the attempted go-around the left engine rear master rod bearing failed resulting in loss of power on the left engine,\r\n- The propeller was not feathered for single-engine operation,\r\n- The lack of left engine power at low at low airspeed, and the drag resulting from the unfeathered left propeller resulted in loss of directional control,\r\n- During the resulting left turn the aircraft was stalled and entered an \"over-the-top\" spin."}