{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-124-lihovka-zapolishki-37-killed", "date": "Sep 2, 1970 at 1537 LT", "type": "Tupolev TU-124", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Mineralnye Vody - Rostov-on-Don - Vilnius", "msn": "1 35 04 02", "yom": 1961, "flight_number": "SU3630", "city": "Lihovka Zapolishki", "zone": "Poltava oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 32, "pax_fatalities": 32, "other_fatalities": 0, "total_fatalities": 37, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7504, "circumstances": "The airplane departed Rostov-on-Don Airport at 1455LT and reached the assigned altitude of 8,400 meters at 1514LT. At this time, ATC instructed the crew to climb to 9,000 meters due to traffic ahead. The new altitude of 9,000 meters was reached two minutes later at 1516LT. While cruising in good weather conditions, the crew sent a brief message and mentioned the number '45' followed by a long pause. A second message was heard on the frequency with the number 'zero' then a third message with the pilot shouting the number '12'. Then the contact was definitely interrupted and the airplane entered a dive. During the descent, it reached the speed of 950 km/h and banked left to an angle of 75° before crashing in a cornfield located about 90 km from Dniepropetrovsk and 57 km from Krementchug. At impact, the airplane caused a huge crater and the accident was not survivable. ", "probable_cause": "The exact cause of the accident could not be determined with certainty. Nevertheless, the following facts were reported: \r\n- There was no in-flight collision, \r\n- There was no in-flight fire prior to impact, \r\n- No military operations were in place in that area at the time of the accident,\r\n- Both engines were turning at idle at impact. "}