{"url": "https://www.baaa-acro.com/crash/crash-dornier-do228-202-cambridge-bay", "date": "Dec 13, 2008 at 0143 LT", "type": "Dornier DO228", "operator": "Summit-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Resolute Bay - Cambridge Bay", "msn": "8133", "yom": 1987, "flight_number": null, "city": "Cambridge Bay", "zone": "Nunavut", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 12, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13400, "captain_hours_type": 802, "copilot_hours": 850, "copilot_hours_type": 470, "aircraft_hours": null, "circumstances": "The Summit Air Charters Dornier 228-202 was on a charter flight from Resolute Bay to Cambridge Bay, Nunavut, under instrument flight rules. While on final approach to Runway 31 True, the aircraft collided with the ground approximately 1.5 nautical miles from the threshold at 0143 mountain standard time. Of the 2 pilots and 12 passengers on board, 2 persons received serious injuries. The aircraft was substantially damaged. The emergency locator transmitter activated, and the crew notified the Cambridge Bay Airport radio operator of the accident via the aircraft radio. Local ground search efforts found the aircraft within 30 minutes, and all occupants were removed from the site within two hours.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. An abbreviated visual approach was conducted at night in instrument meteorological conditions, which resulted in the flight crew’s inability to obtain sufficient visual reference to judge their height above the ground.\r\n2. The flight crew did not monitor pressure altimeter readings or reference the minimum altitude requirements in relation to aircraft position on the approach, resulting in controlled flight into terrain.\r\n3. The pilots had not received training and performance checks for the installed global positioning system (GPS) equipment, and were not fully competent in its use. The attempts at adjusting the settings likely distracted the pilots from maintaining the required track and ground clearance during the final approach.\r\nFindings as to Risk:\r\n1. The precision approach path indicator systems (PAPI) at Cambridge Bay had not been inspected in accordance with the Airport Safety Program Manual. Although calibration of the equipment did not have a bearing on this occurrence, there was an increased risk of aircraft misalignment from the proper glide path, especially during night and reduced visibility conditions.\r\n2. The flight crew’s cross-check of barometric altimeter performance was not sufficient to detect which instrument was inaccurate. As a result, reference was made to a defective altimeter, which increased the risk of controlled flight into terrain. \r\n3. Operators’ maintenance organizations normally do not have access to the troubleshooting information contained in Component Maintenance Instruction Manuals for the Intercontinental Dynamics Corporation altimeters. Therefore, aircraft could be dispatched with damaged instruments with the potential for developing a loss of calibration during flight.\r\n4. The flight was conducted during a period in which the crew’s circadian rhythm cycle could result in cognitive and physical performance degradation unless recognized and managed."}