{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24a-954-near-rotorua-1-killed", "date": "Dec 8, 2012 at 1315 LT", "type": "Fletcher FU-24", "operator": "Super%20Air", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": null, "msn": "278", "yom": 1981, "flight_number": null, "city": "Rotorua", "zone": "Bay of Plenty Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 430, "captain_hours_type": 95, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11300, "circumstances": "The pilot, who was undertaking training toward a Grade 2 Agricultural Pilot Rating, began work at approximately 0625 hours on the day of the accident. The pilot and his instructor, who was in another topdressing aircraft, flew to a block of land to the south east of Rotorua where the pilot completed 15 sowing runs, while his instructor worked in the local vicinity in the second aircraft. The pilot and instructor completed the work on this block, had a break and then transited to the Waikite Valley, arriving at approximately 0945 hours. At 1045 hours, after refuelling his aircraft, the pilot commenced sowing a ‘special mix’ fertiliser, in an alternating pattern between the instructor and pilot, with two aircraft operating from the airstrip. The alternating pattern allowed the instructor to observe and supervise the pilot during the take off and landing phases, while allowing the operation to proceed efficiently. The pilot and instructor stopped for lunch after an hour of flying, refuelled once more and then continued with their work. The amount of fertiliser that was loaded into the pilot’s aircraft was progressively increased as the work proceeded. The initial load of product was 900 kg, gradually increasing by 50 kg increments, when the instructor was satisfied that the pilot’s performance allowed this increase. The last five loads carried prior to the accident were each 1100 kg. Nothing untoward was noticed during the sowing runs, apart from the pilot aborting one landing attempt, due to the wake turbulence from the instructor’s aircraft during take off. At the time of the accident the pilot was performing ‘clearing runs’, sowing on remaining areas of land not already covered by previous sowing runs. Immediately prior to the accident, the pilot called the instructor on the radio to enquire of his location. The instructor responded with “directly behind you on the other side of the woolshed”. A few seconds later, as the instructor approached to land at the airstrip, he observed the pilot’s aircraft flying in a westerly direction at approximately 400 ft AGL. He then saw the pilot’s aircraft make a slight turn to the left. Describing what he had seen as: “he started to climb and turn slightly to the left, then the plane was in a left hand spin”. The instructor thought at the time that the aircraft spun for one and a half rotations to the left, prior to being obscured by the ridge adjacent to the airstrip. The accident occurred in daylight, at approximately 1315 hours, at Waikite Valley, Rotorua, at an elevation of 1460 ft. Latitude S 38° 18.5', longitude E 176° 17.42'. ", "probable_cause": " Conclusions\r\n- The pilot was appropriately licensed and held a valid medical certificate.\r\n- The aircraft had been appropriately maintained and no technical discrepancy was discovered that could have contributed to the accident.\r\n- It is likely that, during a climbing turn, the pilot inadvertently allowed an aerodynamic stall to occur at which point the aircraft suddenly departed controlled flight.\r\n- No emergency jettison of the hopper contents was attempted.\r\n- The height above the ground, was insufficient for the pilot to perform a successful recovery once the departure from controlled flight had fully developed. \r\n- The pilot’s lack of experience with agricultural operations and relative unfamiliarity with the aircraft type could not be eliminated as having a bearing on the accident."}