{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-near-westcliffe-2-killed", "date": "Jan 9, 2011 at 1340 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Michael O. Welton", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Phoenix – Pueblo", "msn": "46-36085", "yom": 1997, "flight_number": null, "city": "Westcliffe", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3030, "captain_hours_type": 467, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3734, "circumstances": "While en route to the destination airport, the pilot was issued a clearance to descend. As the airplane descended to the assigned altitude, radar plots depicted the airplane entering a right turn, climbing rapidly, and then descending rapidly in a spiral-like pattern. The airplane wreckage was found the following day in mountainous terrain. Several tall trees surrounded the perimeter of the wreckage. Many of the trees showed scuff marks down the trunks consistent with the airplane impacting the terrain in a near-vertical descent. All airplane components were accounted for at the accident site. A postaccident examination of the airplane showed no preimpact failures of the airframe or the engine. A weather analysis revealed that the airplane was descending in the immediate vicinity of a stationary front. The weather conditions in the area were conducive to the production of moderate to severe turbulence, mountain wave activity with updraft/downdrafts in excess of 750 feet per minute, and moderate icing. The radar data confirmed that the airplane began its rapid descent shortly after entering cumuliform clouds. The radar information along with the wreckage at the accident site was consistent with the pilot losing control while trying to maneuver the airplane in an area of turbulent weather.", "probable_cause": "The pilot's loss of control following an encounter with moderate to severe weather."}