{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900c-1-sand-point-2-killed", "date": "Jan 21, 2010 at 2345 LT", "type": "Beechcraft 1900C", "operator": "ACE%20Air%20Cargo", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Sand Point - Anchorage", "msn": "UC-45", "yom": 1988, "flight_number": "AER22", "city": "Sand Point", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3700, "captain_hours_type": 3080, "copilot_hours": 1000, "copilot_hours_type": 280, "aircraft_hours": 56184, "circumstances": "The crew departed on a commercial cargo flight during dark night, visual meteorological conditions on an instrument flight rules flight plan. The departure end of the runway is adjacent to an ocean bay, and wind gusts up to 26 knots were reported. Local residents north of the airport reported stronger wind, estimated between 50 and 60 knots. A fuel truck operator, who was familiar with the crew’s normal routine, reported that, before the airplane taxied to the runway, it remained on the ramp for 6 or 8 minutes with both engines operating, which he described as very unusual. There were no reports of radio communications with the flight crew after the airplane departed. The airplane crashed about 1 mile offshore, and the fragmented wreckage sank in ocean water. Because of the fragmented nature of the wreckage and ocean current, the complete wreckage was not recovered. The cockpit area forward of the wings was extensively fragmented, thus the validity of any postaccident cockpit and instrument findings was unreliable. Likewise, structural damage to the airframe precluded determining flight control continuity. Both propellers had witness marks consistent with operating under engine power and within their normal operating range. A postaccident examination of the engines and recovered components did not disclose any evidence of a mechanical malfunction. Due to the lack of mechanical deficiencies of the engines and propellers, and the extensive airframe fragmentation consistent with a high-speed water impact, it is likely that the crew had an in-flight loss of control of an unknown origin before impact.", "probable_cause": "An in-flight loss of control for an undetermined reason, which resulted in an uncontrolled descent."}