{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-12-frankfurt-44-killed", "date": "Oct 14, 1953 at 1454 LT", "type": "Convair CV-240", "operator": "Sabena.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Salzburg – Frankfurt – Brussels", "msn": "154", "yom": 1949, "flight_number": null, "city": "Frankfurt-Main", "zone": "Hesse", "country": "Germany", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 40, "pax_fatalities": 40, "other_fatalities": 0, "total_fatalities": 44, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after takeoff from Frankfurt-Main Airport, while in initial climb, the crew noticed a loss of power on both engines. In the mean time, the crew raised the flaps according to procedures. The aircraft then stalled and crashed in flames in a wooded area located in Kelsterbach, about three km north of the airfield. The aircraft was destroyed by impact forces and a post crash fire and all 44 occupants were killed. ", "probable_cause": "The loss of power may be attributed to the heavy deposit of lead on the sparking plugs. During takeoff, as the plugs warmed up, circuit was formed by the metal deposits, resulting in the short circuiting of the plugs. There was nothing to show any other contributory causes. A contributory cause of the crash may have been the pilot's decision to continue the takeoff, and the probable retraction of the landing flaps at extensively low speed and low altitude, unless the loss of power by both engines in the phase immediately before the crash was so great that the disaster was unavoidable. There is no evidence that the lead coating process in the sparking plugs occurred suddenly. The investigation showed that the process had been continuous. It was not possible to determine, from the data available, whether the periods specified by the makers of the engines for overhaul of plugs should be considered adequate in all cases."}