{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-proserpine-2-killed", "date": "Feb 20, 1984 at 2016 LT", "type": "Cessna 500 Citation", "operator": "Flight%20Safety%20Australia", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cairns – Townsville – Proserpine – Brisbane", "msn": "500-0237", "yom": 1974, "flight_number": null, "city": "Proserpine", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was engaged on a night freighter service from Cairns (CNS) to Brisbane (BNE) with intermediate stops at Townsville (TSV) and Proserpine (PPP). The flight departed Cairns at 18:47 hours. After arriving at Townsville the aircraft was refuelled and additional freight loaded before departing for Proserpine at 19:47 hours. The aircraft was cleared to track direct to Proserpine on climb to FL250. At 20:08 hours the pilot reported that the aircraft had left FL250 on descent into Proserpine and requested a clearance to track to intercept the 310 omni radial inbound for a DME Arrival. This request was approved and a short time later the aircraft reported established on the radial. At 20:16 hours, in answer to a question from Townsville Control, the aircraft reported at 2600 feet and was instructed to call Townsville Flight Service Unit. The aircraft complied with this instruction, and after the initial contact no further transmissions were received from the aircraft. The wreckage was located approximately 4 kilometres north-west of the threshold of runway 11 and in line with that runway. The aircraft had been destroyed by impact forces and the ensuing fire. A witness, who lived near the final approach path of the aircraft, reported that she observed the aircraft when it was on final approach. Analysis of her observations indicated that when she sighted the aircraft it was at a lower height than normal for the type of approach that the pilot reported would be flown. At the time of the sighting she did not notice anything unusual about the operation of the aircraft. Other persons at the Proserpine Aerodrome at the time of the accident reported rainstorms and strong winds in the vicinity. ", "probable_cause": "An inspection of the aircraft and its systems did not reveal any defect that could have contributed to the accident. Despite the extensive investigation, no evidence could be found to indicate why the aircraft was below the normal glide path during the approach."}