{"url": "https://www.baaa-acro.com/crash/crash-martin-404-atlanta-6-killed", "date": "May 30, 1970 at 0930 LT", "type": "Martin 404", "operator": "Lehigh Acres Development Company", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Atlanta - Fort Myers", "msn": "14116", "yom": 1952, "flight_number": "HGH701", "city": "Atlanta", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 29, "pax_fatalities": 1, "other_fatalities": 5, "total_fatalities": 6, "captain_hours": 25871, "captain_hours_type": 1216, "copilot_hours": 4221, "copilot_hours_type": 1718, "aircraft_hours": 21613, "circumstances": "Lehigh Acres Development, Inc., Flight 701, a Martin 404, N40412, departed from Runway 02R at DeKalb-Peachtree Airport, Chamblee, Georgia, at 0916 e.d.t. on an Instrument Flight Rules flight plan to Fort Myers, Florida. Two pilots, two cabin attendants and 29 passengers were on board. The aircraft had been fueled to approximately 800 gallons prior to departure. The weather at the time of takeoff was: Measured 400 feet overcast, visibility 1 mile with very light rain and fog. Atlanta Departure Control established radar and radio contact with the flight one minute after takeoff. .During the climb, there was a loss of power from the No. 2 engine. This loss rapidly deteriorated to the extent that little useful power was being developed. While the crew was working to correct the discrepancy with the No. 2 engine, the No. 1 engine lost power. The crew declared an emergency and reported that they were going down. Departure Control attempted to vector the aircraft to the Atlanta International Airport for an emergency landing. When the aircraft descended below the overcast, the pilot observed Interstate Highway 285 just below and decided to make an emergency landing on the median strip, heading west. Touchdown on the highway occurred at approximately 0930. The aircraft skidded along the highway for approximately one-half mile, struck the side of the Moreland Avenue bridge, and came to rest on top of the bridge. As the aircraft proceeded along the highway, it struck an automobile that was traveling east and inflicted fatal injuries to the five occupants. One passenger in the aircraft received fatal injuries. The two pilots and one flight attendant received serious injuries. Twenty-seven passengers received injuries requiring medical treatment or hospitalization. The aircraft was destroyed by impact; no fire developed. ", "probable_cause": "The Safety Board determines that the probable cause of this accident was the loss of effective engine power because of improper fuel having been placed in the tanks by relatively untrained personnel. A contributing factor was that the flight crew did not detect the error. "}