{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-6b2-h4-turbo-porter-near-mulia-11-killed", "date": "Apr 17, 2009 at 1015 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "Mimika%20Air", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Ilaga - Mulia", "msn": "959", "yom": 2008, "flight_number": null, "city": "Mulia", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 2664, "captain_hours_type": 1412, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 542, "circumstances": "On the morning of 17 April 2009, a Pilatus PC-6/B2-H4 Turbo Porter aircraft, registered PK-LTJ, operated by PT. Mimika Air, charter flight from Ilaga to Mulia in the Puncak Jaya District of Papua. The Mimika Local Government owned the aircraft. There were 11 people on board; one pilot, one observer, and nine passengers comprised of eight adults and one infant. The aircraft was also carrying National Government election boxes. The flight in accordance with the visual flight rules was estimated to take 18 minutes. There was no record of communication with the aircraft during the flight. Two minutes after the estimated time of arrival, when the Porter had not arrived, a search was commenced. On 18 April, search aircraft located the wreckage of the Porter at an elevation of about 12,000 feet on Mt Gergaji. The location was on the direct track between Ilaga and Mulia. The aircraft impacted the ground in an inverted attitude, and was destroyed by the impact forces and the post-impact fire. All occupants were fatally injured. The weather in the valleys along the route was mostly clear, with cloud on the mountains. The route flown by the pilot was the direct track, which passed over a mountain range, with a high peak adjacent to, and west of the track at about the midway point, at 13,700 feet. The investigation determined that it was likely that the pilot had flown the aircraft into cloud and lost control of the aircraft in instrument meteorological conditions. The impact signature was consistent with uncontrolled flight at the time of impact. This probably resulted from the pilot becoming spatially disoriented after entering cloud.", "probable_cause": "The pilot may not have had adequate knowledge of the route and weather conditions, and may have been relying on Global Positioning System navigation, and was attempting to climb on the direct track over Mt Gergaji. It was likely that the pilot became spatially disoriented after entering cloud while operating under visual flight procedures, leading to a loss of control and uncontrolled impact with terrain.\n"}