{"url": "https://www.baaa-acro.com/crash/crash-scottish-twin-pioneer-1-yapen-islands-2-killed", "date": "Aug 30, 1957 at 1008 LT", "type": "Scottish Aviation Twin Pioneer", "operator": "NNGLM", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Biak - Biak", "msn": "509", "yom": 1957, "flight_number": null, "city": "Yapen Islands", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew departed Biak-Mokmer Airport at 0930LT for a local training flight. After he completed several touch and go, the captain requested the permission to modify the training program to perform other maneuvers. While performing a turn to the right off the Yapen coast, the airplane lost its right wing and crashed into the sea 13 km offshore and sank. The aircraft was lost and both pilots were killed. ", "probable_cause": "The Commission is of the opinion that, on the ground of the available evidence of the accident with the Twin Pioneer G-AOEO, the accident with the JZ-PPX has to be put down with to certainty nearing probability to the failure of the V-brace strut due to fatigue, because both aeroplanes were equipped with the same type of liftstrut and V-brace construction and because both aeroplanes were used in the same manner. The JZ-PPX carried out many instruction flights at a low altitude, many take-offs and landings, many manoeuvres with high flight loads, possibly up to the maximum loads. The G-AOEO also carried out many demonstration flights at a low altitude with man take-offs and landings, many manoeuvres, also with possibly maximum loads. The term of life of the V-brace as declared by the manufacturer, was based on conditions of flight which are not in agreement with the reality. During a meeting at September 6, 1957, Mr MacCallum of Scottish Aviation Ltd. gave a value of 4000hrs which raised a discussion. The Commission is aware of the fact that he cannot give a positive opinion upon the cause of the accident because there are no silent witnesses present, but nevertheless is of the opinion that there is a close conformity with the accident of the G-AOEO."}