{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-560f-cumberland-4-killed", "date": "Oct 14, 2007 at 1030 LT", "type": "Rockwell Aero Commander 560", "operator": "Gold Diggers", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cumberland - Atlantic City", "msn": "560-1416-68", "yom": 1964, "flight_number": null, "city": "Cumberland", "zone": "Maryland", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 21000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3705, "circumstances": "The airplane was loaded to within a few hundred pounds of its maximum gross takeoff weight, and departed from an airport located in a valley, surrounded by rising terrain. Although visual conditions prevailed at the accident airport, fog was present in the adjacent valleys. During the initial climb after takeoff, the right engine lost partial power due to a failure of the number one cylinder exhaust valve. The pilot secured the right engine; however, he was unable to maintain a climb with only the left engine producing power. The airplane was manufactured in 1964. Review of weight and performance data published at the time of manufacture, revealed that the airplane should have been able to climb about 400 feet-per-minute with a single engine producing power. No current weight and balance data was recovered, and due to impact and fire damage, the preimpact power output of the left engine could not be determined. Both engines were last overhauled slightly more than 12 years prior to the accident, and flown about 310 hours during that time. For the make and model engine, the manufacturer recommended overhaul at 1,200 hours of operation, or during the twelfth year.\n", "probable_cause": "A partial power loss in the right engine due to the failure of the number one exhaust valve, and the airplane's inability to maintain a climb on one engine for unknown reasons. Contributing to the accident were fog and rising terrain."}