{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu24-950m-pukeatua-1-killed", "date": "Jun 29, 1982 at 0943 LT", "type": "Fletcher FU-24", "operator": "Robertson%20Air%20Service", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": null, "msn": "42", "yom": 1957, "flight_number": null, "city": "Pukeatua", "zone": "Waikato Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off on its 13th sowing flight of the morning and headed for the sowing area, about 2 minutes flying time away. It was observed by a farmer working some 1.5 km away from the accident site to make its usual pattern of sowing runs for that morning, that is an initial northerly run over the sowing area during which the major portion of the fertilizer load was dispensed, followed by a RH reversal turn to sow the balance of the load. On this last flight however the witness thought that the northerly run was started further north than the previous ones and the reversal turn was preceded by a steeper climb than usual. The witness then saw the plane descending sharply until it passed from his sight behind intervening terrain. This witness heard the impact. The aircraft was found wrecked by another witness who heard a plane pass right overhead his house, followed by the cessation of engine noise and then the sound of the crash. This witness and another person were able to get to the crash site in just a minute or two and found the plane upright and on its belly but wrecked. There was no fire. The pilot was found still strapped in his seat and unconscious. He had incurred serious head and facial injuries from which he died next day. A pathologist's opinion was that the injuries were fatal. Ground evidence showed that the Fletcher had struck with its right wing a power pole on the boundary of the paddock being sown while descending in a right bank, before pivoting and hitting the ground in a yaw to the right, and in a nose down attitude.\r\nSource: ASN", "probable_cause": "It was concluded that the most probable cause of this accident was that the pilot had misjudged his speed and altitude when approaching the top of a reversal turn at the end of a sowing run. There was no evidence of engine or structural failure prior to the impact with the power pole. The cessation of engine noise would be attributable to the pilot throttling right back when it appeared that he was in danger of crashing. The weather was cloudy with almost no breeze. The visibility was normal. Weather was not a factor.\n"}