{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-500-phenom-100-gaithersburg-6-killed", "date": "Dec 8, 2014 at 1041 LT", "type": "Embraer EMB-500 Phenom 100", "operator": "Sage Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Chapel Hill - Gaithersburg", "msn": "500-00082", "yom": 2009, "flight_number": null, "city": "Gaithersburg", "zone": "Maryland", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 3, "total_fatalities": 6, "captain_hours": 4737, "captain_hours_type": 136, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 634, "circumstances": "The airplane crashed while on approach to runway 14 at Montgomery County Airpark (GAI), Gaithersburg, Maryland. The airplane impacted three houses and the ground about 3/4 mile from the approach end of the runway. A postcrash fire involving the airplane and one of the three houses, which contained three occupants, ensued. The pilot, the two passengers, and the three people in the house died as a result of the accident. The airplane was destroyed by impact forces and postcrash fire. The flight was operating on an instrument flight rules flight plan under the provisions of 14 Code of Federal Regulations (CFR) Part 91. Visual meteorological conditions prevailed at the time of the accident. Data from the airplane’s cockpit voice and data recorder (CVDR) indicated that the takeoff about 0945 from Horace Williams Airport, Chapel Hill, North Carolina, and the cruise portion of the flight were uneventful. CVDR data showed that about 15 minutes after takeoff, the passenger in the right cockpit seat made a statement that the airplane was “in the clouds.” A few seconds later, the airplane’s engine anti-ice system and the wing and horizontal stabilizer deice system were manually activated for about 2 minutes before they were manually turned off. About 6 minutes later, a recording from the automated weather observing system (AWOS) at GAI began transmitting over the pilot’s audio channel, containing sufficient information to indicate that conditions were conducive to icing during the approach to GAI. The CVDR recorded no activity or faults during the rest of the flight for either ice protection system, indicating that the pilot did not turn the systems back on. Before the airplane descended through 10,000 ft, in keeping with procedures in the EMB-500 Pilot Operating Handbook, the pilot was expected to perform the Descent checklist items in the Quick Reference Handbook (QRH), which the pilot should have had available in the airplane during the flight. Based on the AWOS-reported weather conditions, the pilot should have performed the Descent checklist items that appeared in the Normal Icing Conditions checklist, which included turning on the engine anti-ice and wing and horizontal stabilizer deice systems. That action, in turn, would require the pilot to use landing distance performance data that take into account the deice system’s activation. CVDR data show that, before beginning the descent, the pilot set the landing reference (Vref) speed at 92 knots, indicating that he used performance data for operation with the wing and horizontal stabilizer deice system turned off and an airplane landing weight less than the airplane’s actual weight. Using the appropriate Normal Icing Conditions checklist and accurate airplane weight, the pilot should have flown the approach at 126 knots (a Vref of 121 knots +5 knots) to account for the icing conditions.", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was the pilot’s conduct of an approach in structural icing conditions without turning on the airplane’s wing and horizontal stabilizer deice system, leading to ice accumulation on those surfaces, and without using the appropriate landing performance speeds for the weather conditions and airplane weight, as indicated in the airplane’s standard operating procedures, which together resulted in an aerodynamic stall at an altitude at which a recovery was not possible. "}