{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh83-fox-moth-near-cattle-flat-1-killed", "date": "Apr 27, 1963 at 1030 LT", "type": "De Havilland DH.83 Fox Moth", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Mountains", "schedule": "Cattle Flat - Cattle Flat", "msn": "TS-2810", "yom": 1947, "flight_number": null, "city": "Cattle Flat", "zone": "Otago Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Crashed and destroyed by fire at Freezing Flat, near Minaret Creek, about 3 miles west of Lake Wanaka 27.4.63; Pilot Terry Garnier, injured, survived. Passenger Myrven Ernest Reid, died in crash. The Fox Moth took off on a pleasure flight over the surrounding mountain country. The weather was fine and the visibility was unlimited. The wind was light and the air smooth. When flying in a narrow valley above Minaret Creek at height of 1,500 feet and confined by high hills the pilot found that his aircraft would apparently not maintain height and airspeed, despite cruising and at times full power being demanded from the engine. The pilot said he could not prevent the aircraft from losing height rapidly.The plane crashed on a dry shingle bank in a moderate dive and burst into flames. Despite his burns and shock the pilot made a resolute attempt to rescue his friend from the fire but was unsuccessful.\nSource: https://aviation-safety.net/wikibase/wiki.php?id=63122", "probable_cause": "The crash investigation found that pilot had suffered spatial disorientation induced by the lack of a true horizon and had mushed the biplane into the ground in a semi-stalled condition. His relative lack of flying experience and lack of training in mountain flying were contributing factors. "}