{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-near-notnare-2-killed", "date": "Sep 9, 2011 at 1230 LT", "type": "Cessna 208B Grand Caravan", "operator": "Susi%20Air", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Wamena - Kenyam", "msn": "208B-1287", "yom": 2007, "flight_number": null, "city": "Notnare", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1546, "captain_hours_type": 1315, "copilot_hours": 927, "copilot_hours_type": 147, "aircraft_hours": 3926, "circumstances": "A Cessna 208B Grand Caravan I was destroyed when it crashed in the Yahukimo District, Indonesia. Both crew members were killed. The airplane was being operated on a non-scheduled cargo flight from Wamena Airport to Kenyam Aerodrome in Papua, Indonesia. The flight was being conducted under visual flight rules (VFR) and the pilot reported to ATC that the planned altitude was 9,500 feet. On board the aircraft were two pilots, a manifested load of diesel drums and grocery items, and a non-manifested load of 25 bags of rice weighing 827 lb (375 kg). The takeoff weight, based on the manifested cargo and the additional load of rice was estimated by the investigation to be 9,681 lb (4,391 Kg) which was 619 lb (281 Kg) above the certificated maximum takeoff weight. Also, the aircraft Centre of Gravity (C of G) was outside the certificated C of G envelope. The aircraft took off from Wamena runway 15 at 12:17 local time. The aircraft was then flown along a track toward Kenyam which was consistent with the route used by other company pilots and previously flown by the pilot in command. The additional loading contributed to a reduced rate of climb during the flight which resulted in the aircraft being below 10,000 ft as it approached the high terrain. This altitude was 1,500 ft lower than the altitude specified in the operator's route guide for operations between Wamena and Kenyam, and lower than the altitude flown by other company pilots when operating in the area, including three other flights on the day of the accident which overflew the high terrain between 11,200 and 12,500 ft. At 12:29:43, as the aircraft approached the high terrain at an altitude of 9,538 ft, the airspeed commenced decreasing which was accompanied by the average rate of climb increasing to about 390 fpm. It is probable that the pilots recognized the proximity of the terrain and attempted to improve the aircraft's angle of climb by decelerating towards the best angle of climb speed of 72 kts. The recorded data showed that 31 seconds after the airspeed started to decrease, the engine power varied with a maximum engine torque of 1,675 ft/lb being recorded at 12:30:30 with changes in the other engine parameters being consistent with a selection of a higher power setting. This is likely to have been associated with the pilot's attempts to improve terrain clearance. The recorded data then showed the aircraft in a descending right turn for about 6 seconds. The altitude reduced over a period of 4 seconds from 9,865 ft to 9,728 ft at an average rate of descent of about 2,000 fpm. This turn was likely to have been initiated to either avoid cloud or improve terrain clearance. The aircraft subsequently commenced to roll to the left at 12:30:35 with the left roll continuing for the following 14 seconds. It was likely that the left turn was initiated to avoid either cloud or terrain. During the left turn, the angle of bank reached a maximum value of 46° and the aircraft descended from 9,728 ft to 9,045 ft at a high rate of descent. The airspeed also increased from 92 kts to 122 kts during the descent. The engine power was reduced to idle soon after the aircraft commenced descending which was most likely due to the handling pilot attempting to recover from the high descent rate and increasing airspeed. The recorded data indicated that three EGPWS alerts activated during the descent. The aircraft had stopped descending at 12:30:50 and had commenced climbing with a reducing left angle of bank when the airplane impacted terrain at an elevation of 9,100 feet.", "probable_cause": "Factors that contributed to the accident are as follows:\r\na. The aircraft was loaded to a weight in excess of the maximum certificated takeoff weight.\r\nb. The aircraft climb performance was adversely affected by the aircraft being operated above the certificated maximum takeoff weight.\r\nc. The aircraft approached high terrain along the proposed route at an altitude which was below that specified in the operator's route guide.\r\nd. The aircraft entered a high rate of descent during a terrain avoidance maneuver.\r\ne. Recovery from the abnormal flight path was not achieved before the aircraft collided with terrain."}