{"url": "https://www.baaa-acro.com/crash/crash-avro-504k-gatwick-3-killed", "date": "Jan 25, 1931", "type": "Avro 504", "operator": "Home Counties Aircraft Service", "flight_phase": "Flight", "flight_type": "Demonstration", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Gatwick - Gatwick", "msn": null, "yom": null, "flight_number": null, "city": "London-Gatwick", "zone": "West Sussex", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the afternoon of Sunday, January 25th, 1931, an Avro 504K (serial G-AACW) crashed about 1/4 mile from Gatwick aerodrome, killing the pilot and both passengers. The aeroplane was a wartime machine originally manufactured under licence by G.Parnell & Coy Ltd, and had been completely rebuilt by Southern Aircraft Ltd in the spring of 1929. At the time of the last flight the aeroplane was not equipped with dual control, a false floor having been fitted over the control column socket and the rudder bar of the rear cockpit. The pilot, Mr. W J Martin, had started to learn to fly at Shoreham in February 1929, and made his first solo flight in June 1930, at which time he had received about 12 hours dual instruction. He qualified for his private licence five weeks later. Up to the day of the accident his total solo flying time was nearly 200 hours. Martin was not very experienced in aerobatics, although a few days before the accident a friend had demonstrated to him how to execute slow rolls. The first 10 minutes or so of the flight were occupied in carrying out a demonstration in which a number of machines took part and during which nothing in the nature of aerobatics was attempted. Instead of landing at the conclusion of this demonstration, the pilot climbed to a height between 1500 and 2000 feet, and then executed a manoeuver which, to all expert witnesses, appeared to be an abortive attempt to roll and which developed into a spinning nosedive. Twice during its descent, G-AACW ceased to spin and momentarily assumed a straight gliding altitude, only to start spinning in the opposite direction. No one actually witnessed the crash, but the aeroplane had not recovered from the spin when it disappeared below the tree tops. The two passengers who died were named as Mr. S.J.W. Meathrel and Mr. L.H. Irving-Bell (Ground Engineer).\r\nSource: www.sussexhistoryforum.co.uk", "probable_cause": "The investigation report stated that the accident was due to the pilot stalling the aeroplane in an inverted attitude and subsequently failing to make proper use of the controls to effect recovery from the ensuing spin. "}