{"url": "https://www.baaa-acro.com/crash/ground-fire-transall-c-160ng-wamena", "date": "Mar 6, 2008 at 0920 LT", "type": "Transall C-160", "operator": "Manunggal%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jayapura – Wamena", "msn": "F235", "yom": 1985, "flight_number": null, "city": "Wamena", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 6 March 2008, a Transall C-160 aircraft, registered PK-VTQ, operated by PT. Manunggal Air, was on an unscheduled freight flight from Sentani Airport, Jayapura, to Wamena Airport, Papua. There were seven people on board; two pilots, two engineers, and three flight officers. The pilots reported that the approach and landing were normal. However, they told the investigators that both Beta lights did not illuminate during the landing roll, so they could not use reverse thrust. They reported that they used maximum brakes to slow the aircraft, and rolled through to the end of runway 15. During the 180-degree right turn at the end of the runway, they felt the left brakes grabbing, and had to use increased thrust on the left engine to assist the turn. After completing the turn, the pilots backtracked the aircraft towards taxiway “E”, about 450 meters from the departure end of runway 15. The air traffic controller informed the Transall crew that heavy smoke was coming from the left main wheels, and that they should proceed to taxiway “E” and stop on the taxiway. Before the aircraft entered taxiway “E”, the controller activated the crash alarm. The pilots stopped the aircraft on taxiway “E”, and the occupants disembarked and attempted to extinguish the wheel-bay fire with a hand held extinguisher. The airport rescue fire fighting service (RFFS) arrived at the aircraft 10 minutes after the aircraft came to a stop on taxiway “E”. It took a further 5 minutes to commence applying foam. The attempts to extinguish the fire were unsuccessful, and the fire destroyed the aircraft and its cargo of fuel in drums. Investigators found molten metal on the runway along the left wheel track for about 16 meters, about 100 meters from taxiway “E”, between taxiway “E” and the departure end of runway 15. There was also molten metal along the left wheel track on taxiway “E”.", "probable_cause": "The aircraft’s left main wheels’ brakes overheated during the landing roll and a fire commenced in the brake assembly of one or more of the left main landing gear wheels. The evidence indicated that a brake cylinder and/or hydraulic line may have failed. It is likely that brake system hydraulic fluid under pressure, was the propellant that fed the fire. There was no Emergency Response Plan at Wamena. The RFFS delay in applying fire suppressant resulted in the fire engulfing the aircraft. "}