{"url": "https://www.baaa-acro.com/crash/crash-yakovlev-yak-40-krasnovodsk-23-killed", "date": "Aug 15, 1975 at 2201 LT", "type": "Yakovlev Yak-40", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bakou –  Krasnovodsk – Ashkhabad", "msn": "9 33 02 30", "yom": 1973, "flight_number": "SU053A", "city": "Krasnovodsk", "zone": "Balkan Province (Balkan welaýaty)", "country": "Turkmenistan", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 34, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 23, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2130, "circumstances": "On approach to Krasnovodsk Airport by night, the crew encountered marginal weather conditions and at an approximate altitude of 300 meters while on a distance of 5 km from the airfield, the aircraft's speed dropped from 260 km/h to 200 km/h with a rate of descent of 2,5 meters per second. The crew elected to correct this configuration but the aircraft continued to descend until it struck, at a speed of 150 km/h, a rocky cliff situated on the shore of the Caspian Sea, some 159 meters above sea level and located about 4,700 meters short of runway threshold. Upon impact, the right engine and the right wing were torn off, the aircraft bounced and then crashed in flames few dozen meters further. Two crew members and 21 passengers were killed while 15 other occupants were injured.", "probable_cause": "It was determined that the aircraft was caught by orographic turbulence on final approach whose speed was about 30 meters per second (108 km/h). This caused the aircraft to lose altitude and speed and any correction from the flying crew was unsuccessful. The following contributing factors were reported:\r\n- Lack of knowledge on part of the meteorologist about the characteristics of such specific climate phenomenon, \r\n- The absence of a system able to detect such phenomenon, \r\n- The crew inexperience in such flight conditions."}