{"url": "https://www.baaa-acro.com/crash/crash-sukhoi-superjet-100-95b-moscow-41-killed", "date": "May 5, 2019 at 1830 LT", "type": "Sukhoi Superjet 100-95", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Murmansk", "msn": "95135", "yom": 2017, "flight_number": "SU1492", "city": "Moscow-Sheremetyevo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 1, "pax_on_board": 73, "pax_fatalities": 40, "other_fatalities": 0, "total_fatalities": 41, "captain_hours": 6800, "captain_hours_type": 1570, "copilot_hours": 765, "copilot_hours_type": 615, "aircraft_hours": 2710, "circumstances": "The aircraft departed runway 24C at Moscow-Sheremetyevo Airport at 1803LT on a schedule service to Murmansk. Few minutes after takeoff, while climbing to an altitude of 10,000 feet, the crew encountered problems with the electrical system and informed ATC about an emergency situation via the transponder codes 7700 because communication systems were unserviceable. The crew initiated a circuit to return to the airport, continued the approach to runway 24L. On approach at an altitude between 900 and 1,100 feet, the windshear warning system sounded five times 'Go around. Windshear ahead'. From a height of 80 m (260 ft) above ground level, the aircraft descended below the glide path and at a height of 55 m (180 ft) the TAWS warning sounded: \"Glide Slope.\" From that moment on the airspeed increased to 170 knots. At 18:30 the aircraft overflew the runway threshold and touched down at a distance of 900 m past the threshold at a speed of 158 knots. Touchdown occurred at a g-force of at least 2.55g with a subsequent bounce to a height of about 2 m. After two seconds the aircraft landed again on the nose landing gear with a vertical load 5.85g, and bounced to a height of 6 m. The third landing of the aircraft occurred at a speed of 140 knots with a vertical overload of at least 5g. This caused a rupture of the wing structure and fuel lines. The aircraft caught fire, went out of control, veered off runway to the right and came to rest in a grassy area, bursting into flames. The aircraft was destroyed by fire. 37 occupants were evacuated while 41 people, among them a crew member, were killed. ", "probable_cause": null}