{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-destin-3-killed", "date": "Nov 23, 2010 at 1930 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Coleman Acquisitions", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "New Orleans – Destin", "msn": "46-36322", "yom": 2001, "flight_number": null, "city": "Destin-Fort Walton Beach", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 408, "captain_hours_type": 34, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 761, "circumstances": "The instrument-rated pilot was executing a night instrument approach when the airplane impacted the water. The published approach minimums for the area navigation/global positioning system approach were 460-foot ceiling and one-mile visibility. Recorded air traffic control voice and radar data indicated that prior to the approach the pilot had turned to an approximately 180-degree heading and appeared to be heading in the direction of another airport. The controller reassigned the pilot a heading in order to intercept the final approach. The airplane was located in the water approximately 5,000 feet from the runway threshold. A postaccident examination of the airplane revealed that the left main landing gear was in the retracted position and the right main and nose landing gear were in the extended position. Examination of the left main landing gear actuator revealed no mechanical anomalies. The pilot had likely just commanded the landing gear to the down position and the landing gear was in transit. It is further possible that, as the gear was in transit, the airplane impacted the water in a left-wing and nose-down attitude and the left gear was forced to a gear-up position.", "probable_cause": "Controlled flight into water due to the pilot's improper descent below the published minimum descent altitude."}