{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-horn-island-1-killed", "date": "Dec 12, 1995 at 0918 LT", "type": "Rockwell Shrike Commander 500", "operator": "GAM", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Horn Island - Horn Island", "msn": "500-3074", "yom": 1970, "flight_number": null, "city": "Horn Island", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 11740, "captain_hours_type": 119, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At approximately 0910 EST, the aircraft took off from runway 32 at Horn Island and commenced a normal climb. Shortly after, it adopted a nose-high attitude and commenced a wingover type manoeuvre to the right. Witnesses described the aircraft as being in a nose-low attitude, and at a height of approximately 600 ft to 700 ft above ground level after the completion of this manoeuvre. It then abruptly adopted a level attitude and rapidly entered a spin to the left. Witnesses on the ground reported that at approximately the same time as the aircraft entered the spin, engine power became asymmetric, with the right engine continuing to deliver considerable power. The aircraft continued to descend in a fully developed flat spin, with no observed signs of an attempt to recover. The impact was heard shortly after the aircraft descended behind vegetation to the north-west of the aerodrome. The accident was reported to Flight Service by radio at 0918. The wreckage was located on a beach approximately 2 km to the north-west of the aerodrome. The aircraft was destroyed by impact forces and the pilot sustained fatal injuries.", "probable_cause": "The following findings were reported:\r\n1. The pilot held a valid pilot licence and medical certificate.\r\n2. The pilot was endorsed on the aircraft type.\r\n3. The aircraft entered a flat spin to the left with no reported signs of an attempt to recover.\r\n4. The aircraft struck the ground whilst established in a flat left spin.\r\n5. The right engine was producing considerable power prior to impact.\r\n6. Indications were that the left engine was producing little or no power. Its propeller was in the feathered position prior to impact.\r\n7. No evidence was found to indicate a malfunction or pre-existing defect with the aircraft or its systems which may have affected normal operation during this flight.\r\n8. No evidence was found to indicate pilot incapacitation as the result of a medical condition or the presence of alcohol or drugs.\r\n9. The pilot's behaviour on the morning of the accident was not consistent with what was generally accepted to be a thorough and professional attitude to aviation."}