{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-200-medellin", "date": "Jun 7, 2006 at 0702 LT", "type": "Boeing 747-200", "operator": "TradeWinds%20Cargo", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Medellín - Miami", "msn": "22768", "yom": 1982, "flight_number": "TDX444", "city": "Medellín-José María Córdova (Rionegro)", "zone": "Antioquia", "country": "Colombia", "region": "South America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8000, "captain_hours_type": 830, "copilot_hours": 13000, "copilot_hours_type": 152, "aircraft_hours": 78767, "circumstances": "The takeoff from Medellín-José María Córdova Airport runway 36 was initiated in rain falls. During the takeoff roll, the Engine Gas Temperature warning light came on, informing the crew about EGT problems on engines n°1 and 4. In the same time, the engine n°1 encountered technical problems. The captain decided to abort the takeoff procedure and started an emergency braking manoeuvre despite the aircraft' speed was 12 knots above the V1 speed. Unable to stop within the remaining distance, the aircraft overran, lost its nose gear and came to rest about 150 metres further. All five crew members evacuated safely while the aircraft was damaged beyond repair. ", "probable_cause": "The decision of the crew to abandon the takeoff procedure at a speed that was 12 knots above the V1 speed on a wet runway surface, following an EGT warning on engines n°1 and 4. The following contributing factors were identified:\r\n- Failure of the crew to take into consideration the wet runway factor in the takeoff performances calculation, \r\n- Absence of a flight dispatcher properly certified and qualified for the equipment,\r\n- Failure of the engine number n°1 for undetermined reasons. "}