{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-near-tyumen-7-killed", "date": "Dec 9, 1955 at 0745 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Postal (mail)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Moscow – Kazan – Sverdlovsk – Petropavl – Pavlodar – Ust-Kamenogorsk", "msn": "184 281 01", "yom": 20, "flight_number": "SU101", "city": "Tyumen", "zone": "Tyumen oblast", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 4, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8612, "circumstances": "The aircraft left Sverdlovsk Airport bound for Petropavl with four passengers, a crew of five, 869 kilos of mail and 496 kilos of various goods. While cruising by night, the crew encountered higher winds than predicted and due to the lack of visibility, lost their orientation and were unable to locate the airport of Petropavl. The captain decided to divert to Kurgan Airport but was unable to contact ground due to communication problems. He then decided to return to Svedlovsk but as the fuel reserves were too low, he eventually decided to continue to Petropavl that was closed due to poor weather conditions. While cruising in snow falls about 215 km from Petropavl Airport, both engines failed due fuel exhaustion. The crew attempted an emergency landing in a snow covered field when the airplane crashed 250 meters from the Omsk-Tyumen railroad. Two passengers were seriously injured while all seven other occupants were killed. ", "probable_cause": "The accident was the consequence of a loss of orientation by the crew in flight due to the combination of the following factors:\r\n- Lack of discipline on part of the crew,\r\n- Poor flight preparation with the result of insufficient fuel reserve for the entire duration of flight, \r\n- Errors in flight in the navigation calculation. More than two hours of flight were not recorded in the navigator's logbook,\r\n- Failure to use the flight direction finder,\r\n- Poor weather conditions at night with high winds and snow falls, \r\n- Unsatisfactory flight management from RDS Koltsovo and ADS Kurgan.\r\nThe following findings were considered as contributing:\r\n- Unjustified weather forecast in the direction of the wind, issued by AMSG Koltsovo,\r\n- Unstable work of the radio compass,\r\n- Insufficient fuel for the operation,\r\n- Unstable work of the communication equipment,\r\n- Low qualification of the communications operators.\n"}