{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-602p-almy-1-killed", "date": "Jan 5, 1983 at 1730 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "Moser Engine Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Casper – Almy", "msn": "62P-0893-8165025", "yom": 1981, "flight_number": null, "city": "Almy", "zone": "Wyoming", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1642, "captain_hours_type": 341, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 372, "circumstances": "Before departing, the pilot obtained a weather briefing and was advised of a sigmet which forecasted severe turbulence below 18,000 feet, strong up/downdrafts, strong surface winds and wind shear near mountains and in passes. He took off with full fuel tanks and approximately 400 lbs of cargo on board. ARTCC reported that the en route portion of the flight was handled routinely. During arrival, the pilot contacted the airport unicom for a landing advisory. A King Air pilot was arriving at about the same time and asked the Aerostar pilot if he was making a full stop. The Aerostar pilot replied that he was. The King Air pilot lost sight of the Aerostar and began a 360° turn. He asked the Aerostar pilot to advise of his position, and shortly thereafter, the Aerostar pilot transmitted three mayday calls. Reportedly, the aircraft nosed up and went into a steep right bank just before impact. No preimpact mechanical failure/malfunction was found. There was evidence that most of the cargo was in the baggage compartment (limited to 240 lbs) and could have moved the CofG well beyond the aft limit. Elevator trim found full nose down. The pilot, sole on board, was killed. ", "probable_cause": "Occurrence #1: loss of control - in flight\r\nPhase of operation: approach - VFR pattern - base leg/base to final\r\nFindings\r\n1. (c) preflight planning/preparation - inadequate - pilot in command\r\n2. (c) aircraft weight and balance - exceeded - pilot in command\r\n3. Light condition - dusk\r\n4. Visual lookout - reduced - pilot in command\r\n5. (f) diverted attention - pilot in command\r\n6. Aircraft handling - not maintained - pilot in command\r\n7. Stall - uncontrolled - pilot in command\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled"}