{"url": "https://www.baaa-acro.com/crash/crash-antonov-12b-baku", "date": "Mar 14, 1995", "type": "Antonov AN-12", "operator": "Penza Air Enterprise - Penzenskoe Aviapredpriatie", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yerevan - Turkmenbashi", "msn": "3 3 412 04", "yom": 1963, "flight_number": "PZA9455", "city": "Baku-Heydar Aliyev (Bina)", "zone": "Absheron", "country": "Azerbaijan", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine aircraft departed Yerevan Airport on a cargo flight to Turkmenbashi, carrying 8 passengers, 7 crew members and a load of 13 tons of various goods. En route, while cruising at an altitude of 9,100 metres, the crew requested the permission to divert to Baku-Bina Airport. On approach, the crew was instructed by ATC to initiate a go-around as he was aligned on the wrong runway (a runway under construction and parallel to the active runway 35). The crew started to climb when all four engines stopped simultaneously. The aircraft stalled and crashed in a rocky field located 6 km from the airport. All 15 occupants were injured and the aircraft was destroyed. ", "probable_cause": "It was determined that the accident was the consequence of the following factors:\r\n- During engine run at Yerevan Airport, the crew encountered technical problems with an engine that could not be started properly, which caused an excessive fuel consumption of 900 litres, \r\n- En route, the crew failed to monitor properly the fuel consumption, \r\n- The decision to divert to Baku-Bina Airport was taken too late, \r\n- The crew failed to declare an emergency and failed to inform ATC that he was short of fuel, which would give him the priority for landing, \r\n- Poor approach planning as the crew was approaching the wrong runway, \r\n- Poor crew coordination, \r\n- The crew failed to raise the landing gear during climbout, which increased fuel consumption. \n"}