{"url": "https://www.baaa-acro.com/crash/crash-boeing-247d-lone-peak-7-killed", "date": "Dec 15, 1936 at 0314 LT", "type": "Boeing 247", "operator": "Western%20Air%20Express-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Burbank – Las Vegas – Salt Lake City", "msn": "1957", "yom": 1935, "flight_number": "WX006", "city": "Lone Peak", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While approaching Salt Lake City Airport at night and in poor weather conditions, the crew was unable to fix his real position and was unaware that the aircraft deviated from the approach path to the east. While cruising at an altitude of 11,000 feet at a speed of 207 miles an hour, the twin engine aircraft impacted the slope of Lone Peak (11,253 feet high) located some 20 miles southeast of the airport. SAR teams were unable to locate the aircraft and all operations were suspended few days later. The wreckage was eventually found on July 4, 1937.\r\nCrew:\r\nS. J. Samson, pilot, \r\nWilliam L. Bogan, copilot, \r\nGladys Witt, stewardess.\r\nPassengers:\r\nC. Christopher, \r\nMr. & Mrs. John Wolf,\r\nE. W. Edwards.", "probable_cause": "It was established that during the approach to Salt Lake City, the flight encountered snow static which rendered the aircraft's navigation receivers inoperative. Without a definite course to follow, the flight drifted east into mountainous terrain. It is the opinion of the Accident Board that the probable cause of the accident was inability of the pilots to identify the south leg of the Salt Lake Radio Range due to a local static condition which rendered both range receivers in the airplane inoperative. \n"}