{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-5-do-skymaster-cordoba", "date": "Jun 17, 1953 at 1930 LT", "type": "Douglas C-54 Skymaster", "operator": "Aerolineas-Argentinas-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Santa Cruz – Salta – Córdoba", "msn": "7468", "yom": 1944, "flight_number": null, "city": "Córdoba", "zone": "Córdoba", "country": "Argentina", "region": "South America", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 34, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14000, "captain_hours_type": 5300, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft left Santa Cruz de la Sierra (Bolivia) on a scheduled airline flight and landed without incident at Salta 2 hours and 30 minutes later. It took off from Salta airport for Córdoba at approximately 1645LT. At take-off the aircraft was carrying a total load of 3,512 kg. The route forecast as far as Marcos Juarez was as follows: partly cloudy, visibility 15 km, stratocumulus cloud 7/8 at 800 meters, altocumulus 3/8 at 3'000 meters, upper wind 20' 13/15 knots. The aircraft contacted Córdoba Airport control tower at 1856LT and was cleared to enter the airport zone. At 1925LT it passed over the radio beacon and the control tower provided the following weather information: horizontal visibility 6 km, average height of cloud 250 meters, pressure for altimeter correction 30 inches, surface wind SE, 10 to 11 knots. The approach to the airport was begun under IFR conditions, at an indicated speed of mph and at an altitude of 5, 100 feet above the radio range (the requirement is 4,400 feet). aircraft flew a course to the north for 1 minute 50 seconds, with 15° flaps and then, continuing the descent, it turned to the right on a 45° course, flying in this direction for 1 minute more. The altitude just before the turn was 3, 100 feet. It then turned to the left on a course of 225°. When the aircraft direction finder indicated 40° to the left, the compass was set at 180° and the direction finder maintained at O°. At that moment, according to the evidence, the instruments indicated an altitude of 2, 980 feet. The aircraft flew at this altitude for 30 seconds, and the engine speed was reduced for landing. It continued to descend for another minute 20 seconds until the altimeter indicated 2, 200 feet. At that instant, according to the statements made by the pilot-in-command and the copilot, the aircraft came into contact with the ground. The aircraft was finishing the final straight-in approach to the airport and was aligned exactly with runway 17. All 41 occupants were evacuated safely, only both pilots were slightly injured. The aircraft was destroyed. ", "probable_cause": "Since it was evident that the accident was caused by the fact that the aircraft had been unduly deflected toward the north during the instrument approach, the investigation attempted to discover the reasons for that deflection. The following probable factors were considered: \r\n- An analysis of the approach maneuver indicated that it had been started at a greater altitude than that prescribed by the instrument approach procedures. This in itself would result in a steeper descent on the northern course, and it is possible therefore that the speed of 140 miles per hour was exceeded by 5 or 10 knots, particularly since the landing gear was retracted and tail wind was not taken into account in timing the maneuver,\r\n- The copilot stated that he called the time on his stop-watch, using the small second-hand because the large one was not working properly. This was confirmed by the Investigating Board. Since the co-pilot was wearing the watch on the left wrist and working constantly with that hand in trying to tune in the \"C\" marker beacon, his time readings may have been inaccurate with the result that the total time may have been exceeded by a few seconds,\r\n- The possibility of upper wind of an intensity greater than that registered on the surface. \r\nThis theory was accepted, taking into account the fact that two fronts of the \"upper\" cold front type occurred at Córdoba on 17 June 1953"}