{"url": "https://www.baaa-acro.com/crash/crash-percival-p66-pembroke-c1-raf-east-fortune", "date": "May 26, 1961", "type": "Percival P.66 Pembroke", "operator": "Royal-Air-Force-4", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "East Fortune - Leuchars", "msn": "37", "yom": 1956, "flight_number": null, "city": "East Fortune AFB", "zone": "East Lothian (Haddingtonshire)", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Pembroke took off from East Fortune to proceed to RAF Leuchars on 26th of May 1961 after flying from a NATO meeting in Paris with Air Vice Marshall R.B. Thompson and Air Vice Marshall R.H. Wright both men had just been set down at East Fortune. Soon after take off at around 2,000 feet that problem started, with North Berwick in view, only a short distance from the airfield, the port engine caught fire and blew up. The pilot, Flt Lt Munn, look out of the cockpit and found that the engine cowling and parts of the engine were missing and the engine was still burning. The pilot decided to crash land as soon as possible and with that he turned the aircraft hard to port to avoid crossing the coast and getting into even more danger. While doing this he closed both throttles (closing the starboard throttle by mistake) and started a rapid descent. The aircraft crash landed in a corn field close to Newhouse farm (near North Berwick) and only minor injuries were received by the pilot and copilot. Five minutes after leaving the aircraft the port inboard fuel tank exploded and the entire fuselage was gutted.\nSource: https://aviation-safety.net/wikibase/wiki.php?id=145236", "probable_cause": "Prime cause of the accident was Engine failure. This failure was caused by a hydraulic lock which took place only a short time before the failure. This was not found on the ground prior to take off due to a failure by the Pilot to comply with instructions in the relevant Aircraft Procedures. Contributory Hydraulic lock in No. 6 cylinder caused the break up in flight of the port engine."}