{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-tirohanga-1-killed", "date": "Nov 1, 1959 at 0850 LT", "type": "Fletcher FU-24", "operator": "Adastra-Aviation", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "McCurran - McCurran", "msn": "24", "yom": 1956, "flight_number": null, "city": "Tirohanga", "zone": "Waikato Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 281, "captain_hours_type": 68, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Loss of control during a routine aerial topdressing flight. The pilot was new to ag. flying having made his first topdressing sortie on the 10th of October, and had logged fifty hours of topdressing in the twenty-two subsequent days before he was killed. His flying time in the FU24 was 68 hours. His total time, dual and solo, was 281 hours. The loader driver saw the aircraft making a normal sowing run and then, climbing to 150 feet, enter a medium turn to the right. It appeared that the pilot was positioning his aircraft for a run on a reciprocal heading. This turn progressed through 90 degrees and then the witness saw the nose begin to drop, accompanied by an increase in both the angle of bank and rate of turn. This unusual attitude so close to the ground caused the loader driver to leave his cab and run in the direction of the plane as it disappeared from his view behind a hill. Another witness, who saw the full sequence of events, said the the plane made two full rotations in its spiral dive before crashing and exploding in flames. The weather was CAVU and calm, ideal conditions. The engine was producing power right up to impact. There was no evidence of structural failure in flight. ", "probable_cause": "The investigator concluded that inexperience was the basic cause factor in this accident, and that misuse of control in the execution of a diving turn induced an incipient spin which culminated in a spiral dive without adequate height available for a recovery. "}