{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-65-a90-king-air-orange", "date": "Nov 16, 1996 at 1500 LT", "type": "Beechcraft 90 King Air", "operator": "Fayard%20Enterprises", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Orange - Orange", "msn": "LJ-186", "yom": 1967, "flight_number": null, "city": "Orange", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1170, "captain_hours_type": 40, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was taking off with 10 jumpers onboard. At the rotation speed of 100 knots, he used elevator trim to rotate the airplane, but it did not lift off the runway. He continued moving the trim wheel violently to pitch the nose up, and attempted to pull back on the yoke, but the airplane collided with rising terrain off the end of the runway. A witness did not see any of the flight controls move during the pilot preflight inspection, and during the takeoff roll, he did not observe a nose up rotation of the airplane. The pilot reported that he removed a single pin control lock from the yoke during preflight. The Beech control lock consisted of two pins, two chains, and a U-shaped engine control lock. The pilot walked away from the wreckage after the accident. No control locks were found in the wreckage. However, the control column shaft exhibited distress signatures on the periphery of the hole where the control lock is installed. No other evidence was found of any other form of mechanical jamming, interference, or discontinuity with the flight controls. Investigators were unable to identify any potential source of interference, other than a control lock, that could have simultaneously jammed both pitch and roll control. According to the airplane's manufacturer, about 3 to 6 degree of trim would have been normal for the airplane's takeoff conditions.", "probable_cause": "The pilot's inadequate preflight inspection and his failure to complete the pre-takeoff checklist which resulted in a takeoff roll with the control lock in place."}