{"url": "https://www.baaa-acro.com/crash/crash-boeing-767-366er-atlantic-ocean-217-killed", "date": "Oct 31, 1999 at 0152 LT", "type": "Boeing 767-300", "operator": "Egyptair", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Los Angeles – New York – Cairo", "msn": "24542", "yom": 1989, "flight_number": "MS990", "city": "Atlantic Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 15, "crew_fatalities": 15, "pax_on_board": 202, "pax_fatalities": 202, "other_fatalities": 0, "total_fatalities": 217, "captain_hours": 14384, "captain_hours_type": 6356, "copilot_hours": 12538, "copilot_hours_type": 5191, "aircraft_hours": 33354, "circumstances": "EgyptAir Flight 990 departed Los Angeles International Airport, destined for Cairo, with a scheduled intermediate stop at New York-JFK. The aircraft landed at JFK about 23:48 EDT and arrived at the gate about 00:10 EDT. Two designated flight crews (each crew consisting of a captain and first officer) boarded the aircraft at JFK. The aircraft taxied to runway 22R and was cleared for takeoff at 01:19. Shortly after liftoff, the pilots of EgyptAir flight 990 contacted New York Terminal Radar Approach (and departure) Control (TRACON). New York TRACON issued a series of climb instructions and, at 01:26, instructed the flight to climb to FL230 and contact New York Air Route Traffic Control Center (ARTCC). At 01:35, New York ARTCC instructed EgyptAir flight 990 to climb to FL330 and proceed directly to DOVEY intersection. About 01:40 the relief first officer suggested that he relieve the command first officer at the controls. The command first officer agreed and left the flightdeck. The airplane leveled at FL330 four minutes later. At 01:48, the command captain decided to go to the toilet and left the flightdeck. At 01:48:30, about 11 seconds after the captain left the cockpit, the CVR recorded an unintelligible comment. Ten seconds later, the relief first officer stated quietly, \"I rely on God.\" There were no sounds or events recorded by the flight recorders that would indicate that an airplane anomaly or other unusual circumstance preceded the relief first officer's statement. At 01:49:18, the CVR recorded the sound of an electric seat motor and 27 seconds later the autopilot was disconnected. At 01:49:48, the relief first officer again stated quietly, \"I rely on God.\" At 01:49:53, the throttle levers were moved from their cruise power setting to idle, and, one second later, the FDR recorded an abrupt nose-down elevator movement and a very slight movement of the inboard ailerons. Subsequently, the airplane began to rapidly pitch nose down and descend. Between 0149:57 and 0150:05, the relief first officer quietly repeated, \"I rely on God,\" seven additional times. During this time, as a result of the nose-down elevator movement, the airplane's load factor decreased from about 1 to about 0.2 G (almost weightlessness). Then the elevators started moving further in the nose-down direction. Immediately thereafter the captain entered the flightdeck and asked loudly, \"What's happening? What's happening?\". As he airplane's load factor reached negative G loads (about -0.2 G) the relief first officer stated for the tenth time, \"I rely on God.\" At 01:50:08, as the airplane exceeded its maximum operating airspeed (0.86 Mach), a master warning alarm began to sound and the relief first officer stated quietly for the eleventh and final time, \"I rely on God,\" and the captain repeated his question, \"What's happening?\" At 0150:15, as the airplane was descending through about 27,300 feet the airplane's rate of descent began to decrease. About 6 seconds later the left and right elevator surfaces began to move in opposite directions. The engine start lever switches for both engines then moved from the run to the cutoff position. At 01:50:24 the throttle levers started to move from their idle position to full throttle, and the speedbrake handle moved to its fully deployed position. The captain again asked \"What is this? What is this? Did you shut the engine(s)?\" At 01:50:26, the captain stated, \"Get away in the engines ... shut the engines\". The relief first officer replied \"It's shut\". Between 01:50:31 and 01:50:37, the captain repeatedly stated, \"Pull with me.\" However, the elevator surfaces remained in a split condition (with the left surface commanding nose up and the right surface commanding nose down) until the FDR and CVR stopped recording. at 0150:36.64 and 0150:38.47, respectively. The height estimates based on primary radar data from the joint use FAA/U.S. Air Force (USAF) radar sites indicated that the airplane's descent stopped about 01:50:38 and that the airplane subsequently climbed to about 25,000 feet msl and changed heading from 80º to 140º before it started a second descent, which continued until the airplane impacted the ocean.", "probable_cause": "The National Transportation Safety Board determines that the probable cause of the EgyptAir flight 990 accident is the airplane's departure from normal cruise flight and subsequent impact with the Atlantic Ocean as a result of the relief first officer's flight control inputs. The reason for the relief first officer's actions was not determined."}