{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-6b1-h2-turbo-porter-casas-de-los-pinos", "date": "Apr 14, 2007 at 1015 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "Aerobalas", "flight_phase": "Landing (descent or approach)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Casas de Los Pinos - Casas de Los Pinos", "msn": "705", "yom": 1969, "flight_number": null, "city": "Casas de Los Pinos", "zone": "Castile-La Mancha", "country": "Spain", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 650, "captain_hours_type": 138, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9046, "circumstances": "The aircraft ran off runway 30 at the Casas de los Pinos aerodrome while landing. The aircraft, used for parachuting operations, was making a reconnaissance flight before the parachuting flights, which were scheduled for later. According to the pilot's statement, during the flare, and before touching down, a gust of wind lifted the left wing. The pilot used left rudder and tilt to try to level the aircraft, but could not keep it from exiting the runway. As stated by the pilot, the approach was performed without flaps, at a speed of 70 knots and with the aft gear locked. The aircraft ended up 25 metres from the edge of the runway on a heading of 190°, resting on its lower fuselage, which was damaged along its underside, as were the left aileron and the horizontal stabilizer. The right main landing gear was bent outward, the left gear had detached and was 30 metres away from the aircraft, and the propeller had detached at the reduction gearbox and was next to the aft landing gear to the left of the aircraft. Both occupants were able to exit the aircraft under their own power. The pilot received a slight injury to his chin and the passenger was unhurt. ", "probable_cause": "It is not known why aircraft EC-JOE left runway 30 during the landing, though it seems obvious that the aircraft's path was altered while it was flying at a low altitude. The possibility that a technical problem with the aircraft caused the accident has been ruled out. It has not been possible to confirm if the wind was gusting at the aerodrome at the time of the accident, though even gusty conditions should not have affected control of the aircraft since its airspeed was high enough with respect to the stall speed. "}