{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-vista-liner-300-grand-canyon-20-killed", "date": "Jun 18, 1986 at 0933 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Grand%20Canyon%20Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Grand Canyon - Grand Canyon", "msn": "248", "yom": 1969, "flight_number": "YR06", "city": "Grand Canyon", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 18, "pax_fatalities": 18, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": 5970, "captain_hours_type": 1556, "copilot_hours": 4450, "copilot_hours_type": 1076, "aircraft_hours": 30569, "circumstances": "On June 18, 1986, at 0855 mountain standard time, a Grand Canyon Airlines DHC-6, N76GC (Twin Otter), call sign Canyon 6, took off from runway 21 of the Grand Canyon Airport. The flight, a scheduled air tour over Grand Canyon National Park, was to be about 50 minutes in duration. Shortly thereafter, at 0913, a Helitech Bell 2068 (Jet Ranger), NGTC, call sign Tech 2, began its approximate 30-minute, on-demand air tour of the Grand Canyon. It took off from its base at a heliport adjacent to State route 64 in Tusayan, Arizona, located about 5 miles south of the main entrance to the south rim of the National Park. Visual meteorological conditions prevailed. The two aircraft collided at an altitude of 6,500 feet msl in the area of the Tonto Plateau. There were 18 passengers and 2 flightcrew members on the DHC-6 and 4 passengers and 1 flightcrew member on the Bell 206B. All 25 passengers and crew members on both aircraft were killed as a result of the collision. Because of the lack of cockpit voice recorders and flight data recorders in both aircraft, as well as the lack of radar data, no assessment of the flight path of either aircraft could be made. As a result, the reason for the failure of the pilots of each aircraft to “see and avoid” each other cannot be determined. Consequently, the issues highlighted in this report concern primarily the oversight of the Federal Aviation Administration (FAA) on Grand Canyon-based scenic air tours or sightseeing flights and the actions of the National Park Service to influence these operations. Because of an exemption to 14 Code of Federal Regulations (CFR) Part 135, local scenic air tours were conducted under 14 CFR Part 91. This investigation revealed that there was no FAA oversight on the routes and altitudes of Grand Canyon-based scenic air tour operators. This was contrary to the intent of Safety Recommendation A-84-52. Further, the National Park Service, through its authority under a 1975 law, was conducting a study to determine the effects of aircraft noise on the Grand Canyon and, at the same time, influencing the selection of air tour routes. The routes of the rotary-wing operators were ‘moved as a noise conservation measure to where they converged with those of Grand Canyon Airlines at the location of the accident. Other safety issues concern the lack of regulations to limit flight and duty times of pilots conducting scenic air tour flights, and the lack of a requirement for the pilots of such flights to use intercoms or public address systems when narrating during the flights. All 20 occupants of the Twin Otter were killed, among them 11 citizen from The Netherlands and two Swiss. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was the failure of the flightcrews of both aircraft to “see and avoid” each other for undetermined reasons. Contributing to the accident was the failure of the Federal Aviation Administration to exercise its oversight responsibility over flight operations in the Grand Canyon airspace and the actions of the National Park Service to influence the selection of routes by Grand Canyon scenic air tour operators. Also contributing to the accident was the modification and configuration of the routes of the rotary-wing operators resulting in their intersecting with the routes of Grand Canyon Airlines near Crystal Rapids."}