{"url": "https://www.baaa-acro.com/crash/crash-vickers-745d-viscount-chase-31-killed", "date": "May 12, 1959 at 1613 LT", "type": "Vickers Viscount", "operator": "Capital-Airlines3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "New York – Atlanta", "msn": "287", "yom": 1957, "flight_number": "CA075", "city": "Chase", "zone": "Maryland", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 27, "pax_fatalities": 27, "other_fatalities": 0, "total_fatalities": 31, "captain_hours": 22260, "captain_hours_type": 1945, "copilot_hours": 4073, "copilot_hours_type": 2033, "aircraft_hours": 4180, "circumstances": "Flight 75 taxied away from the terminal at 1520, 20 minutes late. The last-minute delay occurred when Captain Paddack found an error in the aircraft gross weight computation and questioned the weight for the existing runway restriction. At 1455 the flight radioed for runway temperature. The senior operations agent came aboard and he and the captain rechecked the computations to make sure the weight was correct and below maximum allowable for the runway length, the existing surface wind, and temperature. The problem was satisfied and it was determined that the gross weight was 60,507 pounds, 103 pounds less than the maximum allowable of 60,610 pounds. During taxi Flight 75 was issued an instrument clearance according to an instrument flight rules flight plan filed earlier. At 1529 a no takeoff from runway 22 was observed. Executing the clearance, Flight 75 made numerous radio communications in the New York area and proceeded uneventfully to its assigned cruising altitude. 14,000 feet, and onto the assigned airway Victor 3. Regular position reports were made as the flight progressed. At 1602 Flight 75 contacted the Washington Center. It reported that it was over Westchester on the hour, 1600, at 14,000, estimating Westminster at 1617, with Herndon next. In the same message it advised, \". . . ah, we've got a pretty good string of thunderstorms along that course . . . ah, if we could stay in the clear and stay a little bit south of Westminster, is that O. K. with you?\" The center controller replied \"Capital 75, that'll be all right and report passing Westminster.\" The flight acknowledged. At 1610 the flight advised, \"Ah, Washington Center, this is Capital 75, we've reduced to one seven zero knots account rough air.\" This was the last message from the flight on the center recorders and the last which could be determined as having been made. The aircraft entered a near vertical dive, partially disintegrated at an altitude between 3,000 and 7,000 feet and eventually crash in Chase, two miles northeast of Martin Airport. The aircraft was totally destroyed and all 31 occupants were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was a loss of control of the aircraft in extreme turbulence resulting in an involuntary steep descent following which aerodynamic loads from high airspeed, recovery, and turbulence exceeded the design strength of the aircraft."}