{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-mt-aberdare-10-killed", "date": "Jun 5, 2018 at 1702 LT", "type": "Cessna 208B Grand Caravan", "operator": "Fly-SAX", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Kitale – Nairobi", "msn": "208B-0525", "yom": 1996, "flight_number": "EXZ102", "city": "Mt Aberdare", "zone": "Central", "country": "Kenya", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 2352, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took-off from Kitale Airstrip (HKKT) at 16.05 hours and set course to Jomo Kenyatta International Airport (HKJK) after climbing to FL 110 with ten onboard. Once established, there were slight peripheral variations in groundspeed and track. The aircraft Flight Level was sustained at 110 with some occasional deviations. Aircraft height above ground level (AGL) varied between 1,102 feet and 4,187 feet. One minute before its impact with the cliff, the aircraft was at 11,100 feet or 3,000 feet AGL, 159 knots ground speed, and tracking radial 338 NV. Immediately before radar signal was lost, the elevation of the highest ground level was 12,876 feet, the aircraft altitude was 11,200 feet, the ground speed was 156 knots, and track was radial 339 NV. Information retrieved from the Radar transcript recorded various parameters of the aircraft from 1605hrs up to 1702hrs, the time radar signal was lost. This information was consistent with information extracted from the on-board equipment the ST3400 and the aera GPS. The radar system transmits information including aircraft position in relation to NV VOR, Flight Level or altitude, ground speed, vertical speed and heading. Information retrieved from the GPS captured the last recorded time, date and location as 14:00:52, on 06/05/2018 and elevation 3,555.57 metres. The aircraft impacted the bamboo-covered terrain at an elevation of 3,645 metres at 0.36’56’’S 36 42’44’’ where the wreckage was sited. The aircraft was totally destroyed by impact forces and all 10 occupants were killed. ", "probable_cause": "The flight crew's inadequate flight planning and the decision to fly instrument flight rules (IFR) at an altitude below the published Minimum Sector Altitude in the Standard Instrument Arrival Chart under instrument meteorological conditions (IMC), and their failure to perform an immediate escape maneuver following TAWS alert, which resulted in controlled flight into terrain (CFIT).\r\nContributing Factors:\r\n1. Contributing to the accident were the operator's inadequate crew resource management (CRM) training, inadequate procedures for operational control and flight release.\r\n2. Also contributing to the accident was the Kenya Civil Aviation Authority's failure to hold the operator accountable for correcting known operational deficiencies and ensuring compliance with its operational control procedures.\r\n3. There was no requirement for crew to be trained in CFIT avoidance ground training tailored to the company’s operations that need to address current CFIT-avoidance technologies.\r\n4. Use of non-documented procedure and Clearance by the ATC to fly below the published minimum sector altitude.\r\n5. Lack of situational awareness by the radar safety controller while monitoring flights within the radar service section."}