{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-52h-stratofortress-fairchild-afb-4-killed", "date": "Jun 24, 1994 at 1416 LT", "type": "Boeing B-52 Stratofortress", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Fairchild AFB - Fairchild AFB", "msn": "464453", "yom": 1960, "flight_number": "Czar 52", "city": "Fairchild AFB (Spokane)", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "In preparation for the 1994 Fairchild Airshow, the Pilot Lt Col Arthur A. \"Bud\" Holland was again selected as the command pilot for the B-52 demonstration flight. On 15 June 1994, Holland briefed the new wing commander, Colonel William Brooks, on the proposed flight plan. Holland's demonstration profile violated numerous regulations, including steep bank angles, low-altitude passes, and steep pitch attitudes. Brooks ordered Holland not to exceed 45° bank angle or 25° pitch attitude during the demonstration. During the first practice session, on 17 June, Holland repeatedly violated these orders. Brooks witnessed this, but took no action. Pellerin flew with Holland on that flight and reported to Brooks that, \"the profile looks good to him; looks very safe, well within parameters.\" The next practice flight on 24 June ended with the fatal crash. The demonstration profile designed by Holland included a 360° turn around Fairchild's control tower, a maneuver which he had not attempted in previous air show demonstrations. During the final flight, Holland performed a series of 60° bank turns and a 68° pitch climb in violation of Brooks' orders. There is no evidence to suggest that either McGeehan or Wolff attempted to intervene as Holland carried out these dangerous maneuvers. Pellerin was originally scheduled to fly in this mission, as he had done on the 17 June flight, but he was unavailable for the 24 June flight and Wolff was selected as the replacement aircrew member. Due to the short notice of his assignment to the mission, Wolff did not participate in the pre-flight briefing and boarded the aircraft after the engines were started. He was therefore unaware of the planned mission profile and had no opportunity to raise any objections before take-off. All of the four aircrew involved in the crash had only limited flying time in the months before the crash. It would appear that none of them had noticed that the aircraft had stalled until shortly before impact, as indicated by a failure to apply standard recovery techniques to the aircraft once it entered the stall. The investigation reported that even if the proper stall recovery techniques had been applied, it was unlikely that the accident could have been prevented as the aircraft was already flying too low to be recovered. \r\nCrew:\r\nLt Col Arthur A. \"Bud\" Holland, pilot,\r\nLt Col Mark C. McGeehan, copilot,\r\nCol Robert E. Wolff, observer,\r\nLt Col Kenneth \"Ken\" Huston, operations officer. ", "probable_cause": "The accident investigation concluded that the crash was primarily attributable to Holland's personality and behavior, USAF leaders' inadequate reactions to the previous incidents involving Holland, and the sequence of events and aircrew response during the final flight of the aircraft. Holland's disregard for procedures governing the safe operation of the B-52 aircraft that he commanded and the absence of firm and consistent corrective action by his superior officers allowed Holland to believe that he could conduct his flight in an unsafe manner, culminating with the slow, steeply banked, 360° turn around the control tower. The other environmental factors involved, including the addition of a new maneuver (the 360° turn around the tower), inadequate pre-flight involvement of Wolff, and the distractions from the base shooting four days prior, combined with Holland's unsafe and risk-taking piloting behavior to produce conditions favorable for the crash to occur. The final factor, according to the USAF investigation report, was the 10-knot (19 km/h) wind and its effect on the maneuvers required to achieve the intended flightpath in relation to the ground."}