{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-e20-near-tegucigalpa-14-killed", "date": "Feb 14, 2011 at 0802 LT", "type": "Let L-410", "operator": "Central%20American%20Airways", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "San Pedro Sula - Tegucigalpa", "msn": "91 26 03", "yom": 1991, "flight_number": "CAA731", "city": "Tegucigalpa", "zone": "Francisco Morazán", "country": "Honduras", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 15300, "captain_hours_type": null, "copilot_hours": 4810, "copilot_hours_type": null, "aircraft_hours": 5153, "circumstances": "The twin engine aircraft departed San Pedro Sula-Ramon Villeda Morales Airport at 0704LT on a 40-minute flight to Tegucigalpa, carrying 12 passengers and two pilots. After being cleared to descend to 9,000 feet for an approach to runway 20, the crew informed ATC he was initiating a go-around procedure for unknown reasons. Few minutes later, the aircraft was cleared for an approach to runway 02. On approach in marginal weather conditions in a full flaps down configuration, the aircraft stalled and crashed in a wooded area located 12 km from the airport. The aircraft was totally destroyed by impact forces and all 14 occupants were killed. ", "probable_cause": "The following findings were identified:\r\n1) Weather conditions existing at the time of the event, during the approach to the runway the aircraft was operated slightly above the stall speed and a major change in wind speed could cause a stall. The altitude at which the windshear occurred, and the reaction time of the pilot and the responsiveness of the aircraft determined whether the descent could be arrested in time to avoid an accident.\r\n2) No published descent procedures were performed, possibly misinterpretation of Flight Instruments (altimeter, airspeed indicator).\r\n3) During the descent to the VOR/DME for runway 20 and 02, the pilot in command (PIC) did not check his approach chart, and did not continually consult the first officer on the altitude and course.\r\n4) There was no adequate communication between crew; deficient CRM (No approach briefing was made for any of the two approaches).\r\n5) The aircraft was configured for landing with flaps fully down (flap 42) at a very long distance from the track without having it in sight. It is noteworthy that the aircraft will not respond to an adverse condition windshear as it appeared at that time with such a configuration. It should be noted that in both approaches it is mandatory to perform a 'circling' procedure."}