{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-32-near-nuevo-berlin-74-killed", "date": "Oct 10, 1997 at 2210 LT", "type": "Douglas DC-9", "operator": "Austral-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Posadas - Buenos Aires", "msn": "47446", "yom": 1969, "flight_number": "AU2553", "city": "Nuevo Berlin", "zone": "Río Negro", "country": "Uruguay", "region": "South America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 69, "pax_fatalities": 69, "other_fatalities": 0, "total_fatalities": 74, "captain_hours": 9238, "captain_hours_type": 177, "copilot_hours": 2910, "copilot_hours_type": 1384, "aircraft_hours": 56854, "circumstances": "The aircraft departed Posadas-Libertador General José de San Martín Airport at 2118LT on a regular scheduled flight to Buenos Aires, carrying 69 passengers and five crew members. While cruising at an altitude of 35,000 feet, weather conditions deteriorated with cumulonimbus reported till 49,000 feet, stormy weather, icing conditions and severe turbulences with winds up to 80 km/h and an OAT of -59° C. The crew modified his route and entered the Montevideo FIR without contacting Montevideo ATC. At 2204LT, the aircraft entered an area with severe icing conditions and three minutes later, the copilot (pilot-in-command) initiated a descent without prior permission. Meanwhile, the captain contacted Ezeiza Control, requesting permission to descend. Ezeiza Control radioed that the flight was over Uruguay territory and that they needed to contact Montevideo Control for permission. At 2209:17, Montevideo ATC cleared the crew to descend to FL257, an altitude reached at 2210:25. During the descent the first officer complained that his airspeed indicator did not seem to be working correctly. Descending through FL300, the first officer extended the slats. The pilots were trained to extend slats when recovering from approach to stall situations at 10,000 - 12,000 feet. However, the actual airspeed at the time of extension was higher than permitted. This exceeded the design limit, causing an asymmetry. The aircraft entered an uncontrolled descent and crashed in a near vertical attitude in an open field located about 21 km east of Nuevo Berlin. The aircraft disintegrated on impact and all 74 occupants were killed. At the point of impact, a cratere of 10 metres deep by 30 metres wide was found. The accident was not survivable. It was reported that that the airspeed suddenly increased from 200 knots to 450 knots in four seconds, probably after the Pitot tubes got iced. ", "probable_cause": "The immediate cause of the accident was likely that at an altitude of 30,000 feet, the first officer, who was the pilot-in-command, found himself in flight conditions which induced him to extend the slats. This manoeuvre was completed at a speed much higher than the limit of the structural design of the slats, and their extension caused an asymmetry and a subsequent loss of control from which a recovery was not possible. The copilot's interpretation as to the need to extend the slats would have been a result of erroneous indications of low speed (IAS), caused by blockage of the Pitot tubes which resulted from icing conditions while cruising in clouds with an extreme OAT of -59° C. It was not possible to determine if the obstruction was caused by the crew by not activating the heating system via the selector switch, or failure of that system.\r\nThe following contributing factors were identified:\r\na) No indication of Mach number on the speed indicators installed in the accident aircraft within its flight envelope, with air speeds below 250 KIAS.\r\nb) Lack of crew training in flight instrument failures and upset recovery.\r\nc) Lack of crew training in the recovery of approach to stall in the DC-9 aircraft in \"clean configuration\" in accordance with the procedures specified in the FCOM, section 5, 10-0-0, code 30.\r\nd) Lack of instruction and pilot training in crew resource management (CRM).\r\ne) Absence of a warning light Pitot/Stall-Heater OFF on the annunciator panel.\r\nf) Deficiency in operational procedures."}