{"url": "https://www.baaa-acro.com/crash/crash-antonov-8-near-sosenky-5-killed", "date": "Sep 27, 1988 at 1922 LT", "type": "Antonov AN-8", "operator": "Minaviaprom", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Moscow - Lviv - Baku", "msn": "0G3490", "yom": 1960, "flight_number": "92055", "city": "Sosensky", "zone": "Kaluga oblast", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12272, "circumstances": "The aircraft departed Moscow-Domodedovo at 1838LT on a cargo flight to Baku with an intermediate stop in Lviv, carrying five crew members and a load of various goods for a total weight of 400 kilos, among them metallic hoses. Nine minutes after takeoff, while climbing to a height of about 3,600 meters, the crew noticed discrepancies in the fuel system which resulted in a slight reduction of the fuel pressure in the fuel supply line connected to the left engine. The left part of the aircraft was visually inspected and as nothing abnormal was noted, the crew decided to continue the flight. 18 minutes later, while approaching the altitude of 7,200 meters, the crew noticed an important increase in the fuel consumption while the fuel supply system pressure dropped. An analysis of the system made it possible to detect a leak and as the crew was attempting to shut down the left engine, a fire started in the bottom of the left engine nacelle. At 1914LT, the captain informed ATC about the failure of the left engine and was cleared to return to Domodedovo Airport. Less than two minutes later, the captain reported to ATC that the left engine was on fire and requested to be vectored to the nearest airport. At that time, the nearest airport was Tula-Klokovo located 140 km from his position. Few minutes later, the left engine, engulfed by flames, detached and fell away. As the captain realized it would not be possible to reach Tula Airport, he continued the descent with a rate of descent of 100 meters per second in an attempt to land in an open field. The aircraft entered clouds and at a height of 300 meters, the pilot-in-command suffered a spatial disorientation. The aircraft nosed down by an angle of 80° and crashed at a speed of 612 km/h in a wooded area located 3,5 km northeast of Sosensky. The aircraft disintegrated on impact and all five occupants were killed. ", "probable_cause": "The left engine caught fire and detached after a fuel line broke in flight, causing the fuel to leak in the engine nacelle and to ignite while in contact with high temperature parts. The following contributing factors were reported: \r\n- Failure of the crew to identify the fuel leak in time,\r\n- Failure of the crew to abort the flight and to return to the departure airport in time, \r\n- Failure of the crew to shut off the fuel supply system in time, which contributed to the fire development, \r\n- Failure of the crew to follow the emergency procedures, \r\n- Loss of control after the pilot-in-command suffered a spatial disorientation. \n"}