{"url": "https://www.baaa-acro.com/crash/crash-cessna-401a-houston", "date": "Jun 20, 2005 at 1826 LT", "type": "Cessna 401", "operator": "Amigo%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Corpus Christi – Houston", "msn": "401A-0110", "yom": 1969, "flight_number": null, "city": "Houston-William P. Hobby", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1608, "captain_hours_type": 92, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The 1,608-hour commercial pilot departed on a scheduled cargo flight. Prior to departure, he performed a preflight inspection and visually verified all five fuel tanks were full. The flight took approximately 1 hour for the 162 nautical mile cross-country flight. Prior to his return flight, he again checked the fuel and oil. He noted that, he had 3 hours of fuel on board. About 15 minutes after departure, the pilot switched to the auxiliary tanks. The pilot stated, \"after 10-15 minutes on taking fuel from the auxiliary tanks, I switched to the right locker tank.\" Shortly thereafter, air traffic control instructed him to start a descent, and he selected the main fuel tanks. During the approach, the right engine began to \"sputter\". As the pilot was going through the engine failure checklist, the left engine \"started sputtering.\" The pilot switched the auxiliary fuel pumps to high; then changed from the main tanks to the auxiliary fuel tanks. The airplane landed short of runway 12R. Inspection of the aircraft revealed, both auxiliary fuel tanks were \"dry\", the right main fuel tank contained approximately 3-inches of fuel, and the left main tank was \"dry\", but had been breached during the landing. The right wing locker fuel tank was full of fuel, and the transfer switch was in the off position. The left fuel selector was found in the left auxiliary position and the right fuel selector was found in the right auxiliary position. The main fuel line on the right engine had no fuel in it, and the line to the fuel manifold valve was empty as well. The left main fuel line had a \"couple teaspoons\" of fuel in it, and the fuel line to the left fuel manifold valve was absent of fuel.", "probable_cause": "The loss of engine power to both engines due to fuel starvation as a result of the pilot's improper fuel management. A contributing factor was the lack of suitable terrain for the forced landing."}