{"url": "https://www.baaa-acro.com/crash/crash-antonovv-26b-tallinn", "date": "Aug 25, 2010 at 1747 LT", "type": "Antonov AN-26", "operator": "Exin", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "EXN3788", "msn": "119 03", "yom": 1982, "flight_number": "Tallinn - Helsinki", "city": "Tallinn-Lennart Meri-Ülemiste", "zone": "Harjumaa", "country": "Estonia", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5569, "captain_hours_type": 4432, "copilot_hours": 738, "copilot_hours_type": 485, "aircraft_hours": 21510, "circumstances": "On 25th August 2010 cargo aircraft An-26B, registration SP-FDP started from Tallinn-Lennart Meri-Ülemiste Airport to Helsinki. After uneventful flight preparations, the aircraft started its take-off roll on runway 08. Based on pilots statements and FDR/CVR recordings the aircraft entered runway 08 from taxiway B on the West end of the runway and lined up for takeoff. On 16:47:22 the aircraft started its takeoff roll. The calculated V1 was 182 and Vr was 201 km/h. 10 seconds later PF started rotation without Vr callout at 123 km/h. The aircraft pitch angle increased to 4.6˚ 2 seconds later. At 16:47:38 the navigator made V1 call-out at 160.5 km/h. 1 second later flight engineer called “Retracting” in Polish. The aircraft started to pitch down and 3 seconds later it contacted the runway and continued on its belly for 1,228 m before coming to its rest position 3 m right from the runway centerline. No persons were injured and no fire broke up. The occurrence was classified as an accident due to the substantial damage to the aircraft structures. ", "probable_cause": "The investigation determined the inadequate action of the flight engineer, consisting in early and uncommanded landing gear retraction, as a cause of the accident.\r\nContributing factors to the accident were:\r\n1. Inadequate crew recourse management and insufficient experience in cooperation and coordination between crewmembers.\r\n2. Start of aircraft rotation at low speed and with fast elevator movement to 17˚, which resulted in:\r\nLifting the aircraft sufficiently to close the WOW switch and allow the retraction of the landing gear at the speed not sufficient for the climb.\r\nProviding misleading information to FE about the aerodynamic status of the aircraft.\r\n3. Inadequate adjustment of the WOW switch, which allowed the gear retraction to be activated before the aircraft was airborne. The position of the landing gear selector on the central console is not considered as a contributing factor to the accident. However, investigation finds necessary to point it out as a safety concern, specifically in situations, where crewmembers are trained and/or used to operate the aircrafts with gear selector location according to the EASA Certification Standards CS-25. Positioning of the gear lever to the location which is compliant to EASA document CS-25, would create additional safety barrier to avoid similar occurrences, specifically in aircrafts where landing gear is operated by FE."}