{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-70-queen-air-leonora", "date": "Jun 24, 2000 at 1740 LT", "type": "Beechcraft 70 Queen Air", "operator": "Alligator Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Leonora – Laverton", "msn": "LB-29", "yom": 1970, "flight_number": null, "city": "Leonora", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Beechcraft Queen Air and Rockwell Aero Commander were being used by a company to conduct private category passenger-carrying flights to transport its workers from Leonora to Laverton in Western Australia. The Aero Commander had departed and was established in the Leonora circuit area when the Queen Air took off. The pilot and one of the passengers of the Queen Air reported the take-off roll appeared normal until the aircraft crossed the runway intersection, when they felt a bump in the aircraft. The pilot reported hearing a loud bang and noticed that the inboard cowl of the right engine had opened. He also reported that he believed he had insufficient runway remaining to stop safely, so he continued the takeoff. The cowl separated from the aircraft at the time, or just after the pilot rotated the aircraft to the take-off attitude. He reported that although the aircraft had left the ground after the rotation, it then would not climb. The aircraft remained at almost treetop level until the pilot and front-seat passenger noticed the side of a tailings dump immediately in front of the aircraft. The pilot said that he pulled the control column fully back. The aircraft hit the hillside parallel to the slope of the embankment, with little forward speed. The impact destroyed the aircraft. Although the occupants sustained serious injuries, they evacuated the aircraft without external assistance. There was no post-impact fire. The aircraft-mounted emergency locator transmitter (ELT) did not activate.", "probable_cause": "The examination of the Queen Air wreckage found no mechanical fault that may have contributed to the accident sequence other than the inboard cowl of the right engine detaching during the takeoff. The cowl latching mechanisms appeared to have been capable of operating normally. The two top hinges failing in overload associated with the lack of cowl latch damage suggested that the cowl was probably improperly secured before takeoff. The cowl appeared to have subsequently opened when it experienced the jolt when the aircraft crossed the runway intersection. The lack of any further cowl damage indicated that it detached cleanly and consequently its dislodgment should not have adversely affected the flying qualities of the aircraft. "}