{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-134a-kuybyshev-70-killed", "date": "Oct 20, 1986 at 1550 LT", "type": "Tupolev TU-134", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sverdlovsk – Kuybyshev – Grozny", "msn": "62327", "yom": 1979, "flight_number": "SU6502", "city": "Kuybyshev", "zone": "Samara oblast", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 4, "pax_on_board": 87, "pax_fatalities": 66, "other_fatalities": 0, "total_fatalities": 70, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16154, "circumstances": "Following an uneventful flight from Sverdlovsk-Koltsovo Airport, the crew started the approach to Kuybyshev-Kurumoch Airport. For training purposes, the captain decided to attempt a 'blind' approach and closed the window blinds on his side, which was prohibited in such conditions. At decision height, he decided to continue and failed to realize the configuration was wrong. The aircraft passed over the runway 15 threshold and one second prior to impact, the flight engineer opened the window blinds but this was too late. At a speed of 280 km/h and with a rate of descent of 5 meters per second, the aircraft struck the runway surface with a positive acceleration of 4,8 g. This caused the left wing to be partially torn off. Out of control, the aircraft continued for about 214 meters then came to rest upside down, bursting into flames. 64 occupants were killed while 30 others were injured, some seriously. Within few hours, six of the survivors died from their injuries. ", "probable_cause": "Decision of the captain to attempt a 'blind' approach in violation of the published procedures. He also decided to continue the approach after he passed the decision height and failed to initiate a go-around maneuver. There was no reaction or any correction from the rest of the flying crew. "}