{"url": "https://www.baaa-acro.com/crash/crash-cessna-404-titan-ii-englewood-1-killed", "date": "Dec 30, 2014 at 0429 LT", "type": "Cessna 404 Titan", "operator": "Key%20Lime%20Air-2", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Denver - Denver", "msn": "404-0813", "yom": 1981, "flight_number": "LYM182", "city": "Denver-Centennial", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2566, "captain_hours_type": 624, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16681, "circumstances": "The pilot was conducting an early morning repositioning flight of the cargo airplane. Shortly after takeoff, the pilot reported to air traffic control that he had “lost an engine” and would return to the airport. Several witnesses reported that the engines were running rough and one witness reported that he did not hear any engine sounds just before the impact. The airplane impacted trees, a wooden enclosure, a chain-linked fence, and shrubs in a residential area and was damaged by the impact and postimpact fire. The airplane had been parked outside for 5 days before the accident flight and had been plugged in to engine heaters the night before the flight. It was dark and snowing lightly at the time of the accident. The operator reported that no deicing services were provided before the flight and that the pilot mechanically removed all of the snow and ice accumulation. The wreckage and witness statements were consistent with the airplane being in a right-winglow descent but the airplane did not appear to be out of control. Neither of the propellers were at or near the feathered position. The emergency procedures published by the manufacturer for a loss of engine power stated that pilots should first secure the engine and feather the propeller following a loss of engine power and then turn the fuel selector for that engine to “off.” The procedures also cautioned that continued flight might not be possible if the propeller was not feathered. The right fuel selector valve and panel were found in the off position. Investigators were not able to determine why an experienced pilot did not follow the emergency procedures and immediately secure the engine following the loss of engine power. It is not known how much snow and ice had accumulated on the airplane leading up to the accident flight or if the pilot was successful in removing all of the snow and ice with only mechanical means. The on-scene examination of the wreckage and the teardown of both engines did not reveal any preimpact mechanical malfunctions or failures. While possible, it could not be determined if water or ice ingestion lead to the loss of engine power at takeoff.", "probable_cause": "The loss of power to the right engine for reasons that could not be determined during postaccident examination and teardown and the pilot’s failure to properly configure the\r\nairplane for single-engine flight."}