{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-62f-singapore", "date": "Dec 13, 2002 at 1743 LT", "type": "Douglas DC-8", "operator": "Arrow%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yokota - Singapore", "msn": "45896/303", "yom": 1967, "flight_number": null, "city": "Singapore-Changi", "zone": "Singapore", "country": "Singapore", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11800, "captain_hours_type": 7200, "copilot_hours": 6200, "copilot_hours_type": 1900, "aircraft_hours": 73500, "circumstances": "The crew started their duty for the flight from Yokota, near Tokyo, Japan to Singapore at 1000 hours local time (0900 hours Singapore time) on 13 December 2002. The aircraft departed Yokota at 1125 hours local time (1025 hours Singapore time). The FO was the handling pilot for the flight. The expected flight time was about 7 hours. The departure and en route segments of the flight proceeded normally. The crew was aware of Changi Airport’s ATIS ‘Y’ weather information provided at about 1640 hours through Changi Airport’s there were thunderstorm activity, low level windshear and heavy rain in Singapore. The aircraft was given clearance to land on Runway 20R. The FO briefed the other crew members on landing on 20R. At about 7 miles from the airport, Changi Tower advised the aircraft that the wind was from 350 degrees at 5 knots, that the runway surface was wet, that the visibility from the Tower was about 1,000 metres and that landing traffic had reported the braking action at the end of Runway 20R to be from medium to poor. The approach and landing was carried out in heavy rain. The approach was stabilized and normal. Approach speed was about 148 knots. Flaps 35 were used. At about 300 feet above ground, the PIC reported having the approach lights and runway lights in sight while the FO still could not see the lights as the rain removal for the windshield on the FO’s side was not effective. According to the FO, he felt the PIC was putting his hands on the controls of the aircraft. The PIC noticed that the aircraft had drifted slightly left of the runway centreline and told the FO to make the correction back to the centerline. Although the FO made the correction, he was still unable to see the approach lights clearly at about 200 feet. The FO indicated he felt the PIC was in control of the aircraft and making corrections and so he let go of the controls. The CVR recording suggested that the PIC was aware the aircraft was floating down the runway and that the PIC informed the crew that “We are floating way down the runway.” The PIC subsequently moved the control column forward to make a positive landing. The aircraft landed at 1743 hours. The aircraft was observed by an air traffic controller to have touched down on the runway at a point roughly abeam the Control Tower and just before the turn-off for Taxiway W6, which was about 1,500 metres from the end of the runway. Two Airport Emergency Service officers of the Civil Aviation Authority of Singapore also observed that while most aircraft landing on Runway 20R would touch down at a point between the turn-offs for Taxiways W3 and W4, the Arrow Air aircraft floated way beyond the normal touchdown zone. The aircraft’s speed at the time of touchdown was estimated from flight data recorder data to be about 135 knots. Upon touchdown, the PIC deployed spoilers and thrust reversers. The thrust reversers for Engines Nos. 1, 2 and 3 deployed almost immediately while that of Engine No. 4 was reportedly slow in deployment. The PIC and FO also pushed hard on the brake pedals, but they felt that there was no braking response. The aircraft did not stop before reaching the end of the runway. It veered slightly to the right as it exited the runway. The speed of the aircraft when it left the runway was about 60 knots. The aircraft rolled in mud during the overrun. The nose landing gear broke off half way during the overrun and the aircraft came to rest in a grass and soggy area at about 300 metres from the end of the runway. There was no fire. After the aircraft had come to a complete stop, the PIC stowed the thrust reversers. The crew completed the evacuation checklist and exited the aircraft from Door L1 with the assistance of the Airport Emergency Service personnel who had already arrived by then. ", "probable_cause": "The following significant factors were identified:\r\n- The FO, the pilot flying the approach and landing, did not elect to go around even though he did not have the runway lights and approach lights in sight at 300 feet above ground.\r\n- The PIC could have taken over control from the FO when the latter still could not see the approach lights and runway lights at 300 feet above ground.\r\n- The crew landed long by about 1,300 metres on the runway. \r\n- The crew had not made a determination of the landing distance required for the landing on Runway 20R. They had just verified using the Runway Analysis Manual that the aircraft landing weight was within limit for the landing. "}