{"url": "https://www.baaa-acro.com/crash/crash-canadair-regionaljet-crj-100er-toronto", "date": "May 20, 2007 at 1235 LT", "type": "Canadair RegionalJet CRJ-100", "operator": "Air%20Canada%20Jazz", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moncton – Toronto", "msn": "7051", "yom": 1994, "flight_number": "AC8911", "city": "Toronto-Lester Bowles Pearson", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 37, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft, with 3 crew members and 37 passengers on board, was operating as Air Canada Jazz Flight 8911 from Moncton, New Brunswick, to Toronto/Lester B. Pearson International Airport, Ontario. At 1235 eastern daylight time, the aircraft landed on Runway 06R with a 90º crosswind from the left, gusting from 13 to 23 knots. The aircraft first contacted the runway in a left-wing-down sideslip. The left main landing gear struck the runway first and the aircraft sustained a sharp lateral side load before bouncing. Once airborne again, the flight and ground spoilers deployed and the aircraft landed hard. Both main landing gear trunnion fittings failed and the landing gear collapsed. The aircraft remained upright, supported by the landing gear struts and wheels. The aircraft slid down the runway and exited via a taxiway, where the passengers deplaned. There was no fire. There were no injuries to the crew; some passengers reported minor injuries as a result of the hard landing. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. On final approach, the captain diverted his attention from monitoring the flight, leaving most of the decision making and control of the aircraft to the first officer, who was significantly less experienced on the aircraft type. As a result, the first officer was not fully supervised during the late stages of the approach.\r\n2. The first officer did not adhere to the Air Canada Jazz standard operating procedures (SOPs) in the handling of the autopilot and thrust levers on short final, which left the aircraft highly susceptible to a bounce, and without the bounce protection normally provided by the ground lift dump (GLD) system. \r\n3. Neither the aircraft operating manual nor the training that both pilots had received mentioned the importance of conducting a balked or rejected landing when the aircraft bounces. Given the low-energy state of the aircraft at the time of the bounce, the first officer attempted to salvage the landing.\r\n4. When the thrust levers were reduced to idle after the bounce, the GLD system activated. The resultant sink rate after the GLD system deployed was beyond the certification standard for the landing gear and resulted in the landing gear trunnion fitting failures.\r\n5. There was insufficient quality control at the landing gear overhaul facility, which allowed non-airworthy equipment to enter into service. The condition of the shock struts would have contributed to the bounce.\r\nFindings as to Risk:\r\n1. Several passengers took carry-on items with them as they exited the aircraft, despite being instructed not to do so.\r\n2. The location of the stored megaphone did not allow the flight attendant to have ready access after the passengers started moving to the exit door. "}