{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-28-weston-green", "date": "Aug 28, 1993 at 1620 LT", "type": "PZL-Mielec AN-28", "operator": "Hungarian Aeronautical Association - Magyar Repülő Szövetség", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Weston-on-the-Green - Weston-on-the-Green", "msn": "1AJ005-11", "yom": 1988, "flight_number": null, "city": "Weston-on-the-Green", "zone": "Oxfordshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 17, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9400, "captain_hours_type": 1200, "copilot_hours": 2310, "copilot_hours_type": 510, "aircraft_hours": 1616, "circumstances": "The twin engine aircraft was engaged in a local skydiving mission, carrying 17 skydivers and two pilots. After takeoff, while climbing, both engines simultaneously suffered a total power loss. The commander reported that the simultaneous failure did not induce any yaw and that the only two warning lights which illuminated in the cockpit were those indicative of double engine failure. Following the power loss, the aircraft's speed decayed rapidly leading the commander to suspect that the automatic outboard wing spoilers had also deployed. Realising that a forced landing was the only option available to him, he initiated a steep descent to maintain airspeed and a turn through 90° to the right to position the aircraft for a forced landing in a large field of corn stubble. The aircraft landed heavily in a slightly nose up attitude, banked slightly to the right, at an estimated speed of 170 km/h (92 knots) and slid to rest with substantial damage to the fuselage, landing gear, wing struts, propellers and wings. All 19 occupants evacuated the cabin and were uninjured. ", "probable_cause": "The following findings were reported:\r\n- A latent defect in the electrical system caused a simultaneous total power loss as the flaps were retracted at 500 feet agl on climb out, with automatic operation of both asymmetric spoiler systems.\r\n- The latent defect had been caused by progressive loosening of a single earthing screw, which provided a common earth point for the flap electric signalling and propeller auto feathering systems. This induced a high resistance to earth at this point and caused feathering of both propellers when flap retraction was selected, in addition to automatic closure of both engine fuel shut-off valves (within the fuel control units) and extension of both outboard spoilers.\r\n- At manufacture in Poland a single earthing point had been installed which was not in accordance with the design requirements for this aircraft type as issued by the Antonov Design Bureau, which had required dual combined earthing terminals for the flap signalling and propeller auto feathering systems.\r\n- The Antonov Design Bureau had never cleared this type of aircraft for flight with the aft clam-shell doors removed, or for parachute training.\r\n- This aircraft had been incorrectly granted an Aerial Work Permit for parachuting operations in the UK by the Department of Transport, assisted by the CAA, as a result of implicit reliance upon submitted documentation which was subsequently proven invalid."}