{"url": "https://www.baaa-acro.com/crash/crash-short-sc7-skyvan-3-variant-200-washington-dc-2-killed", "date": "Jul 2, 1970 at 1048 LT", "type": "Short SC.7 Skyvan Variant", "operator": "Jetco Aviation International", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "New York-JFK - Washington DC", "msn": "1858", "yom": 1969, "flight_number": "JTC106", "city": "Washington-National", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 10272, "captain_hours_type": 108, "copilot_hours": 860, "copilot_hours_type": 7, "aircraft_hours": 701, "circumstances": "At approximately 10:48 a.m. eastern daylight time on July 2, 1970, Short Brothers & Harland, Ltd., Skyvan Series 3, N21CK, operated by Jetco Aviation, Inc., Washington, D. C., as air taxi cargo flight, Flight 106, crashed during an approach to Washington National Airport. The aircraft was demolished but did not burn. Both cremnembers received fatal injuries. There were no passengers. According to witnesses, the aircraft was first visible to them, through fog and haze, when it was 700 to 800 feet above and about one-half mile out from the threshold of Runway 15. Shortly after the aircraft came into view of the witnesses, it nosed down and rolled left until the wings were nearly vertical. The nose-down angle steepened progressively until it reached 45° or more. The aircraft struck the water of Roaches Run in this attitude, cartwheeled onto the right wingtip and sank in water 12 to 15 feet deep about 1,800 feet north of the threshold of Runway 15. Both pilots were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the loss of effective elevator control due to the forward shift of improperly secured cargo when the aircraft was placed in a steep nose-down attitude during a landing approach in reduced visibility conditions."}