{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-124c-globemaster-ii-charleston-3-killed", "date": "Oct 3, 1956 at 0721 LT", "type": "Douglas C-124 Globemaster II", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lajes – Hamilton – Charleston", "msn": "44328", "yom": 1953, "flight_number": null, "city": "Charleston-Intl", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 9, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Douglas C-124 transport plane departed Lajes AFB, Azores on a flight across the Atlantic Ocean to Bermuda-Kindley Field (NWU). The airplane remained on the ground at Bermuda for two hours. It took off again at 01:50 EST, bound for Charleston AFB, SC (CHS). Over the Azalea intersection the pilot checked and was advised that Charleston weather had deteriorated rapidly, presently 15,000 ft broken, visibility 1/4 mile with ground fog. The captain decided enter a holding pattern over Charleston to wait for the sun to burn off the fog. At approximately 06:30 visibility had slightly increased to 1/2 mile in ground fog. Five minutes later a Delta Air Lines flight landed following an ILS approach. The captain decided to carry out a GCA approach and was cleared for this at 06:35. The descent and final approach were normal until just prior to or reaching GCA minimums. At this time the aircraft got too low and clipped the tops of trees that stood about 68 feet above the ground. This caused a fast torque drop and subsequent loss of the no. 3 engine. The co-pilot then declared an emergency. The propeller of engine no.3 was feathered, the flaps were retracted, and an attempt as made to raise the landing gear. Indications were that the right main gear did not retract, and there was damage to the underside of the aircraft. Prior to the emergency the navigator had been asleep (the crew had been on duty for nearly 20 hours). Thus, he had not been monitoring the approach with radar. Also, he made no attempt to assist with dead reckoning, or in any other way to prevent the pilot from becoming lost. At 06:48, the crew became uncertain of their position. They flew for the next 33 minutes in the vicinity of Charleston AFB, at an altitude of only 800 to 1000 feet, because the aircraft would climb no higher even with max power. The aircraft was lost from GCA search radar, apparently due to the low altitude. The passenger and two crew members were killed while seven other occupants were injured. ", "probable_cause": "The primary cause of this accident was due to Operator Error in that the pilot descended below minimums in such a manner that the aircraft struck trees, and subsequently became doubtful of his position to the point of being lost due to failure to use all approach and navigational aids which further compounded his emergency. Although it is primarily the responsibility of the aircraft commander for the safe conduce of flight, it is also the duty and responsibility of the co-pilot to advise the pilot in sufficient time, prior to reaching minimums or a dangerous condition to allow him to check the rate of descent so as not to descend below minimums or hit the ground or obstructions. The pilot failed to adequately brief the flight crew for the type of approach to be made and missed approach procedures for that particular approach."}