{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-440-metropolitan-montevideo-1-killed", "date": "Sep 18, 1957 at 2120 LT", "type": "Convair CV-440 Metropolitan", "operator": "Real-Aerovias-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "São Paulo – Porto Alegre – Montevideo – Buenos Aires", "msn": "456", "yom": 1957, "flight_number": null, "city": "Montevideo-Carrasco", "zone": "Montevideo City District", "country": "Uruguay", "region": "South America", "crew_on_board": 5, "crew_fatalities": 1, "pax_on_board": 30, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a scheduled flight from Sao Paulo to Porto Alegre, Montevideo (Carrasco) and Buenos Aires . Thirty passengers and five crew were aboard. At Porto Alegre the aircraft was refuelled and took off at 1917 hours for Montevideo with 1 471 gallons on board. It passed over Treinta y Tres at 2039 hours, flying at 2 400 metres, IFR. Over Minas the aircraft was cleared to descent to 1 200 metres and was instructed by the control centre to call back when 50 km out from the aerodrome. The flight again contacted the control centre from that point. The aircraft was transferred to aerodrome control and overflew the CAR radio beacon at 2115 hours, at 600 metres, visual. It carried out a visual approach procedure as the runway lights were clearly visible throughout. However, it undershot and the port and nose wheels hit a small earth bank bordering highway 102. It is considered that the aircraft was correctly aligned with the runway, or was perhaps making a slight left turn in order to correct a small deviation. The starboard wing touched ground some 2 metres further on. Some 170 metres further on the aircraft lost both propellers and the starboard engine. The starboard wing broke off causing the entire fuselage to effect a turn of 180° on its longitudinal axis. At the same time, unequal friction against the ground caused the body of the fuselage to skid to the right, turn on its vertical axis and come to rest 380 metres from impact. The slope, though slight, contributed to the downward movement of the aircraft. The accident occurred between 2119 and 2121 hours. One crew member was killed.\n", "probable_cause": "From the evidence collected there is no doubt that the accident was due to pilot error. Nevertheless, the Commission found no actual proof of what caused this error. The possible factor of malfunction of flight material or ground aids and services has been ruled out. The pilot-in-command is unable to explain why the aircraft struck the ground when, according to his visual estimation and instrument reading, he should have had about 80 metres clearance. He was so certain of this that he was entirely convinced of having collided with another aircraft. From the only altimeter which was in a condition to be examined, it was seen that at least the copilot should have had a true reading of the distance from the ground. When the pilot last observed the instrument, it read 100 metres. At this very moment his visibility was reduced to nil, as he entered a small fog patch (below the correct track) and switched on his landing lights, thereby reducing or eliminating the possibility of direct visual reference. It should be pointed out that at the point where visibility cleared again before impact, the runway provided the pilot's only visual reference, as the entire area below was almost completely dark, apart from the fact that it was probably covered by a very thin layer of fog on the ground. "}