{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-nantucket", "date": "Sep 13, 2017 at 0723 LT", "type": "Cessna 402", "operator": "Theresa Madeline", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nantucket – Hyannis", "msn": "402B-1242", "yom": 1977, "flight_number": null, "city": "Nantucket", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1500, "captain_hours_type": 1100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4928, "circumstances": "The commercial pilot stated that, shortly after taking off for a cross-country, personal flight and while accelerating, he noticed high airplane nose-down control forces and that the airplane became increasingly difficult to control. He used manual trim to attempt to trim out the control forces and verified that the autopilot was not engaged; however, the nose-down tendency continued, and the pilot had trouble maintaining altitude. During the subsequent emergency landing, the airframe sustained substantial damage. Postaccident examination of the airplane revealed that the elevator trim push rod assembly was separated from the elevator trim tab actuator, and the end of the elevator trim push rod assembly was found wedged against the elevator's main spar. The elevator trim indicator in the cockpit was found in the nose-up stop position; however, the elevator trim tab was deflected 24° trailing edge up/airplane nose down (the maximum airplane nose-down setting is 6°). A drilled bolt was recovered from inside the right elevator; however, the associated washer, castellated nut, and cotter pin were not found. Examination of the bolt revealed that the threads were damaged and that the bolt hole on one of the clevis yoke halves exhibited deformation, consistent with the bolt separating. About 2 weeks before the accident, the pilot flew the airplane to a maintenance facility for an annual inspection. At that time, Airworthiness Directive (AD) 2016-07-24, which required installation of new hardware at both ends of the pushrod for the elevator trim tab, was overdue. While the airplane was in for the annual inspection, AD 2016-07-24 was superseded by AD 2016-17-08, which also required the installation of new hardware. The ADs were issued to prevent jamming of the elevator trim tab in a position outside the normal limits of travel due to the loss of the attachment hardware connecting the elevator trim tab actuator to the elevator trim tab push-pull rod, which could result in loss of airplane control. While in for the annual inspection, the airplane was stripped and painted, which would have required removal of the right elevator. Although the repair station personnel indicated that they did not disconnect the elevator trim pushrod from the elevator trim tab actuator when they painted the airplane, photographs taken of the airplane while it was undergoing inspection and painting revealed that the pushrod likely had been disconnected. The repair station owner reported that he reinstalled the right elevator and the elevator trim pushrod after the airplane was painted; however, he did not replace the hardware at either end of the pushrod as required by the ADs. Subsequently, the airplane was approved for return to service. After the annual inspection, no work, repairs, or adjustments were made to the elevator trim system. The airplane had accrued about 58 hours since the annual inspection at the time of the accident. Although reusing the self-locking nut might have resulted in it coming off by itself, the cotter pin should have prevented this from happening. Therefore, although the castellated self-locking nut, washer, and cotter pin normally used to secure the elevator trim pushrod at the elevator trim tab actuator were not found, given the evidence it is likely that the hardware, which was not the required hardware, was not properly secured at installation, which allowed it to separate in flight. It is also likely that the pushrod assembly then moved aft and jammed in a position well past the maximum nose-down trim setting, which rendered controlled flight impossible. ", "probable_cause": "The separation of the pushrod from the elevator trim tab actuator, which rendered controlled flight impossible. Contributing to the separation of the pushrod was the failure of maintenance personnel to properly secure it to the elevator trim tab actuator."}