{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-120rt-brasilia-pine-bluff", "date": "Apr 29, 1993 at 1555 LT", "type": "Embraer EMB-120 Brasília", "operator": "Continental%20Express", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Little Rock - Houston", "msn": "120-093", "yom": 1988, "flight_number": "CA2733", "city": "Pine Bluff", "zone": "Arkansas", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 27, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3600, "captain_hours_type": 2600, "copilot_hours": 3300, "copilot_hours_type": 700, "aircraft_hours": 10398, "circumstances": "In climb, captain (pic) increased pitch, when flight attendant (f/a) entered cockpit and suggested faster climb, so she could begin cabin service. Autoflight was set in pitch and heading modes, contrary to company policy. Pic and f/a had non- pertinent conversation for 4.5 min, while 1st officer (f/o) was making log entries. Airplane stalled in IMC at 17,400 feet. Initial recovery was at 6,700 feet after f/o lower gear, then due to improper recovery, 2nd stall occurred and recovery was at 5,500 feet. Left propeller shed 3 blades, left engine cowling separated, left engine was shut down in descent. Level flight could not be maintained and forced landing was made at closed airport. Pic overshot final turn due to controllability problems and landed fast with 1,880 feet of wet runway remaining. Airplane hydroplaned off runway and was further damaged. Crew got limited sleep during 3 day trip, though rest periods available. Freezing level near 11,500 feet, clouds tops to 21,000 feet with potential for icing to 19,000 feet. No pre-accident malfunction was found.", "probable_cause": "The captain's failure to maintain professional cockpit discipline, his consequent inattention to flight instruments and ice accretion, and his selection of an improper autoflight vertical mode, all of which led to an aerodynamic stall, loss of control, and a forced landing. Factors contributing to the accident were: poor crew discipline, including flightcrew coordination before the stall and the flightcrew's inappropriate actions to recover from the loss of control. Also contributing to the accident was fatigue induced by the flightcrew's failure to properly manage provided rest periods."}