{"url": "https://www.baaa-acro.com/crash/crash-yakovlev-yak-40-bukhara-7-killed", "date": "Dec 14, 1974 at 1101 LT", "type": "Yakovlev Yak-40", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bukhara - Samarkand", "msn": "9131119", "yom": 1971, "flight_number": "SU124", "city": "Bukhara", "zone": "Bukhara Province (Buxoro viloyati)", "country": "Uzbekistan", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 15, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3637, "circumstances": "18 seconds after it started the takeoff roll, after a distance of 360 meters, while at a speed of 150 km/h, the copilot pointed out a problem with the nose gear and asked if the rudder and elevators were unlocked. At this time, the captain realized that a takeoff was not possible and instructed to abandon the takeoff procedure. Engine power was reduced and an emergency braking procedure was initiated. At this time, the aircraft's was 300 meters from the runway end at a speed of 215 km/h. 18 additional seconds elapsed from the copilot's remark. Unable to stop within the remaining distance, the airplane overran, rolled for 540 meters then collided with an embankment and came to rest in flames against trees. 12 occupants were injured while seven passengers were killed. The aircraft was partially destroyed by a post crash fire. ", "probable_cause": "It is believed that control column was blocked and a take-off was impossible in such conditions. Various technical investigations could not precisely determine the causes of this anomaly which could be consecutive either to a human error or to the malfunction of the system as a result of the presence of corrosion on connectors, which would affect the alarm of the locking system. The decision to abort the takeoff procedure was taken too late, which was considered as a contributing factor."}