{"url": "https://www.baaa-acro.com/crash/crash-antonov-12b-heglig", "date": "Jan 4, 2010 at 0910 LT", "type": "Antonov AN-12", "operator": "El%20Magal%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Khartoum – Heglig", "msn": "9 3 465 04", "yom": 1969, "flight_number": "MGG100", "city": "Heglig", "zone": "South Kordofan (جنوب كردفان)", "country": "Sudan", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7050, "captain_hours_type": 6000, "copilot_hours": 10038, "copilot_hours_type": 7050, "aircraft_hours": 36190, "circumstances": "The four engine aircraft departed Khartoum Airport at 0738LT on a cargo flight to Heglig, carrying four crew members and a load consisting of 13 tons of various goods. On final approach to Heglig Airport, the aircraft was too low. It collided with obstacles and a concrete block located 16 metres short of runway threshold and housing an element of the approach light system. The aircraft bounced, nosed down and landed nose first 52 metres further. After a course of 183 metres, a tyre on the right main gear burst. The captain instructed the flight engineer to activate the reverse thrust systems but the flight engineer did not check the power levers. The aircraft veered off runway to the left, lost its left main gear and came to rest. All four occupants escaped uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "Wrong approach configuration, causing the aircraft to land short of runway. \r\nThe following factors were identified:\r\n- The flight engineer unlocked props I, II, III at throttle position < 20 degrees UPRT and No IV engine at 40 degrees UPRT,\r\n- Unrectification of nose wheel and main landing gear crack as recommended by the manufacturer. "}