{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-1-near-wright-9-killed", "date": "Feb 26, 1954 at 1032 LT", "type": "Convair CV-240", "operator": "Western%20Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Los Angeles – Las Vegas – Cedar City – Salt Lake City – Casper – Rapid City – Minneapolis", "msn": "37", "yom": 1948, "flight_number": "WA034", "city": "Wright", "zone": "Wyoming", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 7500, "captain_hours_type": 4634, "copilot_hours": 6850, "copilot_hours_type": 2300, "aircraft_hours": 12145, "circumstances": "Western Air Lines' Flight 314 departed Los Angeles, California, on a scheduled flight to Minneapolis, Minnesota, with intermediate stops scheduled at Las Vegas, Nevada; Cedar City and Salt Lake City, Utah; Casper, Wyoming, and Rapid City, South Dakota. The flight was routine to Salt Lake City, where a relief crew consisting of Captain M. R. Cawley, First Officer R. E. Crowther and Stewardess Mary Grace Creagan took over the flight in accordance with company crew assignment schedules. Prior to departure from Salt Lake City the aircraft was refueled to a total of 1,000 gallons, which filled all tanks, Flight 34 departed from the Salt Lake City ramp at 0721, but returned a few minutes later because of a broken nose wheel steering cable. The cable was replaced and Flight 34 was off the ground at 0850. According to company records, at takeoff the gross weight was 36,990 pounds, 2,144 pounds less than the maximum allowable weight of 39,134 pounds; the load was properly distributed so that the center of gravity of the aircraft was within approved limits. There were an passengers. The flight plan filed with Air Route Traffic Control specified Instrument Flight Rules at 15,000 feet via Green 3 and Blue 76 Airways. Eastward from Salt Lake City the Casper weather went below company minimums and Flight 34 elected to overfly this scheduled stop. After being advised of this action by the company Casper radio, Air Route Traffic Control issued a new clearance for the flight to descend to and maintain 13,000 feet to the Rapid City range station via Blue 37 and Red 2 Airways. However, an altitude change to 17,000 feet was requested by the flight and this was authorized by ARTC. At 1010 N8407H reported 17,000 over Casper, estimating the Wright intersection (122 miles west of Rapid City) at 1027. The Flight reported as being over the Wright intersection at 1025, at 17,000 feet, estimating Rapid City at 1050. The Casper company radio operator gave the flight the 0930 en route weather and the 1010 Rapid City Special #2 terminal weather. This, the last radio contact, was acknowledged by the flight at 1027. At 1041 the Rapid City radio operator attempted unsuccessfully to contact the flight to deliver a clearance for an instrument approach to Rapid City. Attempts continued until 1053 and at that time the Denver company dispatcher was advised that contact with the flight had been lost. At 1106 emergency procedures were initiated. Intermittent snows and restricted visibilities hampered intensive air search efforts. The wreckage was sighted by a Western Air Lines pilot the afternoon of February 28, and ground parties reached the scene that night. The aircraft had crashed in an isolated ranch area and all nine occupants had been killed.", "probable_cause": "The Board, after intensive study of all evidence, determines that the probable cause of this accident was a sudden emergency of undetermined origin under adverse weather conditions resulting in rapid descent and impact with the ground at high speed. The following findings were reported:\r\n- Weather was a major factor in the accident as heavy to possibly severe turbulence and heavy icing existed in the area,\r\n- The flight was routine until approximately five minutes before the crash,\r\n- A sudden emergency or difficulty of undetermined origin occurred that resulted in rapid descent to the ground; no emergency was declared,\r\n- Both engines were developing power at impact,\r\n- Due to the disintegration of the wreckage it was impossible to definitely determine if structural failure or control malfunctioning had occurred prior to impact."}