{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-1-dk-stowting-8-killed", "date": "Jan 11, 1947 at 1730 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "BOAC-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "London – Bordeaux – Lagos", "msn": "12014", "yom": 1944, "flight_number": null, "city": "Stowting", "zone": "Kent", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 4, "pax_on_board": 11, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft left London at 0930LT on a flight to Lagos with an ETA at 1400LT in Bordeaux, an intermediate stop. While descending to Bordeaux-Mérignac Airport, the crew encountered poor weather conditions and decided not to land. The captain diverted to Paris-Le Bourget instead Toulouse but was unable to land, because the weather was poor. He elected to divert to Cormeilles-en-Vexin but again, landing was impossible. He finally decided to return to London but while overflying Kent, fuel exhausted and the crew was forced to make an emergency landing. The aircraft crashed in a field located in Stowting and was destroyed. Four crew members and four passengers were killed. ", "probable_cause": "The accident was due to the following chain of circumstances: \r\n- The weather conditions encountered throughout the flight. \r\n- Bad crewing, as a result of which three of the four operational members of the crew were unfamiliar with the route London - Bordeaux (and Toulouse). \r\n- The captain's failure to ensure that he had all the necessary navigational and landing aid information for that part of the route. In this respect the navigator cannot be considered blameless. \r\n- The unfortunate chance intervention of the York at Bordeaux but for which it seems likely the aircraft would have landed there. In spite of this delay the aircraft could, in fact, have landed as it was then the only one in the vicinity and all radio facilities were at its disposal. \r\n- The captain's decision to go to Le Bourget before ascertaining the weather conditions there in preference to returning to the UK. His navigator had given him ETA's at London and Le Bourget of 1518LT and 1443LT respectively, and he knew Le Bourget. In the light of the evidence it is clear the aircraft would have had more than half an hour's fuel remaining it he had returned direct to England. \r\n- The captains failure to inform Le Bourget of his 1440LT ETA until six minutes earlier. This gave the French station very short notice at a time when much traffic was being handled there in QBI conditions. \r\n- The inability of Cormeilles-en-Vexin to handle two aircraft at once owing to the lack of a second channel, as stated in the French Notice to Airmen No. 49 of 21.10.46.\r\n- The captain's failure to ask Regional Control for further guidance after the failure to establish contact with Cormeilles-en-Vexin between 1447LT, when he acknowledged the diversion and 1514LT when he asked for a QDM. \r\n- The decision of the captain then to try and reach England having regard to his fuel situation at that stage of the flight."}