{"url": "https://www.baaa-acro.com/crash/crash-bae-3101-jetstream-31-pasco-6-killed", "date": "Dec 26, 1989 at 2230 LT", "type": "BAe Jetstream 31", "operator": "United-Express-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Spokane – Yakima – Pasco", "msn": "776", "yom": 1987, "flight_number": "UA2415", "city": "Pasco-Tri-Cities", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 6600, "captain_hours_type": 670, "copilot_hours": 2792, "copilot_hours_type": 213, "aircraft_hours": 4972, "circumstances": "During arrival for an ILS runway 21R approach, the aircraft encountered icing conditions for about 9-1/2 minutes. As the aircraft was vectored for the approach, the Seattle ARTCC controller used an expanded radar range and did not provide precise positioning of the aircraft to the final approach course. The flight crew attempted to continue on a steep, unstabilized approach for a landing. Recorded radar data showed that the aircraft was well to the right of the ILS course line and well above the glide slope as it passed the outer marker/final approach fix (faf). It did not intercept the localizer course until it was about 1.5 mile inside the faf. Also, it was still well above the ILS glide slope were recorded altitude data was lost when the aircraft was abt 2.5 miles from the airport. The tower had closed, but the controller saw the aircraft in a higher than normal rate of descent in a wings level attitude. Before reaching the runway, the aircraft nosed over and crashed in a steep descent. There was evidence that ice had accumulated on the airframe, including the horizontal stabilizers, which may have resulted in a tail plane stall. All six occupants were killed. \n", "probable_cause": "The flightcrew's decision to continue an unstabilized instrument landing system (ILS) approach that led to a stall, most likely of the horizontal stabilizer, and loss of control at low altitude. Contributing to the accident was the air traffic controller's improper vectors that positioned the airplane inside the outer marker while it was still well above the glideslope. Contributing to the stall and loss of control was the accumulation of airframe ice that degraded the aerodynamic performance of the airplane."}