{"url": "https://www.baaa-acro.com/crash/crash-cessna-207a-stationair-8-ii-near-kotzebue-1-killed", "date": "Apr 14, 1999 at 0930 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Village Aviation", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Noorvik - Kotzebue", "msn": "207-0568", "yom": 1981, "flight_number": null, "city": "Kotzebue-Ralph Wien Memorial", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10000, "captain_hours_type": 7800, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16790, "circumstances": "The certificated airline transport pilot departed on a flight to a remote village about 37 miles away. The trip was the first since an annual inspection had been completed the day before. The pilot departed with fuel only in the left wing tank. The right wing tank was empty. About 35 minutes later, the pilot was on a return flight to his original departure airport that was within Class E airspace. During the pilot's absence, the airport visibility had decreased to 1 1/2 mile. Instrument meteorological conditions, and special VFR procedures were in use. A 'MAYDAY' was heard over the common traffic advisory frequency, and was monitored by the local flight service station. The voice of the pilot was recognized as the accident pilot. Search personnel found the airplane on a flat area of a frozen, snow-covered lagoon. The weather at the accident site was described as fog, with flat lighting conditions. The wreckage path was oriented away from higher terrain around the destination airport which is located on a peninsula. The airplane had crashed in a nose down attitude, and came to rest inverted. The engine separated completely from the airframe. An examination of the engine revealed fuel throughout, and mechanical continuity. The vacuum pump's internal support post, on which the internal block rotated, was found fractured through 70 percent of its diameter from fatigue, the remaining portion of fracture was overstress. The airplane was equipped with a standby vacuum system. An examination of the airframe located a combination screwdriver in the left wing. The handle was shattered. No flight control cable impingement was observed. ", "probable_cause": "The pilot's continued VFR flight into instrument meteorological conditions, spatial disorientation, and an inadvertent stall. Factors in the accident were weather conditions consisting of snow and mist, and flat lighting conditions. "}