{"url": "https://www.baaa-acro.com/crash/crash-atr72-500-pokhara-72-killed", "date": "Jan 15, 2023 at 1057 LT", "type": "ATR72-500", "operator": "Yeti-Airlines-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Kathmandu - Pokhara", "msn": "754", "yom": 2007, "flight_number": "YT691", "city": "Pokhara", "zone": "Gandaki", "country": "Nepal", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 68, "pax_fatalities": 68, "other_fatalities": 0, "total_fatalities": 72, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 28731, "circumstances": "The airplane departed Kathmandu-Tribhuvan Airport at 1032LT on a schedule service (YT691) to Pokhara, carrying 68 passengers and a crew of four. On final approach to Pokhara Airport in excellent weather conditions, the airplane entered a slight pitch up attitude, rolled to the left up to 90° (the left wing apparently stalled) then crashed on the bank of the River Seti, bursting into flames. The airplane was totally destroyed and the wreckage was found about 1,9 km short of runway 12 of the new Pokhara International Airport that was open to traffic January 1st, 2023. Part of the debris were found on the top of the hill and others down in the river bed. No one is believed to have survived the crash. ", "probable_cause": "In a preliminary report, the Nepalese Authorities confirmed the following points:\r\n- At 10:56:27, the PF disengaged the Autopilot System (AP) at an altitude of 721 feet Above Ground Level (AGL). The PF then called for “FLAPS 30” at 10:56:32, and the PM replied, “Flaps 30 and descending”. The flight data recorder (FDR) data did not record any flap surface movement at that time. Instead, the propeller rotation speed (Np) of both engines decreased simultaneously to less than 25%1 and the torque (Tq) started decreasing to 0%, which is consistent with both propellers going into the feathered condition. On the cockpit voice recorder (CVR) area microphone recording, a single Master Caution chime was recorded at 10:56:36. The flight crew then carried out the “Before Landing Checklist” before starting the left turn onto the base leg. During that time, the power lever angle increased from 41% to 44%. At the point, Np of both propellers were recorded as Non-Computed Data (NCD) in the FDR and the torque (Tq) of both engines were at 0%. When propellers are in feather, they are not producing thrust.\r\n- When both propellers were feathered, the investigation team observed that both engines of 9N-ANC were running flight idle condition during the event flight to prevent over torque. As per the FDR data, all the recorded parameters related to engines did not show any anomaly. At 10:56:50 when the radio altitude callout for five hundred feet3 was annunciated, another “click” sound was heard. The aircraft reached a maximum bank angle of 30 degrees at this altitude. The recorded Np and Tq data remained invalid. The yaw damper disconnected four seconds later. The PF consulted the PM on whether to continue the left turn and the PM replied to continue the turn. Subsequently, the PF asked the PM on whether to continue descend and the PM responded it was not necessary and instructed to apply a little power. At 10:56:54, another click was heard, followed by the flaps surface movement to the 30 degrees position.\r\n- When ATC gave the clearance for landing at 10:57:07, the PF mentioned twice that there was no power coming from the engines. At 10:57:11, the power levers were advanced first to 62 degrees then to the maximum power position. It was followed by a “click” sound at 10:57:16. One second after the “click” sound, the aircraft was at the initiation of its last turn at 368 feet AGL, the high pressure turbine speed (Nh) of both engines increased from 73% to 77%.\r\n- It is noted that the PF handed over control of the aircraft to the PM at 10:57:18. At 10:57:20, the PM (who was previously the PF) repeated again that there was no power from the engines. At 10:57:24 when the aircraft was at 311 feet AGL, the stick shaker was activated warning the crew that the aircraft Angle of Attack (AoA) increased up to the stick shaker threshold."}