{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-gatineau-1-killed", "date": "Jun 14, 2004 at 1340 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Alain Bourbonnais", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Gatineau - Gatineau", "msn": "1368", "yom": 1959, "flight_number": null, "city": "Gatineau", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1709, "captain_hours_type": 700, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot and sole occupant of the DHC-2 seaplane, registration C-GJST, serial number 1368, was on his first flight of the season on the Ottawa River at Gatineau, Quebec. This training flight, conducted according to visual flight rules, was to consist of about 12 touch-and-go landings. The aircraft took off at approximately 1300 eastern daylight time, and made several upwind touch-and-go landings in a westerly direction. At approximately 1340 eastern daylight time, the aircraft was seen about 50 feet above the surface of the water proceeding downwind in an easterly\r\ndirection, in a nose-down attitude of over 20 degrees. The right float then struck the water and the aircraft tumbled several times, breaking up on impact. Despite the waves and gusting wind on the river, some riverside residents who witnessed the accident attempted a rescue, but the aircraft sank before they could reach it. Even though the pilot was wearing a seat-belt, he sustained head injuries at impact and drowned.", "probable_cause": "Finding as to Causes and Contributing Factors:\r\n1. The aircraft struck the water for undetermined reasons.\r\nFindings as to Risk:\r\n1. The certificate of airworthiness was not in effect at the time of the accident because of the airworthiness directives that had not been completed.\r\n2. The distress signal emitted by the fixed, automatic emergency locator transmitter (ELT) was not received because of the reduced range of the signal once the ELT was submerged, which could have increased the response time of search and rescue units if there had been no witnesses to the accident.\r\n3. The pilot had not made a training flight with an instructor for more than 19 months, which could have resulted in a degradation of his skills and decision-making process."}