{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-las-cruces-4-killed", "date": "Aug 27, 2014 at 1903 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Amigos Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Las Cruces – Phoenix", "msn": "421C-0871", "yom": 1974, "flight_number": null, "city": "Las Cruces", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 2432, "captain_hours_type": 52, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8181, "circumstances": "According to the line service technician who worked for the fixed-base operator (FBO), before taking off for the air ambulance flight with two medical crewmembers and one patient onboard, the pilot verbally asked him to add 40 gallons of fuel to the airplane, but the pilot did not specify the type of fuel. The line service technician drove a fuel truck to the front of the airplane and added 20 gallons of fuel to each of the multiengine airplane's wing tanks. The pilot was present during the refueling and helped the line service technician replace both fuel caps. Shortly after takeoff, a medical crewmember called the company medical dispatcher and reported that they were returning to the airport because smoke was coming from the right engine. Two witnesses reported seeing smoke from the airplane Several other witnesses reported seeing or hearing the impact and then immediately seeing smoke or flames. On-scene evidence showed the airplane was generally eastbound and upright when it impacted terrain. A postimpact fire immediately ensued and consumed most of the airplane. Investigators who arrived at the scene the day following the accident reported clearly detecting the smell of jet fuel. The airplane, which was equipped with two reciprocating engines, should have been serviced with aviation gasoline, and this was noted on labels near the fuel filler ports, which stated \"AVGAS ONLY.\" However, a postaccident review of refueling records, statements from the line service technician, and the on-scene smell of jet fuel are consistent with the airplane having been misfueled with Jet A fuel instead of the required 100LL aviation gasoline, which can result in detonation in the engine and the subsequent loss of engine power. Postaccident examination of the engines revealed internal damage and evidence of detonation. It was the joint responsibility of the line technician and pilot to ensure that the airplane was filled with aviation fuel instead of jet fuel and their failure to do so led to the detonation in the engine and the subsequent loss of power during initial climb.In accordance with voluntary industry standards, the FBO's jet fuel truck should have been equipped with an oversized fuel nozzle; instead, it was equipped with a smaller diameter nozzle, which allowed the nozzle to be inserted into the smaller fuel filler ports on airplanes that used aviation gasoline. The FBO's use of a small nozzle allowed it to be inserted in the accident airplane's filler port and for jet fuel to be inadvertently added to the airplane.", "probable_cause": "The misfueling of the airplane with jet fuel instead of the required aviation fuel, and the resultant detonation and a total loss of engine power during initial climb. Contributing to the accident were the line service technician's inadvertent misfueling of the airplane, the pilot's inadequate supervision of the fuel servicing, and the fixed-base operator's use of a small fuel nozzle on its jet fuel truck."}