{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-5d-buffalo-libreville-30-killed", "date": "Apr 27, 1993 at 2245 LT", "type": "De Havilland DHC-5 Buffalo", "operator": "Zambia%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Lusaka – Brazzaville – Libreville – Abidjan – Dakar", "msn": "69", "yom": 1976, "flight_number": null, "city": "Libreville", "zone": "Estuaire (Libreville)", "country": "Gabon", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 25, "pax_fatalities": 25, "other_fatalities": 0, "total_fatalities": 30, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Lusaka on a charter flight to Dakar with intermediate stops in Brazzaville, Libreville and Abidjan, carrying all staff of the National Zambian Football Team who was flying to Dakar to play against Senegal for the World Cup 1994 in USA. One minute after a night takeoff from Libreville-Léon Mba Airport, while climbing, the left engine failed. In a certain confusion, the captain mistakenly shut down the right engine. The aircraft lost height and crashed in the sea about 500 metres offshore. The aircraft sank and all 30 occupants were killed. It was reported that the aircraft has not been operated between December 21, 1992 and April 21, 1993 and was eventually requisitioned by the Zambian Government to carry the National Football Team to Senegal. A maintenance control (check A & B) was conducted between April 22 and 26, the day prior to departure. ", "probable_cause": "It was determined that the left engine failed due to excessive carbon deposit. Also, oil filters were clogged and electrical cables showed sign of overheating. The engine failed during initial climb due to inadequate maintenance. It was also reported that the captain was tired at the time of the accident due to intense schedule the preceding days following a tour in Mauritius with an insufficient rest time. Poor crew coordination, fatigue and lack of concentration were considered as contributing factors.   "}