{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-350-super-king-air-porto-seguro-14-killed", "date": "May 22, 2009 at 2053 LT", "type": "Beechcraft 350 Super King Air", "operator": "Santa Coloma Investimento e Participações", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "São Paulo – Porto Seguro", "msn": "FL-237", "yom": 1999, "flight_number": null, "city": "Porto Seguro-Terravista Golf Club", "zone": "Bahia", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 20000, "captain_hours_type": 5000, "copilot_hours": 357, "copilot_hours_type": 107, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed São Paulo-Congonhas Airport at 1831LT on a private flight to Porto Seguro, carrying 12 passengers and two pilots, among them the Brazilian Businessman Roger Wright, his wife, children and grandchildren. On approach to Porto Seguro-Terravista Golf Club Airport, the crew encountered poor weather conditions and the visibility was low due to the night. On final approach to runway 15, the aircraft impacted trees located 900 metres from the runway threshold. The aircraft continued for about 700 metres then struck others trees and crashed 200 metres short of runway, bursting into flames. The aircraft was totally destroyed and all 14 occupants were killed. ", "probable_cause": "The crew's decision to continue the approach in poor weather conditions following a high motivation to land at destination. \r\nThe following contributing factors were identified: \r\n- The crew failed to follow the published procedures, \r\n- The crew did not take the bad weather conditions into consideration and took the decision to land,\r\n- Limited visibility due to rain falls and night, \r\n- Weather conditions affected the perception of the pilots who suffered a loss of situational awareness,\r\n- Poor judgment of the situation and flight conditions on part of the crew,\r\n- The crew continued the approach under VFR mode in IMC conditions, \r\n- The crew carried out an improvised VFR approach via a GPS system,\r\n- Excessive approach speed,\r\n- Poor crew coordination,\r\n- Lack of crew discipline."}