{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-thunder-bay", "date": "Jun 14, 1999 at 1038 LT", "type": "Beechcraft 100 King Air", "operator": "Thunder%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Thunder Bay – Red Lake", "msn": "B-108", "yom": 1972, "flight_number": "THU103", "city": "Thunder Bay", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Thunder Airlines Limited Beech A100 King Air aircraft, serial number B108, took off at 1034 eastern daylight saving time (EDT) on a charter flight from Thunder Bay, Ontario, for Red Lake, Ontario, with two pilots and three passengers on board. After getting airborne, the aircraft pitched up to approximately 70 degrees, reaching a height estimated to be between 500 and 700 feet above ground level. It then rolled to the left, pitched steeply nose-down, and descended to the ground within the confines of the airport. The aircraft contacted the soft, level ground in a relatively level attitude and covered a distance of about 500 feet before coming to rest in a wooded area immediately beyond an elevated railroad bed and track. The cabin remained intact during the crash sequence, and all occupants escaped without any injuries. The aircraft was damaged beyond repair. An ensuing fuel-fed fire was rapidly extinguished by airport emergency response services (ERS)\r\npersonnel.", "probable_cause": "The flight crew lost pitch control of the aircraft on take-off when the stabilizer trim actuators became disconnected because they had not been properly reinstalled by the AME during maintenance work conducted before the flight. The crew chief responsible for the inspection did not ensure correct assembly of the stabilizer trim actuators, which contributed to the accident."}