{"url": "https://www.baaa-acro.com/crash/crash-cessna-560-citation-v-atlanta-4-killed", "date": "Dec 20, 2018 at 1210 LT", "type": "Cessna 560 Citation V", "operator": "Chen Aircrafts", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Atlanta - Millington", "msn": "560-0148", "yom": 1991, "flight_number": null, "city": "Atlanta-Fulton County-Brown Field", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 2300, "captain_hours_type": 110, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6854, "circumstances": "The pilot departed on an instrument flight rules flight into instrument meteorological conditions (IMC). Radar data indicated that the airplane entered a left turn after takeoff, consistent with the pilot's instrument clearance. As the airplane climbed to an altitude about 2,410 ft above ground level, its rate of climb increased from about 3,500 ft per minute to 9,600 ft per minute, the stick shaker activated, and the airplane decelerated to about 75 knots. The airplane then entered a descending right turn and rolled inverted before impacting terrain about 1 mile from the airport. All major components of the airplane were located at the accident site, and examination of the wreckage revealed no anomalies with the airplane that would have precluded normal operation. The weather conditions about the time of the accident included an overcast cloud ceiling about 600 ft above ground level. It is likely that the pilot became spatially disoriented after entering the cloud layer, which resulted in the airplane's high rate of climb, rapid loss of airspeed, and a likely aerodynamic stall. The steep descending right turn, the airplane's roll to an inverted attitude, and the high-energy impact are also consistent with a loss of control due to spatial disorientation.", "probable_cause": "The pilot's loss of airplane control due to spatial disorientation during initial climb in instrument meteorological conditions."}