{"url": "https://www.baaa-acro.com/crash/crash-atr72-212-altamira", "date": "Feb 21, 2011 at 1845 LT", "type": "ATR72-200", "operator": "TRIP-Linhas-Aereas", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Belém - Altamira", "msn": "454", "yom": 1995, "flight_number": "TIB5204", "city": "Altamira", "zone": "Pará", "country": "Brazil", "region": "South America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 47, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6000, "captain_hours_type": 2600, "copilot_hours": 1210, "copilot_hours_type": 50, "aircraft_hours": 32886, "circumstances": "The aircraft departed Belém-Val de Cans Airport on a schedule service to Altamira with 47 passengers and 4 crew members on board. The approach for landing in Altamira was completed in VFR mode and the aircraft was stabilized. The touchdown on the runway was smooth, with gradual deceleration, in which only the 'ground idle' was used. After the '70 knots' callout, a strong noise was heard, and the left main gear collapsed with the aircraft deviating to the left. The aircraft veered off runway and came to rest in a grassy area. Among the 51 occupants, one passenger suffered minor injuries. ", "probable_cause": "The following findings were identified:\r\n- The LEFT MAIN LANDING GEAR ASSEMBLY (PN D23189000-19 and SN MN1700) collapsed, failing with 5,130 cycles after the last overhaul.\r\n- A specific component (pin) of the assembly connecting the landing gear to the airframe, the AFT PIVOT PIN (P / N D61000, S / N 25), broke on account of fatigue, whose onset was facilitated by a machining process carried out in the pin section transition region.\r\n- The ANAC-approved ATR72 Series Aircraft Maintenance Program of the TRIP Linhas Aéreas company read that the LEFT MAIN LANDING GEAR ASSEMBLY had to undergo overhaul every eight years or 18,000 cycles.\r\n- On 27 February 2009, the PR-TTI landing gear was removed and, on 09 March 2009, was sent to be overhauled by the AV Indústria Aeronáutica Ltda. It had 31,684 cycles since new and 18,095 cycles since the last overhaul.\r\n- AV Indústria Aeronáutica Ltda. was homologated for conducting such inspection, as specified in the List attached to the Addendum, Revision no. 11, dated 05 January 2009, and accepted by means of the Official Document no. 0173/2009-GGAC/SAR, issued by the Civil Aviation Authority.\r\n- The AV Indústria Aeronáutica Ltda. company disassembled the legs of the landing gear, and outsourced some of the tasks for not possessing technical knowledge and/or appropriate machinery (necessary for the process of reconditioning the AFT PIVOT PIN (D61000 SN 25).\r\n- Two of the three companies outsourced by AV Indústria Aeronáutica Ltda. were not homologated by the Civil Aviation Authority. \r\n- The AV Indústria Aeronáutica Ltda. company conducted external audits of the three companies involved in the overhaul.\r\n- The audits carried out by AV Indústria Aeronáutica Ltda. were not sufficient to identify that the contractors lacked qualified personnel, manuals and the machinery necessary to work with aeronautical products.\r\n- The AV Indústria Aeronáutica Ltda. Technical Manager did not supervise the overhaul inspections and services performed by the contracted companies.\r\n- The AFT PIVOT PIN (D61000 SN 25) is part of the assembly that connects the landing gear to the airframe.\r\n- All revision tasks were described in the manuals of the manufacturer.\r\n- The AFT PIVOT PIN (D61000 SN 25) failure-analysis report stated that the PRTTI aircraft left main landing gear collapsed on account of fatigue, whose onset was facilitated by a machining process carried out in the section transition region of the pin.\r\n- The manufacturer's maintenance manual did not refer to any machining work in that region of the pin.\r\n- In only one stage of the pin reconditioning process was it possible to observe that a machining task was required, namely, the Grinding of chromium.\r\n- The lack of capacitation and training of the subcontractors’ professionals for handling aircraft material hindered the execution of an efficient maintenance work as prescribed by the manufacturer's manual, culminating in inadequate machining during the maintenance process.\r\n- The lack of an effective process of supervision, both on the part of TRIP Linhas Aéreas and on the part of the other contractors and subcontractors allowed the existing maintenance services’ latent failures not to be checked and corrected, in a way capable of subsidizing, in an adequate and safe manner, the execution of the landing gear maintenance service.\r\n- The process of supervision of the TRIP Linhas Aéreas and the AV Indústria Aeronáutica Ltda. companies by the Civil Aviation Authority, prescribed by specific legislation in force, was not enough to mitigate the latent conditions present in the accident in question.\r\n- According to the technical opinion issued by the DCTA, the AFT PIVOT PIN (D61000 and SN 25) presented fracture surfaces with ± 45º inclination, as well as a flat area with multiple initiations, indicative of a fracture mechanism related to fatigue. In examinations of the external surface of the pin, in a region close to the fatigue fracture, cracks were observed that had initiated from scratches created by an inadequate maintenance machining process. In the region where the overload-related fracture occurred, it was also possible to identify that the machining process had modified the profile of the part in the section transition region, by producing a depression. Thus, it can be said that the AFT PIVOT PIN (D61000 and SN 25) of the PR-TTI left main gear broke on account of fatigue, whose onset was facilitated by an inadequate machining process that had been performed in the section transition region of the pin. "}