{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-near-shaver-lake-4-killed", "date": "May 28, 1988 at 1910 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Brooks Products", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Rialto - Truckee", "msn": "421C-0209", "yom": 1976, "flight_number": null, "city": "Shaver Lake", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3060, "captain_hours_type": 15, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2575, "circumstances": "The pilot bought the aircraft about a month prior to the accident. He had limited experience in the aircraft, and limited experience with high altitude flight and its weather phenomenon. The pilot obtained two weather briefings for the flight. During both, he was advised of the forecast and pilot reported conditions of moderate to severe mixed icing and turbulence associated with a mountain wave on the eastern side of the Sierra Nevada mountains. Instead of flying along his intended route on the western side of the mountains, he chose a direct route, which placed the aircraft on the eastern side of the mountains. The track of the aircraft was established by recorded radar data. The data showed the aircraft in cruise at 16,500 feet until about 1 minute prior to the accident. The aircraft was shown to climb to 17,200 feet before it disappeared. The last radar target was observed about 2 miles from the impact location. The aircraft impacted in a steep nose down descent. All four occupants were killed. ", "probable_cause": "Inflight encounter with forecasted severe icing and turbulence beyond the capability of either the aircraft or the pilot, which led to an inflight loss of control. Factors in the accident were the pilots lack of understanding of high altitude flight aspects and meteorological phenomenon. \r\nFindings:\r\nOccurrence #1: in flight encounter with weather\r\nPhase of operation: cruise - normal\r\nFindings\r\n1. (f) weather condition - icing conditions\r\n2. (f) weather condition - mountain wave\r\n3. (f) weather condition - turbulence\r\n4. Preflight briefing service - issued - nws personnel\r\n5. (f) lack of total experience in type operation - pilot in command\r\n6. (c) weather evaluation - not understood - pilot in command\r\n7. (c) flight into known adverse weather - attempted - pilot in command\r\n8. (f) in-flight planning/decision - poor - pilot in command\r\n----------\r\nOccurrence #2: loss of control - in flight\r\nPhase of operation: cruise - normal\r\nFindings\r\n9. (c) aircraft performance - exceeded\r\n10. (c) aircraft control - inadequate - pilot in command\r\n11. (c) stall/spin - inadvertent - pilot in command\r\n----------\r\nOccurrence #3: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled"}