{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-i-near-laidman-lake-1-killed", "date": "Oct 10, 2016 at 0844 LT", "type": "De Havilland DHC-2 Beaver", "operator": "101190984 Saskatchewan", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Vanderhoof - Laidman Lake", "msn": "842", "yom": 1955, "flight_number": null, "city": "Laidman Lake", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 280, "captain_hours_type": 23, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 10 October 2016, at approximately 0820 Pacific Daylight Time, a privately operated de Havilland DHC-2 Beaver aircraft on amphibious floats (registration C-GEWG, serial number 842), departed from Vanderhoof Airport, British Columbia, for a day visual flight rules flight to Laidman Lake, British Columbia. The pilot and 4 passengers were on board. Approximately 24 minutes into the flight, the aircraft struck terrain about 11 nautical miles east of Laidman Lake. The 406 MHz emergency locator transmitter (ELT) activated on impact. The ELT's distress signal was detected by the Cospas-Sarsat satellite system, and a search-and-rescue operation was initiated by the Joint Rescue Coordination Centre Victoria. One of the passengers was able to call 911 using a cell phone. The pilot was fatally injured, and 2 passengers were seriously injured. The other 2 passengers sustained minor injuries. The aircraft was substantially damaged. There was no post-impact fire.", "probable_cause": "Findings as to causes and contributing factors:\r\n1. As the aircraft approached the mountain ridge, the high overcast ceiling and uniform snow-covered vegetation were conducive to optical illusions associated with flight in mountainous terrain. These illusions likely contributed to the pilot’s misjudgment of the proximity of the terrain, inadvertent adoption of an increasingly nose-up attitude, and non-detection of the declining airspeed before banking the aircraft to turn away from the hillside.\r\n2. As the angle of bank increased during the turn, the stall speed also increased and the aircraft entered an accelerated stall.\r\n3. The aircraft’s out-of-limit weight-and-balance condition increased its stall speed and degraded its climb performance, stability, and slow-flight characteristics. As a result, its condition, combined with the aircraft’s low altitude, likely prevented the pilot from regaining control of the aircraft before the collision with the terrain.\r\n4. The absence of a stall warning system deprived the pilot of the last line of defence against an aerodynamic stall and the subsequent loss of control of the aircraft.\r\n5. The forward shifting of the unsecured cargo and the partial detachment of the rear seats during the impact resulted in injuries to the passengers.\r\n6. During the impact sequence, the load imposed on the pilot’s lap-belt attachment points was transferred to the seat-attachment points, which then failed in overload. As a result, the seat moved forward during the impact and the pilot was fatally injured.\n\r\nFindings as to risk:\r\n1. If pilots do not obtain quality sleep during the rest period prior to flying, there is a risk that they will operate an aircraft while fatigued, which could degrade pilot performance.\r\n2. If cargo is not secured, there is a risk that it will shift forward during an impact or turbulence and injure passengers or crew.\n\r\nOther findings:\r\n1. Because the aircraft was equipped with a 406 MHz emergency locator transmitter that transmitted an alert message to the Cospas-Sarsat satellites system in combination with the homing signal transmitted on 121.5 MHz, the Joint Rescue Coordination Centre aircraft was able to locate the wreckage and occupants in a timely manner."}