{"url": "https://www.baaa-acro.com/crash/crash-lockheed-kc-130f-hercules-hue-phu-bai-6-killed", "date": "May 18, 1969 at 1330 LT", "type": "Lockheed C-130 Hercules", "operator": "US%20Navy", "flight_phase": "Flight", "flight_type": "Refuelling", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Đà Nẵng - Đà Nẵng", "msn": "3723", "yom": 1962, "flight_number": null, "city": "Huế-Phú Bài", "zone": "Thừa Thiên–Huế Province", "country": "Vietnam", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 12:05 on 18 May 1969 the Marine Corps KC-130F tanker departed Da Nang Air Base on a routine operational tanker mission. The aircraft continued to the Hue Phu Bai Area for the in-flight refueling mission. The tanker had departed its assigned track by and was proceeding toward the ocean before turning southeast to Da Nang. The KC-130F proceeded southbound for the Hue Phu Bai airfield area while refueling two US Marine Corps McDonnell F-4B Phantom fighter aircraft (152270 and 151450). All three aircraft were descending in a \"tobogganing\" maneuver while heading southbound in the vicinity of the South Vietnam Coastline. At the same time a separate USMC F-4B Phantom (151001) was heading in a generally westbound direction toward the Hue Phu Bai military area. The two aircraft approached each other nearly head on with a closing rate of approximately 700 knots true airspeed. The initial impact by the F-4B was in the vicinity of the number four engine and the starboard refueling pod on the KC-130F. The radome on the F-4B cleared the propeller on the number four engine as the cockpit initially impacted with it. The single F-4B crashed and the pilot and RIO died instantly. The KC-130F crashed into the sea. One of the refueling F-4B's was severely damaged from the initial crash debris. Phantom 151450 plugged into the starboard drogue, was sprayed with fuel and apparently ingested an undetermined amount of debris into both engines. The F-4B aircraft flipped uncontrollably to an inverted position while the drogue and a portion of the hose remained attached to the aircraft. Its engines could not sustain power and the fighter crashed at sea. Both crew members successfully ejected and were recovered. The second refueling F-4B fighter, 152270 was plugged into the port refueling drogue and sustained limited damage in the form of two small holes in the port aileron and a 1/2 inch hole in the starboard wingtip. The pilot observed the spinning tanker, and when it was apparent he could render no further assistance returned to Chu Lai Air Base without further incident.\r\nCrew:\r\nMaj Jimmie Dwayne Sells, \r\nMaj John Clarence Williamson, \r\nMGSgt Carroll Franklin Hersey,\r\nM/Sgt Edmond Chester Polenski,\r\nSgt Robert Allen Bonebright,\r\nCpl James Allen Cox. \r\nSource: The Marine Air Transporter", "probable_cause": null}