{"url": "https://www.baaa-acro.com/crash/crash-consolidated-b-24c-liberator-ii-gibraltar-16-killed", "date": "Jul 4, 1943 at 2307 LT", "type": "Consolidated B-24 Liberator", "operator": "Royal-Air-Force-4", "flight_phase": "Takeoff (climb)", "flight_type": "Government", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Gibraltar - Hendon", "msn": null, "yom": null, "flight_number": null, "city": "Gibraltar", "zone": "All United Kingdom", "country": "United Kingdom", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 5, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Captain Eduard Prchal, the only survivor, confirmed he received the green light from the tower and began the night take-off roll. He pulled the stick back and the aircraft started to climb. At an altitude of 150 feet, he pushed the controls of the aircraft forward to gain speed when he discovered he was unable to pull the stick back. The steering mechanism was jammed or locked. The aircraft then lost height rapidly. The Captain closed the four throttles and warned the others through the intercom \"Attention, crash\". The aircraft crashed into the sea 16 seconds after take off. The Captain was the only survivor as all 16 other occupants were killed, among them the Polish General and Prime Minister Władysław Sikorski, his daughter Zofia and his Chief of Staff, the Major General  Tadeusz Klimecki. The crew was from the 511th Squadron.\r\nPassengers:\r\nCol Victor Cazalet,\r\nJan Gralewski,\r\nMaj Gen Tadeusz Klimecki,\r\nAdj Adam Kułakowski,\r\nZofia Leśniowska,\r\nWalter Heathcote Lock,\r\nCol Andrzej Marecki,\r\nAdj Harry Pinder,\r\nLt Józef Ponikiewski,\r\nGen Władysław Sikorski\r\nBrig John Percival Whiteley.", "probable_cause": "A British Court of Inquiry convened on 7 July 1943 to investigate the crash, following the order by Air Marshal Sir John Slessor of 5 July 1943. On 25 July 1943 the Court concluded that the accident was caused by the \"jamming of elevator controls\" which led to the aircraft being uncontrollable after take-off. The report noted that \"it has not been possible to determine how the jamming occurred\" although it ruled out sabotage. Slessor was not satisfied with the report and on 28 July ordered the Court to continue its investigation to find out whether the controls were indeed jammed or not, and if they were, then for what reason. Despite further investigation the Court was unable to resolve Slessor's doubts. The Polish government refused to endorse this report because of the contradictions cited therein, and the lack of conclusive findings."}