{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-g200-tegucigalpa", "date": "May 22, 2018 at 1119 LT", "type": "Gulfstream G200", "operator": "Silver%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Austin – Tegucigalpa", "msn": "54", "yom": 2001, "flight_number": null, "city": "Tegucigalpa-Toncontin", "zone": "Francisco Morazán", "country": "Honduras", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5400, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5299, "circumstances": "On final approach to runway 02, the copilot informed the captain about the fact that the approach speed was too high by 20 knots to the reference speed. The captain replied he would correct this but the airplane landed too far down runway 02, about 993 metres before the end of the runway which is 2,010 metres long but with a displaced threshold, giving a landing distance available of 1,700 metres. Upon touchdown, the aircraft's speed was 142 knots, about 14 knots above the speed reference according to existing conditions and weight and balance. Unable to stop within the remaining distance, the airplane overran, went down an embankment, crossed a road and came to rest against a second embankment, broken in two. All six occupants were slightly injured and the aircraft was destroyed. Owned by TVPX, it was operated by Silver Air. ", "probable_cause": "The accident was the consequence of the followings:\r\n- The crew completed an approach at a speed higher than the reference speed for weight and balance specified in the aircraft checklist,\r\n- Lack of specific information on the length of the runway at Toncontín International Airport by the crew for the approach to runway 02, when landing almost halfway down the runway leaving little distance for effective braking of the systems,\r\n- A late activation of the thrust reverser systems about 0:13 seconds after touchdown was considered as a contributing factor,\r\n- Existing weather conditions were not considered as a contributing factor. "}