{"url": "https://www.baaa-acro.com/crash/crash-bae-3201-jetstream-32ep-kirksville-13-killed", "date": "Oct 19, 2004 at 1937 LT", "type": "BAe Jetstream 31", "operator": "American%20Connection", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Saint Louis – Kirksville", "msn": "875", "yom": 1990, "flight_number": "AA5966", "city": "Kirksville", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 13, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": 4234, "captain_hours_type": 2510, "copilot_hours": 2856, "copilot_hours_type": 107, "aircraft_hours": 21979, "circumstances": "On October 19, 2004, about 1937 central daylight time, Corporate Airlines (doing business as American Connection) flight 5966, a BAE Systems BAE-J3201, N875JX, struck trees on final approach and crashed short of runway 36 at Kirksville Regional Airport (IRK), Kirksville, Missouri. The flight was operating under the provisions of 14 Code of Federal Regulations Part 121 as a scheduled passenger flight from Lambert-St. Louis International Airport, in St. Louis, Missouri, to IRK. The captain, first officer, and 11 of the 13 passengers were fatally injured, and 2 passengers received serious injuries. The airplane was destroyed by impact and a post impact fire. Night instrument meteorological conditions (IMC) prevailed at the time of the accident, and the flight operated on an instrument flight rules flight plan.", "probable_cause": "the pilots' failure to follow established procedures and properly conduct a non precision instrument approach at night in IMC, including their descent below the minimum descent altitude (MDA) before required visual cues were available (which continued unmoderated until the airplane struck the trees) and their failure to adhere to the established division of duties between the flying and non flying (monitoring) pilot. \r\nContributing to the accident was the pilots' failure to make standard callouts and the current Federal Aviation Regulations that allow pilots to descend below the MDA into a region in which safe obstacle clearance is not assured based upon seeing only the airport approach lights. The pilots' unprofessional behavior during the flight and their fatigue likely contributed to their degraded performance.\n"}