{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-orangeburg", "date": "Dec 9, 2005 at 2240 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Airnow", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Savannah - Columbia", "msn": "110-278", "yom": 1980, "flight_number": null, "city": "Orangeburg", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2250, "captain_hours_type": 195, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14837, "circumstances": "The pilot had flown the airplane the day before the accident and after landing on the morning of the accident; she ordered fuel for the airplane. While exiting the airplane another pilot informed her that he had heard a \"popping noise\" coming from one of the engines. The pilot of the accident airplane elected to taxi to a run up area to conduct an engine run up. The fuel truck arrived at the run up area and the pilot elected not to refuel the airplane at that time and continued the run up. No anomalies were noted during the run up and the airplane was taxied back to the ramp and parked. The pilot arrived back at the airport later on the day of the accident and did not re-order fuel for the airplane nor did she recall checking the fuel tanks during the preflight inspection of the airplane. The pilot departed and was in cruise flight when she noticed the fuel light on the annunciator panel flickering. The pilot checked the fuel gauges and observed less than 100 pounds of fuel per-side indicated. The pilot declared low fuel with Columbia Approach Control controllers and requested to divert to the nearest airport, Orangeburg Municipal. The controller cleared the pilot for a visual approach to the airport and as she turned the airplane for final, the left engine lost power followed by the right engine. The pilot made a forced landing into the trees about 1/4 mile from the approach end of runway 36. The pilot exited the airplane and telephoned 911 emergency operators on her cell phone. The pilot stated she did not experience any mechanical problems with the airplane before the accident. Examination of the airplane by an FAA inspector revealed the fuel tanks were not ruptured and no fuel was present in the fuel tanks.", "probable_cause": "The pilot's inadequate preflight inspection and her failure to refuel the airplane which resulted in total loss of engine power due to fuel exhaustion, and subsequent in-flight collision with trees."}