{"url": "https://www.baaa-acro.com/crash/crash-tupolev-ant-40-near-napareuli-3-killed", "date": "Sep 23, 1938 at 0515 LT", "type": "Tupolev ANT-40 (PS-40/PS-41)", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Tbilisi – Rostov-on-Don – Moscow", "msn": "8/95", "yom": 1938, "flight_number": null, "city": "Napareuli", "zone": "Kakheti", "country": "Georgia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Tbilisi at 0442LT on a cargo flight to Moscow with an intermediate stop in Rostov with three crew members on board. 33 minutes into the flight, radio contact was lost after the airplane impacted the slope of a mountain located 22 km north-northeast of Napareuli. As the airplane failed to arrive in Rostov, SAR operations were initiated. On 28 October 1938, the wreckage was found by two locals in a ravine. All three crew members were killed. \n", "probable_cause": "The direct cause of the accident was the pilot's violation of §53 of the Flight Manual (leaving the route). According to the conclusion of the Main Inspectorate of ATC, the main cause of the crash was Aeroflot's insistence on a one-day flight, which the Head of the Georgian ATC did not protest, not taking into account the time of year and overestimating the qualities of the pilot, who had insufficient training on this type of aircraft. The responsable of the accident is the Head of the Main Directorate of Civil Aviation, who organized the unnecessary high-speed flight and committed a number of violations of the Flight Manual. Another person responsible for the crash was the head of the Georgian Air Traffic Control Directorate, who had released the plane in unstable weather conditions and had no radio navigation equipment on the route. The detection of the aircraft near Telovo can be attributed to wind drift in the absence of radio navigation facilities, rather than being deliberate."}