{"url": "https://www.baaa-acro.com/crash/crash-bae-4101-jetstream-41-charlottesville", "date": "Dec 29, 2000 at 2234 LT", "type": "Bae Jetstream 41", "operator": "United-Express-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Washington DC – Charlottesville", "msn": "41059", "yom": 1995, "flight_number": "UA331", "city": "Charlottesville", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 15, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4050, "captain_hours_type": 1425, "copilot_hours": 4818, "copilot_hours_type": 68, "aircraft_hours": 14456, "circumstances": "The twin-engine turboprop airplane touched down about 1,900 feet beyond the approach end of the 6,000-foot runway. During the rollout, the pilot reduced power by pulling the power levers aft, to the flight idle stop. He then depressed the latch levers, and pulled the power levers further aft, beyond the flight idle stop, through the beta range, into the reverse range. During the power reduction, the pilot noticed, and responded to a red beta light indication. Guidance from both the manufacturer and the operator prohibited the use of reverse thrust on the ground with a red beta light illuminated. The pilot pushed the power levers forward of the reverse range, and inadvertently continued through the beta range, where aerodynamic braking was optimum. The power levers continued beyond the flight idle gate into flight idle, a positive thrust setting. The airplane continued to the departure end of the runway in a skid, and departed the runway and taxiway in a skidding turn. The airplane dropped over a 60-foot embankment, and came to rest at the bottom. The computed landing distance for the airplane over a 50-foot obstacle was 3,900 feet, with braking and ground idle (beta) only; no reverse thrust applied. Ground-taxi testing after the accident revealed that the airplane could reach ground speeds upwards of 85 knots with the power levers at idle, and the condition levers in the flight position. Simulator testing, based on FDR data, consistently resulted in runway overruns. Examination of the airplane and component testing revealed no mechanical anomalies. Review of the beta light indicating system revealed that illumination of the red beta light on the ground was not an emergency situation, but only indicated a switch malfunction. In addition, a loss of the reverse capability would have had little effect on computed stopping distance, and none at all in the United States, where performance credit for reverse thrust was not permitted. ", "probable_cause": "The captain's improper application of power after responding to a beta warning light during landing rollout, which resulted in an excessive rollout speed and an inability to stop the airplane before it reached the end of the runway."}