{"url": "https://www.baaa-acro.com/crash/crash-cessna-560xl-citation-excel-oroville", "date": "Aug 21, 2019 at 1132 LT", "type": "Cessna 560XLS Citation Excel", "operator": "Delta%20Private%20Jets", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Oroville - Portland", "msn": "560-5314", "yom": 2003, "flight_number": "DPJ91", "city": "Oroville", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6482, "captain_hours_type": 192, "copilot_hours": 4748, "copilot_hours_type": 858, "aircraft_hours": 9876, "circumstances": "The crew was conducting an on-demand charter flight with eight passengers onboard. As the flight crew taxied the airplane to the departure runway, the copilot called air traffic control using his mobile phone to obtain the departure clearance and release. According to the pilot, while continuing to taxi, he stopped the airplane short of the runway where he performed a rudder bias check (the last item in the taxi checklist) and applied the parking brake without verbalizing the parking brake or rudder bias actions because the copilot was on the phone. After the pilot lined up on the runway and shortly before takeoff, the flight crew discussed and corrected a NO TAKEOFF annunciation for an unsafe trim setting. After the copilot confirmed takeoff power was set, he stated that the airplane was barely moving then said that something was not right, to which the pilot replied the airplane was rolling and to call the airspeeds. About 16 seconds later, the pilot indicated that the airplane was using more runway than he expected then made callouts for takeoff-decision speed and rotation speed. The pilot stated that he pulled the yoke back twice, but the airplane did not lift off. Shortly after, the pilot applied full thrust reversers and maximum braking, then the airplane exited the departure end of the runway, impacted a ditch, and came to rest 1,990 ft beyond the departure end of the runway. The airplane was destroyed by a postcrash fire, and the crew and passengers were not injured.", "probable_cause": "The pilot’s failure to release the parking brake before attempting to initiate the takeoff, which produced an unexpected retarding force and airplane nose down pitching moment. Also causal was the flight crew’s delayed decision to abort the takeoff, which resulted in a runway excursion. Contributing to the accident was the lack of a NO TAKEOFF annunciation warning that the parking brake was engaged, and lack of a checklist item to ensure the parking brake was fully released immediately before takeoff."}