{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130j-30-hercules-amarah", "date": "Feb 12, 2007 at 2010 LT", "type": "Lockheed C-130 Hercules", "operator": "Royal-Air-Force-4", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "5460", "yom": 1999, "flight_number": null, "city": "Amarah", "zone": "Maysān (ميسان)", "country": "Iraq", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 58, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew of ZH876 were tasked to fly a routine roulement of troops to a Tactical Landing Zone (TLZ) in Maysān province, Iraq. Weather at the TLZ was good, with a visibility of 25 km, no significant cloud and a light surface wind. The flight to the TLZ was routine and at approx 17:00 UTC the Hercules began to make its approach to the TLZ. Comms had already been established between ZH876 and the Tactical Air Traffic Controller (Tac ATC) at the TLZ, and the aircraft was subsequently cleared to land. An uneventful approach followed flown by the copilot. At 17:10:15 UTC, as the aircraft was about to touchdown at the TLZ, the crew experienced a load bang and a bright flash. The flash temporarily blinded the flight-deck crew. Virtually simultaneously, the aircraft touched down. The first flash was followed, a second later, by another flash and louder bang. The aircraft slewed off the left-hand side of the runway. The captain took over control of the aircraft. On regaining vision, the captain tried to steer the aircraft back onto the runway. However, the crew became aware of a fire on the port side, which was confirmed as a wing fire. The captain brought the aircraft to an immediate halt. The aircraft came to rest 50 m from the runway edge, some 700 m after touchdown. The aircraft sustained substantial damage and it was decided to blow up the plane because the damage was too difficult to repair and there was also a potential risk that anti-Iraqi forces might obtain information on specialist equipment.", "probable_cause": "The evidence recovered from the incident site revealed that two IED [improvised explosive device] arrays had exploded in the near vicinity of ZH876's touchdown point at the TLZ. The Board quickly ruled out aircraft systems failure and other possible causes. The Board concluded that this deliberate enemy action was the sole cause of the damage sustained to ZH876 in this incident. The Board further concluded that there was a lack of understanding, by the Force Protection personnel, of TLZ sweep procedures and they had not received the appropriate training. This meant that the sweep procedures applied at the TLZ were inadequate to discover the IED arrays."}