{"url": "https://www.baaa-acro.com/crash/crash-avro-696-shackleton-near-tarbert-10-killed", "date": "Apr 30, 1990 at 1137 LT", "type": "Avro 696 Shackleton", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Mountains", "schedule": "Lossiemouth - Benbecula", "msn": null, "yom": 1954, "flight_number": null, "city": "Tarbert (Harris Island)", "zone": "Hebrides Islands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the morning of 30 April 1990, the crew of Shackleton AEW2 WR965 took off from RAF Lossiemouth to participate in a maritime exercise in the Benbecula area to the west of mainland Scotland. The exercise was to be in two parts with a time interval between. To make most economical use of the Shackleton's flying time it was intended to utilise the time interval to undertake some continuation training for which the crew had appropriate authorisation. Although the weather was forecast to be generally clear in the aircraft's operating area there were areas of low cloud and poor visibility over Scottish coastal areas. The first part of the sortie was completed without incident and at 09:45 UTC the crew took the opportunity to participate with a Tornado F3 in mutual training which required the Shackleton's radar to be set to standby/off. After completing this training, the crew commenced their own continuation training which was to include a visual approach to Benbecula airfield. The crew contacted Benbecula Air Traffic Control (ATC) at 10:25 UTC requesting permission for an approach, stating that they were about 20 miles west of the airfield; permission was given and Benbecula ATC passed their actual weather to the crew. Subsequent investigation determined, however, that the aircraft was actually 15 miles north of the position which it had reported at this time. At 10:30 two RAF personnel saw the Shackleton orbiting an island some 12 miles to the north of Benbecula airfield, and at 10:34 the Shackleton crew called Benbecula ATC stating that the weather was not sufficiently good for an approach and that they were turning right and climbing. At around 10:37 it struck the ground about 30 ft below the summit of an 823 ft hill on the Isle of Harris. Reliable evidence indicates that at that time and in that vicinity the cloudbase was 200 ft above mean sea level, with cloud tops at 3000 ft. At impact, the aircraft was in controlled flight with all four engines developing cruise power.\r\nCrew (28th Squadron):\r\nW/Cdr Stephen Roncoroni,\r\nW/Cdr Chas Wrighton,\r\nF/O Colin Burns,\r\nS/L Jerry Lane,\r\nF/Lt Al Campbell,\r\nF/Lt Keith Forbes,\r\nM/O Roger Scutt,\r\nF/Sgt Rick Ricketts,\r\nSgt Graham Miller,\r\nCpl Stuart Bolton.", "probable_cause": "The Board of Inquiry concluded that the accident was caused because the aircraft was flown below a safe altitude in unsuitable weather conditions; the Board were unable to determine the reason for this."}