{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-500b-tulsa-1-killed", "date": "Jan 16, 2008 at 2243 LT", "type": "Rockwell Aero Commander 500", "operator": "Central%20Air%20Southwest", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tulsa - Oklahoma City", "msn": "500-1118-68", "yom": 1961, "flight_number": null, "city": "Tulsa", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4373, "captain_hours_type": 695, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17888, "circumstances": "The commercial pilot departed on a night instrument flight rules flight in actual instrument meteorological in-flight conditions. Less than 2 minutes after the airplane departed the airport, the controller observed the airplane in a right turn and instructed the pilot to report his altitude. The pilot responded he thought he was at 3,500 feet and he thought he had lost the gyros. The pilot said he was trying to level out, and when the controller informed the pilot he observed the airplane on radar making a 360-degree right turn , the pilot said \"roger.\" Three minutes and 23 seconds after departure the pilot said \"yeah, I'm having some trouble right now\" and there were no further radio communications from the flight. The on scene investigation disclosed that both wings and the tail section had separated from the airframe. All fractures of the wing and wing skin were typical of ductile overload with no evidence of preexisting failures such as fatigue or stress-corrosion. The deformation of the wings indicated an upward failure due to positive loading. No anomalies were noted with the gyro instruments, engine assembly or accessories", "probable_cause": "The pilot's loss of control due to spatial disorientation and the pilot exceeding the design/stress limits of the aircraft. Factors contributing to the accident were the pilot's reported gyro problem, the dark night conditions , and prevailing instrument meteorological conditions.\n"}