{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-21-islander-near-cascalho-3-killed", "date": "Jan 11, 2001 at 1440 LT", "type": "Britten-Norman Islander", "operator": "LASA - Engenharia e Prospecções", "flight_phase": "Flight", "flight_type": "Geographical / Geophysical / Scientific", "survivors": "No", "site": "Mountains", "schedule": "Paramirim - Paramirim", "msn": "696", "yom": 1973, "flight_number": null, "city": "Cascalho", "zone": "Bahia", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3886, "captain_hours_type": 3263, "copilot_hours": 6088, "copilot_hours_type": 23, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Paramirim Airport at 1400LT on a 3-hours ore prospecting flight, carrying two pilots and one passenger. En route, weather conditions worsened and the crew apparently decided to return to Paramerim when he encountered atmospheric turbulences and windshear. The aircraft stalled and crashed in a mountainous area. After 17 hours without contact, the aircraft was declared as missing. Its wreckage was found the following day at 1800LT near the summit of Mt Serra Preta, near Cascalho, about 27 km east of Paramirim. The aircraft was destroyed and all three occupants were killed. ", "probable_cause": "Loss of control after the crew encountered adverse weather conditions with low level windshear. The following contributing factors were identified:\r\n- Although the operations were carried out in accordance with the regulations in force, the pilots regularly exceeded the flight times and this type of prospecting mission is extremely tiring insofar as it is systematically operated at low altitude without the aid of the autopilot system in a high outside temperature environment, leading to greater than normal physical wear of the pilots,\r\n- Poor flight preparation regarding the probable evolution of the weather conditions,\r\n- The accident occurred in low visibility as the crew was presumably trying to return to his base,\r\n- The accident occurred outside of the intended flight area,\r\n- The flight, which was scheduled to take three hours, was started with an aircraft whose tanks were full (seven hours autonomy), unnecessarily increasing its weight,\r\n- Poor flight planning,\r\n- Non-compliance with standard operator procedures on part of the crew who positioned the flaps in an inappropriate angle to fly over obstacles,\r\n- In the days preceding the accident, two incidents occurred at Paramirim Airport involving the captain, and neither of these two events had been reported to the management of the operator, indicating the absence of an effective control of operations,\r\n- The supervision of crew schedules was poor,\r\n- The operator wanted this type of flight to be carried out in the morning in order to avoid atmospheric turbulence specific to the region, but the crew decided to take off in the afternoon when the conditions were not favorable."}