{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-stansted-6-killed", "date": "Oct 20, 1987 at 1200 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Hastingwood Hotels", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Stansted – Tatenhill", "msn": "421B-0828", "yom": 1974, "flight_number": null, "city": "Stansted", "zone": "Essex", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 500, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on an IFR flight from Stansted Airport to Tatenhill Aerodrome with a pilot and five passengers on board. Shortly after takeoff from runway 23 at Stansted the pilot reported that he had a problem and wished to return. Stansted ATC cleared him for a left hand circuit and return. As the aircraft turned left hand towards a downwind leg the left bank was observed to suddenly increase and it turned onto its back before descending vertically and crashing into a wooded area to the southwest of the airport. Immediately after the impact there was a fierce fire; all the occupants were killed instantaneously. ", "probable_cause": "Examination confirmed that the right hand propeller and engine has been delivering power normally before impact, but that the left propeller and engine had not been producing power. The left engine drive fuel pump had also suffered fire damage, and the rubber seals were leaking. Upon disassembly it was found that the aneroid unit within the pump was corroded and could not have functioned. The possible adverse effects of the corrosion within the fuel pump aneroid unit to engine performance were investigated using another similar engine in a test facility. It was found that this condition caused the engine to misfire and run roughly at high power settings, but that the engine ran normally at low power. The tests, whilst not totally representative of the conditions on the accident flight, showed no tendency for the engine to fail completely, although sudden full throttle applications grossly aggravated the rough running. Thus no reason for the apparent marked power loss associated with the left engine fitted to G-HAST has been established.  "}