{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-118a-liftmaster-norwalk-42-killed", "date": "Feb 1, 1958 at 1913 LT", "type": "Douglas C-118 Liftmaster", "operator": "United%20States%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "No", "site": "City", "schedule": "Long Beach – McGuire", "msn": "44648", "yom": 1955, "flight_number": "USAF30W/02", "city": "Norwalk", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 35, "pax_fatalities": 35, "other_fatalities": 1, "total_fatalities": 42, "captain_hours": 7819, "captain_hours_type": 1448, "copilot_hours": 701, "copilot_hours_type": 439, "aircraft_hours": null, "circumstances": "The four engine aircraft departed Long Beach Airport at 1908LT bound for McGuire AFB, New Jersey, with 35 passengers and a crew of six on board. Shortly after takeoff, the pilot was cleared to climb to the assigned altitude of 17,000 feet. About five minutes later, while climbing to an altitude of 3,000 feet, the airplane collided with a USN Lockheed P2V-5F Neptune registered 127723. Carrying eight crew members, the Neptune has taken off from Los Alamitos NAS and was completing a local training mission. Following the collision, both aircraft went out of control, dove into the ground and crashed in Norwalk. The Liftmaster crashed on several building and a fuel station, killing all 41 occupants and one woman on the ground. The Neptune crashed in a stone-pit located about 2.5 miles north of the C-118 crash site. Six crew members were killed while two others were seriously injured. The accident occurred by night but in good weather conditions with a visibility above 15 miles. ", "probable_cause": "It was determined that the collision occurred in an uncontrolled area. Both crews were considered as co-responsible of the accident as they failed to take the appropriate measures to avoid each other and to pay attention to potential traffic. The crew of the C-118 was blamed not giving the priority to the Neptune which was flying to his right. "}