{"url": "https://www.baaa-acro.com/crash/crash-fairchild-f27a-klamath-falls-4-killed", "date": "Mar 10, 1967 at 0503 LT", "type": "Fairchild F27", "operator": "West%20Coast%20Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Klamath Falls – Medford – North Bend – Portland – Seattle", "msn": "73", "yom": 1960, "flight_number": "WC720", "city": "Klamath Falls", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 9271, "captain_hours_type": 4684, "copilot_hours": 1064, "copilot_hours_type": 258, "aircraft_hours": 16202, "circumstances": "Fairchild F-27 N2712 operated on a flight from Klamath Falls to Seattle via Medford, North Bend and Portland. Because snow was falling at Klamath Falls, the aircraft was loaded in the hangar instead of on the ramp. There was some delay in pushing out the aircraft onto the ramp because the tow tractor lost traction in the snow. The aircraft was exposed to the falling snow for about 11 minutes before the plane was able to taxy out to runway 14. A few minutes later, at 05:01 the aircraft took off. During the takeoff roll, after rolling about 1000 feet, the aircraft gradually served to the left. The nose wheel left the ground 600 feet prior to the main gear at a point where the track was half way between the center of the runway and the left row of runway lights. The left main gear was about 12 feet off the left edge of the runway for a distance of 250 feet prior to lift-off. Just after lift-off the aircraft swerved sharply to the right and immediately back to the left. On climb out the aircraft tended to the left, despite several course corrections. After reaching 5250 feet, the altitude dropped again to 4700 feet. The aircraft continued to climb until it crashed on a steep ridge on the northwest slope of Stukel Mountain at an elevation of 5049 feet (1539 m). The F-27 was in a right wing low attitude when this wing contacted the mountain; the aircraft then cartwheeled up the 30° up slope of the mountain. The aircraft was destroyed and all four occupants were killed. ", "probable_cause": "Loss of control due to ice accretion on airframe surfaces. The Board further determines that the pilot should have required that deicing fluid be applied to the aircraft to remove the accumulation of ice and snow prior to takeoff. This had not been done by the appropriate maintenance personnel."}