{"url": "https://www.baaa-acro.com/crash/crash-antonov-12ap-near-omsukchan-11-killed", "date": "Aug 9, 2011 at 1532 LT", "type": "Antonov AN-12", "operator": "Avis-Amur", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Komsomolsk-on-Amur – Magadan – Keperveyem", "msn": "3 3 410 06", "yom": 1963, "flight_number": "LN9209", "city": "Omsukchan", "zone": "Magadan oblast", "country": "Russia", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 15297, "captain_hours_type": 6263, "copilot_hours": 3939, "copilot_hours_type": 3838, "aircraft_hours": 18709, "circumstances": "The four engine aircraft departed Komsomolsk-on-Amur Airport on a cargo service (flight LN9209) to Keperveyem with an intermediate stop in Magadan, carrying 17,43 tons of various goods, two passengers and a crew of nine. The aircraft departed Komsomolsk-on-Amur Airport at 1437LT. At 1520LT, while cruising at an altitude of 7,500 metres about 430 km northeast from his departure point, the crew informed ATC about a fuel leak on the engine n°1, requested a descent to 6,600 metres then the clearance to return to Komsomolsk-on-Amur. After the engine n°1 caught fire, the crew declared an emergency and started an emergency descent. Out of control, the aircraft crashed on the slope of a mountain located about 82 km southwest from Omsukchan. The aircraft disintegrated on impact and the debris were found a day later at an altitude of 1,006 metres. All 11 occupants were killed. This Antonov AN-12 was the oldest model still in commercial service in Russia. ", "probable_cause": "The probable causes of the crash were:\r\nFollowing the inflight shut down of engine number one and feathering of the number one propeller the longitudinal (roll) control of the aircraft was lost due to load-bearing properties of the left wing and possible damage to the left hand aileron control wiring resulting in the aircraft's uncontrolled excessive roll to the left and subsequent impact with terrain. The fire started in the tail section of the #1 engine nacelle and spread forward and onto the wing. The fire was most likely fed by fuel leaking from a fuel line connection to the low pressure fuel pump at engine #1, the fuel most likely ignited due to contact with hot engine parts. Due to the disintegration of the aircraft and fire damage it was not possible to establish the location of fuel leaks and the cause with certainty. The inability of the fire suppression system to extinguish such a fire in its early stages as well as the lack of checklists/guidelines in the aircraft's flight manual for fuel leaks inside the engine nacelle contributed to the delay of more than 2 minutes to shut the engine down. The mountainous terrain underneath the aircraft, low level overcast cloud and lack of time due to continued fire did not permit the crew to select a proper site for an emergency landing."}