{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-giii-aspen-18-killed", "date": "Mar 29, 2001 at 1901 LT", "type": "Gulfstream GIII", "operator": "Avjet", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Burbank – Los Angeles – Aspen", "msn": "303", "yom": 1980, "flight_number": null, "city": "Aspen-Pitkin County-Sardy Field", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 15, "pax_fatalities": 15, "other_fatalities": 0, "total_fatalities": 18, "captain_hours": 9900, "captain_hours_type": 1475, "copilot_hours": 5500, "copilot_hours_type": 913, "aircraft_hours": 7266, "circumstances": "On March 29, 2001, about 1901:57 mountain standard time, a Gulfstream III, N303GA, owned by Airbourne Charter, Inc., and operated by Avjet Corporation of Burbank, California, crashed while on final approach to runway 15 at Aspen-Pitkin County Airport (ASE), Aspen, Colorado. The charter flight had departed Los Angeles International Airport (LAX) about 1711 with 2 pilots, 1 flight attendant, and 15 passengers. The airplane crashed into sloping terrain about 2,400 feet short of the runway threshold. All of the passengers and crew members were killed, and the airplane was destroyed. The flight was being operated on an instrument flight rules (IFR) flight plan under 14 Code of Federal Regulations (CFR) Part 135.", "probable_cause": "The flight crew's operation of the airplane below the minimum descent altitude without an appropriate visual reference for the runway. Contributing to the cause of the accident were the Federal Aviation Administration's (FAA) unclear wording of the March 27, 2001, Notice to Airmen regarding the nighttime restriction for the VOR/DME-C approach to the airport and the FAA's failure to communicate this restriction to the Aspen tower; the inability of the flight crew to adequately see the mountainous terrain because of the darkness and the weather conditions; and the pressure on the captain to land from the charter customer and because of the airplane's delayed departure and the airport's nighttime landing restriction. "}