{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-ticonderoga-2-killed", "date": "Jul 10, 2004 at 0858 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Capital%20Airlines2", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Oxford-Waterbury - Ticonderoga", "msn": "31-8052199", "yom": 1980, "flight_number": null, "city": "Ticonderoga", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 32000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8159, "circumstances": "The airplane, which was not operating on a flight plan, was proceeding in clear skies to an airport where the passenger was joining his wife. After crossing a lake near the destination, the airplane flew over rising terrain, along a saddleback, until it struck a stand of old-growth trees that jutted above new-growth trees. During the last 48 seconds of radar coverage, the airplane climbed 600 feet with no erratic course deviations. From the accident location, the airport would have been about 5 nautical miles off the airplane's right wing. The pilot had 32,000 hours of flight experience. The passenger was under investigation for fraud, and attempted to obtain life insurance prior to the flight. The passenger had also loaned money to the pilot, and was receiving \"flight services\" in lieu of cash payment when the pilot failed to pay back the loan. A .380 caliber pistol magazine was found at the accident site with two rounds of ammunition missing; however, no weapon was located at the site, and no weapon of that caliber was known to be associated with either the pilot or the passenger. Premature ventricular complexes (PVCs) were found on electrocardiograms performed in conjunction with the pilot's airman medical certificate applications in 2002 and 2004. The pilot's autopsy report indicated \"severe calcific... coronary disease, with 90 percent narrowing of the left anterior descending coronary artery and 75 percent narrowing of the right coronary artery.\" Cause of death, for both the pilot and passenger, was listed as \"undetermined.\" The autopsy reports also noted that, \"due to the inability to perform a complete autopsy...of either of the two aircraft occupants, it cannot be determined whether either the pilot or the passenger were alive or dead at the time of the crash.\" Post accident inspection of the airplane disclosed no evidence of any preimpact anomalies.", "probable_cause": "Reason for occurrence undetermined."}