{"url": "https://www.baaa-acro.com/crash/crash-airbus-a300b4-605r-jeddah", "date": "May 1, 2012 at 1449 LT", "type": "Airbus A300-600", "operator": "Saudia", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Madinah - Jeddah", "msn": "747", "yom": 1994, "flight_number": "SV2865", "city": "Jeddah-King Abdulaziz", "zone": "Makkah l-Mukarramah (مكة المكرمة)", "country": "Saudi Arabia", "region": "Asia", "crew_on_board": 10, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9200, "captain_hours_type": null, "copilot_hours": 15957, "copilot_hours_type": null, "aircraft_hours": 54832, "circumstances": "On 1 May 2012, aircraft TC-OAG, an Airbus A300-605R was performing a commercial flight for Saudi Arabian Airlines (SVA) as SVA2865. SVA 2865 departed from Prince Mohammed Bin Abdulaziz International Airport (PMAI) Madinah at 08h50 en-route to the King Abdulaziz International Airport (KAIA) Jeddah, Kingdom of Saudi Arabia. SVA 2865 was on a positioning flight with 10 crew members and no passengers. No discrepancies were noted on this aircraft prior to departure from Madinah. The visibility at Jeddah was good with a few clouds present. During the initial ILS approach to runway 16 Right (16R), while at 8 nautical miles (nm) and 2600 feet (ft), the landing gear handle was lowered. Both main landing gear extended and locked down and, the nose gear doors opened but the nose landing gear did not lower. The Captain who was then the Pilot Monitoring (PM) took over the controls and carried out a missed approach. The First Officer (FO) became the Pilot Monitoring (PM). SVA 2865 was then given an area to the northeast of Jeddah to carry out attempts at lowering the nose gear. The flight crew attempted to manually free fall the nose landing gear at least ten (10) times. The nose landing gear would not lower into the locked position, but the nose gear doors remained open during all those attempts. As a precautionary measure, SVA 2865 performed a fly-by of runway 16R at 500 ft. The air traffic controller confirmed that the nose landing gear (NLG) was not down. SVA 2865 was vectored over the Red Sea to lower the fuel load, thus reducing the landing weight. During this period, the Fire & Rescue  Services (FRS) at Jeddah foamed a portion of runway 16 Left (16L) between taxiway Kilo 5 (K5) and K2. The majority of the FRS vehicles were standing by at the junction of taxiways K4 and K3. SVA 2865 was vectored for an instrument approach for Runway 16L. The Auto Pilot and the Auto Throttle Systems were OFF. The surface winds were from 220° at 12 knots (kt), gusting to 19 kt and the temperature was + 37 Celsius (°C). The flight crew used the \"Landing with Nose Landing Gear Abnormal\" checklist ensuring the aircraft was properly prepared and configured for the approach, the before landing, the flare and the touchdown sequences, including when the aircraft stopped and the necessary procedures to secure the aircraft before evacuation. The aircraft landed on its main landing gear 4000 ft past the threshold of runway 16L. The nose of the aircraft was slowly lowered to the runway with the nose landing gear doors touching the runway within the foamed area 4500 ft from the end of runway 16L. The front of the fuselage then touched the runway within the last portion of foam, 3500 ft from the end of runway 16L. The nose area of the aircraft slid on the runway, where sparks were present until the aircraft came to a full stop 1500 ft prior to the end of runway 16L. As soon as the aircraft passed by the position of the FRS vehicles, the FRS vehicles gave chase to the aircraft and reached it within 30 seconds after it came to a full stop. Although there was no post-crash fire, the FRS personnel applied water and foam to the nose area of the aircraft. All of the crew members were evacuated from the aircraft by ladder provided by the FRS. The crew was taken to the airport clinic as a precautionary measure. All were released the same day. The accident occurred at 14h49 on runway 16L at the KAIA - Jeddah, Kingdom of Saudi Arabia. ", "probable_cause": "Cause related findings: \r\n- The NLG up-lock contained a spring, Part Number GA71102 that was broken as a result of fatigue initiated at the third coil of the spring.\r\n- The spring had been broken for a prolonged period of time, as noted by the spring linear wear marks on the outside area of the spring coils.\r\n- Damage observed on the NLG up-lock resulted from hard contact with the broken spring during normal NLG operation.\r\n- The fracture process of the spring was initiated at the third coil level. At least 6000 cycles of fatigue (number of striations) have been estimated by fatigue striation measurements. The crack on the spring started on the internal surface of the spring which was not shot peened.\r\n- The normal and free fall extensions of the NLG failed due to a mechanical blockage created by the broken spring jammed against the cam."}