{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-moorea-20-killed", "date": "Aug 9, 2007 at 1201 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Air%20Moorea", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Moorea – Papeete", "msn": "608", "yom": 1979, "flight_number": "QE1121", "city": "Moorea", "zone": "Tahiti", "country": "French Polynesia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 19, "pax_fatalities": 19, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": 3514, "captain_hours_type": 298, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 30833, "circumstances": "On Thursday 9 August 2007, the DHC-6 aeroplane registered F-OIQI was scheduled to fly a public transport flight (QE1121) between Moorea and Tahiti Faa’a with a pilot and 19 passengers on board. The flight, with an average duration of 7 minutes, is performed under VFR at a planned cruise altitude of 600 feet. The following information is derived from the on-board audio recording and witness statements. At 21 h 53 min 22, startup was authorised. The pilot made the safety announcement in English and in French: “Ladies and Gentlemen, hello and welcome on board. Please fasten your seatbelts”. At 21 h 57 min 19, the air traffic controller cleared the aeroplane to taxi towards holding point Bravo on runway 12. At 21 h 58 min 10, the aeroplane was cleared to line up. It taxied up the runway and lined up at the level of the second taxiway. At 22 h 00 min 06, the aeroplane was cleared for takeoff. Six seconds later the engines were powered up. At 22 h 00 min 58, the pilot retracted the flaps. At 22 h 01 min 07, propeller speed was reduced. At 22 h 01 min 09 the pilot uttered an expression of surprise. Two GPWS warnings sounded, propeller speed increased and four further GPWS warnings sounded. The aeroplane struck the surface of the sea at 22 h 01 min 20. One minute and eight seconds elapsed between engine power-up and the end of the audio recording. Fourteen bodies were recovered during the rescue operations. Some aeroplane debris, including parts of the right main gear and seat cushions were recovered by fishermen and the rescue team. Some days later, at a depth of seven hundred metres, a fifteenth body was recovered during operations to recover the flight recorder, both engines, the instrument panel, the front part of the cockpit including engine and flaps controls, the flaps jackscrews and the tail section. It was noted that the rudder and elevator control cables were broken off in their forward parts and that the elevator pitch-up control cable had, in its aft part, a second failure whose appearance was different from that observed on the other failures that were examined.", "probable_cause": "The accident was caused by the loss of airplane pitch control following the failure, at a low height, of the elevator pitch-up control cable at the time the flaps were retracted. This failure was due to the following series of phenomena:\r\n- Significant wear on the cable in line with a cable guide;\r\n- An external phenomenon, most likely jet blast, which caused the failure of several strands;\r\n- The failure of the last strand or strands under in-flight loads on the elevator control system. \r\nThe following factors may have contributed to the accident:\r\n- The absence of information and training for pilots on a loss of pitch control;\r\n- The operator’s failure to carry out some special inspections;\r\n- The failure by the manufacturer and the airworthiness authority to fully take into account the wear phenomenon;\r\n- The failure by the airworthiness authorities, airport authorities and operators to fully take into account the risks associated with jet blast;\r\n- The rules for replacement of stainless steel cables on a calendar basis, without taking into account the activity of the airplane in relation to its type of operation. "}