{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-749c-79-12-constellation-jacksonville-17-killed", "date": "Dec 21, 1955 at 0343 LT", "type": "Lockheed L-749 Constellation", "operator": "Eastern-Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Miami – Jacksonville – Boston", "msn": "2533", "yom": 1947, "flight_number": "EA642", "city": "Jacksonville", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 17, "captain_hours": 12052, "captain_hours_type": 2501, "copilot_hours": 9522, "copilot_hours_type": 1360, "aircraft_hours": 29941, "circumstances": "Flight 642 originated at Miami, Florida, with its destination Boston, Massachusetts; Jacksonville, Florida, was included as an intermediate stop. The captain was briefed by the company forecaster on the en route weather and terminal forecasts, and following the briefing the flight was dispatched to Jacksonville on an IFR (Instrument Flight Rules) flight plan. This plan specified a flight to be made via Victor Airway 3 at a Cruising altitude of 11,000 feet. The crew consisted of Captain Thomas Francis McBrien, Pilot John Jay Rinyu, Flight Engineer Charles Calvin Devine and Flight Attendants Emma Elizabeth Williams and Clara Dorothea Rioseco. There were 12 passengers on board. Flight 642 was scheduled to depart Miami International Airport at 2340, December 20, but because of the late arrival of an inbound flight using the aircraft involved departure was not made until 0212, December 21. According to company records the gross weight of the aircraft at the time of departure was 85,944 pounds, which was under the allowable takeoff gross weight of 107,000 pounds; the load was properly distributed. Routine en route radio reports were made and at 0315 the flight reported over Daytona Beach at 11,000 feet, estimating Jacksonville at 0336. This report was made to the company's Jacksonville station and at this time the flight was given the Jacksonville 0248 U. S. Weather Bureau special report: \"Thin obscuration, 2 miles visibility; ground fog; wind north-northwest 6 miles per hour; 30 percent of sky obscured.\" After this message was acknowledged, the flight was given the following clearance: \"Jacksonville air route traffic control clears Eastern Air Lines Flight 62 to Jacksonville middle marker ILS, cross middle marker IlS at 2.500 feet, maintain 2,500 feet until further advised. Contact Jacksonville approach control when over Sunbeam Intersection.\" The clearance was acknowledged. Flight 642 contacted Jacksonville approach control when over Sunbeam Intersection (16 miles SSE of Imeson Airport) at 0331 and was cleared for an ILS approach to runway 5. At the same time the Jacksonville weather was given as: \"Partial obscurement; visibility one-half rule; altimeter 30.18.\" Immediately following this transmittal another message was given the flight, \"Coming out with indefinite 300 obscurement now one-half with fog.\" (Eastern Air Lines' Constellation minimums for ILS approaches at Jacksonville, day or might are ceiling 200 feet, visibility one-half mile). After acknowledging this weather information, Flight 642 reported leaving. Sunbeam at 2,500 feet. Following a later query from the flight, approach control advised that there was no other known traffic in the area, and requested the flight to report when over the outer marker inbound. Flight 642 reported over the outer marker inbound and was cleared to land. Shortly thereafter the tower controller observed a large flash in the vicinity of the ILS middle marker. Calls to Flight 642 were not acknowledged and an emergency was declared by the controller. It was subsequently learned that N112A had crashed approximately six-tenths of a mile southwest of the threshold of runway 5. Investigation disclosed the main portion of the wreckage to be 212 feet northwest of the ILS middle marker and 3,486 feet southwest of the threshold of runway 5. The time of the accident was established as 0343LT. First impact of the aircraft was with the top of a small pine tree approximately 200 feet below the ILS glide path, 260 feet to the left of the extended centerline of the runway, 4,000 feet from the threshold of runway 5, and 420 feet southwest of the middle marker. This was followed by striking a 50-foot oak tree, the upper 20 feet of which was sheared off. The aircraft settled toward the ground, striking other large trees which disintegrated both wings and a portion of the empennage. Ground contact was on a heading approximately 55 degrees magnetic. The distance from the first tree struck to the farthest piece of wreckage was 801 feet. Explosion and fire occurred immediately upon impact.", "probable_cause": "The Board determines that the probable cause of this accident was that during the final portion of an IIS approach the pilot, for reasons not determinable, either permitted or caused the aircraft to deviate to the left of course and descend below the glide path to an altitude too low to clear ground obstructions. The following findings were reported:\r\n- No evidence of failure of the airframe, power plants, controls, or other components was found,\r\n- The weather at the airport was marginal with local fog and restricted visibility; however at last report the weather vas above the carrier's minimums,\r\n- Ground navigational facilities in the Jacksonville area, including the ILS system, functioned normally during the approach,\r\n- There was no operating difficulty reported by the crew,\r\n- There were no other known aircraft in the immediate area,\r\n- While on final approach, the aircraft descended considerably below the glide path and below the minimum altitude before reaching the middle marker,\r\n- Trees were struck six-tenths of a mile from the runway threshold approximately 200 feet below the glide path and 260 feet to the left of the extended centerline of the runway."}