{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b60-duke-edwards-2-killed", "date": "Dec 15, 2010 at 1602 LT", "type": "Beechcraft 60 Duke", "operator": "William B. Harris", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Pueblo - Eagle", "msn": "P-534", "yom": 1980, "flight_number": null, "city": "Edwards", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1300, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2456, "circumstances": "The air traffic controller had cleared the flight for the instrument approach and the pilot acknowledged the clearance. Radar data depicted the airplane turning toward the final approach course and then continuing the turn 180 degrees before disappearing from radar at 11,200 feet. The wreckage was located at an elevation of 10,725 feet. Examination of the terrain and ground scars indicated the airplane impacted terrain in a nose down, right turn. Impact forces and a postimpact fire resulted in substantial damage to the airplane. Examination of the airplane, engines, and de-icing systems revealed no mechanical anomalies. Weather at the time of the accident was depicted as overcast skies, reduced visibility, with snow showers in the area. An icing probability chart depicted a probability of moderate rime and mixed icing. Both AIRMETs and SIGMENTs advised of moderate icing between the freezing level and flight level 220 and occasional severe rime and mixed icing below 16,000 feet. During his weather briefing, the pilot stated that he was aware of the adverse weather conditions.", "probable_cause": "Controlled flight into terrain, while on an instrument approach in instrument meteorological conditions, for undetermined reasons."}