{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh106-comet-4b-ankara-27-killed", "date": "Dec 21, 1961 at 2343 LT", "type": "De Havilland DH.106 Comet", "operator": "BEA", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "London – Rome – Athens – Istanbul – Ankara – Nicosia – Tel Aviv", "msn": "6456", "yom": 1961, "flight_number": "BE226", "city": "Ankara-Esenboğa", "zone": "Central Anatolia Region (İç Anadolu Bölgesi)", "country": "Turkey", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 27, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 27, "captain_hours": 13240, "captain_hours_type": 785, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a scheduled flight from London to Rome, Athens, Istanbul, Ankara, Nicosia and Tel Aviv. From Istanbul the flight was operated by British European Airways on behalf of Cyprus Airways. The operating crew, employed by BEA, consisted of a captain and two first officers. Also aboard were four cabin staff employed by Cyprus Airways and 27 passengers. The trip to Ankara was normal. The time between landing and starting engines at Ankara was 46 minutes during which light snow was falling. (At take-off the aircraft had a light covering of snow on the upper surface of its wings, however, this deposit had no bearing on the accident). The radio-telephony tape recording showed that the aircraft taxied out along the short taxiway, then back-tracked up the runway to its take-off position on runway 21 at the intersection with the longer taxiway. The runway length available from this position was 9,027 feet. Take-off weight was 53 465 kg, i.e. 18 185 kg below maximum permissible weight or 1 085 kg below the regulated take-off weight. The takeoff run as to distance and time was quite normal, as also were rotation and unstick. The first abnormality occurred a second or two after unstick when the aircraft rapidly assumed an excessively steep climbing angle. One witness put the angle achieved as about twice the normal, another as 45° to 50°. There was also evidence from witnesses of a wing drop and of variations in the engine noise during this climb. The aircraft stalled with the left wing down at a height of about 450 ft then sank to the ground in a relatively flat attitude. The accident site was 1 600 m and on a bearing of 214° from Esenboğa Tower. The accident occurred at 2343LT. The aircraft was almost completely destroyed by impact and fire. All 7 crew and 20 passengers were killed. Six passengers were seriously injured.", "probable_cause": "The probable cause of the accident was the obstruction of the pitch pointer In the captain's director horizon which led him to make an excessively steep climb immediately following unstick."}