{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-62-moscow-61-killed", "date": "Nov 28, 1972 at 1951 LT", "type": "Douglas DC-8", "operator": "Japan%20Airlines-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Copenhagen - Moscow - Tokyo", "msn": "46057", "yom": 1969, "flight_number": "JL446", "city": "Moscow-Sheremetyevo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 14, "crew_fatalities": 9, "pax_on_board": 62, "pax_fatalities": 52, "other_fatalities": 0, "total_fatalities": 61, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A McDonnell Douglas DC-8-62 passenger plane, JA8040, was destroyed when it crashed on takeoff from Moscow's -Sheremetyevo Airport (SVO), Russia. Five of the 14 crew members and ten of the 62 passengers survived the accident. JAL flight JL446 was a scheduled international flight from Copenhagen (CPH), Denmark to Tokyo-Haneda (HND), Japan with an en route stop in Moscow. The flight to Moscow was uneventful and the airplane landed at 18:17. After servicing of the aircraft startup and taxi clearance was received at 19:38. JL446 was cleared for takeoff from runway 25 at 19:49. On takeoff the DC-8 climbed to 100 m with a supercritical angle of attack and lost height abruptly. It hit the ground and burst into flames.", "probable_cause": "The cause of the disaster to aircraft DC-8-62 JA-8040 resided in the fact that during take-off and following attainment of the safety speed V2, the crew put the aircraft into a supercritical angle of attack which resulted in loss of speed and altitude. The aircraft's assumption of supercritical angles of attack was the consequence of one of the following circumstances:\r\n- Inadvertent extension of the spoilers in flight, leading to a fall in the maximum value of the lift ratio and an increase in drag;\r\n- Loss of control of the aircraft by the crew in conditions associated with malfunctioning of the No. 1 or No. 2 engine consequent upon possible ice formation on the engine intake at a time when the de-icing system was switched off.\r\nThe anomalies in the functioning of the engines observed by the crew and other witnesses may have arisen after the aircraft had assumed a supercritical angle of attack with the spoilers extended."}