{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-e20-kilimanjaro", "date": "Nov 17, 2004 at 0809 LT", "type": "Let L-410", "operator": "Precisionair2", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kilimanjaro - Kilimanjaro", "msn": "92 27 11", "yom": 1992, "flight_number": null, "city": "Kilimanjaro", "zone": "Kilimanjaro Region", "country": "Tanzania", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14000, "captain_hours_type": 4000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a base training flight at Kilimanjaro International Airport. At 0410 hrs it was cleared to the local flying area for upper air works, followed by VOR/ILS approaches to runway 09 via NDB KB. 5H-PAC took off and proceeded to the local flying area where the crew members did upper air works for about 30 minutes. According to the commander, these included clean and dirty stalls, level flights at different speeds, 45 degree turns left and right and exercises on unusual attitudes. Subsequent to these they returned to the airport via NDB KB for ILS approach to runway 09. They carried out a missed approach and proceeded to join RH circuits for touch-and-go operations on runway 09. The last operations before the accident was simulated engine failure after take off followed by single engine overshoot, this time using runway 27. This was approved and the commander was reminded that the surface wind was 090 degrees 08 knots. The aircraft turned left and positioned on right base for runway 27. It was subsequently given a landing clearance. The weather at the material time was fine with temperature 23 degrees Celsius. The controller, who was handling the flight, said that the final approach was perfect. The landing gear was down. The aircraft passed the threshold of runway 27 at about 70 feet above the ground and continued to flare on a straight and level attitude with the landing gear retracted. It continued in this attitude for a distance of about one and a half kilometers down the runway subsequent to which it drifted off the runway to the right. The controller asked the pilot to explain his intentions. There was no reply. Instead, the aircraft was observed to yaw violently as it drifted further to the right. Moments later, it impacted the ground on a grass hedge and skidded along the width of taxiway Y before it came to rest. The commander said that he repossessed the controls immediately when the aircraft started yawing but there was no time effect recovery. There was fuel spillage but fire did not break out. The two pilots, who had not put on their shoulder straps, sustained facial injuries.", "probable_cause": "Given that the aircraft was practicing a single engine overshoot, the pilot appears to have descended too low for safe recovery. The landing gear should also have been retracted after power had been applied and positive climb achieved. The standard single engine overshoot procedure was not applied."}