{"url": "https://www.baaa-acro.com/crash/crash-cessna-560xl-citation-xls-port-harcourt", "date": "Jul 14, 2011 at 1953 LT", "type": "Cessna 560XLS Citation Excel", "operator": "Bristow%20Helicopters", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lagos – Port Harcourt", "msn": "560-5830", "yom": 2008, "flight_number": null, "city": "Port Harcourt", "zone": "Rivers", "country": "Nigeria", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11751, "captain_hours_type": 684, "copilot_hours": 13302, "copilot_hours_type": 612, "aircraft_hours": 982, "circumstances": "5N-BMM departed Lagos at 1856 hrs for Port Harcourt on an Instrument Flight Rules (IFR) and estimated Port Harcourt at 1940 hrs. The aircraft was cleared to maintain FL330. The aircraft’s first contact with Port Harcourt was at 1914 hrs. The pilot reported maintaining FL330 with six souls onboard, four hours fuel endurance and estimating POT VOR at 1940hrs. The aircraft was cleared to POT, to maintain FL330 with no delay expected for ILS Approach Runway 21, QNH 1011 and to report when released by Lagos. At 1921 hrs the pilot reported 100 NM to POT and requested for descent. The aircraft was cleared to descend to FL150. At 1927 hrs the pilot requested for further descent and was cleared to 3,300 feet on QNH 1011 but the pilot acknowledged 3500 feet. At 1931 hrs the aircraft was re-cleared to FL090 initially due to departing traffic on Runway 03. At 1934 hrs 5N-BMM reported maintaining FL090 and was re-cleared to FL050. The aircraft was re-cleared to 2,000 feet on QNH 1011 at 1936 hrs and cleared for the straight-in ILS Approach Runway 21 and to report on the localizer. At 1947 hrs the pilot reported final for Runway 21 and was asked to contact Tower on 119.2 and the Tower asked 5N-BMM to report on glide slope Runway 21. At 1950 hrs the Tower asked 5N-BMM to confirm on the glide slope and the crew confirmed “Charlie, we have three miles to run”. The Tower cleared 5N-BMM to land with surface wind calm but to exercise caution since the Runway surface was wet and 5N-BMM responded “wind calm”. At 1952:26 hrs the auto voice callout \"minimums minimums” alerted the crew. At 1952:40 hrs the pilot flying (PF) said \"I am not on the centerline\". At 1952:48 hrs he said \"I can't see down\". At 1952:55 hrs the pilot monitoring (PM) said to the pilot flying; \" I am telling you to go down\" and the pilot flying said \" I will go down\", five seconds later the aircraft crashed. The crew exited the aircraft without accomplishing the Emergency Evacuation Checklist and therefore left the right engine running for about 28 minutes after the crash. The Fire Service eventually used their water hose to shutdown the running engine. At 19:54 hrs the Tower called 5N-BMM to pass on the landing time as 19:53 hrs, but no response from 5N-BMM. There was no indication that the aircraft was taxing on the Runway because it was dark and no light was visible hence the need to alert the Fire personnel. The watch room was asked to give the Tower information, which they could not give since they do not have a two – way contact with the Fire trucks. The Tower could not raise the Fire truck since there was no two - way communication between them; however, the Fire truck was later cleared to proceed to the Runway as the Tower could not ascertain the position of the aircraft. The aircraft was actually turned 90° because of the big culvert that held the right wing and made the aircraft spin and turned 90o facing the runway, two meters from the active runway, the culvert was uprooted due to the aircraft impact forces. The wheel broke off because of the gully that runs parallel to the runway.", "probable_cause": "The decision of the pilot to continue the approach without the required visual references.\r\nContributory Factors:\r\n- Poor crew coordination (CRM),\r\n- Pairing two captains together,\r\n- The weather was marginal."}