{"url": "https://www.baaa-acro.com/crash/crash-airspeed-as10-oxford-ii-marston-moor", "date": "Apr 14, 1944 at 2310 LT", "type": "Airspeed AS.10 Oxford", "operator": "USAAF", "flight_phase": "Landing (descent or approach)", "flight_type": "Supply", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Balderton – Hooten Park – Burtonwood", "msn": "2475", "yom": null, "flight_number": null, "city": "Preston", "zone": "Lancashire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft left RAF Balderton about 2115LT with the intention of proceeding to Burtonwood via Hooten Park for ferrying parts. At the ETA Hooten Park 2150 dusk had fallen and the visibility was very poor. The pilot was unable to pinpoint himself and accordingly set course to the East, intending to return to Balderton. About five minutes before ETA Balderton, he commenced signalling on the downward identification light. At Marston Moor, the night flying program having concluded at 2210LT, the DREM lighting system was switched off with the exception of the perimeter track lighting and obstruction lighting on high buildings such as hangars, etc. At 2257LT the duty control officer received a telephone message to the effect that an aircraft was circling and flashing SOS. Full Drem lighting, including the outer circle was immediately switched on for any emergency landing. Very soon the airfield was illuminated just to the starboard of the aircraft, then at 4,000 feet. He circled twice to lose height and then proceeded to carry out a normal approach and landing. He was on approach at an IAS of 90 mph and apparently, according to instruments, at an indicated altitude of 500 feet, when the aircraft struck a tree. It immediately descended heavily to the ground and burned, causing major injuries to the three occupants. Weather: cloud 5/10 strato-cumulus up to 2,000 feet, ceiling cloud above 101/0, intermittent rain becoming continuous, visibility four miles. \nSource: Norman Malayney.", "probable_cause": null}