{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950-dannevirke", "date": "Feb 25, 1997 at 0926 LT", "type": "Fletcher FU-24", "operator": "South Otago Aerial Topdressing Co-op Ltd", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "Yes", "site": "Plain, Valley", "schedule": null, "msn": "206", "yom": 1975, "flight_number": null, "city": "Dannevirke", "zone": "Manawatu-Wanganui (Horizons Regional Council)", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The topdressing operation had resumed after a break caused by weather deterioration associated with a weakening frontal system in the immediate area. Mist and low cloud had cleared, and the wind had picked up. The pilot was sowing into a narrow, rising valley. It was the sixth run over the same terrain, after an increase in payload. The pilot initially encountered lift then heavy sink. Unable to reverse course within the confines of the narrow valley, and despite the application of full power, 20 degrees of flap and an attempt to dump the payload, he failed to establish a climb. The aircraft stalled in a lefthand turn and impacted the valley side. The aircraft struck left wing first, removing the outer wing section. It then hit the ground flat but turning anti-clockwise and skidded tail first to a halt. The hopper mouth was torn loose, and this and the nose leg disrupted the cockpit floor, trapping the pilot's legs within the cockpit area and inflicting serious injuries. The pilot was wearing full restraint harness and a protective helmet, which undoubtedly saved him from further injury. He suffered some post-impact disorientation, but fortunately there was no post-crash fire. The Police and Fire Services in attendance were unaware of the actions required to secure the aircraft fuel and electrical systems.", "probable_cause": null}