{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-440-metropolitan-angelholm-31-killed", "date": "Nov 20, 1964 at 2114 LT", "type": "Convair CV-440 Metropolitan", "operator": "Linjeflyg-1", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Stockholm – Hultsfred – Halmstad – Ängelholm", "msn": "195", "yom": 1954, "flight_number": "LF267", "city": "Ängelholm", "zone": "Skåne", "country": "Sweden", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 39, "pax_fatalities": 29, "other_fatalities": 0, "total_fatalities": 31, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane departed Stockholm-Bromma Airport at 1946LT bound for Ängelholm-Helsinborg Airport with intermediate stops at Hultsfred and Halmstad. Due to poor weather en route, the crew was instructed by ATC to fly directly to Ängelholm and continued at an altitude of 12,000 feet. On final approach by night, the aircraft was off course and too low. In a relative flat attitude, the airplane struck the ground with its starboard wing tip and landing gear. Eighty meters further, it collided with the overhead lines of the West Coast Railway Line, knocking off two concrete posts. It continued for another 170 meters, struck again the ground, went upside down and slid for 150 meters before coming to rest. Both pilots and 29 passengers were killed while two other crew members and 10 passengers were injured, some of them seriously. The aircraft was totally destroyed. ", "probable_cause": "The cause of the accident was in all probability that during the approach in instrument conditions the crew abandoned the set procedure and began the landing too soon. The reason for this must have been that the crew allowed themselves to be misled by an arrangement of lights peculiar to the airfield with which, apart from certain information received during the approach, they were not acquainted."}