{"url": "https://www.baaa-acro.com/crash/crash-antonov-26-near-zyrianka", "date": "Nov 6, 1994 at 1257 LT", "type": "Antonov AN-26", "operator": "Kosmos & Transport", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Voronezh – Kurgan – Krasnoyarsk – Lensk – Susuman", "msn": "08 02", "yom": 1978, "flight_number": "KP9390", "city": "Zyrianka", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12364, "circumstances": "The aircraft was engaged in a cargo flight from Voronezh to Susuman with intermediate stops in Kurgan, Krasnoyarsk and Lensk, carrying four passengers, five crew members and a load of 3 tons of sausages and cheese. After departure from Kurgan Airport, a fuel pump failed and the crew decided to divert to Novosibirsk-Tolmachevo Airport where repairs were successfully conducted. En route to Susuman, while cruising at an altitude of 5,700 metres, the crew got disoriented and the radio contact were difficult. As the fuel reserves were low, the captain decided to attempt an emergency landing 75 km southeast of Zyrianka Airport. With flaps down at 38° and at a speed of 177 km/h, the aircraft crash landed and slid for 488 metres before coming to rest. All nine occupants escaped with minor injuries and the aircraft was damaged beyond repair. ", "probable_cause": "The accident was the result of an emergency landing made necessary after the crew lost his orientation following successive errors during pre-flight and en route. The following contributing factors were reported: \r\n- Poor flight planning and organization, \r\n- The captain took the unjustified decision to change heading,\r\n- ATC in charge of the Okhotsk region authorized the crew to change heading without knowing the exact position of the aircraft,\r\n- Upon departure, the total weight of the aircraft 5,230 kilos above MTOW,\r\n- Radio communication issues."}