{"url": "https://www.baaa-acro.com/crash/crash-boeing-377-10-26-stratocruiser-pacific-ocean-4-killed", "date": "Mar 26, 1955 at 1112 LT", "type": "Boeing 377 Stratocruiser", "operator": "Pan%20Am.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Seattle – Portland – Honolulu – Sydney", "msn": "15932", "yom": 1949, "flight_number": "PA845", "city": "Pacific Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 8, "crew_fatalities": 2, "pax_on_board": 15, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 17872, "captain_hours_type": 1588, "copilot_hours": 10125, "copilot_hours_type": 1293, "aircraft_hours": 13655, "circumstances": "Trip 845/26, a scheduled flight from Seattle-Tacoma, Washington, to Sydney, Australia, departed Seattle-Tacoma Airport at 0815LT for Portland, Oregon, the first intermediate stop. There were 13 passengers and a crew of 8 consisting of Captain H. S. Joslyn, First Officer A. G. Kendrick, a Navigator N. F. Kerwick, Flight Engineer D. R. Fowler, Assistant Flight Engineer S. Bachman, Purser Natalie B. Parker, Stewardess Elizabeth M. Thompson, and Steward J. D. Peppin. The flight to Portland was normal in all respects with arrival at 0910. There the aircraft was serviced and two additional passengers boarded. Only inspections and service were accomplished. The flight left the ramp at 1010 and took off for Honolulu, Territory of Hawaii, at 1021 on an IFR clearance. Weather conditions at time of takeoff were VFR. There were 15 passengers and the saw crew of 8. Takeoff gross weight was 139,494 (maximum allowable was 145,800 pounds) and the center of gravity was located within limits. The flight plan was via Newberg and Newport, Oregon, and thence to Honolulu to Cruise at 10,000 feet. Estimated flight time was 11 hours and 3 minutes. The flight reported over Newberg at 1031 at 7,000 feet climbing., reached 10,000 feet at approximately 1039, and reported over Newport at 1048 at cruising altitude. The aircraft was then headed to make good the initial track or 221 degrees . Forty-two minutes after takeoff, severe vibration occurred while cruising era at 10,000 feet under VIM conditions. This lasted for five to eight seconds following which No. 3 engine and propeller tore free and fell from the aircraft. The captain immediately disconnected the autopilot. Severe buffeting ensued, the nose want down and the aircraft swung to the right sharply. At this point, the emergency \"Mayday\" signal was broadcast on both VHF and HF. Direct return to Portland was authorized by Seattle Air Route Traffic Control. The captain, in the left seat, tried to get the airplane under control. Airspeed was about 220 knots and going higher, so he closed the throttles to keep the airspeed down. He still could not get the nose up; it felt to him as though the elevators were still on automatic pilot. He tried the elevator trim tab and could not turn it. After rapid loss of altitude to about 5,000 feet, the captain directed the first officer to assist him with the controls. Their combined efforts finally brought the nose up very rapidly but the aircraft then went into a steep climb. It turned sharply to the right about 180 degrees and, according to the captain, appeared to be on \"the verge of a spin.\" Level attitude was regained by pushing the yoke forward, and by use of the rudder and aileron trim the turn was stopped. At an airspeed of 150 knots, flaps extended 25 degrees, buffeting decreased immediately, however., the aircraft continued to descend rapidly. Attempts to get rated power were futile and a message was broadcast that ditching was imminent. This message was sent at approximately 1106. The aircraft was then at an altitude of 500-1,000 feet. Ditching was imminent. Cabin attendants, realizing the emergency, assumed their respective stations for ditching. All passengers had been seated in the upper desk of the cabin with seat belts fastened and life jackets donned. The aircraft touched down under near ideal sea conditions with little swall. Contact with the water we severe and the impact dislodged life rafts from their storage bins and some seats were torn loose. The aft portion of the fuselage and empennage broke off at impact. Evacuation was orderly and the three rafts, although dislodged from their stowage receptacles, were launched without undue delay. The lanyards of all three life rafts were temporarily held at the cabin door by crow members. However, when one of the rafts was endangered by sharp metal of the broken fuselage its lanyard was released. Another was released by a crew member who then swam to that raft to right it. The lanyard of the third raft was released for unknown reasons. Consequently the rafts were carried away by the light surface wind. Passengers and crew left by both the main cabin door and escape hatches on both sides of the fuselage over each wing. Some crew members and passengers ware able to swim to and board the rafts. Three of the four fatalities, including the copilot and first engineer, were unable to do so and were lost. Members of the crew and passengers tried in vain to paddle to these persons. One other passenger later died in a raft from awe and shock. The purser, a woman, although suffering from shock swam and towed the only seriously injured passenger to the nearest raft, some 200 feet distant. The time of ditching was determined as 1112 and the position at lat. 43 degrees 48'15\" N., long. 125 degrees 12'40\" W., approximately 35 miles off the Oregon coast. The U.S.S. Bayfield, en route to Seattle, changed course toward the site and by add of search aircraft reached the life rafts some two hours later.", "probable_cause": "The Board determines that the probable cause of this accident was loss of control and inability to maintain altitude following failure of the No. 3 propeller which resulted in wrenching free No. 3 Power package. The following findings were reported: \r\n- Weather was not a factor in this accident,\r\n- The aircraft and all its components functioned normally until a blade of No. 3 propeller failed,\r\n- The resulting imbalance wrenched free No. 3 power package,\r\n- Control difficulty resulted in rapid loss of altitude to low altitude,\r\n- Fuel was not dumped,\r\n- Rpm of the remaining three engines was not increased due to lack of specific training of the crew,\r\n- This aircraft had not been notified in accordance with Service Bulletin No. 283; however, this information was available to the company,\r\n- The aircraft was ditched under control approximately 35 miles off the Oregon coast,\r\n- There were no fatalities as a direct result of the ditching,\r\n- The three life rafts were launched without undue delay but were permitted to drift free,\r\n- The aircraft floated for an estimated 20 minutes,\r\n- Your persons succumbed as a result of shock, exposure, and/or drowning,\r\n- Search and Rescue facilities were notified promptly and responded quickly and effectively."}