{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c99-airliner-hastings", "date": "Mar 16, 2018 at 0750 LT", "type": "Beechcraft 99 Airliner", "operator": "Ameriflight2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Omaha – Hastings", "msn": "U-213", "yom": 1983, "flight_number": "AMF1696", "city": "Hastings", "zone": "Nebraska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6500, "captain_hours_type": 1145, "copilot_hours": 853, "copilot_hours_type": 21, "aircraft_hours": 17228, "circumstances": "According to the operator's director of safety, during landing in gusty crosswind conditions, the multi-engine, turbine-powered airplane bounced. The airplane then touched down a second time left of the runway centerline. \"Recognizing their position was too far left,\" the flight crew attempted a go-around. However, both engines were almost at idle and \"took time to spool back up.\" Without the appropriate airspeed, the airplane continued to veer to the left. A gust under the right wing \"drove\" the left wing into the ground. The airplane continued across a grass field, the nose landing gear collapsed, and the airplane slid to a stop. The airplane sustained substantial damage to the fuselage and left wing. The director of safety reported that there were no preaccident mechanical failures or malfunctions with the airplane that would have precluded normal operation. The automated weather observation system located at the accident airport reported that, about the time of the accident, the wind was from 110° at 21 knots, gusting to 35 knots. The pilot landed on runway 04. The Beechcraft airplane flight manual states the max demonstrated crosswind is 25 knots. Based on the stated wind conditions, the calculated crosswind component was 19 to 33 knots.", "probable_cause": "The pilot's decision to land in a gusty crosswind that exceeded the airplane's maximum demonstrated crosswind and resulted in a runway excursion.\n"}