{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-204-near-tucuti-47-killed", "date": "Jun 6, 1992 at 2100 LT", "type": "Boeing 737-200", "operator": "COPA-Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Miami – Panama City – Cali", "msn": "22059", "yom": 1979, "flight_number": "CM201", "city": "Tucutí", "zone": "Darién", "country": "Panama", "region": "Central America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 40, "pax_fatalities": 40, "other_fatalities": 0, "total_fatalities": 47, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 45946, "circumstances": "The airplane departed Panama City-Tocumen Airport runway 21L at 2036LT bound for Cali, Colombia. While cruising at FL250, the crew was informed about poor weather conditions 30-50 miles ahead. Shortly later, there was an intermittent failure of the main attitude indicator due to a short circuit. This was not noticed by the flight crew, who attempted to adjust the aircraft attitude based on the false information from the attitude indicator. They lost control of the aircraft which entered a steep descent and started to disintegrate at FL100, and impacting the ground 80° nose down. The wreckage was found in the jungle about 13 km southwest of Tucití. All 47 occupants were killed. ", "probable_cause": "The following findings were reported:\r\n- Loss of control of the aircraft because the flight crew followed false information from an attitude indicator that operated intermittently.\r\n- Lack of visible horizon during cruise flight due to night and approaching bad weather.\r\n- Insufficient cross-checking between the primary and emergency (standby) attitude indicators to identify intermittent attitude errors and to select a reliable source of (correct) attitude information.\r\n- Non-standard cabin configurations between aircraft in the fleet of the company, which required the crew to determine how to set the switches based on the aircraft was being operated at the time.\r\n- Incomplete ground crew training simulator, as it did not present 'differences between aircraft' and 'crew resource management' in sufficient detail to give the crew knowledge to overcome intermittent attitude indicator errors and to maintain control of the aircraft."}