{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-johnstown-2-killed", "date": "Dec 26, 2006 at 1555 LT", "type": "Cessna 414 Chancellor", "operator": "Flight Source", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Morgantown - Teterboro", "msn": "414-0613", "yom": null, "flight_number": null, "city": "Johnstown", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3547, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5904, "circumstances": "The airplane encountered in-flight icing, and the pilot diverted to an airport to attempt to knock the ice off at a lower altitude. During the instrument approach, the pilot advised the tower controller of the ice, and that it depended on whether or not the ice came off the airplane if she would land. As the airplane broke out of the clouds, it appeared to tower personnel to be executing a missed approach; however, it suddenly \"dove\" for the runway. The tower supervisor noticed that the landing gear were not down, and at 75 to 100 feet above the runway, advised the pilot to go around. The airplane continued to descend, and by the time it impacted the runway, the landing gear were only partially extended, and the propellers and airframe impacted the pavement. The pilot then attempted to abort the landing. The damaged airplane became airborne, climbed to the right, stalled, and nosed straight down into the ground.", "probable_cause": "The pilot's improper decision to abort the landing with a damaged airplane. Contributing to the accident were the damage from the airplane's impact with the runway, the pilot's failure to lower the landing gear prior to the landing attempt, and the in-flight icing conditions."}