{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2b-26-islander-campbeltown-2-killed", "date": "Mar 15, 2005 at 0018 LT", "type": "Britten-Norman Islander", "operator": "Loganair", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Glasgow – Campbeltown", "msn": "2205", "yom": 1989, "flight_number": null, "city": "Campbeltown", "zone": "Argyll", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3553, "captain_hours_type": 205, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6221, "circumstances": "The Glasgow based Islander aircraft was engaged on an air ambulance task for the Scottish Ambulance Service when the accident occurred. The pilot allocated to the flight had not flown for 32 days; he was therefore required to complete a short flight at Glasgow to regain currency before landing to collect a paramedic for the flight to Campbeltown Airport on the Kintyre Peninsula. Poor weather at Campbeltown Airport necessitated an instrument approach. There was neither radar nor Air Traffic Control Service at the airport, so the pilot was receiving a Flight Information Service from a Flight Information Service Officer in accordance with authorised procedures. After arriving overhead Campbeltown Airport, the aircraft flew outbound on the approach procedure for Runway 11 and began a descent. The pilot next transmitted that he had completed the ‘base turn’, indicating that he was inbound to the airport and commencing an approach. Nothing more was seen or heard of the aircraft and further attempts at radio contact were unsuccessful. The emergency services were alerted and an extensive search operation was mounted in an area based on the pilot’s last transmission. The aircraft wreckage was subsequently located on the sea bed 7.7 nm west-north-west of the airport; there were no survivors.", "probable_cause": "The investigation identified the following causal factors:\r\n1. The pilot allowed the aircraft to descend below the minimum altitude for the aircraft’s position on the approach procedure, and this descent probably continued unchecked until the aircraft flew into the sea.\r\n2. A combination of fatigue, workload and lack of recent flying practise probably contributed to the pilot’s reduced performance. \r\n3. The pilot may have been subject to an undetermined influence such as disorientation, distraction or a subtle incapacitation, which affected his ability to safely control the aircraft’s flightpath."}