{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-near-terrace-4-killed", "date": "Oct 22, 1990 at 1400 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Trans-Provincial%20Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Terrace – Iskut – Dease Lake – Bronson Creek – Terrace", "msn": "31-7852004", "yom": 1978, "flight_number": null, "city": "Terrace", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 700, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5520, "circumstances": "The aircraft was on a scheduled visual flight rules (VFR) flight from Terrace to Iskut to Dease Lake to Bronson Creek and back to Terrace, British Columbia. The aircraft departed Terrace about 1005 Pacific standard time (PST) and arrived Iskut about 1145, departed Iskut about 1155 and arrived Dease Lake about 1230, and departed Dease Lake about 1250 and arrived Bronson Creek about 1340. All of these flights were completed without incident, and the aircraft departed Bronson Creek for Terrace at about 1350 with the pilot and three passengers on board. Ten minutes later, the pilot spoke on the radio to a pilot who was flying from Smithers to Bronson Creek when the two aircraft passed each other approximately 20 miles east of Bronson Creek. This was in the Iskut River valley just east of the confluence of the Forest Kerr River and the Iskut River. This was the last reported contact with the aircraft, and the pilot did not report a problem at that time. An air and ground search was started after the aircraft was reported missing, but the aircraft was not found and the search was abandoned. No emergency locator transmitter (ELT) signal was detected. The wreckage was found by chance on 05 August 1994, nearly four years after the accident.", "probable_cause": "The pilot likely attempted to continue the visual flight into an area of instrument meteorological conditions."}