{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-235-pensacola-3-killed", "date": "May 8, 1978 at 2120 LT", "type": "Boeing 727-200", "operator": "National-Airlines-4", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Miami - Melbourne - Tampa - New Orleans - Mobile - Pensacola", "msn": "19464", "yom": 1968, "flight_number": "NA193", "city": "Pensacola", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 52, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 18109, "captain_hours_type": 5358, "copilot_hours": 4848, "copilot_hours_type": 842, "aircraft_hours": 26720, "circumstances": "Flight 193 operated as a scheduled passenger from Miami to Pensacola, FL, with en route stops at Melbourne and Tampa, New Orleans, Louisiana, and Mobile. About 21:02 CDT the flight departed Mobile on an IFR flight plan to Pensacola and climbed to the cruising altitude of 7,000 feet. At 21:09, the crew were told that they would be vectored for an airport surveillance radar (ASR) approach to runway 25. At 21:13, the radar controller told National 193 that it was 11 nm NW of the airport and cleared it to descend and maintain 1,700 feet. At 21:17 flaps were selected at 15° and two minutes later the flight was cleared to descend to 1,500 feet and shortly after that further down to the MDA (480 feet). As the aircraft rolled out on the final approach heading, the captain called for the landing gear and the landing final checklist. At 21:20:15, the ground proximity warning system (GPWS) whooper warning continued for nine seconds until the first officer silenced the warning. Nine seconds later the 727 hit the water with gear down and flaps at 25°. It came to rest in about 12 feet of water. The weather at the time of the accident was 400 feet overcast, 4 miles visibility in fog and haze, wind 190°/7 kts. Three passengers were killed while 55 other occupants were rescued, among them 11 were injured. ", "probable_cause": "The flight crew's unprofessionally conducted non precision instrument approach, in that the captain and the crew failed to monitor the descent rate and altitude, and the first officer failed to provide the captain with required altitude and approach performance callouts. The captain and first officer did not check or utilize all instruments available for altitude awareness and, therefore, did not configure the aircraft properly and in a timely manner for the approach. The captain failed to comply with the company's GPWS flightcrew response procedures in a timely manner after the warning began. The flight engineer turned off the GPWS warning 9 seconds after it began without the captain' s knowledge or consent. Contributing to the accident was the radar controller's failure to provide advance notice of the start-descent point which accelerated the pace of the crew's cockpit activities after the passage of the final approach fix."}