{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-43-milan-13-killed", "date": "Aug 2, 1968 at 1406 LT", "type": "Douglas DC-8", "operator": "Alitalia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Rome - Milan - Montreal", "msn": "45630", "yom": 1962, "flight_number": "AZ660", "city": "Milan-Malpensa", "zone": "Lombardy", "country": "Italy", "region": "Europe", "crew_on_board": 10, "crew_fatalities": 0, "pax_on_board": 85, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Flight AZ660 to Montreal, Canada departed Rome-Fiumicino Airport, Italy at 13:15. An intermediate stop was planned at Milan-Malpensa Airport. The airplane climbed in VMC to the en route altitude of FL220. The en route part of the flight was uneventful. While descending to the south of the airport, preparing for an approach to runway 35, the aircraft entered IMC with heavy turbulence due to the presence of a thunderstorm in the area. About 13:59 the flight was cleared from 9,000 feet down to 4,000 feet for a straight-in approach. Three minutes later the pilot advised that he would make a 360° turn over the beacon as the aircraft was at 6,000 feet. On completion of the turn, at an altitude of 1,500 feet, the flight continued on runway heading and descending. At 14:06 the flight crew became unsure of their position and almost immediately the airplane struck a wooded hillside 11,5 km north of Milan runway 35. 13 passengers were killed while 22 others were injured. 60 people were uninjured. The aircraft was destroyed by impact forces and a post crash fire. ", "probable_cause": "Insufficient checking of flight times during the final portion of the approach; Positioning for final approach by means of a non standard procedure; Delayed detection of the VOR radial or wrong selection of such radial; Broken view of terrain north of the airport similar to that south of the airport."}