{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-50a-10-bo-superfortress-near-hyder-12-killed", "date": "Mar 23, 1950 at 0815 LT", "type": "Boeing B-50 Superfortress", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Desert", "schedule": "Davis-Monthan - Davis-Monthan", "msn": "15740", "yom": 1947, "flight_number": null, "city": "Hyder", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 14, "crew_fatalities": 12, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The heavy bomber departed Davis-Monthan AFB in Tucson at 0615LT for a routine training mission that involved navigation, aerial refueling and camera gunnery training. After transferring 870 gallons of fuel to a KB-29 over Yuma, the crew pressurized the cabin and began to climb to 20,000 feet. While climbing through 17,000 feet, at about 0815LT, the master fire warning light suddenly illuminated on the pilot's instrument panel as the right scanner simultaneously reported a fire streaming from Number 3 engine. There were three successive minor explosions that rolled the bomber onto a 45 degree angle right bank. With the right wing engulfed in flames, the ship then fell into a steep right turn and began to disintegrate. As the bomber broke apart in the sky, only two men of the crew of fourteen were able to escape, the copilot Lt William Gentry and the bombardier, Captain John Lee. The wreckage was spread over a two-mile area of remote desert terrain. \nSource: http://www.aircraftarchaeology.com/b50superfortress.html", "probable_cause": "The investigation disclosed that Engine Number 3 had been replaced the prior day. It was determined that the cause of the fire was from the exhaust clamp that failed on Engine Number 3, and allowed hot exhaust gas to ignite fuel which had seeped past the fire seal into the engine section. The source of the fuel was likely from the loose-fitting main fuel line at the inlet side of the engine-driven fuel pump."}