{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950-libo", "date": "Oct 5, 2007 at 1200 LT", "type": "Fletcher FU-24", "operator": "Sinarmas", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Libo - Libo", "msn": "172", "yom": 1971, "flight_number": null, "city": "Libo (Samsam)", "zone": "Riau", "country": "Indonesia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14333, "circumstances": "On 5 October 2007, a Fletcher FU24-950M aircraft operated by PT. Sinar Mas Super Air, registered PK-PNZ was conducting aerial agriculture spraying activities at palm plantations of Rokan Estate, Pekanbaru, Riau. The aerial agriculture spraying divided into two sessions. Session #1 was in the morning at 23:35 UTC (06:35 LT) and conducted 27 cycles for about 3 hours flight. Session #1 was in the afternoon after daybreak at 05:00 UTC and conducted 28 cycles. The session #1 was carried out with normal and safely. One Pilot was on-board in the aircraft. The session #2, the aircraft was take-off at 05:00 using runway 18. After take-off, the pilot turned to the left to the fertilization area. The fertilization area was on the left of the runway. The pilot informed while the aircraft turned to the left, he felt the strong wind from the right. Then the aircraft was descending and the left wing hit the palm tree. After losing the wing tip, the aircraft difficult to control and crashed into the palm trees on the left runway for about 238 meters from the end of runway 18. The aircraft was substantial damaged. The pilot suffered minor injured. The weather of that day was clear and wind speed around 6 – 10 knots.", "probable_cause": "Findings:\r\n1.\tAIRCRAFT\r\n-\tThe aircraft had a valid Certificate of Airworthiness and Certificate of Registry.\r\n-\tThe aircraft was airworthy when dispatched for the flight.\r\n-\tThere was no system malfunction recorded or reported on the maintenance record.\r\n2.\tPILOTS\r\n-\tThe pilot was held valid licensed.\r\n-\tThere was no information that the pilot has been trained for agricultural operation.\r\n3.\tFLIGHT Technique\r\n-\tThe very low level and speed turning was potentially high risk to be sank while the cross wind came through.\r\n-\tWhen the aircraft take-off and then turned to the left, the strong wind was blowing in the right wing. The pilot encounter of the downdraft while climbing\r\n-\tThe pilot’s actions indicated that his knowledge and understanding of the flight technique was inadequate.\r\n4.\tOPERATIONS\r\n-      The operator did not have training syllabus and program for new pilot other than for the agriculture experience pilot.\r\n5.\tAirstrip\r\n-\tWind shock position was under the palm trees, so that the wind speeds different from above and under the palm trees, the wind direction could not be observed by pilot prior takeoff.\r\n-\tThe runway strip width was 12 meters and the palm trees between the airstrip for about 30 meters and height 15 meters. It indicated the airstrip look likes a tunnel.\r\nContributing Factors\r\n- The pilot was not well train on the agriculture operation,\r\n- The pilot failed to encounter the aircraft experienced a sinking during very low level and speed,\r\n- The operator did not have training syllabus and program for new pilot other than for the agriculture experience pilot,\r\n- There were no agriculture operation regulations prior the accident."}