{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-256-near-bilbao-148-killed", "date": "Feb 19, 1985 at 0927 LT", "type": "Boeing 727-200", "operator": "Iberia-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Madrid - Bilbao", "msn": "21777", "yom": 1979, "flight_number": "IB610", "city": "Bilbao", "zone": "Basque Country", "country": "Spain", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 141, "pax_fatalities": 141, "other_fatalities": 0, "total_fatalities": 148, "captain_hours": 13678, "captain_hours_type": 4671, "copilot_hours": 5548, "copilot_hours_type": 2045, "aircraft_hours": 13408, "circumstances": "Iberia Flight 610 departed Madrid at 08:47 for a scheduled flight to Bilbao, where it was scheduled to land at 09:35. The Boeing 727, named \"Alhambra de Granada\", climbed to the cruising altitude of FL260. At 09:09 the crew were instructed to descend to FL100. Seven minutes later the copilot contacted Bilbao Tower. The controller then cleared the flight for an ILS approach: \"Iberia 610, you can continue descent, for an ILS approach to Bilbao, runway 30, wind is 100 degrees 3 knots, QNH 1025 and transition level 70.\" This was confirmed by the crew. The controller subsequently offered them a direct clearance to the approach fix, which is located at 13 DME from the airport. The captain declined and decided to fly the standard approach procedure. At 09:22 flight 610 reported over the Bilbao VOR at 7000 feet, starting the standard approach procedure. The airplane further descended to 5000 feet, which it reached three minutes later. The crew switched the Altitude Alert System to 4300 ft (the minimum sector altitude is 4354 feet) and continued the descent. The altitude alert horn sounds 900 feet prior to reaching the preset altitude (approach mode) and 300 feet below that altitude (deviation mode). Since the flight had 700 feet to go, the horn would only sound at around 4000 feet. Since the crew descended below the minimum sector altitude, the altitude alert horn sounded at 4040 feet. The crew interpreted this being the approach mode alert, and continued their descent. Fifty-seven seconds after passing through the minimum sector altitude, the airplane struck the base of a structure of antennas located close to the top of Mount Oiz (3356 feet high). The left wing broke off and the remaining fuselage crashed onto the hillside, cutting a swath through the trees. The aircraft disintegrated on impact and all 148 occupants were killed. ", "probable_cause": "Their confidence on the automatic capture performed by the Altitude Alert System, the misinterpretation of its warnings, as well as a probable misreading of the altimeter made the crew to fly below the safety altitude, colliding into the television antennas' base, thus losing the left wing, falling to the ground with no possible control of the aircraft."}