{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-749a-constellation-fethiye-4-killed", "date": "Aug 3, 1953 at 0328 LT", "type": "Lockheed L-749 Constellation", "operator": "Air-France-31", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Paris – Rome – Beirut – Tehran", "msn": "2628", "yom": 1950, "flight_number": "AF152", "city": "Fethiye", "zone": "Aegean Region (Ege Bölgesi)", "country": "Turkey", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 34, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 5201, "captain_hours_type": null, "copilot_hours": 5574, "copilot_hours_type": null, "aircraft_hours": 10058, "circumstances": "While cruising at an altitude of 17,500 feet between Rhodes Island and Cyprus, the crew noted slight vibrations but was unable to localize them. Four minutes later, a loud bang was noted, an explosion occurred, a brutal depressurization occurred and the aircraft lost 1,000 feet. The captain, who was sleeping, joined immediately his seat, disengaged the automatic pilot system and started an emergency descent with a rate of 300-500 feet per minute. In the mean time, the copilot informed ATC he elected to divert to Nicosia Airport. The crew realized that the engine number three fell off and decided to shut down the engine number four and feathered its propeller. Eventually, the captain decided to ditch the aircraft on a calm sea about two NM off the Fethiye lighthouse. Ten minutes after landing, the empennage broke off and sank. Some passengers swum to the shore and the aircraft eventually sank two hours later. Three crew members were injured, 35 occupants were unhurt and four passengers were killed. ", "probable_cause": "In reference to all details collected by investigators, it is believed that the physical loss of the engine number three was caused by the loss of a propeller blade in flight. The cause of this failure could not be determined with certainty. "}