{"url": "https://www.baaa-acro.com/crash/crash-cessna-425-conquest-i-bozeman-1-killed", "date": "Nov 29, 2005 at 1742 LT", "type": "Cessna 425 Conquest", "operator": "Tech%20II", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Algona - Bozeman", "msn": "425-0148", "yom": 1981, "flight_number": null, "city": "Bozeman", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1987, "captain_hours_type": 1675, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4504, "circumstances": "The airplane was on the final approach segment of an instrument flight rules (IFR) cross country flight that originated approximately 3 hours and 45 minutes prior to the accident when radio communications with the aircraft were lost. The aircraft wreckage was located the following day approximately 2.8 miles from the destination airport. The airplane impacted terrain in a vertical descent and flat attitude and came to rest upright on its fuselage and wings. The cockpit and cabin were intact and both wing assemblies remained attached to the fuselage. Evidence of forward velocity and/or leading edge deformation was not observed to the wings or fuselage. Mixed ice was noted along the leading edge of both wings. At the time of the accident, weather conditions were reported as low ceilings and low visibility due to snow and mist. The accident occurred during dark night conditions. Air traffic control (ATC) transcripts indicated that shortly after entering the holding pattern at 11,000 feet the pilot was issued an approach clearance for the ILS. The pilot acknowledged the clearance and approximately two minutes later ATC communications with the pilot were lost. Pilot logbook records showed that the pilot's total flight time was approximately 1,987 hours. In the six-month period preceding the accident, the pilot logged approximately 40 hours total time, 9 hours of actual instrument time and 7 instrument approaches in the accident airplane. The pilot's total night flying experience was approximately 51 hours. The pilot made no entries in his pilot logbook indicating that he had flown at night in the six-month time frame preceding the accident. Pilots flying the ILS approach prior to the accident aircraft reported mixed icing during the descent and final approach. Post accident examination of the aircraft revealed no evidence to indicate a mechanical malfunction or failure.", "probable_cause": "The pilot's failure to maintain airspeed during the approach which resulted in an inadvertent stall. Factors associated with the accident were dark night conditions, clouds, icing conditions, low visibility and snow."}