{"url": "https://www.baaa-acro.com/crash/crash-lockheed-mc-130h-hercules-qayyarah-airfield-west-afb", "date": "Dec 29, 2004", "type": "Lockheed C-130 Hercules", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "5054", "yom": 1985, "flight_number": null, "city": "Qayyarah Airfield West AFB", "zone": "Nīnawā (Nineveh) (نينوى)", "country": "Iraq", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The MC-130H Hercules plane was on a nighttime logistics transport mission in support of Operation Iraqi Freedom. US operated airfield in northern Iraq, reportedly Qayyarah Airfield West, a trench was being dug in the runway 33. The construction works, approx. 2700 feet from the southern end of the runway were not marked nor NOTAMed. On landing, at a speed of 80 knots, the Hercules plane ran into the construction works. The nose gear and forward undercarriage were sheared off and the left wing separated just outside the no. 2 engine. The aircraft then caught fire. The crew members egressed safely, but the four passengers required assistance from ground personnel and aircrew.", "probable_cause": "The Board President determined the causes of the accident are: \r\n1) A failure on the part of the mishap site Assistant S-3 (Battle Captain[s]) to disseminate timely Notices to Airmen (NOTAM) information via the appropriate channels, \r\n2) the failure of the Army project manager for construction at the mishap site to ensure the construction was properly marked and \r\n3) a failure of the NOTAM reporting system to include oversight and supervision of the NOTAM processes, within the area of responsibility (AOR). \r\nContributing factors in this mishap include: \r\n1) a lack of training on the part of the U.S. Army to effectively prepare their personnel for combat zone airfield management and operations, and \r\n2) the failure of the Garrison Commander at the mishap location to assume responsibility for ensuring safe flight operations at the airfield. \r\nThe Board President also determined there were numerous opportunities for airfield construction information to flow to the aircrew, but in each case the information was not properly disseminated prior to the aircrew departing for their scheduled mission."}