{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-monroe", "date": "Nov 17, 1998 at 1855 LT", "type": "Cessna 414 Chancellor", "operator": "Sequel Group", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Monroe - Dallas", "msn": "414-0005", "yom": 1969, "flight_number": null, "city": "Monroe", "zone": "Louisiana", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 313, "captain_hours_type": 54, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6415, "circumstances": "The airplane impacted terrain during takeoff initial climb in dark night conditions with a 100 ft ceiling and 1/4 mile visibility in fog. The instrument rated private pilot sustained serious injuries and does not recall the flight. No discrepancies were found with the aircraft, flight instruments, or engines that would have contributed to the accident. A weather briefing was obtained and an IFR flight plan was filed. The pilot had 312.8 hrs total time (54.2 hrs in this aircraft), 61 hrs night flight time (36.9 hrs in this aircraft) and 26.8 hrs actual instrument time (19.6 hrs in this aircraft). Toxicological findings were positive for benzoylecgonine (metabolite of cocaine), ethanol, and cocaethylene (substance formed when cocaine and alcohol are simultaneously ingested) in a urine sample subpoenaed by the NTSB from the hospital that treated the pilot. Benzoylecgonine can be found in urine for 3 to 5 days after cocaine use. Since blood was not available for analysis, it could not be determined how much of each substance was ingested and when they were ingested. The pilot stated that he was not under the influence of cocaine or alcohol on the day of the crash. ", "probable_cause": "The pilot's spatial disorientation which resulted in a loss of aircraft control. Factors were fog, low ceilings, and dark night conditions. "}