{"url": "https://www.baaa-acro.com/crash/crash-nord-262a-33-los-angeles-3-killed", "date": "Mar 10, 1979 at 1752 LT", "type": "Nord 262", "operator": "Swift%20Aire", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Los Angeles - Santa Maria", "msn": "41", "yom": 1967, "flight_number": "WI235", "city": "Los Angeles", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 8500, "captain_hours_type": 879, "copilot_hours": 5600, "copilot_hours_type": 424, "aircraft_hours": 11300, "circumstances": "On March 10, 1979, Swift Aire Lines, Inc., Flight 235, an Aerospatiale Nord 262, N418SA, was being operated as a scheduled passenger flight from Los Angeles, California, to Santa Maria, California. About 1745 PST, flight 235 departed the commuter passenger terminal at the Los Angeles International Airport to taxi to the end of runway 24L via the parallel taxiway. The flight was operating on an instrument flight rules (IFR) flight plan; there were four passengers and three crew members on board. At 1748:11, the crew reported that it was ready for takeoff, and at 1749:04, the flight was cleared to taxi into position on runway 24L and hold. At 1749:34, the tower controller cleared the flight for takeoff and cautioned \"possible turbulence, preceding heavy departure. You'll be more than 6 miles in trail.\" The crew acknowledged the clearance and began the takeoff roll. At 1750:27, the flight was changed over to the departure control radio frequency. At 1751:08, the crew of Flight 235 reported, \"We got an emergency, we are going down.\" The departure controller asked if the flight wanted to return to land. At 1751:14, the crew replied, \"We lost both of them.\" Witnesses who were located along the flightpath of the aircraft at the time of the accident stated that when the aircraft lifted off the runway exhaust smoke from both engines was visible, and when the aircraft crossed the departure end of the runway, the right propeller was observed slowing to a stop. As the aircraft crossed the shoreline, popping sounds were heard from the left engine, and the aircraft stopped climbing and turned north paralleling the shoreline. The witnesses did not hear any engine sounds after the aircraft turned parallel to the shoreline. The witnesses also stated that as the aircraft flew north along the shoreline, it descended in a wings-level attitude, it contacted the water smoothly, bounced twice, impacted the water in a nose down attitude, and sank almost immediately. The flight attendant, who was seated in a rear passenger seat during the takeoff, said that she listened to the crew over the intercom until she heard the gear-up call by the captain and that, until the gear-up call, everything had been normal. At that point, she removed her headset. Shortly thereafter, she noticed that there was no engine noise, and she looked out of the window. Seeing that the aircraft was over water, she then briefed the passengers on crash landing and ditching procedures. She stated that before the aircraft struck the water, the crew had given her two aural warnings of an emergency landing. One passenger stated that acceleration was good during the takeoff and climb out to about 300 to 400 ft. Ile said that shortly after he heard the landing gear go up, he heard a pop, and the right engine lost power and stopped running. This was followed by an increase in power on the left engine, and the aircraft continued to climb momentarily. Then, as it leveled off, the left engine quit. He said it appeared that the captain tried to restart the left engine. The accident occurred during the hours of dusk.", "probable_cause": "The National Transportation Safety Board determines that the probable cause of the accident was the flightcrew's mismanagement of an emergency procedure following an autofeather of the right propeller which resulted in their shutting down the remaining engine. Contributing to the accident was the unavailability of vital restart information to the crew. The following findings were reported:\r\n- Shortly after landing gear retraction, the right propeller autofeathered and the engine shut down,\r\n- The right engine shutdown was followed closely by the shutdown of the left engine,\r\n- A leak or break in the propeller pressure line to the autofeather selector probably caused the right propeller to autofeather and the engine to shut down,\r\n- The left engine was shut down inadvertently,\r\n- The left engine probably was shut down because the flight crew failed to properly identify the engine on which the autofeather occurred and moved the left power lever to the stop position,\r\n- A possible restart attempt was not successful because the flight crew was probably unaware that feathering the propeller was a prerequisite to a successful airborne restart,\r\n- The engine restart procedures contained in the aircraft operations manual did not contain sufficient information to effect a restart from an unfeathered condition,\r\n- After the left engine was shut down, there was enough altitude and time available for the crew to get a restart,\r\n- The fatalities occurred when the crewmembers and passenger became trapped or disoriented, or both, by the fast, rushing water that entered the aircraft after it was ditched in the Santa Monica Bay."}