{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-880-22m-3-hong-kong-1-killed", "date": "Nov 5, 1967 at 1035 LT", "type": "Convair CV-880", "operator": "Cathay-Pacific-21", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hong Kong - Saigon - Bangkok", "msn": "22-00-37M", "yom": 1963, "flight_number": "CX033", "city": "Hong Kong-Kai Tak", "zone": "Hong Kong", "country": "China", "region": "Asia", "crew_on_board": 11, "crew_fatalities": 0, "pax_on_board": 116, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7031, "captain_hours_type": 1320, "copilot_hours": 6812, "copilot_hours_type": 1107, "aircraft_hours": 11369, "circumstances": "Flight CX033 was a scheduled flight from Hong Kong to Bangkok with an additional en-route stop at Saigon to transport a backlog of passengers. A Check captain joined the flight. The co-pilot was flying the aircraft from the left-hand seat whilst the pilot-in-command occupied the right-hand seat to assess his performance. The Check captain occupied the jump seat behind the co-pilot from where he could monitor the performance of both pilots. At 10:31 the aircraft commenced to taxi out for takeoff on runway 13. A wind check of 010/10 kt was passed by the tower and acknowledged by the aircraft when the takeoff clearance was given. At 10:34 a rolling takeoff was commenced. The co-pilot, who was piloting the aircraft, increased the power to 1.5 EPR after which the engineer set the engines at maximum power. The aircraft accelerated normally but at a speed of slightly under 120 kt (as reported by the co-pilot) heavy vibration was experienced. The vibration increased in severity and the co-pilot decided to discontinue the takeoff. He called \"abort\", closed the power levers, applied maximum symmetrical braking and selected the spoilers. The abort action was stated to have been taken promptly except that there was a delay of 4-5 sec in applying reverse thrust which was then used at full power throughout the remainder of the aircraft's travel. No significant decrease in the rate of acceleration occurred until after an indicated airspeed of 133 kt had been attained, there was then a slow build-up of speed to 137 kt over the next 2 sec after which deceleration commenced. Both pilots were applying full brakes but neither of them felt the antiskid cycling. The aircraft continued to run straight some distance after initial braking was applied but then a veer to the right commenced. Opposite rudder was used but failed to check this forcing the use of differential braking to the extent that eventually the right brake had been eased off completely, whilst maximum left braking, full left rudder, full lateral control to the left, and nose-wheel steering were being applied, These actions were only partly effective and the aircraft eventually left the runway and entered the grass strip. The turn to the right continued until finally the aircraft crossed the seawall. All four engines separated on impact with, the sea, the nose of the aircraft was smashed in and the fuselage above floor level between the flight deck and the leading edge of the wing was fractured in two places. The aircraft spun to the right and came to rest some 400 ft from the seawall. A passenger was killed while 33 other were injured. ", "probable_cause": "The probable cause of the accident was:\r\n- Loss of directional control developing from separation of the right nose-wheel tread,\r\n- Inability to stop within the normally adequate runway distance available due to use of differential braking, impaired performance and an increase in tailwind component and aircraft weight over those used in calculating the aircraft's accelerate/stop performance."}