{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54b-10-do-skymaster-near-issaquah-7-killed", "date": "Jan 7, 1953 at 2055 LT", "type": "Douglas C-54 Skymaster", "operator": "Flying%20Tiger%20Line", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Plain, Valley", "schedule": "Burbank – San Francisco – Seattle", "msn": "18350", "yom": 1944, "flight_number": "FT841", "city": "Issaquah", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 8590, "captain_hours_type": 2050, "copilot_hours": 3980, "copilot_hours_type": 837, "aircraft_hours": 20078, "circumstances": "Flying Tiger's Flight 841 of January 7, 1953, a ferry flight from Burbank, California, to Seattle, to pick up military personnel, was made in accordance with the company's contract with the Department of National Defense. Departure from Burbank was at 1437, with Captain C. Greber, pilot in command, Captain B. Merrill, and Copilot W. Lowe comprising the crew. Captain H. Wall, chief pilot of the company's Burbank Division, was on board as an observer. The weight of the aircraft at takeoff was 57,520 pounds which was within the maximum allowable gross weight; there was no revenue load. Throughout the segment of the flight to San Francisco, California, Captain Merrill and Captain Lowe flew the aircraft; with the exception of a false fire warning signal from the No. 3 engine nacelle observed in the cockpit shortly after takeoff, the flight to San Francisco was routine. Upon arrival there mechanics checked the fire warning system and found no evidence of a fire having occurred. Captain Merrill told the mechanics that he was satisfied from their inspection there was no danger of fire and that he would not delay the flight further. The malfunctioning fire waning system was not repaired at this time. Captain Wall terminated his flight at San Francisco and a company stewardess, together with a woman passenger and her two children (the wife and children of a company pilot), boarded the aircraft at this point to fly as non-revenue passengers. No fuel or cargo was added at San Francisco. Flight 841 departed San Francisco at 1737 with Captain Greber in command occupying the left pilot's seat and Captain Merrill occupying the copilot's seat. The flight was cleared by ARTC (Air Route Traffic Control) to fly VFR via Amber Airway No. 1 to Williams, California, and IFR from Williams to Boeing Field, Seattle, at an altitude of 11,000 feet MSL. The estimated time en route was three hours and 39 minutes with 1,500 gallons of fuel on board and the Seattle-Tacoma Airport was designated as the alternate. Normal en route position reports were made by the flight and at 1947 it reported being over Eugene, Oregon, at 11,000 feet. Seattle ARTC then cleared the flight to descend to and maintain 9,000 feet until passing Portland, Oregon, and from this point, to descend to and maintain 7,000 feet. At 2036 Flight 841 reported over the McChord radio range station and requested further clearance. Accordingly, ARTC cleared the flight to maintain 7,000 feet, to contact Seattle Approach Control immediately and advised that no delay was expected. Contact was immediately made with approach control; the flight was then cleared to make a standard range approach to Boeing Field and requested to report leaving each 1,000-foot level during the descent. The following weather information was given the flight at this time: \"Boeing Field - 1800 scattered, 2200 overcast, 8 miles, wind south-southeast 22, gusts to 30, altimeter 2925; Seattle-Tacoma - measured 1900 broken with 3100 over-cast.\" Flight 841 acknowledged this clearance and reported leaving 7,000 feet at 2040. Two minutes later, at 2042, it reported being over the outer marker and leaving the 6,000-foot level. No report of leaving the 5,000-foot level was made and at 2045 the flight advised it was leaving 4,000 feet. When the latter was acknowledged by approach control the flight was further advised as follows: \"If you're not VFR by the tine you reach the range you can shuttle on the northwest course at 2,000 feet, it's possible you'll break out in the vicinity of Boeing Field for a south landing.\" The flight acknowledged at 2050 and said it was leaving 3,000 feet. At the time N 86574 was making the approach to Boeing Field, a Pan American DC-4 aircraft was also approaching this airport from the northwest. The latter aircraft had been advised by approach control that it was No. 2 to land behind the Flying Tiger aircraft in the traffic pattern. The Pan American aircraft its making a routine let-down on the northwest leg on the Seattle range and at 2054 reported being at the 3,000-foot level and VFR. Immediately after receiving this altitude report approach control called N 86574 and advised: \"You're clear to contact Boeing Tower on 118.3 for landing instructions.\" This was acknowledged by \"Roger\" and was the last known contact with the Flying Tiger aircraft. At approximately 2055, N 86574 crashed about 11 miles east of the Seattle range station at the base of Squak Mountain. All seven occupants were killed and the aircraft was demolished by impact and the ensuing fire.", "probable_cause": "The Board determines that the probable cause of this accident was the flight's deviation from the established approach procedure to Boeing Field. The following findings were pointed out:\r\n- Although instrument weather conditions prevailed at the time of the approach to Seattle, no unusual weather existed which should have prevented the approach being made according to approved procedures,\r\n- The pilot of the aircraft deviated from the established approach procedure by flying 11 miles to the east of course,\r\n- All round navigational ads were functioning normally,\r\n- There was no indication of fire or malfunctioning of the aircraft or any of its components prior to first impact."}