{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-27-near-cayey", "date": "Sep 4, 2003 at 1708 LT", "type": "Britten-Norman Islander", "operator": "Venegas", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Isla de Culebra - Ponce", "msn": "868", "yom": 1978, "flight_number": null, "city": "Cayey", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3400, "captain_hours_type": 400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10608, "circumstances": "While on descent, the pilot reported that the airplane's left engine had lost power. He secured the left engine, and when he added power to the right engine, he believed it was not developing full power. He could not maintain altitude and elected to perform a forced landing in an open field. The airplane touched down long and with excessive speed on to the field striking trees, power lines and collided with the ground. A maintenance action entry in the aircraft's maintenance logbook indicate that the wing tip fuel tanks had the drain valve o-rings removed and replaced on the day before the accident. The maintenance entry states wing tip tanks were empty. The pilot stated he elected not to fuel either one of the wing tip tanks, due to the fact that maintenance was performed on them and did not select fuel from the wing tip tanks on the day of the accident. Excerpts from Airworthiness Directive (AD) 83-23-1, which is applicable to the accident airplane, states \"This is a tip-tanked aircraft. Tip-tanks are to be filled first-used last. Before take-off check both main and tip-tank contents\". AD 83-23-1 instructs to place a placard in clear view of the pilot on the instrument panel referring to the protocol of fueling and takeoff processors with regards to fuel tank contents. The mechanic who perform the maintenance to the wing tip tanks stated the placard was installed and in plain view of the pilot. The pilot stated he fueled the airplane with 50 gallons of aviation gasoline for a total of 90 gallons in both main tanks for the flight to Culebra from Ponce. The pilot went on to state prior to the return flight to Ponce from Culebra he checked his fuel quantity, which indicated he had 35 gallons in each main fuel tank for a total of 70 gallons aboard the airplane before departure. Fuel samples from both the FAA and the port authorities from the facility where the airplane was fueled for the flight showed no contamination as per the FAA Inspector statement. ", "probable_cause": "The loss of power on the left engine and partial lost of power on the right engine for undetermined reasons resulting in a force landing and impact with wires, tree, and terrain during subsequent force landing."}