{"url": "https://www.baaa-acro.com/crash/crash-canadair-cl-605-challenger-truckee-6-killed", "date": "Jul 26, 2021 at 1319 LT", "type": "Canadair CL-605 Challenger", "operator": "Tarco Aircraft Funding", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Coeur d'Alene - Truckee", "msn": "5715", "yom": 2008, "flight_number": null, "city": "Truckee", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On July 26, 2021, about 1318 pacific daylight time, a Bombardier Inc., CL-600-2B16 airplane, N605TR, was destroyed when it was involved in an accident near Truckee-Tahoe Airport (TRK), Truckee, California. The pilot, co-pilot and 4 passengers were fatally injured. The airplane was operated as a Title 14 Code of Federal Regulations Part 91 personal flight. According to automatic dependent surveillance-broadcast (ADS-B) data and preliminary air traffic control (ATC) audio from the Federal Aviation Administration, the airplane departed Coeur d’Alene, Idaho, about 1145 and made a left turn to the south. The flight crew was in contact with ATC throughout the duration of the flight. As the airplane was passing over northwestern Nevada, ATC began issuing descent instructions for the airplane’s approach into TRK. Once the airplane descended below 26,000 ft, ATC advised the flight crew to expect the RNAV (GPS) Runway 20 approach at TRK. The flight crew accepted the approach, but requested to circle to runway 11 for the longer runway and the controller told them to expect the circling approach. After coordinating with the TRK tower, the controller informed the flight crew that they would be number two for TRK and could expect some delays. ATC then cleared the airplane to hold north of the ALVAA waypoint, the initial approach fix to the RNAV runway 20 approach. After one turn in holding, ATC cleared the airplane for the RNAV runway 20 approach, cancelled radar services, and instructed the pilot to contact the TRK tower. The flight crew established communication with the TRK tower controller when they were near the LUMMO waypoint, located about 9.6 nm north of the approach end of runway 20. The tower controller offered the flight crew the option of crossing over the field and enter the left downwind leg for runway 29 or to enter downwind leg for runway 11. Once the flight crew announced they were making a right turn and reported runway 11 in sight, the controller then cleared them to land on runway 11 and informed them that the airplane was not in sight. The flight crew acknowledged the clearance, which was their final radio communication. Multiple eyewitnesses observed the airplane before the crash. Some reported that the airplane caught their attention because of its low altitude and abnormal flight path into runway 11. According to witnesses, the airplane was in a nose down attitude and steep left turn during its last few seconds of flight. A witness located about 50 ft from the accident site reported that he observed the airplane come from the northwest about 20 ft above the trees. The airplane then entered a steep left turn and banked erratically just before it impacted trees and then the ground. The witnesses close to the accident site stated that the airplane appeared intact when they first observed it. Three surveillance videos captured the accident flight’s final movements and were all consistent with the witness’ recounts. The accident site was located on a hillside between a golf course fairway and a residential street. The airplane was consumed by postcrash fire. A debris path, which measured about 225 ft long and 85 ft wide was marked by several broken trees and was oriented on an easterly heading. The initial point of impact was identified by a severed tree that stood about 70 ft tall, located about 120 ft west of the main wreckage. Portions of the right and left wings and control surfaces were found fragmented along the debris path. Additional airframe fragments were collocated with the main wreckage, which was comprised of both engines, the empennage, and fuselage remnants. ", "probable_cause": null}