{"url": "https://www.baaa-acro.com/crash/crash-avro-685-york-c1-northwood-7-killed", "date": "Jul 4, 1948 at 1503 LT", "type": "Avro 685 York", "operator": "Royal-Air-Force-4", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Luqa - Northolt", "msn": "MW248", "yom": 1946, "flight_number": null, "city": "Northwood", "zone": "London Metropolis", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine aircraft left Malta-Luqa Airport bound for RAF Northolt with four passengers and a crew of three on board. While approaching the London area, the crew encountered low visibility due to poor weather conditions. The crew was cleared to descent to 3,000 feet when the aircraft collided with a Scandinavian Airlines System (SAS) DC-6 registered SE-BDA. Inbound from Amsterdam, this second aircraft was carrying 25 passengers and a crew of 7. Following the collision, both aircraft went out of control, dove into the ground and crashed in a wooded area located in Northwood, about 4 miles north of RAF Northolt. Both aircraft were destroyed and all 39 people were killed. Among the passenger of the York was Sir Gerard Edward James, High Commissioner in Malaysia for Her Majesty the Queen of England.", "probable_cause": "The cause of the loss must in all probability be found in the field of human fallibility on the part of those responsible for the control of the aircraft from the ground or the flight of the aircraft in the air. Investigators found that the separation of 500 feet in force in the Northolt area, provided an inadequate margin of safety and recommended that it should be increased to 1,000 feet for the Metropolitan Control Zone. The report also discussed the standard setting for altimeters (known as QFF) that had been introduced in May 1948 for aircraft above 1,500 feet within control zones, and that any error in setting the barometric pressure of one millibar gave an error of 28 feet."}