{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-2f2-near-isparta-154-killed", "date": "Sep 19, 1976 at 2315 LT", "type": "Boeing 727-200", "operator": "Turkish-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Istanbul - Antalya", "msn": "20982", "yom": 1974, "flight_number": "TK452", "city": "Isparta", "zone": "Mediterranean Region (Akdeniz Bölgesi)", "country": "Turkey", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 146, "pax_fatalities": 146, "other_fatalities": 0, "total_fatalities": 154, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane departed Istanbul-Yeşilköy Airport at 2245LT on a scheduled flight to Antalya, carrying 146 passengers and a crew of eight. After passing over the Afyon VOR at an altitude of 25,000 feet, the crew requested the permission to descend to 13,000 feet. A 2311LT, the captain reported Antalya city lights in sight and started the descent to runway 36. At this time, the real position of the aircraft was about 100 km north of Antalya. Four minutes later, while descending by night under VFR mode at an altitude of 3,700 feet, the airplane struck the slope of Mt Karakaya (1,371 metres high) located south of Isparta. The airplane disintegrated on impact and debris were found at an altitude of 1,130 metres. All 154 occupants were killed. ", "probable_cause": "The airplane was descending by night under VFR mode to Isparta instead of Antalya after the flying crew mistook the city lights of Antalya with the ones of Isparta (100 km to the north). This error of judgment on part of the crew caused the aircraft to initiate the descent prematurely and to struck the mountain that the crew failed to locate due to lack of visual references. In consequence, the accident was the result of a controlled flight into terrain following navigational errors. "}