{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130h-hercules-near-edgemont-4-killed", "date": "Jul 1, 2012 at 1738 LT", "type": "Lockheed C-130 Hercules", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Colorado Springs - Colorado Springs", "msn": "5363", "yom": 1994, "flight_number": null, "city": "Edgemont", "zone": "South Dakota", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": 1966, "copilot_hours": null, "copilot_hours_type": 3647, "aircraft_hours": null, "circumstances": "On 1 July 2012, at approximately 1738 Local time, a C-130H3, Tail Number 93-1458, assigned to the 145th Airlift Wing, North Carolina Air National Guard, Charlotte Douglas International Airport (KCLT), Charlotte, North Carolina, crashed on public land managed by the United States Forest Service (USFS), while conducting wildland firefighting operations near Edgemont, South Dakota. At the time of the mishap all members of the Mishap Crew (MC) were assigned or attached to the 156th Airlift Squadron, based at KCLT. The Mishap Crew (MC) consisted of Mishap Pilot 1 (MP1), Mishap Pilot 2 (MP2), Mishap Navigator (MN), Mishap Flight Engineer (ME), Mishap Loadmaster 1 (ML1) and Mishap Loadmaster 2 (ML2). For the mishap sortie, MP1 was the aircraft commander and pilot flying in the left seat. MP2 was in the right seat as the instructor pilot. MN occupied the navigator station on the right side of the flight deck behind MP2. ME was seated in the flight engineer seat located between MP1 and MP2, immediately aft of the center flight console. ML1 and ML2 were seated on the Modular Airborne Fire Fighting System (MAFFS) unit, near the right paratroop door. ML1 occupied the aft MAFFS control station seat and ML2 occupied the forward MAFFS observer station seat. MP1, MP2, MN and ME died in the mishap. ML1 and ML2 survived the mishap, but suffered significant injuries. The mishap aircraft (MA) and a USFS-owned MAFFS unit were destroyed. The monetary loss is valued at $43,453,295, which includes an estimated $150,000 in post aircraft removal and site environmental cleanup costs. There were no additional fatalities, injuries or damage to other government or civilian property. ", "probable_cause": "The accident investigation report released by the Air Force Air Mobility Command said:\r\nI developed my opinion by inspecting the mishap site and wreckage, as well as analyzing factual data from the following: historical records, Air Force directives and guidance, USFS and Interagency guidance, reconstructing the mishap sortie in a C-130H3 simulator, engineering analysis, witness testimony, flight data, weather radar data, computer animated reconstruction, consulting with subject matter experts and information provided by technical experts. The failure of the Digital Flight Data Recorder severely complicated the recreation of the mishap, and impacted my ability to determine facts in this investigation. I find by clear and convincing evidence the cause of the mishap was MPl, MP2, MN and ME's inadequate assessment of operational conditions, resulting in the MA impacting the ground after flying into a microburst. Additionally, I find by the preponderance of evidence, the failure of the White Draw Fire Lead Plane aircrew and Air Attack aircrew to communicate critical operational information; and conflicting operational guidance concerning thunderstorm avoidance, substantially contributed to the mishap."}