{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-200-davao-city-131-killed", "date": "Apr 19, 2000 at 0701 LT", "type": "Boeing 737-200", "operator": "Air%20Philippines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Manila - Davao City", "msn": "21447", "yom": 1978, "flight_number": "2P541", "city": "Davao City", "zone": "Davao del Sur", "country": "Philippines", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 124, "pax_fatalities": 124, "other_fatalities": 0, "total_fatalities": 131, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 68475, "circumstances": "The aircraft was being flown as a route check for for a captain. Another captain was acting as Pilot Monitoring on the flight. The en route part of the flight was uneventful. The aircraft was conducting an ILS approach to runway 05 and the controller reported that they would be behind Philippine Airlines flight 809, an Airbus A319. As the Boeing 737 broke out of clouds, the A319 was observed on runway 05. The Pilot Flying informed ATC of his intention to perform a 360° maneuver, but the Pilot Monitoring advised ATC of the opposite, stating that the aircraft would turn right instead of following the missed approach procedure, which called for a left hand turn to a 020° heading. The aircraft re-entered clouds and attempted to fly visually at a lower altitude in instrument conditions when in fact it should have climbed to 4,000 feet. The flight continued over Samal Island and the flight requested a VOR/DME approach and landing in the opposite direction (runway 23), which was approved by the controller. After having aligned with the runway heading, the aircraft descended below the normal glide path for this approach. It continued down to 570 feet at a point where the aircraft should have been at 1,500 feet. The aircraft crashed into a coconut plantation on a hillside in Barangay San Isidro, disintegrated and caught fire. All 131 occupants were killed. ", "probable_cause": "Controlled flight into terrain."}