{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-30-tripoli-81-killed", "date": "Jul 27, 1989 at 0725 LT", "type": "Douglas DC-10", "operator": "Korean%20Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "City", "schedule": "Seoul - Bangkok - Jeddah - Tripoli", "msn": "47887", "yom": 1973, "flight_number": "KE803", "city": "Tripoli", "zone": "Tripoli (طرابلس)", "country": "Libya", "region": "Africa", "crew_on_board": 18, "crew_fatalities": 3, "pax_on_board": 181, "pax_fatalities": 72, "other_fatalities": 36, "total_fatalities": 111, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 49025, "circumstances": "The approach to Tripoli Intl Airport was completed in below weather minima as the visibility was varying between 100 and 800 feet and the ILS on runway 27 was unserviceable. On short final, the crew failed to realize his altitude was too low when the aircraft struck the roof of a house, stalled and crashed in a residential area located 2,4 km short of runway. Three crew members and 72 passengers were killed as well as six people on the ground. 124 people in the aircraft were injured as well as few dozen on the ground. ", "probable_cause": "The crew decided to continue the descent below the glide until the aircraft struck obstacles and crashed. The following contributing factors were reported:\r\n- Lack of visibility due to foggy conditions, \r\n- Below minima weather conditions, \r\n- The crew failed to initiate a go-around while he did not establish a visual contact with the runway,\r\n- The ILS system for runway 27 was unserviceable, \r\n- The crew failed to follow the approach procedures, \r\n- The crew ignored ATC warnings,\r\n- The approach speed was excessive and the flaps were not deployed in the correct angle,\r\n- The crew of a Russian aircraft diverted to Malta an hour before the accident due to unsafe landing conditions. "}