{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-80-dl-mt-illiniza-32-killed", "date": "Apr 7, 1958 at 0900 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Area%20Ecuador", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Guayaquil – Quito", "msn": "19779", "yom": 1944, "flight_number": "AR222", "city": "Mt Illiniza (24 Mayo)", "zone": "Cotopaxi", "country": "Ecuador", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 29, "pax_fatalities": 29, "other_fatalities": 0, "total_fatalities": 32, "captain_hours": 7402, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Flight 222 left Guayaquil at 0806 hours on a scheduled non-stop flight to Quito. The aircraft carried 32 persons, including 3 crew members and an infant. It was cleared to climb IFR on the Guayaquil-Esmeraldas track on a heading of 358°, then to continue in visual contact to Quito, after cancellation of the IFR flight. At 0819 the pilot contacted ATC and gave his estimated arrival over Manta radio beacon at 0841. One minute later the pilot reported at 4,000 feet, maintaining this altitude. At 0830 clearance was requested for a further IFR climb and the aircraft was told to wait. At 0836 clearance to climb was again requested and at 0840 clearance was given to climb IFR to 5,000 feet on the Guayaquil-Esmeraldas track. The pilot reported at 0841 as being over Manta beacon at 5,000 feet and estimated arrival at Quito at 0916. Clearance was granted for a climb to above the clouds on the same track. This was the last contact with the aircraft which, presumably, continued to fly in cloud without breaking through on top until it crashed at an altitude of 2,300 metres ( 7,500 feet) in the western mountains of the Chugchilán Range, killing all occupants.", "probable_cause": "The probable cause of the accident is that the pilot did not follow the 358° Guayaquii-Esmeraldas track, authorized for instrument flight, until clear of cloud, but probably assumed a heading of 250° as soon as he left Guayaquil, in order to fly the most direct route between Guayaquil and Quito. In so doing while on instruments, he deviated from the Guayaquil-Esmeraldas track at too low an altitude to clear the Chugchilán Range before him with an adequate safety margin. "}