{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-chute-des-passes-4-killed", "date": "Jul 16, 2010 at 1117 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Air%20Saguenay", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Lac des Quatre - Lac Margane", "msn": "1032", "yom": 1957, "flight_number": null, "city": "Chute des Passes", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 11500, "captain_hours_type": 9000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17204, "circumstances": "The float-equipped de Havilland Beaver DHC-2 Mk.I (registration number C-GAXL, serial number 1032), operated by Air Saguenay (1980) Inc., was flying under visual flight rules from Lac des Quatre to Lac Margane, Quebec, with 1 pilot and 5 passengers on board. A few minutes after take-off, the pilot reported intentions of making a precautionary landing due to adverse weather conditions. At approximately 1117, Eastern Daylight Time, the aircraft hit a mountain, 12 nautical miles west-south-west of the southern part of Lac Péribonka. The aircraft was destroyed and partly consumed by the fire that broke out after the impact. The pilot and 3 passengers were killed; 1 passenger sustained serious injuries and 1 passenger sustained minor injuries. No ELT signal was received.", "probable_cause": "Causes and Contributing Factors: \r\n1. The pilot took off in weather conditions that were below the minimum for visual flight rules, and continued the flight in those conditions.  \r\n2. After a late decision to carry out a precautionary alighting, the pilot wound up in instrument meteorological conditions (IMC). Consequently, the visual references were reduced to the point of leading the aircraft to controlled flight into terrain (CFIT).  \r\n3. The passenger at the rear of the aircraft was not seated on a seat compliant with aeronautical standards. The passenger was ejected from the plane at the moment of impact, which diminished his chances of survival.  \r\nFindings as to Risk:\r\n1. The lack of training on pilot decision-making (PDM) for air taxi operators exposes pilots and passengers to increased risk when flying in adverse weather conditions. \r\n2. In view of the absence of an ELT signal and the operator’s delay in calling, search efforts were initiated more than 3 ½ hours after the accident. That additional time lag can influence the seriousness of injuries and the survival of the occupants."}