{"url": "https://www.baaa-acro.com/crash/crash-learjet-25b-cedar-rapids", "date": "Sep 13, 2005 at 1330 LT", "type": "Learjet 25", "operator": "Barken International", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cedar Rapids – McAllen", "msn": "25-107", "yom": 1973, "flight_number": null, "city": "Cedar Rapids", "zone": "Iowa", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6225, "captain_hours_type": 350, "copilot_hours": 1107, "copilot_hours_type": 5, "aircraft_hours": 11970, "circumstances": "The airplane collided with a berm following a loss of directional control while landing. The airplane was on a 14 CFR Part 91 positioning flight at the time of the accident. The pilots reported that they encountered what they thought were rough spots on the runway during the takeoff roll. The captain reported that after takeoff, he called for the co-pilot to raise the gear and engage the yaw damper. The crew then noticed an unsafe gear indication for the nose gear. The captain stated they leveled off at 5,000 feet and decreased the airspeed so they could recycled the landing gear. Cycling the landing gear did not resolve the problem. The crew then requested to return to the departure airport for landing. The landing gear was extended and a gear down and locked indication for all three landing gear was observed. The captain stated that on touchdown, the co-pilot extended the spoilers and armed the thrust reversers. He stated that after the nose wheel touched down the airplane made a sharp left turn and traveled off the side of the runway through the grass. The airplane contacted a four-foot high berm prior to coming to a stop on another runway. The captain stated he attempted to taxi the airplane only to discover that they did not have any nose wheel steering. Post accident inspection revealed the seal on the nose gear strut had failed which prevented the nose gear from centering.", "probable_cause": "The pilot was not able to maintain directional control of the airplane due to the failure of the nose gear strut seal which prevented the nose wheel from centering. A factor associated with the accident was the berm that the airplane contacted."}