{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46f-1-cu-commando-sargasso-sea-28-killed", "date": "Jun 5, 1950 at 2203 LT", "type": "Curtiss C-46 Commando", "operator": "Westair Transport", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "San Juan – Wilmington", "msn": "22496", "yom": 1945, "flight_number": null, "city": "Sargasso Sea", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 62, "pax_fatalities": 28, "other_fatalities": 0, "total_fatalities": 28, "captain_hours": 7000, "captain_hours_type": 2500, "copilot_hours": 2000, "copilot_hours_type": 150, "aircraft_hours": 2890, "circumstances": "The flight departed from Isle Grande Airport, San Juan, Puerto Rico, at 1724, June 5, 1950, for Wilmington, North Carolina Joe M Halsey was the captain in command, William Holleran, copilot, and Hector Medina, steward In addition to the 62 passengers and three crew members, the aircraft carried 8,436 pounds of fuel and 1,363 pounds of baggage, which resulted in a total aircraft weight at the time of takeoff of 48,258 pounds This was 258 pounds in excess of the certificated limit. Prior to their departure from San Juan, the crew filed with the CAA (Civil Aeronautics Administration) air route traffic control (ARIC) at San Juan an instrument flight plan which described the intended route to he from San Juan to the Caribbean island of South Caicos, then to the Carp Intersection, which is a point located approximately 144 miles southeast of Wilmington, and from there to Wilmington 3 This over-water route carried the flight more than 400 miles east of the mainland of the United States and north of the Bahama Island chain Cruising altitude was to be 6,500 feet, and the estimated time to destination six hours and 50 minutes. No difficulty was experienced by the crew during the first four hours of flight, and in a report transmitted to the San Juan Communications Station at 2117 the crew estimated that its position at 2148 would be 28 degrees 33' north latitude and 74 degrees 58' west longitude This point is 390 miles east of Melbourne, Florida, and 300 miles northeast of Nassau in the Bahamas A few minutes before the flight arrived over this estimated position the crew noticed that the indicated right engine oil quantity had fallen from 32 gallons to 20 Immediately after this was observed, the left engine backfired and lost power. Application of carburetor heat and adjustment of fuel mixture and other engine controls were ineffectual, so the left propeller was feathered Captair Halsey then took over the flight controls from Copilot Holleran who had been piloting, and the aircraft was headed toward Nassau, the closest island with an adequate landing field He then sent a message at 2146 to the Overseas Foreign Aeronautics Communications Station (OFACS) at Miami, which was intercepted by the CAA Communications Station at San Juan, that the left propeller was feathered and the flight was proceeding toward Nassau Power settings for the right engine were increased to 2400 rpm and 30 in manifold pressure The cruising altitude of .6,500 feet was maintained for about five minutes During the transition to single-engine flight the air speed decreased from 178 to 140 miles per hour. Shortly before the left engine was feathered, a second C-46, N-1246N, operated by the same corporation, passed this flight flying in the opposite direction toward San Juan The crew in the second  aircraft was contacted and requested to stand by This was done, and they were able to give assistance by maintaining communications with shore stations in the rescue operations which were to follow. Shortly after the 214,6 message that the left propeller was feathered, the crew in N-1248N observed that the indicated oil quantity for the right engine had fallen from 20 to 15 gallons At about the same time the crew also observed that the right engine was overheating with an indicated cylinder head temperature of nearly 300 degrees centigrade Because of this condition, Captain Halsey said that he began a voluntary descent to ditch before complete right engine failure occurred A message was sent at 2154, \"Been losing altitude, at 1500\" Six minutes later, at 2200, a second message was sent, \"200 feet, losing altitude\" And then a third, at 2203, \"Just about in the drink\". An attempt was made to hold altitude at 200 feet above the water until shore stations could obtain radio bearings According to the captain, the right engine speed decreased from 2400 to 2250 rpm and could not he increased Air speed was then reduced to between 100 and 110 miles per hour by retarding the right throttle, and the aircraft was ditched about 20 minutes after the malfunctioning of the left engine began The wing flaps and landing lights were not used. At the time, the weather was clear and the wind was from the southwest at approximately 10 miles per hour The moon had not risen, but the visibility was such that whitecaps could he seen. As soon as the aircraft came to rest in the water, the crew entered the cabin where they opened the main cabin door and the emergency exits The emergency exits were not opened prior to the ditching as prescribed in the company's Operation Manual Some of the passengers then climbed out onto the wings, and others jumped into the sea All seven of the 10-man life rafts were thrown overboard, five floated away in the darkness because their retaining ropes were not held, two were inflated The three crew members and 34 of the 62 passengers were able to swim to and board the two life rafts. The captain stated that he was the last person to leave the aircraft The crew did not take with them the emergency transmitter known as the \"Gibson Girl\" (which broadcasts on frequencies of 500 and 8280 kilocycles), and it went down with the aircraft The captain, however, saved a flashlight Much of the other emergency equipment on the two crowded life rafts was thrown overboard by the passengers. During the night five flares were fired at intervals but were not observed The second C-46, which had remained in the search area, reported at 2321, one hour and eighteen minutes after N-1248N had ditched, that they saw a blinking light on the water They requested Miami Communications to obtain a fix At 0018, about one hour after this fix was requested, the Federal Communications Commission reported a \"fair\" fix had been established on the second aircraft, the position being 28 degrees 10' north latitude and 75 degrees 12' west longitude The following morning a Coast Guard aircraft located the survivors, and shortly afterwards the USS Saufley, a U S Navy destroyer, drew alongside and rescued those in the two life rafts One survivor, who had clung to an uninflated raft during the night, was located, but was killed by sharks before he could be taken from the water The position of the rescue was 27 degrees 51' north latitude and 75 degrees 22' west longitude.", "probable_cause": "The Board determines that the probable cause of this accident was the malfunctioning of both engines from causes unknown."}