{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-4-amsterdam-2-killed", "date": "May 25, 1953 at 1530 LT", "type": "Convair CV-240", "operator": "KLM-21", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Amsterdam – Paris", "msn": "125", "yom": 1949, "flight_number": null, "city": "Amsterdam", "zone": "North Holland", "country": "Netherlands", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 28, "pax_fatalities": 0, "other_fatalities": 2, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7104, "circumstances": "After a run of 700 meters on runway 05, the captain started to rotate. During the initial climb, at a height of approximately 50 to 60 feet and at a speed of 233 km/h, the pilot-in-command retracted the flaps when the aircraft lost height and stalled. The pilot closed the throttles and belly landed the airplane on the remaining runway. The aircraft slid for 200 meters, overran, crossed a road where it struck two standing girls before coming to rest near a drainage ditch, broken in two. All 34 occupants were evacuated safely while two girls aged 16 and 4 were killed. The aircraft was destroyed. ", "probable_cause": "The exact cause of the accident could not be determined with certainty. During the extensive technical investigation no facts were found to be true for a technical failure of any part of the aircraft before the accident. The damping of the cable tensioners did not fully meet the specifications however, the Board considered that this could hardly have affected steerability. The ascent was somewhat flatter than normal and possibly created the rapid execution of the commands \"flaps up\" and \"first power reduction\" provide a greater condition steering movement required than the captain was used to. That need not be serious as long as the captain retained the confidence he had could bring back the plane in ascending flight. All in all, the investigation did not provide a clear cause for the captain Of course it is important that one of the conclusions of the Council was that “On the basis of the foregoing, the Board, together with the preliminary investigator, is of the opinion that in this case does not warrant the application of any sanction against the person is present."}