{"url": "https://www.baaa-acro.com/crash/crash-avro-748-372-2b-sun-city", "date": "Apr 16, 2002 at 1334 LT", "type": "Avro 748", "operator": "AirQuarius", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Skukuza - Sun City", "msn": "1796", "yom": 1982, "flight_number": null, "city": "Sun City", "zone": "North West", "country": "South Africa", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 42, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3846, "captain_hours_type": 755, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During the flight from Skukuza to Pilanesberg the aircraft developed a hydraulic problem, resulting in a complete hydraulic failure. However, a safe landing was carried out at Pilanesberg on Runway 23. Shortly after the landing the pilot shut down both engines, but maintained the runway heading for approximately 2000m, before the aircraft veered off to the left of the runway where it entered a ditch, 75m from the runway edge, where it finally stopped. There were no injuries, but the aircraft sustained extensive damage and substantial damage was caused to the perimeter fence around the airport. Both the pilot and the co-pilot were correctly licenced and type rated on the aircraft. Apart from the CVR, which was inoperative at the time of the accident and a leaking L/H hydraulic pump, it would appear that the aircraft was correctly maintained. Fine weather conditions prevailed at the time of the accident. The pilot informed Pilanesberg ATC of a complete hydraulic failure, but did not declare an emergency. The pilot failed to switch off the Nose Wheel Steering after touchdown and also shut down both hydraulic cut-off switches. The Emergency Checklist does not provide for a complete hydraulic failure. ", "probable_cause": "The accident resulted from a complete hydraulic failure, probably as a result of a leak on the L/H engine pump, which was not dealt with properly. Contributing to this was an incomplete emergency checklist."}