{"url": "https://www.baaa-acro.com/crash/crash-fairchild-f27b-pedro-bay-39-killed", "date": "Dec 2, 1968 at 0936 LT", "type": "Fairchild F27", "operator": "Wien%20Consolidated%20Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Anchorage – Iliamna – Big Mountain – King Salmon – Dillingham", "msn": "49", "yom": 1959, "flight_number": "WC055", "city": "Pedro Bay", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 36, "pax_fatalities": 36, "other_fatalities": 0, "total_fatalities": 39, "captain_hours": 10557, "captain_hours_type": 5357, "copilot_hours": 12087, "copilot_hours_type": null, "aircraft_hours": 17194, "circumstances": "A Wien Consolidated Airlines Fairchild F-27B, N4905, crashed at Pedro Bay, Alaska. The 36 passengers and three crew members were killed in the accident and the aircraft was destroyed by in-flight breakup and ground impact. The aircraft was being operated as Flight 55 in scheduled domestic passenger service between Anchorage International Airport, AK (ANC) and Dillingham Municipal Airport, AK (DLG) with en route stops at Iliamna Airport, AK (ILI), Big Mountain Airport, AK (BMX), and King Salmon Airport, AK (AKN). Flight 55 departed from Anchorage at 08:46 on an instrument flight plan for Iliamna. The flight was cleared to cruise at 16,000 feet. The weather at Iliamna was reported to be clear, and the visibility was 15 miles at the time of the flight's departure from Anchorage. The flight proceeded toward Iliamna without reported difficulty, and at 09:25, the first officer requested a clearance for an approach to Iliamna. This request was approved. No further communication was received from the crew. Ground witnesses in and around the Pedro Bay area reported that they saw a fireball and a large cloud of black smoke which appeared to be behind the wing of the aircraft. The aircraft appeared to continue on course for a short period of time, then pieces of the aircraft were seen falling, and the aircraft entered a spinning descent. The major portion of the wreckage was located on the southern shore of Foxies Lake at an elevation of approximately 220 feet.", "probable_cause": "The Board determines that the probable cause of this accident was an in-flight structural failure caused by an encounter with severe to extreme turbulence. This turbulence was not forecast and its presence was not known to the flight crew. The failure occurred in an area of the right wing (WS 197) which had been weakened to an indeterminate degree by pre-existing fatigue cracks."}