{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-0-elizabeth-30-killed", "date": "Jan 22, 1952 at 1544 LT", "type": "Convair CV-240", "operator": "American-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "City", "schedule": "Buffalo – Rochester – Syracuse – Newark", "msn": "54", "yom": 1948, "flight_number": "AA6780", "city": "Elizabeth", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 18, "pax_fatalities": 18, "other_fatalities": 7, "total_fatalities": 30, "captain_hours": 7062, "captain_hours_type": 2483, "copilot_hours": 2174, "copilot_hours_type": 405, "aircraft_hours": 6633, "circumstances": "The approach to Newark was completed in marginal weather conditions with a ceiling at 400 feet and a 3/4 mile visibility. For unknown reason, the aircraft deviated from the approach path to the left and, in a relative flat attitude, hit an obstacle and eventually crashed in flames on several houses located in the city of Elizabeth, about three miles from runway 06 threshold. All 23 occupants on board the aircraft and seven people in the ground were killed while nine others were injured. Few houses were destroyed. ", "probable_cause": "The Board determines that there is insufficient evidence available at this time upon which to predicate a probable cause. The following findings were pointed out: \r\n- The flight was routine from Buffalo and was cleared to descend and make an ILS approach, monitored by GCA, to the Newark airport,\r\n- Weather conditions below the 4,000-foot level at Newark were favorable to the formation of carburetor ice,\r\n- The flight reported over Linden, New Jersey, at 1,500 feet inbound to the airport at 1541,\r\n- The Newark weather conditions at 1540 were reported as indefinite ceiling 400 feet, obscurement, visibility 3/4 mile, light rain and fog, altimeter 29 97,\r\n- The aircraft vanished from the GCA screens at a point approximately 900 feet to the right of the glide path and while at an altitude of 400 feet, due to ground interference,\r\n- The weather information indicated lower ceilings and visibilities near the scene of the accident (about three miles southwest of the airport) than were reported at the airport,\r\n- The aircraft was headed in an easterly direction, below the overcast, in a near level attitude, for a distance of approximately 1,300 feet, before it crashed into buildings."}