{"url": "https://www.baaa-acro.com/crash/crash-rockwell-500u-shrike-commander-badu-island", "date": "Mar 8, 2015 at 1230 LT", "type": "Rockwell Shrike Commander 500", "operator": "Torres%20Strait%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Badu Island - Horn Island", "msn": "500-1656-11", "yom": 1966, "flight_number": null, "city": "Badu Island", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 8 March 2015, the pilot of an Aero Commander 500 aircraft, registered VH-WZV, prepared to conduct a charter flight from Badu Island to Horn Island, Queensland, with five passengers. The aircraft had been refuelled earlier that day at Horn Island, where the pilot conducted fuel drains with no contaminants found. He had operated the aircraft for about 2 hours prior to landing at Badu Island with no abnormal performance or indications. At about 1330 Eastern Standard Time (EST), the pilot started the engines and conducted the standard checks with all indications normal, obtained the relevant clearances from air traffic control, and taxied for a departure from runway 30. As the pilot lined the aircraft up on the runway centreline at the threshold, he performed a pre-take-off safety self-brief and conducted the pre-takeoff checks. He then applied full power, released the brakes and commenced the take-off run. All engine indications were normal during the taxi and commencement of the take-off run. When the airspeed had increased to about 80 kt, the pilot commenced rotation and the nose and main landing gear lifted off the runway. Just as the main landing gear lifted off, the pilot detected a significant loss of power from the left engine. The aircraft yawed to the left, which the pilot counteracted with right rudder. He heard the left engine noise decrease noticeably and the aircraft dropped back onto the runway. The pilot immediately rejected the take-off; reduced the power to idle, and used rudder and brakes to maintain the runway centreline. The pilot initially assessed that there was sufficient runway remaining to stop on but, due to the wet runway surface, the aircraft did not decelerate as quickly as expected and he anticipated that the aircraft would overrun the runway. As there was a steep slope and trees beyond the end of the runway, he steered the aircraft to the right towards more open and level ground. The aircraft departed the runway to the right, collided with a fence and a bush resulting in substantial damage. The pilot and passengers were not injured.", "probable_cause": null}