{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-35-marquise-hilton-head-1-killed", "date": "Aug 1, 2001 at 0751 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Bankair", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Columbia – Savannah – Hilton Head", "msn": "567", "yom": 1972, "flight_number": "BKA170", "city": "Hilton Head", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4184, "captain_hours_type": 483, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11612, "circumstances": "The airplane was on final approach to land at Hilton Head Airport, when according to witnesses, it suddenly rolled to the right, and descended, initially impacting trees at about the 70-foot level, and then impacting the ground. A fire then ensued upon ground impact, and the debris field spanned about 370 feet along an azimuth of about 082 degrees. Examination of the airplane wreckage revealed that left wing flap actuator and jack nut measurements were consistent with the wing flaps being extended to 40 degrees, and on the right wing the flap jack nut and actuator measurements were consistent with the right flap being extended to about a 20-degrees. In addition, the right flap torque tube assembly between the flap motor and the flap stop assembly had disconnected, and the flap torque tube assembly's female coupler which attaches to the male spline end of the flap motor and flap stop assembly was found with a cotter pin installed through the female coupler of the flap stop assembly. The cotter pin, had not been placed through the spline and the coupler consistent with normal installation as per Mitsubishi's maintenance manual, or as specified in Airworthiness Directive 88-23-01. Instead, the cotter pin had missed the male spline on the flap motor. In addition, the flap coupler on the opposite side of the flap motor was found to also found to not have a cotter pin installed. Company maintenance records showed that on April 3, 2001, about 87 flight hours before the accident, the airplane was inspected per Airworthiness Directive (AD) 88-23-01, which required the disassembly, inspection, and reassembly of the flap torque tube joints. In addition, on July 9, 2001, the airplane was given a phase 1 inspection, and Bankair records showed that a company authorized maintenance person performed the applicable maintenance items, and certified the airplane for return to service.", "probable_cause": "Improper maintenance/installation and and inadequate inspection of the airplane's flap torque tube joints during routine maintenance by company maintenance personnel, which resulted in the right flap torque tube assembly coupler becoming detached and the flaps developing asymmetrical lift when extended, which resulted in an uncontrolled roll, a descent, and an impact with a tree during approach to land."}