{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-30cf-malaga-50-killed", "date": "Sep 13, 1982 at 1200 LT", "type": "Douglas DC-10", "operator": "Spantax-2", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Madrid – Málaga – New York", "msn": "46962", "yom": 1977, "flight_number": "BX995", "city": "Málaga", "zone": "Andalusia", "country": "Spain", "region": "Europe", "crew_on_board": 13, "crew_fatalities": 3, "pax_on_board": 381, "pax_fatalities": 47, "other_fatalities": 0, "total_fatalities": 50, "captain_hours": 16129, "captain_hours_type": 2119, "copilot_hours": 6840, "copilot_hours_type": 2165, "aircraft_hours": 15364, "circumstances": "Takeoff acceleration was normal, failure was not detected on engines, systems or structures. The crew registered a strong vibration at or close to V1. The captain felt how this vibration was highly increased as he began rotation, consequently rejecting the takeoff at a speed between VR and V2. Physical evidence shows how detachment of the tread of a tire of the nose gear, retreated, began before the aircraft had reached V1. The reject of takeoff began where there were another 1,295 meters (4,250 feet) of runway left. The aircraft crossed the runway end at a speed slightly over 110 knots, colliding with an ILS concrete building, breaking the metal fencing of the airport, crossing a highway, causing damage to three vehicles on the same, colliding then with farming construction. Engine number three detached after impact with the ILS building. Approximately three quarters of the right wing as well as the right horizontal stabilizer were detached as a result of the impact with the afore mentioned farming construction. The fuselage also ran over the construction with which the right wing collided. The aircraft stopped 450 meters (1,475 feet) away from the end of runway 14, and approximately 40 meters (130 feet) off to the left from the centerline. Neither the passenger department nor the cockpit showed damage that could impede survival when the aircraft stopped. Fuel was spilled off the right wing, from the time it collided with the farming construction, and the fire began in the rear of the fuselage. The fire destroyed the aircraft completely. There were 381 passengers and 13 crew members on board. 333 passengers and 10 crew survived, and as a result of the fire subsequent to the impact, 47 passengers and three assistant crew members died. ", "probable_cause": "The Commission determines the cause of the accident to be the fractional detachment of the retread of the right wheel of the nose gear, originating a strong vibration which could not be identified by the captain, leading him into the belief that the aircraft would become uncontrollable in flight, and thus deciding to abandon the take-off over VR. The decision of aborting the take-off, though not in accordance with the standard operation procedure, is in this case considered reasonable, on the base of the irregular circumstances that the crew had to face, the short period of time available to take the decision, the lack of training in case of wheel failure and the absence of take-off procedures when failure other than that of the engines occurs."}