{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-scottsdale-2-killed", "date": "Jan 26, 2003 at 2023 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "NDB Equipment Finance", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Scottsdale – Santa Fe", "msn": "61-0785-8063398", "yom": 1980, "flight_number": null, "city": "Scottsdale", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1450, "captain_hours_type": 160, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2574, "circumstances": "The airplane collided with mountainous terrain 5 miles from the departure airport during a dark night takeoff. Review of recorded radar data found a secondary beacon code 7267 (the code assigned to the airplane's earlier inbound arrival ) on the runway at 2021:08, with a mode C report consistent with the airport elevation. Two more secondary beacon returns were noted on/over the runway at 2021:12 and 2021:19, reporting mode C altitudes of 1,600 and 1,700 feet, respectively. Between 2021:08 and 2021:38, the secondary beacon target (still on code 7267) proceeded on a northeasterly heading of 035 degrees (runway heading) as the mode C reported altitude climbed to 2,000 feet and the computed ground speed increased to 120 knots. Between 2021:38 and 2021:52, the heading changed from an average 035 to 055 degrees as the mode C reports continued to climb at a mathematically derived 1,300 feet per minute and the ground speed increased to average of 170 knots. At 2022:23, the code 7267 target disappeared and was replaced by a 1200 code target. The mode C reports continued to climb at a mathematically derived rate of 1,200 feet per minute as the ground speed increased to the 180- knot average range. The computed average heading of 055 degrees was maintained until the last target return at 2022:53, which showed a mode C reported altitude of 3,500 feet. The accident site elevation was 3,710 feet and was 0.1 miles from the last target return. The direct point to point magnetic course between Scottsdale and Santa Fe was found to be 055 degrees. Numerous ground witnesses living at the base of the mountain where the accident occurred reported hearing the airplane and observing the aircraft's lights. The witnesses reported observations consistent with the airplane beginning a right turn when a large fireball erupted coincident with the airplane's collision with the mountain. No preimpact mechanical malfunctions or failures were found during an examination of the wreckage. The radar data establishes that the pilot changed the transponder code from his arrival IFR assignment to the VFR code 30 seconds before impact and this may have been a distraction.", "probable_cause": "The pilot's failure to maintain an adequate altitude clearance from mountainous terrain. Contributing factors were dark night conditions, mountainous terrain, and the pilot's diverted attention."}