{"url": "https://www.baaa-acro.com/crash/crash-bae-3201-jetstream-31-heraklion", "date": "Feb 12, 2009 at 1723 LT", "type": "BAe Jetstream 31", "operator": "Sky%20Express-2_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rhodes – Heraklion", "msn": "829", "yom": 1988, "flight_number": "SEH103", "city": "Heraklion", "zone": "Crete / Κρήτη", "country": "Greece", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 15, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 24000, "captain_hours_type": 570, "copilot_hours": 1800, "copilot_hours_type": 250, "aircraft_hours": 13222, "circumstances": "Flight SEH102/103 of 12 February 2009 was a scheduled passenger carrying flight performing the route Heraklion – Rhodes – Heraklion. The crew that was going to perform the flight reported for duty at 16:00 h. The aircraft had earlier on the same day performed, with a different flight crew, four routes (Heraklion – Rhodes – Heraklion and Heraklion – Samos – Heraklion), without any problems being reported. Nothing had been observed during the pre-flight check. The aircraft departed Heraklion at 16:55 h and landed at Rhodes at 17:35 h without incident. At 18:30 h the aircraft departed Rhodes for Heraklion, carrying three crew members and 15 passengers. The pilot flying (PF) this particular sector was the Pilot in Command (PIC). At a distance of 30 nm from Heraklion and at a altitude of 7700 ft on its descent to 3000 ft, the crew informed the Air Traffic Control that it had the runway in sight and requested and was granted clearance to perform a visual approach. The aircraft, fully configured for landing from a distance of 7nm, approached the airport for landing at runway 27. The wind information provided by the Air Traffic Control was 18 kt – 25 kt, from 210°. While approaching the runway, the PF asked the First Officer (FO) to check the angle of descent based on the APAPIs’ of the runway. The FO confirmed the correct angle of descent, saying “one white, one red”. The aircraft crossed the threshold with a speed of 112 kt and after flaring the PF reduced speed to Flight Idle and touched down with a speed of 86 kt. As the speed was being gradually reduced, the PF had difficulty with controlling the aircraft along its longitudinal axis and noticing that the aircraft was leaning somewhat to the right, reported to the FO that “the gear has broken”. Immediately afterwards, the blades of the right propeller of the aircraft struck the runway. As the aircraft continued to move with the left main landing gear wheel operating normally and the collapsed right main landing gear, folded backwards under the wing, being dragged along the runway, the crew stopped the engines, reported to the Airport Control Tower that the right landing gear had broken and requested evacuation. The aircraft stopped in the runway with its nose wheel at 4.6 m to the right of the center line, at a distance of 930 m from the point of the propeller’s first contact with the runway. Immediately afterwards the PF ordered the cabin crew to open the cabin door and evacuated the aircraft, and the FO, who observed some fuel leaking from the right engine, switched off the electrical systems and requested through the Airport Control Tower that the fire trucks, which were on their way, to throw foam on the right wing to prevent any fire being started. The passengers disembarked from the left aft door without any problems with the assistance of the cabin crew, while the fire trucks covered the right wing with foam as a preventive measure. The airport, applying the standing procedures, removed the aircraft and released the runway for operation at 22:30 h. During the period of time that runway 09/27 remained out of operation, two flights approaching the airport for landing were diverted to Chania Airport, and the departures of another three flights were delayed. ", "probable_cause": "CONCLUSIONS\r\nFindings:\r\n- The flight crew met all the requirements for the performance of the flight.\r\n- The aircraft was airworthy.\r\n- The aircraft’s landing gears have a life of 50,000 cycles (landings) and the interval between two overhauls is six years or 10,000 cycles, whichever comes sooner.\r\n- The fractured landing gear had completed 23,940 cycles since new and had been subjected to an overhaul on 17.09.08. Since then and as of the date of the accident it had completed 148 cycles.\r\n- The aircraft manufacturer had issued an SB, and the UK Civil Aviation Authority an AD, asking for tests and inspection applicable to Region “A” of the main landing gear cylinders.\r\n- Said AD had been carried out without findings in the course of the landing gear overhaul of 17.09.08 by an EASA-Part 145 approved maintenance organization. \r\n- On 02.01.09 a visual inspection of Region “A” of the main landing gear cylinders was carried out by the aircraft operator’s maintenance organization, in accordance with Part B of the SB, again without findings.\r\n- On 07.02.09 and in the morning of 12.02.09 the aircraft made ‘heavy’ landings considering that vertical acceleration values of 2.8 g and 2.5 g, respectively, had been recorded. None of these landings had been recorded in the aircraft’s log in order to trigger the inspection prescribed in the aircraft’s maintenance manual after a ‘heavy’ landing. \r\n- According to the technical examination of the fractured parts, the first crack developed in Region “A” (fracture surface “A2-B2”) increasing the loading upon the cylinder material surrounding the threaded fasteners, sites of stress concentration. The second and third cracks then initiated at the site of stress concentration and propagated within the cylinder to form fracture surfaces “A1” - “B1” in the region surrounding the threaded fasteners. The cracks and the fracture resulted from the ductile overload of the undercarriage cylinder which is likely to have resulted from a ‘heavy’ landing made by the aircraft.\r\nProbable Causes:\r\nLanding gear cylinder failure because of ductile overload resulting from a ‘heavy’ landing made by the aircraft."}