{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-near-tonganoxie-2-killed", "date": "Jun 24, 2008 at 1020 LT", "type": "Rockwell Shrike Commander 500", "operator": "Central%20Air%20Southwest", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Kansas City - Lawrence", "msn": "500-3097", "yom": 1971, "flight_number": null, "city": "Tonganoxie", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 10500, "captain_hours_type": 7550, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12427, "circumstances": "The airline's chief pilot was giving a newly-hired pilot a required competency/proficiency check. Memory data from the airplane's global positioning system showed the airplane made\r\nsteep 360-degree turns to the left and right before continuing towards a practice area at gradually decreasing airspeed and altitude. A low cloud ceiling prevailed. Witnesses said they\r\nheard both engines \"sputter, then quit,\" and saw the airplane clear a grove of trees, stall, and strike the ground. The landing gear was down and the flaps were in the approach setting. Both propellers were in the low pitch/high rpm setting, and bore little rotational signatures. Both engine fuel supply lines contained only residual fuel. Those familiar with the chief pilot's flying practices stated that he always followed a certain routine when giving a check ride. The routine consisted of the following: After performing steep 360-degree turns, he would ask the trainee to configure the airplane for landing and demonstrate minimum control maneuvers. Prior to executing steep turns, he would turn the boost pumps on. At the completion of the maneuver, the pumps would be turned off. The investigation revealed that there are unguarded fuel shutoff switches next to the boost pumps, and the circumstances of the accident are consistent with the these fuel shutoff switches being inadvertently placed in the off position, instead of the fuel boost pumps.", "probable_cause": "The pilot-in-training inadvertently shutting off both engine fuel control valves causing a loss of power in both engines, and the pilot's failure to maintain control of the airplane resulting in a stall. Contributing to the accident was the chief pilot's inadequate supervision of the pilot-in-training."}