{"url": "https://www.baaa-acro.com/crash/crash-boeing-757-23apf-uberlingen-2-killed", "date": "Jul 1, 2002 at 2335 LT", "type": "Boeing 757-200", "operator": "DHL", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Bahrain - Bergamo - Brussels", "msn": "24635", "yom": 1990, "flight_number": "DHX611", "city": "Überlingen", "zone": "Baden-Württemberg", "country": "Germany", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 11942, "captain_hours_type": 4145, "copilot_hours": 6604, "copilot_hours_type": 176, "aircraft_hours": 39022, "circumstances": "On 1 July 2002 at 21:35:32 hrs a Tupolev TU-154M on its flight from Moscow-Domodedovo /Russia to Barcelona/ Spain and a Boeing B757-200, which was on a flight from Bergamo /Italy to Brussels /Belgium, collided near the town of Ueberlingen (Lake Constance) in a dark night; the in-flight visibility at the flight level concerned was 10 km and more. Both airplanes impacted the ground north of the town of Ueberlingen. A larger number of witnesses had become aware of the accident by explosive noises, a prolonged roaring and rumbling as well as reflections of fire. Many of them saw pieces of debris burning while falling from the sky. The histories of the flights were reconstructed on the basis of the evaluation of the airborne flight data recorders (FDR) and cockpit voice recorders (CVR) and of the TCAS data stored in the airplanes, the radio communications between the Swiss Air Traffic Control Centre (ACC Zurich) and the crews of the Tupolev TU-154M and the Boeing B757-200 stored on the ground and the ground radar data recorded by the Swiss Air Navigation Services.\r\nBoeing B757-200:\r\nDuring the whole month of June 2002 both pilots, the pilot-in-command (PIC) and the copilot, had flown together as a crew. Several times they flew the route Bahrain - Bergamo - Brussels -\r\nBahrain. The last flight prior to this flight cycle was conducted on 28 June 2002 on the route Brussels – Bahrain. Prior to this flight the crew was off duty for 75 hours. They checked in at 11:50 hrs in Bahrain. At 13:30 hrs the airplane departed from Bahrain airport (OBBI) for a cargo flight to Brussels EBBR) with one intermediate stop at Bergamo (LIME). Only the two pilots were aboard the aircraft. The landing at Bergamo airport took place at 19:10 hrs after a flight time of 05 hours 40 minutes. In Bergamo, the airplane was refuelled, unloaded and reloaded with cargo. Take-off to continue the flight to Brussels was at 21:06 hrs. The airplane was flown by the copilot (PF). The flight was conducted under instrument flight rules (IFR). The flight plan (FPL) included the following information relevant to the flight: Aerodrome of departure: LIME, scheduled time of departure: 21:00 hrs, cruise speed: 463 kt, cruise level: FL 360, flight route: ABESI-UN851-TGO-UL608-LAMGO-UZ738-ANEKI-UZ917- BATTY, aerodrome of destination: EBBR, estimated flight time: 01:11 hrs, alternate aerodrome: EDDK (Cologne). At 21:21:50 hrs, the PIC contacted ACC Zurich on the frequency 128.050 MHz at FL 260 and in direct approach to the waypoint ABESI. At 21:21:56 hrs, the transponder code 7524 was assigned. With the identification of the airplane a clearance for a direct approach to the TANGO VOR as well as for a climb from FL 260 to FL 320 was given. The PIC requested to climb to FL 360, which was approved approximately four minutes later at 21:26:36 hrs. At 21:29:50 hrs the airplane reached this flight level, without the pilots reporting it. At 21:34:30 hrs the copilot handed over the control of the airplane to the PIC in order to go to the lavatory installed in a cubicle at the rear of the cockpit. At 21:34:31 hrs the PIC confirmed that he had taken over. At 21:34:42 hrs the airborne TCAS alarmed the crew about possibly conflicting traffic by a Traffic Advisory (TA): “traffic, traffic\". After the TA the CVR recorded clicking noises. 14 seconds later (21:34:56 hrs) TCAS issued a Resolution Advisory (RA) “descend, descend\". Approximately two seconds later the autopilot (AP) was switched off, the control column pushed and the thrust of the engines reduced. FDR data shows that the pitch was reduced from 2.5° to approximately 1.5° and the vertical acceleration lowered from about 1.0 g to 0.9 g. According to the FDR and the TCAS recordings the airplane had reached a rate of descent of 1500 ft/min 12 seconds after the autopilot had been switched off. At 21:35:05 hrs the CVR recorded via the cockpit area microphone the remark of the copilot “traffic right there“ which was confirmed by the PIC with “yes“. At 21:35:10 hrs, i.e. 14 seconds after the RA “descend, descend“, TCAS issued the advisory to increase the descent (“increase descent, increase descent“). At this time the copilot had returned to his work station and put on his headset. His reaction to the RA was recorded as \"increase\". Following this RA, the rate of descent was changed and reached approximately 2600 ft/min 10 seconds later. During the descent the pitch angle decreased to –1° and the powerplant thrust was reduced to approximately 1.2 (EPR). According to the CVR at 21:35:14 hrs a Master Caution Aural Warning is heard for two seconds. According to the FDR the autothrottle was switched off by the crew at 21:35:18 hrs. At 21:35:19 hrs the crew reported the “TCAS descent“ to ACC Zurich. Subsequently the copilot requested the PIC twice to descend. Once with the word “descend“ (21:35:26 hrs) and then by saying “descend hard“ (21:35:30 hrs). Approximately two seconds prior to the collision the control column was pushed fully forward. At 21:35:32 hrs the airplane flying a northern heading (MH = 004°) with a pitch angle of approximately – 2° and no bank angle collided with the TU154M at 34 890 ft.\r\nTupolev TU-154M:\r\nThe crew was off duty for 24 hours before take-off for the charter flight to Barcelona (LEBL). They checked in at 17:30 hrs. At 18:48 hrs the airplane departed from the airport Moscow-Domodedovo (UUDD). Nine crew members and 60 passengers were aboard the airplane. The flight was conducted under instrument flight rules (IFR) in accordance with the flight plan (FPL) filed. The FPL included the following information relevant to the flight: Aerodrome of departure: UUDD, planned time of departure: 18:30 hrs, cruise speed: 880 km/h, cruise level: 10 600 m, flight route: KLIMOVSK-KAMENKA-ZAKHAROVKA-R11-YUKHNOVB102-BAEVO/cruise speed: 470 kt, cruise level: FL 360, flight route: UL979-MATUS-UM984-BOLMU-UT43-STOCKERAU-UR23-SALZBURG-UL856-TRASADINGEN-Z69-OLBEN-UN869-OLRAK-UN855-PERPIGNAN-UB384-GIRONA-UB38-SABADELL, aerodrome of arrival: LEBL, estimated flight time: 04:20 hours, alternate aerodrome: LEGE (Girona). Five flight crew members were in the cockpit. The commander (under supervision) - who was the PF (Pilot flying) on this flight - occupied the left-hand seat in the cockpit. The right-hand seat was occupied by an instructor, who as a PNF (Pilot non flying) also conducted the radio communications. He was also the pilot-in-command (PIC). The seat of the flight navigator was between and slightly behind the pilots. The work station of the flight engineer was behind the instructor. A further pilot (copilot), who had no function on this flight, was on a vacant seat behind the commander. At 21:11:55 hrs - near Salzburg still over Austrian territory - the crew received the clearance from Vienna radar for a direct approach to the Trasadingen VOR at FL 360. At 21:16:10 hrs, the airplane entered German airspace and was controlled by Munich Radar. At 21:29:54 hrs, the crew was instructed by Munich to change over to ACC Zurich on 128.050 MHz. At 21:30:11 hrs and at FL 360 the PNF contacted ACC Zurich. At 21:30:33 hrs, ACC Zurich assigned the transponder code 7520 to the airplane, which was acknowledged 6 seconds later. For the time between about 21:33:00 hrs and 21:34:41 hrs the CVR recorded crew discussions concerning an airplane approaching from the left which was displayed on the vertical speed indicator (VSI/TRA) which is part of the TCAS. All flight crew members with the exception of the flight engineer were involved in these discussions. These recordings suggest that the crew strived to localize the other airplane as to its position and its flight level. At 21:34:36 hrs, the commander stated: “Here it is in sight“, and two seconds later: “Look here, it indicates zero“. During the time from 21:34:25 hrs to 21:34:55 hrs, the airplane turned at a bank angle of approximately 10° from a magnetic heading (MH) of 254° to 264°. At 21:34:42 hrs, TCAS generated a TA (“traffic, traffic“). The CVR recorded that both the PIC and the copilot called out “traffic, traffic“. At 21:34:49 hrs - i.e. seven seconds later - ACC Zurich instructed the crew to expedite descent to FL350 with reference to conflicting traffic (“...... descend flight level 350, expedite, I have crossing traffic“). While the controller was giving the instruction - the radio transmission took just under eight seconds - the PIC requested the PF to descend. At 21:34:56 hrs, the control column was pushed forward, the autopilot (pitch channel) was switched off and the powerplant thrust reduced to approximately 72 % (N1). FDR data shows a reduction of the pitch angle of the airplane from 0° to approximately –2.5° as well as a reduction of the vertical acceleration from approximately 1 g (normal acceleration of the earth near the airplane centre of gravity) to 0.8 g. The instruction to descend was not verbally acknowledged by the crew. At the same time (21:34:56 hrs) TCAS generated an RA (“climb, climb“). At 21:34:59 hrs, the CVR recorded the voice of the copilot stating: “It (TCAS) says (говорит): “climb“. The PIC replied: “He (ATC) is guiding us down“. The copilot's enquiring response: “descend?“ At 21:35:02 hrs, (six seconds after the RA “ climb, climb”) the PF pulled the control column. As a result, the rate of descent ceased to increase. The vertical acceleration rose from 0.75 g to 1.07 g. The engine thrust remained unchanged in conjunction with this control input (refer to Appendix 5a). At 21:35:03 hrs, the engine throttles were pulled back further. The discussion between the crew members was interrupted at 21:35:03 hrs by the controller instructing the crew once again to expedite descend to FL 350 (“... descend level 350, expedite descend“).This instruction was immediately acknowledged by the PNF. The controller then informed the crew about other flight traffic at FL 360 in the 2 o’clock position (“...Ya, … we have traffic at your 2 o’clock position now at 3-6-0“) and the PIC asked: “Where is it?“, the copilot answered: “Here on the left side!“. At the time, the rate of descent was approximately 1 500 ft/min. The voice of the flight navigator can be heard on the CVR saying:\" It is going to pass beneath us!\" while the controller was giving his last instruction. At 21:35:04 hrs the roll channel of the autopilot was switched off. At 21:35:05 hrs, the PF pushed the control column again and the rate of descent increased to more than 2 000 ft/min. From 21:35:07 hrs to 21:35:24 hrs the aircraft heading changed to the right from 264° to 274° MH. At 21:35:24 hrs TCAS issued an RA “increase climb“. The copilot commented this with the words: “It says ‘climb”! At the time of the RA „increase climb“, the FDR recorded a slow movement of the control column nose down leading to a change in pitch angle from –1° to approximately –2° and in a reduction in vertical acceleration. The descent rate was approximately 1800 ft/min (refer to Appendix 5b). Five seconds before the collision the control column was pulled back, associated with a minor increase of thrust levers setting. One second prior to the collision the pitch angle reached –1° and the vertical acceleration 1.1 g. During the last second before the collision the control column was pulled back abruptly and the thrust levers were pushed fully forward. At the time of the collision the pitch angle was 0°; the vertical acceleration was 1.4 g but the airplane was still in a descent. The airplane collided with a heading of 274° and a bank angle to the right of 10° with the Boeing B757-200 at 21:35:32 hrs at a flight level of 34 890 ft. After the collision, the TU154M rolled with increasing rate about the longitudinal axis to the left. Simultaneously with this rolling movement the extension of the aileron-spoiler on the right wing was recorded. Within approximately two seconds after the collision the pitch angle changed from 0° to -6° and the cabin differential pressure decreased within one second from 0.6 kg/cm2 to a value close to 0 kg/ cm2.", "probable_cause": "The following immediate causes have been identified:\r\n• The imminent separation infringement was not noticed by ATC in time. The instruction for the TU-154M to descend was given at a time when the prescribed separation to the B757-\r\n200 could not be ensured anymore.\r\n• The TU-154M crew followed the ATC instruction to descend and continued to do so even after TCAS advised them to climb. This manoeuvre was performed contrary to the generated TCAS RA.\r\nThe following systemic causes have been identified:\r\n• The integration of ACAS/TCAS II into the system aviation was insufficient and did not correspond in all points with the system philosophy. The regulations concerning ACAS/TCAS published by ICAO and as a result the regulations of national aviation authorities, operational and procedural instructions of the TCAS manufacturer and the operators were not standardised, incomplete and partially contradictory.\r\n• Management and quality assurance of the air navigation service company did not ensure that during the night all open workstations were continuously staffed by controllers.\r\n• Management and quality assurance of the air navigation service company tolerated for years that during times of low traffic flow at night only one controller worked and the other one retired to rest."}