{"url": "https://www.baaa-acro.com/crash/crash-avro-748-faa-2a-near-pinckneyville-10-killed", "date": "Oct 11, 1983 at 2053 LT", "type": "Avro 748", "operator": "Air%20Illinois.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Chicago - Springfield - Carbondale", "msn": "1716", "yom": 1972, "flight_number": "UX710", "city": "Pinckneyville", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 5891, "captain_hours_type": 3170, "copilot_hours": 5119, "copilot_hours_type": 1746, "aircraft_hours": 21182, "circumstances": "Flight 710 departed Chicago, IL for a flight to Carbondale, IL via Springfield, IL. The flight was about 45 minutes behind schedule when it arrived at Springfield, about 20:05. At 20:11, the flightcrew were provided with the latest Carbondale weather: ceiling and visibility were 2,000 feet overcast and 2 miles, respectively, with light rain and fog. The crew then requested its IFR clearance, with 5,000 feet for its en route altitude. At 20:16, Flight 710 was cleared to taxi to runway 15 for takeoff. The aircraft took off at 20:20 and climbed to cruising altitude. At 20:21:34, Flight 710 informed the departure controller that it had experienced a \"slight electrical problem...\" and that it would keep the controller \"advised.\" The flight then requested and was cleared to maintain 3,000 feet. At 20:23:54, the first officer told the captain that \"the left (generator) is totally dead, the right (generator) is putting out voltage but I can't get a load on it.\" At 20:24:26, the first officer reported, \"zero voltage and amps (amperes) on the left side, the right (generator) is putting out twenty-seven and a half (volts) but I can't get it to come on the line.\" The battery voltage further dropped to 22 volts. The crew a.o. shut off excess cabin lights because of the electrical problem. About 20:38, the first officer mistakenly isolated the right generator and right generator bus bar from the aircraft's dc electrical distribution system. Radio contact was lost when the flight was requested to change radio frequencies. At 20:52 the captain decided to descend to 2,400 feet and the voltage had further dropped to 13 volts. The aircraft continued to descend and struck the ground in an open pasture area.", "probable_cause": "The captain's decision to continue the flight toward the more distant destination airport after the loss of d.c. electrical power from both aircraft generators instead of returning to the nearby departure airport. The captain's decision was adversely affected by self-imposed psychological factors which led him to assess inadequately the aircraft's battery endurance after the loss of generator power and the magnitude of the risks involved in continuing to the destination airport. Contributing to the accident was the airline management's failure to provide and the FAA's failure to assure an adequate company recurrent flight crew training programme which contributed to the captain's inability to assess properly the battery endurance of the aircraft before making the decision to continue, and led to the inability of the captain and the first officer to cope promptly and correctly with the aircraft's electrical malfunction.\"\r\nPatricia A. Goldman, Vice Chairman, filed the following concurring/dissenting statement:\r\n\"While the accident report correctly identifies training and surveillance, I believe that inclusion of these items in the probable cause statement obscures and detracts from the basic reason the accident occurred and the attendant safety lesson. The pilot should never have continued the flight to the destination airport, but should have returned to the nearby airport on realizing that electrical d.c. power had been lost.\""}