{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154m-burdakovka-145-killed", "date": "Jul 4, 2001 at 0208 LT", "type": "Tupolev TU-154", "operator": "Vladivostok%20Avia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Yekaterinburg – Irkutsk – Vladivostok", "msn": "86A735", "yom": 1986, "flight_number": "XF352", "city": "Burdakovka", "zone": "Irkutsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 136, "pax_fatalities": 136, "other_fatalities": 0, "total_fatalities": 145, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 20953, "circumstances": "The airplane departed Yekaterinburg Airport on a regular schedule flight (XF352) to Vladivostok with an intermediate stop at Irkutsk. The flight departed Yekaterinburg at 1947LT and climbed to the assigned cruising altitude of 10,100 metres. Some three hours into the flight, at 0150LT, the crew started the descent to Irkutsk Intl Airport. The copilot was the pilot-in-command. At 0205LT, the crew reported at 2,100 metres with the runway in sight. At this time, the aircraft' speed was 540 km/h. The maximum speed at which the landing gear may be lowered was 400 km/h. At 0206:56 the airplane leveled off at 900 metres with an airspeed still at 420 km/h. The first officer asked for gear down and the speed further decreased to 395 km/h with engines at idle. When the gear was down and locked, the airplane entered a left bank angle of 20-23°. The airspeed continued to drop to 365 km/h while the recommended speed was 370 km/h at this stage of the flight. Power was added slowly. This was only just sufficient for maintaining an altitude of 850 metres at 355-360 km/h. At 0207:46, while still in the left hand turn, the angle of attack increased to 16,5° because the autopilot attempted to maintain altitude with a decreasing speed. An aural warning sounded, informing the crew about a high angle of attack. The first officer attempted to correct this by using the control column and disconnected the autopilot. Because he deflected the control column to the left, the left bank increased to the maximum permissible value of -30° to -44°, and then to -48°. In a nose down attitude, the speed increased to 400 km/h then the aircraft entered clouds. By night, the crew lost visual contact with the ground and was not able to observe the natural horizon. In such conditions, the captain took over controls but alternately deflected the steering wheel to the left and right. An intensive deflection of steering control to the right caused a positive angular acceleration of +4,4° per second. The captain reacted by deflecting the steering wheel to the left again. The first officer now realized that the airplane was in a severe left bank of -45° and indicated that they should be rolling to the right. Because of an increase in vertical descent rate of 20 metres per seconds, one of the crew members pulled the control column. The airplane pitched up rapidly then entered a stall and a subsequent flat spin before crashing in an open field 22 seconds later. The aircraft was totally destroyed by impact forces and a post crash fire and all 145 occupants were killed. ", "probable_cause": "The accident was the consequence of a wrong approach configuration on part of the flying crew. The following contributing factors were identified:\r\n- Poor control actions on part of the crew, which caused the aircraft to enter a super critical angle of attack followed by a stall and a spin,\r\n- Violation of interactions by the crew regarding the separation of responsibilities for piloting established by the pilot-in-command,\r\n- Lack of proper control to maintain flight parameters during the approach, in reference to the TU-154 flight operations manual, \r\n- Poor crew interactions."}