{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-fort-lauderdale-1-killed", "date": "Apr 17, 2009 at 1115 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Sebring%20Air%20Charter", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "City", "schedule": "Fort Lauderdale - Fernandina Beach", "msn": "421B-0836", "yom": 1974, "flight_number": null, "city": "Fort Lauderdale-Executive", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 23000, "captain_hours_type": 5000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Prior to the accident flight witnesses observed the pilot \"haphazardly\" pouring oil into the right engine. The pilot then ran the engines at mid-range power for approximately 20 minutes. The airplane subsequently taxied out of the ramp area and departed. Fire was observed emanating from the right engine after rotation. The airplane continued in a shallow climb from the runway, flying low, with the right engine on fire. The airplane then banked right to return to the airport and descended into a residential area. Examination of the right engine revealed an exhaust leak at the No. 4 cylinder exhaust riser flange. Additionally, one of the flange boltholes was elongated, most likely from the resulting vibration. The fuel nozzle and B-nut were secure in the No. 4 cylinder; however, its respective fuel line was separated about 8 inches from the nozzle. No determination could be made as to when the fuel line separated (preimpact or postimpact) due to the impact and postcrash fire damage. Examination of the right engine turbocharger revealed that the compressor wheel exhibited uniform deposits of an aluminum alloy mixture, consistent with ingestion during operation, and most likely from the melting of the aluminum fresh air duct. Additionally, the right propeller was found near the low pitch position, which was contrary to the owner's manual emergency procedure to secure the engine and feather the propeller in the event of an engine fire.", "probable_cause": "The pilot's failure to maintain aircraft control and secure the right engine during an emergency return to the airport after takeoff. Contributing to the accident was an in-flight fire of the right engine for undetermined reasons.\n"}