{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t1-cheyenne-i-near-ely-2-killed", "date": "Dec 15, 2012 at 1000 LT", "type": "Piper PA-31 Cheyenne", "operator": "Nothman Jerry Company Trustee", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Mesa - Portland", "msn": "31-8004029", "yom": 1980, "flight_number": null, "city": "Ely", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6336, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5725, "circumstances": "The private pilot and passenger departed on the 875-nautical-mile cross-country flight and leveled off at a cruise altitude of 24,000 feet mean seal level, which, based on the radar data, was accomplished with the use of the autopilot. About 1 hour 40 minutes after departure, the pilot contacted air traffic control personnel to request that he would “like to leave frequency for a couple of minutes.” No further radio transmissions were made. About 20 seconds after the last transmission, the airplane banked to the right, continued in a spiral while rapidly descending, and subsequently broke apart. At no time during the flight did the pilot indicate that he was experiencing difficulty or request assistance. Just prior to departing from the flight path, the pilot made an entry of the engine parameters in a flight log, which appeared to be consistent with his other entries indicating the airplane was not experiencing any difficulties. Portions of the wings, along with the horizontal stabilizers and elevators, separated during the breakup sequence. Analysis of the fracture surfaces, along with the debris field distribution and radar data, revealed that the rapid descent resulted in an exceedance of the design stress limits of the airplane and led to an in-flight structural failure. The airplane sustained extensive damage after ground impact, and examination of the engine components and surviving primary airframe components did not reveal any mechanical malfunctions or failures that would have precluded normal operation. The airplane was flying on a flight path that the pilot was familiar with over largely unpopulated hilly terrain at the time of the upset. The clouds were well below his cruising altitude, giving the pilot reliable external visual cues should the airplane have experienced a failure of either the flight instruments or autopilot. Further, no turbulence was reported in the area. The airplane was equipped with a supplemental oxygen system, which the pilot likely had his mask plugged into and available in the unstowed position behind his seat; the passenger’s mask was stowed under her seat. The airplane’s autopilot could be disengaged by the pilot by depressing the appropriate mode switch, pushing the autopilot disengage switch on the control wheel, or turning off the autopilot switch on the control head. All autopilot servos were also equipped with a clutch mechanism that allowed the servo to be manually overridden by the pilot at any time. It is likely that the reason the pilot requested to “leave the frequency” was to leave his seat and attend to something in the airplane. While leaving his seat, it is plausible he inadvertently disconnected the autopilot and was unable to recover by the time he realized the deviation had occurred.", "probable_cause": "The pilot’s failure to regain airplane control following a sudden rapid descent during cruise flight, which resulted in an exceedance of the design stress limits of the aircraft and led to an in-flight structural failure. "}