{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-12-near-kepino-5-killed", "date": "Mar 4, 1955 at 1051 LT", "type": "Ilyushin II-12", "operator": "Polyarnaya%20Aviatsiya", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Mys-Kamennyy – Amderma – Arkhangelsk – Moscow", "msn": "30 236", "yom": 27, "flight_number": null, "city": "Kepino", "zone": "Arkhangelsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 4, "pax_on_board": 20, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2630, "circumstances": "While cruising at an altitude of 2,700 meters between Amderma and Arkhangelsk, a technical failure occurred on the manifold of the left engine, causing fuel to spill in the nacelle and a fire to develop. The crew tried to extinguish the fire but without success. So the captain decided to attempt an emergency landing when the aircraft hit trees and crashed in a dense wooded area located near Poltozero Lake. Rescuers arrived on site a day later and were able to evacuate 26 wounded people while five others were killed, among them four crew members as the cockpit was totally destroyed upon impact. ", "probable_cause": "It was determined that the direct cause of the accident was a fire that occurred in the nacelle of the left engine due to the failure of a fuel line, presumably from a ringing tube located in the left nacelle as a result of a metallurgical defect. The fuel then spilled inside the nacelle and ignited in contact with exhaust gases. The nacelle caught fire and later, the engine detached. It was also reported that the validity of the certificate of airworthiness expired on March 2, which obviously did not provide an opportunity to fly to Pevek and back. A small remainder of the resource obliged the crew to closely monitor the condition of the material part and regularly perform the required maintenance at the intermediate airports. In fact, the crew in the process of the flight exceeded the established daily norm and failed to perform the 25-hour routine maintenance during the three-day parking at Pevek Airport."}