{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh34-ivinghoe-beacon-5-killed", "date": "Sep 14, 1923 at 1805 LT", "type": "De Havilland DH.34", "operator": "Daimler%20Airways", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Croydon - Manchester", "msn": "29", "yom": 1922, "flight_number": null, "city": "Ivinghoe Beacon", "zone": "Buckinghamshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 755, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight was a scheduled domestic passenger flight from Croydon to Manchester. Whilst flying over Buckinghamshire, a storm was encountered. Witnesses stated that an engine stopped, but was then restarted. It appeared to them that an emergency landing was going to be made at Ford End, Ivinghoe, when the aircraft dived to the ground and crashed at Ivinghoe Beacon. The wreckage came to rest upside down, with both crew and all three passengers being killed. One witness reported hearing a violent explosion, but was not sure whether this was before the aircraft crashed or as a result of the crash. Villagers extricated the victims from the wreckage. The deceased were taken to Ivinghoe Town Hall pending an inquest by the coroner. As a result of the crash, Daimler Airway temporarily suspended their service between Croydon and Manchester, due to having no aircraft to operate it. The inquest opened on 17 September at Ivinghoe Town Hall. Evidence was given that the pilot was experienced, having flown for 755 hours, and that the aircraft was airworthy on departure from Croydon. It was carrying an adequate supply of fuel, having departed Croydon with 73 imperial gallons (330 l) of fuel against an estimated consumption of around 50 imperial gallons (230 l). The aircraft could carry eight passengers, but as only three were on board 400 pounds (180 kg) of ballast was carried, as well as a quantity of mail. Witnesses reported that the aircraft stalled before crashing. ", "probable_cause": "Air Ministry announced that as a result of the investigation into the circumstances of the accident to aircraft G-EBBS, the Inspector of Accidents has arrived at the following conclusions:\r\na) That the accident was due to an error of judgment on the part of the pilot, causing the aeroplane to lose flying speed near the ground.\r\nb) That when the accident occurred the pilot was attempting to make a landing on account of the bad weather conditions.\n"}