{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-580-near-marseilles-38-killed", "date": "Mar 5, 1967 at 2007 LT", "type": "Convair CV-580", "operator": "Lake%20Central%20Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Chicago – Lafayette – Cincinnati – Columbus – Toledo – Detroit", "msn": "23", "yom": 1952, "flight_number": "LK527", "city": "Marseilles", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 35, "pax_fatalities": 35, "other_fatalities": 0, "total_fatalities": 38, "captain_hours": 22425, "captain_hours_type": 403, "copilot_hours": 4166, "copilot_hours_type": 250, "aircraft_hours": 16216, "circumstances": "While descending to Toledo Airport and flying at an altitude of 7,000 feet, all four propeller blades on the right engine detached simultaneously. The blade number two penetrated the fuselage, causing a sudden cabin decompression. The pilot lost control of the airplane that entered a dive and eventually crashed in an open field located two miles southeast of Marseilles, Ohio. The aircraft was totally destroyed and none of the 38 occupants survived the crash. ", "probable_cause": "Failure of the right propeller due to the omission of the torque piston nitriding process during manufacture, and the failure of manufacturing quality control to detect the omission.\r\nThe following findings were reported: \r\n- Loads on the torque cylinder caused by the failed torque piston of the n° 3 blade of the right propeller exceeded the finite fatigue of the cylinder and it failed in fatigue, \r\n- The loss of oil pressure in the right propeller due to the failed torque cylinder caused the propeller pitch to decrease at a rate which exceeded the propeller pitch lock capability, \r\n- The right propeller oversped, causing the blades to separate in overstress, \r\n- The n°2 propeller blade of the right propeller penetrated the fuselage, destroying the structural integrity to the extent that together with the force of a right yaw attending the propeller separation, the fuselage failed along the line of the propeller penetrations, \r\n- The torque piston n°3 blade had not been nitrided to surface hardening of the helical splines during the manufacture, \r\n- The omission of the nitriding process was not detected by inspection, \r\n- The omission of the nitriding process was associated with the movement of 10 torque pistons from the normal production flow to the Allison laboratory and return to the production process, \r\n- The Allison quality control system lacked the accountability necessary to assure the requisite quality of the individual parts, \r\n- The metal contamination oil check to isolate defective torque piston did not serve the intended purpose, \r\n- Allison underestimated the seriousness of the defective torque piston problem. "}