{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-76td-charkhi-dadri-37-killed", "date": "Nov 12, 1996 at 1840 LT", "type": "Ilyushin II-76", "operator": "Kazakhstan%20Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Shymkent - New Delhi", "msn": "10234 13428", "yom": 1992, "flight_number": "KZA1907", "city": "Charkhi Dadri", "zone": "Haryana", "country": "India", "region": "Asia", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 27, "pax_fatalities": 27, "other_fatalities": 0, "total_fatalities": 37, "captain_hours": 9229, "captain_hours_type": 1488, "copilot_hours": 6822, "copilot_hours_type": 409, "aircraft_hours": 2643, "circumstances": "The Ilyushin II-76TD departed Shymkent Airport on a regular schedule service (flight KZA1907) to New Delhi-Indira Gandhi, carrying 27 passengers and 10 crew members. Following an uneventful flight, the crew was cleared to start the descent to New Delhi via route G452 and was instructed to maintain FL150. At 1833LT, a Boeing 747-168B operated by Saudi Arabian Airlines (Saudia) departed New Delhi-Indira Gandhi Airport on a flight to Jeddah (flight SV763) with an intermediate stop in Dhahran, carrying 289 passengers and 23 crew members. After takeoff, its crew was instructed to climb to FL140 via the same route G452. For unknown reasons, the Kazair crew continued the descent below FL150 until both aircraft faced each other and collided at 1840LT at FL140, seven minutes after the B747 takeoff. After the collision, both aircraft entered an uncontrolled descent and crashed in an open field located about 3 km Charkhi Dadri, some 80 km west of New Delhi-Indira Gandhi Airport. Both aircraft were destroyed by impact forces and a post crash fire and all 349 occupants in both aircraft were killed.", "probable_cause": "It was determined that the collision was the consequence of the failure of the Kazair crew to follow the assigned altitude of 15,000 feet while approaching New Delhi. The crew of the Kazair II-76 was instructed by ATC to continue the descent to Indira Gandhi Airport via the same route G452 but at an altitude of 15,000 feet (14,000 feet for the Saudia B747). For unknown reasons, the Kazair crew continued the descent below FL150 without clearance until both aircraft faced each other and collided. During the minutes preceding the accident, both Kazair and Saudia crew have been informed by ATC about other traffic."}