{"url": "https://www.baaa-acro.com/crash/crash-gvf-ps-84-moscow-13-killed", "date": "Jun 18, 1942", "type": "GVF PS-84", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "City", "schedule": "Moscow – Kazan – Khabarovsk", "msn": "6 5 05", "yom": 29, "flight_number": null, "city": "Moscow-Khodynka", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 17, "pax_fatalities": 9, "other_fatalities": 1, "total_fatalities": 13, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2041, "circumstances": "While on ground in Moscow-Khodynka Airport, the right engine was subject to maintenance due to vibrations. The technical issue was apparently resolved so the crew decided to leave Moscow for Kazan. After liftoff, while climbing to a height of 100 meters, the right engine suffered severe vibrations and the crew tried to fix the problem by changing the mixture of the carburetor. The right engine failed and the aircraft lost height and eventually stalled and crashed on a railway line located in the station of Moscow-Butyrskaya, about 3,5 km northeast of the Khodynka Airport. Three crew members, nine passengers (among them P. S. Makarova, Deputy of the Chairman of the Soviet Supreme) and one person on the ground were killed. A crew member and eight other passengers were injured and the aircraft was destroyed. ", "probable_cause": "The malfunction of the right engine was due to a multiple issues caused by a lack of monitoring on part of the company technicians and a poor design/conception. It was reported that the crew decided to leave Moscow because they thought the problem was resolved. Unfortunately, this was not the case and the engine suffered severe vibrations again after liftoff. The decision of the crew to interact on the carburetor mixture without knowing the exact cause of the technical issue was inappropriate. Investigations pointed out the intervention of unqualified technicians in Sverdlovsk and the lack of organization on maintenance between the technicians based in Sverdlovsk and Moscow."}