{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-10-ermenonville-346-killed", "date": "Mar 3, 1974 at 1141 LT", "type": "Douglas DC-10", "operator": "Turkish-Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Ankara - Paris - London", "msn": "46704", "yom": 1972, "flight_number": "TK981", "city": "Ermenonville", "zone": "Oise", "country": "France", "region": "Europe", "crew_on_board": 12, "crew_fatalities": 12, "pax_on_board": 334, "pax_fatalities": 334, "other_fatalities": 0, "total_fatalities": 346, "captain_hours": 7003, "captain_hours_type": 438, "copilot_hours": 5589, "copilot_hours_type": 628, "aircraft_hours": 2955, "circumstances": "On Sunday March 3, 1974 flight TK981 departed Istanbul for a flight to Paris and London. The DC-10 landed at Paris-Orly at 11:02 and taxied to stand A2. There were 167 passengers on board, of whom 50 disembarked. The aircraft was refueled and baggage was loaded onto the plane. The planned turnaround time of one hour was delayed by 30 minutes. An additional 216 passengers embarked. Most of the passengers were booked on this flight because of a strike at British Airways. The door of the aft cargo compartment on the left-hand side was closed at about 11:35. When all preparations were complete the flight received permission to taxi to runway 08 at 12:24. Four minutes later the crew were cleared to line up for departure and were cleared for departure route 181 and an initial climb to flight level 40. The aircraft took off at approximately 12:30 and was cleared by Orly Departure to climb to FL60, which was reached at 12:34. The North Area Control Centre then cleared TK981 further to FL230. Three or four seconds before 12:40:00 hours, the noise of decompression was heard and the co-pilot said: \"the fuselage has burst\" and the pressurization aural warning sounded. This was caused by the opening and separation of the aft left-hand cargo door. The pressure difference in the cargo bay and passenger cabin, the floor above the cargo door partly collapsed. Two occupied tripe seat units were ejected from the aircraft. All the horizontal stabilizer and elevator control cables routed beneath the floor of the DC-10 and were thus also severely disrupted. Also the no. 2 engine power was lost almost completely. The aircraft turned 9 deg to the left and pitched nose down. The nose-down attitude increased rapidly to -20 deg. Although the no. 1 and 3 engines were throttled back the speed increased to 360 kts. The pitch attitude then progressively increased to -4 degrees and the speed became steady at 430 kts (800 km/h). At a left bank of 17 degrees the DC-10 crashed into the forest of Ermenonville, 37 km NE of Paris. The aircraft disintegrated on impact and all 346 occupants were killed, among them 48 Japanese citizens and almost 250 British people.  ", "probable_cause": "The accident was the result of the ejection in flight of the aft cargo door on the left-hand side: the sudden depressurization which followed led to the disruption of the floor structure, causing six passengers and parts of the aircraft to be ejected, rendering No.2 engine inoperative and impairing the flight controls (tail surfaces) so that it was impossible for the crew to regain control of the aircraft. The underlying factor in the sequence of events leading to the accident was the incorrect engagement of the door latching mechanism before take-off. The characteristics of the design of the mechanism made it possible for the vent door to be apparently closed and the cargo door apparently locked when in fact the latches were not fully closed and the lock pins were not in place. It should be noted, however that a view port was provided so that there could be a visual check of the engagement of the lock pins. This defective closing of the door resulted from a combination of various factors:\r\n- Incomplete application of Service Bulletin 52-37;\r\n- Incorrect modifications and adjustments which led, in particular, to insufficient protrusion of the lock pins and to the switching off of the flight deck visual warning light before the door was locked;\r\n- The circumstances of the closure of the door during the stop at Orly, and, in particular, the absence of any visual inspection, through the viewport to verify that the lock pins were effectively engaged, although at the time of the accident inspection was rendered difficult by the inadequate diameter of the view port. \r\nFinally, although there was apparent redundancy of the flight control systems, the fact that the pressure relief vents between the cargo compartment and the passenger cabin were inadequate and that all the flight control cables were routed beneath the floor placed the aircraft in grave danger in the case of any sudden depressurization causing substantial damage to that part of the structure. All these risks had already become evident, nineteen months earlier, at the time of the Windsor accident, but no efficacious corrective action had followed."}