{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-cuers", "date": "Feb 10, 2012 at 1715 LT", "type": "Socata TBM-700", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Maribo – Cuers", "msn": "157", "yom": 1999, "flight_number": null, "city": "Cuers", "zone": "Var", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8000, "captain_hours_type": 6000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot took off at around 14 h 45 from Maribo aerodrome (Denmark) bound for Cuers. He filed an IFR flight plan that he cancelled(2) at 17 h 15 near the St Tropez VOR (83). He explained that he had overflown the installations at Cuers at 1,500 ft and started an aerodrome circuit via the north for runway 11. He was visual with the ground and noted the presence of snow showers. He reckoned that these conditions made it possible to continue the approach. At about 600 ft, he went into a snow shower. At about 400 ft, he noticed that the horizontal visibility was zero and that he had lost all external visual references. He tried to make a go-around but didn’t feel any increase in engine power. At about 200 ft, he saw that he was to the right of the runway and decided to make an emergency landing. The aeroplane struck the ground on the right side of the runway. It slid for 150 metres and swung around before stopping. All three occupants escaped with minor injuries and the aircraft was damaged beyond repair. ", "probable_cause": "The accident was linked to the pilot’s to continue his approach under VFR, even though the meteorological conditions made it impossible. Coming out of an area of thick snowfall at 200 ft, he was unable to control the bank angle or the flight path of the aeroplane. The investigation was unable to determine if this bank angle was linked to inadequate control during an attempt to go around without external visual references(3) or a late attempt to reach the centre of the runway. Overconfidence in his abilities to pass through a snow shower, as well as a determination to land, may have contributed to the accident. "}