{"url": "https://www.baaa-acro.com/crash/crash-convair-c-131b-samaritan-miami-1-killed", "date": "Feb 8, 2019 at 1216 LT", "type": "Convair C-131 Samaritan", "operator": "Conquest-Air-Cargo", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Nassau - Miami", "msn": "256", "yom": 1955, "flight_number": "QAI504", "city": "Miami", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 23000, "captain_hours_type": 725, "copilot_hours": 650, "copilot_hours_type": 305, "aircraft_hours": 12701, "circumstances": "According to the first officer, during the first cargo flight of the day, the left engine propeller control was not working properly and the captain indicated that they would shut down the airplane and contact maintenance if the left engine propeller control could not be reset before the return flight. For the return flight, the engines started normally, and both propellers were cycled. The captain and the first officer were able to reset the left propeller control, so the airplane departed with the first officer as the pilot flying. The takeoff and initial climb were normal; however, as the airplane climbed through 4,000 ft, the left engine propeller control stopped working and the power was stuck at 2,400 rpm. The captain tried to adjust the propeller control and inadvertently increased power to 2,700 rpm. The captain then took control of the airplane and tried to stabilize the power on both engines. He leveled the airplane at 4,500 ft, canceled the instrument flight rules flight plan, and flew via visual flight rules direct toward the destination airport. The first officer suggested that they return to the departure airport, but the captain elected to continue as planned (The destination airport was located about 160 nautical miles from the departure airport). The first officer's postaccident statements indicated that he did not challenge the captain's decision. When the flight began the descent to 1,500 ft, the right engine began to surge and lose power. The captain and the first officer performed the engine failure checklist, and the captain feathered the propeller and shut down the engine. Shortly afterward, the left engine began to surge and lose power. The captain told the first officer to declare an emergency. The airplane continued to descend, and the airplane impacted the water \"violently,\" about 32 miles east of the destination airport. The captain was unresponsive after the impact and the first officer was unable to lift the captain from his seat. Because the cockpit was filling rapidly with water, the first officer grabbed the life raft and exited the airplane from where the tail section had separated from the empennage. The first officer did not know what caused both engines to lose power. The airplane was not recovered  from the ocean, so examination and testing to determine the cause of the engine failures could not be performed. According to the operator, the flight crew should have landed as soon as practical after the first sign of a mechanical issue. Thus, the crew should have diverted to the closest airport when the left engine propeller control stopped working and not continued the flight toward the destination airport.", "probable_cause": "The captain's decision to continue with the flight with a malfunctioning left engine propeller control and the subsequent loss of engine power on both engines for undetermined reasons, which resulted in ditching into the ocean. Contributing to the accident was the first officer's failure to challenge the captain's decision to continue with the flight."}