{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-princess-harbor", "date": "Aug 29, 1999 at 1532 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Sowind Air", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Saint Andrews - Berens River", "msn": "31-7952120", "yom": 1979, "flight_number": null, "city": "Manitoba", "zone": "Manitoba", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Piper PA-31-350 Navajo, C-GHMK, departed from St. Andrews, Manitoba, on a visual flight rules charter flight to Berens River. One pilot and ten passengers, including one infant, were on board, and a dog was stowed in the baggage compartment behind the right, rear seat. At approximately 1530 central daylight saving time (CDT), while the aircraft was at an altitude of about 2 500 feet and about 30 nautical miles south of Berens River, the pilot heard a loud sound from the left engine. He saw deformation of the left engine cowling and smoke coming from the engine, and the aircraft yawed to the left. Part of the engine cowling departed in flight. The pilot could not pull the left propeller lever beyond half of its normal travel, nor could he move it into the feather position. He set maximum power on the right engine, but the aircraft did not maintain altitude. The pilot advised company dispatch over the radio that he would attempt a forced landing, then force landed in a mossy marsh area. Everyone on board, including the dog, deplaned. Five of the passengers sustained minor injuries during the evacuation. A fire ensued, completely destroying the aircraft except for the empennage aft of the horizontal stabilizers.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The number three cylinder lower forward through stud was missing its base nut, which allowed the lower rear base nut of the number two cylinder to loosen.\r\n2. The missing base nut of the through stud indicates that the base nut did not have sufficient clamping force; however, it could not be determined if the base nut did not receive the required torque during installation or if the base nut lost its clamping force during engine operation.\r\n3. The d-inch studs and the 2-inch through studs of the number two cylinder failed in fatigue, and the number two cylinder of the left engine separated from the crankcase.\r\n4. The left propeller could not be feathered because of interference between the propeller governor control and the separated number two cylinder.\r\n5. The drag from the unfeathered left propeller and the deformed left engine cowling resulted in the aircraft being incapable of maintaining its altitude.\r\nOther Findings:\r\n1. The pilot was certified and qualified for the accident flight.\r\n2. The aircraft's weight and balance were within the specified limits at the time of the accident.\r\n3. The ELT was not readily accessible without tools."}