{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-san-fernando", "date": "Oct 19, 2015 at 0640 LT", "type": "Learjet 35", "operator": "Top Air (Argentina)", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Fernando - Rio Gallegos", "msn": "35A-235", "yom": 1979, "flight_number": null, "city": "Buenos Aires-San Fernando", "zone": "Buenos Aires City", "country": "Argentina", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9851, "captain_hours_type": 6200, "copilot_hours": 1100, "copilot_hours_type": 39, "aircraft_hours": 12190, "circumstances": "The aircraft departed Buenos Aires-San Fernando Airport on a positioning flight to Río Gallegos, carrying two pilots. During the takeoff roll, the copilot (pilot-in-command) noticed that the left engine N1 reached a value of 101% instead of 95% like the right engine. At that point the aircraft had already traveled 380 metres. As the aircraft started to veer to the right, the copilot decided to abandon the takeoff procedure without informing the captain. The power levers were brought back to idle and the copilot started to brake. After a course of about 980 metres, the right engine N1 value dropped to 30-40% while the left engine remained at 101%. Then the captain took over control, deployed briefly the thrust reverser system when the aircraft departed the runway to the right. While rolling in a grassy area, it struck a drainage ditch located 80 metres from the runway, lost its undercarriage then slid for few dozen metres before coming to rest, bursting into flames. Both pilots evacuated safely while the aircraft was destroyed by a post crash fire. ", "probable_cause": "The most likely cause of the uncommanded acceleration and subsequent overspeed condition was a contamination of retained particles present within the fuel control unit (FCU). The contamination was a short-lived random condition, as evidenced by the fact that after about 30 seconds the power lever regained control of the left engine. On a general aviation flight, during the take-off run, the LJ35 LV-ZSZ suffered a runway excursion on the right side, and a subsequent aircraft fire. \r\nThe accident was due to the combination of the following factors:\r\n- The uncommanded acceleration of the left engine at the start of the take-off run,\r\n- The initial lack of response of the left engine to the requests of the corresponding power lever,\r\n- The difficulties of the crew in managing an unusual condition of the aircraft in accordance with guidelines established in the AFM,\r\n- The ambivalence in the existing regulations for the authorization of a co-pilot in an aircraft that require two pilots for certification,\r\n- The duality in the application of safety standards allowed by the existing normative regulations.\r\nAlthough unrelated, the state of the runway 05/23 protection zone at the San Fernando Aerodrome contributed to the severity of the accident."}