{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-bessemer-2-killed", "date": "Dec 1, 2001 at 0143 LT", "type": "Cessna 208B Grand Caravan", "operator": "Air Carriers - USA", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Little Rock - Bessemer", "msn": "208B-0689", "yom": 1998, "flight_number": "FCI600", "city": "Bessemer-Mitchell Field", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5773, "captain_hours_type": 990, "copilot_hours": 1675, "copilot_hours_type": null, "aircraft_hours": 4867, "circumstances": "The flight departed from Little Rock, Arkansas, about 2356 cst, and approximately 49 minutes after takeoff, the FAA approved un-augmented Automated Weather Observing System (AWOS-3) installed at the destination airport began reporting the visibility as 1/4 statute mile; the visibility continued to be reported as that value for several hours after the accident. Title 14 CFR Part 135.225 indicates no pilot may begin an instrument approach procedure to an airport with an approved weather reporting facility unless the latest weather report issued by that weather reporting facility indicates that weather conditions are at or above the authorized IFR landing minimums for that airport. The listed minimums for the ILS approach to runway 05 was in part 3/4 mile visibility. A METAR taken at the destination airport approximately 2 minutes after the accident indicated overcast clouds existed at 100 feet, the temperature and dew point were 4 and 2 degrees Celsius, respectively, and the altimeter setting was 30.16 inHg. No precipitation was present across Arkansas, Mississippi, or Alabama, and no radar echoes were noted along the accident airplane's route of flight. The freezing level near the departure and destination airports at the nominal time of 0600 (4 hours 17 minutes after the accident) was 12000 and 14,500 feet mean sea level, respectively. A witness at the airport reported the fog was the thickest he had seen since working at the airport for the previous year. The flight was cleared for an ILS approach to runway 05, and the pilot was advised frequency change was approved. The witness waiting at the airport reported hearing a sound he associated with a shotgun report. Radar data indicated that between 0138:47, and 0142:11, the airplane was flying on a northeasterly heading and descended from 2,400 feet msl, to 900 feet msl. At 0142:11, the airplane was located .43 nautical mile from the approach end of runway 05. The next recorded radar target 24 seconds later indicated 1,000 feet msl, and was .20 nautical mile from the approach end of runway 05. The touchdown zone elevation for runway 05 is 700 feet msl. The airplane crashed in a wooded area located approximately 342 degrees and .37 nautical mile from the approach end of runway 05; the wreckage was located approximately 4 hours after the accident. Examination of trees revealed evidence the airplane was banked to the left approximately 24 degrees, and the descent angle from the trees to the ground was calculated to be approximately 22 degrees. All components necessary to sustain flight were either attached to the airplane or in close proximity to the main wreckage. There was no evidence of post crash fire and a strong odor of fuel was noted at the scene upon NTSB arrival.  A 8-inch diameter pine tree located near the initial ground impact sight exhibited black paint transfer and a smooth cut surface that measured approximately 46 inches in length. The bottom portion of the cut was located 4 feet above ground level. The flap actuator was found nearly retracted; examination of the components of the flap system revealed no evidence of preimpact failure or malfunction. Examination of the flight control system for roll, pitch, and yaw revealed no evidence of preimpact failure or malfunction. Examination of the engine and engine components with TSB of Canada oversight revealed no evidence of preimpact failure of the engine or engine components. Examination of the propeller with FAA oversight revealed no evidence of preimpact failure or malfunction. Examination of the components of the autopilot system, selected avionics and flight instruments from the airplane with FAA oversight revealed no evidence of preimpact failure or malfunction. The pilot's attitude indicator had been replaced on October 14, 2001, and according to FAA personnel, the mechanic and facility that performed the installation did not have the necessary equipment to perform the operational checks required to return the airplane to service. The FAA flight checked the ILS approach to runway 05 two times after the accident and reported no discrepancies.", "probable_cause": "The poor in-flight planning by the pilot-in-command for his initiation of the ILS approach to runway 05 with weather conditions below minimums for the approach contrary to the federal aviation regulations, and the failure of the pilot to maintain control of the airplane during a missed approach resulting in the in-flight collision with trees then terrain."}