{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601p-lake-butler", "date": "Mar 15, 1990 at 2245 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Top Flight Air Service", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Jacksonville – Atlanta", "msn": "61-0063-117", "yom": 1970, "flight_number": null, "city": "Lake Butler", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4548, "captain_hours_type": 2024, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3234, "circumstances": "Shortly after leveling off at 14,000 feet the left engine quit. The pilot diverted to Tampa, and 34 minutes later the right engine quit. During the subsequent forced landing the airplane collided with the roof of a covered sidewalk and then trees. Teardown of the left engine revealed that the seal between the exhaust flange and turbocharger was not installed; bolt clamp was finger tight. Heat had melted wiring harness and magneto grounding leads insulation; both 'p' leads were grounded. Pilot stated that after losing the left engine he initiated a left tank to right engine crossfeed, and after 20 minutes of single engine flight in this configuration the right engine quit. Flight manual states to land as soon as possible in case of one engine failure. In addition, it warns that when flying on one engine and cross feeding fuel, absolute coordinated flight must be maintained to prevent unporting of the tank's fuel pickup tube when the tank is not full.", "probable_cause": "Inflight failure of the left engine which was caused by inadequate maintenance and inspection by company maintenance personnel resulting in heat damaged magneto leads as a result of a missing exhaust flange-to-turbocharger seal. In addition, the inflight power loss of the right engine was caused by the pilot's failure to follow the procedures in the airplane operating handbook and land as soon as possible resulting in fuel starvation of the right engine. Darkness was a related factor."}