{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-329-brussels", "date": "Mar 29, 1981 at 0940 LT", "type": "Boeing 707", "operator": "Sobelair", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Brussels - Tenerife", "msn": "17623/78", "yom": 1959, "flight_number": "SLR1915", "city": "Brussels", "zone": "Flemish Brabant", "country": "Belgium", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 110, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 64462, "circumstances": "The four engine airplane departed Brussels-Zavantem Airport runway 02 at 0929LT on a charter flight to Tenerife-Sur Reina Sofia with 110 passengers and a crew of seven on board. While climbing to an altitude of 7,000 feet, the engine n°3 exploded and caught fire. The crew declared an emergency and was cleared to return for a landing on runway 25L. After the fire was contained and while completing a last turn on final, the airplane was approaching too fast and overshot so the pilot decided to land on runway 25R. After touchdown, reversers on engine n°1 and 4 were activated and the crew initiated an emergency braking procedure. Nevertheless, the captain considered the remaining distance as insufficient and decided to steer the aircraft to the left of the runway where it came to rest. All 117 occupants were quickly rescued and the aircraft was damaged beyond repair. ", "probable_cause": "It was determined that the explosion of the engine n°3 was the consequence of the disintegration of a blade located on the 10th stage of the compressor due to fatigue cracks. The following contributing factors were reported:\r\n- Approach completed with one engine inoperative, \r\n- The total weight of the aircraft was above the max allowable weight upon landing, \r\n- The approach speed was too high,\r\n- The crew failed to use the brakes properly. "}