{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-134a-3-osh", "date": "Dec 28, 2011 at 1246 LT", "type": "Tupolev TU-134", "operator": "Kyrgyzstan%20Airlines2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bichkek - Osh", "msn": "61042", "yom": 1979, "flight_number": "QH003", "city": "Osh", "zone": "Osh City", "country": "Kyrgyzstan", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 82, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 41313, "circumstances": "Following an uneventful flight from Bishkek, the crew started the descent to Osh Airport. The approach was completed in reduced visibility due to foggy conditions. Not properly aligned with runway 12, the aircraft landed hard. It did not bounce but lost its right main gear due to excessive aerodynamic forces (2,5 g). Out of control, the aircraft veered off runway and came to rest upside down, bursting into flames. The aircraft was partially destroyed by fire. All 88 occupants were evacuated, among them 31 were injured, some seriously. At the time of the accident, the visibility was reduced to 300 metres horizontal and 200 metres vertical. RVR for runway 12 was 550 metres.", "probable_cause": "On Apr 22nd 2013 a letter of Kyrgyzstan's Transport Prosecutor to Kyrgyzstan's Parliament of April 2012 became known indicating that the airport had been approved to operate in Category I weather minima without being properly equipped and should never have been approved to operate in these conditions, as a result of the investigation the aerodrome has been limited to operate according to visual flight rules only. The aircraft was not properly equipped to conduct the flight lacking a GPWS as well as passenger oxygen, the crew was not qualified to conduct the flight and the oversight by the airline's dispatch and chief pilot was insufficient, the Transport Prosecutor mentioned that the responsibles to oversee flight operation could not answer even the most basic questions. Kyrgyzstan's Civil Aviation Authority failed to oversee the operation of the airline as well. While on approach to Osh the crew was informed about weather conditions permitting an approach, the data transmitted however were incorrect and the actual weather did not even permit an approach. Instead of being established on the approach 10.5km/5.6nm before touchdown the aircraft was established on the extended centerline only about 4.02km/2.17nm before touchdown, however was above the glidepath. A steep dive to reach the runway resulted in a touch down at a high rate of descent and vertical forces beyond the design limit of the aircraft (more than 2.5G), as result of the high impact forces the aircraft did not even bounce but just started to disintegrate, reaching 58 degrees of right roll 270 meters past the runway threshold, between 270 and 550 meters past the threshold the tail fin separated, the aircraft was completely upside down 600 meters past the threshold and came to a stop about 1000 meters past the threshold of the runway. The main door was jammed, the occupants escaped through other doors and the overwing exits. No serious injury occurred, 6 people needed hospital treatment with minor injuries."}