{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690a-near-antlers-4-killed", "date": "Oct 15, 2006 at 1303 LT", "type": "Rockwell Grand Commander 690", "operator": "Jon Peter Olsen", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Oklahoma City - Orlando", "msn": "690-11195", "yom": 1974, "flight_number": null, "city": "Antlers", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 6450, "captain_hours_type": 150, "copilot_hours": 6500, "copilot_hours_type": null, "aircraft_hours": 7943, "circumstances": "Approximately 37 minutes after departing on a 928-nautical mile cross-country flight under instrument flight rules, the twin-engine turboprop airplane experienced an in-flight break-up after encountering moderate turbulence while in cruise flight at the assigned altitude of FL230. In the moments preceding the break-up, the airplane had been flying approximately 15 to 20 knots above the placarded maximum airspeed for operations in moderate turbulence. The airplane was found to be approximately 1,038 pounds over the maximum takeoff weight listed in the airplane's type certificate data sheet (TCDS). The last radar returns indicated that the airplane performed a 180-degree left turn while descending at a rate of approximately 13,500 feet per minute. There were no reported eyewitnesses to the accident. The wreckage was located the next day in densely wooded terrain. The wreckage was scattered over an area approximately three miles long by one mile wide. An examination of the airframe revealed that the airplane's design limits had been exceeded, and that the examined fractures were due to overload failure.", "probable_cause": "The pilot's failure to reduce airspeed while operating in an area of moderate turbulence, resulting in an in-flight break up. Contributing factors were the pilot's decision to exceed the maximum takeoff weight, and the prevailing turbulence."}