{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-crossroads-lake", "date": "Jul 14, 2008 at 0816 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Labrador%20Air%20Safari", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Crossroads Lake - Schefferville", "msn": "873", "yom": 1956, "flight_number": null, "city": "Crossroads Lake", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7885, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Labrador Air Safari (1984) Inc. float-equipped de Havilland DHC-2 (Beaver) aircraft (registration C-FPQC, serial number 873) departed Crossroads Lake, Newfoundland and Labrador, at approximately 0813 Atlantic daylight time with the pilot and six passengers on board. About three minutes after take-off as the aircraft continued in the climb-out, the engine failed abruptly. When the engine failed, the aircraft was about 350 feet above ground with a ground speed of about 85 miles per hour. The pilot initiated a left turn and, shortly after, the aircraft crashed in a bog. The pilot and four of the occupants were seriously injured; two occupants received minor injuries. The aircraft was substantially damaged, but there was no post-impact fire. The impact forces activated the onboard emergency locator transmitter.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The linkpin plugs had not been installed in the recently overhauled engine, causing inadequate lubrication to the linkpin bushings, increased heat, and eventually an abrupt engine failure.\r\n2. Immediately following the engine failure, while the pilot manoeuvred the aircraft for a forced landing, the aircraft entered an aerodynamic stall at a height from which recovery was not possible.\r\nFinding as to Risk:\r\n1. The failure to utilize available shoulder harnesses increases the risk and severity of injury. "}