{"url": "https://www.baaa-acro.com/crash/crash-curtiss-32c-condor-ii-tuttlingen-12-killed", "date": "Jul 27, 1934 at 0950 LT", "type": "Curtiss T-32 Condor II", "operator": "Swissair", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Zurich – Stuttgart – Leipzig – Berlin", "msn": "53", "yom": 1934, "flight_number": null, "city": "Tuttlingen", "zone": "Baden-Württemberg", "country": "Germany", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane departed Dübendorf Airport on a schedule service to Berlin with intermediate stops in Stuttgart and Leipzig. After passing the border between Switzerland and Germany, while cruising at an altitude of 3,000 feet, the crew encountered poor weather conditions with thunderstorm activity and turbulences. The right wing detached and the aircraft entered an uncontrolled descent then crashed in a wooded area located in Tuttlingen, some 30 km north of the Swiss/German border. The aircraft was completely demolished by impact forces and all 12 occupants were killed. This was the first accident involving a Swissair's aircraft since its foundation in 1931. Brand new, the aircraft was in service by the Swiss National carrier since March 28, 1934.\r\nCrew:\r\nArmin Mühlematter, pilot, \r\nHans Daschinger, radio navigator,\r\nNelly Diener, stewardess. First official stewardess in Europe, she started her carrier by Swissair on May 1st, 1934.\n", "probable_cause": "The break-up was attributed to the failure of the aircraft’s starboard wing due to fractures in the power plant/wing structure. Oscillations were blamed for causing the original fractures in the structure, with stress from unfavorable winds encountered in the cloud through which CH-170 had flown factoring in the ultimate failure. The German investigative commission ruled that one of the original fractures was facilitated by defects with respect to construction and welding technology. A second fracture, occurring later, apparently resulted from what was described as ‘brute’ force."}