{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46a-45-cu-commando-campina-grande-14-killed", "date": "Sep 5, 1958 at 1730 LT", "type": "Curtiss C-46 Commando", "operator": "Loide-Aereo-Nacional-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Recife – Campina Grande ", "msn": "30288", "yom": 1944, "flight_number": "LDE652", "city": "Campina Grande", "zone": "Paraíba", "country": "Brazil", "region": "South America", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 14, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Clearance was given for the route segment PPRF - PPKG at the approved altitude of 1 800 metres. Upon reaching the position Nazaré, the pilot descended without clearance to 1 200 metres and passed over the PPKG facility at 1000 metres, or 200 metres below the minimum altitude provided for initiating the procedure as prescribed by the Directorate of Air Routes. Having passed over the facility, the pilot consulted the procedure for PPKG and replaced it in the file. When the copilot asked him whether it should not be kept out, he said no, as he already knew it by heart. The procedure was initiated normally, the aircraft returning on a heading unknown to the Investigating Commission until it was at 520 metres (critical altitude 647 metres), when vertical visual contact with the runway was established; but it was not possible to come in, the aircraft having passed the critical point and being over the runway. The pilot tried to enter the traffic visual, so as not to lose sight of the runway, but this proved impossible on reaching final approach, with the result that the landing starting the return, on heading 200 degrees, he began to descend, turning on the aircraft lights. After a few moments of flight, the copilot tried unsuccessfully to obtain visual reference by looking outside. At this time he felt a violent impact and heard the pilot shout that he was \"hitting\". Two crew and eleven passengers were killed, and two crew and three passengers were seriously injured in the accident. The inbound heading of 200 degrees observed by the copilot and checked by the Investigating Commission showed that the procedure carried out by the pilot was not in accordance with that indicated in the approach chart approved by the Directorate of Air Routes. It was also found that at the time vertical visual contact with the runway was established, the aircraft was at most 40 metres from the ground, despite the fact that the meteorological information supplied by the Loide station at PPKG was ceiling 130 metres with visibility 6 km.", "probable_cause": "The accident was due to pilot error - improper procedure during an authorized instrument flight. A contributing cause was an error on the part of other personnel - the meteorological forecast was incorrect."}