{"url": "https://www.baaa-acro.com/crash/crash-extra-ea-400-ponca-city-5-killed", "date": "Aug 4, 2018 at 1045 LT", "type": "Extra EA-400", "operator": "Jeremiah 29:11", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Ponca City - Independence", "msn": "10", "yom": 2000, "flight_number": null, "city": "Ponca City", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 4200, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1198, "circumstances": "The pilot was conducting a personal flight with four passengers. A witness observed the airplane take off and climb slowly from the airport. A pilot flying in the vicinity observed the airplane maneuver erratically before the airplane impacted terrain in a near-vertical attitude. The airplane was destroyed by impact forces and a postimpact fire. The wreckage was contained to a confined area in the field and the remains of the major airplane components were all accounted for. Extensive thermal damage to the airframe and engine limited the scope of the postaccident examination. The impact energy needed to drive the engine into the ground suggested that the engine was producing power at the time of the accident. A postaccident examination of the remaining airframe and engine components did not reveal any anomalies which would have precluded normal operation of the airplane. Depending on the amount of fuel, baggage and equipment on board, and the location of the adult passenger, the center of gravity (CG) could have been within or aft of the recommended CG. Since fuel load and location of the passengers could not be determined or may have shifted during flight, it is not known if loading contributed to the accident. The pilot was not operating with valid medical certification. His second-class medical certificate had expired several years prior to the accident and Federal Aviation Administration records did not indicate that he had obtained BasicMed medical certification. A pilot-rated passenger was seated in the rightfront seat. Investigators were unable to determine who was manipulating the flight controls of the airplane at the time of the accident. The circumstances of the accident are consistent with the pilot’s loss of control. However, the reason for the loss of control could not be determined with the available evidence.", "probable_cause": "The pilot's loss of control for reasons that could not be determined with the available evidence."}