{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-cody-1-killed", "date": "Oct 29, 2003 at 0854 LT", "type": "Cessna 208B Grand Caravan", "operator": "FedEx", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Casper – Cody", "msn": "208B-0289", "yom": 1991, "flight_number": "FDX8773", "city": "Cody", "zone": "Wyoming", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 11094, "captain_hours_type": 5821, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6885, "circumstances": "ARTCC asked the pilot of Airspur 8773 if he would be able to execute the VOR instrument approach. The pilot said he could, but he wanted to \"hold for a while to see if [the weather] gets a little better\" [according to the METAR, visibility was 1.75 statute miles and there was a 200-foot overcast ceiling]. He was cleared to hold north of the VOR at 12,000 feet msl. While holding, the pilot filed the following PIREP indicating light rime icing. Shortly thereafter, he was cleared for the approach. Three witnesses saw the airplane on the downwind leg, just past midfield, at an estimated altitude of 500 feet. Shortly thereafter, one of them heard the engine \"spool up to high power...[like reversing] the pitch of the propeller to slow down,\" and he thought the airplane had landed. Five witnesses said the airplane emerged from the overcast and banked \"sharply to the left, then back to the right, then back to the left, then took a hard bank to the right,\" rolled inverted and struck the highway just south of the airport perimeter. The airplane slid down the embankment and out into a lake, becoming partially submerged. Witnesses said it was \"snowing hard\" and the highway was covered with 1 to 2 inches of slush. Wreckage examination revealed the flaps were down 30 degrees, the wing deice boots were \"ribbed,\" and the inertial separator was open. According to the toxicological report, chlorpheniramine, desmethylsertraline, sertraline, and pseudoephedrine were detected in blood. In addition, chlorpheniramine, sertraline, phenylpropanolamine, and pseudoephedrine were detected in the urine. The urine also contained acetaminophen. Sertraline (trade name Zoloft) is a prescription antidepressant medication. According to the Guide for Aviation Medical Examiners, \"The use of a psychotropic medication is considered disqualifying. This includes all... antidepressant drugs...\" Chlorpheniramine is an over-the-counter sedating antihistamine used primarily for the treatment of allergies. Pseudophedrine (trade name Sudafed) is a decongestant. Acetaminophen (trade name Tylenol) is an over-the-counter pain reliever and fever-reducer. According to Dr. Stanley R. Mohler's \"Medication and Flying: A Pilot's Guide,\" the adverse side effects of chlorpheniramine include drowsiness, dizziness, and  lessened coordination. The side effects of pseudophedrine are usually mild and infrequent, but may include sleepiness, dizziness, restlessness, headache, and perhaps some loss of coordination and alertness or confusion.", "probable_cause": "The pilot's failure to maintain aircraft control. Contributing factors include the pilot's failure to divert to an alternate airport, an inadvertent stall, and the snow and icing conditions."}