{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-oxford", "date": "Dec 10, 1992 at 1642 LT", "type": "Socata TBM-700", "operator": "SOCATA", "flight_phase": "Landing (descent or approach)", "flight_type": "Demonstration", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Oxford - Oxford", "msn": "24", "yom": 1991, "flight_number": null, "city": "Oxford-Kidlington", "zone": "Oxfordshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1441, "captain_hours_type": 104, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The accident flight was the final one of a series of sales demonstration flights. The demonstration pilot occupied the right seat and a potential customer was handling the aircraft from the left seat. The handling pilot was qualified and current on helicopters but had only 100 hours of fixed wing flying experience and had not flown a fixed wing aircraft as-pilot-in-command for some eight years; he controlled the aircraft throughout the flight, under the instruction of the demonstration pilot. After some general handling, including turns and a demonstration of the final approach configuration, F-GLBD returned to the local circuit. The first approach to runway 20 was slightly steep and the landing was firm but satisfactory. During the ground roll the demonstration pilot reconfigured the aircraft and the handling pilot applied power and made a take-off for another circuit. The second approach which was for a final landing was initially stable and on the glideslope. However, on short finals the aircraft went below the glideslope and the nose attitude was too high. There was a crosswind from the right and F-GLBD was on the left of the extended centerline. The demonstration pilot put his left hand on the power lever below that of the handling pilot and, as he did so, told the handling pilot to increase power. When no power was apparent the demonstration pilot repeated his instruction and also applied pressure to the power lever. As the aircraft approached the flare the handling pilot released the power lever and put both hands on the control wheel; the power lever moved quickly to the fully open position under the hand pressure of the demonstration pilot. The aircraft rolled rapidly to approximately 20° to 30° angle of bank to the left and the demonstration pilot took control with both hands on the control wheel. However, the left wing tip and the outboard trailing edge of the left flap struck the ground; the wing tip impact mark was off the runway to the left and the flap impact mark was just on the runway. The left main wheel then made contact with the runway, closely followed by the right main wheel. As the aircraft left the runway at an angle of approximately 230° to the left, the demonstration pilot closed the power lever, the aircraft continued across the grass for a distance of approximately 350 metres. It passed through and destroyed part of the PAPI installation, crossed runway 30 and came to a stop. At the time of the accident, it was dark and the weather was good; the surface wind was 230°/5 knots. All six occupants escaped uninjured and the aircraft was damaged beyond repair. ", "probable_cause": null}