{"url": "https://www.baaa-acro.com/crash/crash-airbus-a300-600-new-york-265-killed", "date": "Nov 12, 2001 at 0916 LT", "type": "Airbus A300-600", "operator": "American-Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "City", "schedule": "New York - Santo Domingo", "msn": "420", "yom": 1988, "flight_number": "AA587", "city": "Belle Harbor", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 251, "pax_fatalities": 251, "other_fatalities": 5, "total_fatalities": 265, "captain_hours": 8050, "captain_hours_type": 1723, "copilot_hours": 4403, "copilot_hours_type": 1835, "aircraft_hours": 37550, "circumstances": "On November 12, 2001, about 0916:15 eastern standard time, American Airlines flight 587, an Airbus Industrie A300-605R, N14053, crashed into a residential area of Belle Harbor, New York, shortly after takeoff from John F. Kennedy International Airport, Jamaica, New York. Flight 587 was a regularly scheduled passenger flight to Las Americas International Airport, Santo Domingo, Dominican Republic, with 2 flight crewmembers, 7 flight attendants, and 251 passengers aboard the airplane. The airplane's vertical stabilizer and rudder separated in flight and were found in Jamaica Bay, about 1 mile north of the main wreckage site. The airplane's engines subsequently separated in flight and were found several blocks north and east of the main wreckage site. All 260 people aboard the airplane and 5 people on the ground were killed, and the airplane was destroyed by impact forces and a post crash fire. Flight 587 was operating under the provisions of 14 Code of Federal Regulations Part 121 on an instrument flight rules flight plan. Visual meteorological conditions prevailed at the time of the accident. ", "probable_cause": "The in-flight separation of the vertical stabilizer as a result of the loads beyond ultimate design that were created by the first officer's unnecessary and excessive rudder pedal inputs. Contributing to these rudder pedal inputs were characteristics of the Airbus A300-600 rudder system design and elements of the American Airlines Advanced Aircraft Maneuvering Program."}