{"url": "https://www.baaa-acro.com/crash/crash-cessna-t303-crusader-channel", "date": "May 1, 1992 at 1754 LT", "type": "Cessna 303 Crusader", "operator": "Prive1", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Exeter - Guernsey", "msn": "303-00006", "yom": 1981, "flight_number": null, "city": "The Channel", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 756, "captain_hours_type": 77, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft had departed Exeter on a flight to Guernsey when, during the climb to FL35, a slight smell of fumed was noticed in the cockpit. By the time the aircraft had passed SKERRY, by some four to five nm, smoke was seen coming from under the right hand instrument panel. The pilot asked the passenger to investigate the source, but he reported that he could see no burning. The pilot then informed Jersey control of their situation and advised that he was returning direct to Start Point, the nearest land on the coast. After changing to Exeter Radar, the pilot initiated a descent in case an immediate ditching should prove necessary, and briefed his passenger to don a life-jacket. He also directed the passenger to sit at the rear of the cabin, adjacent to the door, so that he would be ready to deploy the life-raft through the upper half of the door if they had to ditch. As the density of the smoke and fumes increased, the pilot elected to carry out a controlled ditching, fearing that if he tried to reach the coast he would be overcome by the fumes. However, he stated that he was reluctant to open the cabin air vents in case this escalated any hidden fire, and he did not turn off the master switch since he required the radios to maintain contact with Exeter Radar. The pilot transmitted a Mayday call, giving a full position report, and at 200 feet amsl he shut down both engines and feathered the propellers. He estimated the sea-well was between eight and ten feet but, since a strong wind was blowing (20 knots), he decided to land into-wind. The aircraft contacted the water at approximately 70 knots, plunging into a swell which generated an impact which the pilot later described as 'tremendous'.The aircraft, however, floated for some one and a half minutes before sinking, enabling both occupants to safely escape from the rear door. The pilot reported that, once in the water, it took them an estimated 20 minutes to get the life-raft inflated, but their life-jackets provided adequate support during this period. Although the pilot advised that flares and a handheld radio were being carried on board the aircraft, these were lost during the ditching. After approximately 45 minutes, an SAR helicopter from RAF Chivenor arrived on scene, recovered both survivors, and took them to hospital in Exeter. The pilot, who was wearing a lap and diagonal restraint, and the passenger, who was wearing only a lap strap, were largely uninjured. ", "probable_cause": "Since the aircraft was not recovered, it was not possible to establish the source of the smoke which issued from below the right instrument panel. "}