{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-2b3f-chennai", "date": "Mar 6, 1999 at 0029 LT", "type": "Boeing 747-200", "operator": "Air%20France%20Cargo2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris – Karachi – Bangalore – Chennai", "msn": "21515", "yom": 1978, "flight_number": "AF6745", "city": "Chennai", "zone": "Tamil Nadu", "country": "India", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 72968, "circumstances": "The aircraft was completing a cargo flight from Paris to Chennai with intermediate stops in Karachi and Bangalore, carrying five crew members and a load of various goods including three cars, 20 tons of cigarettes, chemicals and clothing for a total weight of 66 tons. The aircraft was cleared for a runway 07 ILS approach, but the approach was abandoned due to indications that the undercarriage was not down and locked. The flight crew concluded that all gear were down and locked despite a red GEAR light on the forward instrument panel. The crew had failed to recognize that the green GEAR DOWN light for the nose gear was not illuminated and assumed that the red GEAR light on the forward instrument panel was a false indication. The gear was recycled, but an alternate extension was not attempted. The pilot positioned the airplane for another approach. The aircraft touched down with the nose gear retracted. The nose struck the runway. The plane skidded and came to rest at 7000 feet down the runway (which is 13050 feet long). As the pilot informed the ATC of the mishap, he noticed smoke in the cockpit. Even as the smoke was being extinguished, flames erupted in the front portion of the aircraft. One of the crewmembers came down through a rope ladder from the cockpit, the other four were brought down through the rear of the aircraft using the fire engine step ladders. The fire services were not able to extinguish the fire and the plane burned out completely.", "probable_cause": null}