{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-65-a90-king-air-tooele-valley-9-killed", "date": "Jan 14, 2001 at 1729 LT", "type": "Beechcraft 90 King Air", "operator": "Skydive Salt Lake", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Mesquite – Tooele Valley", "msn": "LJ-165", "yom": 1966, "flight_number": null, "city": "Tooele Valley", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 5149, "captain_hours_type": 321, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9725, "circumstances": "The pilot and eight parachutists were returning from a skydive meet. The pilot had obtained a weather briefing, which advised of instrument meteorological conditions at the destination, and filed a VFR flight plan, but it was never activated. Witnesses heard, but could not see, a twin engine turboprop pass over the airport, heading north out over the Great Salt Lake. They described the weather conditions as being a low ceiling with 1/4-mile visibility, light snow, haze, and fog. They said it was almost dark. The airplane impacted the water approximately 1/2-mile off shore. It had been stripped of all avionics except for one transceiver and a handheld GPS receiver. One member of the skydive club, who had flown with the pilot, said he had previously encountered poor weather conditions and descended over the Great Salt Lake until he could see the ground, then proceeded to the airport. Another member related a similar experience, but said they descended over the Great Salt Lake in the vicinity of the accident site. The pilot was able to navigate in deteriorating weather conditions to Tooele Airport, using various landmarks. Examination of the airframe, engines, and propellers did not reveal evidence of any anomalies that would have precluded normal operation.", "probable_cause": "The pilot's exercise of poor judgment and his failure to maintain a safe altitude/clearance above the water. Contributing factors were the weather conditions that included low ceiling and visibility obscured by snow and mist, an inadequately equipped airplane for flying in instrument meteorological conditions, and the pilot's overconfidence in his personal ability in that he had reportedly done this on two previous occasions."}