{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-86-near-tehran-128-killed", "date": "Jan 21, 1980 at 1911 LT", "type": "Boeing 727-100", "operator": "IranAir", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Mashhad - Tehran", "msn": "19817/537", "yom": 1968, "flight_number": "IR291", "city": "Tehran", "zone": "Tehran City District", "country": "Iran", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 120, "pax_fatalities": 120, "other_fatalities": 0, "total_fatalities": 128, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the day of the accident, Iranian air traffic controllers went on strike, which led to hundreds of domestic flights being cancelled. At 1600LT the strike was interrupted and flights resumed. At 1740LT, the airplane departed Mashad Airport on schedule service IR291 to Tehran-Mehrabad Airport with 120 passengers and a crew of eight on board. At 1852LT, ATC based at Tehran-Mehrabad Airport cleared the crew for a direct approach to runway 29. At 1905LT, the dispatcher instructed the crew to take a 360° heading to reach the non-directional beacon of Varamin. On approach, the copilot informed the captain that the VORTAC was giving a wrong radial course but the captain failed to respond to this message. At 1911LT, while descending in limited visibility due to night, snow falls and foggy conditions, the airplane struck the slope of a mountain located in the Alborz Mountain Range. The wreckage was found few hours later in a snow covered terrain about 29 km north of Tehran Airport. The aircraft disintegrated on impact and none of the 128 occupants survived the crash. ", "probable_cause": "It is believed that the accident was the consequence of a controlled flight into terrain, favored by an inoperable instrument landing system (ILS) of runway 29, when the ground radar was inoperative. The accident occurred just three hours after the Iranian air traffic controllers had resumed work after a strike period till 1600LT. The lack of visibility due to night and poor weather conditions remains a contributing factor."}