{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-chesterfield-2-killed", "date": "Apr 29, 1993 at 1400 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Private Wing Flugreisen", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Chesterfield - Chesterfield", "msn": "421B-0632", "yom": 1974, "flight_number": null, "city": "Chesterfield-Spirit of St Louis", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5850, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3726, "circumstances": "Two foreign pilots took off VFR to remain in the vicinity of an airport on the outskirts of a metropolitan area. No record was found to show the airplane had been fueled either before or after the preceding flight. The flight crew contacted an area approach control and requested an ILS approach to test their ILS equipment without specifying an airport. Approach control issued and the flight crew accepted vectors to another airport for which the pilots had no approach plate or airport information. Vectors took the airplane about 25 miles from the departure airport. The flight crew requested to proceed back to the departure airport. A short time later, the flight crew declared an emergency due to low fuel, then radar contact was lost. Witnesses at a landfill heard an intermittent sound from the engine(s). The airplane came into their view with one engine running, then the engine sound ceased. They indicated the airplane went out of control and crashed, but one engine accelerated just before impact. A small fire was confined to the left wing. Both occupants were killed. ", "probable_cause": "Improper planning/decision by the pilot, which resulted in fuel exhaustion, due to an inadequate supply of fuel, and the pilot's failure to maintain control of the airplane during approach to an emergency landing. A related factor was: failure of the pilot to refuel the airplane before flight."}