{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-quebec-7-killed", "date": "Jun 23, 2010 at 0559 LT", "type": "Beechcraft 100 King Air", "operator": "Aeropro", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Québec - Seven Islands - Natashquan", "msn": "B-164", "yom": 1973, "flight_number": "APO201", "city": "Québec-Jean Lesage (Ancienne Lorette)", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 3046, "captain_hours_type": 372, "copilot_hours": 2335, "copilot_hours_type": 455, "aircraft_hours": 19665, "circumstances": "Aircraft was making an instrument flight rules flight from Québec to Sept-Îles, Quebec. At 0557 Eastern Daylight Time, the crew started its take-off run on Runway 30 at the Québec/Jean Lesage International Airport; 68 seconds later, the co-pilot informed the airport controller that there was a problem with the right engine and that they would be returning to land on Runway 30. Shortly thereafter, the co-pilot requested aircraft rescue and fire-fighting (ARFF) services and informed the tower that the aircraft could no longer climb. A few seconds later, the aircraft struck the ground 1.5 nautical miles from the end of Runway 30. The aircraft continued its travel for 115 feet before striking a berm. The aircraft broke up and caught fire, coming to rest on its back 58 feet further on. The 2 crew members and 5 passengers died in the accident. No signal was received from the emergency locator transmitter (ELT). ", "probable_cause": "Findings as to Causes and Contributing Factors: \r\n1. After the take-off at reduced power, the aircraft performance during the initial climb was lower than that established at certification. \r\n2. The right engine experienced a problem in flight that led to a substantial loss of thrust. \r\n3. The right propeller was not feathered; therefore, the rate of climb was compromised by excessive drag. \r\n4. The absence of written directives specifying which pilot was to perform which tasks may have led to errors in execution, omissions, and confusion in the cockpit. \r\n5. Although the crew had the training required by regulation, they were not prepared to manage the emergency in a coordinated, effective manner. \r\n6. The priority given to ATC communications indicates that the crew did not fully understand the situation and were not coordinating their tasks effectively. \r\n7. The impact with the berm caused worse damage to the aircraft. \r\n8. The aircraft’s upside-down position and the damage it sustained prevented the occupants from evacuating, causing them to succumb to the smoke and the rapid, intense fire. \r\n9. The poor safety culture at Aéropro contributed to the acceptance of unsafe practices. \r\n10. The significant measures taken by TC did not have the expected results to ensure compliance with the regulations, and consequently unsafe practices persisted. \r\nFindings as to Risk: \r\n1. Deactivating the flight low pitch stop system warning light or any other warning system contravenes the regulations and poses significant risks to flight safety. \r\n2. The maintenance procedures and operating practices did not permit the determination of whether the engines could produce the maximum power of 1628 ft-lb required at take-off and during emergency procedures, posing major risks to flight safety. \r\n3. Besides being a breach of regulations, a lack of rigour in documenting maintenance work makes it impossible to determine the exact condition of the aircraft and poses major risks to flight safety. \r\n4. The non-compliant practice of not recording all defects in the aircraft journey log poses a safety risk because crews are unable to determine the actual condition of the aircraft at all times, and as a result could be deprived of information that may be critical in an emergency. \r\n5. The lack of an in-depth review by TC of SOPs and checklists of 703 operators poses a safety risk because deviations from aircraft manuals are not detected.\r\n6. Conditions of employment, such as flight hours–based remuneration, can influence pilots’ decisions, creating a safety risk. \r\n7. The absence of an effective non-punitive and confidential voluntary reporting system means that hazards in the transportation system may not be identified. \r\n8. The lack of recorded information significantly impedes the TSB’s ability to investigate accidents in a timely manner, which may prevent or delay the identification and communication of safety deficiencies intended to advance transportation safety. "}