{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-131b-los-angeles", "date": "Jan 16, 1974 at 0135 LT", "type": "Boeing 707", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York - Los Angeles", "msn": "18395/309", "yom": 1962, "flight_number": "TW701", "city": "Los Angeles", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 56, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15800, "captain_hours_type": 6750, "copilot_hours": 4335, "copilot_hours_type": 2040, "aircraft_hours": 38876, "circumstances": "Following an uneventful flight from New York-JFK, the crew started the descent to Los Angeles Airport runway 06R over the sea. Weather was clear but on short final, the crew encountered local patches of fog and visual control with the ground was lost. The airplane continued the approach and landed nose wheel first with a vertical g load of 4.6. This caused the nose wheel to collapse rearward and a fire started in the nose wheel well area. The fire in the nose wheel well was initiated by the burning nose gear tires. The fire was fed by hydraulic fluid that escaped from broken nose wheel steering hydraulic lines. Evacuation of the aircraft resulted in minor or serious injuries to eight passengers. Firefighting personnel were unable to extinguish the fire in the nose wheel well before it spread to the fuselage and destroyed the cockpit and the passenger cabin. \n", "probable_cause": "It was determined that the probable cause of the accident was the continuation of a visual approach after the flight crew lost outside visual reference because of a low cloud and fog encounter. The following factors were reported:\r\n- While executing a night visual approach over water to runway 06R at the Los Angeles International Airport, the flight encountered ground fog when the crew prepared to flare the aircraft for landing,\r\n- The weather in the Los Angeles area was clear; however, the existing visibility at the approach end of runway 6R was considerably less than predicted by the National Weather Service because of fog."}