{"url": "https://www.baaa-acro.com/crash/crash-cessna-441-conquest-ii-harmon-3-killed", "date": "Nov 18, 2018 at 2240 LT", "type": "Cessna 441 Conquest", "operator": "Bismarck%20Air%20Medical", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "No", "site": "Plain, Valley", "schedule": "Bismarck - Williston", "msn": "441-0305", "yom": 1982, "flight_number": null, "city": "Harmon", "zone": "North Dakota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4685, "captain_hours_type": 70, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot and two medical crewmembers were repositioning the airplane to pick up a patient for aeromedical transport. Dark night instrument meteorological conditions prevailed for the flight. Radar data showed the airplane climb to 14,000 ft mean sea level after departure and proceed direct toward the destination airport before beginning a right descending turn. The airplane subsequently broke up inflight and impacted terrain. No distress calls were received from the pilot before the accident. Although weather conditions were conducive for inflight icing, no evidence of structural icing was identified at the scene. The debris field was 2,500 ft long and the disbursement of the wreckage confirmed that both wings, the horizontal stabilizer, both elevators, and both engines separated from the airplane before impacting the ground. Examination of the wreckage revealed that the initiating failure was the failure of the wing where it passed through the center of the airplane. The three wing spars exhibited S-bending deformation, indicative of positive overload producing compressive buckling and fracture. Further, impact signatures as black paint transfers and gouged aluminum, were consistent with the left outboard wing separating when it was struck by the right engine after the wing spars failed. There was no evidence of any pre-exiting conditions that would have degraded the strength of the airplane structure at the fracture locations. Flight control continuity was confirmed. An examination of the engines, propellers, and available systems showed no mechanical malfunctions or failure that could have contributed to the accident. The descending right turn was inconsistent with the intended flight track and ATC-provided clearance. However, there was insufficient information to determine how it was initiated and when the pilot became aware of the airplane's state in the dark night IMC conditions. Yet, the\r\nabsence of a distress call or communication with ATC about the airplane's deviation suggests that the pilot was not initially aware of the change in state. The structural failure signatures on the airplane were indicative of the wings failing in positive overload, which was consistent with the pilot initiating a pullup maneuver that exceeded the airplane spars' structural integrity during an attempted recovery from the spiral dive.", "probable_cause": "The pilot's failure to maintain control of the airplane in dark night conditions that resulted in an in-flight positive overload failure of the wings and the subsequent in-flight breakup of the airplane.\n"}