{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-14m-estenc-7-killed", "date": "Nov 5, 1966 at 2002 LT", "type": "Ilyushin II-14", "operator": "Air%20Mali-2", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Mountains", "schedule": "Minsk – Zagreb – Marseille – Oran – Tamanrasset – Bamako", "msn": "7 34 25 01", "yom": 1957, "flight_number": null, "city": "Estenc", "zone": "Alpes-Maritimes", "country": "France", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 15500, "captain_hours_type": null, "copilot_hours": 1501, "copilot_hours_type": null, "aircraft_hours": 3920, "circumstances": "The aircraft was on a ferry flight from Minsk, Belarus, to Bamako, Mali, with intermediate stops in Zagreb, Marseille, Oran and Tamanrasset. It was returning to its country following maintenance in Minsk factory. While cruising by night in poor weather conditions, the crew failed to realize that the airplane deviated from the prescribed flight path. Due to opposite traffic, the crew was instructed to make a 360° right turn but apparently did not understand this message. At an altitude of 10,000 feet, the airplane struck the slope of Mt L'Avalanche located about 1,500 meters west of Estenc, Alpes-Maritimes. The wreckage was found few hours later. The airplane was totally destroyed upon impact and all seven occupants, five crew members and two passengers (two mechanics) were killed. At the time of the accident, the airplane equipment was compliant but due to stormy weather and strong winds, a precise navigation was impossible due to the lack of a VOR receptor. On the route Genoa - Albenga - Nice, the airplane failed to follow the G7 Airway due to stormy weather and in accordance with ATC. The Russian pilot-in-command, speaking neither English nor French, could not converse directly with ground control. The co-pilot, speaking French but not Russian, could not converse directly with the captain or translate his orders from the ground. The navigator, in charge of the route in particular difficult conditions, could not correspond more with the pilot, if not by means of the radio. Only the radio could translate into Russian to the captain the indications provided in French by the ground control, which could ipso facto introduce a source of error of interpretation, and required a certain time of translation. The ICAO recommendation suggesting to the pilot-in-command the use of English or the language used by the ground station was not applied. The investigation established that the crew was unaware of wind and drift. Under the influence of a wind blowing from sector 210 to 100 km/h, the aircraft suffered a drift of about 20°  towards the north, thus towards the mountain. Vertical to Nice, the airplane was already 25 kilometers north of the station and north of the G7 Airway. The diversion order did not have to be understood the first time since the crew requested repetition. The superposition of the orders of two simultaneous maneuvers, turn and descent, probably made the interpretation tricky and ambiguous. The order to make a 360° right turn, which means a circular turn, was erroneously understood as the order to take heading 360. Indeed, at least five kilometers prior to impact, the aircraft was following a straight path, in this case a heading oriented almost to magnetic north. Under the influence of one or more stormy areas northwest of Nice, the unstable indications of the radiocompas did not allow position's control and turbulences could create an additional difficulty. The aircraft approached the terrain as fast as it did to the north and the speed of the aircraft at that heading increased by about 100 km/h, representing the wind speed south-southeast. The point of impact was 2,440 meters, the level 80 towards which the aircraft was normally descending corresponding to an altitude of 2'380 meters. ", "probable_cause": "The commission of inquiry considers that the accident of the TZ-ABH is due to the accumulation of two main errors acting in the same direction. A navigational error due to the violence of an unknown or underestimated southern sector wind that caused a large uncorrected drift and caused the aircraft to crash. An error in the interpretation of a control order, due to a complexity of conversation exchanges. This error determined the pilot to take, from a position well north of the Airway, the 360​​° heading, which caused the aircraft to move further towards the terrain. This misinterpretation can itself be attributed to the fact that there is no international phraseology for the orders given by the control to the airplanes. These errors were aggravated by very bad weather conditions. These meteorological conditions: storms and very strong turbulences, could constitute aggravating causes by making difficult the work of the crew and in particular the navigation using the radiocompas medium frequency, the only radionavigation instruments the aircraft was equipped with. The fact that the aircraft was following an east-west route contrary to the flight plan forecast and that its altitude was too low given the route followed are still contributing factors."}