{"url": "https://www.baaa-acro.com/crash/crash-learjet-24b-helendale-2-killed", "date": "Dec 23, 2003 at 0913 LT", "type": "Learjet 24", "operator": "Pavair", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Mountains", "schedule": "Chino – Hailey", "msn": "24-190", "yom": 1969, "flight_number": null, "city": "Helendale", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 11783, "captain_hours_type": 7900, "copilot_hours": 250, "copilot_hours_type": 24, "aircraft_hours": 9438, "circumstances": "The aircraft departed controlled flight and crashed near Helendale, California. The captain and the first officer were killed, and the airplane was destroyed. The flight was operating under the provisions of 14 Code of Federal Regulations (CFR) Part 912 from San Bernardino County Airport (CNO), Chino, California, to Friedman Memorial Airport, Hailey, Idaho. Visual meteorological conditions prevailed for the flight, which operated on an instrument flight rules flight plan. A review of radar data and air traffic control (ATC) transcripts revealed that the flight departed CNO about 0858 and was cleared to climb to an altitude of 29,000 feet mean sea level (msl). About 0909:55, as the airplane was climbing through an altitude of 26,000 feet, the first officer requested a return to CNO. About 0910:01, the controller asked the first officer if he needed to declare an emergency, and the first officer replied that he did not. The controller then directed the flight crew to maintain an altitude of 24,000 feet. Mode C information for the flight showed that, from about 0910:12 to about 0910:59, the airplane descended from 26,500 to 24,000 feet at a rate of about 2,000 feet per minute (fpm). About 0911:08, the controller cleared the flight directly to HECTOR (a navigation fix) and asked the first officer to confirm that the airplane was in level flight at an altitude of 24,000 feet. The first officer did not respond. Radar data showed the airplane descending through 23,000 feet at a rate of about 6,500 fpm about that time. About 0911:24, while the airplane was descending at a rate of about 10,000 fpm, the first officer stated, “we’re declaring an emergency now.” No further transmissions were received from the airplane. No radar data were available after about 0911:35. Starting about 0911:47, mode C information was invalid. The airplane impacted high desert terrain (an elevation of 3,350 feet) about 3 miles southeast of Helendale. The accident site was located about 46 nautical miles (nm) north of CNO. A witness to the accident, who was located about 4.5 miles northwest of the accident site, stated that, after hearing the sound of a jet flying high overhead, he looked up and observed the accident airplane flying straight and level below a high, overcast cloud layer. He stated that the airplane then pitched “nose down a little” and “straightened again.” He also stated that, shortly thereafter, he observed the airplane’s nose pitch “straight down” until it impacted terrain. The witness reported that he did not notice whether the airplane was rotating about its longitudinal axis during the descent, but he did indicate that the airplane appeared to be intact without any components separating from the airplane during the descent. The witness added that he did not observe any smoke or fire before the airplane impacted terrain and that the airplane exploded into a “mushroom cloud” when it impacted terrain. San Bernardino County firefighters, who were performing controlled burns near the accident site, reported hearing an explosion about the time of the accident. The firefighters reported that they looked toward the direction of the explosion and saw a rising smoke cloud. None of the firefighters observed the airplane before the sound of the explosion. The firefighters drove to the accident site and were the first to arrive there. The firefighters extinguished small fires that had erupted as a result of the crash. ", "probable_cause": "A loss of airplane control for undetermined reasons."}