{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-188af-electra-shannon", "date": "Mar 1, 1999 at 0846 LT", "type": "Lockheed L-188 Electra", "operator": "Channel%20Express", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cologne - Dublin - Shannon", "msn": "1107", "yom": 1959, "flight_number": "EXS6526", "city": "Shannon", "zone": "Munster", "country": "Ireland", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5000, "captain_hours_type": 3200, "copilot_hours": 3000, "copilot_hours_type": 760, "aircraft_hours": 65000, "circumstances": "The aircraft (Flight 6526) departed Cologne at 0300 hours and routed directly to Dublin, where, after more than one hours delay due to the late arrival of a freight truck, the aircraft departed for Shannon Airport at 0816 hours. The crew consisted of the First Officer who was the handling pilot on both of these sectors, the Captain who was the non-handling pilot and the Flight Engineer. The take off gross weight was estimated at 83,701 lbs, well below the limiting 116,000 lbs take off weight (MTOW), and the centre of gravity was within limits. The landing weight was estimated at 80,345 lbs, again below the maximum landing weight of 98,102 lbs. The total freight on board was 14,000 lbs, less than half the 33,000 lbs maximum amount permissible. The aircraft reached it's designated altitude of FL120. The crew were handed over to Shannon Approach and given descent clearance. Shannon Approach instructed the crew to keep the speed up (due to an another aircraft behind them) and the aircraft was vectored on an approach to RWY 24. Due to the weather forecast for Shannon the crew decided to conduct the landing with 78% flaps set, rather than the standard 100% flap normally set for landing. During the approach the Captain called 1000 ft above the touchdown zone (TDZ), then 500 ft and every 100 ft thereafter to the Decision Altitude (DA). At an altitude of 700 ft the Ground Proximity Warning (GPWS) horn sounded. The Flight Engineer proceeded to inhibit the GPWS system. Slowing the aircraft to Vma (Maximum Manoeuvering Airspeed) the crew did not carry out the \"before landing\" checks. Whilst over the RWY threshold the gear warning horn sounded and five seconds later the crew heard a scraping sound and felt severe aircraft vibrations. Realising that the gear was not down the Captain called for a go-around. The First Officer continued to fly the aircraft and was cleared to 3000 ft by ATC. However, during the climb out the aircraft flew into cloud (Instrument Meteorological Conditions) at about 500/600 feet, and simultaneously the propeller assembly and part of No. 3 engine fell to the ground. Electrical power was lost and the only serviceable flight instruments available to the crew was the standby artificial horizon and wet compass. The First Officer relinquished control of the aircraft to the Captain who had great difficulty in maintaining directional control and it took the combined efforts of both pilots to control the excessive yaw through the rudder pedals. In addition, there was insufficient power available to climb to 3000 ft. In fact, less than 2000 ft was attained, as the aircraft commenced a slow difficult turn in a North Easterly direction and towards the high ground west of Limerick city. It was only by further manipulation of the throttles and feathering No. 4 engine that sufficient directional control was recovered, enough to respond to the instructions of the ATC Radar operator. The aircraft was now flying with only No.1 engine fully operative and No. 2 engine producing only half power and much vibration. The Radar operator vectored the aircraft to approach RWY 24 which became visible to the crew. They selected \"gear down\" and while only 2 of the 3 green landing lights illuminated, the Captain elected to proceed with the landing, with the flaps again set at 78%. This landing was successful, with all the landing gear deploying correctly. The aircraft was evacuated while the airport crash crews stood by.", "probable_cause": "The primary responsibility for the safe conduct of a flight rests with the cockpit crew and, in this regard, they have the Aircraft Flight Manual (AFM), company Standard Operating Procedures (SOP's) and other technical manuals at their disposal in the cockpit. In particular, the company lays down the SOP's to be followed by each and every cockpit crew member in the interests of standardisation and flight safety. The implementation of these measures and procedures is carried out by the cockpit crew and they are aided in this process by artificial mechanical/electrical warning systems and audio alerts. In the L188 in question the two audio alert systems consist of a Ground Proximity Warning System (GPWS) and the landing gear warning horn. The GPWS system sounded at about 700' AGL and this should have been sufficient to warn the crew that the landing gear handle was not down and consequently that the undercarriage was not in the landing configuration. The Flight Engineer, however, reached up and inhibited the GPWS. He said he did this because he understood the aircraft to have 78% flap set for landing and that this was why the GPWS warning sounded. He obviously confused this warning with a warning which he would have got below 200 feet radio height when the flaps are set at less than 100% for landing. The fact that this particular aircraft had no FLAP OVERRIDE switch, as the other two similar aircraft in the fleet had, would probably have added to this confusion. Whether the engineer was instructed to inhibit the GPWS by other crew members is not clear from the CVR. In the debrief following the accident the other crew members agreed that the engineer would have been correct in inhibiting the GPWS as they were landing with 78% flaps configuration. They, therefore, also misinterpreted the GPWS warning. Having failed to carry out the landing checks and with the undercarriage not down, the normal undercarriage warning horn should have sounded when the throttles were retarded for landing. However, it is possible to silence this warning in the 78% flap configuration, which would not have been possible if the flaps were set in the normal (100%) configuration for landing. It appears that as the throttles were being retarded the Flight Engineer pressed the warning horn button to prevent the alarm from sounding. Whether he was so instructed is not clear as parts of the CVR tape were difficult to interpret due to its poor quality. During the final stage of landing the throttles were advanced again thus negating the warning cancellation. As the aircraft rounded out for landing the warning horn was again free to sound, and it did, as the throttles were retarded. However, at this stage, there was too little time to lower the undercarriage and five seconds later the propellers stuck the runway surface.  \r\nThe following findings were identified:\r\n- The aircraft had a valid standard Airworthiness Certificate issued by the United States Department of Transportation, Federal Aviation Administration and had been maintained in accordance with an approved schedule.\r\n- No evidence was found of any technical problems on the aircraft, or its systems, that could have had any bearing on the accident. In addition, the aircraft records show that the aircraft was dispatched on the accident flight with no deferred maintenance items.\r\n- The crew were properly licensed, in accordance with US Federal Aviation Administration Regulations, to undertake this flight.\r\n- The Captain stated that he had slight flu symptoms over the two days prior to the flight but that did not disbar him from undertaking the flight.\r\n- The flight crew consisted of the Captain, First Officer and Flight Engineer. The First Officer was the handling pilot on this flight.\r\n- No emergency call was made to ATC by the Captain or First Officer. The Shannon Radar controller provided invaluable voice and directional assistance to the crew as they struggled to maintain control of their seriously damaged aircraft and this was subsequently acknowledged by the crew.\r\n- The subsequent actions of the crew in landing the aircraft safely from the second approach were commendable.\r\n- The ILS for RWY 24 was fully serviceable.\r\n- Crew fatigue is not considered a factor in this accident as they had sufficient time off duty in the days immediately prior to the flight and their overall flying duties are of average industry standards. \r\n- Debris from the disintegrating No. 3 engine fell to earth on the western side of RWY 24, within the boundaries of Shannon Airport. Fortunately, there was no damage to property or people.\r\n- The selection of 78% flap setting for the landing was in accord with the Operators SOP's for the prevailing landing conditions. However in selecting 78% flap setting the crew were of the mistaken opinion that the GPWS warning horn should be silenced even though the aircraft was not in the landing configuration.\r\n- The Flight Engineer silenced the landing gear warning horn during the approach phase while the engine power levers were being retarded. It is only when these levers were slightly advanced, just before the round-out stage, that the landing warning horn system was again primed and subsequently sounded.\r\n- The normal landing checks were not carried out by the flight crew. Not one crew member realised that the undercarriage gear was not down and locked.\r\n- The crew stated that this was an inexplicable oversight on their part."}