{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-chofu-3-killed", "date": "Jul 26, 2015 at 1058 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Prive20", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "City", "schedule": "Chōfu - Amami", "msn": "46-22011", "yom": 1989, "flight_number": null, "city": "Tokyo-Chōfu", "zone": "Kantō", "country": "Japan", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 1, "other_fatalities": 1, "total_fatalities": 3, "captain_hours": 1300, "captain_hours_type": 120, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2284, "circumstances": "On Sunday, July 26, 2015 at around 10:58 Japan Standard Time (JST: UTC + 9 hrs: unless otherwise stated, all times are indicated in JST using the 24-hour clock), a privately owned Piper PA-64-350P, registered JA4060, crashed into a private house at Fujimi Town in Chōfu City, right after its takeoff from Runway 17 of Chōfu Airport There were five people on board, consisting of the captain and four passengers. The captain and one passenger died and three passengers were seriously injured. In addition, one resident died and two residents had minor injuries. The aircraft was destroyed and a fire broke out. Furthermore, the house where the Aircraft crashed into were consumed in a fire, and neighboring houses sustained damage due to the fire and other factors.", "probable_cause": "It is highly probable that this accident occurred as the speed of the Aircraft decreased during takeoff and climb, which led the Aircraft to stall and crashed into a residential area near Chōfu Airport. It is highly probable that decreased speed was caused by the weight of the Aircraft exceeding the maximum takeoff weight, takeoff at low speed, and continued excessive nose-up attitude. As for the fact that the Captain made the flight with the weight of the Aircraft exceeding the maximum takeoff weight, it is not possible to determine whether or not the Captain was aware of the weight of the Aircraft exceeded the maximum takeoff weight prior to the flight of the accident because the Captain is dead. However, it is somewhat likely that the Captain had insufficient understanding of the risks of making flights under such situation and safety awareness of observing relevant laws and regulations. It is somewhat likely that taking off at low speed occurred because the Captain decided to take a procedure to take off at such a speed; or because the Captain reacted and took off due to the approach of the Aircraft to the runway threshold. It is somewhat likely that excessive nose-up attitude was continued in the state that nose-up tended to occur because the position of the C.G. of the Aircraft was close to the aft limit, or the Captain maintained the nose-up attitude as he prioritized climbing over speed. Adding to these factors, exceeding  maximum takeoff weight, takeoff at low speed and continued excessive nose-up attitude, as the result of analysis using mathematical models, it is somewhat likely that the decreased speed was caused by the decreased engine power of the Aircraft; however, as there was no evidence of showing the engine malfunction, it was not possible to determine this."}