{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-les-bergeronnes-6-killed", "date": "Aug 23, 2015 at 1127 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Air%20Saguenay", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Lac Long - Lac Long", "msn": "1210", "yom": 1958, "flight_number": null, "city": "Les Bergeronnes", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 5989, "captain_hours_type": 4230, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 25223, "circumstances": "The float-equipped de Havilland DHC-2 Mk. 1 Beaver (registration C-FKRJ, serial number 1210), operated by Air Saguenay (1980) inc., was on a visual flight rules sightseeing flight in the region of Tadoussac, Quebec. At 1104 Eastern Daylight Time, the aircraft took off from its base on Lac Long, Quebec, for a 20-minute flight, with 1 pilot and 5 passengers on board. At 1127, on the return trip, approximately 2.5 nautical miles north-northwest of its destination (7 nautical miles north of Tadoussac), the aircraft stalled in a steep turn. The aircraft descended vertically and struck a rocky outcrop. The aircraft was substantially damaged in the collision with the terrain and was destroyed by the post-impact fire. The 6 occupants received fatal injuries. No emergency locator transmitter signal was captured.", "probable_cause": "Findings as to causes and contributing factors:\r\n1. The pilot performed manoeuvres with a reduced safety margin at low altitudes. As a result, these flights involved a level of risk that was unnecessary to attain the objectives of sightseeing flights.\r\n2. With no restrictions on manoeuvres and no minimum altitude prescribed by the company prior to flight, the pilot flew according to his own limits and made a steep turn at approximately 110 feet above ground level.\r\n3. When the pilot made a steep left turn, aerodynamic stalling ensued, causing an incipient spin at an altitude insufficient to allow control of the aircraft to be regained prior to vertical collision with the terrain.\r\n4. The absence of an angle-of-attack indicator system and an impending stall warning device deprived the pilot of the last line of defence against loss of control of the aircraft.\n\r\nFindings as to risk:\r\n1. If lightweight flight data recording systems are not used to closely monitor flight operations, there is a risk that pilots will deviate from established procedures and limits, thereby reducing safety margins.\r\n2. If Transport Canada does not take concrete measures to facilitate the use of lightweight flight data recording systems and flight data monitoring, operators may not be able to proactively identify safety deficiencies before they cause an accident.\r\n3. If pilots do not obtain at least the regulatory rest periods, there is a risk that flights will be conducted when pilots are fatigued.\r\n4. Unless all flights made are recorded in the pilot’s logbook and monitored by the company, it is possible that the pilot will not receive the required rest periods, which increases the risk of flights being conducted when the pilot is fatigued.\r\n5. If flights made are not recorded in the aircraft’s journey logbook, it is possible that inspection and maintenance schedules and component lifetimes will be exceeded, increasing the risk of failure.\r\n6. Unless safety management systems are required, assessed, and monitored by Transport Canada in order to ensure continual improvement, there is an increased risk that companies will not be able to identify and effectively mitigate the hazards involved in their operations.\r\n7. If pilots do not receive stall training that demonstrates the aircraft’s actual behaviour in a steep turn under power, there is a high risk of loss of control.\n\r\nOther findings:\r\n1. The replacement of the ventral fin with Seafins on C-FKRJ was in compliance with the requirements of Kenmore Air Harbor Inc.’s supplemental type certificate.\r\n2. The control wheel was in the left-hand position (pilot side) at the moment of impact.\r\n3. Angle-of-attack indicator systems have been recognized as contributing to flight safety by improving pilot awareness of the stall margin at all times, thereby allowing pilots to react in order to prevent loss of control of the aircraft.\r\n4. Stall warning systems have been recognized as a means of improving flight safety by providing a clear, unambiguous warning of an impending stall."}