{"url": "https://www.baaa-acro.com/crash/crash-lockheed-8d-altair-aye-island-2-killed", "date": "Nov 8, 1935", "type": "Lockheed 8 Sirius/Altair", "operator": "Charles Edward Kingsford Smith", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Lympne - Allahabad - Singapore - Sydney", "msn": "152", "yom": 1935, "flight_number": null, "city": "Aye Island (Kokunye Kyun)", "zone": "Mon State", "country": "Myanmar", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Sir Charles Edward Kingsford Smith and his copilot John Thompson 'Tommy' Pethybridge were flying the aircraft named 'Lady Southern Cross' overnight from Allahabad, India, to Singapore, as part of their attempt to break the England-Australia speed record held by C. W. A. Scott and Tom Campbell Black, when they disappeared over the Andaman Sea in the early hours of 8 November 1935. Despite brave search for 74 hours over the Bay of Bengal by test pilot Eric Stanley Greenwood OBE, their bodies were never recovered. Eighteen months later, Burmese fishermen found an undercarriage leg and wheel (with its tyre still inflated) which had been washed ashore at Aye Island in the Gulf of Martaban, some three km off the southeast coastline of Burma, some 137 km south of Mottama (formerly known as Martaban). Lockheed confirmed the undercarriage leg to be from the 'Lady Southern Cross'. Botanists who examined the weeds clinging to the undercarriage leg estimated that the aircraft itself lies not far from the island at a depth of approximately 27 metres. The undercarriage leg is now on public display at the Powerhouse Museum in Sydney, Australia.", "probable_cause": "Due to lack of evidences, the cause of the accident could not be determined. "}