{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-near-kandrian-2-killed", "date": "Mar 30, 2007 at 0523 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Airlink%20PG", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Port Moresby – Hoskins – Rabaul", "msn": "110-232", "yom": 1979, "flight_number": "ND304", "city": "Kandrian", "zone": "West New Britain", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4653, "captain_hours_type": 1253, "copilot_hours": 4235, "copilot_hours_type": 610, "aircraft_hours": 36962, "circumstances": "The aircraft was refueled with 640 litres (L) of Jet-A1 (AVTUR) in preparation for an early morning departure to Hoskins, New Britain, on 30 March. On 30 March, the crew lodged a flight plan, which stated that the total fuel on board was 2,100 pounds (lbs) (1,208 L). The first sector of the planned route was from Port Moresby to Hoskins. The pilot-in-command (PIC) obtained an area forecast for the flight, which indicated that there were areas of rain and scattered cloud from 1500-5000 feet (ft), with deteriorating conditions forecast for the period between 0400-0800 hours (hrs); for their arrival at Hoskins. The forecast required 30 minutes holding fuel in addition to the flight and statutory fuel requirements. These conditions were normal for their destination at this time of the year.The aircraft departed Port Moresby at 0402, as flight number ND304 for Hoskins. It initially climbed to the planned Flight Level (FL) 140 (14,000 ft), which was 300 ft above the lowest safe altitude (LSA) on the initial RNC track between Port Moresby and Girua, an Instrument Flight Rules (IFR) reporting point on the north coast of the PNG mainland. The LSA for the sector between Girua and the en-route reporting point Maran was 3,300 ft, and the PIC had planned to cruise at 9,000 ft. The sector between Maran and Hoskins was planned at 9,000 ft, with a LSA of 8,300 ft. The purpose of the flight was to transport newspapers and general freight to Hoskins and Rabaul. Flight Information Area (FIA) communications with Nadzab Flight Service used High Frequency (HF) radio, and a Very High Frequency (127.1 MHz) repeater transceiver located near the township of Popondetta. This service was usually monitored by Nadzab Flight Service during their normal hours of operation, for aircraft operating on the Girua to Hoskins track. One of the functions of the Nadzab Flight Service Unit was to record all transmissions received via the Girua repeater site. The crew made a position report, intercepted by Port Moresby Flight Service, advising that they were overhead Maran at 0506, cruising at FL 110 (11,000 ft), and gave an estimated time of arrival (ETA) Hoskins at 0540. That was 2,000 ft higher than the planned level. The position report was received by Port Moresby Flight Service, because Nadzab Flight Service had not commenced operations. It subsequently commenced operations for the day at 0540. Because Nadzab was responsible for the airspace in which ALU was operating, Port Moresby Flight Service advised Nadzab of ALU’s position report, once Nadzab opened. The Maran position report was the last recorded radio contact with the aircraft. No transmission declaring the intention to descend below FL110 was heard from the crew of ALU. No MAYDAY transmission was reported by ATS or other aircrew. When the crew of ALU failed to report their arrival at Hoskins, a search was commenced of the Hoskins aerodrome. At 0650 a DISTRESFA Search and Rescue Phase (SAR) was declared indicating the degree of apprehension held for the safety of the aircraft and its occupants. Later that morning verbal reports were received from a coastal logging company in an area east of Kandrian, that an aircraft had crashed. The wreckage of ALU was found 27 km east of Kandrian, at an elevation of 780 ft above sea level. Both crew members had not survived the impact. The wreckage was located at position 06° 11′ 39.8′′ S, 149° 52′ 58.9′′ E, and was dispersed along a 500 m wreckage trail after colliding with numerous trees and impacting the terrain. The investigation estimated the time of the accident to be about 0523.", "probable_cause": "The reason the crew were unable to maintain level flight above the en-route lowest safe altitude with one engine inoperative, and subsequently impacted terrain, could not be determined."}