{"url": "https://www.baaa-acro.com/crash/crash-casa-212-aviocar-200-near-bamyan-6-killed", "date": "Nov 27, 2004 at 0820 LT", "type": "Casa 212 Aviocar", "operator": "Presidential%20Airways", "flight_phase": "Flight", "flight_type": "Government", "survivors": "No", "site": "Mountains", "schedule": "Bagram - Farah", "msn": "231", "yom": 1982, "flight_number": null, "city": "Bamyan", "zone": "Bamyan", "country": "Afghanistan", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 5720, "captain_hours_type": 865, "copilot_hours": 2228, "copilot_hours_type": 420, "aircraft_hours": 21489, "circumstances": "On November 27, 2004, about 0820 Afghanistan time, a Construcciones Aeronauticas Sociedad Anonima C-212-CC (CASA 212) twin-engine, turboprop airplane, N960BW, registered to Aviation Worldwide Services, LLC, and operated by Presidential Airways, Inc., of Melbourne, Florida, collided with mountainous terrain in the vicinity of the Bamiyan Valley, near Bamiyan, Afghanistan. The Department of Defense (DoD) contract flight was operated under the provisions of 14 Code of Federal Regulations (CFR) Part 135, with a company flight plan filed. Daylight visual meteorological conditions (VMC) prevailed. The captain, the first officer, and the mechanic-certificated passenger, who were U.S. civilians employed by the operator, and the three military passengers, who were active-duty U.S. Army soldiers, received fatal injuries. The airplane was destroyed. The flight departed Bagram Air Base (OAIX), Bagram, Afghanistan, about 0738.", "probable_cause": "The captain's inappropriate decision to fly a nonstandard route and his failure to maintain adequate terrain clearance, which resulted in the inflight collision with mountainous terrain. Factors were the operator's failure to require its flight crews to file and to fly a defined route of flight, the operator's failure to ensure that the flight crews adhered to company policies and FAA and DoD Federal safety regulations, and the lack of in-country oversight by the FAA and the DoD of the operator. Contributing to the death of one of the passengers was the operator's lack of flight-locating procedures and its failure to adequately mitigate the limited communications capability at remote sites. "}