{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-120rt-brasilia-eagle-lake-14-killed", "date": "Sep 11, 1991 at 1003 LT", "type": "Embraer EMB-120 Brasília", "operator": "Continental%20Express", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Laredo - Houston", "msn": "120-077", "yom": 1987, "flight_number": "CO2574", "city": "Eagle Lake", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 4243, "captain_hours_type": 2468, "copilot_hours": 11543, "copilot_hours_type": 1066, "aircraft_hours": 7229, "circumstances": "The airplane broke up in flight while descending from FL240. The horizontal stabilizer, or top of the T-type tail, had separated from the fuselage before ground impact. Examination revealed that the 47 screw fasteners that would have attached the upper surface of the leading edge assembly for the left side of the horizontal stabilizer were missing. They had been removed the night before during scheduled maintenance. Investigation revealed that there was a lack of compliance with the FAA-approved general maintenance manual procedures by the mechanics, inspectors, and supervisors responsible for assuring the airworthiness of the airplane the night before the accident. In addition, routine surveillance of the continental express maintenance department by the FAA was inadequate and did not detect deficiencies, such as those that led to this accident. All 14 occupants were killed. ", "probable_cause": "The failure of continental express maintenance and inspection personnel to adhere to proper maintenance and quality assurance procedures for the airplane's horizontal stabilizer deice boots that led to the sudden in-flight loss of the partially secured left horizontal stabilizer leading edge and the immediate severe nose down pitchover and breakup of the airplane. Contributing to the cause of the accident was the failure of continental express management to ensure compliance with the approved maintenance procedures, and the failure of the faa surveillance to detect and verify compliance with approved procedures."}