{"url": "https://www.baaa-acro.com/crash/crash-airbus-a321-231-islamabad-152-killed", "date": "Jul 28, 2010 at 0941 LT", "type": "Airbus A321", "operator": "Airblue", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Karachi - Islamabad", "msn": "1218", "yom": 2000, "flight_number": "ABQ202", "city": "Islamabad", "zone": "Islamabad Capital Territory (وفاقی دارالحکومت)", "country": "Pakistan", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 146, "pax_fatalities": 146, "other_fatalities": 0, "total_fatalities": 152, "captain_hours": 25497, "captain_hours_type": 1060, "copilot_hours": 1837, "copilot_hours_type": 286, "aircraft_hours": 34018, "circumstances": "Flight ABQ202, operated by Airblue, was scheduled to fly a domestic flight sector Karachi - Islamabad. The aircraft had 152 persons on board, including six crew members. The Captain of aircraft was Captain Pervez Iqbal Chaudhary. Mishap aircraft took-off from Karachi at 0241 UTC (0741 PST) for Islamabad. At time 0441:08, while executing a circling approach for RWY-12 at Islamabad, it flew into Margalla Hills, and crashed at a distance of 9.6 NM, on a radial 334 from Islamabad VOR. The aircraft was completely destroyed and all souls on board the aircraft, sustained fatal injuries.", "probable_cause": "- Weather conditions indicated rain, poor visibility and low clouds in and around the airport. The information regarding prevalent weather and the required type of approach on arrival was in the knowledge of aircrew. \r\n- Though aircrew Captain was fit to undertake the flight on the mishap day, yet his portrayed behavior and efficiency was observed to have deteriorated with the inclement weather at BBIAP Islamabad. \r\n- The chain of events leading to the accident in fact started with the commencement of flight, where Captain was heard to be confusing BBIAP Islamabad with JIAP Karachi while planning FMS, and Khanpur Lake (Wah) with Kahuta area during holding pattern. This state continued when Captain of the mishap flight violated the prescribed Circling Approach procedure for RWY-12; by descending below MDA (i.e 2,300 ft instead of maintaining 2,510 ft), losing visual contact with the airfield and instead resorting to fly the non-standard self created PBD based approach, thus transgressing out of protected airspace of maximum of 4.3 NM into Margallas and finally collided with the hills. \r\n- Aircrew Captain not only clearly violated the prescribed procedures for circling approach but also did not at all adhere to FCOM procedures of displaying reaction / response to timely and continuous terrain and pull up warnings (21 times in 70 seconds) – despite these very loud, continuous and executive commands, the Captain failed to register the urgency of the situation and did not respond in kind (break off / pull off). \r\n- F/O simply remained a passive bystander in the cockpit and did not participate as an effective team member failing to supplement / compliment or to correct the errors of his captain assertively in line with the teachings of CRM due to Captain’s behavior in the flight. \r\n- At the crucial juncture both the ATC and the Radar controllers were preoccupied with bad weather and the traffic; the air traffic controller having lost visual contact with the aircraft got worried and sought Radar help on the land line (the ATC does not have a Radar scope); the radar controller having cleared aircraft to change frequency to ATC, got busy with the following traffic. Having been alerted by the ATC, the Radar controller shifted focus to the mishap aircraft – seeing the aircraft very close to NFZ he asked the ATCO (on land line) to ask the aircraft to immediately turn left, which was transmitted. Sensing the gravity of the situation and on seeing the aircraft still heading towards the hills, the Radar controller asked the ATCO on land line “Confirm he has visual contact with the ground. If not, then ask him to immediately climb, and make him execute missed approach”. The ATCO in quick succession asked the Captain if he had contact with the \r\nairfield – on receiving no reply from aircrew the ATCO on Radars prompting asked if he had contact with the ground. Aircrew announced visual contact with the ground which put ATS at ease. \r\nEnsuing discussion and mutual situational update (on land line) continued and, in fact, the ATC call “message from Radar immediately turn left” was though transmitted, but by the time the call got transmitted, the aircraft had crashed at the same time. \r\n- The accident was primarily caused by the aircrew who violated all established procedures for a visual approach for RWY-12 and ignored several calls by ATS Controllers and EGPWS system warnings (21) related to approaching rising terrain and PULL UP."}