{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-aberdeen", "date": "Dec 24, 2002 at 0745 LT", "type": "Swearingen SA227 Metro III", "operator": "North%20Flying-2", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Aberdeen - Aalborg", "msn": "AC-580B", "yom": 1984, "flight_number": "NFA924", "city": "Aberdeen-Dyce", "zone": "Aberdeenshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4600, "captain_hours_type": 2800, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At approximately 0630 hrs on 24 December 2002, the pilots arrived by car at Aberdeen Airport. With no requirement for their aircraft to transport mail on this occasion, it was decided to fly directly to their home airport in Denmark. The aircraft had been refuelled the previous day and the total fuel on board of 2,200 lb was sufficient for the flight; with no cargo on board, take-off weight was calculated as 12,000 lb (maximum take-off weight: 16,000 lb). The commander carried out an external inspection on OY-BPH while the co-pilot, who was the designated handling pilot for the flight to Denmark, submitted a flight plan. The weather at 0720 hrs was reported as follows: Surface wind 150°M/ 12 kt; visibility 2,500 metres in mist; cloud scattered 100 feet agl, overcast at 200 feet agl; air temperature +9°C; QNH 994 hPa. The runway was reported as wet and Low Visibility Procedures (LVP) had been in force at Aberdeen since 0633 hrs. OY-BPH, callsign 'Birdie Nine Two Four', was parked on Taxiway Bravo and the crew called for, and were given, start clearance at 0736 hrs by 'Ground Movement Control' on frequency 121.7 MHz. Then, following their after-start checks, the crew were cleared to taxi to 'Whiskey Five' for Runway 16 at 0740 hrs. During taxi, the crew were passed and correctly acknowledged the following clearance: \"LEAVE CONTROLLED AIRSPACE CLIMBING FLIGHT LEVEL ONE FIVE FIVE SQUAWK SIX TWO FOUR ZERO\". Then, at 0742 hrs as the aircraft approached 'Whiskey Five', the crew were transferred to 'Aberdeen Tower' on frequency 118.1 MHz. On the 'Tower' frequency, they were given line-up clearance for Runway 16. At 0743 hrs, the controller transmitted: \"BIRDIE NINE TWO FOUR WITH A LEFT TURN DIRECT KARLI CLEAR TAKE OFF ONE SIX SURFACE WIND ONE SIX ZERO ONE TWO KNOTS\". The crew correctly acknowledged this clearance. The controller watched the initial movement of the aircraft along the runway before transferring her attention to another aircraft, which was lining up. Shortly after, at 0746 hrs, she transmitted: \"OY-BPH REPORT TURNING LEFT\" but received no reply. About this time, a telephone message was received in the 'Tower' from a witness in front of the Terminal Building to the effect that an aircraft appeared to have crashed just south of the airfield. This witness had heard a \"change in pitch\" from the aircraft but had seen no flames prior to it disappearing from his sight: ATC personnel immediately activated their emergency procedures. For the reduced power take-off roll, with the flaps at ¼, the power was set by the commander. The crew considered that the performance of the aircraft was normal, with no unusual instrument indications. The calculated V1 and VR speeds (co-incident at 100 kt) were achieved and called by the commander and, at VR, the co-pilot rotated the aircraft to a pitch attitude of about 12° to 15° nose-up. As the aircraft left the ground, the co-pilot detected the aircraft 'yawing' to the right; almost immediately, he was also aware of a distinct smell of smoke. He called to the commander that he had an engine failure, called for maximum power and tried to maintain control by corrective aileron and rudder inputs. The commander felt the aircraft roll about 15° to the right and realised that there was a problem with the right (No 2) engine. He reached for both power levers and moved them forward. There were no audio or visual warnings associated with the apparent problem. The commander looked at the EGT gauges with the power levers fully forward and noted that the No 2 engine indicated about 600°C EGT, whereas the left (No 1) engine indicated greater than 650°C EGT (the normal maximum) and that its fuel 'Bypass' light was on. He retarded the No 1 power lever until the 'Bypass' light extinguished and noted the resultant EGT at about 630°C. He did not recall any other abnormal indications on the engine instruments but, later in the investigation, the commander recalled hearing a sound \"like a compressor stall from the right engine\". About this time, the co-pilot heard the automatic \"Bank Angle\" voice activate. As the aircraft continued to turn to the right, the co-pilot called that he \"couldn't control the aircraft\". The commander reached for and pulled No 2 engine 'Stop and Feather Control' but, almost immediately, OY-BPH struck the ground initially with the right wing. The aircraft slid along the surface of a field, through a fence and onto a road, before coming to rest. As it did so, the co-pilot was aware that the aircraft had struck a car, which was now at rest outside the right forward side of the cockpit. The co-pilot saw that the whole of the right wing was on fire and called this to the commander before evacuating out of the left door of the aircraft. As the copilot left, the commander pulled No 1 engine 'Stop and Feather Control' and activated both engine fire extinguishers before leaving the aircraft. Outside OY-BPH, the co-pilot went to the car to check if anyone was still inside; as he did so, he saw someone running away. With the intense fire and the car apparently empty, both pilots moved well away from the aircraft. At 0748 hrs, the co-pilot used his mobile phone to advise ATC of the accident and to request assistance. The local emergency services had been alerted at 0745 hrs by a member of the public, who reported a road accident; by 0753 hrs, the local fire service was on the scene. By 0754 hrs, the first AFS vehicle was on the scene and three further AFS vehicles arrived one minute later. A fifth vehicle arrived at 0800 hrs. The fire was quickly extinguished and the Fire Officer confirmed that all the aircraft and vehicle occupants had been located and that there had been no serious injuries. Following runway and taxiway inspections, the airport was re-opened at 0954 hrs. ", "probable_cause": "Although the investigation was hampered by the lack of FDR data, which might have provided information on engine handling and behaviour, the available evidence from the crew and the initial examination of the aircraft at the accident site, pointed to a major loss of power in the right engine. As a result of the discovery of dead birds close to the point of lift-off on the runway, and a section of braided wire found near the start of the take-off roll, consideration was given as to whether the these had been factors in the accident. The braided wire was not identified as having originated from OY-BPH. There was conclusive evidence that the left engine, which had continued to run, had ingested parts of birds, but no such evidence was found with the right engine. Nevertheless, the crew were adamant that there was a power loss from the right engine and were not conscious of any power reduction from the left engine. The technical examination of the left engine and its propeller assembly revealed evidence of damage consistent with this unit delivering a high level of power at impact. The examination of the right engine and propeller revealed all damage to be consistent with a low, or no, power condition at impact, consistent with either a genuine loss of power or as a consequence of the commander pulling the 'Stop and Feather' control immediately before impact. However, an exhaustive examination of the right engine revealed no evidence of anything that could have caused a failure. Therefore, the items found on the runway were not considered to have been causal or contributory factors in the accident. The crew's recollection of the event included a low EGT indication, at 600°C. This suggested that either the engine might have flamed out, should they have only momentarily looked at the indication as the engine was cooling down, or that the engine was operating at reduced power for an undetermined reason. Flame out could have occurred due to a number of reasons, including, for example, water contamination of the fuel. However, analysis of the bulk supply samples proved negative and, moreover, there were no reports of contaminated fuel from other operators at Aberdeen Airport. Ingestion of ice or water could also have resulted in a flame-out, although this is considered unlikely due to the conditions not being conducive to the formation of engine icing, the lack of significant standing water on the runway, and the absence of heavy precipitation. However, it could not be completely discounted and, if flame-out had occurred, the non-incorporation of the FAA mandated auto-relight system would have reduced the possibility of an immediate relight. Approximately six months before the accident, the left engine had failed during a landing roll-out whilst the aircraft was being operated in Spain. This failure was never satisfactorily explained although, at one stage, the fuel cut-off valve came under suspicion. The valves were interchanged, according to the records, so that the unit that had been fitted to the left engine was installed on the right engine, at the time of the accident. Whilst a stray electrical signal causing the valve to close would certainly result in the engine flaming out, rumours that such events had occurred were not substantiated by the engine manufacturer. In summary, the left engine experienced a bird strike, but with no apparent power loss, and the extensive technical examination could not identify any reason for a loss of power on the right engine. Although an engine failure during takeoff after V1 is a serious emergency, the aircraft was at a relatively light weight and, even with an such a failure, the crew should have been able to fly OYBPH safely away. However, if other factors had been involved, the margins for safe flight would have become more critical. These other factors could have included incorrect operation of the NTS system and/or a failure of the feathering system on the right engine, a concurrent power loss from the left engine, or the crew not handling the emergency effectively. There is no doubt that the left engine had been producing power at impact, but a definite conclusion could not be made as to the blade pitch angles of the right propeller. From the evidence of the commander and the propeller examination by the manufacturer, it is probable that the right propeller was close to the feather position at ground impact. The functionality of the NTS and feathering system could not be determined but, as noted earlier, the pre-flight NTS check actually only ensured that oil pressure was available for this system, and did not check the operation of the whole system. With the evidence that only the left engine had ingested birds, there was a possibility that the left engine was not producing maximum power, although the crew considered it was operating normally. The commander could remember that he compared the engine EGT indications, once he had pushed both power levers forward, and recalled that the left EGT was indicating greater than 650°C with the 'Bypass' light on. He then retarded the left power lever until the 'Bypass' light went out, following which the EGT indicated about 630°C. This retardation of the power lever was not required, as the function of the 'Bypass' system is to reduce the fuel flow in order to keep the engine parameters within limits. This reported retardation could, however, have resulted in a lower engine power than was possible within the available limits, possibly with an associated reduction in EGT. While it remains a possibility that the left engine may have experienced a transient power reduction as a result of the bird ingestion, it is likely that the commander's action in retarding the left power lever resulted in a more significant reduction of power. To maintain straight flight, following an engine failure, it is vital to apply sufficient corrective rudder input to maintain the wings essentially level and minimise the drag due to sideslip. In the case of OYBPH, there was a constant turn to the right before ground impact. The commander's recollection was that left rudder had been applied by the co-pilot, but not to full deflection. The amount of rudder deflection required depends mainly on the airspeed and the difference in engine power but, with the wings not level, more deflection was obviously required, and was available. Greater use of rudder would have reduced the overall drag of the aircraft, with consequent improvement in the aircraft's performance. Furthermore, following an engine failure, the second segment climb requirement is to climb from 35 feet to 400 feet at V2 with the landing gear selected to up. The commander did not raise the gear because he did not observe a positive rate of climb. However, evidence from the FDR was that a maximum airspeed of 128 kt was achieved and, as this was some 19 kt higher than the V2 speed, it indicated that the aircraft had a capability to climb which was not being used. These last three factors may have combined to reduce the climb capability of the aircraft to zero and, in that situation, the decision to not raise the gear was correct. However, all these factors were influenced by inappropriate crew actions. Although both pilots had flown together before, the lack of adherence to JAR-OPS conversion requirements may have been partly responsible for their actions during the emergency. "}