{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-carlyle-1-killed", "date": "Jan 22, 1996 at 1614 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Budget Marketing", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Des Moines – Nashville", "msn": "46-22171", "yom": 1994, "flight_number": null, "city": "Carlyle", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3858, "captain_hours_type": 2626, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 202, "circumstances": "During flight, the airplane was cruising at flight level 210 in IFR conditions with turbulence and with the wind from about 255 degrees at 70 knots. The airplane drifted off course at about 1600 cst. At 1610:09, after about ten minutes of unrecognized heading changes, the pilot stated '. . . I've lost my gyro.' At 1610:15, the controller issued a no-gyro vector. At 1611:29, as the airplane was still turning (to a heading that would intercept the original course), the pilot stated 'we've lost aLL our instruments . . . please direct me towards VFR.' He was cleared to descend to 14,000 feet. At about that same time, he stated 'we're in trouble' and 'we've lost all vacuum,' then there was no further radio transmission from the airplane. The airplane entered a steep, downward spiraling, right turn. The left outer wing panel separated up and aft (in flight) from overload and impacted the left stabilizer. The airplane crashed, and parts that separated from the airplane were found over a four mile area. Investigation revealed evidence that the HSI heading card can fail without the HDG flag appearing. Although the pilot had reported the loss of instruments and vacuum, examination of the airplane revealed that the engine, flight controls, electrical system, pitot/static system and vacuum systems exhibited continuity. No malfunction was found that would have led to loss of pressurization or hypoxia. ", "probable_cause": "Spatial disorientation of the pilot, and his failure to maintain control of the airplane, which resulted in his exceeding the design stress limits of the airframe. A factor relating to the accident was: turbulence in clouds. "}