{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-134ak-near-vizinga-54-killed", "date": "Jul 2, 1986 at 1027 LT", "type": "Tupolev TU-134", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Vorkuta - Syktyvkar - Moscow", "msn": "60482", "yom": 1978, "flight_number": "SU2306", "city": "Vizinga", "zone": "Republic of Komi", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 2, "pax_on_board": 86, "pax_fatalities": 52, "other_fatalities": 0, "total_fatalities": 54, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13988, "circumstances": "The aircraft departed Syktyvkar Airport at 0955LT bound for Moscow and continued to climb in normal weather conditions. Twelve minutes later, while cruising at an altitude of 5,600 meters, the fire alarm connected to the rear cargo compartment activated in the cockpit. The flight engineer was dispatched to the rear of the cabin to check the situation and came back less than two minutes later, confirming that smoke was spreading. Instead of declaring an emergency and informing ATC about the situation according to published procedures, the captain decided to inspect the rear of the cabin with the flight engineer. They elected to extinguish the fire but this was unfortunately not possible. They returned to the cockpit and in the meantime, the airplane continued to climb to 6,700 meters. The captain contacted ATC, declared an emergency more than 4 minutes after the fire alarm activated and was cleared to return to Syktyvkar. At this time, the aircraft position was about 140 km from Syktyvkar Airport. The captain started an emergency descent and at an altitude of 1,200 meters, flaps and gear were lowered. The crew realized it would not be able to reach Syktyvkar Airport so he attempted an emergency landing on land. In a reduced visibility due to rain falls, the aircraft struck trees, lost its both wings and crashed 340 meters further in a dense wooded area, bursting into flames. Four crew members and 34 passengers were rescued while 54 other occupants were killed. The aircraft was totally destroyed by impact forces and fire.  ", "probable_cause": "As the aircraft was completely destroyed by fire, investigations were unable to determine the exact source of fire that started in the rear cargo compartment. It was reported that the crew tried, without success, to extinguish the fire. Also smoke spread in the cabin, asphyxing people that lost consciousness or died before the accident. "}