{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-cold-bay-15-killed", "date": "Aug 29, 1956 at 2045 LT", "type": "Douglas DC-6", "operator": "CP%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Vancouver – Cold Bay – Tokyo – Hong Kong", "msn": "43843", "yom": 1953, "flight_number": "CP307", "city": "Cold Bay", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 8, "crew_fatalities": 4, "pax_on_board": 14, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": 9522, "captain_hours_type": 2906, "copilot_hours": 12782, "copilot_hours_type": 465, "aircraft_hours": 10513, "circumstances": "Flight 307 departed Vancouver, British Columbia at 1347 Bering standard time en route to Hong Kong, China, with a refueling stop at Cold Bay, Alaska and an intermediate stop at Tokyo, Japan, carrying a crew of 8 and 14 passengers. At 2011 the flight reported 100 miles out, estimating Cold Bay at 2036. It reported being over the Cold Bay range station outbound on a standard instrument approach at 2035, and at 2042 as completing a procedure turn and proceeding inbound. This was the last transmission from the flight. At 2045 the aircraft was observed to descend from the overcast north of the airport for a landing on runway 14 and cross the field at low altitude to the intersection of the two runways. At this point a shallow left turn was started and the aircraft went out of sight southeast of the airport. Shortly afterwards a fire was observed and it was ascertained that the aircraft had crashed. Eleven passengers and 4 crew members were fatally injured. The aircraft was destroyed by impact forces and a post crash fire. ", "probable_cause": "The probable cause of this accident was the full retraction of the wing flaps at low altitude during a circling approach without necessary corrective action being taken by the crew. Considering that very little altitude was gained after the application of power it is probable that a circling approach had been decided upon when the left turn from runway 14 was made. Since the wing flaps during the circling approach would be extended 20 degrees, and since they were found in the fully retracted position, it is believed that they were retracted shortly before impact. Fully retracted wing flaps at this time would explain the feeling of experienced by the off-duty flight crew member."}