{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-providenciales", "date": "Jul 10, 1993 at 1015 LT", "type": "Piper PA-31-310 Navajo", "operator": "Schaked Corporation", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Cap Haïtien - Great Inagua", "msn": "31-10", "yom": 1967, "flight_number": null, "city": "Providenciales", "zone": "All Turks and Caicos Islands", "country": "Turks and Caicos Islands", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2027, "captain_hours_type": 380, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On July 10, 1993, about 1015 eastern daylight time, a Piper PA-31, N36L, registered to and operated by the Schaked Corporation, experienced total loss of power from both engines due to fuel exhaustion and was ditched about 18 nautical miles south of the Providenciales Airport, Turks and Caicos Islands, while on a personal flight. Visual meteorological conditions prevailed at the time and a VFR flight plan was filed. The airplane has not been recovered and is presumed to be destroyed. The airline transport-rated pilot and commercial pilot-rated passenger sustained minor injuries. The flight originated about 0900 from Cap Haitien, Haiti.  The day before the accident flight, the fuel tanks were filled and the airplane was then flown for about 2 hours. After landing, the pilot requested an auxiliary power unit (APU) for the following morning to jump start the engines due to electrical system problems.  The pilot further stated that during the airplane preflight, he visually determined that the fuel tanks were 1/2 full. The APU was used to start the engines and about 20 minutes after departure, the electrical system failed. The flight continued and about 44 minutes later, Grand Turk Approach Control was contacted using a hand held radio. A clearance to land was requested and the controller was advised that the airplane was low on fuel. The controller advised the crew that the flight was about 60 miles east of the airport and the Providenciales Airport was about 31 miles north of their position. The flight proceeded directly to that airport and shortly thereafter, the pilot stated that the left engine failed due to fuel exhaustion. About 5 minutes later, the right engine failed due to the same reason. The airplane was ditched and the occupants were rescued about 7 hours after the ditching.  According to the pilot-rated passenger, the pilot reset the alternators and voltage regulators after contact was established with the approach control facility.\n", "probable_cause": "Total loss of engine power from both engines due to fuel exhaustion after the pilot became lost/disoriented. Contributing to the accident was the delay by the pilot-in-command to execute the emergency procedure by resetting the alternators and voltage regulators following total failure of the electrical system. Also contributing to the accident was the operation of the airplane by the pilot-in-command with known deficiencies in equipment. "}