{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-15rc-cleveland-2-killed", "date": "Feb 17, 1991 at 0019 LT", "type": "Douglas DC-9", "operator": "Ryan%20International%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Buffalo - Cleveland - Indianapolis", "msn": "47240", "yom": 1968, "flight_number": "RYN590", "city": "Cleveland-Hopkins", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 10505, "captain_hours_type": 505, "copilot_hours": 3820, "copilot_hours_type": 510, "aircraft_hours": 47574, "circumstances": "The flight had flown through weather conducive to airframe ice about 40 minutes prior to the accident during descent into Cleveland. During the 35-minute turnaround at Cleveland the crew did not exit the airplane to conduct an exterior preflight inspection to verify that the wings were free of ice contamination. It was snowing while they were on the ground. The airplane stalled and rolled into the ground immediately after takeoff. There was no operator requirement for the preflight. The flight had not been given training regarding the effects of wing contamination on the airplane. The FAA and the manufacturer have been aware for several years of the propensity of the DC-9 series 10 to the loss of control caused by wing contamination, but neither of them took positive action to include related information in the approved airplane flight manual. Both pilots were killed. ", "probable_cause": "The failure of the flightcrew to detect and remove ice contamination on the airplane's wings, which was largely a result of a lack of appropriate response by the federal aviation administration, Douglas aircraft company, and ryan international airlines to the known critical effect that a minute amount of contamination has on the stall characteristics of the DC-9 series 10 airplane. The ice contamination led to wing stall and loss of control during the attempted takeoff."}