{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-near-quepos-3-killed", "date": "Nov 29, 2001 at 1148 LT", "type": "Cessna 208B Grand Caravan", "operator": "SANSA", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "San José – Quepos – Puerto Jiménez", "msn": "208B-0788", "yom": 1999, "flight_number": "LRS1625", "city": "Quepos", "zone": "Puntarenas (Central and South Pacific)", "country": "Costa Rica", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 5000, "captain_hours_type": null, "copilot_hours": 800, "copilot_hours_type": null, "aircraft_hours": 1955, "circumstances": "The single engine airplane departed San José Airport on a schedule flight to Puerto Jiménez with an intermediate stop in Quepos, carrying six passengers (3 Americans, 2 Germans and one Dutch) and two pilots. While descending in clouds to Quepos Airport, the aircraft collided with trees and crashed on the slope of a wooded mountain located about 13 km from Quepos Airport. Both pilots and one passenger were killed while five other passengers were seriously injured. The aircraft was totally destroyed by impact forces. ", "probable_cause": "Collision with terrain after the captain failed to ensure that the vertical, horizontal and lateral separation was sufficient to fly over the mountains while descending under VMC conditions. Also the crew failed to take appropriate corrective actions to prevent the aircraft to continue the descent until it impacted ground, resulting in a controlled flight into terrain. The following contributin factors were identified:\r\n- Momentary loss of situational awareness on the part of the flight crew,\r\n- Inadequate supervision by the pilot-in-command, \r\n- Non-compliance with standard operating procedures published by the operator,\r\n- Use of flight procedures neither written down in manuals nor approved by the authority,\r\n- Violation of safety rules,\r\n- Non-application of visual flight rules by the flight crew,\r\n- Shortcomings in the crew resources management,\r\n- Adverse weather conditions."}