{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1329-jetstar-ii-miami-1-killed", "date": "Jan 6, 1990 at 1142 LT", "type": "Lockheed L-1329 JetStar", "operator": "Greco Air", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Miami - Dallas", "msn": "5068", "yom": 1965, "flight_number": null, "city": "Miami-Intl", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 12500, "captain_hours_type": 900, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8791, "circumstances": "Flight was a 3-engine ferry with the #4 engine shut down. During takeoff roll at V1 the #2 engine overheat light came on. According to the copilot the pilot reduced throttle slightly and continued the takeoff. After lift-off the pilot aborted the takeoff. The airplane could not be stopped on the remaining runway and collided with antennas, approach lights and a construction site 1,180 feet from the departure end of the runway. Postcrash exam of the 3 operating engines did not reveal any evidence of mechanical failure or malfunction. A failed resistor was found in the #2 engine electronic engine control (eec). This would cause the unit to over-schedule fuel to the engine resulting in hotter engine operating temperatures. Retarding the throttle would reduce fuel flow to within normal ranges for engine operation. Under conditions that existed at the time of the accident, the airplane would have a 3-engine rate-of-climb of 1,398 fpm, and a 2-engome rate-of-climb of 350 fpm. The captain was killed while the copilot was seriously injured. ", "probable_cause": "The pilot's improper decision to reject the takeoff after the airplane had passed V1 speed and lifted off the runway. A factor was a malfunctioning #2 engine electronic engine control which caused the unit to over-schedule fuel to the engine resulting in hotter operating temperatures."}