{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-14p-moscow-9-killed", "date": "Jun 14, 1957 at 2310 LT", "type": "Ilyushin II-14", "operator": "LOT-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Warsaw – Moscow", "msn": "6 34 14 07", "yom": 1956, "flight_number": "LO232", "city": "Moscow-Vnukovo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 4, "pax_on_board": 8, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off from Warsaw-Okecie Airport on a non-stop scheduled flight to Moscow, following the normal route of flight LO232. It carried 8 passengers, 5 crew and 819 kg of mail and cargo. The flight was routine as far as Klimentiewo, 75 km west of Vnukovo Airport, and communication between the aircraft and the relevant units of the Air Traffic Control service was established. During the flight leg between Wiazma and Klimentiewo the aircraft followed its route and lowered altitude as instructed by the air traffic controller in view of the bad weather conditions (storm) in that area. Over Klimentiewo the aircraft was at an altitude of 400 m, altimeter setting 737.4 mm Hg (current QFE at Vnukovo Airport); the pilot reported sighting the ground and was cleared by the air traffic controller to descend to 300 m and to head for Vnukovo Airport. At 2307LT, i. e. 5 minutes before the scheduled time of arrival at the aerodrome, the crew requested approach clearance. The air traffic controller had transferred control of the aircraft to the approach control service ; the latter, having established contact with the aircraft, gave the pilot the QAM and cleared him for approach in accordance with the instrument approach procedure prescribed for that aerodrome. Although the pilot acknowledged receipt of the approach clearance, according to established procedure, he failed to adhere to the prescribed procedure and descended to such a low altitude that the aircraft hit the ground. The aircraft was completely demolished. Five passengers and 4 crew members were killed and 3 passengers were seriously injured.", "probable_cause": "The aircraft hit the ground while flying at an excessively low altitude fol- lowing the crew's application of an approach procedure other than that prescribed by Vnukovo Airport. The bad weather conditions which set in during the night and were not forecast in the messages had their influence on the disastrous end of the flight. "}