{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-ii-charallave-3-killed", "date": "Jul 2, 2008 at 2321 LT", "type": "Piper PA-31 Cheyenne", "operator": "Dovler Mangelli Fonialli", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "San Cristóbal – Charallave", "msn": "31-7820067", "yom": 1978, "flight_number": null, "city": "Charallave-Óscar Machado Zuloaga", "zone": "Miranda", "country": "Venezuela", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed San Cristóbal-Paramillo Airport on a private flight to Charallave with two passengers and one pilot on board. At 2319LT, he was cleared for a VOR-DME approach to runway 10. It was dark but the visibility was about 10 km. Shortly later, another aircraft on approach declared an emergency and became priority. The pilot was instructed to follow a holding pattern when two minutes later, the aircraft struck trees and crashed in a wooded and hilly terrain, bursting into flames. The wreckage was found the following morning 5,5 km northeast of the airport. The aircraft was totally destroyed and all three occupants were killed. ", "probable_cause": "Given the circumstances in which the accident occurred, it would be considered a CFIT (Controlled Flight Into Terrain) type accident, which occurs as a result of unintentional impact on the ground, when the aircraft is under the control of the pilot in command. It is considered that the most probable cause of the accident was the loss of situational awareness, caused mainly by the concern that he was becoming distracted by the emergency of the aircraft preceding him on the approach, because of his administrative relationship with this aircraft and its crew."}