{"url": "https://www.baaa-acro.com/crash/crash-hawker-siddeley-hs-125-3b-edinburgh-1-killed", "date": "Jul 20, 1970 at 1829 LT", "type": "BAe 125", "operator": "Imperial%20Tobacco", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Edinburgh - Newcastle", "msn": "25135", "yom": 1967, "flight_number": null, "city": "Edinburgh", "zone": "Midlothian (County of Edinburgh)", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5192, "captain_hours_type": 429, "copilot_hours": 4594, "copilot_hours_type": 144, "aircraft_hours": 1874, "circumstances": "On the day of the accident the aircraft left Bristol under the command of the company's chief pilot for a flight to Edinburgh via East Midlands Airport. After conveying passengers to Edinburgh it was scheduled to position empty at Newcastle Airport to collect passengers for Bristol. Weather briefing had been obtained and a thorough flight plan covering the outward and return flights had been filed before the aircraft left Bristol in the morning. As there were no passengers on the flight from Edinburgh to Newcastle, the captain decided to make use of this sector to continue the other pilot's training for command of the HS-125. Accordingly, the trainee captain was flying the aircraft from the left hand seat. Prior to takeoff he was briefed that a failure of one of the engines (he was not told which one), would be simulated on takeoff and for the purpose of the exercise the rudder bias system would be switched 'OFF'. The pilots decided that no flap would be used for the takeoff which was started from the end of runway 13. The point where the aircraft became airborne was approximately 2,700 feet from the start of the roll, which was normal for the aircraft's weight and configuration, with both engines operating. The training captain called 'rotate' at approximately 120 knots, which was slightly faster than the calculated figure and when the aircraft had reached a height of approximately 12 feet and had accelerated to about 130 knots, he pulled back the thrust lever of the port engine to simulate a failure. He considered that the trainee pilot's reaction to the emergency was slow and was just about to apply right rudder to counteract the yaw when the trainee pilot applied considerable force to the left rudder and locked his leg in position. The captain immediately applied full right aileron and opened the port thrust lever but he was unable to prevent a high rate of roll developing to the left. Approximately 700 feet after the point where the aircraft became airborne the port wing tip struck the runway, fracturing the port fuel tank and spilling out fuel. The aircraft left the runway at an angle of approximately 30 degrees to the left and travelled across the grass, becoming partially inverted before settling back sideways on the ground on its undercarriage. The sideways movement of the aircraft pulled off the nose gear and the aircraft then gyrated across the airfield sustaining further structural damage before coming to rest on its main wheels and tail facing approximately in the opposite direction to the direction of takeoff. During the aircraft's gyrations on the ground, fuel, which was centrifuged out of the fractured port tank, ignited and a flash fire occurred. When the aircraft finally came to rest there was a small residual fire in the port wing which was very quickly extinguished by the airport fire service.", "probable_cause": "The application of incorrect rudder following a simulated engine failure on take-off. The reason for this application of incorrect rudder has not been determined."}