{"url": "https://www.baaa-acro.com/crash/serious-incident-lockheed-l-1011-385-1-14-tristar-150-lyon", "date": "Jul 6, 2001 at 1856 LT", "type": "Lockheed L-1011 TriStar", "operator": "Air-Transat-2", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lyon – Berlin", "msn": "1019", "yom": 1972, "flight_number": "TS906", "city": "Lyon-Saint Exupéry (ex Satolas)", "zone": "Rhône", "country": "France", "region": "Europe", "crew_on_board": 14, "crew_fatalities": 0, "pax_on_board": 197, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 22000, "captain_hours_type": 2600, "copilot_hours": 14300, "copilot_hours_type": 180, "aircraft_hours": 66223, "circumstances": "On 6 July 2001 at 18:46, a Lockheed TriStar operated by the Canadian airline Air Transat took off from runway 18R at Lyon Saint-Exupéry Airport (LYS), France for flight TSC906 to Berlin-Schönefeld Airport (SXF) with 14 crew members and 197 passengers. At 18:50 the crew contacted Marseilles and requested a heading of 350 degrees to avoid the area of active clouds that the crew had noticed on their weather radar. The controller cleared the flight to climb to FL160, at the requested course. The flight was cleared to climb further to FL190 and at 18:55 instructed to turn right to the MOREG reporting point. During the turn towards the reporting point, while the autopilot was connected, the crew saw that they were approaching an active cell. The captain, who was PNF, instructed the copilot to tighten the turn, which reached a 45° bank angle. At 18:56 Marseille transferred the flight to Geneva Control. It was during this first turn to MOREG that the first burst of hail hit the plane for a duration of one to two seconds. Then a second hailstorm struck the plane, with a duration of 10 to 15 seconds. At that moment the captain took control of the aircraft putting the airplane in a 60° bank angle. The plane lost 500 feet altitude. The crew did not declare an emergency but advised ATC of his intention to turn back to Lyon. The captain asked the flight engineer to depressurize the cabin, which was conducted during descent. There was no rapid depressurization. The windshield of the cockpit was badly damaged. The copilot had the best visibility and carried out the final approach and landing at Lyon-Saint Exupery. The plane landed safely at 1916LT and all 211 occupants evacuated safely. ", "probable_cause": "This accident occurred due to the flight of the aircraft in a very active cloud area whose color symbolism on the weather radar on board was not representative of the severity of the phenomena encountered. Although the crew chose to avoid the most active sector of this storm, it nevertheless flew through an area whose color representation on the board radar showed no real activity."}