{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-urnasch-1-killed", "date": "Sep 3, 1994 at 1531 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Air Material", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Zurich - Zurich", "msn": "767", "yom": 1979, "flight_number": null, "city": "Urnäsch", "zone": "Appenzell Ausserrhoden", "country": "Switzerland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5488, "captain_hours_type": 666, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5845, "circumstances": "The day prior to the accident, both propellers have been changed at Basel Airport and the pilot returned to his base in Zurich. Due to poor weather conditions en route, he was unable to conduct a test of both propellers, reason why a test flight was scheduled on September 3. After his departure from Zurich-Kloten Airport runway 28, the pilot flew to the east and was cleared to climb to FL130, the assigned altitude where the test should be performed. Ten minutes after takeoff, he informed ATC that he would shut the right engine down. The aircraft lost speed and height then deviated from the prescribed flight path. The pilot was able to restart the right engine and to regain control when, three minutes later, he informed ATC he would shut the right engine down for the second time. The aircraft entered a right turn then a rapid descent and crashed in a wooded area, bursting into flames. The aircraft was destroyed and the pilot, sole on board, was killed. ", "probable_cause": "Detailed examination of the right engine and its peripherals as well as a simulator reconstitution were able to identify the probable causes of the accident: \r\n- Malfunction of the Negative Torque System (NTS) on the right engine, \r\n- Blocking of the condition lever in the 'fuel off' position prior to the 'emergency stop' position,\r\n- Continuation of a technical control flight despite the malfunction of the Negative Torque System (NTS),\r\n- Loss of control during an extreme asymmetrical thrust caused by the fact that the right propeller was in windmilling position with a high number of rounds. "}