{"url": "https://www.baaa-acro.com/crash/crash-cessna-208-caravan-i-warri", "date": "Nov 27, 1998 at 1025 LT", "type": "Cessna 208A Caravan", "operator": "Pan%20African%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lagos – Lekki – Warri", "msn": "208-0200", "yom": 1991, "flight_number": null, "city": "Warri", "zone": "Delta", "country": "Nigeria", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4613, "circumstances": "A float-equipped Cessna Caravan, 5N-PAN, departed Lagos (LOS) on a chartered flight to Warri with a scheduled stop-over at Lekki. The aircraft was airborne at 07:34 hours UTC and was cleared to 1,000 feet by Lagos Tower and landed at Lekki at 07:42 hours UTC. At 08:20 hours UTC, the aircraft departed Lekki and called Lagos Approach which cleared it to 3,500 feet with further instructions for the aircraft to report at TMA. The aircraft reported at TMA and continued its normal flight at 3,500 feet. On contact with Escravos Tower, it requested for a descent from 3,500 feet to 700 feet in order to overfly the Chevron facility at Opuekaba for an aerial inspection. After the inspection, the aircraft was cleared to 2,500 feet to resume its normal flight to Warri. The pilot made an outbound turn to line up for the final approach to runway 03. At about five nm DME from Warri the pilot chose to reduce speed to 120 knots and he selected gear down with flap 15°. At three nautical miles out, the aircraft was about 900 feet high above the approach path, and cleared to land. The aircraft was now configured for landing with flap at 30° and the pilot reduced the speed to between 85 and 90 knots. At about 1.5 miles out, the aircraft was between 350 - 400 feet high, gliding with 400 lb of torque, the pilot felt a small shudder from the engine which was instantaneously followed by a need for power input, so he advanced the throttle but there was no response from the engine. He quickly retracted the flaps and feathered the propeller. Then the pilot re-selected flap 30° and also unfeathered the propeller which restored the engine to full torque. The pilot decided to abandon the approach mainly because of the a building structure ahead, close to the runway threshold. The pilot chose to veer the airplane to the left of the approach path centerline and ditched into the swampy terrain, cutting through some scattered trees and shrubbery.", "probable_cause": "The probable cause of the accident was the little old fractured cotter pin which lodged itself in the orifice and caused the BOV to malfunction at the very critical instance when more power output was demanded from the powerplant. The engine did not completely flameout, because of the position of the BOV valve in partially/fully open position which, could only sustain idle running of the engine."}