{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-230-bogota-53-killed", "date": "Apr 20, 1998 at 1645 LT", "type": "Boeing 727-200", "operator": "TAME", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Bogotá - Quito", "msn": "21622", "yom": 1978, "flight_number": "AF422", "city": "Bogotá-El Dorado", "zone": "Bogotá Capital District", "country": "Colombia", "region": "South America", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 43, "pax_fatalities": 43, "other_fatalities": 0, "total_fatalities": 53, "captain_hours": 5062, "captain_hours_type": 2296, "copilot_hours": 7872, "copilot_hours_type": 528, "aircraft_hours": 34586, "circumstances": "The flight from Bogotá to Quito was completed by TAME on a wet-lease contract for Air France, second leg from the AF422 flight from Paris to Quito via Bogotá operated by an Airbus A340. After takeoff from runway 13 at Bogotá-El Dorado Airport, the crew was cleared for a Girardot 1 departure that consist of continuing on runway heading for 2 miles after takeoff, followed by a 90° right turn over the Romeo beacon. For unknown reasons, the crew continued straight forward until the aircraft impacted the Mt El Cable located ahead of the airport. The aircraft disintegrated on impact and all 53 occupants were killed, among them 25 European Nationals, seven Italians, six French, three Danish, three Spanish, two Germans, two Austrians, one British and one Swiss. The wreckage was found 50 metres below the summit. At the time of the accident, weather conditions were poor with rain, clouds at 2,300 feet and CB's. ", "probable_cause": "The crew suffered a loss of situational awareness after takeoff while climbing in IMC conditions. The crew failed to comply with the Girardot 1 departure procedure, deviated from the published departure procedures and maintain runway heading until the aircraft collided with terrain. "}