{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-990-30a-6-coronado-wurenlingen-47-killed", "date": "Feb 21, 1970 at 1334 LT", "type": "Convair CV-990", "operator": "Swissair", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Zurich - Tel Aviv", "msn": "30-10-15", "yom": 1962, "flight_number": "SR330", "city": "Würenlingen", "zone": "Aargau", "country": "Switzerland", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 38, "pax_fatalities": 38, "other_fatalities": 0, "total_fatalities": 47, "captain_hours": 9674, "captain_hours_type": 1612, "copilot_hours": 18429, "copilot_hours_type": 1969, "aircraft_hours": 24447, "circumstances": "The airplane departed Zurich-Kloten Airport runway 28 at 1314LT bound for Tel Aviv with 38 passengers and nine crew members on board. Seven minutes later, while climbing to an altitude of 14,000 feet some 41 km south of the airport, the captain contacted ATC and declared an emergency stating that a denotation occurred in the cargo compartment and that the cabin pressure was dropping. He requested an immediate return to Zurich and during the following minutes, he reported successively that smoke spread in the cabin and cockpit and that some of the instruments were unserviceable. He also reported the failure of the electrical system and asked for a radar assistance. While he was vectored to the airport, the copilot said 'smoke on board, I don't see anything' then the captain reported 'we are falling, goodbye everyone'. The airplane then completed a 180 turn, nosed down and crashed in a huge explosion in a wooded area located near the village of Würenlingen, some 22 km northwest of runway 14 threshold. The airplane totally disintegrated on impact and all 47 occupants were killed. At the time of impact, the airplane was in a nose-down attitude of 12° and at a speed of 422 knots and in a slight left bank. At the time of the accident, weather conditions were marginal with rain falls, a cloud base at 300 meters, overcast till 600 meters, visibility up to 5 km and wind 15-20 knots. Among the passengers were 15 Israelis, nine Germans, five Americans, two Canadians, two Mexicans, one Belgian, one French, one British, one Thai and 10 Swiss citizens, among them all nine crew members.", "probable_cause": "It was determined that the tragedy was the consequence of the detonation of an explosive device (bomb) that was placed on board, in the cargo hold. Connected to an altimeter, the bomb exploded once the altitude of 14,000 feet was reached, causing severe damages to the fuselage, the control systems and causing smoke to spread in the cabin. The act of sabotage was later claimed by the Palestinian group Abu Jihad who justified the terrorist act by the presence of several Israel senior officials on board. No human error and no technical discrepancy were reported during investigations. The fire that followed the explosion damaged some of the generators, creating several electrical short circuits that made it impossible to continue the operation of the aircraft."}