{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601p-north-las-vegas", "date": "Jan 5, 2012 at 1539 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Norman B. Ivans", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "North Las Vegas - North Las Vegas", "msn": "61-0756-8063375", "yom": 1980, "flight_number": null, "city": "North Las Vegas", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3900, "captain_hours_type": 1700, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4480, "circumstances": "The pilot reported that, immediately after touchdown, the airplane began “wavering” and moments later veered to the left. He attempted to regain directional control with the application of “full right rudder” and the airplane subsequently departed the right side of the runway. A witness reported that the airplane’s touchdown was “firm” but not abnormal. As the airplane approached the left side of the runway, it yawed right and skidded down the runway while facing right. As the airplane began moving to the right side of the runway, the witness heard the right engine increase to near full power. The airplane spun to the left, coming to rest facing the opposite direction from its approach to landing. Another witness reported seeing the propellers contact the ground. The pilot attributed the loss of directional control to a main landing gear malfunction. Post accident examination of the airplane revealed that the left propeller assembly was feathered and that the right propeller blades were bent forward, indicative of the right engine impacting terrain under high power. Both throttle levers were found in the aft/closed position, and both propeller control levers were in the full-forward position. The propeller control levers exhibited little friction and could be moved with pressure from one finger. The evidence suggested that the pilot inadvertently  feathered the left propeller assembly during the accident sequence. The pilot did not report any pre accident malfunctions or failures with the airplane’s engines or propeller assemblies that would have precluded normal operation.  ", "probable_cause": "The pilot's failure to maintain directional control of the airplane during the landing roll.\n"}