{"url": "https://www.baaa-acro.com/crash/crash-fokker-f28-fellowship-1000-izmir-66-killed", "date": "Jan 26, 1974 at 0730 LT", "type": "Fokker F28 Fellowship", "operator": "Turkish-Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Izmir - Istanbul", "msn": "11057", "yom": 1972, "flight_number": "TK301", "city": "Izmir-Cumaovasi", "zone": "Aegean Region (Ege Bölgesi)", "country": "Turkey", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 4, "pax_on_board": 68, "pax_fatalities": 62, "other_fatalities": 0, "total_fatalities": 66, "captain_hours": 2600, "captain_hours_type": 577, "copilot_hours": 2794, "copilot_hours_type": 395, "aircraft_hours": 2269, "circumstances": "Shortly after closing the doors and receiving tower permission the aircraft was taxied to the threshold of Runway 35 and began a rolling takeoff without delay. According to witnesses the aircraft had run approximately 3,200 feet before becoming airborne. When about 8 to 10 meters above the ground it yawed to the left and pitched nose-down. Contact with the ground was made in a nearly level attitude, first by the outboard fairing doors of the left wing flap, then by the left side of the fuselage belly, hitting the bank of a drainage ditch, which parallels the left (west) side of the runway at a distance of 28 meters from the runway. The aircraft then disintegrated and caught fire within 100 meters of travel. A crew member and six passengers survived while 66 other occupants were killed. ", "probable_cause": "The aircraft stalled on takeoff due to over-rotation and frost accretion on the wings. The aircraft remained overnight at Cumaovasi Airport in an open area. In the morning, 26 January at 0400 GMT, the temperature was 0° C and the relative humidity was 95%. When the takeoff was made the temperature had reached +3° C and the humidity 97%. In that weather condition some frost accretion existed on the upper wing surfaces and elevators. (The same kind of frost occurred on the wings of another F28 waiting at the apron at the same hours next day under almost the same meteorological conditions.) During the walk-around inspection prior to takeoff, frost formation was not noticed. It is quite possible that the temperature on the wings and tail of an aircraft parked overnight in the open could be even lower due to radiation. The length of Cumaovasi runway is 6,005 feet. According to the temperature and to the load of the aircraft a run of 2,800 feet is required to reach V1 and VR. Indications of the flight data recorder were that the aircraft became airborne when it reached 124 kt and a 3,200 feet run. The data recorder also showed that the speed of the aircraft reached 133 kt then dropped to 124 kt when it veered left. This indicates that the aircraft was rotated more than the normal angle of attack. It is believed that the frost accretion on the wings caused the aircraft to stall soon after takeoff, whereas it would have flown safely in normal conditions. Because of the low altitude after takeoff the pilot could not recover from the stall. "}