{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-independence-3-killed", "date": "Jan 20, 1987 at 1228 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Sachs%20Electric", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Kansas City - Saint Louis", "msn": "31-8352010", "yom": 1983, "flight_number": null, "city": "Independence", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 7418, "captain_hours_type": 596, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 861, "circumstances": "The two aircraft, a Beech U-21A and a Piper PA-31-350, collided nearly head on at 7,000 feet msl over Independence, MO. In daylight VMC conditions with a visibility of 20 miles. The U-21 was in level cruise and the PA-31 was climbing eastbound to an undisclosed altitude enroute to Saint Louis. Both aircraft were equipped with operating mode-c transponders but the controller in contact with the U-21 did not observe the conflict and traffic advisories were not provided. The PA-31 was operating in accordance with visual flight rules. The U-21 was operating in accordance with instrument flight rules. After the collision both aircraft crashed in uncontrolled descent. There was no indication that either aircraft took any evasive action. The conflict alert subprogram of the ARTS III tracking system was not programmed to alert the controllers to the impending collision and the two controllers did not observe any target in the vicinity of the data block representing the U-21. All six occupants in both aircraft were killed.", "probable_cause": "The National Transportation Safety Board determines that the probable cause of the accident was the failure of the radar controllers to detect the conflict and to issue traffic advisories or a safety alert to the flightcrew of the U-21; deficiencies of the see and avoid concept as a primary means of collision avoidance; and the lack of automated redundancy in the air traffic control system to provide conflict detection between participating and nonparticipating aircraft."}