{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-6b2-h2-turbo-porter-grenoble", "date": "Mar 15, 2018 at 1215 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "École de Parachutisme de Besançon Franche-Comté", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Grenoble - Grenoble", "msn": "551", "yom": 1963, "flight_number": null, "city": "Grenoble", "zone": "Isère", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2000, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12260, "circumstances": "The pilot, accompanied by an aircraft mechanic, departed Grenoble-Aples-Isère Airport (saint-Geoirs) to carry out a check flight following a maintenance operation on the airplane. Once in an open area south of the aerodrome, the pilot began the maneuvers provided for in the test program. At the end of a stall maneuver, he found that his actions on the rudder pedals have no effect. However, it maintained control of the ailerons and elevators. He informed the aerodrome controller of the problem and indicated that he was coming back to to land to the paved runway 09. Unable to determined the exact nature of the damage, the pilot chose to land with the flaps retracted. He managed with difficulty to aligne the airplane witn the runway 09 centerline. On final, at an altitude of 300 feet, the pilot changed his mind and decided to land on the unpaved right-hand runway 09 which adjoins the paved runway. On very short final, at flare, while reducing power, at a height of about 1-2 metres, the airplane rolled to the right then to the left, causing the wing tips and the propeller to struck the ground. The aircraft exited the unpaved runway to the left and came to rest on the right edge of the paved runway. Both occupants evacuated safely and the aircraft was damaged beyond repair. ", "probable_cause": "The rudder control broke in flight, causing a significant alteration of the aircraft yaw controllability. This failure considerably increased the pilot's workload and stress. In these conditions, it became difficult for him to keep the airplane aligned with the runway centreline upon landing. Monitoring the alignment of the aircraft was done to the detriment of the speed. It is very likely that the oscillations during the final step resulted from a stall of the aircraft at low speed."}