{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t3-t1040-cheyenne-kotzebue", "date": "Feb 21, 2000 at 1123 LT", "type": "Piper PA-31 Cheyenne", "operator": "Cape%20Smythe%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Point Lay - Kotzebue", "msn": "31-8275005", "yom": 1982, "flight_number": null, "city": "Kotzebue-Ralph Wien Memorial", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13500, "captain_hours_type": 4900, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11098, "circumstances": "The airplane collided with frozen pack ice, three miles from the airport, during a GPS instrument approach. Instrument conditions of 3/4 mile visibility in snow and fog were reported at the time of the accident. The pilot stated that he began a steep descent with the autopilot engaged. He indicated that as the airplane crossed the final approach course, the autopilot turned the airplane inbound toward the airport. He continued the steep descent, noted the airplane had overshot the course, and the autopilot was not correcting very well. He disengaged the autopilot and manually increased the correction heading to intercept the final approach course. During the descent he completed the landing checklist, extended the landing gear and flaps, and was tuning both the communications and navigation radios. The pilot said he looked up from tuning the radios to see the sea ice coming up too quickly to react, and impacted terrain. The pilot relayed there were no pre accident anomalies with the airplane, and that he 'did not stay ahead of the airplane.' ", "probable_cause": "The pilot descended below the minimum descent altitude. Factors associated with this accident were the task overload of the pilot during the instrument approach, and not performing a level off. "}