{"url": "https://www.baaa-acro.com/crash/crash-lockheed-pv-1-ventura-jeffersonville-8-killed", "date": "May 15, 1956 at 1038 LT", "type": "Lockheed PV-1 Ventura", "operator": "Crane Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago – Louisville", "msn": "5326", "yom": 1943, "flight_number": null, "city": "Jeffersonville", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 17600, "captain_hours_type": 9, "copilot_hours": 2297, "copilot_hours_type": 29, "aircraft_hours": 3109, "circumstances": "The flight was for the purpose of transporting six Crane officials from Chicago, Illinois, to Louisville, Kentucky, to attend a business convention. Departure was from O'Hare-Chicago International Airport on a VFR flight plan (changed en route to IFR) with the Crane Company's Chief Pilot Randolph A. Mulherin in command, and Robert H. Robinette, also a Crane pilot, as copilot. Gross weight upon departure was estimated to be 27,360 pounds; the maximum permissible takeoff weight was 31,000 pounds. Shortly after takeoff the pilot gave a routine report to Chicago radio of his time off as 0908 and his estimated elapsed flight time as one hour and 20 minutes. He did not request weather information at that time. Other radio contacts followed as the flight progressed, the final one being at 1034 over the Jeffersonville intersection. An approach was then started from that point to the Standiford Airport, 6-9/10 miles distant. During this approach the aircraft struck trees and crashed at a point one-half mile north of the Jeffersonville intersection. The airplane was destroyed and all eight occupants have been killed. ", "probable_cause": "The Board determines that the probable cause of this accident was a critical loss of altitude, due to a complete power loss from the left engine and the drag of its windmilling propeller. The following findings were reported: \r\n- Pilot Mulherin was relatively inexperienced with the subject model aircraft,\r\n- The left engine suddenly lost all power because of a disconnected carburetor control,\r\n- The left propeller was found not feathered,\r\n- Examination of the right engine revealed no significant defect,\r\n- Altitude could not be maintained and the aircraft struck high trees and then plunged steeply to the ground."}