{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-middlefield", "date": "Jan 18, 2023 at 0903 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Pablo Air Charters", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Youngstown – Detroit – Minneapolis", "msn": "31-7752186", "yom": 1977, "flight_number": null, "city": "Middlefield-Geauga County", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9275, "captain_hours_type": 750, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17154, "circumstances": "According to a preliminary review of airplane track data and pilot statements provided to law enforcement and the Federal Aviation Administration (FAA), the purpose of the flight was to pick up a sixth passenger at Willow Run Airport (KYIP), Detroit, Michigan, before continuing to Minneapolis, Minnesota. As the airplane climbed through about 6,000 feet mean sea level (msl) in instrument meteorological conditions (IMC), the pilot observed oil leaking from the right engine nacelle. About the time the airplane reached about 7,400 feet msl, the pilot noted a loss of right engine power. He secured the engine, declared an emergency, requested to divert to the closest airport, and the air traffic controller vectored the airplane for the RNAV RWY 11 approach at 7GA. The pilot successfully completed the approach and reported that the airplane touched down in the “first one-third” of the landing runway “about 120 knots with zero flaps.” The pilot determined that he would not stop the airplane before it reached the departure end of the 3,500-ft-long runway, but chose to continue on the ground rather than abort the landing with one engine inoperative and climb the airplane back into IMC for another instrument approach. The airplane overran the departure end of the runway, continued through the grass overrun, and impacted a hill and a fence before coming to rest upright about 600 feet beyond the runway end. All three landing gear collapsed and the airplane sustained substantial damage to the wings and fuselage. ", "probable_cause": null}