{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-stratford-8-killed", "date": "Apr 27, 1994 at 2256 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Action%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Atlantic City - Stratford", "msn": "31-7405417", "yom": 1974, "flight_number": null, "city": "Stratford-Igor I. Sikorsky", "zone": "Connecticut", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 3500, "captain_hours_type": 527, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The captain had ILS glideslope data available during the approach but did not fly the ILS glideslope. The partial obscuration of the airport environment, due to ground fog, contributed to the captain's failure to recognize that the airplane was high on both his approach and landing. The destruction of the airplane and the resulting occupant injuries were a direct result of the collision with the blast fence. FAA interaction and communication with local communities, although persistent, were unsuccessful in gaining support for runway safety area improvements and for the installation of approach lighting for runway 6. The passenger seats had been improperly assembled using unapproved parts, and seat belts had been installed incorrectly. ", "probable_cause": "The failure of the captain to use the available ILS glideslope, his failure to execute a go-around when conditions were not suitable for landing, and his failure to land the airplane at a point\r\nsufficient to allow for a safe stopping distance; the fatalities were caused by the presence of the non frangible blast fence and the absence of a safety area at the end of the runway."}