{"url": "https://www.baaa-acro.com/crash/crash-bae-125-700a-saltillo-8-killed", "date": "Apr 19, 2014 at 1946 LT", "type": "BAe 125", "operator": "Lineas Aéreas Comerciales (LACSA)", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "City", "schedule": "Cozumel - Saltillo", "msn": "257191", "yom": 1982, "flight_number": null, "city": "Saltillo", "zone": "Coahuila", "country": "Mexico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 12984, "captain_hours_type": 4470, "copilot_hours": 620, "copilot_hours_type": 67, "aircraft_hours": 6166, "circumstances": "Following an uneventful flight from Cozumel, the crew initiated an ILS/DME2 approach to Saltillo-Plan de Guadalupe Airport Runway 17. On final, the crew encountered poor visibility due to foggy conditions. Despite he was unable to establish a visual contact with the runway, the crew continued the approach and descended below the MDA when the aircraft collided with power cables and crashed on a building located in an industrial park, 1,448 metres short of runway. The aircraft was destroyed by impact forces and a post crash fire and all eight occupants were killed. The building was also destroyed by fire. At the time of the accident, the horizontal visibility was estimated to be 800 metres with a vertical visibility of 200 feet. ", "probable_cause": "The accident was the consequence of the decision of the crew to continue the approach below MDA in IMC conditions until the aircraft collided with power cables and impacted ground. The following contributing factors were identified:\r\n- The approach was unstable, \r\n- The decision of the crew to continue the approach below MDA without visual contact with the runway,\r\n- Poor safety culture by the operator, \r\n- The crew failed to comply with procedures related to an ILS/DME2 approach to runway 17, \r\n- Lack of crew resources management, \r\n- The crew failed to respond to the GPWS alarm, \r\n- The crew did not monitor the altitude during the final approach,\r\n- Poor weather conditions with a visibility below minimums, \r\n- Inadequate maintenance controls, \r\n- The crew failed to follow the SOP's. "}