{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh106-comet-1-near-calcutta-43-killed", "date": "May 2, 1953 at 1635 LT", "type": "De Havilland DH.106 Comet", "operator": "BOAC-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Singapore – Calcutta – New Delhi – London", "msn": "6008", "yom": 1952, "flight_number": "BA783", "city": "Calcutta", "zone": "West Bengal", "country": "India", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 37, "pax_fatalities": 37, "other_fatalities": 0, "total_fatalities": 43, "captain_hours": 8710, "captain_hours_type": 589, "copilot_hours": 4391, "copilot_hours_type": 261, "aircraft_hours": 1649, "circumstances": "On its scheduled return flight from Singapore to London the aircraft took off from Calcutta-Dum Dum Airport at 1629LT bound for New Delhi-Palam Airport. Six minutes later, while climbing, the crew encountered poor weather conditions with the presence of a thunder-squall. The airplane went out of control, nosed down and crashed near the village of Jagalgori, about 24 miles from Dum Dum Airport. The aircraft disintegrated on impact and all 43 occupants were killed. ", "probable_cause": "The accident was caused by structural failure of the airframe during flight through a thunder-squall. In the opinion of the Court the structural failure was due to overstressing which resulted either:\r\n- severe gusts encountered in the thunder-squall, or\r\n- overcontrolling or loss of control by the pilot when flying through the thunderstorm. \r\nThe following findings were pointed out:\r\n- before departure the Captain was in possession of all the relevant meteorological and air traffic control information required for the flight. This included the warning of a thunder-squall,\r\n- the aircraft encountered a norwester squall with thunderstorm shortly after take-off when climbing to its cruising altitude, and suffered structural failure in the air which caused fire,\r\n- an examination of the wreckage on the site did not reveal any sign of sabotage, lightning damage, faulty workmanship, defective material or power plant failure. "}