{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690a-bishop-4-killed", "date": "Aug 11, 2002 at 0123 LT", "type": "Rockwell Grand Commander 690", "operator": "Thomas F. Reid", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Oakland - Bishop", "msn": "690-11109", "yom": 1973, "flight_number": null, "city": "Bishop", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3802, "captain_hours_type": 52, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3782, "circumstances": "The pilot entered the left-hand traffic pattern at an uncontrolled airport on a dark moonless night. Witnesses reported observing the airplane in a left descending turn. As the airplane turned onto the base leg, its left bank angle suddenly became steep. The airplane rapidly descended until colliding with level desert terrain 1.63 nm from runway 30's threshold. There were no ground reference lights in the accident site area. An examination of the airplane structure, control systems, engines, and propellers did not reveal any evidence of preimpact malfunctions or failures. Signatures consistent with engine power were found in both the engines and the propellers. The wreckage examination revealed that the airplane descended into the terrain in a left wing and nose low attitude. Fragmentation evidence, consisting of the left navigation light lens and left propeller spinner, was found near the initial point of impact. The wreckage was found principally distributed along a 307- to 310-degree bearing, over a 617- foot-long path. The bearing between the initial point of impact and the runway threshold was 319 degrees. The pilot's total logged experience in the accident airplane was 52 hours, of which only 1.6 hours were at night. The pilot was familiar with the area, but he had made only two nighttime landings within the preceding 90 days. Review of the recorded ATC communications tapes did not reveal any evidence of pilot impairment during voice communications with the pilot. ", "probable_cause": "The pilot's failure to maintain an appropriate terrain clearance altitude while maneuvering in the traffic pattern due to the sensory and visual illusions created by a lack of ground reference lights and/or terrain conspicuity, and the dark nighttime conditions."}