{"url": "https://www.baaa-acro.com/crash/crash-antonov-24rv-donetsk-5-killed", "date": "Feb 13, 2013 at 1809 LT", "type": "Antonov AN-24", "operator": "South%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Odessa - Donetsk", "msn": "3 73 087 09", "yom": 1973, "flight_number": "YG8971", "city": "Donetsk", "zone": "Donetsk Oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 44, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 3245, "captain_hours_type": 560, "copilot_hours": 175, "copilot_hours_type": null, "aircraft_hours": 51136, "circumstances": "On final approach to Donetsk-Sergei Prokofiev Airport, during the last segment, the aircraft banked right to a angle of 48°, causing the right wing to struck the ground. The aircraft overturned and crashed in a grassy area to the left of runway 08, coming to rest upside down. Five passengers were killed while all other occupants were injured. The aircraft was destroyed. It was performing a charter flight from Odessa with 44 football fans on their way to a match between Shakhtar Donetsk and Borussia Dortmund. At the time of the accident, the visibility was poor due to the night and foggy conditions. The horizontal visibility was reported to be 250 metres with an RVR of 750 metres for runway 08 and vertical visibility of 200 feet. ", "probable_cause": "It was planned that an instructor should perform the flight with the crew but he did not show up, so the captain decided to do the flight without him. On final approach to Donetsk, the visibility was limited and the captain was authorized to descent until 1,000 feet on approach where he should establish a visual contact with runway 08 or the approach lights. At this decision height, he continued the approach without any calls to the rest of the crew despite he did not establish any visual contact with the runway. During the last segment, the aircraft banked right due to a too low approach speed of 103 knots, stalled and crashed. The crew failed to monitor the approach speed, and the captain decided to continue the approach despite the visibility was below minimums. At the decision height, he should abandon the approach for a go-around procedure. "}