{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-uc-45j-expeditor-urbana", "date": "Apr 29, 2000 at 1315 LT", "type": "Beechcraft C-45 Expeditor", "operator": "Brutlag Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rantoul - Urbana", "msn": "7073", "yom": 1944, "flight_number": null, "city": "Urbana-Day Aero Place", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1800, "captain_hours_type": 700, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot said he performed three-point touchdown, landing to the east on a grass airstrip. He said, '... as we landed, the tail wanted to come up, so I pulled the stick all the way back and held\r\nit back ... while I was reaching to lift the flaps off.' The pilot said that before he got the flaps retracted, he noticed the tail was coming up again. He ensured that the power was off and his feet were off the brakes. 'The airplane came up on its nose. We were almost stopped before we flipped on our back over the nose.' The pilot said that when he later returned to the airplane, he noticed the 'T-handle brake lever was 3/4 engaged.' Examination of the airplane revealed heavy longitudinally running grass rubbing on both tires. The brake discs were free and the wheels rotated freely. An examination of the field showed a pair of parallel-running tire marks moving toward the north side of the landing strip, and 11 succeeding slashes in the ground running perpendicular to the parallel tire tracks on the airplane's left side. An examination of the remaining airplane systems revealed no anomalies. Wind conditions, reported 14 minutes after the accident, were 010° at 7 knots. ", "probable_cause": "The pilot not maintaining directional control on the ground and the abrupt brake application during the landing roll. "}