{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-11-hong-kong-3-killed", "date": "Aug 22, 1999 at 1843 LT", "type": "McDonnell Douglas MD-11", "operator": "Mandarin%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bangkok - Hong Kong - Taipei", "msn": "48468", "yom": 1992, "flight_number": "CI642", "city": "Hong Kong-Chek Lap Kok", "zone": "Hong Kong", "country": "China", "region": "Asia", "crew_on_board": 15, "crew_fatalities": 0, "pax_on_board": 300, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 17900, "captain_hours_type": 3260, "copilot_hours": 4630, "copilot_hours_type": 2780, "aircraft_hours": 30700, "circumstances": "China Airline’s flight CI642 was scheduled to operate from Bangkok to Taipei with an intermediate stop in Hong Kong. The crew had carried out the sector from Taipei to Bangkok, passing through Hong Kong on the previous day. On that flight, the crew were aware of the Severe Tropical Storm (STS) ‘Sam’ approaching Hong Kong and the possibility that it would be in the vicinity of Hong Kong at about the scheduled time of arrival on the following evening. Weather information provided at the preflight briefing for the return flight indicated the continuing presence of STS ‘Sam’ with its associated strong winds and heavy precipitation. The flight departed from Bangkok on schedule with 300 passengers and 15 crew on board, with an estimated time of arrival (ETA) of 1038 hour (hr) in Hong Kong. The commander had elected to carry sufficient fuel to permit a variety of options on arrival – to hold, to make an approach, or to divert. If an immediate approach was attempted, the aircraft would be close to its Maximum Landing Weight (MLW) involving, in consequence, a relatively high speed for the approach and landing. Throughout the initial stages of the flight and during the cruise, the commander was aware of the crosswind component to be expected in Hong Kong and reviewed the values of wind direction and speed which would bring it within the company’s crosswind limit as applicable to wet runways of 24 kt. In the latter stage of the cruise, the crew obtained information ‘Whisky’ from the Automatic Terminal Information Service (ATIS) timed at 0940 hr, which gave a mean surface wind of 320 degrees (º) / 30 knots (kt) maximum 45 kt in heavy rain, and a warning to expect significant windshear and severe turbulence on the approach. Although this gave a crosswind component of 26 kt which was in excess of the company’s wet runway limit of 24 kt, the commander was monitoring the gradual change in wind direction as the storm progressed, which indicated that the wind direction would possibly shift sufficiently to reduce the component and thus permit a landing. Hong Kong Area Radar Control issued a descent clearance to the aircraft at 1014 hr and, following receipt of ATIS information ‘X-ray’ one minute later, which included a mean surface wind of 300º at 35 kt, descent was commenced at 1017 hr. Copies of the information sheets used by Air Traffic Control (ATC) as the basis for ATIS broadcasts ‘Whisky’ and ‘X-ray’ are at Appendix 1. The approach briefing was initiated by the commander just after commencing descent. The briefing was given for an Instrument Landing System (ILS) approach to Runway 25 Right (RW 25R) at HKIA. However, the active runway, as confirmed by the ATIS was RW 25L. Despite the inclusion in the ATIS broadcasts of severe turbulence and possible windshear warnings, no mention was made in the briefing of the commander’s intentions relating to these weather phenomena nor for any course of action in the event that a landing could not be made, other than a cursory reference to the published missed approach procedure. The descent otherwise continued uneventfully and a routine handover was made at 1025 hr to Hong Kong Approach Control which instituted radar vectoring for an ILS approach to what the crew still believed was RW 25R. At 1036 hr, after having been vectored through the RW 25L localizer for spacing, CI642 was given a heading of 230º to intercept the localizer from the right and cleared for ILS to RW 25L. The co-pilot acknowledged the clearance for ILS 25L but queried the RVR (runway visual ranges); these were passed by the controller, the lowest being 1300 m at the touchdown point. The commander then quickly re-briefed the minimums and go-around procedure for RW 25L. At 1038 hr, about 14 nautical miles (nm) to touchdown, the aircraft was transferred to Hong Kong Tower and told to continue the approach. At 1041 hr, the crew were given a visibility at touchdown of 1600 metres (m) and touchdown wind of 320º at 25 kt gusting 33 kt, and cleared to land. The crew of flight CI642 followed China Airline’s standard procedures during the approach. Using the autoflight modes of the aircraft, involving full use of autopilot and autothrottle systems, the flight progressed along the ILS approach until 700 ft where the crew became visual with the runway and approach lights of RW 25L. Shortly after this point the commander disconnected the autopilot and flew the aircraft manually, leaving the autothrottle system engaged to control the aircraft’s speed. After autopilot disconnect, the aircraft continued to track the runway centreline but descended and stabilized slightly low (one dot) on the glideslope. Despite the gustiness of the wind, the flight continued relatively normally for the conditions until approximately 250 ft above the ground at which point the co-pilot noticed a significant decrease in indicated airspeed. Thrust was applied as the co-pilot called ‘Speed’ and, as a consequence, the indicated airspeed rose to a peak of 175 kt. In response to this speed in excess of the target approach speed, thrust was reduced and, in the process of accomplishing this, the aircraft passed the point (50 ft RA) at which the autothrottle system commands the thrust to idle for landing. Coincidentally with this, the speed decreased from 175 kt and the rate of descent began to increase in excess of the previous 750-800 feet per minute (fpm). Although an attempt was made to flare the aircraft, the high rate of descent was not arrested, resulting in an extremely hard impact with the runway in a slightly right wing down attitude (less than 4º), prior to the normal touchdown zone. The right mainwheels contacted the runway first, followed by the underside of the right engine cowling. The right main landing gear collapsed outward, causing damage to the right wing assembly, resulting in its failure. As the right wing separated, spilled fuel was ignited and the aircraft rolled inverted and came to rest upside-down alongside the runway facing in the direction of the approach. The cockpit crew were disorientated by the inverted position of the aircraft and found difficulty in locating the engine controls to carry out engine shut down drills. After extricating themselves, they went through the cockpit door into the cabin and exited the aircraft through L1 door and began helping passengers from the aircraft through a hole in the fuselage. Airport fire and rescue services were quickly on the scene, extinguishing the fuel fire and evacuating the passengers through the available aircraft exits and ruptures in the fuselage. As a result of the accident, two passengers were found dead on arrival at hospital, and six crew members and 45 passengers were seriously injured. One of the seriously injured passengers died five days later in hospital. ", "probable_cause": "The cause of the accident was the commander’s inability to arrest the high rate of descent existing at 50 feet RA. Probable contributory causes to the high rate of descent were:\r\n- The commander’s failure to appreciate the combination of a reducing airspeed, increasing rate of descent, and with the thrust decreasing to flight idle.\r\n- The commander’s failure to apply power to counteract the high rate of descent prior to touchdown.\r\n- Probable variations in wind direction and speed below 50 feet RA may have resulted in a momentary loss of headwind component and, in combination with the early retardation of the thrust levers, and at a weight only just below the maximum landing weight, led to a 20 kt loss in indicated airspeed just prior to touchdown. A possible contributory cause may have been a reduction in peripheral vision as the aircraft entered the area of the landing flare, resulting in the commander not appreciating the high rate of descent prior to touchdown."}