{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-300-diamond-ia-jasper", "date": "Mar 1, 1995 at 0920 LT", "type": "Mitsubishi MU-300 Diamond", "operator": "Lignum", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Williams Lake - Jasper", "msn": "76", "yom": 1984, "flight_number": null, "city": "Jasper-Hinton", "zone": "Alberta", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3500, "captain_hours_type": 360, "copilot_hours": 13500, "copilot_hours_type": 350, "aircraft_hours": 3290, "circumstances": "The Mitsubishi MU-300 Diamond business jet was on an instrument flight rules (IFR) flight from Williams Lake, British Columbia, to Hinton, Alberta. There were two pilots and two passengers on board. Prior to issuing the descent clearance from flight level 270 (FL270), the Edmonton Area Control Centre (ACC) advised the crew of the Jasper townsite, Alberta, weather. The winds were reported as calm. The crew cancelled the IFR during the descent and continued for a visual approach and landing to runway 02 at the Jasper-Hinton Airport. During the approach, the crew encountered moderate turbulence on short final. The captain increased the reference airspeed (Vref) from 105 to 115 knots to allow for subsiding air and airspeed fluctuations. The crew noted that the wind sock for runway 02 was fully extended and was varying in direction frequently. They elected to continue the approach and landing on runway 02. Power was reduced to idle at 50 feet. The aircraft touched down at about 1,000 feet down the runway. During the landing roll, the captain first applied maximum braking and then, when he determined that the aircraft would not come to a stop in the remaining runway distance available, he initiated commanded swerving to assist in stopping the aircraft; the aircraft skidded to a position 255 feet off the end of the runway. The aircraft sustained substantial damage; however, the occupants were uninjured. The accident occurred at latitude 53°19'N, longitude 117°45'W, at an elevation of 4,016 feet above sea level (asl), at 0920 mountain standard time (MST), during the hours of daylight.", "probable_cause": "The aircraft overran the runway because the crew landed with a 14- to 21-knot tailwind. Contributing to the occurrence were the crew's belief that the calm winds given to them by the Area Control Centre for Jasper townsite were for the Jasper-Hinton Airport, and their decision to continue with the straight-in approach procedure without overflying the airport."}