{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-6-capilla-del-senor", "date": "Oct 16, 1954 at 1520 LT", "type": "Convair CV-240", "operator": "Aerolineas-Argentinas-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Buenos Aires – Córdoba", "msn": "77", "yom": 1949, "flight_number": null, "city": "Capilla del Señor", "zone": "Buenos Aires province", "country": "Argentina", "region": "South America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 27, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft, engaged on a scheduled flight non-stop from Ezeiza to Córdoba, took off from Ezeiza Airport at 1500LT with 27 passengers and 5 crew. The approved flight plan provided for a VFR flight at a cruising level of 1,200 meters. At 1510LT the aircraft asked Buenos Aires ATC for clearance to change its altitude to 600 meters due to a marked frontal belt having been encountered. Shortly after this, the aircraft entered a storm area with rain, hail and strong electrical discharges of increasing intensity which caused uncontrolled loss of altitude. It continued descending until it struck the ground at approximately 1520LT, injuring the pilot, two crew and four passengers. ", "probable_cause": "Through causes which could not be fully ascertained and in circumstances arising while the aircraft, in attempting to leave the area of a violent storm, was flying at a low altitude, the aircraft was carried into the ground. The following factors were considered as contributory:\r\n- The persistence of the pilot-in-command in attempting in climb, without making use, at the appropriate time, of the full power available to arrest the descent caused, according to his own statement, by meteorological conditions,\r\n- The decision by the pilot-in-command to enter a local storm the violence of which he did not foresee and which he could have circumnavigated as prescribed by the operational standards of the company,\r\n- The fact that the pilot-in-command had no meteorological information relating to the weather conditions he encountered."}