{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-north-adams-2-killed", "date": "Oct 5, 1999 at 0545 LT", "type": "Beechcraft 200 Super King Air", "operator": "Shoreline%20Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "North Adams - Lewisburg", "msn": "BB-400", "yom": 1978, "flight_number": null, "city": "North Adams-Harriman and West", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6450, "captain_hours_type": 160, "copilot_hours": 1530, "copilot_hours_type": 150, "aircraft_hours": 6020, "circumstances": "The pre-takeoff instrument flight rules clearance for the flight called for the airplane to climb and maintain 5,000 feet, and to expect flight level 220, 10 minutes after departure. The clearance was read back correctly by a member of the flight crew. Shortly after takeoff, a member of the flight crew asked air traffic control for a higher altitude, and then stated 'uh, you want us at twenty two hundred.' The approach controller transmitted 'should be at five thousand;' however, there were no further transmissions from the airplane. The airplane wreckage was located at an elevation of about 2,300 feet, approximately 4.8 miles west of the departure airport. The airplane impacted wooded up-sloping terrain. Several broken trees were observed, which led to the beginning of the debris path. The trees were broken at about the same height. A weather observation taken at an airport about 12 miles north-northwest of the accident site, about the time of the accident included: few Clouds at 300 feet and a ceiling of 1,700 feet overcast. ", "probable_cause": "The pilot-in-command's failure comply with an air traffic control clearance which resulted in a collision with terrain. A factor in this accident was clouds. "}