{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-mirage-bronson-4-killed", "date": "Mar 17, 1991 at 1036 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Donald M. Schreiber", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Saint Petersburg – Bedford", "msn": "46-8608042", "yom": 1986, "flight_number": null, "city": "Bronson", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 2252, "captain_hours_type": 268, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 662, "circumstances": "The pilot was on an IFR flight in IMC and received clearance to climb and maintain FL220. During climb, he informed ARTCC, '. . . We're having a problem.' When asked to say again, he began the same reply, then no further radio communication was received from the aircraft. Subsequently an inflight breakup occurred and wreckage was scattered over a wide area. The right outboard wing panel, horizontal stabilizer, elevators, right aileron and parts of the rudder were found at a distance from the main wreckage. These displayed evidence of overstress failure. No preexisting cracks or fatigue was found. Radar and weather data showed deviation from normal flight began at or near moderate convective weather echo (vip 2) as the aircraft was climbing thru 17,300 feet in freezing conditions. At that time, the rate of climb was about 200 feet/min and the ground speed was 150 to 160 knots. At 1032:18, a descent begun. During the next 2 to 3 minutes, the aircraft's altitude, heading and speed deviated. At 1035:17, other primary radar targets appeared, then radar contact was lost. Gross weight of the aircraft was estimated to be 4,311 lbs; max allowable weight was 4,100 lbs. CofG was estimated to be 1.59 inches behind the aft limit. All four occupants were killed.  ", "probable_cause": "The pilot's failure to activate the pitot heat before ascending above the freezing level in instrument meteorological conditions (IMC), followed by his improper response to erroneous airspeed indications that resulted from blockage of the pitot tube by atmospheric icing. Contributing to the accident was: the pilot's lack of currency in flying in IMC."}