{"url": "https://www.baaa-acro.com/crash/crash-tupolev-ant-9-kulob-6-killed", "date": "Jul 27, 1936 at 1435 LT", "type": "Tupolev ANT-9 (PS-9)", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Stalinabad - Kulob", "msn": "193", "yom": 1934, "flight_number": null, "city": "Kulob", "zone": "Khatlon Province", "country": "Tajikistan", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1452, "circumstances": "The airplane departed Stalinabad on a regular service to Kulob, carrying four passengers, two pilots and a load of 502 kg of various goods, 97 kg of mail and 54 kg of luggage. Following a downwind leg, while flying over the runway at a height of 10 metres, ready for landing, the pilot-in-command increased the engine power and initiated a go-around procedure. The airplane climbed to a height of 30 metres in an excessive nose-up attitude then stalled and crashed, bursting into flames. The aircraft was totally destroyed and all six occupants were killed.  ", "probable_cause": "The accident was the consequence of a series of errors on part of the pilot-in-command who, following a downwind approach, initiated a go-around as the landing procedure was obviously missed. At that point, he increased the throttle too sharply while the stabilizers were not in the correct position, resulting in the aircraft entering an excessive nose-up attitude followed by an aerodynamic stall. \r\nThe following contributing factors were identified: \r\n- No technical anomalies were found with the aircraft, its equipment or the engine;\r\n- Wrong approach configuration;\r\n- Incorrect actions during the go-around procedure; \r\n- Lack of discipline; \r\n- Overconfidence of the captain;\r\n- Crew fatigue;\r\n- Absence of a crew work conditions monitoring system."}