{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-martinsville-8-killed", "date": "Nov 14, 1982 at 1830 LT", "type": "Piper PA-31-310 Navajo", "operator": "7 C'S Transportation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Martinsville - Greenville", "msn": "31-7912115", "yom": 1979, "flight_number": null, "city": "Martinsville-Blue Ridge", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 1250, "captain_hours_type": 300, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 847, "circumstances": "The pilot filed an IFR clearance and took off on runway 30 after dark. At that time, the airport manager was in his living quarters, getting ready to eat his evening meal. He reported that from his position, the takeoff height looked normal. As the aircraft departed, he noticed no unusual sounds, except he heard what he thought was shots from a rifle. Another witness heard what he described as a loud pop and the sound of engine sputter followed by a crash sound. Later, the aircraft wreckage was found about 1,5 mile northwest of the airport. The investigation revealed that it had collided with trees and the wreckage was scattered over an area about 1,000 feet long. No preimpact malfunction or failure of the engines was found. The propeller blades were found twisted and bent. The flight controls were all accounted for and examined and no preimpact failures were found. No bullet impact marks were found on any piece of the wreckage. All eight occupants were killed. ", "probable_cause": "Occurrence #1: in flight collision with object\r\nPhase of operation: takeoff - initial climb\r\nFindings\r\n1. (f) light condition - dark night\r\n2. (c) proper climb rate - not maintained - pilot in command\r\n3. (f) object - tree(s)"}