{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-finca-la-bendicion-14-killed", "date": "Mar 9, 2019 at 1036 LT", "type": "Douglas DC-3", "operator": "Laser%20Colombia", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "San Jose del Guaviare – Villavicencio", "msn": "33105/16357", "yom": 1945, "flight_number": null, "city": "Finca La Bendición", "zone": "Meta", "country": "Colombia", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 12710, "captain_hours_type": 7044, "copilot_hours": 12710, "copilot_hours_type": 7044, "aircraft_hours": 23000, "circumstances": "The twin engine airplane departed San José del Guaviare on a charter flight to Villavicencio, carrying 11 passengers and three crew members. While cruising at an altitude of 8,500 feet in good weather conditions, the left engine failed due to an important fuel leak. The crew elected to secure the engine but was unable to feather the propeller. The airplane lost speed and height, and while attempting an emergency landing, the crew lost control of the airplane that stalled and crashed in a palm plantation, bursting into flames. The aircraft was totally destroyed by a post crash fire and all 14 occupants were killed. ", "probable_cause": "The investigation determined that the accident was caused by the following probable causes:\r\n- Loss of control in-flight as a consequence of the decrease in minimum in-flight control speed and drag generated by the impossibility of performing the No. 1 engine propeller feathering in the face of engine failure.\r\n- Malfunction of the lubrication system of engine No. 1, evident in the abundant oil leakage from the engine, in flight, and in the governor of the left propeller; although discrepancies were found in the maintenance of the propeller feathering pressure line, it was not possible to determine the origin of the oil leakage.\r\n- Weaknesses in the aircraft Operator's operational procedures, lacking a standard that would facilitate a crew's decision making to act in the event of critical failures, in matters such as making an emergency landing on unprepared field or the selection of an alternate airfield.\n\r\nContributing Factors:\r\n- Deficiencies in standard maintenance practices during repairs performed on the No. 1 engine's propeller propeller feathering oil pressure line.\r\n- Non-compliance with an effective and reliable maintenance program, which did not verify the operating conditions of the aircraft components; it was not possible to determine compliance with the last 50-hour service, Phase A, to engine No. 1 according to the company's maintenance program, since there are no records of that service in the Flight Log.\r\n- Inefficient safety management system of the Operator for not detecting errors in the maintenance processes and in the conduct and control of operations."}