{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-north-las-vegas-1-killed-0", "date": "Aug 28, 2008 at 1238 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Aeronet Supply", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "North Las Vegas - Palo Alto", "msn": "31-8152072", "yom": 1981, "flight_number": null, "city": "North Las Vegas", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3195, "captain_hours_type": 100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6373, "circumstances": "During climb a few minutes after takeoff, a fire erupted in the airplane's right engine compartment. About 7 miles from the departure airport, the pilot reversed course and notified the air traffic controller that he was declaring an emergency. As the pilot was proceeding back toward the departure airport witnesses observed fire beneath, and smoke trailing from, the right engine and heard boom sounds or explosions as the airplane descended. Although the pilot feathered the right engine's propeller, the airplane's descent continued. The 12-minute flight ended about 1.25 miles from the runway when the airplane impacted trees and power lines before coming to rest upside down adjacent to a private residence. A fuel-fed fire consumed the airframe and damaged nearby private residences. The airplane was owned and operated by an airplane broker that intended to have it ferried to Korea. In preparation for the overseas ferry flight, the airplane's engines were overhauled. Maintenance was also performed on various components including the engine-driven fuel pumps, turbochargers, and propellers. Nacelle fuel tanks were installed and the airplane received an annual inspection. Thereafter, the broker had a ferry pilot fly the airplane from the maintenance facility in Ohio to the pilot's Nevada-based facility, where the ferry pilot had additional maintenance performed related to the air conditioner, gear door, vacuum pump, and idle adjustment. Upon completion of this maintenance, the right engine was test run for at least 20 minutes and the airplane was returned to the ferry pilot. During the following month, the ferry pilot modified the airplane's fuel system by installing four custom-made ferry fuel tanks in the fuselage, and associated plumbing in the wings, to supplement the existing six certificated fuel tanks. The ferry pilot held an airframe and powerplant mechanic certificate with inspection authorization. He reinspected the airplane, purportedly in accordance with the Piper Aircraft Company's annual inspection protocol, signed the maintenance logbook, and requested Federal Aviation Administration (FAA) approval for his ferry flight. The FAA reported that it did not process the first ferry pilot's ferry permit application because of issues related to the applicant's forms and the FAA inspector's workload. The airplane broker discharged the pilot and contracted with a new ferry pilot (the accident pilot) to immediately pick up the airplane in Nevada and fly it to California, the second ferry pilot's base. The contract specified that the airplane be airworthy. In California, the accident pilot planned to complete any necessary modifications, acquire FAA approval, and then ferry the airplane overseas. The discharged ferry pilot stated to the National Transportation Safety Board (NTSB) investigator that none of his airplane modifications had involved maintenance in the right engine compartment. He also stated that when he presented the airplane to the replacement ferry pilot (at most 3 hours before takeoff) he told him that fuel lines and fittings in the wings related to the ferry tanks needed to be disconnected prior to flight. During the Safety Board's examination of the airplane, physical evidence was found indicating that the custom-made ferry tank plumbing in the wings had not been disconnected. The airplane wreckage was examined by the NTSB investigation team while on scene and following its recovery. Regarding both engines, no evidence was found of any internal engine component malfunction. Notably, the localized area surrounding and including the right engine-driven fuel pump and its outlet port had sustained significantly greater fire damage than was observed elsewhere. According to the Lycoming engine participant, the damage was consistent with a fuel-fed fire originating in this vicinity, which may have resulted from the engine's fuel supply line \"B\" nut being loose, a failed fuel line, or an engine-driven fuel pumprelated leak. The fuel supply line and its connecting components were not located. The engine-driven fuel pump was subsequently examined by staff from the NTSB's Materials Laboratory. Noted evidence consisted of globules of resolidified metal and areas of missing material consistent with the pump having been engulfed in fire. The staff also examined the airplane. Evidence was found indicating that the fire's area of origin was not within the wings or fuselage, but rather emanated from a localized area within the right engine compartment, where the engine-driven fuel pump and its fuel supply line and fittings were located. However, due to the extensive pre- and post-impact fires, the point of origin and the initiating event that precipitated the fuel leak could not be ascertained. The airplane's \"Pilot Operator's Handbook\" (POH), provides the procedures for responding to an in-flight fire and securing an engine. It also provides single-engine climb performance data. The POH indicates that the pilot should move the firewall fuel shutoff valve of the affected engine to the \"off\" position, feather the propeller, close the engine's cowl flaps to reduce drag, turn off the magneto switches, turn off the emergency fuel pump switch and the fuel selector, and pull out the fuel boost pump circuit breaker. It further notes that unless the boost pump's circuit breaker is pulled, the pump will continuously operate. During the wreckage examination, the Safety Board investigators found evidence  indicating that the right engine's propeller was feathered. However, contrary to the POH's guidance, the right engine's firewall fuel shutoff valve was not in the \"off\" position, the cowl flaps were open, the magneto switches were on, the emergency fuel pump switches and the fuel selector were on, and the landing gear was down. Due to fire damage, the position of the fuel boost pump circuit breaker could not be ascertained. Calculations based upon POH data indicate that an undamaged and appropriately configured airplane flying on one engine should have had the capability to climb between 100 and 200 feet per minute and, at a minimum, maintain altitude. Recorded Mode C altitude data indicates that during the last 5 minutes of flight, the airplane descended while slowing about 16 knots below the speed required to maintain altitude.", "probable_cause": "A loss of power in the right engine due to an in-flight fuel-fed fire in the right engine compartment that, while the exact origin could not be determined, was likely related to the right engine-driven fuel pump, its fuel supply line, or fitting. Contributing to the accident was the pilot's failure to adhere to the POH's procedures for responding to the fire and configuring the airplane to reduce aerodynamic drag."}