{"url": "https://www.baaa-acro.com/crash/crash-sikorsky-s-43b-rio-de-janeiro-14-killed", "date": "Aug 13, 1939 at 1635 LT", "type": "Sikorsky S-43", "operator": "Pan%20Am.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Miami – Santiago de Cuba – Port-au-Prince – Trinidad – Georgetown – Paramaribo – Cayenne – Belém – Sao Luis – Luis Correia – Camocim – Fortaleza – Natal – Joao Pessoa – Recife – Maceió – Aracaju – Salvador – Caravelas – Vitória - Rio de Janeiro", "msn": "4316", "yom": 1936, "flight_number": null, "city": "Rio de Janeiro-Santos Dumont", "zone": "Rio de Janeiro", "country": "Brazil", "region": "South America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 12, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 4275, "captain_hours_type": 830, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3650, "circumstances": "The aircraft named 'Baby Clipper' was circled over Rio and was making a normal approach to the seaplane landing area adjoining the air line's Rio base near Santos Dumont Airport, in accordance with the company's established operating procedure, when it suddenly lost power on the left engine, yawed to the left, and started a descending turn in the same direction. The airplane continued to lose altitude and to turn at a sharper and steeper angle until it struck a caisson anchored at right angles to a small island in the harbor immediately adjacent to its landing approach path. All four members of the crew and 10 passengers were fatally injured, one passenger escaping with serious and another with minor injuries.\r\nCrew:\r\nAddison G. Parsons, pilot,\r\nGeorge B. King, copilot,\r\nRussell Jenkins, radio operator, \r\nJulio Trujillo, steward.\r\nPassengers:\r\nHenrie May Eddy,\r\nJames Harvey Rogers,\r\nRobert Landman,\r\nEvaristo Gomes Miranda, \r\nAnton Ommundsen,\r\nEmanuel Valensa, \r\nPablo Lavin,\r\nEdgar Delly Oliveira, \r\nAlberto Oliveira Santos,\r\nLucila A. Oliveira Santos,\r\nOsvaldo Hirth,\r\nMario Souto Lyra.", "probable_cause": "Ample evidence was obtained during the Air Safety Board's investigation of the accident that the left engine suffered a sudden loss of power at a critical time during the landing approach, although, since available evidence failed to supply any conclusive explanation for this loss of power, and a detailed examination of the engine, after disassembly, revealed no indication of structural failure or mechanical defects in flight, the report stated that 'the cause of the loss of power from the left engine is unknown'. In conclusion, the accident was caused by a sudden loss of power from the left engine during the landing approach, necessitating an attempted landing under extremely hazardous conditions.\n"}