{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-perris-valley", "date": "May 24, 2017 at 1515 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Skydive-Perris", "flight_phase": "Landing (descent or approach)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Perris Valley - Perris Valley", "msn": "489", "yom": 1976, "flight_number": null, "city": "Perris Valley", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3358, "captain_hours_type": 2131, "copilot_hours": 1893, "copilot_hours_type": 12, "aircraft_hours": 37885, "circumstances": "The pilot of the twin-engine, turbine-powered airplane reported that, while providing flights for skydivers throughout the day, he had a potential new hire pilot flying with him in the right seat. He added that, on the eighth flight of the day, the new pilot was flying during the approach and \"approximately 200 feet south from the threshold of [runway] 15 at approximately 15 feet AGL [above ground level] the bottom violently and unexpectedly dropped out. [He] believe[d] some kind of wind shear caused the aircraft [to] slam onto [the] runway and bounce into the air at a 45 to 60-degree bank angle to the right.\" The prospective pilot then said, \"you got it.\" The pilot took control of the airplane and initiated a go-around by increasing power, which aggravated the \"off runway heading.\" The right wing contacted the ground, the airplane exited the runway to the right and impacted a fuel truck, and the right wing separated from the airplane. The impact caused the pilot to unintentionally add max power, and the airplane, with only the left engine functioning, ground looped to the right, coming to rest nose down.", "probable_cause": "The prospective pilot's improper landing flare and the pilot's delayed remedial action to initiate a go-around, which resulted in a runway excursion."}