{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-saint-denis-19-killed", "date": "Mar 9, 1968 at 2317 LT", "type": "Douglas DC-6", "operator": "GLAM - Groupe de Liaisons Aériennes Ministérielles", "flight_phase": "Takeoff (climb)", "flight_type": "Government", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Saint-Denis - Djibouti - Paris", "msn": "43748/314", "yom": 1953, "flight_number": null, "city": "Saint-Denis", "zone": "La Réunion", "country": "La Reunion", "region": "Africa", "crew_on_board": 12, "crew_fatalities": 12, "pax_on_board": 8, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 19, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine aircraft with dual registration F-RAFB and 43748 was engaged in a flight from Saint-Denis de la Réunion to Paris with an intermediate stop at Djibouti City, on behalf of the Groupe de Liaisons Aériennes Ministérielles (GLAM). It arrived at Saint-Denis Airport in the morning and was supposed to stay an overnight in Saint-Denis. Thus, the crew was released for the day but finally called for a departure in the evening. 55 seconds after takeoff from runway 13 in light rain, the pilot was contacted by the controller at the airport who told him he was turning to the wrong direction and asked him to make an immediate turn to the left while gaining altitude. The pilot acknowledged the message when the left wing struck two araucarias and crashed in flames in a wooded area located about 5 km southeast of the airfield. The aircraft was destroyed by impact forces and a post crash fire and only one passenger survived while 19 other occupants were killed, among them General Charles Ailleret, Chief of Staff of the French Army. He was returning to Paris following an inspection of the French troops stationed in the Indian Ocean. The only survivor was Mrs Michèle Renard, personal nurse of General Ailleret. \r\nCrew:\r\nCpt Pradier, pilot, †\r\nCpt Gaëtan, pilot, †\r\nS/Lt Roulot, pilot, †\r\nLt Pezet, radio navigator, †\r\nLt Dombey, radio navigator, †\r\nS/Lt Brando, radio navigator, †\r\nAdj Ferdonnet, mechanic, †\r\nAdj Bouzereau, mechanic, †\r\nSgt Guiho, mechanic, †\r\nAdj Berrier, steward, †\r\nSgt Burigo, steward, †\r\nSgt Rouzeau, steward. †\r\nPassengers:\r\nGen Charles Ailleret, †\r\nMrs Liliane Ailleret, Gen Ailleret spouse, †\r\nMrs Annick Ailleret, Gen Ailleret daughter, †\r\nGen Henri Carles, chief of staff, †\r\nCol Fehner, Aviation chief of staff, †\r\nCpt Philipon, Gen Ailleret personal doctor, †\r\nCpt Commerçon, Gen Ailleret personal aide, †\r\nMrs Michèle Renard, Gen Ailleret personal nurse.", "probable_cause": "The exact cause of the accident was not determined with certainty. However, it is believed that the crew suffered an extreme fatigue at the time of the accident due to insufficient rest time (sleep time). For unknown reason, the crew started a turn to the right after takeoff from runway 13 which is not compliant with the published departure procedures for Saint-Denis-Gillot Airport."}