{"url": "https://www.baaa-acro.com/crash/crash-pacific-aerospace-pac750xl-ninia-1-killed", "date": "Aug 12, 2015 at 0748 LT", "type": "PAC 750XL - Pacific Aerospace Corporation", "operator": "Komala-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Wamena – Ninia", "msn": "170", "yom": 2010, "flight_number": null, "city": "Ninia", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1537, "captain_hours_type": 395, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 757, "circumstances": "On 12 August 2015, a PAC-750XL aircraft, registered PK-KIG, was being operated by PT. Komala Indonesia on an unscheduled passenger flight from Wamena Airport (WAJW) Papua to Ninia Airstrip , Yahukimo, Papua that was located on radial 127° from Wamena with a distance of approximately 26 Nm. At 0733 LT (2233 UTC), the aircraft departed from Wamena Airport with an estimated time of arrival at Ninia of 2248 UTC. The flight was uneventful until approaching Ninia. On board the aircraft were one pilot, one engineer and 4 passengers. According to the pilot statement, an airspeed indicator malfunction occurred during flight. Video footage taken by a passenger showed that, during the approach at an altitude of approximately 6,500 feet, the airspeed indicators indicated zero and the aural stall warning activated. The aircraft then flew on the left side and parallel to the runway. Thereafter the aircraft climbed, turned left and impacted the ground about 200 meters south-west of the runway. The engineer on board was fatally injured, one passenger had minor injuries and the other occupants, including the pilot, were seriously injured. Two occupants were evacuated to a hospital in Jayapura Airport and four others, including the fatally injured, were evacuated to a hospital in Wamena.", "probable_cause": "The following findings were identified:\r\n1. Continuing the flight with both airspeed indicators unserviceable increased the complexity of the flight combined with high-risk aerodrome increased the pilot workload.\r\n2. The improper corrective action at the time of the aural stall warning activating on the final approach, and the aircraft flew to insufficient area for a safe maneuver.\r\n3. The unfamiliarity to the airstrip resulted in inappropriate subsequent escape maneuver and resulted in the aircraft stalling.\r\n4. The pilot was not provided with appropriate training and familiarization to fly into a high-risk airstrip"}