{"url": "https://www.baaa-acro.com/crash/crash-namc-ys-11-111-matsuyama-50-killed", "date": "Nov 13, 1966 at 2028 LT", "type": "NAMC YS-11", "operator": "All%20Nippon%20Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Osaka - Matsuyama", "msn": "2023", "yom": 1966, "flight_number": "NH533", "city": "Matsuyama", "zone": "Shikoku", "country": "Japan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 45, "pax_fatalities": 45, "other_fatalities": 0, "total_fatalities": 50, "captain_hours": 8118, "captain_hours_type": 484, "copilot_hours": 880, "copilot_hours_type": 739, "aircraft_hours": 1070, "circumstances": "Flight 533 was a scheduled domestic.flight from Osaka International Airport to Matsuyama Airport. It departed Osaka International Airport at 1913 hours, one hour and twenty-five minutes behind schedule with an ATC clearance via G-4, Kure Point, direct Matsuyama NDB at an altitude of 8 000 ft. At 1940 hours it flew over Takamatsu NDB at an altitude of 8 000 ft and reported to Takamatsu Tower an estimated time over Kure Point of 2001 hours. At approximately 2000 hours the crew established communications with Iwakuni Approach Control and reported estimating over Kure Point at 2005 hours and over Matsuyama NDB at 2015 hours. They were twice given the meteorological information for Matsuyama Airport and were cleared to descend to 5 000 ft. At approximately 2003 hours during the descent they requested Matsuyama Tower to check operational conditions of Matsuyama NDB as they had doubts regarding its reliability. Matsuyama NDB, which had been closed af 2000 hours as scheduled, resumed operation at approximately 2010 hours. Almost at that time they requested from Iwakuni Approach Control an ATC clearance to go direct to Matsuyama from Iwakuni since they had already passed Kure Point, and reported in addition that Matsuyama NDB had returned to normal. Iwakuni Approach Control then cleared the flight to Iwakuni-NDB at an altitude of 5 000 ft, requested its estimated time over Iwakuni NDB and further instructed the flight to proceed on a magnetic bearing of 1340 after passing Iwakuni NDB. The flight passed over Iwakuni NDB at approximately 2015 hours and whilst on a magnetic bearing of 135°, it was cleared to descend to and maintain 3 000 ft to Matsuyama NDB. During its descent to 3 000 ft the flight reported to Iwakuni Approach Control its estimated time over Matsuyama NDB as 2023 hours. Shortly thereafter the flight reported that the runway was in sight and was instructed to establish contact with Matsuyama Tower, which it did at 2024:03 hours. It was then instructed to report downwind for Runway 31 and informed that the wind was 020°/10 kt, and the altimeter setting 29.80 in. Hg. This was acknowledged. At approximately 2025:44 hours, while turning on base leg, the flight reported gear down and checked and was cleared to land the wind being 010°/10 kt. This was also acknowledged. Based on the testimony of eyewitnesses and the recording of ATC communications, the final phase of the flight was reconstructed as follows: The altitude of the aircraft on final approach was slightly higher than usual and touchdown occurred approximately 460 m from the threshold of Runway 31. Immediately before touchdown on the runway the engine power had been increased. After a ground run of approximately 170 m the aircraft became airborne and the flight path was slightly to the left of the centre line as the aircraft passed the Runway 13 threshold. A few seconds later, at 2027: 30 hours the aircraft reported it was making a go-around. At approximately 2027:41 hours the flight was instructed to report turning base leg for Runway 31, and six seconds later it replied \"Roger, will report turning base Runway 31\". This was the last communication from the flight. The climb out angle was observed to be shallower than usual and on reaching a height of 230 - 330 ft a left turn was commenced. Shortly thereafter the aircraft descended and crashed into water, the flight path angle at impact being about 5°. The site of the accident was approximately 450 m NE of the point where the empennage was recovered (7 580 m on a true bearing of 1570 from Tsurushima Light Beacon). ", "probable_cause": "The reason why the aircraft lost altitude after the go-around and was led to crash into water was not determined. The aircraft, on final approach to Runway 31, touched down about 460 m beyond the runway threshold and made a go-around. It then climbed at a flight path angle somewhat shallower than normal, lost altitude after initiating a turn to the left at an altitude somewhat lower than normal, then made a shallow descent and crashed into water. At the time of impact the aircraft was in a somewhat nose-down and a left bank attitude with undercarriage and flaps fully retracted."}