{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-ii-shannon-5-killed", "date": "Nov 12, 1976 at 1722 LT", "type": "Piper PA-31 Cheyenne", "operator": "Aeroleasing", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Shannon - London - Geneva", "msn": "31-7520003", "yom": 1975, "flight_number": null, "city": "Shannon", "zone": "Munster", "country": "Ireland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 1456, "captain_hours_type": 30, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 877, "circumstances": "The twin engine airplane was completing an on-demand taxi flight from Shannon to Geneva with an intermediate stop in London, carrying four employees of the Digital Company and one pilot. The takeoff roll was initiated from runway 06 at Shannon Airport in poor weather conditions with a limited visibility due to fog. After liftoff, the airplane failed to maintain a positive vario and failed to gain sufficient height. At a speed of 160 knots, it nosed down to an angle of 5° and struck the runway surface about 1,600 metres from the runway threshold (point of departure). It bounced then struck successively a fence and a stone wall before crashing in flames in a prairie. The aircraft was totally destroyed by impact forces and a post crash fire and all five occupants have been killed. ", "probable_cause": "At the time of the accident, the runway visual range for runway 06 was 250 metres, which was considered as below the published procedures of the company and the airport which stipulated a minimum of 300 metres. No technical anomalies were found on the aircraft, its engines or instruments. The pilot took the decision to takeoff in below weather minimums and his experience was considered as insufficient with only 30 flying hours on type.  "}