{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-pacific-ocean", "date": "May 23, 2000 at 1945 LT", "type": "Beechcraft 200 Super King Air", "operator": "Calico Ventures", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Parker – Carlsbad", "msn": "BB-1524", "yom": 1996, "flight_number": null, "city": "Pacific Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1659, "captain_hours_type": 1058, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1350, "circumstances": "En route from Arizona to California, the pilot became nauseous and began to vomit. The pilot advised air traffic that he was sick and radio contact was lost. The airplane had descended from 16,500 feet msl and was on an established course to his destination and level at 10,500 feet msl being flown by the autopilot. The last thing that he recalled was approaching his destination. When the pilot regained consciousness he looked outside the airplane to determine where he was. The surface was obscured in cloud cover. On his left side was a Navy F18 fighter plane, and they briefly communicated by hand signals. The F18 pilot indicated he should turn around towards land. The accident pilot determined that he was 186 nautical miles southwest of his destination and over the ocean. He reversed his course. The pilot attempted to contact air traffic without success; another aircraft relayed the pilot's message to air traffic. The pilot declared a medical emergency and advised that because of low fuel he would not be able to return to land. Within 10 minutes the fuel onboard was exhausted and the pilot configured the airplane for the best angle of glide and ditching at sea. Subsequently, the pilot descended through low stratus and ditched the airplane in the ocean at dusk. The pilot exited the airplane with a hand held VHF radio, two flashlights, a cell phone, and a trash bag for flotation; he climbed onto the top of the fuselage to await rescue. At this time it was dark. After about 30 minutes a Navy S3B circled the downed plane until a rescue helicopter arrived and rescued him. While at the pilot's Arizona residence he sprayed for bugs and insects using the pesticide 'Dursban.' During the process he opened the spray container to replenish the pesticide and the built-up pressure sprayed the vapor into his face. He cleaned himself up and then departed for the airport and the return flight to Palomar. He had bought food to eat during the flight, and shortly thereafter, he became sick in flight. The EPA as of June 8, 2000, has banned Dursban from the commercial market. ", "probable_cause": "Physical incapacitation of the pilot from improper handling of a pesticide. "}