{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-ruidoso-2-killed", "date": "Jun 13, 2017 at 2210 LT", "type": "Beechcraft 90 King Air", "operator": "King-Industries", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Ruidoso – Abilene", "msn": "LW-283", "yom": 1978, "flight_number": null, "city": "Ruidoso-Sierra Blanca", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1073, "captain_hours_type": 25, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12621, "circumstances": "The commercial pilot had filed an instrument flight rules flight plan and was departing in dark night visual meteorological conditions on a cross-country personal flight. A witness at the departure airport stated that during takeoff, the airplane sounded and looked normal. The witness said that the airplane lifted off about halfway down runway 24, and there was \"plenty\" of runway remaining for the airplane to land. The witness lost sight of the airplane and did not see the accident because the airport hangars blocked her view. The wreckage was located about 2,400 ft southeast of the departure end of runway 24. Examination of the accident site indicated that the airplane impacted in a nose-down attitude with a left bank of about 20°. A left turn during departure was consistent with the airport's published instrument departure procedures for obstacle avoidance, which required an immediate climbing left turn while proceeding to a navigational beacon located about 7 miles east-northeast of the airport. Examination of the wreckage did not reveal any evidence of preimpact mechanical malfunctions that would have precluded normal operation. The pilot had reportedly been awake for about 15 hours and was conducting the departure about the time he normally went to sleep and, therefore, may have been fatigued about the time of the event; however, given the available evidence, it was impossible to determine the role of fatigue in this event. Although the circumstances of the accident are consistent with spatial disorientation, there was insufficient evidence to determine whether it may have played a role in the sequence of events.", "probable_cause": "The pilot's failure to maintain clearance from terrain after takeoff during dark night conditions."}