{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-231-jaipur", "date": "Jan 5, 2014 at 2110 LT", "type": "Airbus A320", "operator": "Air-India", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Imphal – Guwahati – New Delhi", "msn": "469", "yom": 1994, "flight_number": "AI890", "city": "Jaipur", "zone": "Rajasthan", "country": "India", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 173, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8322, "captain_hours_type": 5502, "copilot_hours": 2798, "copilot_hours_type": 2610, "aircraft_hours": 55705, "circumstances": "On 05.01.2014, Air India Ltd. Airbus A-320-231 aircraft was scheduled to operate flight AI-889 (Delhi – Guwahati – Imphal) and return flight, AI-890 (Imphal – Guwahati – Delhi). Air India dispatch section at Delhi, which has received the roster of flight crew for the flights, had prepared the operational and ATC flight plans by using FWz flight planning software and taking into account the weight & weather (forecast winds). Same set of flight crew and cabin crew was rostered to operate the four sectors mentioned above. The flight was under Command of an ATPL holder with another ATPL holder as First Officer (FO) and 04 Cabin Crew members. The Commander was CAT III qualified and the FO was CAT I qualified. The FWz plan was prepared for VT-ESL, but later on the aircraft was changed to VT-ESH. As per the pilot in command as both the aircraft have bogie gear type of landing gear and the performance factor is also same for these aircraft, he had accepted the FWz plan of VT-ESL. As per the manager flight dispatch on duty, only first leg i.e. Delhi Guwahati was dispatched. Required fuel figures were informed to the engineering & commercial departments. Pilots were briefed with folders which in addition to flight plans contained current NOTAMs and meteorological information. The relevant information in these documents  was highlighted for briefing to the flight crew. For the remaining sectors which were self briefing sectors flight plan and NOTAMs were given to the flight crew. As per the pre flight briefing register, both the crew members have visited the flight dispatch section for briefing and at around 10:40 hrs. IST have signed the dispatch register. The sectors Delhi – Guwahati – Imphal – Guwahati were as per schedule and were uneventful. As per the flight sector report, the transit time at Guwahati prior to Guwahati-Delhi sector was 50 minutes. The aircraft landed at Guwahati from Imphal at 11:15 hrs. UTC and 12.7 tons of fuel was uplifted. The filed alternates for the sector were Lucknow and Jaipur in that order. METARs of Delhi, Lucknow and Jaipur were provided at Guwahati. There was no specific briefing. Flight crew has taken the weather updates of destination and alternates before departure from Guwahati. Lucknow visibility at that time was 2000 meters with temperature and dew point of 18°C & 13°C respectively. The weather at Delhi (11:05 UTC) was RVR as 500 meters for runway 29, general visibility of 150 meters, with both temperature and dew point of 12°C. A speci was issued at 1130 UTC for Jaipur with winds 04 kts. visibility 3000m and haze. There was no significant clouding (NSC), temperature (T) 18°C & dew point (Dp) 13°C, QNH 1013. Pre flight walk around inspection was carried out by the crew at Guwahati and the aircraft was released by an Aircraft Maintenance Engineer which was accepted by the Pilot-in-command. There was no snag or technical problem with the aircraft. There was no component or system released under Minimum Equipment List (MEL). For its last leg, the aircraft departed Guwahati for Delhi at 1205 UTC with 173 passengers on board. The fuel requirement from Guwahati to Delhi with 179 persons on board was 12.2 tonnes. As per the commander of flight, additional 500 kgs of fuel was taken (total on board was 12.7 tonnes) considering the time of arrival in Delhi was that of traffic congestion and because of weather in Delhi. As per the Operational Flight Plan (OFP), there was 10 minutes of arrival delay at the destination. The aircraft was flown on managed speeds. Initially the flight was cleared by ATC for a lower level and was later on cleared to fly at cruising level of 340. The fuel was checked visually on the Flight Management System (FMS) and Fuel Page which was further cross checked with the OFP planned figures by the crew on way points but was not recorded on the Operational Flight Plan. As per the crew, the fuel consumed was marginally higher than planned. The time taken to reach the way points was also noted, which was almost the same as planned figures were. Enroute, there was no briefing about traffic congestion over Delhi by any of the ground stations of AAI. The crew, on reaching overhead Lucknow, has taken Lucknow weather and when the aircraft was in range of ATIS Delhi, Delhi ATIS weather was also copied. The aircraft was not equipped with Aircraft Communications Addressing and Reporting System (ACARS) but was provided with HF/VHF system. As per the flight crew no flight following was provided either by flight dispatch or the IOCC of Air India. Weather updates were not seeked by the crew from the flight dispatch nor were any updates provided by Flight dispatch to the aircraft during the flight except when crew had asked Delhi dispatch about Jaipur visibility before finally making the decision to divert to Jaipur. Flight crew did not seek any update of Delhi or Jaipur weather till the time the aircraft came in contact with Delhi ATC. While in contact with Delhi ATC, the flight was advised to join hold as Delhi visibility Runway 28 RVR had dropped to the lower end of CAT I operations at this point runway 29 was below minima. AI 890 was number 12 in sequence and continued to remain in the holding pattern for the next 20-25 minutes. During this period there was no attempt on the part of flight crew to seek Lucknow weather. Air India Flight dispatch has also not given any advice to the flight about Jaipur or Lucknow weather. The weather (visibility / RVR) reported on Runway 29 was below CAT I conditions so runway was not available for this flight at that moment as the First Officer was only Cat I qualified. As per commander of the flight, they did 03 holds each of 1.5 minutes leg and flew headings 360° and 180° before intercepting the localizer Runway 28 at 35 miles. RVR runway 28 also dropped below Cat. I minimas, therefore the crew discontinued approach and climbed to 8000 feet on runway heading before going on heading 180. As per the Commander, though the 1st planned diversion alternate was Lucknow which had visibility of 2000 m i.e. above minima, but change of diversion to Jaipur was made as after missed approach they were closer to Jaipur and they had inquired about the visibility from Dispatch for Jaipur, which was provided as 2000 m. At this stage the crew did not check complete weather of Jaipur. Minimum diversion fuel to Jaipur was 2.9 tonnes as per FWz CFP. AI-890 commenced diversion to Jaipur with ―Fuel on Board‖ of 3.1 tonnes. As per the Station Manager of Air India at Jaipur Airport, he received a call from their Executive Director, Northern Region at around 2040 hrs. IST on 05.01.2014 that due to Delhi weather, AI 890 had diverted to Jaipur. He then conveyed the same to the airport office and the concerned engineer. The aircraft came in contact with Jaipur for the first time when it was at 68 DME from Jaipur. At that time the crew came to know of the complete weather of Jaipur from ATIS as visibility of 900 m, Dew Point as 13°C, temperature as 13°C, and RVR of 1000m. At 60 miles and passing flight level 138, the crew intimated Jaipur that the aircraft is descending for flight level 100 as cleared by Delhi control, which was acknowledged by Jaipur ATC. The aircraft again informed Jaipur ATC its position at 55 miles, 50 miles and 42 miles from Jaipur which were also acknowledged by Jaipur ATC. During these contacts, weather of Jaipur was neither asked by the crew nor provided by the ATC. When the aircraft was at flight level 83, the crew asked ATC Jaipur to confirm that they can carry out ILS approach for runway 27 via 10 DME arc. While confirming the requested approach, Jaipur ATC has informed all the stations about the weather at that moment as visibility 400 m and RVR 1000 m. When the aircraft was at 30 miles from Jaipur, Jaipur ATC passed weather as visibility 400 m, RVR 1000 m and trend visibility becoming 350 m. The crew was asked to come overhead by Jaipur ATC. At 28 DME from Jaipur, the aircraft was maintaining 6000 feet and on request was cleared by Jaipur ATC to descend to 5000 feet. When the aircraft was at 25 DME, from Jaipur, ATC advised that the weather was deteriorating rapidly and visibility was 400 meters. The  crew however intimated the ATC that they were committed to land at Jaipur due fuel. As per the crew the fuel on board at that point of time was 2.6 tonnes (approx.) and approach was commenced for Jaipur with a visibility of 500 m with trend reducing. The aircraft was no. 2 in approach at Jaipur and was cleared for VORDME arc ILS approach runway 27 at 25 nm. Crew had, as per them, checked Ahmedabad distance as 291 nm, with a fuel calculation of 2.7 tonnes and as sufficient fuel was not available for Ahmedabad so did not consider diverting to Ahmedabad at that moment. Crew has also stated that Udaipur watch hours were not available with them, Jodhpur is an Air Force field with restrictions and Delhi was packed so they continued approach to Jaipur knowing that visibility / RVR was rapidly deteriorating. Due to reducing visibility, Jaipur ATC asked all the aircraft inbound for Jaipur to come over head and join JJP hold. The crew of the subject flight asked for the weather which was provided as visibility 400 m & RVR 1000 m though RVR deteriorating to 550 m. The flight from the ―Arrival Route‖ flew the VORDME arc for ILS runway 27. The ATC had transmitted the RVR as 200 m and visibility as 50 m with trend reducing. Another scheduled flight ahead of AI-890 carried out a missed approach and diverted to Ahmedabad. When the aircraft was above MDA (1480 feet AGL), ATC reported RVR 50 m and cleared the aircraft to land subject to minima. Both the flight crew maintained that they had seen the runway lights. ILS approach was performed with dual AP until 200ft RALT. After descending below MDA on auto pilot, the commander disconnected the auto pilot. Captain performed the final approach manually. The aircraft deviated to the left of the runway centre line and touched down on soft ground (in kutcha) on the LH side of the runway. During touchdown and landing roll, the visibility was zero and crew were unable to see any of the reference cues. The crew had heard rumbling sound during landing roll. As per the commander, he did the manual landing as he was not sure if he could do auto-land on a ground facility which is CAT I certified airfield in actual zero visibility. The aircraft continued to roll/ skid on the unpaved surface and during this period the left wing impacted trees causing damage to the left wing. Thereafter aircraft turned right and entered the runway finally coming to a halt on the LH side of runway. There was no fire. ATC Jaipur informed the Airport Manager of the Airline at Jaipur that their flight AI-890 had blocked the runway and also requested them to send equipments / manpower to attend the aircraft and get the aircraft removed. The Station AME of the airline alongwith the Asst Officer (Comm.), who was at the tarmac were instructed by the Station Manager to move to the aircraft. As per the AME, the visibility was almost nil and they could not move without the help of ‗Follow Me‘ Jeep. The ATC was informed to arrange the jeep to escort the personnel upto the aircraft. The AME after reaching the aircraft observed that the no. 1 main wheel of the aircraft had decapped/ damaged and the port side wing was damaged. The fuel remaining on board was 2400 kgs. The disembarkation of passengers was carried out on the runway itself and passengers were sent to the terminal building. Since the aircraft was not in a position to be either taxied or towed to the parking bay, the baggage of passengers was offloaded at the runway itself and sent to the terminal. One passenger suffered minor bruise on the knuckle of his right hand middle finger. He was attended to by the cabin crew in the aircraft and also by the doctor at the airport. Medical check-up of all the crew members including breathanalyser (BA) test was done by the medical officer, M.I. room Jaipur airport. The BA test was negative for all the crew members with a reading of 00.00. Since the aircraft was obstructing the runway, the airport was shut down for any further flight operations till the runway could be cleared. A NOTAM was issued to this effect. The aircraft was towed the next day to parking bay no.5 at terminal-1 by 1200 hrs and was later repositioned on a non-operational remote bay. ", "probable_cause": "The cause below has been given considering events as a combination of organizational factors and human error.\r\n- The flight crew made an erroneous decision of diverting & continuing to an airfield with reducing visibility.\r\n- The flight crew attempted a manual landing in below minima conditions.\r\n- Lack of operational supervision and desired ground support to flight. \r\n- Internal quality assurance not capturing the hazards which slipped through due complacency.\r\n- Lack of oversight of the flight operations."}