{"url": "https://www.baaa-acro.com/crash/crash-noorduyn-norseman-v-near-temagami-5-killed", "date": "Aug 30, 1950 at 1100 LT", "type": "Noorduyn Norseman", "operator": "Ontario-Provincial-Air-Service", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "North Bay – Temagami", "msn": "N29-2", "yom": 1945, "flight_number": null, "city": "Temagami", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off from Trout Lake, (North Bay), with pilot, engineer, four passengers, and roughly 1,200 pounds of equipment for Timagami, Ontario. A fisherman on Ingall Lake stated that he saw an aircraft fly over at roughly 1,200 feet and heard the engine cut out for a period of approximately ten seconds then pick up again. It was this man's opinion that, although the engine caught again, it did not appear to have the same power and sounded as though it was missing. A short time later, two men, located at separate points on the shore of Wilson Lake, heard an aircraft approaching and stated that the engine was sputtering and missing and that the aircraft was losing height. One of these witnesses stated that just before the aircraft went out of sight, it banked steeply to the right and then went into a spin. A fourth man in his cabin at Milne Lake, heard an engine roar very loudly and then fade out three times. The sound seemed to be quite close and he stepped out the door just in time to see the aircraft hit the ground thirty feet away. Fire broke out immediately and in a matter of seconds, the aircraft was a mass of flame. The pilot, air engineer, and three passengers were fatally injured while a fourth passenger was injured. The aircraft was destroyed. The condition of the propeller indicated that very little power was being developed at the time of impact. The carburetor had been damaged by fire, and the fuel filters could not be found. There was still fuel in the tanks even after the fire. The aircraft landed in a small clearing surrounded by trees and cottages, and did  not move more than three feet from the point of initial contact. Weather was not considered to have been a contributing factor. The aircraft was overloaded by an estimated 173 pounds at the time of the accident. The pilot transmitted the distress signal 'mayday' but no details of the emergency were given. Between the point where the engine was first reported to have been malfunctioning and the location of the accident, the aircraft passed over two lakes which could have provided adequate space for a successful forced landing. ", "probable_cause": "The immediate cause of the accident would appear to be that the engine failed to supply sufficient power to maintain height. The major contributing factor would appear to be poor judgment on the part of the pilot in continuing the flight beyond two lakes where a forced landing could have been made, after it became evident that the engine was not operating in a normal manner. "}