{"url": "https://www.baaa-acro.com/crash/crash-rockwell-sabreliner-75-near-florence-2-killed", "date": "Jul 18, 1998 at 1622 LT", "type": "Rockwell Sabreliner 75", "operator": "Executive Aircraft Group", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Newton - Wichita", "msn": "380-69", "yom": 1979, "flight_number": null, "city": "Florence", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 10000, "captain_hours_type": null, "copilot_hours": 478, "copilot_hours_type": 14, "aircraft_hours": 5484, "circumstances": "The pilot dropped off a passenger at Newton Airport before continuing the flight. The passenger, who was a contract pilot for the company, reported there had been no indications of any problem with the airplane. The pilot conducted a low pass followed by a steep climb to 10,000 feet when he departed Newton. Seven minutes later in the flight, the cockpit voice recorder revealed the pilot stating, 'You're going to pitch up now and take it all the way around here.' The pilot said, 'Pitch up, twenty degrees up.' After the pilot called for the nose to be pitched up, he did not make any statements for about 27 seconds. Then the pilot stated, 'Oh, Jim.' Eight seconds later the airplane impacted the ground. Radar data indicated that airplane's altitude about the time the nose was pitched up was 15,900 feet msl, and it impacted the ground about 37 seconds later. All flight control surfaces were found at the impact site. No maneuver in the pilot's manual or the FAA's Commercial test guide required the nose to be pitched up 20 degrees while maintaining 250 knots. The aircraft was certified as a Transport Category aircraft and was not certified for aerobatic flight. ", "probable_cause": "The pilot's overconfidence in his personal ability, his improper in-flight decision to attempt aerobatics, and his loss of control of the airplane. "}