{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-33cf-saltillo", "date": "Jan 18, 2014 at 0423 LT", "type": "Douglas DC-9", "operator": "Aeronaves-TSM", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Managua – Tapachula – Saltillo", "msn": "47191/280", "yom": 1968, "flight_number": null, "city": "Saltillo", "zone": "Coahuila", "country": "Mexico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13447, "captain_hours_type": 9235, "copilot_hours": 10736, "copilot_hours_type": 525, "aircraft_hours": 57319, "circumstances": "The aircraft departed Managua on a cargo flight to Saltillo with an intermediate stop in Tapachula, carrying two passengers and two pilots on behalf of DHL. During a night approach to Saltillo Airport, the crew was cleared to land on runway 17. One minute later, he initiated a go-around and decided to divert to Monterrey Airport which was the alternate. Due to a poor flight preparation, the crew was unaware that Monterrey Airport was closed to traffic that night. So few minutes later, the crew returned to Saltillo and was again cleared to land on runway 17. At that time, weather conditions were marginal with a limited visibility due to fog. Following an ILS CAT I approach, the pilot-in-command descended below the MDA and continued the approach despite he did not establish any visual contact with the runway and its equipment. The aircraft landed hard to the right of the runway and on the last third of the runway. After landing, the aircraft rolled for few dozen metres, lost its nose gear and came to rest against an embankment. All four occupants were injured and the aircraft was damaged beyond repair. ", "probable_cause": "Continuing the precision approach (ILS CAT 1) in conditions of reduced visibility by fog (no visual contact with the runway at an airport below minimums), which resulted in an abrupt landing and misaligned to the right on the last third of the runway, during a second landing attempt. The continuation of the landing was the lack of fuel to fly to a second alternate airport not contemplated in the operation.\r\nContributing factors:\r\n1. Lack of analysis of pre-flight operational information (current NOTAMs, METAR, forecasts, fuel to second alternate airport and flight tracking).\r\n2. Unstabilized approach.\r\n3. Lack of application of CRM concepts.\r\n4. Lack of adherence to procedure - operations, of providing METAR and NOTAM to the crew for the dispatch of the aircraft.\r\n5. Lack of adherence to the procedure for flight control and tracking.\r\n6. Lack of procedures to establish two alternate airports when the destination airport is below minimums.\r\n7. Lack of Company supervision, operation and maintenance surveillance of aircraft flight recorders."}