{"url": "https://www.baaa-acro.com/crash/crash-pilatus-uv-20a-turbo-porter-marana-1-killed", "date": "Mar 15, 2002 at 1000 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "US-Army", "flight_phase": "Flight", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Marana - Marana", "msn": "802", "yom": 1979, "flight_number": null, "city": "Marana-Regional", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6187, "captain_hours_type": 31, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6267, "circumstances": "A US Army Pilatus UV-20A collided in midair with a Cessna 182C during parachute jumping operations. The collision occurred about 4,800 feet mean sea level (msl) (2,800 feet above ground level (agl)) on the northeast side of runway 12 abeam the approach end. Both aircraft had made multiple flights taking jumpers aloft prior to the accident. The Pilatus departed runway 12 about 5 minutes prior to the Cessna's departure on the same runway. The drop zone was on the airport west of the intersections of runways 12 and 03. The Pilatus departed to the south and began a climb to the jump altitude of 5,500 feet msl, which was 3,500 feet agl. The pilot began the jump run on the southwest side of the runway paralleling it on a heading of about 300 degrees and when he was 1 to 2 minutes from the drop zone broadcast the intent to drop jumpers. The first jumper stated that it normally took him between 1 minute and 1 minute 15 seconds to reach the ground. As he neared the ground he observed everyone running toward the crash site. The Cessna pilot had four jumpers on board and said that his usual practice is to plan his climb so that the jump altitude (5,000 to 5,500 feet msl) is reached about the same time that the aircraft arrives over the jump zone. He departed runway 12 and made a wide sweeping right turn around the airport to set up for the jump. As the Pilatus neared the jump zone the Cessna was greater than 1,000 feet lower and west of the Pilatus climbing on a northerly heading. The Cessna pilot planned to make a right turn to parallel the left side of runway 12, and then turn right toward the drop zone. The jumpers in the Cessna looked out of the right side, and watched the Golden Knights exit their airplane. The jumpers said that their altimeters read 2,500 feet agl. The Cessna pilot turned to a heading of 120 degrees along the left side of the approach end of runway 12. He heard the Pilatus pilot say on Common Traffic Advisory Frequency that the Pilatus was downwind for runway 12. Based on witness observations, at this point the Pilatus was in a descending turn heading generally opposite to the downwind heading on the northeast side of the runway. Everyone in the Cessna heard a loud bang, the Cessna pilot felt something hit him in the head, and the airplane pitched down and lost several hundred feet of altitude. He noticed a blur of yellow and white out of his left window. The lead jumper decided that they should exit, and they all jumped. The Cessna pilot decided that the airplane was controllable, and landed safely. Both civilian and military witnesses on the ground heard the Pilatus pilot call downwind for runway 12. About 10 seconds later they heard intense transmissions over the loud speaker, and looked up  and observed the Pilatus in a nearly vertical, nose down slow spiral. There was an open gash in the top of the Cessna's cabin on the left side near the wing root. The green lens and its gold attachment fitting from the Pilatus were on the floor behind the pilot's seat.", "probable_cause": "The failure of both pilots to maintain an adequate visual lookout. The failure of the Pilatus pilot to report his proper position was a factor."}