{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-lyall-haarbour-6-killed", "date": "Nov 28, 2009 at 1603 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Seair%20Seaplanes", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Vancouver - Mayne Island - Pender Island - Lyall Harbour - Vancouver", "msn": "1171", "yom": 1958, "flight_number": null, "city": "Lyall Harbour (Saturna Island)", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 2800, "captain_hours_type": 2350, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Seair Seaplanes Beaver was departing Lyall Harbour, Saturna Island, for the water aerodrome at the Vancouver International Airport, British Columbia. After an unsuccessful attempt at taking off downwind, the pilot took off into the wind towards Lyall Harbour. At approximately 1603 Pacific Standard Time, the aircraft became airborne, but remained below the surrounding terrain. The aircraft turned left, then descended and collided with the water. Persons nearby responded immediately; however, by the time they arrived at the aircraft, the cabin was below the surface of the water. There were 8 persons on board; the pilot and an adult passenger survived and suffered serious injuries. No signal from the emergency locator transmitter was heard.", "probable_cause": "Findings as to Causes and Contributing Factors: \r\n1. The combined effects of the atmospheric conditions and bank angle increased the load factor, causing an aerodynamic stall.  \r\n2. Due to the absence of a functioning stall warning system, in addition to the benign stalling characteristics of the Beaver, the pilot was not warned of the impending stall. \r\n3. Because the aircraft was loaded in a manner that exceeded the aft CG limit, full stall recovery was compromised.  \r\n4. The altitude from which recovery was attempted was insufficient to arrest descent, causing the aircraft to strike the water. \r\n5. Impact damage jammed 2 of the 4 doors, restricting egress from the sinking aircraft.  \r\n6. The pilot’s seat failed and he was unrestrained, contributing to the seriousness of his injuries and limiting his ability to assist passengers. \r\nFindings as to Risk:\r\n1. There is a risk that pilots will inadvertently stall aircraft if the stall warning system is unserviceable or if the audio warnings have been modified to reduce noise levels.\r\n2. Pilots who do not undergo underwater egress training are at greater risk of not escaping submerged aircraft.\r\n3. The lack of alternate emergency exits, such as jettisonable windows, increases the risk that passengers and pilots will be unable to escape a submerged aircraft due to structural damage to primary exits following an impact with the water.\r\n4. If passengers are not provided with explicit safety briefings on how to egress the aircraft when submerged, there is increased risk that they will be unable to escape following an impact with the water.\r\n5. Passengers and pilots not wearing some type of flotation device prior to an impact with the water are at increased risk of drowning once they have escaped the aircraft. "}