{"url": "https://www.baaa-acro.com/crash/crash-atr42-312-near-kosovska-mitrovica-24-killed", "date": "Nov 12, 1999 at 1115 LT", "type": "ATR42-300", "operator": "SiFly.gif", "flight_phase": "Flight", "flight_type": "Humanitarian", "survivors": "No", "site": "Mountains", "schedule": "Rome - Pristina", "msn": "12", "yom": 1986, "flight_number": "KSV3275", "city": "Kosovska Mitrovica", "zone": "All Kosovo", "country": "Kosovo", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 21, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": 18000, "captain_hours_type": 5000, "copilot_hours": 5000, "copilot_hours_type": 1500, "aircraft_hours": 24930, "circumstances": "Arriving from Rome, the aircraft chartered by the World Food Program was going to land at Pristina. The meteorological conditions at the aerodrome corresponded to visibility of 4,000 metres with a layer of compact clouds at 3,000 feet. In radar and radio contact with the military air traffic control organisation for an ILS approach, the aircraft, which was outbound to the north at an altitude of 4,600 feet, entered a sector where the minimum safety altitude is 6,900 feet and struck a mountain whose peak is at 4,650 while turning to return towards the airport. The wreckage was found about 15 metres below the summit, some 18 km northeast of Kosovska Mitrovica and 42 km north of Pristina Airport. All 24 occupants were killed.", "probable_cause": "The collision of Flight KSV 3275 with high ground was due to:\r\n- Teamwork which lacked procedural discipline and vigilance during maneuvers in a mountainous region with poor visibility,\r\n- The aircraft being kept on its track and then forgotten by a military controller unused to the mountainous environment of the aerodrome and to preventing the risk of collisions with high ground, within the framework of the radar service he was providing,\r\n- The operator's critical situation as a new company highly dependant on the lease contract, favoring a failure to respect procedures,\r\n- The opening of the aerodrome to civil traffic without an advance evaluation of the operating conditions or of the conditions for distribution of aeronautical information.\r\nThe following factors contributed to the accident :\r\n- Crew fatigue, favoring a lowering of vigilance,\r\n- Undertaking the flight with an unserviceable or disconnected GPWS."}