{"url": "https://www.baaa-acro.com/crash/crash-douglas-b-18a-bolo-kodiak-7-killed", "date": "Apr 29, 1942 at 0900 LT", "type": "Douglas B-18 Bolo", "operator": "USAAF", "flight_phase": "Takeoff (climb)", "flight_type": "Aerial photography", "survivors": "Yes", "site": "Mountains", "schedule": "Kodiak – Cold Bay – Umnak", "msn": "2522", "yom": 1939, "flight_number": null, "city": "Kodiak", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 5, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 1009, "captain_hours_type": 491, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1833, "circumstances": "Crew left Kodiak NAS around 0800LT on a photography mission to Umnak via Cold Bay. Shortly after take off, pilot decided to return to his base for not having the \"proper clearance\". On ground, pilot complained about the overload of gas and equipment and left again thirty minutes later. While climbing over the Anton Larsen Bay, aircraft was too low and impacted the Sheratin Mountain, about 150 feet below the summit. Seven crew were killed while one was seriously injured. ", "probable_cause": " The pilot had made a previous take-off and was forced to return due to the fact that he did not have a proper clearance. Before his next take-off he had complained of how heavily loaded his ship was due to having an extra tank of gas, which he did not need, plus all the equipment aboard. The pilot showed an error in judgment in attempting to climb out the ridge without sufficient altitude for a safe clearance a very heavy ship and in very turbulent air, when it would have been to avoid the ridge by going around it. While passing over the ridge at about 150 feet the ship was caught in a severe down draft, and in spite of all that the pilot could do the ship struck the ridge at about 150 feet below the summit. There was no engine failure. With southwest winds, take-off(s) from Kodiak NAS are towards inshore hills. Two alternatives are open to pilots after take-off: either turn sharply over the lower hills nearest the airdrome and return over field to shore line, or continue climb turning northwest to go through the pass in that direction. Either alternative with a heavily loaded B-18 in gusty air is uncomfortable, and it is quite likely that the pilot was attempting to attain relatively smoother air west of the mountain and on course as soon as possible. Considering all factors, the undersigned concludes that a more correct analysis of causes would be as follows: Weather 50%; Airport or terrain 20%; Pilot error of judgment 30%.      "}