{"url": "https://www.baaa-acro.com/crash/crash-atr42-300-sao-paulo", "date": "Jul 16, 2007 at 1242 LT", "type": "ATR42-300", "operator": "Pantanal%20Linhas%20Aereas.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Araçatuba – Bauru – São Paulo", "msn": "225", "yom": 1991, "flight_number": "PTN4763", "city": "São Paulo-Congonhas", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 21, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7420, "captain_hours_type": 4993, "copilot_hours": 947, "copilot_hours_type": 797, "aircraft_hours": null, "circumstances": "The aircraft departed Araçatuba on a flight to São Paulo with an intermediate stop in Bauru, carrying 21 passengers and a crew of four. After touchdown on wet runway 17R at Congonhas Airport, the crew started the braking procedure when the aircraft deviated to the left and veered off runway. While contacting soft ground, the aircraft collided with a concrete block housing the electrical device supplying the runway light system. On impact, the nose gear was torn off and the aircraft came to rest. All 25 occupants evacuated safely while the aircraft was damaged beyond repair. ", "probable_cause": "Loss of control upon landing after the aircraft suffered aquaplaning. The following contributing factors were identified:\r\n- A light rain caused the presence of water on the runway, enabling the occurrence of hydroplaning.\r\n- The accumulation of water on the surface of the runway, as a result of inadequate drainage, lack of \"grooving\", enabled the hydroplaning.\r\n- The pilot applied full pressure on the right pedal, generating a force to the left that contributed to the departure off the runway.\r\n- During hydroplaning, the pilot should not apply pedal to the opposite side to which the aircraft slides; this fact was not covered during the instruction of the pilot.\r\n- In the face of hydroplaning, the pilot applied the right pedal, aggravating the departure of the aircraft to the left."}