{"url": "https://www.baaa-acro.com/crash/crash-cessna-411-lees-summit", "date": "Apr 30, 2002 at 0600 LT", "type": "Cessna 411", "operator": "Martin Junge", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lee's Summit - Harrisonville", "msn": "411-0097", "yom": 1965, "flight_number": null, "city": "Lee's Summit", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane impacted the terrain following a loss of control during a takeoff initial climb. A witness stated the airplane was noisier than what he is used to hearing. This witness reported the airplane was in a steep left bank in a level pitch attitude. The airplane then began to descent rapidly as it turned to a northerly heading. The witness reported the airplane then seemed to enter a right bank prior to impacting the ground. Another witness reported what sounded like an engine backfire. The pilot reported the airplane lost power. Torsional twisting was visible on the propeller blades following the accident. Following the accident, the undamaged emergency exit from the airplane was found next to the runway. The latching mechanism on the exit was not damaged and the pins were not found with the exit. It was reported that the airplane had sat on the ramp at the departure airport for at least 15 years without being flown. Although the registration for the airplane had not been changed, the pilot reportedly purchased it shortly before the accident. The pilot did not hold a multi-engine rating.", "probable_cause": "The pilot failed to maintain control of the airplane during the initial takeoff climb. Factors associated with the accident were the pilot's inadequate preflight of the airplane, the separation of the emergency exit, and the pilot's lack of a multi-engine rating."}