{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-44-widgeon-catskill-1-killed", "date": "May 2, 2013 at 1629 LT", "type": "Grumman G-44 Widgeon", "operator": "Michael B. Braunstein", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Copake - Copake", "msn": "1315", "yom": 1943, "flight_number": null, "city": "Catskill", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5735, "captain_hours_type": 411, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2251, "circumstances": "Michael B. Braunstein, aged 72, was the owner of this vintage aircraft built in 1943 and was performing a local flight within the State of New York. Aircraft was destroyed when it impacted the waters of the Hudson River, near Catskill, New York. The certificated airline transport pilot was fatally injured. Visual meteorological conditions prevailed, and no flight plan had been filed for the local personal flight conducted under Title 14 Code of Federal Regulations Part 91, which departed from B Flat Farm Airport (3NK8), Copake, New York about 1600. Approximately 25 witnesses were interviewed. Witnesses reported observing the twin-engine amphibious airplane flying southbound low above a river and hearing the engine running. The airplane then made a 180-degree left turn, which was consistent with the pilot flying a tight traffic pattern before attempting a water landing. The airplane then descended, leveled off above the water, and suddenly banked left. The airplane’s nose and left pontoon then struck the water, and the airplane nosed over, caught fire, and sank. Postrecovery examination of the wreckage revealed that the landing gear was in the “up” position and that the flaps were extended, which indicates that the airplane had been configured for a water landing. No evidence of any preimpact failures or malfunctions of the airplane or engines was found that would have precluded normal operation. At the time of the accident, a light breeze was blowing, the river was at slack tide, and the water conditions were calm, all of which were conducive to glassy water conditions. It is likely that the glassy water conditions adversely affected the pilot’s depth perception and led to his inability to correctly judge the airplane’s height above the water. He subsequently flared the airplane too high, which resulted in the airplane exceeding its critical angle-of-attack, entering an aerodynamic stall, and impacting the water in a nose-low attitude.", "probable_cause": "The pilot’s misjudgment of the airplane’s altitude above the water and early flare for a landing on water with a glassy condition, which led to the airplane exceeding its critical angle-of-attack and experiencing an aerodynamic stall."}