{"url": "https://www.baaa-acro.com/crash/crash-pacific-aerospace-fu-24-stallion-upper-turon-1-killed", "date": "Jun 16, 2017 at 1049 LT", "type": "Fletcher FU-24", "operator": "Airspread Aviation", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Upper Turon - Upper Turon", "msn": "3002", "yom": 1980, "flight_number": null, "city": "Upper Turon", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4688, "captain_hours_type": 786, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11059, "circumstances": "On 16 June 2017, a Pacific Aerospace Ltd FU24 Stallion, registered VH-EUO (EUO), was conducting aerial agricultural operations from a private airstrip at Redhill, 36 km north-north-east of Bathurst, New South Wales (NSW). The operations planned for that day involved the aerial application of fertiliser on three properties in the Upper Turon area of NSW. At about 0700 Eastern Standard Time on the morning of the accident, the pilot and loader drove to Bathurst Airport to fill the fuel tanker and then continued to the worksite at the Redhill airstrip in the Upper Turon area, arriving at about 0830. Work on the first property started at about 0900, with the first flight of the day commencing at 0920. Work on the first property continued until 1350 with two refuelling stops at 1048 and 1250. Approximately 40 tonnes of fertiliser was applied on the first job. In preparation for the second job, fertiliser and seed were loaded into the aircraft and maps of the second job area were passed to the pilot. At 1357, the aircraft took off for the first flight of the second job. The aircraft returned to reload, and at 1405 the aircraft took off for the second flight. A short time later, at 14:06:59, recorded flight data from the aircraft ceased. When the aircraft did not return as expected, the loader radioed the pilot. When the loader could not raise the pilot on the radio, he became concerned and drove his vehicle down the airstrip to see if the aircraft had experienced a problem on the initial climb. Finding no sign of the aircraft, he returned to the load site, while continuing to call the pilot on the radio. He then drove to the application area to search for the aircraft before returning to the load site. With no sign of the aircraft, the loader called emergency services to raise the alarm. By about 1500, police had arrived on site and a ground search commenced. A police helicopter also joined the search, which was eventually called off due to low light. The next morning, at about 0630, the search recommenced and included NSW Police State Emergency Service personnel, and local volunteers. At about 0757, the wreckage of the aircraft was found in dense bush on the side of a hill to the east of the application area. The pilot was found deceased in the aircraft. The aircraft was found approximately 17 hours after the last recorded flight data and there were no witnesses to the accident. ", "probable_cause": "From the evidence available, the following findings are made with respect to the collision with terrain involving a FU24 Stallion, VH-EUO 40 km north-east of Bathurst, New South Wales on 16 June 2017. These findings should not be read as apportioning blame or liability to any particular organisation or individual.\r\nContributing factors:\r\n- The pilot flew the aircraft into an area of rising terrain that was outside the normal operating area for this job site.\r\n- For reasons that could not be determined, the aircraft aerodynamically stalled and collided with terrain during re-positioning at the end of the application run.\r\nOther findings:\r\n- There was no evidence of any defect with the aircraft that would have contributed to the loss of control."}