{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-580-la-grande-4", "date": "Sep 27, 2000 at 1038 LT", "type": "Convair CV-580", "operator": "Hydro%20Quebec", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Montreal – Rouyn – La Grande-3 (LG-3) – La Grande-4 (LG-4) – Montreal", "msn": "109", "yom": 1953, "flight_number": "APZ180", "city": "La Grande-4", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 18, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15500, "captain_hours_type": 6000, "copilot_hours": 11000, "copilot_hours_type": 4000, "aircraft_hours": 78438, "circumstances": "The Hydro-Québec Convair 340 (580), registration C-GFHH, serial number 109, with 18 passengers and 4 crew members on board, made an instrument flight rules flight from La Grande 3 to La Grande 4, Quebec. The aircraft touched down on the snow-covered runway at La Grande 4 approximately 800 feet beyond the runway threshold. Shortly after the nose wheel touched down and the pilot set the propellers to reverse pitch, the aircraft drifted to the right. Despite the attempts of the pilot flying (the captain) to correct, the aircraft continued its course and exited the south side of Runway 09 at approximately 50 knots. The aircraft travelled 350 feet over soft, rocky ground and came to rest about 120 feet outside the runway edge, about 2500 feet from the runway threshold. The flight crew followed the procedure to shut down the engines, but the left engine would not stop. On the captain's order, the first officer went into the passenger cabin and ordered an evacuation. All passengers exited the aircraft via the window emergency exits over the right wing. The left engine eventually shut down on its own after about 15 minutes. Five persons sustained minor injuries. The aircraft sustained substantial damage but did not catch fire.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The steering control valve lever was not reassembled in accordance with the specifications and the drawings in the overhaul manual and the maintenance manual: the lever was assembled with two washers instead of one, and the circumference of the bushing was 0.0005 inch greater than the circumference of the hole in the lever. These two deficiencies created additional resistance that\r\nimpeded the pivoting of the aircraft steering wheel. \r\n2. The nylon locknuts were reinstalled during the repair of the steering control valve, contrary to the recommendation that they be used only once. The locknuts then came loose in service, creating play in the parts of the valve.\r\n3. Incorrect interpretation of the problem and the influence of previous experience using the nose-gear steering wheel led the crew to make the flight despite their concern about the aircraft's nose-gear steering system.\r\nFindings as to Risk:\r\n1. The maintenance personnel of Precision Aero Components Inc. used the (incomplete) maintenance manual instead of the overhaul manual to overhaul and repair the steering control valve,\r\ncontributing to the incorrect reassembly of the valve.\r\n2. The steering control valve lever was not fitted with a grease fitting, and the outside of the bushing was not grooved to allow adequate lubrication, thereby risking corrosion and seizure of the bushing inside the lever.\r\n3. The limited experience and the lack of formal training of the maintenance personnel concerning the repair and the overhaul on the steering control valve might have contributed to the incorrect\r\nreassembly of the steering control valve.\r\n4. The pilot flying cut the electrical power, as required by the hard landing procedure. The left engine could therefore not be shut down, causing a risk of injury when the passengers evacuated.\r\n5. The pilot flying cut the electrical power after the aircraft exited the runway, as required by the hard landing procedure. The electrical power required to operate the public address and alarm systems was thereby lost, and the evacuation could not be ordered promptly.\r\n6. The evacuation slide automatic deployment system was inadvertently deactivated, which could have delayed the evacuation and compromised passenger safety.\r\n7. After separating from the engine, the left propeller blades entered the fuselage and damaged an unoccupied seat.\r\nOther Findings:\r\n1. The numerous changes in ownership of the Convair type certificate and the lack of technical support from the current holder caused maintenance problems for Convair operators and approved\r\nmaintenance organizations (AMOs), particularly for recently established AMOs."}