{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-goiania-6-killed", "date": "Jan 14, 2011 at 1810 LT", "type": "Beechcraft 200 Super King Air", "operator": "Construtora Meio Norte", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Mountains", "schedule": "Brasília – Goiânia", "msn": "BB-806", "yom": 1981, "flight_number": null, "city": "Goiânia", "zone": "Goiás", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 2500, "captain_hours_type": 550, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Brasília, the pilot started the descent to Goiânia-Santa Genoveva Airport in poor weather visibility with heavy rain falls and turbulences. On final approach, the twin engine aircraft descended below the glide until it impact the slope of Mt Santo Antônio located 10,7 km short of runway 32. The aircraft was destroyed by impact forces and a post crash fire and all six occupants were killed. ", "probable_cause": "The following findings were identified: \r\n- Factors, such as obesity and sedentariness, associated with the high workload in the moments preceding the collision with the hill, may have contributed for the task demand to exceed the margins of safety, resulting in wrong decision-making by the pilot.\r\n- Upon facing adverse meteorological conditions and being aware that aircraft which landed before him had reached better visibility in altitudes below 3,500 ft. on the final approach of the VOR procedure, the pilot may have increased his level of confidence in the situation, to the point of descending even further, without considering the risks involved.\r\n- The weather conditions encountered in the final phase of the flight may have aggravated the level of tension in the aircraft cabin to the point of compromising the management of the situation by the pilot, who delegated responsibility for radiotelephony communication to a passenger.\r\n- If one considers that the pilot may have decided to descend below the minimum safe altitude in order to achieve visual conditions, one may suppose that his decision, probably influenced by the experience of the preceding aircraft, was made without adequate evaluation of the risks involved, and without considering the option of flying IFR, in face of the local meteorological conditions. In addition, the pilot’s decision-making process may have been compromised by lack of information on Mount Santo Antonio in the approach chart.\r\n- The primary radar images obtained by Anápolis Control (APP-AN) indicated the presence of thick nebulosity associated with heavy cloud build-ups on the final approach of the VOR procedure. Such meteorological conditions influenced the occurrence, which culminated in the collision of the aircraft with Mount Santo Antônio, independently of the hypotheses raised during the investigation.\r\n- The final approach on the course 320º, instead of 325º, made the aircraft align with the hill with which it collided.\r\n- Mount Santo Antonio, a control obstacle on the final approach in which the collision occurred, was not depicted in the runway 32 VOR procedure approach chart, in discordance with the prescriptions of the CIRTRAF 100-30, a fact that may have contributed to a possible decrease of the situational awareness."}