{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-monterey-3-killed", "date": "Jun 24, 1992 at 1030 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Judith Rea Enterprises", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Monterey - Tucson", "msn": "421B-0028", "yom": 1970, "flight_number": null, "city": "Monterey", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 75, "captain_hours_type": 10, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The 3 occupants aboard were: the owner in the left front seat, his wife in the right front seat, and a man hired by the owner to fly the airplane (seat location could not be determined). Prior to takeoff a man telephoned FSS for a weather briefing and to file an IFR flight plan. He told FSS the pilot's name was J. Hamlett; a J. Hamlett was not aboard (it was found later that Hamlett was the maiden name of the wife of the man hired to fly the airplane). Two minutes after takeoff the pilot was told to contact departure; the pilot acknowledged. This was the last recorded radio contact. The airplane collided with a hill obscured by ground fog about 3 miles east of the airport. The man hired to fly the airplane did not possess an airman certificate; his certificate was revoked 2 years prior to the accident. The owner had obtained his private certificate for airplane single-engine land about 1 month prior to the accident, and had not received any multi-engine instruction. All three occupants were killed. ", "probable_cause": "The owner/pilot's poor judgement in attempting an operation beyond his experience and ability, which resulted in his failure to attain an adequate climb profile necessary for terrain clearance. Also, the owner/pilot lacked instrument experience, and was overconfident in his ability. Factors in the accident were: the hilly terrain and weather conditions.  "}