{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-331-rome-49-killed", "date": "Nov 23, 1964 at 1409 LT", "type": "Boeing 707", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kansas City – Chicago – New York – Paris – Milan – Rome – Athens – Cairo", "msn": "17685/123", "yom": 1960, "flight_number": "TW800", "city": "Rome-Fiumicino-Leonardo da Vinci", "zone": "Lazio", "country": "Italy", "region": "Europe", "crew_on_board": 11, "crew_fatalities": 5, "pax_on_board": 62, "pax_fatalities": 44, "other_fatalities": 0, "total_fatalities": 49, "captain_hours": 17408, "captain_hours_type": 2617, "copilot_hours": 17419, "copilot_hours_type": 1269, "aircraft_hours": null, "circumstances": "Flight 800 was a scheduled international flight from Rome, Italy to Athens, Greece. It departed the parking area at 1300 hours GMT with the copilot at the controls and the take-off run on runway 25 started at 1307 hours. The aircraft bad reached a speed above 80 kt when the pilot-in-command noticed that the No. 4 engine pressure ratio gauge was reading 1 (zero thrust) and, immediately thereafter, the amber light indicating thrust reversal of No. 2 engine came on. Since the speed was still below V1 for the weights and runway conditions, he decided to abort take-off and took over the controls to carry out the required manoeuvre. The tower was advised of this decision when the aircraft had reached a point 800 to 900 m after the threshold. The aircraft started to decelerate but at a much slower rate than expected, and at the same time veered strongly to the right with the result that the right landing gear was grazing the runway edge. Reverse thrust on the two right engines was reduced in an attempt to bring the aircraft back to the centre Line. The aircraft continued travelling beyond the declared runway limit and struck with No. 4 engine a pavement roller which was being used for maintenance work on taxiway 16/34 in an authorized area. After travelling a further 260 m, the aircraft came to a stop with fire on board. After a series of explosions, it was engulfed in flames and completely destroyed. The accident occurred at 1309 hours GMT. Five crew members and 44 passengers were killed, 24 others occupants were injured, some of them seriously. ", "probable_cause": "Damage to the reverse thrust system of No. 2 engine, not discernible by means of cockpit instruments, and consisting in the disconnection of a duct with resulting lack of pressure in the pneumatic clamshell door actuating mechanism. This malfunction allowed the development of considerable forward thrust by No. 2 engine even though the four levers were in the 'reverse' position. Rupture of fuel feed tube to No. 4 engine by impact with a power roller, and resulting ignition of spilled fuel. Failure of surge tank drainage because of a blocked valve, forcing the fuel out through the vent scoop and permitting access of fire to the wing. Presence of fuel-air vapor, formed in the tanks in explosive proportions, which caused the explosions when ignited. "}