{"url": "https://www.baaa-acro.com/crash/crash-bae-3101-jetstream-31-hibbing-18-killed", "date": "Dec 1, 1993 at 1950 LT", "type": "BAe Jetstream 31", "operator": "Northwest%20Airlink", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Minneapolis - Hibbing", "msn": "706", "yom": 1986, "flight_number": "NW5719", "city": "Hibbing-Range (Chisholm)", "zone": "Minnesota", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 16, "pax_fatalities": 16, "other_fatalities": 0, "total_fatalities": 18, "captain_hours": 7852, "captain_hours_type": 2266, "copilot_hours": 2019, "copilot_hours_type": 65, "aircraft_hours": 17156, "circumstances": "While on a localizer back course approach the airplane collided with trees and the terrain approximately 3 miles from the runway threshold. The captain delayed the start of the descent that subsequently required an excessive descent rate to reach the FAF and MDH. The captain's actions led to distractions during critical phases of the approach. The flightcrew lost altitude awareness and allowed the airplane to descend below mandatory level off points. The captain's record raised questions about his airmanship and behavior that suggested a lack of crew coordination during flight operations, including intimidation of first officers. Company management did not address these matters adequately. The airline's flight operations management failed to implement provisions to adequately oversee the training of their flight crews and the operation of their aircraft. FAA guidance to their  inspectors concerning implementation of ops bulletins is inadequate and has failed to transmit valuable safety information as intended to airlines. The aircraft was totally destroyed and all 18 occupants were killed. ", "probable_cause": "The captain's actions that led to a breakdown in crew coordination and the loss of altitude awareness by the flight crew during an unstabilized approach in night instrument meteorological conditions. Contributing to the accident were: the failure of the company management to adequately address the previously identified deficiencies in airmanship and crew resource management of the captain; the failure of the company to identify and correct a widespread, unapproved practice during instrument approach procedures; and the Federal Aviation Administration's inadequate surveillance and oversight of the air carrier."}