{"url": "https://www.baaa-acro.com/crash/crash-antonov-26-near-zolochiv-15-killed", "date": "May 3, 1985 at 1213 LT", "type": "Antonov AN-26", "operator": "Soviet%20Union%20Air%20Force.gif", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Plain, Valley", "schedule": "Lviv - Moscow", "msn": "9506", "yom": 1980, "flight_number": "CCCP-26492", "city": "Zolochiv", "zone": "Lviv Oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1756, "circumstances": "The Antonov AN-26 departed Lviv-Sknyliv Airport at 1202LT and was climbing to 3,900 meters. En route to Moscow, it was carrying 15 people, most of them officers from the Carpathian Military contingent. While cruising in clouds at an altitude of 3,900 meters, the AN-26 collided with an Aeroflot Tupolev TU-134 registered CCCP-65856 that was descending to Lviv Airport on a flight from Tallinn with 79 people on board. Following the collision, both aircraft entered a dive and crashed in an open field located near the city of Zolochiv, about 60 km east of Lviv. Both aircraft were totally destroyed and all 94 occupants were killed. ", "probable_cause": "It was determined that the accident was the consequence of a poor radar coverage by ATC who failed to properly coordinate control and assistance to both planes. ATC in charge of the sector where the collision occurred cleared the crew of the TU-134 to continue to descend when he actually had no idea of the exact position of both planes. This caused the Tupolev to descend too low and to cut the Antonov trajectory. The supervisor in charge of the sector was also blamed insofar he failed to pay sufficient attention to the operations and was unable to identify in time a possible conflict and thus, was unable to initiate any corrective action and to assist his colleague."}