{"url": "https://www.baaa-acro.com/crash/crash-douglas-dakota-iii-tunis-6-killed", "date": "Jul 11, 1943 at 2208 LT", "type": "Douglas DC-3", "operator": "Royal-Air-Force-4", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tunis - Tunis", "msn": "9132", "yom": 1943, "flight_number": null, "city": "Tunis", "zone": "Tunis Governorate (ولاية تونس‎)", "country": "Tunisia", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 913, "captain_hours_type": 120, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Three minutes after its night take off from Tunis-El Aouina Airport, while in initial climb, the aircraft caught fire and crashed in flames 5 km northwest of the airport. The aircraft was totally destroyed and all six occupants were killed. \nCrew (267th Squadron):\nF/O G. V. Gibson, pilot,\nF/O H. G. Spencer, copilot,\nLt S. M. Yardwyn, navigator, \nF/Sgt K. Patterson, wireless operator.\nPassengers: \nW/Cdr F. S. Leslie, \nMaj Baxter.\nSource: http://www.rafcommands.com/forum/showthread.php?17280-Dakota-FD815-Dummy-Parachutists", "probable_cause": "The Court finds that a fire occurred in the aircraft, probably at the rear end of the cabin, shortly after take-off. There is no direct evidence as to the origin of the fire. The Court, however, considers that the fire did not originate in a dummy parachutist, but could have originated by the accidental firing of a pintail. The Court does not have any evidence as to the cause of the crash, but considers it possible that the fire inside the fuselage destroyed the elevator controls, or produced so much smoke as to blind the pilot. The highly inflammable nature of the cargo would have made remedial action almost impossible once a dummy parachutist had caught fire, which would happen at once if ignited by a pintail. The accidental firing of a dummy on the other hand gives three minutes warning during which the dummy could have been jettisoned. The Court considers that Major Baxter was properly instructed and capable of performing his duties. He probably commenced arming the pintails as soon as airborne. This coincides with the outbreak of the fire."}