{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-near-izobilnoye-6-killed", "date": "Nov 15, 1963 at 1820 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Yerevan – Baku – Dnipropetrovsk", "msn": "41 04", "yom": 1948, "flight_number": null, "city": "Izobilnoye", "zone": "Krasnodar Krai", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16084, "circumstances": "The airplane departed Baku Airport at 1408LT on a cargo flight to Dnipropetrovsk, Ukraine, carrying two engineers from the motorist Zaporozhie, four crew members and a load consisting of five gear boxes for a total weight of 1,366 kilos. After takeoff from Baku, the airplane climbed to an altitude of 2,100 meters and the crew obtained the permission to modify his route to make an intermediate stop at Rostov-on-Don before continuing to Dnipropetrovsk. Doing so, the crew failed to request information about weather conditions en route. Later into the flight, weather conditions worsened and the captain requested the permission to descend to 1,500 meters but this was not possible and ATC instructed the crew to maintain the assigned altitude of 2,100 meters. While cruising in a thunderstorm, the airplane went out of control, partially disintegrated in the air and eventually crashed in a field located 10 km north of Izobilnoye. The aircraft was totally destroyed and all six occupants were killed. It was reported that the left stabiliser was the first part to be sheared off during the descent and was found 850 meters from the main wreckage. ", "probable_cause": "Loss of control caused by severe downdrafts and turbulences while cruising in a thunderstorm activity. It was reported that the crew has not been informed about the deterioration of the weather conditions. "}