{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-321c-edmonton-5-killed", "date": "Jan 2, 1973 at 0034 LT", "type": "Boeing 707", "operator": "Pacific%20Western%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Toronto – Edmonton – Vancouver – Seoul", "msn": "18826", "yom": 1964, "flight_number": "PW3801", "city": "Edmonton", "zone": "Alberta", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 33059, "circumstances": "The airplane was engaged in a cargo flight from Toronto to Seoul with intermediate stops in Edmonton and Vancouver, carrying two passengers, three crew members and a load of 86 Holsteins cows. Following an uneventful flight, the crew was cleared for an ILS approach to runway 29. At this time, weather conditions were considered as poor with limited visibility due to the night, snow falls and turbulences as a cold front was approaching the area. The copilot was in command and due to various factors, he failed to realize that the sink rate was too high on short final when the captain decided to regain control. Then the airplane struck poplar trees located 3,137 meters short of runway and electric cables, stalled and crashed in flames in a gravel pit located less than three km from the airfield. The aircraft was destroyed and all five occupants and 86 cows were killed. ", "probable_cause": "It was determined that the crew was tired at the time of the accident and that the captain was on duty since 29 hours without sufficient rest time. Approach procedures negligences and poor crew coordination affected flight conditions. Difficult weather conditions with low clouds, snow falls and turbulences contributed to the difficulty of the flight conditions, as well as the fact that the copilot was inexperienced. It was reported he was recently promoted on B707 and this was his first approach following a six-week holiday period. Finally, the crew encountered technical issues with the generators on engines n°1 and 4 on final approach. "}