{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-wells-1-killed", "date": "Nov 26, 2012 at 2124 LT", "type": "Cessna 421C Golden Eagle III", "operator": "H-S Air", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "West Houston - Tulsa", "msn": "421C-0257", "yom": 1977, "flight_number": null, "city": "Wells", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6736, "circumstances": "The airplane was substantially damaged during an in-flight encounter with weather, in-flight separation of airframe components, and subsequent impact with the ground near Wells, Texas. The private pilot, who was the sole occupant, was fatally injured. The airplane sustained impact and fire damage to all major airframe components. The aircraft was registered to H-S Air LP and operated by the pilot under the provisions of 14 Code of Federal Regulations Part 91 as a business flight. Instrument meteorological conditions prevailed for the flight, which operated on an instrument flight rules (IFR) flight plan. The flight originated from the West Houston Airport (IWS), Houston, Texas, about 2040 and was bound for the Richard Lloyd Jones Jr. Airport (RVS), Tulsa, Oklahoma. Witnesses near the accident site reported hearing an explosion and then seeing a fireball descending through the clouds to the ground. Radar track data for the last portion of the flight depicted the airplane on a 7720 transponder code. The track showed the airplane initially on a heading of about 20 degrees at 23,000 feet. The track continued in this direction until 2120:03.73 when the airplane began a right turn. The right turn continued for about 30 seconds during which time the altitude remained constant and the heading changed to about 90 degrees. After 2120:45.86, the track showed an erratic steep descent that continued to the end of the data. The final data location was received at 2122:15.53 at an altitude of 2,800 feet. The accident location was 0.86 miles and 94 degrees from the last recorded radar position. ", "probable_cause": "The pilot’s decision to continue the flight into an area of extreme weather, which led to the in-flight encounter with a thunderstorm and structural failure of the wings and tail."}