{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-25-dk-tenerife-32-killed", "date": "Dec 7, 1965 at 1840 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Spantax-2", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tenerife – Las Palmas", "msn": "13474", "yom": 1944, "flight_number": null, "city": "Tenerife-Norte-Los Rodeos", "zone": "Canary Islands", "country": "Spain", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 28, "pax_fatalities": 28, "other_fatalities": 0, "total_fatalities": 32, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 19245, "circumstances": "The flight was a non-scheduled domestic flight from Tenerife to Las Palmas. It took off from runway 30 at Tenerife Airport with an IFR flight plan at 1830 hours and disappeared from the view of the tower controller in low cloud about 500 m before the end of the runway. According to the tower controller, the pilot acknowledged the last instructions from the tower two minutes after takeoff and did not re-establish contact afterwards. The aircraft was not seen again until a few moments before the accident which was presumed to have occurred between 1834 and 1840 hours according to witnesses. It was later determined that the airplane went into a dive and crashed few km from the airfield, killing all 32 occupants, most of them Scandinavian tourists. ", "probable_cause": "In the light of the investigation, the cause of this accident was considered to be unknown, and was, therefore, classified as \"undetermined\". However, the reasons which may have caused the aircraft to enter a spin are listed hereunder: One probable cause was a failure of the suction pump or the vacuum system. If the vacuum system had failed the artificial horizon, directional gyro and turn-and-bank indicator would have become inoperative. A failure of this sort, aggravated by turbulence, would deprive the pilot of the means to control the aircraft which, in these conditions, might have stalled one or more times. Another cause which might have produced a spin was flying into very severe turbulence with loss of control leading to a stall. Engine failure was not considered probable, although a malfunctioning of one of the propellers was not ruled out. It was considered that the pilot would have alerted the tower if an emergency has occurred, whereas it was considered unlikely that he would have done so if the instruments failed or if he encountered severe turbulence, as in these circumstances his entire attention would have been concentrated on trying to restore the aircraft to a normal attitude."}