{"url": "https://www.baaa-acro.com/crash/crash-douglas-r4d-5-mt-concepcion-16-killed", "date": "Jan 23, 1957 at 1118 LT", "type": "Douglas DC-3", "operator": "Lanica", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Managua – Bluefields – San Carlos – Managua", "msn": "12312", "yom": 1944, "flight_number": null, "city": "Mt Concepción (Ometepe Island)", "zone": "Rivas", "country": "Nicaragua", "region": "Central America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 13, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a flight from Managua to Bluefields and San Carlos and then returning to Managua. It departed San Carlos for Managua at 1049LT carrying a crew of 3 and 13 passengers. This information was given directly by the captain over the aircraft's transmitters, as the radio station for point-to- point communication is in the town, some distance from the landing field. The aircraft made no further contact. It crashed into the side of Concepción Volcano at 1118LT at a height of 2,650 feet killing all occupants. The aircraft crashed while performing a sharp ascending left curve at an altitude of 2,650 feet (according to the reading of the operating altimeter found at the accident site) and on a magnetic heading of 1700, i. e. 127° off its original course of 297°, and 350 feet below its cruising level, reported by the pilot as 3 000 feet. Witnesses stated that the weather was clear and fog covered only the top of the volcano, from 3 200 feet to its summit. A number of persons saw the aircraft flying on its normal heading to Managua shortly before the accident. Had the weather been unfavorable the pilot could very well have taken the usual action of flying at an altitude above all obstructions on the route and would have reported such action. ", "probable_cause": "According to eyewitnesses, the aircraft made a left turn, i. e. towards the volcano, and there were indications of abnormal conditions when it banked sharply in descent then in rapid climb; this shows that some trouble arose in the operation of the controls, propellers or engines, which unexpectedly caused loss of control. It was impossible to ascertain the cause of this malfunctioning, owing to the condition of total destruction of the aircraft after impact and fire. "}