{"url": "https://www.baaa-acro.com/crash/crash-avro-694-lincoln-b2-githunguri-10-killed", "date": "Feb 19, 1955", "type": "Avro 694 Lincoln", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "City", "schedule": "Nairobi - Nairobi", "msn": null, "yom": null, "flight_number": null, "city": "Githunguri", "zone": "Central", "country": "Kenya", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 4, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 19th February 1955, during what the then colonial government referred to as the \"Emergency\" enacted to combat the Mau Mau uprising, an RAF Lincoln bomber belonging to No. 49 Squadron based at Eastleigh aerodrome, crashed near the town of Githunguri some fifteen kilometers (eight miles) north-north-west of Kiambu. The bomber, serial number SX984, carrying six aircrew, was returning from a bombing and strafing mission over the Kipipiri Forest when the pilot, Flying Officer Alan Hunt, decided to carry out unauthorized low passes over the Police Officers' Mess where he knew a number of his RAF colleagues were spending the afternoon. The Mess was and is situated near the top of a hill overlooking the town with the police station itself lying half way down towards the main Uplands - Ruiru road. On the third pass, Hunt misjudged the height needed to clear the top of the hill with the result that parts of the starboard wing, tail plane and lower rudder were torn off after hitting three rondavel huts and a mess chimney, whereupon the aircraft went out of control, climbed steeply for about one hundred meters, then stalled before going into a near vertical dive and crashing half a kilometer south of the police station. Hunt and four other crew members died instantly in the resulting inferno, but the tail-gunner, Sergeant Stanley Bartlett was thrown clear and taken to Kiambu hospital and then to the Military hospital in Nairobi where he died five hours later as a result of burns and other serious injuries. Four civilians on the ground, one of them a child, also died. The six crew were buried with full military honors in City Park Cemetery.\r\nCrew (49th Squadron):\r\nF/O Hunt, pilot,\r\nSgt North, flight engineer,\r\nSgt Hollands, signaler, \r\nSgt Bartlett, air gunner, \r\nF/O King, navigator,\r\nF/O Parry, navigator.\r\nSource:\r\nRichard Bartlett-May, son of Sgt Stanley Bartlett.", "probable_cause": null}