{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-olive-creek-2-killed", "date": "Jan 18, 2014 at 1057 LT", "type": "Cessna 208B Grand Caravan", "operator": "Trans%20Guyana%20Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Olive Creek - Imbaimadai", "msn": "208B-0830", "yom": 2000, "flight_number": "TGY700", "city": "Olive Creek", "zone": "Cuyuni-Mazaruni", "country": "Guyana", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3108, "captain_hours_type": 2555, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17998, "circumstances": "On 17th January, 2014, the day before the accident, the pilot departed from his company base, Ogle International Airport (SYGO) with another aircraft, a Cessna 208B, Registration – 8R-GHT. He was tasked to do two days of shuttling; the first day between Olive Creek and Ekereku Bottom Airstrips, and the second day between Olive Creek and Imbaimadai Airstrips. The pilot was accompanied by a third crew/loader, whose duty was to ensure that the aircraft was properly loaded for each trip, and an aircraft engineer who was assigned to carry out minor maintenance duties and refuel the aircraft as required for the duration of the shuttle operations. It was reported that on the first day, during a landing at Ekereku Bottom, the aircraft encountered severe wind conditions that resulted in a hard landing. The pilot was very concerned about the hard landing and expressed this to several individuals. He was concerned enough to log the hard landing in the Aircraft Technical Log. After the hard landing the aircraft was visually inspected by the engineer who declared the aircraft fit for flight. However while taxying prior to takeoff the aircraft suffered a right brake seizure. The engineer freed and bled the brake line. Tests were done on the brakes and the aircraft was flown to Olive Creek. The hard landing and the brake failure were reported to base and an instruction was passed that this aircraft should be brought back to Ogle by another pilot. Another Cessna 208B aircraft, 8R-GHS, the accident aircraft, was left with the pilot for him to complete his shuttle schedule the next day. On the afternoon of the first day, the pilot flew this aircraft, 8R-GHS to Kamarang Airstrip, where he overnighted. On the second day, 18th January, 2014, he departed Kamarang at 10:30hrs UTC for Olive Creek with the engineer and the loader. The engineer was left at Olive Creek. The pilot, with the loader, did one shuttle from Olive Creek to Imbaimadai. He returned to Olive Creek where the aircraft was refueled and then did three shuttles between Olive Creek and Imbaimadai. After these three shuttles the aircraft was again refueled. He completed one shuttle, Olive Creek/Imbaimadai/Olive Creek and had just taken off on the second in this series of shuttles when the accident occurred during midmorning. Both the pilot and the third crew were killed in the crash. ", "probable_cause": "The investigation revealed that the probable cause of the accident was due to a power loss suffered by the engine. The power loss was associated with the fracture of one of the 1st stage compressor stator vanes by fatigue. The fatigue crack originated from a lack of brazing adhesion extending over approximately 0.280 inches along the chord length and 0.050 inches in the direction of the shroud thickness and was located between the leading edge and mid-chord of the vane. \r\nThe following findings were identified:\r\n1. The flight was one of a series of cargo shuttles that had originated the day before the accident, with another aircraft that was fitted with the Blackhawk modification.\r\n2. The hard landing followed by the brake failure that occurred on the originating day had upset the pilot and caused him much concern.\r\n3. A decision was taken to replace the original aircraft being used by the accident pilot with another one, which was also fitted with the Blackhawk modification.\r\n4. The pilot had completed five shuttles on the day of the accident. The sixth shuttle was the accident flight.\r\n5. The weather was satisfactory for VFR operations.\r\n6. There was no fire.\r\n7. Both the pilot and the third crew/loader were killed in this accident.\r\n8. This accident occurred 2½ minutes after take-off.\r\n9. The wreckage site was difficult to access, this along with unavailability of suitable equipment, contributed to the delay in extraction of the bodies. "}