{"url": "https://www.baaa-acro.com/crash/crash-cessna-525-cj1-crozet-1-killed", "date": "Apr 15, 2018 at 2054 LT", "type": "Cessna 525 CitationJet CJ1", "operator": "Augusta Aviation LLC", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Rchmond - Weyers Cave", "msn": "525-0165", "yom": 1996, "flight_number": null, "city": "Crozet", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 737, "captain_hours_type": 165, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3311, "circumstances": "The instrument rated private pilot was drinking alcohol before he arrived at the airport. Before the flight, he did not obtain a weather briefing or file an instrument flight rules flight plan for the flight that was conducted in instrument meteorological conditions. The pilot performed a 3-minute preflight inspection of the airplane and departed with a tailwind (even though he had initially taxied the airplane to the runway that favored the wind) and without communicating on the airport Unicom frequency. After departure, the airplane climbed to a maximum altitude of 11,500 feet mean sea level (msl), and then the airplane descended to 4,300 ft msl (which was 1,400 ft below the minimum safe altitude for the destination airport) and remained at that altitude for 9 minutes. Afterward, the airplane began a descending left turn, and radar contact was lost at 2054. The pilot did not talk to air traffic control during the flight and while operating in night instrument meteorological conditions. During the flight, the airplane flew through a line of severe thunderstorms with heavy rain, tornados, hail, and multiple lightning strikes. Before the airplane's descending left turn began, it encountered moderate-to-heavy rain. The airplane's high descent rate of at least 6,000 ft per minute and impact with a mountain that was about 450 ft from the last radar return, the damage to the airplane, and the distribution of the wreckage were consistent with a loss of control and a high-velocity impact. Examination of the airplane revealed no evidence of any preimpact mechanical anomalies. Based on the reported weather conditions at the time the flight, the pilot likely completed the entire flight in night instrument meteorological conditions. His decision to operate at night in an area with widespread thunderstorms and reduced visibility were conducive to the development of spatial disorientation. The airplane's descending left turn and its high-energy impact were consistent with the known effects of spatial disorientation. The pilot was not aware of the conditions near and at the destination airport because he failed to obtain a weather briefing and was not communicating with air traffic control. Also, the pilot's decision to operate an airplane within 8 hours of consuming alcohol was inconsistent  with the Federal Aviation Administration's regulation prohibiting such operations, and the level of ethanol in the pilot's toxicology exceeded the level allowed by the regulation. Overall, the pilot's intoxication, combined with the impairing effects of cetirizine, affected his judgment; contributed to his unsafe decision-making; and increased his susceptibility to spatial disorientation, which resulted in the loss of control of the airplane.", "probable_cause": "The National Transportation Safety Board determines the probable cause(s) of this accident to be:\r\nThe pilot's loss of control while operating in night instrument meteorological conditions as a result of spatial disorientation. Contributing to the accident was the pilot's decision to operate\r\nan airplane after consuming alcohol and his resulting intoxication, which degraded the pilot's judgment and decision-making."}