{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dash-8-q402-vilnius", "date": "Sep 12, 2007 at 0136 LT", "type": "De Havilland DHC-8-400 (Dash-8)", "operator": "SAS.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Copenhagen - Palanga", "msn": "4035", "yom": 2001, "flight_number": "SK2748", "city": "Vilnius", "zone": "Apskritis of Vilnius", "country": "Lithuania", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 48, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7928, "captain_hours_type": 291, "copilot_hours": 4674, "copilot_hours_type": 262, "aircraft_hours": 11366, "circumstances": "The aircraft departed Copenhagen-Kastrup AIrport on a flight to Palanga with 48 passengers and a crew of 4 on board. Following an uneventful flight, the crew started the descent. At an altitude of about 2,000 feet, the crew selected the landing gear down. However, the right-hand main gear extended but did not lock down and the landing gear doors did not close. The approach was abandoned and the crew initiated a go-around. During the second attempt to land, the crew recycled the system but the warning remained so the decision was taken to divert to Vilnius. On approach, the crew attempted to release the undercarriage using a backup system, but the undercarriage control panel still showed an unsafe warning. The right engine was shut down and the propeller was feathered prior to landing. Upon touchdown, the right main gear collapsed. The aircraft veered off runway and came to rest 40 metres further, some 1,150 metres pas the runway threshold. All 52 occupants evacuated safely and the aircraft was damaged beyond repair. ", "probable_cause": "The aircraft accident was caused by the separation of the piston rod of the extension/retraction actuator from the rod end during right hand main landing gear extension due to thread connection corrosion. The freely falling landing gear broke the apex hinge lugs of the stabilizer sections, the right hand landing gear did not lock in the extended position and collapse occurred when the aircraft was rolling after landing."}