{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-214-new-york", "date": "Jan 15, 2009 at 1531 LT", "type": "Airbus A320", "operator": "US%20Airways2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "New York - Charlotte", "msn": "1044", "yom": 1999, "flight_number": "US1549", "city": "New York", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 150, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 19663, "captain_hours_type": 4765, "copilot_hours": 15643, "copilot_hours_type": 37, "aircraft_hours": 25241, "circumstances": "Aircraft experienced an almost complete loss of thrust in both engines after encountering a flock of birds and was subsequently ditched on the Hudson River about 8.5 miles from La Guardia Airport (LGA), New York City, New York. The flight was en route to Charlotte Douglas International Airport, Charlotte, North Carolina, and had departed LGA about 2 minutes before the in-flight event occurred. The 150 passengers, including a lap held child, and 5 crew members evacuated the airplane via the forward and overwing exits. One flight attendant and four passengers were seriously injured, and the airplane was substantially damaged.", "probable_cause": "The ingestion of large birds into each engine, which resulted in an almost total loss of thrust in both engines and the subsequent ditching on the Hudson River. Contributing to the fuselage damage and resulting unavailability of the aft slide/rafts were:\r\n-the Federal Aviation Administration’s approval of ditching certification without determining whether pilots could attain the ditching parameters without engine thrust,\r\n-the lack of industry flight crew training and guidance on ditching techniques,\r\n-the captain’s resulting difficulty maintaining his intended airspeed on final approach due to the task saturation resulting from the emergency situation. \r\nContributing to the survivability of the accident was: \r\n-the decision-making of the flight crew members and their crew resource management during the accident sequence,\r\n-the fortuitous use of an airplane that was equipped for an extended overwater flight, including the availability of the forward slide/rafts, even though it was not required to be so equipped\r\n-the performance of the cabin crew members while expediting the evacuation of the airplane,\r\n-the proximity of the emergency responders to the accident site and their immediate and appropriate response to the accident."}