{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-330c-near-rio-de-janeiro-3-killed", "date": "Jul 26, 1979 at 1832 LT", "type": "Boeing 707", "operator": "Lufthansa-3", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Rio de Janeiro – Dakar – Frankfurt", "msn": "20395/848", "yom": 1970, "flight_number": "LH527", "city": "Rio de Janeiro-Galeão", "zone": "Rio de Janeiro", "country": "Brazil", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 7969, "captain_hours_type": 996, "copilot_hours": 3537, "copilot_hours_type": 2631, "aircraft_hours": null, "circumstances": "Flight 527 was cleared for a No.16 departure by ground control and was instructed to make a right turn after takeoff, heading the Caxias VOR, climbing to and maintaining 2000 feet. The aircraft took off from runway 27 at 21:27. Approach control then asked the crew to increase their speed. The speed increased progressively to 304 knots, exceeding the 250 knots maximum speed inside the terminal control area below 10000 feet. While Flight 527 was flying towards mountainous terrain and increasing its speed (in the north sector of the radar scope), the controller was busy vectoring an excessive amount of traffic in the south sector. The assistant departure controller failed to monitor the traffic. When the controller turned his attention to LH527 again, he was surprised by the position of the aircraft and instructed 'LH, turn right heading 140, just now, over'. The controller repeated his instructions and instructed the crew to increase their rate of climb. At that time the GPWS sounded in the cockpit. The aircraft struck trees on the slope of a mountain in a nose-up, left wing down attitude and continued 800 m while breaking up.", "probable_cause": "It is clear that there was a breakdown in teamwork of the personnel on duty in Rio approach control at that time. The departure controller, through incomplete instructions, caused LH527 to fly for a period of time on a heading and at an altitude that led the aircraft to collision. The assistant controller, the co-ordinator and the supervisor on duty did not support the departure controller as they should have done. A contributing factor was that the crew accepted the incomplete ATC instructions (no clearance limit or alternate procedure) and flew during 1 min 41s without bilateral communications and in potential danger inherent in these incomplete instructions."}