{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1049h-super-constellation-chicago-11-killed", "date": "Nov 24, 1959 at 0535 LT", "type": "Lockheed L-1049 Super Constellation", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Chicago – Denver – Los Angeles", "msn": "4824", "yom": 1957, "flight_number": "TW595", "city": "Chicago-Midway", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 8, "total_fatalities": 11, "captain_hours": 12467, "captain_hours_type": 1670, "copilot_hours": 6285, "copilot_hours_type": 3919, "aircraft_hours": 3432, "circumstances": "Flight 595, loaded with cargo, took off on runway 31L of Midway at approximately 0531LT bound for Los Angles, California. As the aircraft began a left turn, the crew notified Midway Tower they had received a fire warning on the No. 2 engine and had shut it down. They also informed the tower the flight would return and land. The aircraft proceeded in a continuing left turn around the airport in an elliptical pattern and below the clouds which were based at an altitude of 500 to 600 feet. In the turn to final approach to runway 31 the aircraft banked in excess of 45 degrees during which it developed an excessive rate of sink. When the aircraft reached the tops of the trees its wings were nearly level and its nose was raised in a climbing attitude; however, the descent continued. The wing flaps were being retracted during the last 5 to 10 seconds of the final descent and were found to be symmetrically extended at 24 percent upon impact. The plane crashed into a residential area about one-fourth of a mile southeast of Midway Airport, Chicago, Illinois, killing all persons aboard, demolishing the aircraft, and fatally injuring eight persons on the ground.", "probable_cause": "The Board determines the probable cause of this accident to be the maneuvering of the aircraft in a manner that caused it to develop an excessive rate of sink while in the turn to final approach."}