{"url": "https://www.baaa-acro.com/crash/crash-vickers-838-viscount-stockholm-22-killed", "date": "Jan 15, 1977 at 0905 LT", "type": "Vickers Viscount", "operator": "Skyline%20Sweden", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "City", "schedule": "Kristianstad – Växjö – Jönköping – Stockholm", "msn": "372", "yom": 1961, "flight_number": "OX618", "city": "Stockholm-Bromma", "zone": "Uppland", "country": "Sweden", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 19, "pax_fatalities": 19, "other_fatalities": 0, "total_fatalities": 22, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12208, "circumstances": "The aircraft was completing a regular schedule flight from Kristianstad to Stockholm-Bromma with intermediate stop in Växjö and Jönköping, carrying 19 passengers and a crew of three on behalf of Linjeflyg. On approach to Bromma Airport, the crew encountered marginal weather and icing conditions. At an altitude of 1,150 feet and a speed of 137 knots, flaps were deployed at an angle of 40° when control was lost. The airplane entered a nose down attitude and crashed at an angle of 110° and a speed of 210 knots in a parking lot located in the residential area of Kälvesta, about 4,5 km short of runway 12 threshold. The aircraft was totally destroyed by impact forces and a post crash fire and all 22 occupants were killed. At the time of the accident, weather conditions were considered as marginal with icing conditions and a horizontal visibility of 5 km with a cloud base at 700 feet. ", "probable_cause": "Loss of control on final approach due to an excessive accumulation of ice on the horizontal stabilizers after the crew lower the flaps from 32° to 40°. When control was lost, both right engines n°3 and 4 were not running at full power for undetermined reasons, which caused the deicing system to produce an insufficient temperature."}