{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-18d-gander-37-killed", "date": "Sep 5, 1967 at 0240 LT", "type": "Ilyushin II-18", "operator": "CSA-Czech-Airlines-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Prague – Shannon – Gander – Havana", "msn": "187 0097 05", "yom": 1967, "flight_number": "OK523", "city": "Gander", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 8, "crew_fatalities": 4, "pax_on_board": 61, "pax_fatalities": 33, "other_fatalities": 0, "total_fatalities": 37, "captain_hours": 17303, "captain_hours_type": 5360, "copilot_hours": 10749, "copilot_hours_type": 1291, "aircraft_hours": 766, "circumstances": "Flight 523 was a scheduled international flight from Prague, Czechoslovakia to Havana, Cuba, via Shannon, Ireland, and Gander, Newfoundland. It departed Prague at 1649 hours GMT on 4 September and proceeded to Shannon where it arrived at 2020 hours for a routine servicing stop. It departed Shannon at 2131 hours arriving at Gander at 0326 hours on 5 September following an uneventful flight. The crew which had flown the aircraft from Prague disembarked at Gander and was replaced by a crew which had been off duty in Gander from 3 September. At Gander the aircraft was serviced and refuelled under the supervision of the flight engineer of the outgoing flight. A flight plan to Havana was filed at about 0405 hours and at 0504 hours the aircraft began taxiing to the threshold of runway 14. It was cleared to take-off at 0508 hours. The length of the ground roll was normal, the undercarriage and flaps were retracted, but the angle of climb was abnormally shallow. At 0509 hours the flight advised the tower controller that the aircraft was airborne, the tower controller acknowledged the transmission and advised the flight to contact Air Traffic Control Centre on a frequency of 119.7 MHz. Whilst the radio operator was changing frequency the aircraft struck the ground about 4 000 feet beyond the end of the runway. The accident occurred at 0510 hours GMT. Debris scattered on 1,500 meters and 32 occupants were wounded while 37 others were killed, among them 4 crew members. ", "probable_cause": "Investigations were unable to determine the exact cause of the accident. "}