{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-north-ari-atoll", "date": "Jul 14, 2008 at 1230 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Maldivian%20Air%20Taxi", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Male - North Ari Atoll", "msn": "445", "yom": 1975, "flight_number": null, "city": "North Ari Atoll", "zone": "North Central Province", "country": "Maldivian Islands", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 14, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3150, "captain_hours_type": 430, "copilot_hours": 2880, "copilot_hours_type": 127, "aircraft_hours": 49129, "circumstances": "14th July 2008 was a Monday; the busiest day of the week where there is an average of 150-200 movements. 8Q-MAS completed six sectors prior to the accident, with the same flight crew. Sixteen pieces of baggage were loaded, in the aft cabin, with total weight of 458 lbs. The flight manifest signed by Pilot in Command indicated that the aircraft was loaded up to 11874 lbs. The aircraft was boarded with 14 passengers (7 females, 6 males and 1 child) and the flight manifest used approved weights of 77 lbs Child, 181 lbs for male and 141 lbs for female to calculate the aircraft weight. The aircraft had 930 lbs of fuel. This particular aircraft was a short nose twin otter aircraft, with main loading in aft cabin. The MAT seaplane operation was based on a day VFR, non-schedule and a self dispatch system. All pre-flight duties were completed by the crew. The weather was windy and sea was rough. The aircraft departed at 12.11 hrs from MAT dock at Male International Airport, Water Aerodrome to Adaaran Club Bathala with 14 passengers total: 10 passengers to Adaaran Club Bathala, 2 passengers to Nika Maldives and 2 Passengers to W Retreat and Spa (Fesdu). The estimated flight time to destination was 20 minutes. The W Retreat and Spa Maldives Resort’s Speed Boat (Angelina) (a 34 ft Triana Express) was moored at a buoy (located at 04 04’ 43.6” N, 072 56’ 37.1” E) used by MAT to moor the aircrafts for night stops. The floating platform was located (04 04’ 43.5”N, 072 56’ 38.8”E) east of the buoy. The distance between the floating platform and buoy is around 165 feet. Around 12:30 the aircraft approached for landing near the floating platform. The wind was on a westerly direction 20 to 25 knots and the aircraft approached for a westbound landing. The aircraft made an orbit over the lagoon to inspect the water. The aircraft did a touchdown and was cutting the wave tops to find an appropriate location to stop, when it hit a big wave and was airborne. The aircraft veered to the left. The PIC declared to do a go around. The crew action was 10 degree flap, full throttle and Max Prop RPM. On climb the aircraft collided with the Speed Boat and the aircraft veered to the right and PIC was able to land on LH float. ", "probable_cause": "Causal Factors:\r\n• The crew’s decision to land on rough waters without giving due considerations for a rejected landing and obstacles nearby was a causal factor.\r\n• The Speed Boat moored to a buoy, close to the landing area was also a causal factor."}