{"url": "https://www.baaa-acro.com/crash/crash-learjet-25b-del-rio-1-killed", "date": "Sep 19, 2003 at 1710 LT", "type": "Learjet 25", "operator": "Ameristar%20Jet%20Charter2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "El Paso – Del Rio", "msn": "25-116", "yom": 1973, "flight_number": "AJI892", "city": "Del Rio", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4689, "captain_hours_type": 1348, "copilot_hours": 2783, "copilot_hours_type": 263, "aircraft_hours": 15363, "circumstances": "The cargo flight was cleared for a visual approach to the 5,000-foot long, by 150-foot wide asphalt runway. Based on estimated landing weight of the aircraft, the Vref was estimated at 116 KIAS. Air traffic Control (ATC) radar data revealed that the flight maintained a ground speed above 190 knots on final approach, to include the touchdown zone for runway 13. The first evidence of braking was noted at a point 1,247 feet from the departure end of the runway. Braking signatures on the asphalt as well as off the pavement were consistent with an operational anti-skid system. Witnesses at the airport also observed the airplane flying very fast and touching down long. Both crewmembers, the 4,689-hour captain and the 2,873-hour first officer, were familiar with the airport, and the flight was 20 minutes ahead of its scheduled arrival time. The airplane overran the departure end of runway 13, impacted the airport perimeter fence, proceeded across a roadway, took out another fence, and collided with two trees in a cemetery. The airplane was found to be within weight and balance limits for all phases of the flight. The installed cockpit voice recorder (CVR) was found not to be functional.", "probable_cause": "The pilot's misjudged distance and speed during the approach to landing, and his failure to obtain the proper touchdown point resulting in an overrun. A contributing factor was the pilot's failure to abort the landing."}