{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950-ketapang-2-killed", "date": "Dec 31, 2009 at 0826 LT", "type": "Fletcher FU-24", "operator": "Sinarmas", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "No", "site": "City", "schedule": "Ujung Tanjung - Jambi - Pangkal Pinang - Ketapang - Tangar", "msn": "187", "yom": 1970, "flight_number": null, "city": "Ketapang", "zone": "West Kalimantan", "country": "Indonesia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2892, "captain_hours_type": 641, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was completing a ferry flight from Ujung Tanjung/Pekanbaru home base to Tangar airstrip, Center of Kalimantan, with reference flight approval number D09-038960 and Security Clearance number AU05-033328, person on board was one pilot and one engineer. On 29 December 2009, the aircraft departed from Ujung Tanjung, transit at Jambi and stop overnight at Pangkal Pinang Airport, Bangka with total flight time was 3 hours. On the next day 30 December 2009, the aircraft continuing flight from Pangkal Pinang to Rahadi Oesman Airport, Ketapang, West Kalimantan and overnight at Ketapang with total flight time is 1:40 hours. On the next day 31 December 2009, the aircraft plan to continued flight to Tangar Airstrip. The aircraft was airworthy prior departure and dispatched from Ketapang with the following sequence:\r\na. The pilot requested for start the engine at 01:17 UTC4 (08:17 Local Time);\r\nb. At 01:24 the pilot requested for taxi, and the ATC gave clearance via taxiway “A”. The pilot requested intersection runway 17 and approved by ATC\r\nc. The ATC requested for reported when ready for departure, and the pilot reported ready for departure, then the ATC gave the departure clearance.\r\nd. At 01:25, the aircraft was departed and crashed at 01:26 striking the roof of the hospital and broken down into pieces at the parking area in which have had approximate 1.5 Kilometer to the left side from the flight path centreline. The aircraft was substantially damage and the crew on board consist of one pilot in command and one aircraft maintenance engineer; both of them were fatally injured. ", "probable_cause": "The investigation concluded that the aircraft engine was not in power during impact with the hospital roof. There was a corroded fuel pump, that indicated of contaminated fuel.\r\nFindings:\r\n• The aircraft was airworthy prior departure. \r\n• The pilot was fit for flight. \r\n• The booster pump was found of an evident of surface corrosion on the spring, plate and van pump indicated that contaminated fuel. \r\n• Referred to the Fletcher Flight Manual and Pilot Operating Handbook chapter 3.10. Fuel System Failure, the booster pump must have been operated prior to flight. \r\n• The propeller blades were on fine pitch and no sign of rotating impact. The engine was not in powered when hit the ground. \r\n• No evidence damage related to the engine prior to the occurrence. \n"}