{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-685-bass-strait-2-killed", "date": "Jul 17, 1983 at 1505 LT", "type": "Rockwell Aero Commander 685", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Hobart - Melbourne", "msn": "685-12005", "yom": 1972, "flight_number": null, "city": "Bass Strait", "zone": "All Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 17 July 1983 the pilot of Rockwell (Aero Commander) 685 aircraft VH-WJC submitted a flight plan to the Hobart Briefing Office for a private category flight from Hobart to Moorabbin, tracking via Launceston and Wonthaggi. The plan indicated that the flight would be conducted under the Instrument Flight Rules (IFR) at Flight Level 120 (12 000 feet altitude on standard atmospheric pressure of 1013.2 millibars), with two persons on board. The flight plan showed that the aircraft had a fuel endurance of 220 minutes, and carried an Emergency Locator Beacon (ELB) and life jackets. There was no indication that a life raft was carried. The aircraft departed Hobart at 1352 hours and, thereafter, the pilot made the appropriate radio reports to Hobart Tower, Launceston Control and Launceston Tower. The flight apparently progressed normally until 1452 hours when the pilot advised Launceston Control, \"Er Whiskey Juliet Charlie we seem to have been in trouble with er fuel here the red er warning light comes on and the gauge is down . . .\".At 1454 hours the pilot transmitted a Mayday call, indicating that he was descending from Flight Level 120 on track to Bass (a position reporting point), present position was 85 nautical miles (nm) from Launceston and he would be making a controlled ditching. Launceston Control immediately initiated the Distress phase of the Search and Rescue procedures and advised the Melbourne Operational Control Centre (OCC). Further  communications between the aircraft and Launceston Control indicated that the aircraft was continuing descent on track towards Wonthaggi. The last position report from the pilot, at 1500 hours, was 94 nm from Wonthaggi. The last recorded transmission from the aircraft was at 1501 hours when the pilot confirmed that there were two persons on board. There were no indications at any time from the pilot that the fuel supply had been exhausted or that either engine had failed. It was estimated that the aircraft ditched at about 1505 hours, at an approximate position of 81 nm from Wonthaggi on the planned track. No trace of the aircraft nor both occupants was found.", "probable_cause": "Due to lack of evidences, the exact cause of the accident could not be determined. "}