{"url": "https://www.baaa-acro.com/crash/crash-rockwell-gulfstream-690c-jetprop-840-bellevue-4-killed", "date": "Feb 3, 2014 at 1655 LT", "type": "Rockwell Gulfstream 690C Jetprop 840", "operator": "Mid Kansas Agri Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Great Bend – Nashville", "msn": "690-11727", "yom": 1982, "flight_number": null, "city": "Bellevue", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3205, "captain_hours_type": 719, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4460, "circumstances": "The instrument-rated private pilot was conducting a personal cross-country flight in the multiengine airplane under instrument flight rules (IFR). As the flight neared its destination, the controller issued clearance for a GPS approach, and, shortly thereafter, the pilot informed the controller that he needed to review the approach procedure before continuing the approach. The controller acknowledged, and, after the pilot reported that he was ready to proceed with the approach, the controller again issued clearance for the GPS approach. Radar data showed that, during the approach, the airplane tracked a course that was offset about 0.5 miles right of the final approach course until it was about 1 mile from the runway threshold. The airplane then turned left towards the threshold and descended to an altitude of about 145 ft above ground level over the runway threshold before the pilot performed a missed approach. It is likely that the pilot performed the missed approach because he was unable to align the airplane with the runway before it crossed the threshold. The controller provided radar vectors for the airplane to return to the approach course and cleared the airplane a third time for the GPS approach to the runway. Radar data showed that the airplane was established on the final approach course as it passed the initial approach fix; however, before it reached the final approach fix, its airspeed slowed to about 111 knots, and it began a left turn with a 25 degree bank angle. About 18 seconds later, while still in the turn, the airplane slowed to 108 knots and began descending rapidly. The airplane's rate of descent exceeded 10,000 feet per minute, and it impacted the ground about 9 miles from the destination airport. Examination of the accident site showed that the airplane was severely fragmented and fire damaged with debris scattered for about 450 feet. Postaccident examination of the wreckage did not reveal evidence of any preimpact failures; however, damage to the left engine indicated that it was not producing power at the time of the accident. The severity of impact and fire damage to the airplane and engine precluded determination of the reason for the loss of left engine power. Weather conditions present at the time of the accident were conducive to super cooled liquid water droplets, and the airplane likely encountered moderate or greater icing conditions. Several pilot reports (PIREPs) for moderate, light, trace, and negative icing were reported to air traffic control but were not distributed publicly into the national airspace system, and there was no airmen's meteorological information (AIRMET) issued for icing. However, the pilot received standard and abbreviated weather briefings for the flight, and his most recent weather briefing included three PIREPs for icing conditions in the area of the accident site. Given the weather information provided, the pilot should have known icing conditions were possible. Even so, the public distribution of additional PIREPs would have likely increased the weather situational awareness by the pilot, weather forecasters, and air traffic controllers. The airplane was equipped with deicing and anti-icing systems that included wing and empennage deice boots and engine inlet heaters. Due to impact damage to the cockpit, the positions of the switches for the ice protection systems at the time of the accident could not be determined. Although the airplane's airspeed of 108 knots when the steep descent began was above its published stall speed of 77 knots, both bank angle and ice accretion would have increased the stall speed. In addition, the published minimum control airspeed was 93 knots. It is likely that, after the airplane passed the initial approach fix, the left engine lost power, the airplane's airspeed began to decay, and the asymmetric thrust resulted in a left turn. As the airspeed continued to decay, it decreased below either stall speed or minimum control airspeed, and the airplane entered an uncontrolled descent.\n", "probable_cause": "The pilot's failure to maintain airspeed with one engine inoperative, which resulted in a loss of control while on approach. Contributing to the accident were airframe ice accumulation due to conditions conducive to icing and the loss of engine power on one engine for reasons that could not be determined due to the extent of damage to the airplane."}