{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-440-62-metropolitan-tangier-50-killed", "date": "Mar 31, 1965 at 1004 LT", "type": "Convair CV-440 Metropolitan", "operator": "Iberia-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Malaga – Tangier", "msn": "388", "yom": 1957, "flight_number": null, "city": "Tangier-Boukhalef", "zone": "Tangier-Tétouan", "country": "Morocco", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 48, "pax_fatalities": 45, "other_fatalities": 0, "total_fatalities": 50, "captain_hours": 6140, "captain_hours_type": null, "copilot_hours": 13355, "copilot_hours_type": null, "aircraft_hours": 9015, "circumstances": "The aircraft took off from Malaga, Spain, at 0733 hours GMT, on a non- scheduled international flight to Tangier, Morocco, and return. Meteorological conditions were good as far as Gibraltar; however, the aircraft encountered conditions which were below the general minima north-west of Tangier. The crew first contacted Tangier control tower at 0755 hours, estimating Tangier at 0805 hours. The 0720 hours weather observation was then passed to the crew. At 0758 hours the crew was informed that the Tangier VOR was inoperative and two minutes later they were requested to report at 2 500 ft over the TW locator or field in sight. At 0802 hours they were provided with the 0750 hours weather observation together with the latest QNH (1 024 mb) and QFE (1 022 mb). This was acknowledged by the crew at 0803 hours. All subsequent calls from Tangier control tower remained unanswered. It was subsequently found that the aircraft had crashed at about 0804 hours into the sea, approximately 10 NM off the Moroccan coast. Three passengers were rescued while 50 other occupants were killed. ", "probable_cause": "For undetermined reasons, the aircraft stalled at an altitude from which recovery could not be effected."}