{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-collegedale-5-killed", "date": "Dec 2, 2004 at 1324 LT", "type": "Cessna 421B Golden Eagle II", "operator": "GCCSDA", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Collegedale – Knoxville", "msn": "421B-0386", "yom": 1973, "flight_number": null, "city": "Collegedale", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 4475, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6808, "circumstances": "The airline transport pilot (ATP) stated the airplane was between 200 to 300 feet on initial takeoff climb when the right engine lost power and the airplane yawed to the right. The pilot lowered the nose of the airplane to gain airspeed, pulled the right power lever rearward and nothing happened. The pilot did not feather the right propeller and started moving switches in the vicinity of the boost pump switches. The ATP passenger stated, he did not think the left engine was producing full power. He scanned the instruments with his eyes looking at the manifold pressure gauges. \"One needle was at zero and the other was at 25-inches. The manifold pressure should have been 39-inches of manifold pressure. The ATP passenger observed trees to their front and thought the pilot was trying to make a forced landing in an open field to their left. The ATP passenger realized the airplane was going to collide with the trees. Just before the airplane collided with the trees, the pilot feathered the right engine. The ATP passenger observed the right propeller going into the feather position, and the propeller came to a complete stop. Examination of the right engine revealed no anomalies. Examination of the left engine revealed the starter adapter gear teeth had failed due to overload.\n", "probable_cause": "The pilot's improper identification of a partial loss of engine power on initial takeoff climb resulting in a collision with trees and the ground. A factor was a partial failure of the left engine starter adapter due to overload."}