{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-120er-brasilia-near-manaus-33-killed", "date": "May 14, 2004 at 1835 LT", "type": "Embraer EMB-120 Brasília", "operator": "Rico", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "São Paulo de Olivença – Tabatinga – Tefé – Manaus", "msn": "120-070", "yom": 1988, "flight_number": "RLE4815", "city": "Manaus", "zone": "Amazonas", "country": "Brazil", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 30, "pax_fatalities": 30, "other_fatalities": 0, "total_fatalities": 33, "captain_hours": 19069, "captain_hours_type": 5819, "copilot_hours": 11927, "copilot_hours_type": 4637, "aircraft_hours": null, "circumstances": "While descending to Manaus-Eduardo Gomes Airport following an uneventful flight from Tefé, the aircraft was correctly established on the ILS when the crew was instructed by ATC to initiate a go-around and to follow a holding pattern as the priority was given to an ambulance flight. The crew made a left turn heading 060° and continued the descent after passing 2,000 feet when the aircraft struck the ground and crashed about 33 km from the airport. The aircraft disintegrated on impact and all 33 occupants were killed. ", "probable_cause": "Controlled flight into terrain after the crew continued the descent below 2,000 feet until the aircraft impacted ground. The following contributing factors were identified:\r\n- The crew reported his altitude at 2,000 feet while the real altitude of the airplane was 1,300 feet, \r\n- The crew continued the descent until final impact, \r\n- The crew did not react to the GPWS alarm that sounded four times when the aircraft reached the altitude of 400 feet, \r\n- No corrective action was taken by the crew,\r\n- Lack of crew coordination, \r\n- Poor approach planning that led the aircraft descending to a critical altitude, \r\n- Lack of supervision,\r\n- Operational deficiencies. "}