{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-7b-jones-beach-84-killed", "date": "Feb 8, 1965 at 1825 LT", "type": "Douglas DC-7", "operator": "Eastern-Airlines-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Boston – New York – Richmond – Charlotte – Greenville – Atlanta", "msn": "45455", "yom": 1958, "flight_number": "EA663", "city": "Jones Beach", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 79, "pax_fatalities": 79, "other_fatalities": 0, "total_fatalities": 84, "captain_hours": 12607, "captain_hours_type": 595, "copilot_hours": 8550, "copilot_hours_type": 2750, "aircraft_hours": null, "circumstances": "Eastern Air Lines, Flight EA 663 was a scheduled passenger flight originating at Boston, MA (BOS), and terminating at Atlanta, GA (ATL) with intermediate stops at New York (JFK), Richmond, VA (RIC), Charlotte, NC (CLT), and Greenville-Spartanburg, SC (GSP). The DC-7B took off from runway 31L at New York-JFK at 18:20 on an IFR clearance to the Richmond Airport. The crew flew a Dutch 7 Standard Instrument Departure. About 18:24 EAL 663 was further cleared to 8,000 feet and instructed to turn right to a heading of 150 degrees. The flight acknowledged this clearance and reported leaving 3,000 feet. Shortly thereafter the crew reported leaving 3,500 feet at which time the flight was instructed to turn left to a heading of 090 degrees. At 18:25, while climbing through 3700 feet Departure Control instructed the flight to \"... turn right now, heading one seven zero to Victor one thirty nine, traffic 2 o'clock five miles northeast bound below you.\" The flight responded, \"OK we have the traffic, turning one seven zero...\" The other traffic was Pan American flight 212 arriving from San Juan. The Boeing 707 was being vectored to intercept the final approach course to runway 31R. At approximately 18:24 Approach Control had instructed the PA212 to turn right to a heading of 020 degrees and inquired if the flight had as yet, reached 3,000 feet. Approach Control then instructed the flight to report leaving each 500-foot level down to 3,000 feet and advised the flight of \" ...Traffic at 11 O'clock, six miles southeast bound just climbing out of three (3,000 feet).\" As the Eastern DC-7 was turning from 090 to 170 degrees, the airplane was in a 35-degree banked nearly level turn. With PA212 approx. 700 feet lower and four miles away at 3 o'clock, PA212 would not be visible to the captain of EA663 until he was nearly around the turn and on the rollout. Upon completion of the turn, they were on a nearly head-on, converging course with PA212. At that moment, PA212 started a left turn to the assigned heading of 360 degrees. The results of this turn would be to produce an illusion of an apparent collision track. Also, EA663 was turning away from the background lights of the Long Island shore into a black area, so there was no horizon available to assist in the determination of the relative altitude of the target airplane. Under these circumstances, it is likely that the Eastern pilot started a descent, initially as a precautionary measure, which would give him a longer time to observe the other aircraft, and provide him with a measure of vertical separation. Afraid of a collision, PA212 rolled rapidly to the right and also initiated a descent. The Eastern pilot also made a rapid roll to the right and/or a pull up. In this circumstance the DC-7 was placed in an unusual attitude, resulting in spatial disorientation of the crew. They were not able to recover from the vertical bank. The DC-7 struck the sea and disintegrated.", "probable_cause": "The evasive action taken by EAL 663 to avoid an apparent collision with PAA 212. The evasive manoeuvre of EAL 663, prompted by illusion, placed the aircraft in an unusual attitude from which recovery was not effected."}