{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2-near-tatarsk-4-killed", "date": "Mar 30, 1983 at 1244 LT", "type": "PZL-Mielec AN-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "No", "site": "Plain, Valley", "schedule": "Mielec – Lvov – Samara – Omsk – Novosibirsk", "msn": "1G201-18", "yom": 1983, "flight_number": null, "city": "Tatarsk", "zone": "Novosibirsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane was just coming out from the PZL-Mielec factory in Mielec, Poland. Three crew members and one passenger were in charge to deliver the plane to Novosibirsk via Lvov, Samara and Omsk. The crew departed Omsk at noon on the last leg to Novosibirsk and continued in good weather conditions bound to the east. While approaching Tatarsk, weather conditions deteriorated with clouds down to 150 meters above the ground. The pilot-in-command reduced his altitude in an attempt to maintain visual contact with the ground. At an altitude of 199 meters, the single engine airplane struck with its both right wings a relay antenna (202 meters high) located about 5 km northeast of Tatarsk. Out of control, the aircraft lost height and crashed 280 meters further in a snow covered field, bursting into flames. All four occupants were killed. ", "probable_cause": "The crew failed to prepare the flight properly and took the decision to continue to fly under VFR mode into low clouds with a below-minima visibility. The people in charge to transmit to the crew weather bulletin failed to ensure that information were accurate. A lack of discipline and wrong in-flight decisions on part of the crew were considered as contributing factors.  "}