{"url": "https://www.baaa-acro.com/crash/crash-embraer-erj-190ar-durango", "date": "Jul 31, 2018 at 1523 LT", "type": "Embraer ERJ-190", "operator": "AeroMexico-Connect", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Durango – Mexico City", "msn": "190-00173", "yom": 2008, "flight_number": "AM2431", "city": "Durango", "zone": "Durango", "country": "Mexico", "region": "Central America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 98, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3700, "captain_hours_type": 1064, "copilot_hours": 1973, "copilot_hours_type": 460, "aircraft_hours": 27257, "circumstances": "The takeoff from Durango-Guadalupe Victoria Airport was initiated in poor weather conditions as a thunderstorm just passed over the airport five minutes prior to the accident. The takeoff from runway 03 was completed with a wind from 047° at 33 knots. Eight seconds after liftoff, the aircraft climbed to a height of 8 feet with a speed of 145 knots. At this time, the wind came from 103° at 11 knots. The aircraft continued to climb to 30 feet when the wind changed with a tailwind component of 22 knots from 030°. The aircraft started to descend and impacted ground, causing both engines to be torn off. The aircraft continued, overran and slid for 380 metres before coming to rest, bursting into flames. All 103 occupants were evacuated and 39 were injured, 14 seriously. The aircraft was totally destroyed by a post crash fire. At the time of the accident, weather conditions were poor with thunderstorm activity, heavy rain falls and strong winds. Notable variations in wind components were noticed at the time of the accident. ", "probable_cause": "Impact against the runway caused by loss of control of the aircraft in the final phase of the take-off run by low altitude windshear that caused a loss of speed and lift. The following contributing factors were reported:\r\n- Decrease in situational awareness of the flight crew when the commander was performing unauthorized instructional tasks without being qualified to provide flight instruction and to assign copilot and Pilot Flying duties to a an uncertified and unlicensed pilot,\r\n- Failure to detect variations in the indicator displayed by the airspeed indicator on the PFD during the take-off run,\r\n- Lack of adherence to sterile cabin procedures and operational procedures (TVC; Changes of runway and/or take off conditions after door closings; Take off in adverse windshear conditions) established in the Flight Operations Manual, the Dispatch Manual and the Standard Operating Procedures,\r\n- Lack of adherence to published procedure,\r\n- Lack of adherence to Aerodrome and meteorological information procedures,\r\n- Lack of supervision on part of Tower personnel at Durango Airport."}