{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-hobart", "date": "Apr 27, 1981 at 1814 LT", "type": "Rockwell Shrike Commander 500", "operator": "Tasair", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Melbourne – Hobart", "msn": "500-1831-28", "yom": 1968, "flight_number": null, "city": "Hobart", "zone": "Tasmania", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1925, "captain_hours_type": 77, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Due to industrial action, normal domestic airline services had been suspended. The pilot hired the aircraft to convey persons stranded by the strike between Hobart and Melbourne. He submitted a flight plan for the proposed return flight to Melbourne that nominated operations under the Instrument Flight Rules, although he did not hold an appropriate Instrument Rating. The flight to Melbourne was completed without known incident. After refuelling the aircraft and engaging five passengers, the return flight was commenced. A fare was paid by each passenger although the pilot did not hold either a Charter Licence or an appropriate pilot licence. There was considerable cloud in the vicinity of Hobart Airport which, at 1800 hours, was recorded as one okta stratus, base 800 feet; five oktas stratocumulus, base 3000 feet; five oktas altocumulus, base 11,000 feet. The surface wind was a light westerly, and the runway in use was Runway 30. There were rain showers in the area and the runway was wet. The end of daylight was at approximately 1748 hours. When the pilot of VH-EXQ contacted Hobart Tower at approximately 1800 hours, he reported on descent to 7000 feet and 50km from the airport. As the aircraft proceeded, the Aerodrome Controller cleared it for further descent in stages, to provide vertical separation from a preceding aircraft. The only Instrument Landing System (ILS) approach at Hobart Airport was aligned with Runway 12 and the tailwind for a landing in that direction was only two or three knots. In order to expedite their arrivals, the Aerodrome Controller offered the pilot s of both approaching aircraft the option of a straight-in ILS approach to Runway 12 instead of a circling approach to the into-wind Runway 30. Both pilots accepted. At 1803 hours, the preceding aircraft was cleared for an ILS approach. The pilot of VH-EXQ was then advised to expect the same clearance but, to ensure continued separation from the other aircraft, was instructed to make one circuit of the holding pattern at Tea Tree Locator, a navigational radio aid west of the airport. The pilot misunderstood this instruction and, on reaching Tea Tree at about 1805 hours, he continued towards the airport. At 1807 hours, the Aerodrome Controller cleared VH-EXQ for an ILS approach. The pilot acknowledged this instruction in the normal manner and did not advise that he had already commenced the approach. In descending towards the airport the pilot had maintained a high airspeed of nearly 200 knots. From overhead Tea Tree he could see the lights of the preceding aircraft and endeavoured to reduce his speed so as to maintain separation. As a result, the aircraft was still very high as it approached the runway. This was noted by the Aerodrome Controller and, at 1810 hours, he asked the pilot whether he would be able to land on Runway 12 or would prefer to make an approach for Runway 30. The pilot chose the latter and was cleared to a right base leg for Runway 30.  The approach to Runway 12 was abandoned and the aircraft turned left onto a close right downwind leg for Runway 30. The landing gear, which had been extended, and the flaps, which had been set at 1/4 down, were not moved from these positions. The pilot reported that at some stage of the approach to Runway 30 he moved the throttles forward to increase power and maintain height. In response the aircraft yawed slightly to the right. Both propeller levers were then pushed fully forward, both throttles were fully opened and the mixture controls were checked in the full-rich position. The aircraft again swung to the right. Identifying this as evidence that the right engine had failed, and after checking from the tachometer that the right propeller was windmilling at about 1500 RPM, the pilot feathered the right propeller and selected the landing gear and flaps up. He believed that he carried out the feathering action at a height of about 300 feet and an airspeed of about 100 knots. At this time the aircraft was heading southwest, towards Single Hill (elevation 680 feet) on the shore of Frederick Henry Bay. The pilot reported that the aircraft would not maintain height or airspeed and he therefore turned left to avoid the hill. The wings were then held level until the aircraft touched down in the bay. After the aircraft turned right at a close base leg position, but then straightened on a southwesterly heading instead of continuing the turn onto final approach, the Aerodrome Controller asked the pilot to confirm that he was tracking for Runway 30. This transmission was not answered and the Aerodrome Controller again called the aircraft. The pilot then reported that he was having trouble with the right engine and he was going to feather. This transmission was made as the aircraft was approaching Single Hill, just before it turned left and descended from view. There were no further transmissions from the aircraft despite a number of calls by the Aerodrome Controller. The Distress Phase of Search and Rescue (SAR) procedures was declared at 1815 hours. The appropriate emergency services were alerted including a helicopter that was on standby for SAR operations. All six occupants were rescued while the aircraft sank and was lost. ", "probable_cause": "The probable cause of the accident was that, following an apparent loss of power by the right engine, the pilot did not operate the aircraft in the configuration and at the airspeed necessary for safe single-engine flight. The pilot's responses may have been Influenced by operating under Instrument Flight Rules conditions, for which he was not qualified. The cause of the reported loss of power by the right engine was not determined. The following defects were discovered:\r\n- General mechanical wear in left engine, \r\n- Left engine fuel injector system outside manufacturer's specifications, \r\n- Slight timing fault in one magneto on right engine. \n"}