{"url": "https://www.baaa-acro.com/crash/crash-antonov-12bp-near-yukhnov-96-killed", "date": "Jun 23, 1969 at 1452 LT", "type": "Antonov AN-12", "operator": "Soviet%20Union%20Air%20Force.gif", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Plain, Valley", "schedule": "Kėdainiai - Ryazan", "msn": "4 025 03", "yom": 1964, "flight_number": null, "city": "Yukhnov", "zone": "Kaluga oblast", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 91, "pax_fatalities": 91, "other_fatalities": 0, "total_fatalities": 96, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1218, "circumstances": "The crew was performing a flight from Kėdainiai to Ryazan with 91 soldiers and a crew of 5 returning to their base. The aircraft was in the third position of a three-aircraft formation. In the same region was cruising an Aeroflot Ilyushin II-14M registered CCCP-52018. En route from Moscow-Bykovo to Simferopol, Ukraine, via Chernigov and Kirovograd, this second aircraft was carrying 19 passengers and a crew of 5. En route, the crew of the II-14 encountered turbulences while cruising in poor weather conditions. He requested to ATC the permission to modify his altitude but this was denied due to heavy traffic. Despite he was uncleared, the captain started to climb in marginal weather conditions. Shortly later, at a height of 2,950 meters, the II-14M collided with the Soviet Air Force AN-12BP. The collision occurred when the top of the tail of the AN-12 struck the base of the fuselage of the II-14. Both aircraft went out of control, dove into the ground and crashed in a field, 800 meters from each other. All 120 occupants on both aircraft were killed.", "probable_cause": "It was determined that the captain of the civil aircraft (II-14) neglected elemental navigation rules in starting a descent while this was denied and refused by ATC due to heavy traffic."}