{"url": "https://www.baaa-acro.com/crash/crash-bac-111-200ab-chicklade-7-killed", "date": "Oct 22, 1963 at 1040 LT", "type": "BAc 111", "operator": "British%20Aircraft%20Corporation", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Wisley - Wisley", "msn": "001", "yom": 1963, "flight_number": null, "city": "Chicklade", "zone": "Wiltshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 5385, "captain_hours_type": 78, "copilot_hours": 9648, "copilot_hours_type": null, "aircraft_hours": 81, "circumstances": "The aircraft took off at 1017 hours GMT from runway 10, at Wisley Aerodrome on its fifty third test flight. It was to carry out stalling tests in all configurations with the centre of gravity at 0.38 SMC (standard mean chord), the furthest aft limit for which the aircraft had then been cleared. Based on the radio-telephony conversations recorded in the Wisley Tower and the flight recorders carried aboard the aircraft, the flight was reconstructed. Following take-off the aircraft climbed in visual meteorological conditions on a westerly heading to 17 000 ft while monitored by Wisley radar. At 1026 the co-pilot reported that they were about to commence tests at flight level 170. By 1035, four stalls had been completed with the undercarriage and flaps up. The co-pilot acknowledged a fix from Wisley at 1036 hours and nothing further was heard from the aircraft. The flaps were then lowered to to investigate the stalling characteristics in this configuration. The stall was initiated about two minutes after the last contact, when the aircraft was between 15 000 and 16 000 ft. Approach to the stall appears to have been normal. When attempting recovery, the elevators responded initially to the control movement but subsequently floated to the fully up position in spite of a large push force on the control column. The aircraft then descended in a substantially horizontal fore and aft attitude at about 180 ft/sec (54 meters per sec). During the descent it banked twice to the right and once to the left and at one stage the engines were opened up to full power. This action resulted in a large nose-up pitch which was followed by a pitch down when power was taken off. The aircraft then assumed the substantially horizontal attitude in which it made impact with the ground. The final portion of the flight was observed by numerous eye witnesses who commented on the low level of engine noise and a sharp report from the aircraft which was heard while it was in the air. The aircraft had approached from the southwest, in a stable stalled condition, and crashed at about 1040 hours in a flat attitude. Following impact, the aircraft moved forward about 70 ft and some 15 ft to the right before coming to rest. It exploded and caught fire. All seven crew members, four engineers and three test pilots, were killed. ", "probable_cause": "The nose-down pitching moment (elevator neutral) just beyond the stall was insufficient to rotate the aeroplane at the rate required to counteract the increase of incidence due to the g-break. During the fifth stall the angle of incidence reached a value at which the elevator effectiveness was insufficient to effect recovery. During a stalling test the aircraft entered a stable stalled condition recovery from which was impossible. "}