{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154-prague-66-killed", "date": "Feb 19, 1973 at 1006 LT", "type": "Tupolev TU-154", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Prague", "msn": "72A023", "yom": 1972, "flight_number": "SU141", "city": "Prague-Ruzyne", "zone": "Prague (Hlavní mesto Praha)", "country": "Czech Republic", "region": "Europe", "crew_on_board": 13, "crew_fatalities": 4, "pax_on_board": 87, "pax_fatalities": 62, "other_fatalities": 0, "total_fatalities": 66, "captain_hours": 12650, "captain_hours_type": 236, "copilot_hours": 14650, "copilot_hours_type": 247, "aircraft_hours": 459, "circumstances": "The aircraft took off at 0650 GMT on a scheduled flight Moscow - Prague. Over the territory of the USSR the flight proceeded at 10 000 m, and this altitude was increased over the Romanian People's Republic to 10 650 m. Over Warsaw the aircraft was cleared to descend to 9 400 m, and near the Czechoslovak frontier it was cleared again to 8 850. The frontier was crossed at 6 700 m, the crew complying with all instructions. At 0854 GMT the aircraft reported overhead OKX that it had descended from 7 200 m to 6 700 m. Prague ACC cleared it to continue descent to 2 450 m and tune to Rodnice (RCE) VOR. At 0856 GMT the aircraft was instructed to maintain a track which would keep it in the middle of the airway. At 0900 GMT the aircraft reported overhead Rodnice at 2 450 m and was instructed to change over to the approach frequency 121.4 MHz. The aircraft at once contacted approach control and was cleared to fly via MO until it intercepted the approach beacon, then to descend to 1 200 m and report when crossing 1 500 m. The crew complied with these instructions. At 0902 GMT the aircraft reported descending through 1 500 m on a 135O heading and was instructed to change over to the ATC radar frequency. On this frequency it was cleared to continue flying to the ILS approach beacon, was given priority to land on Runway 25 and instructed to descend to 500 m on QFE 730.1 mm. At 0904 GMT the aircraft was cleared to descend to 350 rn on QFE and was informed that it was 2 km off the course line. After 40 seconds the radar controller informed the aircraft that it was correctly aligned and 15 km from the aerodrome, and at 0905 GMT he instructed the aircraft to switch over to the TWR frequency. After changeover the aircraft reported to TWR that it was approaching to land. TWR cleared it to land on Runway 25 and reported a change in the wind direction and speed to 250' - 4 m/s. At 0906 GMT, at its own request, the aircraft was given runway braking coefficient 5 and again cleared to land. This data was acknowledged by the aircraft at 0906.30 GMT, and this was the last contact with it. The aircraft flew the correct heights and headings and did not report any defects or trouble on the ATC frequencies. The descent to land proceeded normally along the ILS glide path up to the vicinity of the \"L\" marker. Near this aid the aircraft suddenly ducked under the glide path, continued to descend at an average angle of 4.62° to the glide path and struck the ground with the nosewheel at a point 467 m before the threshold of Runway 25. The aircraft disintegrated on impact and was also destroyed by a post crash fire. Four stewardesses and 62 passengers were killed, 18 occupants were seriously injured and 16 were uninjured. ", "probable_cause": "Owing to the high degree of destruction and total disintegration of the aircraft in the crash and ensuing fire it was not possible to establish the precise cause of the accident. The influence of unexpected atmospheric turbulence during the aircraft's final approach cannot be entirely ruled out. "}