{"url": "https://www.baaa-acro.com/crash/crash-lockheed-pv-2-harpoon-blandburg-2-killed", "date": "Apr 20, 1997 at 1437 LT", "type": "Lockheed P-2 Harpoon", "operator": "Hirth Air Tankers", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Plain, Valley", "schedule": "Philipsburg - Philipsburg", "msn": "15-1156", "yom": 1944, "flight_number": "Tanker 38", "city": "Blandburg", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2000, "captain_hours_type": 170, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3497, "circumstances": "The pilot/owner of an air tanker was dispatched to drop a load of retardant on a fire burning up a valley wall. The pilot made radio contact with the firefighters on the ground, who requested that the pilot deliver the entire load on the first drop. A helicopter pilot who was dropping water on the fire positioned himself about a mile away to allow the air tanker to make its drop. The winds were from the northwest at 15 knots and gusting to 20 knots, and the helicopter pilot reported turbulence in the area. The helicopter pilot watched as the air tanker came from the northeast, overflew the fire, and made a descending counterclockwise turn. The airplane flew towards the fire parallel to the valley ridge, and the helicopter pilot observed the air tanker drop its retardant. During the drop, the airplane flew through smoke, and its right wing impacted trees on the upslope side of the valley. The airplane then rolled 90 degrees and descended into the steeply inclined wooded terrain. A review of the pilot's FAA medical records revealed that he lacked color vision. ", "probable_cause": "Pilot in command misjudged his maneuvering altitude. Factors to this accident were the mountainous terrain, windy conditions, turbulence in the area, and smoke. "}