{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-fresno-4-killed", "date": "Dec 14, 1994 at 1146 LT", "type": "Learjet 35", "operator": "Phoenix%20Air_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Fresno - Fresno", "msn": "35-239", "yom": 1979, "flight_number": null, "city": "Fresno", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 2, "total_fatalities": 4, "captain_hours": 7109, "captain_hours_type": 2747, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6673, "circumstances": "At about 1146 pst, Learjet 35A, N521PA, operating as a public use aircraft, crashed in Fresno, CA. Operating with call sign Dart 21, the flightcrew had declared an emergency inbound to Fresno Air Terminal due to engine fire indications. They flew the airplane toward a right base for their requested runway, but the airplane continued past the airport. The flightcrew was heard on tower frequency attempting to diagnose the emergency conditions and control the airplane until it crashed, with landing gear down, on an avenue in fresno. Both pilots were fatally injured. Twenty-one persons on the ground were injured, and 12 apartment units in 2 buildings were destroyed or substantially damaged by impact or fire. Investigation revealed that special mission wiring was not installed properly, leading to a lack of overload current protection. The in-flight fire most likely originated with a short of the special mission power supply wires in an area unprotected by current limiters. The fire resulted in false engine fire warning indications to the pilots that led them to a shutdown of the left engine. An intense fire burned through the aft engine support beam, damaging the airplane structure and systems in the aft fuselage and may have precluded a successful emergency landing.", "probable_cause": "The accident was the consequence of the following factors:\r\n- Improperly installed electrical wiring for special mission operations that led to an in-flight fire that caused airplane systems and structural damage and subsequent airplane control difficulties,\r\n- Improper maintenance and inspection procedures followed by the operator,\r\n- Inadequate oversight and approval of the maintenance and inspection practice by the operator in the installation of the special mission systems."}