{"url": "https://www.baaa-acro.com/crash/crash-rockwell-sabreliner-75a-iron-wood-2-killed", "date": "Aug 14, 2000 at 1822 LT", "type": "Rockwell Sabreliner 75", "operator": "Colonel's", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Brainerd – Flint", "msn": "380-27", "yom": 1975, "flight_number": null, "city": "Iron Wood", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 13037, "captain_hours_type": 2560, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7185, "circumstances": "The airplane impacted heavily wooded terrain after experiencing a dual engine failure due to a reported lightning strike. The pilot received a weather brief that included information concerning a Convective Sigmet and a Severe Weather Watch. The weather briefer informed the pilot that a route to the southeast would keep the flight out of the heavy weather, and that, \"... you'll get clobbered if you go due east.\" After departure, the pilot requested a turn to the northeast to stay clear of weather. While in the climb, the flight was advised of a Weather Watch that covered the area of their flight. The CVR revealed that Continuous Ignition was not selected prior to encountering turbulence. About 23 minutes after takeoff, the airplane was climbing at about 30,800 feet msl when the pilot reported a dual engine failure due to a lightning strike. The CVR indicated one engine quit and the second quit about two seconds later. The copilot established a 170 kts descent airspeed for \"best glide.\" The airplane was vectored near a level 5 thunderstorm during the emergency descent. Two air starts were attempted when the airplane's altitude was outside of the air start envelope. Two more air starts were attempted within the air start envelope but were unsuccessful. The minimum airspeed for an air restart is 160 kts and the maximum speed for air start is 358 kts. The CVR indicated that the pilots did not call for the airplane's checklist, and no challenge and response checklists were used during the emergency descent. The CVR indicated the pilots did not discuss load shedding any of the electrical components on the airplane. The CVR indicated the hydraulic system cycled twice during the emergency descent and the landing gear was lowered using the hydraulic system during descent. During the descent the pilots reported they had lost use of their navigation equipment. The airplane impacted the terrain located about 166 nautical miles from the departure airport on a bearing of 083 degrees. No preexisting engines or airframe anomalies were found. ", "probable_cause": "The pilot's improper in-flight decision, the pilot's continued flight into known adverse weather, the pilot's failure to turn on the continuous ignition in turbulence, and the pilot's failure to follow the procedures for an airstart. Factors included the thunderstorms, the lightning strike, and the woods. "}