{"url": "https://www.baaa-acro.com/crash/crash-bae-3101-jetstream-31-springfield-3-killed", "date": "Feb 9, 1988 at 1500 LT", "type": "BAe Jetstream 31", "operator": "Jetstream%20International%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dayton - Springfield", "msn": "623", "yom": 1983, "flight_number": null, "city": "Springfield", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 8670, "captain_hours_type": 1030, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8219, "circumstances": "A company designated instructor and two f/o trainees were conducting a far 135 training flight. The third approach was terminated with a go-around initiated over the runway threshold at about 50 feet. After climbing to about 150 feet, the aircraft was observed to oscillate in yaw, followed by pitch, and then roll to the right. The aircraft impacted in a near-vertical descent attitude. The investigation revealed that the right engine was operating, but at reduced power. The left engine was at full power. There was no indication of aircraft system malfunction or failure. Company pilots indicated that the captain had a history of demeaning cockpit behavior and roughness with students. The f/o, was small in stature and had 100 hours of multi-engine time and no turboprop time. Company pilots reported the f/o trainee was consistently behind the aircraft in prior flights. Examination of the aircraft revealed the flaps in the retracted position contrary to aircraft handbook. Company pilots further indicated the captain had history of requiring low altitude 1-engine go arounds and delaying offers of assistance to students. All three crew members were killed.  ", "probable_cause": "Occurrence #1: loss of control - in flight\r\nPhase of operation: go-around (vfr)\r\nFindings\r\n1. (f) emergency procedure - simulated - pilot in command (cfi)\r\n2. (c) go-around - delayed - pilot in command (cfi)\r\n3. (c) aircraft control - not maintained - dual student\r\n4. (f) lack of total experience in type of aircraft - dual student\r\n5. Lack of familiarity with aircraft - dual student\r\n6. Excessive workload (task overload) - dual student\r\n7. (f) remedial action - delayed - pilot in command (cfi)\r\n8. (c) supervision - inadequate - pilot in command (cfi)\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled"}