{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-punta-islita-12-killed", "date": "Dec 31, 2017 at 1216 LT", "type": "Cessna 208B Grand Caravan", "operator": "NatureAir", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Punta Islita – San José", "msn": "208B-0900", "yom": 2001, "flight_number": null, "city": "Punta Islita", "zone": "Guanacaste (North Pacific)", "country": "Costa Rica", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 14508, "captain_hours_type": 11587, "copilot_hours": 453, "copilot_hours_type": null, "aircraft_hours": 12073, "circumstances": "The two pilots were conducting a commercial charter flight to take 10 passengers to an international airport for connecting flights. The flight departed a nontower-controlled airport that was in a valley surrounded on all sides by rising terrain, with the exception of the area beyond the departure end of runway 21, which led directly toward the Pacific Ocean. The accident airplane was the second of a flight of two; the first airplane departed runway 3 about 15 minutes before the accident airplane and made an immediate right turn to the east/southeast after takeoff, following a pass in the hills over lower terrain that provided time for the airplane to climb over the mountains. Both a witness and surveillance video footage from the airport indicated that, 15 minutes later, the accident airplane also departed from runway 3 but instead continued on runway heading, then entered a left turn and descended into terrain. Analysis of the video determined that the airplane reached a maximum bank angle of about 75° and an airspeed below the airplane's published aerodynamic stall speed before impact. Examination of the airplane was limited due to impact and postcrash fire damage; however, no defects consistent with a preimpact failure or malfunction were observed, and the engine exhibited signatures consistent with production of power during impact. The captain was appropriately rated and had extensive experience in the accident airplane make and model. He had been employed by the accident operator for about a year in 2006 and had recently been re-hired by the operator; however, records provided by the operator did not indicate that he had completed all of the training and check flights required by the operator's General Operations Manual (GOM). The first officer was appropriately rated but had little experience in the accident airplane. The GOM also stated that pilots would receive additional, airport-specific training before operating to or from airports with special characteristics; however, the operator provided no listing of such airports, including the airport from which the accident flight departed. The pilots' experience at the departure airport could not be determined. It is possible the psychiatric diagnoses in 2011 were correct and the pilot suffered from a number of conditions which can cause a variety of symptoms. However, given the extremely limited information, what his symptoms were around the time of the accident, whether they were being addressed or effectively treated, and what his mental state was at the time could not be determined from the available information. Therefore, whether or not the pilot's medical or psychological conditions or their treatment played a role in the accident circumstances could not be determined by this investigation. There were no weather reporting facilities in the vicinity of the airport. Although the airport was equipped with two frames for windsocks, no windsocks were installed at the time of the accident to aid pilots in determining wind direction and intensity. Although a takeoff from runway 21 afforded the most favorable terrain since the airplane would fly over lower terrain to the ocean, it is possible that a significant enough tailwind existed for runway 21 that the pilots believed the airplane's maximum tailwind takeoff limitation may be exceeded and chose to depart from runway 3 in the absence of any information regarding the wind velocity. Performance calculations showed that the airplane would have been able to take off with up to a 10-kt tailwind, which was the manufacturer limitation for tailwind takeoffs. The witness who saw the accident reported that he spoke with the pilots of both airplanes before the flights departed and that the pilots acknowledged the need to use the eastern pass in order to clear terrain when departing from runway 3. The reason that the flight crew of the accident airplane failed to use this path after takeoff could not be determined. It is likely that, after entering the valley ahead of the runway, with rising terrain and peaks that likely exceeded the climb capability of the airplane, they attempted to execute a left turn to exit the valley toward lower terrain. During the steep turn, the pilots failed to maintain adequate airspeed and exceeded the airplane's critical angle of attack, which resulted in an aerodynamic stall and impact with terrain. Performance calculations using weights that would allow the airplane to operate within manufacturer weight and balance limitations at the time of the accident indicated that it was unlikely that the airplane would have had sufficient climb performance to clear the terrain north of the airport. However, the airplane would likely have had sufficient climb performance to clear terrain east of the airport had the crew performed a right turn immediately after takeoff like the previous airplane.", "probable_cause": "The flight crew's failure to maintain airspeed while maneuvering to exit an area of rising terrain, which resulted in an exceedance of the airplane's critical angle of attack and an aerodynamic stall. Contributing to the accident was the flight crew's decision to continue the takeoff toward rising terrain that likely exceeded the airplane's climb capability, the lack of adequate weather reporting available for wind determination, and the lack of documented training for an airport requiring a non-standard departure."}