{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-perth", "date": "Apr 9, 2007 at 1703 LT", "type": "Beechcraft 200 Super King Air", "operator": "Network%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Perth - Mount Hale", "msn": "BB-73", "yom": 1975, "flight_number": null, "city": "Perth", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 9 April 2007, at 1703 Western Standard Time (WST), the main landing gear from a Beech Super King Air 200 aircraft, registered VH-SGT, collapsed on landing at Perth airport. Approximately two hours earlier, the aircraft was chartered to fly from Perth to Mount Hale, WA when shortly after takeoff from Perth the aircraft experienced a malfunction of the landing gear system. The main wheels and nose gear had become jammed and were unable to fully retract when selected up by the pilot. The pilot completed the emergency checklist actions contained in the Aircraft Flight Manual, but was unable to retract or extend the gear using either the automated control or the manual emergency system. The pilot then requested assistance from a passenger to operate the manual emergency extension system. The landing gear remained jammed despite the additional force applied to the lever from the passenger. The pilot contacted air traffic services and requested further assistance from company engineering personnel to visually assess the extension state of the landing gear. Two aerodrome passes were completed throughout the troubleshooting exercise and the pilot remained in radio contact with both groups during this phase. Following the flyovers and after holding over Rottnest Island at 5,000 ft for a period of approximately two hours, the pilot flew the King Air back to Perth airport. With the gear still jammed in the partially retracted position, both the left and right main landing gear assemblies collapsed after the aircraft touched down on Runway 24. The aircraft was substantially damaged as a result of the collapse (Figure 1). The airport Rescue and Fire Fighting (RFF) services and other relevant agencies had been alerted and were waiting in response when the King Air landed. No injuries were sustained by the pilot or any of the nine passengers on board.", "probable_cause": "From the evidence available, the investigation revealed that two major system components had failed which could have prevented the Beechcraft Super King Air 200 landing gear from properly retracting after takeoff. The following findings with respect to those failed landing gear system components should not be read as apportioning blame or liability to any particular organisation or individual. \r\nContributing safety factors:\r\n• The left torque tube support bearing had not been lubricated and had seized due to the accumulation of dirt and grit contaminants that had migrated from the external service environment and into the bearing.\r\n• The geared components within the right main landing gear actuator prematurely failed.\r\nOther safety factors:\r\n• The aircraft manufacturer’s maintenance manual contained insufficient instruction or guidance for operators and maintainers of Super King Air 200 aircraft for the lubrication of the landing gear torque tube support bearings.\r\nOther key findings:\r\n• Both component assemblies were integral to the function and normal operation of the Super King Air 200 mechanical landing gear system. A break down of either component assembly would have prevented any attempt by the pilot to retract or extend the aircraft’s main landing gear. However, while either failure could have produced the landing gear difficulties sustained, the investigation was not able to determine which mechanism was the principal contributor to the event.\r\n• The investigation was unable to conclusively establish why the geared components within the right main landing gear actuator had prematurely failed.\r\n• The lower thrust bearing within the right main landing gear actuator had been correctly installed."}