{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-33-rio-de-janeiro-15-killed", "date": "Aug 20, 1962 at 2208 LT", "type": "Douglas DC-8", "operator": "Panair-do-Brasil-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Buenos Aires – Rio de Janeiro – Lisbonne – Paris – Londres", "msn": "45273", "yom": 1960, "flight_number": "PB026", "city": "Rio de Janeiro-Galeão", "zone": "Rio de Janeiro", "country": "Brazil", "region": "South America", "crew_on_board": 11, "crew_fatalities": 1, "pax_on_board": 94, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": 13504, "captain_hours_type": 812, "copilot_hours": 14643, "copilot_hours_type": 223, "aircraft_hours": null, "circumstances": "The aircraft was on a scheduled international flight from Buenos Aires to Rio de Janeiro (Galeao Airport) and Lisbon. It arrived at Galeao Airport following an uneventful flight. Another crew took over for the last segment of the flight. The takeoff run began at 2303 hours GMT from runway 14. The aircraft's acceleration appeared to be normal. The pilot-in-command declared that, at a speed between 100 and 135 kt (V1), he noted that the control column was too far back and pushed it forward. At this point the co-pilot released the controls, which is normally done when the aircraft reaches V1. It is believed that in fact an attempt to rotate the aircraft was made around 132 kt. The aircraft continued to accelerate normally. The co-pilot announced 148 kt, the rotation speed (VR), and the pilot pulled back on the control column. However, the aircraft did not respond, so he pushed it forward again. No indication of this rotation attempt was revealed by the flight recorder reading. He and the co-pilot then pulled back on the control column, however, the nose of the aircraft did not rotate since the pilot had already reduced power 14 seconds after reaching VR. Also, the tape reading indicated that the brakes were used for 5 seconds prior to any power reduction. The first marks of braking were found approximately 2300 m from the threshold. The pilot realized that the aircraft could not be stopped on the remaining portion of the runway so he turned the aircraft off the runway to the right and fully reduced power. The brakes were applied but not reverse thrust. Heavy and steady braking marks started 2600 m from the threshold. Of his own accord, the co-pilot applied full power for reversion and tried to operate the spoilers but could not do so because of the bumps The right wing lowered, dragging engines No. 3 and 4. The left wheels of the landing gear sank into the sand, and engines No. 1 and 2 also began to drag. All four engines lost their ejectors and reversion cones, causing the aircraft to accelerate. It continued moving at a high speed, hit the airport wall, crossed the adjoining highway, lost engines No. 1 and 2 and the left landing gear and finally came to rest in the sea. 50 m from shore. It drifted 100 m while floating and then sank to a depth of 8 m. There were no lights on board the aircraft when it came to a stop as the automatic emergency lighting system did not function. One cabin attendant used one of the two flashlights available. The darkness increased the panic and confusion. The passengers could not use the main door as an exit because it would open into the sea. They did not know where the emergency exits were. However, the exits were then opened and most of the passengers left the aircraft on the starboard side. The fact that the lour exits were all in the central part of the fuselage hampered the evacuation as the number of passengers (94) was considerable. The crew left the aircraft via the cockpit windows. No instructions had been given on emergency procedures and therefore the passengers and most of the crew did not take their life jackets with them when leaving the aircraft. Although the aircraft was equipped with six life rafts no crew member tried to use them. The aircraft drifted 330 feet downstream and submerged in 25 minutes. A crew member and 14 passengers were killed, 46 occupants were wounded and 44 were uninjured. ", "probable_cause": "The take-off was discontinued when the aircraft would not rotate at a speed of 175 kt because the stabilizer setting had switched from 3° nose-up to 1-3/4° nose-down. Contributing factors to the accident were the delayed decision of the pilot to abort the take-off and the incorrect compliance with the standard procedures used for emergency stopping."}