{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-87-milan-114-killed", "date": "Oct 8, 2001 at 0810 LT", "type": "McDonnell Douglas MD-87", "operator": "SAS.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Milan - Copenhagen", "msn": "53009", "yom": 1991, "flight_number": "SK686", "city": "Milan-Linate", "zone": "Lombardy", "country": "Italy", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 104, "pax_fatalities": 104, "other_fatalities": 0, "total_fatalities": 110, "captain_hours": 5842, "captain_hours_type": 232, "copilot_hours": 4355, "copilot_hours_type": 1978, "aircraft_hours": 25573, "circumstances": "A brand new Cessna 525A CitationJet 2, D-IEVX, arrived at Milan-Linate following a flight from Köln. The Cessna was to carry out a return flight to Paris-Le Bourget, carrying two pilots, a Cessna sales manager and a prospective customer. The plane arrived at 06:59 and was taxied to the General aviation apron, also known as 'West apron'. It was a foggy morning at Milan and one of the passenger flights parked on the North apron was SAS MD-87 \"Lage Viking\" which was being prepared for flight SK686 to Copenhagen, scheduled to depart at 07:35. At 07:41, the pilot of the MD-87 contacted Linate Ground Control for his engine start clearance, as the boarding of 104 passengers had been completed. The Ground controller cleared the pilot to start engines and advised that the slot time for takeoff of the flight was at 08:16. Thirteen minutes later flight 686 was cleared to taxi to runway 36R: \"Scandinavian 686 taxi to the holding position Cat III, QNH 1013 and please call me back entering the main taxiway.\" A few minutes later, the Cessna pilot requested permission to start the engines. The ground controller then gave start-up clearance. The ground controller then requested flight 686 to contact the Tower controller. From this moment on the crew of the MD-87 and the crew of the Cessna were tuned on two different radio frequencies. At 08:05 the pilots of the Cessna received taxi clearance: \"Delta Victor Xray taxi north via Romeo 5, QNH 1013, call me back at the stop bar of the ... main runway extension.\" The pilot acknowledged by saying: \"Roger via Romeo 5 and ... 1013, and call you back before reaching main runway.\" The Cessna started to taxi from the General Aviation parking position, following the yellow taxi line. After reaching the position where the yellow taxi line splits into two diverging directions, the pilot erroneously took the taxi line to right and entered taxiway R6. At 08:09 the Ground controller cleared the Cessna to continue its taxi on the North apron. At the same time the Tower controller cleared the MD-87 for takeoff: \"...Scandinavian 686 Linate, clear for take off 36, the wind is calm report rolling, when airborne squawk ident.\" The pilot advanced the throttles and acknowledged the clearance: \"Clear for takeoff 36 at when...airborne squawk ident and we are rolling, Scandinavian 686.\" When the MD-87 was speeding down the runway, the Cessna crossed the runway holding sign and entered the active runway 18L/36R. At 08.10:21 the nose landing gear of the MD-87 had left the ground and main gears were extending the shock absorbers but the main wheels were still on the ground at an airspeed of 146 knots (270,5 km/h). At that moment the MD-87 crew probably saw a glimpse of the Cessna through the fog and reacted with additional large nose-up elevator. At that moment the MD-87 collided with the CitationJet. The right wing of the MD-87 sustained damage at the leading edge and the right hand main landing gear leg broke off. It damaged the right flap and struck the no. 2 engine which then separated from the pylon. The pilot of the MD-87 gradually advanced the throttles and then the aircraft was airborne for a total of 12 seconds, reaching an estimated height of about 35 feet (11 meters). The left hand engine suffered a noticeable thrust reduction as a result of debris ingestion, which became insufficient to sustain flight. The airspeed had increased up to 166 knots (307,6 km/h), but the MD-87 descended abruptly making contact with the runway with the left hand maingear, the truncated right hand maingear leg and the tip of the right hand wing. Prior to touch down the pilot reduced engine thrust and after ground contact the engine reverse levers were activated and deployed (on the left hand engine only). Maximum available reverse thrust was selected and the brakes applied. The plane skidded past the grass overrun area, across a service road, crashing sideways into a baggage handling building, which partly collapsed. This building was located 20 m/67 feet to the right of the runway, and 460 m/1500 feet from the runway end.", "probable_cause": "After analysis of evidence available and information gathered, it can be assumed that the immediate cause for the accident has been the runway incursion in the active runway by the Cessna. The obvious consideration is that the human factor related action of the Cessna crew - during low visibility conditions - must be weighted against the scenario that allowed the course of events that led to the fatal collision; equally it can be stated that the system in place at Milano Linate airport was not geared to trap misunderstandings, let alone inadequate procedures, blatant human errors and faulty airport layout.\r\nThe following list highlights immediate and systemic causes that led to the accident:\r\n- The visibility was low, between 50 and 100 meters;\r\n- The traffic volume was high;\r\n- The lack of adequate visual aids;\r\n- The Cessna crew used the wrong taxiway and entered the runway without specific clearance;\r\n- The failure to check the Cessna crew qualification;\r\n- The nature of the flight might have exerted a certain pressure on the Cessna crew to commence the flight despite the prevailing weather conditions;\r\n- The Cessna crew was not aided properly with correct publications (AIP Italy - Jeppesen), lights (red bar lights and taxiway lights), markings (in deformity with standard format and unpublished, S4) and signs (non existing, TWY R6) to enhance their situational awareness;\r\n- Official documentation failing to report the presence of unpublished markings (S4, S5, etc) that were unknown to air traffic controllers, thus preventing the ATC controller from interpreting the unambiguous information from the Cessna crew, a position report mentioning S4;\r\n- Operational procedures allowing high traffic volume (high number of ground movements) in weather conditions as were current the day of the accident (reduced visibility) and in the absence of technical aids;\r\n- Radio communications were not performed using standard phraseology (read back) or were not consistently adhered to (resulting in untraced misunderstandings in relevant radio communications);\r\n- Radio communications were performed in Italian and English language;\r\n- Air Traffic Control (ATC) personnel did not realize that Cessna was on taxiway R6;\r\n- The ground controller issued a taxi clearance towards Main apron although the reported position S4 did not have any meaning to him;\r\n- Instructions, training and the prevailing environmental situation prevented the ATC personnel from having full control over the aircraft movements on ground.\r\nFurthermore:\r\n- The aerodrome standard did not comply with ICAO Annex 14; required markings, lights and signs did either not exist (TWY R6) or were in dismal order and were hard to recognize especially under low visibility conditions (R5-R6), other markings were unknown to operators (S4);\r\n- No functional Safety Management System was in operation;\r\n- The competence maintenance and requirements for recent experience for ATC personnel did not fully comply with ICAO Annex 1;\r\n- The LVO implementation by ENAV (DOP 2/97) did not conform with the requirements provided in the corresponding and referenced ICAO DOC 4976.\r\nThe combined effect of these factors, contemporaneously present on the 8th of October 2001 at Milano Linate, have neutralized any possible error corrective action and therefore allowed the accident."}