{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-zifta-4-killed", "date": "Jan 15, 1968 at 0754 LT", "type": "Douglas DC-3", "operator": "United-Arab-Airlines-2", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Desert", "schedule": "Cairo - Beirut", "msn": null, "yom": null, "flight_number": null, "city": "Zifta", "zone": "Gharbia", "country": "Egypt", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 5482, "captain_hours_type": 655, "copilot_hours": 3409, "copilot_hours_type": 543, "aircraft_hours": null, "circumstances": "The aircraft was to perform a non-scheduled international cargo flight from Cairo to Beirut. Before departure the operator's chief of the ground operations shift informed the pilot-in-command of the aircraft that bad weather was prevailing both on the route Cairo to Beirut and at Beirut Airport, and that the weather conditions had been confirmed by the crew of another aircraft who had arrived from Beirut at 0200 hours local time. The pilot-in-command then went to the weather office and was again informed that the weather en route was very bad with low and medium altitude clouds, including some cumulonimbus extending from 550 m to 8 500 m, and that moderate to severe icing and turbulence within these clouds were highly probable. He was also informed that a SIGMET had been issued at 0115 hours (see 1.7 below). Back at the operator's ground operations office he obtained once more all necessary weather information, including copies of two SIGMETS issued by Cairo and Beirut respectively and decided to delay his departure until 0700 hours expecting some weather improvement. Although the aircraft had no de-icing equipment, it departed Cairo at 0721 hours and at 0735 hours the crew reported at EL 70 to Cairo Approach. Eight minutes later they reported over Zif ta Beacon at the same flight level and were then instructed by Cairo Approach to contact Area Control. At 0745 hours they contacted and informed Cairo Control that they would return to Cairo due to icing. Shortly thereafter they repeated that message adding that there was some ice accretion on the aircraft. This was the last message from the aircraft. At 1020 hours Cairo ACC received a message that the aircraft had crashed 5 km SE of A1 Mahalla-Al Kobra. All four occupants were killed. ", "probable_cause": "The accident was due to ice accretion on the lifting surfaces of the aircraft accompanied by moderate to severe turbulence, which resulted in loss of aircraft control by the pilot. When he tried to regain control over the aircraft the lifting surfaces were loaded beyond the approved design limits, which brought about the disintegration of main parts of the aircraft in the air, and its subsequent impact with the ground and the death of all members of the crew. Some of the contributing factors were as follows: \r\n- The load of the aircraft exceeded the approved load by about 500 kg,\r\n- The probable shifting of the cargo and the resulting effect on the aircraft's centre of gravity."}