{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-7cf-luton", "date": "Mar 3, 1974 at 0108 LT", "type": "Douglas DC-7", "operator": "Aer%20Turas", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dublin - Luton", "msn": "45471/965", "yom": 1958, "flight_number": null, "city": "Luton", "zone": "Bedfordshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3334, "captain_hours_type": 1185, "copilot_hours": 1537, "copilot_hours_type": 144, "aircraft_hours": 27838, "circumstances": "The aircraft was operating a charter flight from Dublin to Luton, loaded with newspapers and equipment necessary for the conveyance of horses back to Dublin. The passengers were six grooms who were intended to accompany the horses on the return flight. During the uneventful flight from Dublin to the Luton area the pilot received a surface wind forecast for Luton of 300/06 knots. At midnight contact was established with Luton Approach. The pilot was given the Luton landing conditions as: 'QNH 1013.5, CAVOK, (ceiling and visibility OK) surface wind practically calm' and asked if he would accept radar positioning for a visual approach to runway 08, to which he agreed. The radar positioning was terminated at 00.04 hrs when the aircraft was cleared to Luton tower frequency with 'Six track miles to run' and the runway in sight. When the pilot contacted Luton Tower at 00.05 hrs, he was cleared to land on runway 08 and given the surface wind as 300 degrees 04 knots. He acknowledged this last transmission and there was no further communication with the aircraft. The evidence indicates that the approach path and speed were normal. The commander did not notice the Indicated Air Speed (IAS) immediately before touchdown but recalled that the initial approach was made at approximately 130 knots IAS reducing to the target threshold speed of 115 knots as the flaps extended. The aircraft touched down at an IAS of 105 knots. The commander was of the opinion that, despite a tendency to float, the aircraft touched down at the correct distance down the runway, and, as soon as it had done so, he called for reverse thrust immediately the aircraft was on the runway. On receiving the commander's order, the engineer selected reverse thrust on numbers 2 and 3 engines followed by numbers 1 and 4 whilst monitoring the engine instruments. The commander was familiar with this method of selecting reverse which was the technique normally used in the company. The flight engineer did not see the blue warning lights illuminate to indicate that the propellers were moving into reverse pitch, he therefore selected Nos 1 and 4 propellers to forward pitch, with throttles closed, in case the reason for the malfunction was an electrical overload due to operation of all four feathering/reversing pumps at low engine rpm. The commander had also noticed that the blue lights had not illuminated and, seeing that Nos 1 and 4 propellers were selected to forward pitch, called 'reverse all engines'. In response to his order the engineer made the required selection and all four throttle levers were seen to be in the reverse quadrant by the operating crew, although no blue lights were noted. The aircraft was not decelerating during this period and that no reverse thrust was achieved. The commander ordered the engineer to 'put them in the middle', thus to cancel the reverse thrust selections. There were two short periods of engine acceleration during the landing roll. The commander assisted by the first officer applied the toe brakes, assessed them to be ineffective and, as the aircraft was still not decelerating, applied the emergency pneumatic brakes by turning the operating handle to 'on'. The commander did not notice any deceleration and, consequently, did not follow the procedure of selecting them alternatively to 'hold' and to 'on'. All four main wheels locked, the tyres burst and further retardation from the brakes was lost. Sparks and smoke were seen emanating from the area of the undercarriage when the aircraft approached the end of the runway. When it became apparent that the aircraft would overrun the runway the commander called to have the 'switches' put to 'OFF'. The flight engineer selected the ignition switches off before the aircraft left the end of the runway and ploughed across the overrun area. It was still travelling fast enough to follow a trajectory off the top of the bank at the end of the runway leaving no wheel marks down the slope. The aircraft stopped in soft ground 90 metres from the end of the runway at the foot of the bank having demolished part of the aerodrome fence and some of the approach lights. All persons on board abandoned the aircraft without delay. As the flight engineer was leaving via the right hand side crew door, he noticed a small fire under the number 3 engine. He returned to the cockpit, pulled the firewall shut-off controls and discharged a fire extinguisher to all four engines.", "probable_cause": "Failure to achieve reverse thrust after touchdown and an inadvertent application of forward thrust during the landing roll. The resulting overrun was aggravated by the operation of the emergency pneumatic brakes which resulted in the bursting of all four main wheel tires with consequent loss of braking capacity."}