{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-locust-grove-6-killed", "date": "Nov 18, 1988 at 1833 LT", "type": "Beechcraft 90 King Air", "operator": "M & L Aircraft", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Orange - Locust Grove", "msn": "LW-92", "yom": 1974, "flight_number": null, "city": "Locust Grove", "zone": "Arkansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 2300, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6964, "circumstances": "Before and during flight, the pilot received info about thunderstorms in the vicinity of the destination airport. During arrival, the pilot was given the Little Rock altimeter setting. He was cleared to descend and cross the NDB (initial approach fix) at or above 3,100 feet msl, then was cleared for the approach. About 7-1/2 minutes later, the pilot declared a missed approach and requested another. He acknowledged clearance for the 2nd approach, then there was no further radio contact with the aircraft. Subsequently, the aircraft hit trees and crashed on high (mtn) terrain about 6-1/2 miles west-southwest of the airport. Impact occurred while the aircraft was on an easterly heading at about 1,195 feet msl. Minimum altitude for the approach was 2,300 feet until established inbound from the NDB, then when using a Little Rock altimeter setting, a minimum altitude of 1,860 feet was required until passing the baiks fan marker, 4.6 miles from the runway. A pilot, who was waiting to depart the airport, estimated there was a variable overcast at 300 feet to 700 feet and the visibility was 1 to 2 miles with rain. The airport elevation was 464 feet. The aircraft was destroyed and all six occupants were killed.  ", "probable_cause": "The pilot's failure to maintain obstacle clearance altitude and exceeding the minimum descent altitude published in the approach procedure. \r\nOccurrence #1: in flight collision with object\r\nPhase of operation: approach - iaf to faf/outer marker (ifr)\r\nFindings\r\n1. (c) ifr procedure - not followed - pilot in command\r\n2. (f) light condition - dark night\r\n3. (f) weather condition - low ceiling\r\n4. (f) weather condition - fog\r\n5. Weather condition - rain\r\n6. (f) terrain condition - mountainous/hilly\r\n7. Object - tree(s)\r\n8. (c) proper altitude - not maintained - pilot in command\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled"}