{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-e20-recife-16-killed", "date": "Jul 13, 2011 at 0654 LT", "type": "Let L-410", "operator": "NOAR%20Linhas%20Aereas", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Recife - Natal - Mossoró", "msn": "92 27 22", "yom": 1992, "flight_number": "NRA4896", "city": "Recife-Guararapes", "zone": "Pernambuco", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 14, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": 15457, "captain_hours_type": 957, "copilot_hours": 2404, "copilot_hours_type": 404, "aircraft_hours": 2126, "circumstances": "At 0650 local time, the aircraft departed from Recife-Guararapes Airport runway 18, destined for Natal, carrying 14passengers and two crewmembers on a regular public transportation flight. During the takeoff, after the aircraft passed over the departure end of the runway, the copilot informed that they would return for landing, preferably on runway 36, and requested a clear runway. The aircraft made a deviation to the left, out of the trajectory, passed over the coastline, and, then, at an altitude of approximately 400ft, started a turn to the right over the sea. After about 90º of turn, upon getting close to the coast line, the aircraft reverted the turn to the left, going farther away from the coast line. After a turn of approximately 270º, it leveled the wings and headed for the airport area. The copilot informed, while the aircraft was still over the sea, that they would make an emergency landing on the beach. Witnesses reported that, as the aircraft was crossing over the coast line, the  left propeller seemed to be feathered and turning loosely. At 0654 local time, the aircraft crashed into the ground in an area without buildings, between Boa Viagem Avenue and Visconde de Jequitinhonha Avenue, at a distance of 1,740 meters from the runway 36 threshold. A raging post-impact fire occurred and all 16 occupants were killed. ", "probable_cause": "Human Factors\r\nMedical Aspect\r\n- Anxiety\r\nThe perception of danger especially by the first officer affected the communication between the pilots and may have inhibited a more assertive attitude, which could have led to an emergency landing on the beach, minimizing the consequences of the accident.\r\nPsychological Aspect\r\n- Attitude\r\nOperational decisions during the emergency may have resulted from the high confidence level, that the captain had acquired in years of flying and experience in aviation, as well as the captain's resistance to accept opinions different to his own.\r\n- Emotional state\r\nAccording to CVR recordings there was a high level of anxiety and tension even before the abnormal situation. These components may have influenced the judgment of conditions affecting the operation of the aircraft.\r\n- Decision making \r\nThe persistence to land on runway 36 during the emergency, even though the first officer recognized the conditions no longer permitted to reach the airport, reflects misjudgment of operational information present at the time.\r\n- Signs of stress\r\nThe unexpected emergency at takeoff and the lack of preparation for dealing with it may have invoked a level of stress with the crew, that negatively affected the operational response.\r\nPsychosocial Information\r\n- Interpersonal relations\r\nThe historical differences between the two pilots possibly hindered the exchange of information and created a barrier to deal with the adverse situation.\r\n- Dynamic team\r\nThe present diverging intentions of how to proceed clearly show cooperation and management issues in the cockpit. This prevented the choice of best alternative to achieve a safe emergency landing when there were no options left to reach the airport.\r\n- Company Culture\r\nThe company was informally divided into two groups, whose interaction was impaired. It is possible that this problem of interaction continued into the cockpit management during the in flight emergency, with one pilot belonging to one and the other to the other group.\r\nOrganizational Information\r\n- Education and Training\r\nDeficiencies of training provided by the operator affected the performance of the crew, who had not been sufficiently prepared for the safe conduct of flight in case of emergency. \r\n- Organizational culture\r\nThe actions taken by the company indicate informality, which resulted in incomplete operational training and attitudes that endangered the safety.\r\nOperational Aspects\r\nAccording to data from the flight recorder the rudder pedal inputs were inadequate to provide sufficient rudder deflection in order to compensate for asymmetric engine power.\r\nThe values of side slip reached as result of inadequate rudder pedal inputs penalized the performance of the aircraft preventing further climb or even maintaining altitude.\r\nIn the final phase of the flight, despite the airspeed decaying below Vmca, despite continuous stall warnings and despite calls by the first officer to not hold the nose up in order to not stall the captain continued pitch up control inputs until the aircraft reached 18 degrees nose up attitude and entered stall.\r\n- Crew Coordination\r\nThe delay in retracting the landing gear after the first instruction by the captain, the instruction of the captain to feather the propeller when the propeller had already been feathered as well as the first officer's request the captain should initiate the turn back when the aircraft was already turning are indicative that the crew tasks and actions were not coordinated.\r\nEmergency procedures provided in checklists were not executed and there was no consensus in the final moments of the flight, whether the best choice (least critical option) was to return to the runway or land on the beach.\r\n- Oblivion\r\nIt is possible in response to the emergency and influenced by anxiety, that the crew may have forgotten to continue into the 3rd segment of the procedure provided for engine failure on takeoff at or above V1 while trying to return to the airfield shortly after completion of the 2nd segment while at 400ft.\r\n- Pilot training\r\nThe lack of training of engine failures on takeoff at or above V1, similar as is recommended in the training program, led to an inadequate pilot response to the emergency. The pilots did not follow the recommended flight profile and did execute the checklist items to be carried out above 400 feet.\r\n- Pilot decisions\r\nThe pilots assessed that the priority was to return to land in opposite direction of departure and began the turn back at 400 feet, which added to the difficulty of flying the aircraft. At 400 feet the aircraft maintained straight flight and a positive rate of climb requiring minor flight control inputs only, which would have favored the completion of the emergency check list items in accordance with recommendations by the training program. \r\nAfter starting the turn the crew would needed to adjust all flight controls to maintain intended flight trajectory in addition to working the checklists, the turn thus increased workload. It is noteworthy that the remaining engine developed sufficient power to sustain flight.\r\n- Supervision by Management\r\nThe supervision by management did not identify that the training program provided to pilots failed to address engine failure above V1 while still on the ground and airborne.\r\nIt was not identified that the software adopted by the company to dispatch aircraft used the maximum structural weight (6,600 kg) as maximum takeoff weight for departures from Recife.\r\nOn the day of the accident the aircraft was limited in takeoff weight due to ambient temperature. Due to the software error the aircraft took off with more than the maximum allowable takeoff weight degrading climb performance.\r\nMechanical Aspects\r\n- Aircraft\r\nFollowing the hypothesis that the fatigue process had already started when the turbine blade was still attached to the Russia made engine, the method used by the engine manufacturer for assessment to continue use of turbine blades was not able to ensure sufficient quality of the blade, that had been mounted into position 27 of the left hand engine's Gas Generator Turbine's disk.\r\n- Aircraft Documentation\r\nThe documentation of the aircraft by the aircraft manufacturer translated into the English language did not support proper operation by having confusing texts with different content for the same items in separate documents as well as translation errors. This makes the documentation difficult to understand, which may have contributed to the failure to properly implement the engine failure checklists on takeoff after V1.\r\nAn especially concerning item is the \"shutdown ABC (Auto Bank Control)\", to be held at 200 feet height, the difference between handling instructed by the checklist and provided by the flight crew manual may have contributed to the non-performance by the pilots, aggravating performance of the aircraft."}