{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-0-new-haven", "date": "Mar 1, 1958 at 1024 LT", "type": "Convair CV-240", "operator": "American-Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Boston – New Haven – Bridgeport – New York", "msn": "23", "yom": 1948, "flight_number": "AA535", "city": "New Haven", "zone": "Connecticut", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7453, "captain_hours_type": 4660, "copilot_hours": 5300, "copilot_hours_type": 3205, "aircraft_hours": 20857, "circumstances": "This was scheduled passenger flight 535 of March 1 from Boston, Massachusetts, to New York, New York, with stops planned at New Haven and Bridgeport, Connecticut. The crew, consisting of Captain Edward W. Johnson, First Officer Norman A. Paquette, and Stewardess Marian Sullivan, reported to company operations at Boston well ahead of scheduled departure time. Departure from Boston at 0927 was on time and was in accordance with an TFR clearance to cruise at 6,000 feet via airways to New Haven. The flight was routine and on schedule to New Haven. The aircraft was not refueled during the five-minute stop at New Haven, during which time both engines were stopped. The flight departed the terminal with five passengers and 1460 gallons of fuel. Gross weight of the aircraft was well under the maximum allowable and its center of gravity was located within prescribed limits. The wind was calm and runway 14 (4,116 feet), one of two macadam runways, was selected for takeoff. There is no air traffic control tower at New Haven. After completion of the takeoff checklist, the aircraft moved onto the runway and takeoff was initiated from a tan start without delay. This segment of the flight was being flown by First Officer Paquette who occupied the right seat. Captain Johnson, on the left, maintained directional control during the initial acceleration of the aircraft. Before the aircraft reached the intersection of runways 14 and 19, the landing gear was retracted. The aircraft then skidded clown runway 14 near its center and cane to rest 1,050 feet from the far end. Captain Johnson, Stewardess Sullivan, and three passengers left through the right emergency escape hatch over the wing. First Officer Paquette and the two remaining passengers left through the partially opened front entrance door. Fire, around the left engine and the left outboard wing area, caused considerable damage and was extinguished by the local fire department.", "probable_cause": "The Board determines that the probable cause of this accident was the improper technique of the captain resulting in the unintentional retraction of the landing gear prior to V 1 speed, which was made possible by a malfunctioning left gear safety switch. A contributing factor was inadequate inspection by the carrier. The following findings were reported: \r\n- The first officer made the takeoff with the captain performing the duties of copilot from his left seat,\r\n- The aircraft operated normally up to 85 knots in the takeoff roll,\r\n- The captain prematurely applied upward pressure on the landing gear selector handle,\r\n- A defective landing gear safety switch allowed the landing gear selector handle to be unlocked during ground operation of the aircraft, and permitted the landing gear to retract,\r\n- Fire did not develop in the left nacelle and fuel tank area until the aircraft skidded to a stop on the runway,\r\n- The company’s inspection of the safety switch was inadequate."}