{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t3-t1040-cheyenne-wales", "date": "Feb 9, 2000 at 1205 LT", "type": "Piper PA-31 Cheyenne", "operator": "Cape%20Smythe%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nome – Wales", "msn": "31-8375005", "yom": 1983, "flight_number": null, "city": "Wales", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4600, "captain_hours_type": 195, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12385, "circumstances": "The airline transport certificated pilot was landing a twin-engine turboprop airplane at a remote airport on a scheduled air taxi flight. Rising hilly terrain is located east of the airport. The pilot said that during the approach for landing, he noticed the airport wind sock indicating a wind from the east about 25 knots. When the pilot descended to 500 feet, about mid-base, the airplane encountered moderate turbulence and an increased rate of descent. He added engine power to arrest the descent. As he turned toward the runway, the airplane encountered 3 to 4 rolling oscillations with a bank angle up to 90 degrees while descending toward the runway. According to a company mechanic who traveled to the scene, it appeared that the airplane struck the runway about 1,200 feet from the approach end with the left wing and left elevator, while yawed about 45 degrees to the left of the runway centerline. The airplane then slid off the left side of the runway. After the collision, the pilot evacuated the passengers, and noticed the airport wind sock was indicating a tailwind. The Airport/Facility Directory contains the following in the airport remarks: 'Unattended. Easterly winds may cause severe turbulence in vicinity of runway.' ", "probable_cause": "The pilot's inadequate evaluation of the weather conditions, and his inadvertent flight into adverse weather conditions. Factors in the accident were terrain induced turbulence and a tailwind. "}