{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-mt-san-jose-87-killed", "date": "Feb 6, 1965 at 0836 LT", "type": "Douglas DC-6", "operator": "LAN-Chile-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Santiago – Buenos Aires – Montevideo", "msn": "45513/1004", "yom": 1958, "flight_number": "LA107", "city": "Mt San José", "zone": "Región Metropolitana de Santiago", "country": "Chile", "region": "South America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 80, "pax_fatalities": 80, "other_fatalities": 0, "total_fatalities": 87, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17085, "circumstances": "Flight 107 was a scheduled international fiight from Los Cerrillos Airport, Santiago (Chile) to Montevideo, Uruguay, with a scheduled stop at Buenos Aires, Argentina. The flight plan was as follows: \r\n(a) VMC - Santiago - Melipilla - Cerro Maipo climbing to 19 000 feet,\r\n(b) VMC - Cerro Maipo - San Rafael - Huinca Renanco - Junin - Suipacha - Buenos Aires (Ezeiza) in level flight at 19 800 feet.\r\nThe aircraft took off at 0806 hours from south to north in the direction of the city of Santiago. It flew low over the city in the Cerro San Cristobal area and later between 0810 and 0812 hours in the vicinity of Cerro Marquehue. At 0817 hours, it made radio contact with Panagra Control to request a change of route via Amarillo - Tumuyan Viejo - Reynolds 5,700 m. Mendoza Control authorized the change of route and asked for the estimated time over Amarillo. The flight replied that it estimated reaching Amarillo at 0336 hours. At 0822 the radio contact came to an end. The aircraft continued inland at low altitude in relation to the surrounding terrain, via Farellones, Lagunillas, Planta Queltehue and Lo Valdés. At 0836 hours, several witnesses saw the aircraft crash into the ridge joining the Catedral and Corona peaks. The aircraft disintegrated on impact and all 87 occupants have been killed. ", "probable_cause": "The accident was caused by lack of discipline on the part of the pilot-in- command of the aircraft who did not follow the instructions of the flight plan or those relating to crossing the mountains."}