{"url": "https://www.baaa-acro.com/crash/crash-vickers-701-viscount-blackbushe", "date": "Jan 20, 1956 at 0850 LT", "type": "Vickers Viscount", "operator": "BEA", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Blackbushe - Blackbushe", "msn": "26", "yom": 1953, "flight_number": null, "city": "Blackbushe", "zone": "Hampshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off from London Airport at 0755LT on a training flight, which was part of a routine base check being carried out by a training captain on a line captain. Having completed the first part of the check the aircraft landed at Blackbushe. At approximately 0850LT a takeoff was commenced from this airport for another exercise. On reaching the takeoff safety speed the training captain simulated a starboard outer engine failure. At this point the aircraft was just leaving the ground and as it did so the starboard inner propeller was seen to be stopping and the aircraft began turning to the right with an increasing amount of bank. It rose to about 30 feet and then descended and hit the ground at a point 250 yards from the runway in a steeply banked, nose-down attitude. It cartwheeled, slid along the ground backwards for 200 yards and came to rest just inside the northwest boundary of the aerodrome. The aircraft sustained major impact damage and fire broke out which almost completely destroyed it. The five occupants escaped with only slight injuries.", "probable_cause": "The accident was due to an error by the training captain who operated No. 3 high pressure cock lever instead of No. 4 when simulating a failure of No. 4 engine during take-off. This resulted in the loss of all power from both starboard engines at a critical point of the take-off."}