{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-114d-moscow-21-killed", "date": "Feb 16, 1966 at 0138 LT", "type": "Tupolev TU-114", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow – Conakry – Brazzaville", "msn": "64 M 4 7 2", "yom": 1964, "flight_number": "SU065", "city": "Moscow-Sheremetyevo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 19, "crew_fatalities": 13, "pax_on_board": 47, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 93, "circumstances": "The departure from Moscow-Sheremetyevo Airport to Conakry and Brazzaville was attempted by night and poor weather conditions. After a course of 1,400 meters, at a speed of 260 km/h, the captain pull up the control column and started the rotation, causing the nose gear to leave the ground. Few seconds later, after a course of 1,850 meters, in a limited visibility, while at a speed of 275 km/h, the left main gear struck a snow wall 60 cm high. Rather than interrupt the takeoff, the captain continued when control was lost. The airplane veered off runway to the right and crashed in flames. Thirteen crew members and eight passengers were killed while 45 other occupants were injured. The aircraft was destroyed. ", "probable_cause": "It was determined that the crew decided to attempt to takeoff with a visibility limited to 1,000 meters due to fog and snow, which was well below the minima. In such conditions, the aircraft was not properly aligned on the runway centerline, causing the left main gear to struck a snow wall. Investigators believe that Sheremetyevo Airport officials also bear some responsibilities for the accident because they failed to take the appropriate actions to ensure that the runway was properly cleared of snow. At the time of the accident, most elements of the lighting system fitted to both sides of the runway were covered with snow and therefore did not constitute pilot assistance."}