{"url": "https://www.baaa-acro.com/crash/crash-lockheed-p2v-7-neptune-near-san-bernardino-2-killed", "date": "Oct 3, 2003 at 1116 LT", "type": "Lockheed P-2 Neptune", "operator": "Minden%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Mountains", "schedule": "Prescott – San Bernardino", "msn": "726-7211", "yom": 1958, "flight_number": "Tanker 99", "city": "San Bernardino", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7803, "captain_hours_type": 1853, "copilot_hours": 7363, "copilot_hours_type": 853, "aircraft_hours": null, "circumstances": "The fire tanker airplane was on a cross-country positioning flight and collided with mountainous terrain while maneuvering in a canyon near the destination airport. Witnesses who held pilot certificates were on a mountain top at 7,900 feet and saw a cloud layer as far to the south as they could see. They used visual cues to estimate that the cloud tops were around 5,000 feet mean sea level (msl). They noted that the clouds did not extend all the way up into the mountain canyons; the clouds broke up near the head of some canyons. When they first saw the airplane, they assumed that it came from above the clouds. It was proceeding north up a canyon near the edge of clouds, which were breaking up. They were definitely looking down at the airplane the whole time. They saw the airplane make a 180-degree turn that was steeper than a standard rate turn. The wings leveled and the airplane went through one cloud, reappeared briefly, and then entered the cloud layer. It appeared to be descending when they last saw it. About 2 minutes later, they saw the top of the cloud layer bulge and turn a darker color. The bulge began to subside and they observed several smaller bulges appear. They notified local authorities that they thought a plane was down. Searchers discovered the wreckage at that location and reported that the wreckage and surrounding vegetation were on fire. The initial responders reported that the area was cloudy and the visibility was low. Examination of the ground scars and wreckage debris path disclosed that the airplane collided with the canyon walls in controlled flight on a westerly heading of 260 degrees at an elevation of 3,400 feet msl. The operator had an Automated Flight Following (AFF) system installed on the airplane. It recorded the airplane's location every 2 minutes using a GPS. The data indicated that the airplane departed Prescott and flew direct to the Twentynine Palms VORTAC (very high frequency omnidirectional radio range, tactical air navigation). The flight changed course slightly to 260 degrees, which took it to the northeast corner of the wilderness area where the accident occurred. At 1102:57, the data indicated that the airplane was at 11,135 feet msl at 204 knots. The airplane then made three left descending 360-degree turns. The third turn began at 6,010 feet msl. At 1116:57, the last recorded data point indicated that the airplane was at an altitude of 3,809 feet heading 256 degrees at a speed of 128 knots.", "probable_cause": "The pilot's inadequate in-flight planning/decision and continued flight into instrument meteorological conditions that resulted in controlled flight into mountainous terrain."}