{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-131-cincinnati-1-killed", "date": "Nov 6, 1967 at 1841 LT", "type": "Boeing 707", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Cincinnati – Los Angeles", "msn": "17669", "yom": 1959, "flight_number": "TW159", "city": "Cincinnati-Northern Kentucky", "zone": "Kentucky", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 29, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 18753, "captain_hours_type": 6204, "copilot_hours": 1629, "copilot_hours_type": 830, "aircraft_hours": 26319, "circumstances": "TWA Flight 159 was a scheduled domestic flight from New York to Los Angeles with an intermediate stop at the Greater Cincinnati Airport. It departed the ramp at Cincinnati at 1833 hours Eastern Standard Time. As it was approaching runway 27L for take-off, Delta Air Lines, Inc., DC-9, N-3317L, operating as Flight DAL 379, was landing. As DAL 379 was completing its landing roll, the crew requested and received clearance for a 180° turnaround on the runway in order to return to the intersection of runway 18-36 which they had just passed. After turning through approximately 90°, the nosewheel slipped off the paved surface and the aircraft moved straight ahead off the runway during which time it became mired. The throttles were retarded to idle, and power was not increased again. At 1839:05 hours as DAL 379 was in the process of clearing the runway, TWA 159 was cleared for take-off. The local controller testified that before TWA 159 began moving, he observed that DAL 379 had stopped. He stated that although DAL 379 appeared to be clear of the runway, he requested confirmation from the crew who replied, \"Yeah, we're in the dirt, though.\" Following this report the controller stated \"TWA 159 he's clear of the runway, cleared for take-off, company jet on final behind you.\" Take- off performance had been computed as V1 132 knots, VR 140 knots, V2 150 knots. In fact DAL 379 was stopped on a heading of 004' and located 4 600 ft from the threshold of runway 27L with its aft-most point being approximately 7 ft north of the runway edge, the aft-most exterior lights located on the wing tip and the upper and lower anti-collision lights being approximately 45 ft from the runway edge. The crew of TWA 159 did not have DAL 379 in sight when they commenced the take-off roll. The co-pilot was performing the take-off and the pilot-in-command drew his attention to DAL 379 as the aircraft appeared in their landing lights they could see that it was off the runway by Some 5-7 ft. As TWA 159 passed abeam of DAL 379 the co-pilot experienced a movement of the flight controls and the aircraft yawed. Simultaneously there was a loud bang from the right side of the aircraft. The last airspeed he had observed was 120 knots and assuming that the aircraft was at or near V1, and that a collision had occurred, he elected to abort the take-off . He stated that he closed the power levers, placed them in full reverse, applied maximum braking, and called for the spoilers which the pilot-in-command operated. Directional control was maintained but the aircraft ran off the end of the runway, rolled across the terrain for approximately 225 ft, to the brow of a hill, and became airborne momentarily. It next contacted the ground approximately 67 ft further down the embankment, the main landing gear was torn off and the nosewheel was displaced rearward, forcing the cabin floor upward by approximately 15 in. The aircraft slid down the embankment and came to rest on a road approximately 421 ft from the end of the runway. The accident occurred at approximately 1841 hours, in darkness. A passenger was killed, another was seriously injured, five others were slightly injured. The aircraft was written off. ", "probable_cause": "The Board determined that the probable cause of the accident was the inability of the TWA crew to abort successfully their take-off at the speed attained prior to the attempted abort. The abort was understandably initiated because of the co-pilot's belief that his plane had collided with a Delta aircraft stopped just off the runway. A contributing factor was the action of the Delta crew in advising the tower that their plane was clear of the runway without carefully ascertaining the facts, and when in fact their aircraft was not at a safe distance under the circumstance of another aircraft taking off on that runway. "}