{"url": "https://www.baaa-acro.com/crash/crash-cessna-441-conquest-ii-winfield-2-killed", "date": "Jan 30, 2002 at 1359 LT", "type": "Cessna 441 Conquest", "operator": "Chrysalis 1", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Springdale – Rifle", "msn": "441-0148", "yom": 1980, "flight_number": null, "city": "Winfield", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3529, "circumstances": "Impact forces and fire destroyed the airplane when it impacted the terrain after a loss of control during cruise flight. The pilot received a weather brief by AFSS prior to departure concerning the IFR conditions along the route of flight, which included, rain, freezing rain, icing, turbulence, and snow. The cloud tops were forecast to be 25,000 feet. The pilot filed a flight plan with a cruise flight level of 28,000 feet. About 32 minutes after takeoff, at 1345:58, the pilot reported he had an attitude gyro problem and that he was hand flying the airplane. The airplane's altitude remained at about 28,000 feet for the next seven minutes. At 1352:46, the pilot stated he had an emergency, but at 1352:53, the pilot stated, \"Uh it came back on never mind.\" At 1353:26, the pilot stated, \"I need to get to uh anywhere I can get a visual.\" At 1353:56, the airplane was cleared to climb to 31,000 feet, and radar data indicated the airplane was currently at 27,000 feet. The radar data indicated the airplane went into a series of steep descents and climbs over the next 4.5 minutes until radar contact was lost at 2,500 feet. The pilot of a commercial airline who was flying in the same sector as the accident airplane reported that he heard the accident pilot state that he was in a spin. The commercial airline pilot stated they were flying at 33,000 feet and were \"barely above the tops\" of the clouds. The airplane impacted the terrain in a steep nose down attitude and burst into flames. The engines, flight controls, and flight instruments did not exhibit any pre-existing anomalies. A witness reported that two days prior to the accident, the pilot had advised him that the airplane's attitude gyro was having problems. There was no record that the pilot had the attitude gyro inspected prior to the accident. A witness reported the pilot routinely flew with the autopilot engaged soon after takeoff. He reported that he had never observed the pilot hand-fly the airplane in instrument conditions.", "probable_cause": "The pilot's spatial disorientation resulting in a loss of control and collision with the ground. Additional factors included the pilot operating the airplane with known deficiencies and the instrument flight conditions."}