{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-60-duke-wilmington-1-killed", "date": "Dec 4, 2007 at 0722 LT", "type": "Beechcraft 60 Duke", "operator": "AvWerks", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Wilmington – Allentown", "msn": "P-105", "yom": 1969, "flight_number": null, "city": "Wilmington-New Castle County", "zone": "Delaware", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1080, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "According to a witness, prior to arriving in the run-up area the pilot lowered the airplane's flaps. After the right flap fully extended, the flap key on the drive shaft inside the 90-degree drive assembly adapter fractured, in overload, in the direction of flap extension. Before takeoff, the pilot raised the flaps; however, with the fractured key, the right flap would have remained fully extended. The pilot could have identified this condition prior to takeoff, either visually or by means of the flap indicator, which received its input from the right flap actuator. The pilot subsequently took off, and the airplane turned left, but it is unknown at what point the pilot would have noted a control problem. The pilot climbed the airplane to 250 to 300 feet and allowed the airspeed to bleed off to where the airplane stalled and subsequently spun into the ground. Airplane manufacturer calculations revealed that the pilot should have been able to maintain control of the airplane at airspeeds over 70 knots. According to the pilot's operating handbook, the best two-engine angle of climb airspeed was 99 knots and the best two-engine rate of climb airspeed was 120 knots.", "probable_cause": "The pilot's failure to maintain adequate airspeed during a split flap takeoff, which resulted in an aerodynamic stall. Contributing to the accident were the failure of the right flap drive mechanism and the pilot's failure to verify that both flaps were retracted prior to takeoff."}