{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61p-aerostar-ted-smith-601p-johns-island-2-killed", "date": "Apr 5, 2004 at 1526 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Aero Dreams", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Johns Island - Charleston", "msn": "61-0235-035", "yom": 1975, "flight_number": null, "city": "Charleston-Executive (Johns Island)", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2007, "captain_hours_type": 35, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3805, "circumstances": "A witness at a nearby maintenance facility stated the pilot telephoned him and told him that, during engine start, one engine sputtered and abruptly stopped. The witness stated the pilot told him he wanted to fly the airplane over to have the problem looked at. A witness, who was an airline transport-rated corporate pilot, observed the airplane on takeoff roll and stated the airplane rotated \"really late,\" using approximately 4,000 feet of runway. He stated the airplane climbed to about 400 or 500 feet, then descended in a left spin into the trees. The airplane collided with the ground and caught fire. Examination of the right engine revealed external fire damage and no evidence of mechanical malfunction. Examination of the left engine revealed external fire damage. Disassembly examination of the left engine revealed the rear side of the No. 5 piston from top to bottom was eroded away with characteristics consistent with detonation. The spark plugs displayed \"normal\" deposits and wear, except the No. 5 bottom plug was contaminated with a fragment of piston ring material, the No. 5 top plug had a dark sooty appearance, and the nose core of the No. 2 bottom plug was fragmented. Flow bench examination of the left fuel servo revealed no abnormalities. The fuel flow manifold diaphragm was heat-damaged. Flow bench examination of the fuel injector lines and nozzles on a serviceable fuel flow manifold revealed the lines and nozzles were free of obstruction. A review of Emergency Operating Procedures for the Aerostar 601P revealed the following: \"Normal procedures do not require operation below the single engine minimum control speed, however, should this condition inadvertently arise and engine failure occur, power on the operating engine should immediately be reduced and the nose lowered to attain a speed above ... the single engine minimum control speed.\"", "probable_cause": "The pilot's failure to maintain airspeed during emergency descent, which resulted in an inadvertent stall/spin and uncontrolled descent into trees and terrain. A factor was the loss of engine power in one engine due to pre-ignition/detonation."}