{"url": "https://www.baaa-acro.com/crash/crash-antonov-10a-near-sochi-81-killed", "date": "Jul 28, 1962 at 1541 LT", "type": "Antonov AN-10", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Lviv – Simferopol – Sochi", "msn": "0 4 020 03", "yom": 8, "flight_number": "SU415", "city": "Sochi", "zone": "Krasnodar Krai", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 74, "pax_fatalities": 74, "other_fatalities": 0, "total_fatalities": 81, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1358, "circumstances": "While approaching Sochi-Adler Airport on a flight from Simferopol, the crew was cleared to descend to 1,200 m, 600 m and then 500 meters. Once this altitude was reached, the crew encountered marginal weather conditions and the four engine aircraft went through a cloudy area when it struck tree tops and crashed in flames in a dense wooded area located 21 km southeast of the airport. The airplane was totally destroyed and the debris were scattered on a distance of 300 m by 150 m. All 81 occupants were killed. ", "probable_cause": "At the time of the accident, the crew was following an approach route that was not used by ATC based at Sochi-Adler Airport. Investigations determined that the Sochi Airport authorities decided to change the approach pattern and procedures while this was not approved by Soviet State Aviation Authority. Also, the crews were no aware of these modifications.The following factors were considered as contributing:\r\n- Poor coordination between State and Airport Authorities, \r\n- Lack of visibility due to clouds,\r\n- Lack of assistance on part of ATC,\r\n- Inadequacies and wrong decisions on part of ATC,\r\n- Lack of knowledge about the Sochi area,\r\n- Lack of crew training in mountainous terrain."}