{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-436-mt-fuji-124-killed", "date": "Mar 5, 1966 at 1415 LT", "type": "Boeing 707", "operator": "BOAC-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "San Francisco – Honolulu – Tokyo – Hong Kong – London", "msn": "17706", "yom": 1960, "flight_number": "BA911", "city": "Mt Fuji", "zone": "Chūbu", "country": "Japan", "region": "Asia", "crew_on_board": 11, "crew_fatalities": 11, "pax_on_board": 113, "pax_fatalities": 113, "other_fatalities": 0, "total_fatalities": 124, "captain_hours": 14724, "captain_hours_type": 2155, "copilot_hours": 3663, "copilot_hours_type": 2073, "aircraft_hours": 19523, "circumstances": "BOAC Flight 911 was a scheduled service from San Francisco (SFO) to Hong Kong (HKG) via Honolulu (HNL) and Tokyo (HND). The Boeing 707 was expected to arrive at Tokyo Airport at 16:45 on 4 March. However, due to poor meteorological conditions at Tokyo and because the precision approach radar (PAR) of the GCA was out of service, it diverted to Fukuoka (FUK) and landed there at 18:00. After staying overnight at Fukuoka, Flight 911 left for Tokyo at 11:25 and landed there at 12:43. The aircraft was prepared for the next leg to Hong Kong and a flight plan was filed for a flight in accordance with the instrument flight rules via Oshima on airway JG6 to Hong Kong at FL310. At 13:42 hours the crew contacted ATC requesting permission to start the engines and clearance for a VMC climb via Fuji-Rebel-Kushimoto. The aircraft left the ramp at 13:50. It was instructed to make \"a right turn after take off\", and departed Tokyo Airport at 13:58. After takeoff the aircraft flew over Gotemba City on a heading of approximately 298 deg at an altitude of approximately 4900 m and indicated airspeed of 320 to 370 knots. The aircraft, trailing white vapor, then suddenly lost altitude over the Takigahara area, and parts of the aircraft began to break away over Tsuchiyadai and Ichirimatsu. Finally over Tarobo at an altitude of approx. 2000 m, the forward fuselage broke away. The mid-aft fuselage together with the wing, making a slow flat spin to the right, crashed into a forest at the foot of Mount Fuji. The forward fuselage crashed into the forest approx. 300 m to the west of the above site and caught fire. All 124 occupants were killed.", "probable_cause": "The aircraft suddenly encountered abnormally severe turbulence over Gotemba City which imposed a gust load considerably in excess of the design limit."}