{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-62f-new-york", "date": "Mar 12, 1991 at 0906 LT", "type": "Douglas DC-8", "operator": "ATI", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York - Brussels", "msn": "46161", "yom": 1971, "flight_number": "8C102", "city": "New York-JFK", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12800, "captain_hours_type": 3000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 50145, "circumstances": "Before flight, the flight engineer (f/e) had calculated 'v' speeds and horizontal stabilizer trim setting for takeoff, but neither the captain nor the 1st officer (f/o) had verified them. During rotation for takeoff, the captain noted that the forced needed to pull the yoke aft was greater than normal and that the aircraft would not fly (at that speed). Subsequently, he aborted the attempted takeoff. Realizing the aircraft would not stop on the remaining runway, he elected to steer it to the right to avoid hitting traffic on a highway near the departure end. The aircraft struck ILS equipment; the landing gear collapsed and all 4 engines tore away. Subsequently, the aircraft was destroyed by fire. Investigations revealed the f/e had improperly computed the takeoff data. He had calculated the 'v' speeds and horizontal stabilizer trim setting for 242,000 lbs; however, the actual takeoff wt was 342,000 lbs. Rotation speed (Vr) for this weight was 28 knots above the speed that was used. Investigations revealed shortcomings in the operator's flightcrew training program and questionable scheduling of qualified (but marginally experienced) crew members for the accident flight. ", "probable_cause": "Improper preflight planning/preparation, in that the flight engineer miscalculated (misjudged) the aircraft's gross weight by 100,000 lbs and provided the captain with improper takeoff speeds; and improper supervision by the captain. Factors related to the accident were: improper trim setting provided to the captain by the flight engineer, inadequate monitoring of the performance data by the first officer, and the company management's inadequate surveillance of the operation."}