{"url": "https://www.baaa-acro.com/crash/crash-martin-b-26c-40-mo-marauder-del-rio-3-killed", "date": "May 12, 1944 at 0930 LT", "type": "Martin B-26 Marauder", "operator": "USAAF", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Del Rio - Del Rio", "msn": null, "yom": null, "flight_number": null, "city": "Del Rio", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 6500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew (two pilots and one instructor) was involved in a training flight. While flying some 4 miles east of Del Rio-Laughlin Field, the twin engine aircraft collided with another Martin B-26 Marauder registered 41-35870. Both aircraft crashed and were destroyed by impact forces and post crash fire.\nSource: http://aviation-safety.net/wikibase/wiki.php?id=109108", "probable_cause": "It is the opinion of this Board that both airplanes were flying a heading of approximately 80 degrees with airplane B behind and slightly above airplane A. Airplane B was flying faster than airplane A and overtook and collided with airplane A approximately four (4) miles east of Laughlin Field. \nThe collision was clearly seen by several individuals on this field. All witnesses agree both airplanes were flying contact but since the airplanes collided four to six miles from the various witnesses, there is no clear account of how the collision occurred. The instructor in airplane A had a total of 1,335 hours. The pilot of airplane B had a total of approximately 6,500 hours. \nFrom the evidence found in the wreckage, airplane A exploded and burned while still in the air. Sections of both wings and empennage came off before the aircraft struck the ground. Aircraft B hit the ground relatively intact and was destroyed by fire. The crash was fatal to all personnel. \nAny attempt to state what actually caused the accident would be conjecture. \nStatement of Responsibility: none \nRocomendations: none "}