{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-near-amarillo-2-killed", "date": "Dec 14, 2012 at 1805 LT", "type": "Beechcraft 90 King Air", "operator": "Oneal Aviation", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Amarillo - Fort Worth", "msn": "LW-112", "yom": 1974, "flight_number": null, "city": "Amarillo", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1650, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8607, "circumstances": "During the cross-country instrument flight rules flight, the pilot was in contact with air traffic control personnel. The controller cleared the airplane to flight level 210 and gave the pilot permission to deviate east of the airplane's route to avoid weather and traffic. A review of radar data showed the airplane heading southward away from the departure airport and climbing to an altitude of about 14,800 feet mean sea level (msl). Shortly thereafter, the airplane turned north, and the controller queried the pilot about the turn; however, he did not respond. The airplane wreckage was located on ranch land with sections of the airplane's outer wing, engines, elevators, and vertical and horizontal stabilizers separated from the fuselage and scattered in several directions, which is consistent with an in-flight breakup before impact with terrain. A review of the weather information for the airplane's route of flight showed widely scattered thunderstorms and a southerly surface wind of 30 knots with gusts to 40 knots. An AIRMET active at the time advised of moderate turbulence below flight level 180. Three pilot reports made within 50 miles of the accident site indicated moderate turbulence and mountain wave activity. An assessment of the humidity and freezing level noted the potential for clear, light-mixed, or rime icing between 10,700 and 17,300 feet msl. Postaccident airplane examination did not reveal any mechanical malfunctions or anomalies with the airframe and engines that would have precluded normal operation. It's likely the airplane encountered heavy to extreme turbulence and icing conditions during the flight, which led to the pilot’s loss of control of the airplane and its subsequent in-flight breakup.", "probable_cause": "The pilot’s loss of control of the airplane after encountering icing conditions and heavy to extreme turbulence and the subsequent exceedance of the airplane’s design limit, which led to an in-flight breakup."}