{"url": "https://www.baaa-acro.com/crash/crash-vickers-vc-10-1154-addis-ababa-43-killed", "date": "Apr 18, 1972 at 0939 LT", "type": "Vickers VC-10", "operator": "East-African-Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nairobi – Addis Ababa – Rome – London", "msn": "881", "yom": 1966, "flight_number": "EC720", "city": "Addis Ababa-Bole", "zone": "Addis Ababa City District", "country": "Ethiopia", "region": "Africa", "crew_on_board": 11, "crew_fatalities": 8, "pax_on_board": 96, "pax_fatalities": 35, "other_fatalities": 0, "total_fatalities": 43, "captain_hours": 8769, "captain_hours_type": 752, "copilot_hours": 2744, "copilot_hours_type": 640, "aircraft_hours": 18586, "circumstances": "East African Airways Flight EC-720 to London via Addis Ababa and Rome departed Nairobi at 06:55 hours. The flight to Addis Ababa was uneventful and the VC10 landed there at 08:23. During the transit stop at Addis Ababa, some freight was off-loaded together with 40 passengers. Fifteen passengers joined the flight and the airplane was refueled. Start up clearance was given at 09:21 hours and the aircraft taxied out six minutes later via the eastern taxiway for takeoff on runway 07. The tower advised the aircraft that the wind was 5 knots and variable in direction. At 09:32 hours, as the aircraft was backtracking to the takeoff point, the pilot reported a number of dead birds on the runway. He requested that these birds be removed before the aircraft took off. A fire truck was dispatched to take care of this. The aircraft continued to backtrack down the runway and turned in the pad at the end. It then lined up on the runway and stopped a short distance from the threshold. At 09:38:40 hours, the tower cleared the aircraft for takeoff. Shortly after the aircraft had passed the mid-point of the runway, at or just below the V1 speed, the nose wheel ran over a steel jacking pad. This jacking pad belonged to a Cessna 185 that had departed 4:40 earlier. The pad punctured the right hand nose wheel tire. A loud bang was heard and severe vibration was felt on the flight deck. Almost immediately after the nose wheel tire had burst, the nose of the aircraft rose momentarily and then come down. The flight crew decided to abort the takeoff. The engines were throttled back and reverse thrust was selected. The aircraft continued down the runway, veering slightly to the right. Then the no.1 rear main tire burst. Just before the aircraft reached the end of the runway, it veered slightly to the left and ran approximately parallel to the centre line. After crossing a storm drain located at the end of the runway at right angles to the centre line, the aircraft became momentarily airborne as it left the lip of the embankment on which the 60 m stopway was laid. As it did so, the left outer wing of the aircraft struck a steel lattice tower forming part of the approach lighting system to runway 25. This ruptured the no. 1A fuel tank and the released fuel promptly ignited. Sixty meters beyond the end of the runway the aircraft fell heavily on to the lower ground 10.6 m below the runway level. It broke up immediately on impact and after sliding a short distance, came to rest and caught fire.", "probable_cause": "The accident was due to a partial loss of braking effort arising from incorrect re-assembly of part of the braking system, as a result of which the aircraft could not be stopped within the emergency distance remaining following a properly executed abandoned take-off procedure."}