{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b90-king-air-dillingham-1-killed", "date": "May 22, 1999 at 1930 LT", "type": "Beechcraft 90 King Air", "operator": "Pacific%20Skydiving", "flight_phase": "Landing (descent or approach)", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Dillingham - Dillingham", "msn": "LJ-372", "yom": 1968, "flight_number": null, "city": "Dillingham (O'ahu Island)", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following the 12th sport parachute jump of the day, which occurred after sunset, ground witnesses observed the airplane descend into the ocean in a left wing low, nose down attitude. They did not hear the engines sputtering or popping, or see the airplane make any erratic movements during its descent. Skydivers indicated that the two previous flights had been conducted at altitudes of at least 18,000 feet, and the accident flight and subsequent jump were made at 20,000 feet. During this final jump flight, one of the skydivers stated he had a hard time breathing and felt nauseous. The skydivers also noted that the pilot was unable to maintain a steady course and did not respond well to minor course corrections. No supplemental oxygen was found onboard the airplane during the recovery or subsequent inspection phases of the investigation. No skydiver observed the pilot using supplemental oxygen. The airplane manufacturer noted that the pressurization system would have been rendered inoperable due to a non-sealed cockpit door. Hypoxia is defined as a physiological condition where a person is bereft of needed oxygen. Judgment is poor and reaction time delayed. Total incapacitation coupled with a loss of consciousness can occur with little or no warning. The airframe, engines, and propellers were examined with no preexisting impact anomalies found.", "probable_cause": "The pilot's incapacitation due to the effects of hypoxia from repeated flights to altitudes above 18,000 feet msl without supplemental oxygen. "}