{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-mesquite", "date": "Jul 17, 2019 at 1844 LT", "type": "Cessna 550 Citation II", "operator": "Avia Jet", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pasco - Las Vegas", "msn": "550-0271", "yom": 1981, "flight_number": null, "city": "Mesquite", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17000, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9000, "circumstances": "While approaching class B airspace, the airline transport pilot was in communication with a controller who later stated that the pilot's speech was slurred, and the controller repeatedly asked if the oxygen system on the airplane was working properly. As the airplane approached a nearby airport, about 85 miles from his destination airport, the pilot stated he had the airport in sight and repeatedly requested a visual approach. The controller instructed the pilot to continue his flight to his destination, in a southwest direction. As the controller attempted to maintain communications, the pilot dropped off radar shortly after passing the nearby airport and subsequently landed at the nearby airport, which was not his destination airport. According to a surveillance video and impact marks on the runway, the airplane landed hard about halfway down the runway and slid to a stop on the left side of the runway. The airplane fuselage and wings were mostly consumed by postimpact fire. After authorities arrived onsite, the pilot was arrested for operating an aircraft under the influence of alcohol. The pilot was found to have a blood alcohol level of .288, which likely contributed to the pilot landing at the incorrect airport and his subsequent loss of airplane control during landing. ", "probable_cause": "The pilot's operation of the airplane while intoxicated, which resulted in a loss of airplane control on landing."}