{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54b-1-dc-skymaster-great-sitkin-island-16-killed", "date": "Sep 24, 1959 at 1720 LT", "type": "Douglas C-54 Skymaster", "operator": "Reeve%20Aleutian%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Anchorage – Cold Bay – Adak – Shemya", "msn": "10486", "yom": 1944, "flight_number": "RV003", "city": "Great Sitkin Island", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": 12853, "captain_hours_type": 1278, "copilot_hours": 3949, "copilot_hours_type": 883, "aircraft_hours": 33390, "circumstances": "Flight 3 was a scheduled flight between Anchorage and Shemya, with intermediate stops at Cold Bay and Adak, Alaska. A routine takeoff was made at Cold Bay, and all en route radio reporting points were made to the company within two or three minutes of their estimated times. At 1650LT, the flight reported that it was 100 miles northeast of Adak, at 4,500 feet, on top and in the clear. Flight 3 then estimated it would be over the Adak low frequency range at 1725LT. The flight was cleared to the Adak low frequency range, to maintain VFR on top, and to call Adak approach control when 30 miles out for landing instructions. At 1715LT, the flight advised the company it was canceling its IFR flight plan and was proceeding VFR. Two minutes later Flight 3 attempted to communicate with Adak approach control. Upon hearing this message, approach control called the flight but was unsuccessful. It was later determined that the aircraft had crashed into the northeast side of the Great Sitkin volcano (1,740 meters high) located on the Great Sitkin Island, about 25 miles northeast of Adak Airport. The aircraft was destroyed and all 16 occupants have been killed.", "probable_cause": "The Board determines that the probable cause of this accident was the captain's failure to maintain flight in accordance with visual flight rules during a descent over hazardous terrain."}