{"url": "https://www.baaa-acro.com/crash/crash-canadair-bd-700-1a11-global-5000-tacloban", "date": "Jan 17, 2015 at 1345 LT", "type": "Bombardier Global 5000", "operator": "Challenger Aero Corporation Metro Manila", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tacloban - Manila", "msn": "9363", "yom": 2009, "flight_number": null, "city": "Tacloban", "zone": "Leyte", "country": "Philippines", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 14, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On or about 1000H January 17, 2015, the Holy Father “Pope Francis” visited the typhoon-devastated province of Leyte and utilized an Airbus 320 aircraft for Tacloban airport, and Bombardier Global 5000 RP-C9363 aircraft was part of the Papal entourage with passengers on board. The weather condition was worsening and the visit of the Pope had to cut short due to approaching tropical storm code named “AMANG”, with strong winds of up to 130km/h(80mph) according to PAGASA and moderate rain as signal n°2 was already forecasted at the province of Leyte. At 1304H, the Global 5000 RP-C9363 was given start up clearance by tower controller and subsequently a taxi clearance at 1308H to exit via south taxiway next to the departing Airbus320 PAL8010. At 1306H, the First Airbus 320 PAL8010 aircraft carrying the Papal entourage took-off utilizing RWY 36 with prevailing wind condition of 290̊/18 knots crosswind and temperature of 24°. At 1311H, RP-C 9363 was not allowed to move from present position to proceed to the active runway via south taxiway by the military ground marshaller. At 1322H, the 2nd Airbus 320 PAL8191 took-off with prevailing wind conditions of 290°/23 kts crosswind. The separation time between the Global 5000 to the first and second aircraft were 29 minutes and 13 minutes respectively. At 1335H, finally RP-C9363 Global 5000 was cleared for take-off at runway 36 bound for Ninoy Aquino International Airport (RPLL) with two (2) pilots and 14 passengers on board. The wind condition at that time was 300°/18 kts with gustiness and temperature of 24°. The aircrew performed rolling take-off and the acceleration was normal, the pilot nonflying (NPF) called for air speed alive, 80 knots, V1 and Rotate. Before approaching south taxiway abeam the terminal building, the aircraft started to veer to the left side of the runway centerline. The aircraft continued to roll veering to the left side of the runway and the left hand main landing gear was already out of the runway after the north taxiway. The aircraft underwent runway excursion and sustained substantial damage after simultaneous collision with the concrete bases of runway edge lights and to the concrete culvert before it came to a complete stop at approximately 1500 meters from the take-off point. Immediate evacuation was performed to all passengers. The crash and fire rescue personnel arrived at the area and assisted the passengers and aircrew. ", "probable_cause": "The Aircraft Accident Investigation and Inquiry Board determined that the probable cause of this accident was: \r\n- Lack of recurrent training of the flight crew:\r\nRoutine flights do not prepare a pilot for unusual situations, whether they are unexpected crosswinds or systems/engine anomalies. Pilots should receive regular recurrent training to include abnormal and emergency procedures.\r\n- The existing runway edge light design:\r\nThe PIC tried to recover the aircraft back to the runway but apparently the aircraft left main landing gears already hit or bumped the concrete base of runway edge lights. The design of runway strips or shoulder must be free from fixed objects other than frangible visual aids provided for the guidance of aircraft and must not be constructed\r\nwith sharp edges; and where the lights will not normally come into contact with aircraft wheels, such as threshold lights, runway end lights and runway edge lights;\r\n- Human Factors: \r\nDue to deteriorating adverse weather conditions and due to the delay of their initial request for take-off clearance plus the sudden change of flight plan affected the Captain’s ability to perform a take-off procedure as recommended in the aircraft flight manual and instead delegated flight control duties to the F/O resulting in the loss of coordination between the light crew."}