{"url": "https://www.baaa-acro.com/crash/crash-dornier-do228-201-near-indapur-11-killed", "date": "Sep 23, 1989 at 1953 LT", "type": "Dornier DO228", "operator": "Vayudoot", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Pune - Hyderabad", "msn": "8052", "yom": 1985, "flight_number": "PF624", "city": null, "zone": null, "country": "India", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 4459, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off from Pune at 1928 hrs. The flight was uneventful up to 1943 hrs. Soon thereafter, the aircraft started losing height rapidly with increasing speed. The pilot attempted recover the aircraft from the dive but the aircraft continued to lose height till it impacted the backwaters Ujjaini Dam near Indapur village, 129 ms east-southeast of Pune. The aircraft disintegrated into multiple pieces, killing all persons on board the aircraft. The accident occurred during night conditions. ", "probable_cause": "Entry of the aircraft into severe turbulent conditions while passing through clouds, leading to rapid loss of height of the aircraft because of inappropriate action by the pilots. As a result, the aircraft entered a spiral. This was not recognised by the pilots, resulting in initiation of incorrect recovery action by pulling back on the control column instead of first levelling the wings. The possibility of jamming of the elevator of the aircraft cannot be ruled out as one of the probable cause of the accident. Disorientation; unpreparedness of the pilots and their failure to recognise in time, a serious situation and take appropriate corrective action; long breaks in night flying in the case of the captain and temporary malfunction or sluggishness of ADI are the contributory causes."}