{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-grand-canyon-west-10-killed", "date": "Jun 19, 1992 at 1405 LT", "type": "Cessna 402", "operator": "Adventure%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Grand Canyon West - Las Vegas", "msn": "402C-0215", "yom": 1979, "flight_number": null, "city": "Grand Canyon West", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 7891, "captain_hours_type": 2030, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9266, "circumstances": "Pilot began takeoff on a 5,200 feet dirt runway (upslope to the south, elevation 4,775 feet) with wind from the south at 18-20 knots, density altitude about 7,250 feet. Witnesses observed the aircraft taking off, with the landing gear retracting as it passed their position. Soon thereafter, the pilot transmitted he had 'a problem.' Aircraft was then seen about 200-300 feet agl in right turn, which progressed into a dive. Aircraft impacted in flat attitude 1/2 mile south of runway 17. Passenger video tapes revealed props went out of sync about 6 seconds after takeoff. About 15 seconds later, right prop slowed until blades could be seen turning. Video showed one engine fuel flow at about 90 gph, other engine at minimum setting (about 3 psi), 5° increase in pitch attitude. Exam revealed right engine driven fuel pump drive coupling was scored and only partially engaged. SB ME88-3 complied with; auxiliary fuel pump switches found in low position. Right propeller blades found at fine pitch, lacking rotational damage. Landing gear found up, but unlocked; flaps extended 15°. Emergency procedure training did not replicate high density altitude and max gross weight performance. All 10 occupants were killed. ", "probable_cause": "Failure of the pilot to follow the emergency procedure (engine failure after takeoff) and his failure to maintain minimum control speed (VMC), which resulted in a loss of aircraft control. Factors related to the accident were failure (disengagement) of the right engine fuel pump drive coupling, high density altitude, and the lack of company training concerning aircraft performance in conditions of high density altitude and heavy gross weight."}