{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-476sf-east-midlands", "date": "Apr 29, 2014 at 0228 LT", "type": "Boeing 737-400", "operator": "Air-Contractors2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris-Roissy-Charles de Gaulle – East Midlands", "msn": "24433/1881", "yom": 1990, "flight_number": "ABR1748", "city": "East Midlands", "zone": "Leicestershire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4279, "captain_hours_type": 377, "copilot_hours": 3900, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was scheduled to operate three commercial air transport (cargo) sectors: from Athens to Bergamo, then to Paris Charles de Gaulle, and finally East Midlands. The aircraft’s flap load relief system was inoperative, which meant that the maximum flap position to be used in flight was 30, rather than 40º. This defect had been deferred in the aircraft’s technical log and it had no effect on the landing of the aircraft. Otherwise, the aircraft was fully serviceable. The co-pilot completed the pre-flight external inspection of the aircraft in good light, and found nothing amiss. The departure from Athens was uneventful, but a combination of factors affecting Bergamo (including poor weather, absence of precision approach aids, and work in progress affecting the available landing distance) led the crew to decide to route directly to Paris, where a normal landing was carried out. The aircraft departed Paris for East Midlands at 0040 hrs, loaded with 10 tonnes of freight, 8 tonnes of fuel (the minimum required was 5.6 tonnes), and with the co-pilot as Pilot Flying. Once established in the cruise, the flight crew obtained the latest ATIS  information from East Midlands, which stated that Runway 27 was in use, although there was a slight tailwind, and Low Visibility Procedures (LVPs) were in force. They planned to exchange control at about FL100 in the descent, for the commander to carry out a Category III autoland. However, as they neared their destination, the weather improved, LVPs were cancelled, and the flight crew re-briefed for an autopilot approach, followed by a manual landing, to be carried out by the co-pilot. The landing was to be with Flap 30, Autobrake 2, and idle reverse thrust. The final ATIS transmission which the flight crew noted before landing stated that the wind was 130/05 kt, visibility was 3,000 metres in mist, and the cloud was broken at 600 ft aal. The commander of EI-STD established radio contact with the tower controller, and the aircraft was cleared to land; the surface wind was transmitted as 090/05 kt. The touchdown was unremarkable, and the autobrake functioned normally, while the co-pilot applied idle reverse thrust on the engines. As the aircraft’s speed reduced through approximately 60 kt, the co-pilot handed control to the commander, who then made a brake pedal application to disengage the autobrake system. However, the system remained engaged, so he made a second, more positive, brake application. The aircraft “shuddered” and rolled slightly left-wing-low as the lower part of the left main landing gear detached. The commander used the steering tiller to try to keep the aircraft tracking straight along the runway centreline, but it came to a halt slightly off the centreline, resting on its right main landing gear, the remains of the left main landing gear leg, and the left engine lower cowl. The co-pilot saw some smoke drift past the aircraft as it came to a halt. The co-pilot made a transmission to the tower controller, reporting that the aircraft was in difficulties, after which the co-pilot of another aircraft (which was taxiing from its parking position along the parallel taxiway) made a transmission referring to smoke from the 737’s landing gear. The commander of EI-STD had reached the conclusion that one of the main landing gear legs had failed, but as a result of the other pilot’s transmission, he was also concerned that the aircraft might be on fire. The commander immediately moved both engine start levers to the cut-off positions, shutting down the engines. Three RFFS vehicles had by now arrived at the adjacent taxiway intersection, and their presence there prompted the commander to consider that the aircraft was not on fire (he believed that if it were, the vehicles would have adopted positions closer by and begun to apply fire-fighting media). The RFFS vehicles then moved closer to the aircraft and fire-fighters placed a ladder against door L1, which the co-pilot had opened. Having spoken to fire-fighters while standing in the entrance vestibule, the commander returned to the flight deck and switched off the battery. The flight crew were assisted from the aircraft and fire-fighters applied foam around the landing gear and engine to make the area safe. The commander had taken the Notoc2 with him from the aircraft, and informed fire-fighters of the dangerous goods on board the aircraft.", "probable_cause": "The damage to the flap system, fuselage, and MLG equipment was attributable to the detachment of the left MLG axle, wheel and brake assembly. The damage to the MLG outer cylinder, engine and nacelle was as result of the aircraft settling and sliding along the runway. The left MLG axle assembly detached from the inner cylinder due to the momentary increase in bending load during the transition from auto to manual braking. The failure was as a result of stress corrosion cracking and fatigue weakening the high strength steel substrate at a point approximately 75 mm above the axle. It is likely that some degree of heat damage was sustained by the inner cylinder during the overhaul process, as indicated by the presence of chicken wire cracking within the chrome plating over the majority of its surface. However, this was not severe enough to have damaged the steel substrate and therefore may have been coincidental. Although the risk of heat damage occurring during complex landing gear plating and refinishing processes is well understood and therefore mitigated by the manufacturers and overhaul agencies, damage during the most recent refinishing process cannot be discounted. The origin of the failure was an area of intense, but very localized heating, which damaged the chrome protection and changed the metallurgy; ie the formation of martensite within the steel substrate. This resulted in a surface corrosion pit, which, along with the metallurgical change, led to stress corrosion cracking, fatigue propagation and the eventual failure of the inner cylinder under normal loading."}