{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-35-marquise-pacific-ocean-1-killed", "date": "Dec 9, 1988 at 0721 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Sunny Moon Association", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Tulsa – Oakland – Honolulu – Majuro – Cairns", "msn": "592", "yom": 1973, "flight_number": null, "city": "Pacific Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During a flight at night from Majuro, Marshall Islands to Cairns, Australia, the pilot requested a descent from FL190 to 12,000 feet to remove ice from the airframe. Later, he requested a climb to FL200. After starting the climb, he made a mayday call to Sydney flight service and reported the aircraft was in an uncontrolled descent. No further transmission was received from the aircraft. The aircraft was presumed to have crashed at sea, about 370 miles east-northeast of Cairns. Neither the aircraft nor the pilot was found. Thunderstorms were reported in the area and the pilot reported being in the clouds during an earlier descent to 12,000 feet. An investigation revealed the aircraft was being ferried from Tulsa, OK. A previous pilot, who flew it to Oakland, refused to continue the flight due to a cabin pressurization problem. A 2nd pilot, who was going to continue the flight, returned to Oakland and landed the aircraft in an overweight condition, which resulted in structural damage. A 3rd pilot continued the flight, making stops in Hawaii and the Marshall Islands. ", "probable_cause": "Occurrence #1: missing aircraft\r\nPhase of operation: unknown\r\nFindings\r\n1. (c) reason for occurrence undetermined\r\n2. Operation with known deficiencies in equipment - performed - pilot in command\r\n3. Light condition - dark night\r\n4. Weather condition - thunderstorm\r\n5. Weather condition - icing conditions"}