{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-near-monarch-3-killed", "date": "May 31, 2000 at 1728 LT", "type": "Cessna 414 Chancellor", "operator": "Lynch-Flying-Service", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Mountains", "schedule": "Great Falls - Billings", "msn": "414-0952", "yom": 1977, "flight_number": null, "city": "Monarch", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 8000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7406, "circumstances": "During climbout, the airplane encountered an area of freezing rain resulting in rapid airframe ice accretion and loss of climb capability. The pilot informed ATC that he was unable to maintain altitude and requested and received clearance back to Great Falls, the departure airport. ATC radar showed that the airplane then began a right turn over mountainous terrain extending up to 8,309 feet prior to loss of radar contact (lower and relatively flat terrain, down to less than 5,000 feet, was located to the left of the aircraft's track.) During the last minute of radar contact, the aircraft was in a right turn at a descent rate of about 400 feet per minute; the aircraft passed less than 1/2 mile from the 8,309-foot mountain summit just prior to loss of radar contact, at an altitude of 8,400 to 8,500 feet. The aircraft crashed on the southwest flank of the 8,309-foot mountain about 1/2 mile south of the last recorded radar position. Wreckage and impact signatures at the crash site were indicative of an inverted, steep-angle, relatively low-speed, downhill impact with the terrain. The investigation revealed no evidence of any aircraft mechanical problems.", "probable_cause": "The failure of the pilot-in-command to ensure adequate airspeed for flight during a forced descent due to airframe icing, resulting in a stall. Factors included: freezing rain conditions, airframe icing, an improper decision by the pilot-in-command to turn toward mountainous terrain (where a turn toward lower and level terrain was a viable option), mountainous terrain, and insufficient altitude available for stall recovery. "}