{"url": "https://www.baaa-acro.com/crash/crash-lockheed-18-14-lodestar-near-bartlesville-8-killed", "date": "Dec 12, 1956 at 0850 LT", "type": "Lockheed 18 LodeStar", "operator": "Phillips-Petroleum-Company", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Bartlesville – Salt Lake City", "msn": "2043", "yom": 1940, "flight_number": null, "city": "Bartlesville-Frank Phillips", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 8837, "captain_hours_type": 700, "copilot_hours": 3000, "copilot_hours_type": 500, "aircraft_hours": null, "circumstances": "The purpose of this flight was to take six passengers, all Phillips' employees. from Bartlesville, Oklahoma, to Salt Lake City, Utah. Company Pilot Joe Mark Bower and company Copilot-Mechanic Robert Ellwood Ulrich were assigned to the flight by the Aviation Department of Phillips. When the aircraft was loaded and prior to leaving the ramp Copilot Ulrich called the company radio station, located on the airport, requested taxiing instructions, and asked for an IFR clearance to Salt Lake City, nonstop. The company radio operator obtained the desired clearance from ARTC through Tulsa, and immediately relayed it to the aircraft. A flight plan previously prepared contained the following information: Proposed time of departure 0805; estimated elapsed time 5 hours, 15 minutes; fuel on board 6 hours. Departure was at 0826. At that time the gross weight of the aircraft was 19,284 pounds (maximum allowable was 19.500 pounds), and the load was properly distributed with respect to allowable center of gravity limitations. About 14 minutes after takeoff, at approximately 0840, Copilot Ulrich called Bartlesville Radio and stated that the flight was having engine trouble, with an oil temperature over 100 degrees, and requested that the IFR flight plan be canceled as they might return. The Bartlesville operator complied and notified Tulsa. At the next contact, about 0845, the copilot again called Bartlesville Radio stating that they could not unfeather the propeller. At that time he asked the Bartlesville operator to determine the condition of the runways at Tulsa (about 40 miles to the south). This information was obtained and immediately relayed to the copilot, whereupon he said. \"Going to Tulsa, changing over.\" Bartlesville's single 4,600-foot runway had patches of snow and ice while all runways at Tulsa Airport were clear. This was the last radio contact with the flight. None of the messages had mentioned which engine was giving trouble; none indicated any anxiety or stress. There is no known record of N 28366 having made radio contact with any ground station or aircraft other than Bartlesville Radio. About the same time as the last radio contact, the Bartlesville radio operator and Phillips' chief pilot saw the aircraft passing south of the Bartlesville Airport heading easterly. They estimated its altitude to be 3,000 feet above the ground. The aircraft continued east for about 4-1/2 miles, until beyond the more congested part of Bartlesville, and then turned to the right about 90 degrees toward Tulsa. A number of persons saw the flight after it turned toward Tulsa. When it had been on this southerly heading for about four miles the aircraft was seen to plunge to earth in a manner described by several witnesses as a spin. Impact with the rolling terrain was on a heading of about 240 degrees, while the wings were about level, and while the nose-down angle was close to vertical. An explosion and intense fire ensued, largely destroying the general structure of the aircraft.", "probable_cause": "The Board determines that the probable cause of this accident was loss of flying speed during single-engine flight for reasons undetermined. resulting in a spin to the ground. The following findings were reported:\r\n- There was no indication of unairworthiness in the airframe or its controls, as far as could be learned,\r\n- The No. 2 (right) engine, although not subject to complete examination due to ground fire, exhibited no sins of malfunctioning,\r\n- Neither propeller nor their feathering mechanism showed any evidence of malfunctioning,\r\n- The left engine developed a bearing failure and its propeller was feathered,\r\n- The reason for the bearing failure cannot be isolated,\r\n- Single-engine flight was started for a distance of 40 Miles,\r\n- Early in this flight altitude, speed, and then control were lost, and the aircraft spun to the ground."}