{"url": "https://www.baaa-acro.com/crash/crash-antonov-24rv-stepnogorsk", "date": "Oct 4, 1989", "type": "Antonov AN-24", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tselinograd – Stepnogorsk", "msn": "47310004", "yom": 1974, "flight_number": null, "city": "Stepnogorsk", "zone": "Akmola", "country": "Kazakhstan", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 48, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 27444, "circumstances": "Following an uneventful flight from Tselinograd, the crew started the approach to the Stepnogorsk Airfield equipped with a grassy runway of 1,305 meters long. After a wrong approach configuration, the pilot-in-command was too high over the threshold and the approach speed was excessive (240 km/h iso the requested 210-220 km/h). This caused the aircraft to land too far down the runway, about 893 meters past the runway threshold. The crew started the braking procedure about 300 meters before the end of the runway so the aircraft was unable to stop within the remaining distance. It overran at a speed of 88 km/h and struck a 1,2 meter high concrete pillar that was part of the perimeter fence and came to rest. Despite the accident and the fact that the airplane was severely damaged, the captain decided to roll to the main apron so he added engine power when the aircraft hit obstacles, ditches and holes in the ground. Propellers broke away and the captain stopped the aircraft. All 52 occupants evacuated safely but the aircraft was written off. ", "probable_cause": "Wrong approach configuration on part of the crew who continued the final approach too high and at an excessive speed, causing the aircraft to land too far down a short runway. The crew failed to initiate a go-around procedure, which was considered as a contributory factor. "}