{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-shamattawa-2-killed", "date": "Oct 11, 2001 at 2333 LT", "type": "Swearingen SA226 Metro II", "operator": "Perimeter%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Gods Lake Narrows – Shamattawa", "msn": "TC-250", "yom": 1978, "flight_number": "PAG962", "city": "Shamattawa", "zone": "Manitoba", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3100, "captain_hours_type": 1100, "copilot_hours": 1200, "copilot_hours_type": 900, "aircraft_hours": null, "circumstances": "Perimeter Airlines Flight PAG962, a Fairchild SA226TC (Metroliner), with two pilots and a flight nurse on board, departed Gods Lake Narrows, Manitoba, at approximately 2300 central daylight time, on a MEDEVAC flight to Shamattawa. Approaching Shamattawa, the crew began a descent to the 100 nautical mile minimum safe altitude of 2300 feet above sea level (asl) and, when clear of an overcast cloud layer at about 3000 feet asl, attempted a night, visual approach to Runway 01. The aircraft was too high and too fast on final approach and the crew elected to carry out a missed approach. Approximately 30 seconds after the power was increased, at 2333, the aircraft flew into trees slightly to the left of the runway centreline and about 2600 feet from the departure end of Runway 01. The aircraft was equipped with a cockpit voice recorder (CVR) that indicated the crew were in control of the aircraft; they did not express any concern prior to impact. The aircraft broke apart along a wreckage trail of about 850 feet. Only the cabin aft of the cockpit retained some structural integrity. The captain and first officer were fatally injured on impact. The flight nurse was seriously injured but was able to exit the wreckage of the cabin. A post-crash fire was confined to the wings which had separated from the cabin and cockpit wreckage.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The aircraft was flown into terrain during an overshoot because the required climb angle was not set and maintained to ensure a positive rate of climb.\r\n2. During the go-around, conditions were present for somatogravic illusion, which most likely led to the captain losing situational awareness.\r\n3. The first officer did not monitor the aircraft instruments during a critical stage of flight; it is possible that he was affected by somatogravic illusion and/or distracted by the non-directional\r\nbeacon to the extent that he lost situational awareness.\r\nOther Findings:\r\n1. The absence of approach aids likely decreased the crew=s ability to fly an approach from which a landing could be executed safely.\r\n2. The company standard operating procedures (SOPs) did not define how positive rate is to be determined."}