{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-368c-woodside-beach-5-killed", "date": "Oct 29, 1991 at 1147 LT", "type": "Boeing 707", "operator": "Royal-Australian-Air-Force-3", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Richmond - §Avalon", "msn": "21103", "yom": 1975, "flight_number": "Windsor 380", "city": "Woodside Beach", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Richmond on a flight to Avalon, carrying five crew members. While cruising at an altitude of 5,000 feet along the coast, the aircraft lost height and plunged in the sea. The wreckage was found about one km off Woodside Beach and all five occupants were killed. At the time of the accident, weather conditions were good. \r\nCrew:\r\nCpt Mark Lewin, pilot,\r\nF/Lt Tim Ellis, copilot,\r\nF/Lt Mark Duncan, pilot,\r\nW/O Jon Fawcett, flight engineer, \r\nW/O Al Gwynne, loadmaster.", "probable_cause": "The Board of Inquiry concluded that the instructor devised a demonstration of asymmetric flight that was 'inherently dangerous and that was certain to lead to a sudden departure from controlled flight' and that he did not appreciate this. The Board noted there were deficiencies in the acquisition and documentation of 707 operational knowledge within the RAAF combined with the absence of effective mechanisms to prevent the erosion of operational knowledge at a time when large numbers of pilots were resigning from the air force. There was no official 707 QFI conversion course and associated syllabus and no adequate QFI instructors' manual. There were deficiencies in the documented procedures and limitations pertaining to asymmetric flight in the 707 and a lack of fidelity in the RAAF 707 simulator in the flight regime in which the accident occurred, which, assuming such a requirement existed, required actual practise in flight. 'The captain acted with the best of intentions but without sufficient professional knowledge or understanding of the consequences of the situation in which he placed the aircraft,' the Board said."}