{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6-gallup", "date": "Nov 11, 1947", "type": "Douglas DC-6", "operator": "American-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Francisco – Chicago", "msn": "43046", "yom": 1947, "flight_number": null, "city": "Gallup", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 20, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9747, "captain_hours_type": 435, "copilot_hours": 3572, "copilot_hours_type": 417, "aircraft_hours": 142, "circumstances": "Enroute from San Francisco to Chicago, the crew informed ATC that a fire erupted in the rear compartment of the aircraft and decided to divert to Gallup Airport for an emergency landing. The aircraft was difficult to maneuver and landed in flames. After it came to a halt, all 25 occupants were quickly disembarked and helped by local rescuers before the aircraft being totally destroyed by fire. ", "probable_cause": "The Board determines that the probable cause of these accidents was the combustion of gasoline which had entered the cabin heater combustion air intake scoop from the No 3 alternate tank vent due to inadvertent overflow during the transfer of fuel from the No 4 alternate tank. \r\nThe failure of the manufacturer and the Civil Aeronautics Administration to exercise full caution in the analysis of the fuel system of the DC-6 relative to proper location of fuel tank vents to provide non-hazardous location for fuel drainage, as required by existing regulations, and the insufficient attentiveness on the part of the manufacturer, the Civil Aeronautics Administration, and the air carriers to the procedures of fuel management employed by pilots operating DC-6 aircraft, were contributing factors.\r\nThis case was categorized as similar as the United Airlines' DC-6 that crashed in Bryce Canyon on October 24, 1947, killing all 52 occupants. "}