{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1049h-super-constellation-philippines-sea-107-killed", "date": "Mar 16, 1962 at 0022 LT", "type": "Lockheed L-1049 Super Constellation", "operator": "Flying%20Tiger%20Line", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Travis – Honolulu – Wake Island – Agana – Clark – Saigon", "msn": "4817", "yom": 1957, "flight_number": "FT739", "city": "Philippines Sea", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 11, "crew_fatalities": 11, "pax_on_board": 96, "pax_fatalities": 96, "other_fatalities": 0, "total_fatalities": 107, "captain_hours": 19500, "captain_hours_type": 3562, "copilot_hours": 17500, "copilot_hours_type": 3374, "aircraft_hours": 17224, "circumstances": "On March 15, 1962, sometime after its last position report at 1422 G.m.t. (22 minutes past midnight, local time), a Flying Tiger Line Inc., Lockheed 1049H, N6921C, operated as Military Air Transport Service Flight 739/14, disappeared west of the position 13 degrees 14' North Latitude and 140 degrees 00' East Longitude en route from Agana Naval Air Station, Guam, to Clark Air Force Base, Philippine Islands. A widespread and intensive search was initiated after the aircraft failed to arrive at Clark Air Force Base at 1916 G.m.t., its estimated time of arrival. The flight was officially declared missing at 2227 G.m.t. which was the estimated fuel exhaustion time for the aircraft. All occupants, 96 military passengers and a crew of 11, are missing and presumed dead. Crew members of a surface vessel witnessed what appeared to have been a midair explosion at 1530 G.m.t., near the position and at the time estimated by the pilot of N6921C for his next scheduled position report. No wreckage or debris which could be definitely associated with the aircraft has been found.", "probable_cause": "The Board is unable to determine the probable cause of this accident from the evidence now available."}