{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-f90-king-air-egelsbach-3-killed", "date": "Dec 7, 2009 at 1616 LT", "type": "Beechcraft 90 King Air", "operator": "EIMC", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bremen - Egelsbach", "msn": "LA-96", "yom": 1981, "flight_number": null, "city": "Egelsbach", "zone": "Hesse", "country": "Germany", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2200, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6069, "circumstances": "On a flight from Bremen (EDDW) to Frankfurt-Egelsbach (EDFE), a Beechcraft King Air (F90) changed from IFR to VFR rules prior to the final approach, during which it collided with trees, crashing in a wood and catching fire. On board were the pilot and two passengers. The right hand cockpit seat was occupied by a passenger who conducted radio communications. The approach to runway 27 at EDFE was chosen and executed via the so-called High Performance Aircraft Approach (HPA-approach) as published in the Aeronautical Information Publication (AIP). From 1558 hrs onwards the aircraft was under control by Langen Radar (120.8 MHz), and radar contact was confirmed by the controller. After about six minutes the controller issued the instruction: “[call sign], report if able to cancel IFR”. Subsequently, further instructions were issued to descend to altitude 5,000 ft on QNH 1,012 hPa and fly towards Egelsbach entry point Hotel 1. About four minutes later the controller gave instructions to descend to 4,000 ft, then 3,000 ft. Simultaneously, clearance was given to fly from entry point Hotel 1 to Hotel 2 and then Hotel 3. When overhead entry point Hotel 2 at 1613 hrs, the King Air reported flight conditions as ‘Victor Mike Charlie’ (VMC – Visual Meteorological Conditions) and the switch to VFR (Visual Flight Rules). At this time, the radar recorded the aircraft’s ground speed as about 180 kt. Langen Radar confirmed the report and gave an instruction to continue the descent and report passing 1,500 ft. About 42 seconds later the pilot was instructed to contact Egelsbach Info (130.9 MHz). The radar trace indicated that at this time the aircraft was at an altitude of about 1,800 ft and about 5.5 NM from the airfield. The ground speed was about 180 kt. The first radio call from the Beech to Egelsbach Info took place about 15 seconds later at 1615:06 hrs, at an altitude of about 1,500 ft and ground speed of about 190 kt. Egelsbach Info gave the information that the aircraft was north of the approach centreline and asked for a course correction to the left. They further reported the wind as Easterly at 4 knots with Runway 27 in use. After the response “[call sign], thank you” Egelsbach Info responded: “lights and flashes are on“. During the subsequent approach, the aircraft ground speed reduced over a distance of about 1.3 NM from about 190 kt to about 130 kt (distance to aerodrome about 3 NM). The radar trace indicates that from a position of 3.7 NM from the aerodrome to 2.5 NM from the aerodrome, the aircraft descended from 1,500 ft to 1,000 ft.At about 1616:03 hrs Egelsbach Info advised: “[…]coming up onto centreline”. This was acknowledged with “[call sign]”, following which Egelsbach Info advised: “you are now on centreline”. This was acknowledged with “thank you very much“. The radar trace indicates that at this time the aircraft descended from 900 ft to 800 ft. When Egelsbach Info advised “check your altitude”, the aircraft was at an altitude of about 800 ft. After a further two seconds, at 1616:18 hrs, the radar data indicated the aircraft height as about 700 ft; there was no more indication on the radar screen afterwards. In this area, the terrain is about 620 ft, with trees extending to about 700 ft AMSL. At 1616:24 hrs the aircraft was requested by Egelsbach Info to alter course slightly to the right. Neither a reply was received to this request nor to a subsequent transmission from Egelsbach Info about 22 seconds later. Egelsbach Info assumed there had been a crash and alerted the emergency services, the first of which arrived at the accident site at about 1638 hrs and found a burning wreck. ", "probable_cause": "The accident was caused by the descent during final approach which led into a fog layer and obstacles. \r\nContributing factors were: \r\n- A too high descent rate \r\n- An impaired performance and an insufficient situational awareness favored by the intake of alcohol \r\n- That no visual contact with the PAPI or airfield was established \r\n- That the on-board aids to navigation were not or not sufficiently used. \n"}