{"url": "https://www.baaa-acro.com/crash/crash-learjet-60-columbia-4-killed", "date": "Sep 19, 2008 at 2353 LT", "type": "Learjet 60", "operator": "Global-Exec-Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Columbia - Van Nuys", "msn": "314", "yom": 2006, "flight_number": null, "city": "Columbia", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3140, "captain_hours_type": 35, "copilot_hours": 8200, "copilot_hours_type": 300, "aircraft_hours": 108, "circumstances": "On September 19, 2008, about 2353 eastern daylight time, a Bombardier Learjet Model 60, N999LJ, owned by Inter Travel and Services, Inc., and operated by Global Exec Aviation, overran runway 11 during a rejected takeoff at Columbia Metropolitan Airport, Columbia, South Carolina. The captain, the first officer, and two passengers were killed; two other passengers were seriously injured. Both pilots and two passengers were killed while two others were seriously injured. Both passengers who were admitted in a local hospital for high burns were DJ AM & Travis Barker of the Rock band called \"Blink\". They were travelling back to California after they gave a concert in South Carolina.", "probable_cause": "The operator’s inadequate maintenance of the airplane’s tires, which resulted in multiple tire failures during takeoff roll due to severe underinflation, and the captain’s execution of a rejected takeoff (RTO) after V1, which was inconsistent with her training and standard operating procedures. \r\nContributing to the accident were: \r\n- Deficiencies in Learjet’s design of and the Federal Aviation Administration’s (FAA) certification of the Learjet Model 60’s thrust reverser system, which permitted the failure of critical systems in the wheel well area to result in uncommanded forward thrust that increased the severity of the accident, \r\n- The inadequacy of Learjet’s safety analysis and the FAA’s review of it, which failed to detect and correct the thrust reverser and wheel well design deficiencies after a 2001 uncommanded forward thrust accident, \r\n- Inadequate industry training standards for flight crews in tire failure scenarios, \r\n- The flight crew’s poor crew resource management (CRM)."}