{"url": "https://www.baaa-acro.com/crash/crash-antonov-12b-irkutsk-9-killed", "date": "Dec 26, 2013 at 2101 LT", "type": "Antonov AN-12", "operator": "Irkut1", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Novosibirsk - Irkutsk", "msn": "3 3 415 09", "yom": 1963, "flight_number": null, "city": "Irkutsk-2 (Northwest/Vostochny)", "zone": "Irkutsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine aircraft departed Novosibirsk-Yeltsovka Airport on a cargo flight to Irkutsk, carrying three mechanics, six crew members and a load consisting of 1,5 tons of spare parts for the Irkut Group (Sukhoi, Beriev) based in Irkutsk. On approach to Irkust-2 Airport, the crew encountered marginal weather conditions with mist and limited visibility due to the night. On short final, the aircraft deviated to the right and descended too low until it impacted military vehicles and crashed onto several barracks of the 109th Arsenal of the Russian Army, coming to rest 770 metres short of runway 14 and about 90 metres to the right of its extended centerline. The aircraft was destroyed and all nine occupants were killed. There were no victims on the ground. ", "probable_cause": "The following findings were identified: \r\n- The crew continued the descent below MDA without any visual contact with the ground, until the aircraft impacted obstacles and crashed, \r\n- The flight manager was aware of the deterioration of the weather conditions at destination with a visibility that was below minimums, but failed to inform the crew accordingly, \r\n- ATC at Irkutsk-2 Airport failed to inform the crew that he was deviating from the approach path on short final. "}