{"url": "https://www.baaa-acro.com/crash/crash-short-sc7-skyvan-3-variant-100-port-radium-3-killed", "date": "Oct 8, 2000 at 1520 LT", "type": "Short SC.7 Skyvan Variant", "operator": "Summit-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Yellowknife – Kugluktuk – Port Radium – Yellowknife", "msn": "1953", "yom": 1977, "flight_number": null, "city": "Port Radium", "zone": "Northwest Territories", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 22000, "captain_hours_type": 1000, "copilot_hours": 280, "copilot_hours_type": 100, "aircraft_hours": null, "circumstances": "At 1108 mountain daylight time on 08 October 2000, the Summit Air Charter's Short Brothers SC-7 Skyvan, serial number SH1953, departed on a visual flight rules six-hour flight from Yellowknife, Northwest Territories, to Kugluktuk, Nunavut, to Port Radium, Northwest Territories, and back to Yellowknife. The flight plan indicated a one-hour stop in Kugluktuk, with an estimated time of arrival at Yellowknife of 1710. The pilot-in-command was the chief pilot of Summit Air Charters Ltd. A cargo handler, who was also a pilot, was in the co-pilot's seat, and there was one passenger. When the aircraft failed to arrive at Yellowknife, Search and Rescue (SAR) were alerted and a search was begun. At 2202 SAR personnel confirmed that the SAR satellite was picking up an emergency locator transmitter signal in the vicinity of Port Radium. SAR aircraft were directed to the signal location and found the signal source but were not able to see the wreckage because of fog and freezing rain. The wreckage was found at 1309 the following day. The aircraft had struck the top of steeply rising hills along the east shore of Great Bear Lake, approximately 2.9 nautical miles northeast of the Port Radium airstrip. The crash site is approximately 440 feet above the lake surface and 250 feet above the airstrip elevation (see Appendix A).  The aircraft was destroyed, and the three persons on board were fatally injured.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. Although the pilot and the aircraft were certified for instrument flight, the pilot apparently continued to fly in accordance with visual flight rules after encountering marginal weather conditions and reduced visibility.\r\n2. For undetermined reasons, the pilot descended below the elevation of the terrain surrounding the airstrip, resulting in a controlled-flight-into-terrain accident.\r\nFinding as to Risk:\r\n1. Given the pilot's flying time during the 30 days before the accident, the pilot=s performance might have been affected by fatigue."}