{"url": "https://www.baaa-acro.com/crash/crash-vultee-v-1a-near-somerset-8-killed", "date": "Mar 20, 1948 at 0812 LT", "type": "Vultee V-1", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Providence – White Plains – Saint-Louis", "msn": "16", "yom": 1935, "flight_number": null, "city": "Somerset", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 3200, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3500, "circumstances": "Aircraft NC 22077 departed from Providence, Rhode Island, for White Plains, New York, at about 0730 March 19, 1948. The aircraft carried the pilot, Herman F. Burlingame III, his wife Ruth L. Burlingame, their infant daughter Kathleen, and George H. Armitage, as well as four Chow dogs and personal baggage. Arriving at Westchester Airport, White Plains, one hour and 20 minutes later, aircraft NC22077 was serviced with 118 gallons of fuel. At 0935 the aircraft departed from White Plains, the pilot telling airport officials that he intended to fly either to Hadley Field, New Brunswick, New Jersey, or Solberg-Hunterdon Airport, White House, New Jersey. Two hours and 31 minutes later the aircraft returned to White Plains, Mr. Burlingame telling airport officials that he had not landed at either of the alternative destinations. The aircraft was parked for the night, after being serviced with 85 gallons of fuel. The following morning, March 20, 1948, at 0550 the flight departed from White Plains for St. Louis, Missouri. The aircraft carried an additional four persons who had joined the original group at White Plains. The take-off weight could not be precisely determined, but it was close to the maximum allowable. No flight plan was filed with CAA Airways Traffic Control, and though NC22077 was equipped with two-way radio, no transmissions were received from the flight after its departure from White Plains. Consequently the exact route over which the flight proceeded is not known. Shortly after 0800, witnesses in the vicinity of the west portal of the Laurel Hill Tunnel of the Pennsylvania Turnpike, approximately 45 miles southeast of Pittsburgh, Pennsylvania, observed an aircraft flying at a low altitude on a northwesterly heading. It was flying in and out of low-hanging cloud fringes, and therefore, was not continuously visible. However, the aircraft was observed to approach the tunnel, circle in front of the portal, and then disappear into the overcast. After losing sight of the aircraft, some of the witnesses stated that they heard a surge of engine power, followed by the sound of a crash. Others, more distant, noticed that sound from the aircraft ceased abruptly. Since no other aircraft was observed in the vicinity at that time, there is no doubt but what it was NC22077 that these witnesses saw.", "probable_cause": "The Board determines that the probable cause of this accident was the failure from fatigue of the steel wrap-around plate of the steel attachment lower fitting at the rear spar of the right wing, causing the separation in flight of the right wing outer panel from the center panel.\r\nThe following factors were considered as contributory:\r\n- The lower edge of the steel wraparound plate of the steel lug attachment fitting of the rear spar of the outer wing panel failed from fatigue,\r\n- Evidences of fatigue in a wing attaching member would not be disclosed in the course of the usual inspection."}