{"url": "https://www.baaa-acro.com/crash/crash-bae-3101-jetstream-31-merced", "date": "Apr 19, 1993 at 2320 LT", "type": "BAe Jetstream 31", "operator": "United-Express-2", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Merced - Merced", "msn": "787", "yom": 1987, "flight_number": null, "city": "Merced", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16990, "captain_hours_type": 600, "copilot_hours": null, "copilot_hours_type": 3925, "aircraft_hours": 8873, "circumstances": "The company chief pilot/check pilot was giving a check flight to a company first officer (f/o). An FAA inspector was aboard to observe the check pilot's ability to give proficiency check flights. Soon after liftoff on the 2nd takeoff, the check pilot simulated an engine failure. The f/o, who was wearing a vision limiting device, allowed the airplane to drift to the left, but the FAA inspector noted that the f/o successfully regained directional control. The inspector then looked away from the cockpit, and when he looked back, the airplane was descending. Moments later, it collided with the ground. The FAA inspector reported that the check pilot was looking to the left, outside of the aircraft, and did not have his hand near the power quadrant. Review of the CVR tape revealed that, from the time the f/o was given the simulated left engine failure until impact, the check pilot did not say anything to the f/o. No maintenance discrepancy or material deficiency was noted during the investigation. The f/o had 3925 hours in this make/model of aircraft. ", "probable_cause": "The first officer's failure to maintain an adequate rate of climb after a single-engine loss of power was simulated, and the company check pilot's inadequate supervision and failure to note the descent. Darkness was a related factor."}