{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-500-melo", "date": "Apr 27, 2004 at 0415 LT", "type": "Fokker F27 Friendship", "operator": "FedEx", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Buenos Aires – Porto Alegre – Campinas", "msn": "10468", "yom": 1971, "flight_number": "FDX7145", "city": "Melo", "zone": "Cerro Largo", "country": "Uruguay", "region": "South America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew departed Buenos Aires-Ezeiza-Ministro Pistarini Airport on a night cargo service to Campinas-Viracopos with an intermediate stop in Porto Alegre. While cruising at an altitude of 17,000 feet, smoke was detected in the cargo compartment. The crew elected to extinguish the fire but without success. The crew contacted ATC, declared an emergency and attempted to divert to Montevideo Airport but ATC suggested the crew to divert to Melo which was the nearest airport. As this airfield was closed to traffic at this time, ATC contacted a night guard who switched on the runway lights and alerted the local emergency services. The aircraft landed 340 metres past the runway 07 threshold and stopped 640 metres further. The crew evacuated via the cockpit windows and was uninjured. The aircraft was damaged beyond repair.", "probable_cause": "Numerous oil samples, plant tissues, and several animals that were transported, would have reacted on contact with an exothermic chemical reaction and associated combustion. The event originated with the spilling of liquid from containers not suitable for differential pressure, with little excess capacity for expansion and filled with indiscriminate materials. Low stringency in filling forms for description of product delivered for shipment in company offices and little control or careless handling of the load would have contributed to the occurrence of the accident."}