{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-jamestown-1-killed", "date": "Jan 8, 2007 at 0950 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "FTBA", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Jamestown – Buffalo", "msn": "61-0592-7963262", "yom": 1979, "flight_number": null, "city": "Jamestown-Chautauqua County", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5531, "captain_hours_type": 753, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2783, "circumstances": "During the initial climb, a \"throbbing or surging\" sound was heard as the airplane departed in gusting wind conditions with a 600-foot ceiling and 1/2 mile visibility in snow. Moments later the airplane came \"straight down\" and impacted the ground. During examination of the wreckage, it was discovered that that the fuel selector switch for the right engine had been in the \"X-FEED\" position during the accident. Examination of documents discovered in the wreckage revealed, three documents pertaining to operation of an Aerostar. These documents consisted of two airplane flight manuals (AFMs) from two different manufacturers, and a checklist. Examination of the first of the AFMs revealed, that it had the name of both the pilot and the operator on the cover of the document. Further examination revealed that it had been published 4 years prior to the manufacture of the accident airplane, and contained information for a Ted Smith Aerostar Model 601P, which the operator had previously owned. This document contained no warnings regarding the use of the crossfeed system during takeoff. Examination of the second of the two AFMs found in the wreckage revealed that it was the Federal Aviation Administration (FAA) approved AFM for the accident airplane. Unlike the first AFM, the second AFM advised that the fuel selector \"X-FEED\" position should be used in \"level coordinated flight only.\" It also advised that each engine fuel selector \"must be in the ON position for takeoff, climb, descent, approach, and landing.\" It also warned that, if the airplane was not in a level coordinated flight attitude, \"engine power interruptions may occur on one or both engines\" when \"X-FEED\" is selected \"due to unporting of the respective engine's fuel supply intake port.\" Review of the checklist contained in the FAA approved AFM for the Piper Aircraft Model 601P under \"STARTING ENGINES,\" required a check of the crossfeed system prior to engine start by selecting each fuel selector to \"ON,\" then selecting \"X-FEED,\" and after verifying valve actuation and annunciator light illumination, returning the fuel selector to \"ON.\" Additionally, under \"BEFORE TAKEOFF\" It also required that the fuel selectors be checked in the \"ON\" position, and that the \"X-FEED\" annunciator light was out, prior to takeoff. Examination of the pilot's checklist revealed that, it consisted of multiple pages inserted into plastic protective sleeves and included both typed, and hand written information. A review of the section titled \"BEFORE TAKEOFF\" revealed that the checklist item \"Fuel Selectors - ON Position,\" which was listed in the AFM, had been omitted.", "probable_cause": "The pilot's incorrect selection of the right engine fuel selector position, which resulted in fuel starvation of the right engine, a loss of the right engine's power, and a loss of control during initial climb. Contributing to the accident were the pilot's inadequate preflight planning and preparation, and his improper use of the manufacturer's published normal operating procedures."}