{"url": "https://www.baaa-acro.com/crash/crash-airbus-a300b4-203f-bratislava", "date": "Nov 16, 2012 at 0525 LT", "type": "Airbus A300", "operator": "DHL", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Leipzig - Bratislava", "msn": "250", "yom": 1983, "flight_number": "DHL6321", "city": "Bratislava-Ivanka-Milan Rastislav Štefánik", "zone": "Bratislava Region", "country": "Slovakia", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew took off from Leipzig Airport at 0438LT bound for Bratislava Airport (Slovakia). The approximately forty-five minutes flight took place without incident and the crew was cleared for the ILS approach to runway 22. The Captain was PF. During the descent, the controller informed the crew that the wind was from  120° at  7  kt. The crew selected the slats and flaps at 25°. The antiskid and the autobrake were armed in MED mode. The ILS 22 approach was stable until the wheels touched down. The main landing gear touched the runway about 700 m from the threshold of runway  22. The crew deployed the thrust reversers. About six seconds after the nose gear touched, the crew felt strong vibrations that increased as the speed dropped. At 85 kt, the thrust reversers were retracted. The aeroplane veered towards the left. The PF explained that he applied energetic braking and tried in vain to counter the rocking by using the rudder pedals then the nose gear steering control. He  added that the sequence occurred so quickly that he did not think to use differential braking to try to keep the aeroplane on the runway. The aeroplane exited the runway to the left at a speed of about 45 kt. Its nose gear struck a concrete inspection pit and collapsed. The aeroplane skidded for a few dozen metres before coming to a stop. The crew evacuated the aeroplane. Between the start of the vibrations and the aeroplane stopping, it had rolled about 400 metres.", "probable_cause": "Incorrect installation of one or more washers on the nose gear torque link centre hinge made it impossible to lock the hinge shaft nut effectively. The unscrewing and the detachment of the latter in service caused the loss of nose gear steering. Free on its axle, the nose gear bogie began to shimmy, which made the aeroplane veer to the left. The aeroplane exited the runway and the nose gear collapsed during the collision with a concrete inspection pit for access to the runway lighting electric cables.The runway excursion was due to the incorrect and undetected re-assembly of the nose gear torque links. Despite the presence of a detailed diagram, the absence of clear and detailed instructions in the text of the manufacturer’s AMM, allowing the operator to ensure that the assembly was correct, contributed to the incorrect assembly. The failure of the nose gear was due to the collision with an obstacle in the runway  strip. The absence of any regulation requiring that equipment in the immediate vicinity of  a runway or of a runway overrun area be designed so as to limit as much as possible any damage to aeroplanes, in case of a runway excursion, contributed to the accident."}