{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90a-king-air-saumur-7-killed", "date": "Oct 19, 1994 at 1733 LT", "type": "Beechcraft 90 King Air", "operator": "Mono Max Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Toussus-le-Noble – Nantes – Tours – Saumur – Toussus-le-Noble", "msn": "LJ-1105", "yom": 1985, "flight_number": null, "city": "Saumur", "zone": "Maine-et-Loire", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 1817, "captain_hours_type": 56, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3761, "circumstances": "The twin engine aircraft was completing a charter flight from Toussus-le-Noble and back with stops scheduled in Nantes, Tours and Saumur. While approaching Saumur-Saint Florent Airport runway 10, the pilot informed ATC he preferred to perform a visual approach to runway 28 due to local patches of stratus west of the airfield. On short final to runway 28, the aircraft adopted a high rate of descent then struck the runway surface and came to rest on its left side, bursting into flames. The aircraft was destroyed and all seven occupants were killed, among them six directors of the French food Group Leclerc. ", "probable_cause": "It was determined that the aircraft had a valid certificate of airworthiness and was not equipped with flight data recording systems, as this category of aircraft is not subject to these regulations. The pilot was licensed as a professional pilot with the corresponding IFR rating, a rating which appeared to be deficient. The flight undertaken corresponded to a need for public passenger transport. However, the operator did not hold a public transport authorization and approval. The aircraft's collision with the ground was the result of a poor judgment of the flight conditions during the last turn on part of the pilot. It was also reported that the operating conditions meant that the pilot was left to himself in a structure that did not include guarantees in terms of training and skills control. The lack of operating procedures comparable to those encountered in a public transport company therefore remains a contributing factor."}