{"url": "https://www.baaa-acro.com/crash/crash-vickers-794d-viscount-london-14-killed", "date": "Feb 17, 1959 at 1647 LT", "type": "Vickers Viscount", "operator": "Turkish-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Government", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ankara - Rome - London", "msn": "429", "yom": 1958, "flight_number": null, "city": "London-Gatwick", "zone": "West Sussex", "country": "United Kingdom", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 5, "pax_on_board": 16, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 7716, "captain_hours_type": 216, "copilot_hours": 5504, "copilot_hours_type": 103, "aircraft_hours": 548, "circumstances": "The aircraft was on a special flight from Ankara to London via Rome with Adnan Menderes the Prime Minister of Turkey and a party of Turkish Government officials on board. The aircraft left Rome at 13:02. TC-SEV called London Airways at 15:56 after passing Abbeville and was cleared by ATC to the Epsom Radio Range station, the holding point for London Airport. Because of poor visibility at destination London (Heathrow) Airport, the London Airport Commandant decided to inform the Turkish captain that he should divert to Gatwick. At 16:21 hrs the aircraft reported over the Epsom range and was given diversion instructions. At 16:27 it left Epsom for Mayfield, the holding point for Gatwick, where it was informed by Gatwick Approach Control that it would be positioned by radar for an ILS approach to runway 09. The latest weather report for Gatwick was given as wind calm, visibility 1.1 nm, mist, cloud 3 oktas at 600 feet, QFE 1036 mb. Over the Mayfield NDB at 4,000 feet the flight was instructed to steer a course of 280 and to descend to 2,000 feet. This was acknowledged. A further descent clearance was given to 1500 feet. The aircraft overshot the centre line slightly as it turned on to the ILS approach path. At 5nm from touchdown, the aircraft affirmed that it could continue on the ILS. TC-SEV was then asked to change to tower frequency and this request was acknowledged. This was the last communication with the aircraft. At a position of some 5 km from the runway threshold and 550 feet to the north of the approach path centre line, the aircraft contacted tops of trees 390 feet amsl at the edge of Jordan's Wood. The aircraft began to disintegrate as it descended through the trees at an angle of about 6 degrees from the horizontal until the wheels made contact with the ground. After rising again slightly the main part of the wreckage came to rest about 100 yards further on and then caught fire. The Prime Minister Adnan Menderes survived the accident with nine other people while 14 other occupants were killed, among them five crew members. ", "probable_cause": "The evidence is insufficient to establish the cause of the accident. There is no indication however that this can be associated either with a technical failure of the aircraft or with a failure of the ground services. Thus it is believed the accident was the result of a controlled flight into terrain. "}