{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-75-dl-independence-1-killed", "date": "Jul 19, 1995 at 1050 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Jet Air Express", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Elmira - Kansas City", "msn": "19475", "yom": 1944, "flight_number": null, "city": "Independence", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 12534, "captain_hours_type": 2865, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16700, "circumstances": "The new owner/co-pilot of the 50-year-old airplane and another pilot, who was typed rated in the airplane, departed on a 1,700 mile ferry flight. After the first 250 mile leg, the airplane was landed at another airport with a right engine problem. The owner replaced the right engine and continued the ferry flight. Twenty minutes into the second flight, the replacement right engine lost power. The owner stated that they applied maximum power to the left engine, were unable to feather the right propeller, and performed a forced landing to a field. However, the airplane collided with trees before reaching the field, then burned after impact. Investigation revealed that during the past 5 years, the airplane had neither flown nor had an annual inspection, except for 3 recent maintenance flights, totaling 1.5 Hours. The right propeller blades had chordwise scratches. The left propeller blades had no chordwise scratches. Examination of the wreckage revealed three propeller strikes in the ground, near the right engine ground scar, and no propeller strikes in the ground, near the left engine ground scar. The right engine mixture was locked in the auto-cruise position, while the left was locked in the emergency position. Airplane charts listed the single-engine rate of climb with a feathered propeller to be 350 feet per minute, and 10 feet per minute with a windmilling propeller.", "probable_cause": "The loss of engine power for undetermined reasons, and the pilot's shutdown of the wrong engine, which resulted in a forced landing and collision with trees. "}