{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-mt-lakit-1-killed", "date": "Oct 17, 1999 at 2025 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "World Wide Air Ferries", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "No", "site": "Mountains", "schedule": "Lynn Lake – Cranbrook – Spokane", "msn": "46-22086", "yom": 1989, "flight_number": null, "city": "Mt Lakit", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On October 17, 1999, about 20:25 Mountain Daylight Time, a Piper PA-46-350P, N90D, was substantially damaged while descending to the Cranbrook Airport (CYXC), Cranbrook, British Columbia. The certificated airline transport pilot was fatally injured. Night visual meteorological conditions prevailed, and an instrument flight rules (IFR) flight plan was filed for the flight that originated near Lynn Lake (CYYL), Manitoba. The ferry flight was conducted under Canadian flight rules. According to a Transportation Safety Board of Canada Investigator, the airplane was being ferried from England to Spokane, Washington. At the last departure point, CYYL, the airplane was refueled and the pilot filed an IFR flight plan. During the flight, the pilot was in contact with Vancouver Area Control Center. While approaching CYXC, the pilot contacted Cranbrook Flight Service Station (FSS) and was provided the latest airport information. The pilot did not report any difficulties with the airplane or flight at that time. The pilot's last transmission with the FSS was about 10 miles from the airport. After attempting to contact the airplane, FSS contacted the Rescue Coordination Center, and notified them that the airplane was overdue. An emergency locator transmitter signal was received about 21:55, but the airplane was not found until the following morning. The airplane was located on the eastern side of Lakit Mountain at the 6,500-foot level, 9 miles northeast of CYXC. The weather reported by CYXC, at 20:00 was, wind from 300 degrees at 4 knots, scattered clouds at 10,000 feet, and a broken cloud layer at 24,000 feet. The pilot (sole person on board) was killed.", "probable_cause": "Controlled flight into terrain."}