{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b60-duke-bradford", "date": "Mar 31, 2003 at 1312 LT", "type": "Beechcraft 60 Duke", "operator": "SMC", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Islip - Gary", "msn": "P-458", "yom": 1978, "flight_number": null, "city": "Bradford", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4580, "captain_hours_type": 1318, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 517, "circumstances": "The pilot first reported that the engine oil temperature had dropped below what he normally observed while en route. When he tired to exercise the left propeller control, and then later tried to feather the left engine, he was unable to change the engine rpm. He then heard a pop from the right engine, and advised air traffic control (ATC), he needed to perform a landing at Bradford. He also reported a double power loss. While being radar vectored for the ILS runway 32 approach, he told ATC he was getting some power back. He was radar vectored inside of the outer marker, and broke out mid-field and high. At the departure end of the runway, he executed a right turn and during the turn, the airplane descended into trees, and a post crash fire destroyed it. A witness reported he heard backfiring when the airplane over flew the runway. When the airplane was examined, the landing gear was found down, and the wing flaps were extended 15 degrees. Neither propeller was feathered. Both engines were test run and performed satisfactorily. The left engine fuel servo was used on the right engine due to impact damage on the right engine fuel servo. The right fuel servo was examined and found to run rich. However, no problems were found that would explain a power loss, prevent the engine from running, or explain the backfiring heard by a witness. Both propellers were examined and found to be satisfactory, with an indication of more power on the left propeller than on the right propeller. The weather observation taken at 1253 included a ceiling of 1,100 feet broken, visibility 1 mile, light snow and mist. The weather observation taken at 1310 included a ceiling of 900 feet broken, visibility 3/4 mile, and light snow and mist. According to the pilot's handbook, the airplane could maintain altitude or climb on one engine, but it required the propeller to be feathered, and the landing gear and wing flaps retracted.", "probable_cause": "The pilot's improper decision to maneuver for a landing in a configuration that exceeded the capability of the airplane to maintain altitude, after he lost power on one engine for undetermined reason(s)."}