{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-alpena-3-killed", "date": "Mar 13, 1986 at 2200 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Simmons%20Airlines.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Detroit - Alpena - Saulte Sainte Marie", "msn": "110-370", "yom": 1981, "flight_number": "MQ1746", "city": "Alpena-County-Phelps-Collins", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3384, "captain_hours_type": 574, "copilot_hours": 6271, "copilot_hours_type": 21, "aircraft_hours": 9698, "circumstances": "About 2050 on March 13, 1986, Simmons Airlines flight 1746, an Embraer Bandeirante, EMB-110P1, operating as a regularly scheduled flight, departed the Detroit Metropolitan Airport en route to Sault Ste Marie, Michigan, with a stop in Alpena, Michigan. The en route portion of the flight to Alpena was uneventful. However, due to the prevailing instrument meteorological conditions, the crew was unable to complete the instrument landing system (ILS) approach and land and they declared a missed approach at 2142. At 2153, the flight was cleared for a second ILS approach to Alpena. At 2156, the crew acknowledged that radar services were being terminated. This was the last transmission from the airplane. About 2215, a motorist reported that the airplane had\r\ncrashed. The airplane was found in a wooded area about 300 feet to the left of the extended centerline, and 1 1/2 miles short of the threshold of runway 01 at Alpena. The airplane was destroyed and two of the seven passengers and one of the two crewmembers onboard were killed.\n", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was the flightcrew’s continued descent of the airplane below the glideslope and through the published decision height without obtaining visual reference of the runway for undetermined reasons. Contributing to the accident was the inefficient system used to disseminate weather-related information to the crew."}