{"url": "https://www.baaa-acro.com/crash/crash-cessna-425-conquest-i-bern-8-killed", "date": "Mar 3, 1986 at 0822 LT", "type": "Cessna 425 Conquest", "operator": "Taxair", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bern - Düsseldorf", "msn": "425-0040", "yom": 1981, "flight_number": null, "city": "Bern-Belp", "zone": "Bern", "country": "Switzerland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 1363, "captain_hours_type": 514, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1074, "circumstances": "The twin engine aircraft was engaged in a charter flight from Bern to Düsseldorf, carrying one pilot and seven employees from the textile industry. Takeoff was completed from runway 32 partially covered with wet snow and after liftoff, the aircraft encountered difficulties to gain height and passed just over trees located from either side of the Aar River. Then the aircraft lost height, initiated a left turn then stalled and crashed in a snow covered field located near a wood, about 1,250 meters northwest of runway 14 threshold and 600 meters to the left of its extended centerline. The aircraft was destroyed and all eight occupants were killed. ", "probable_cause": "The accident was the consequence of a loss of control during initial climb in poor weather conditions. The following contributing factors were reported:\r\n- The runway was contaminated with wet snow, \r\n- Possible ice on wings and tail, \r\n- High drag because the gear was still down, \r\n- The total weight of the aircraft was 102 kilos above MTOW,\r\n- The CofG was 0,56 inch (1,42 cm) beyond the aft limit, \r\n- The pilot suffered high psychological tension,\r\n- It is possible that the flaps were lowered at an angle of 15° prior to takeoff, during takeoff and during initial climb, which may reduce lift and increase drag. \n"}