{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-2-112-daytona-beach-4-killed", "date": "Aug 10, 1937 at 0440 LT", "type": "Douglas DC-2", "operator": "Eastern-Airlines-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago – Indianapolis – Louisville – Nashville – Chattanooga – Jacksonville – Daytona Beach – Miami", "msn": "1289", "yom": 1934, "flight_number": "EA007", "city": "Daytona Beach", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after takeoff at night and in good weather conditions, while in initial climb, the aircraft hit an electric pole with its left wing, stalled and crashed in a wooded area located past the runway end. Two passengers and both pilots were killed while five other occupants were seriously injured.\r\nCrew:\r\nStuart G. Dietz, pilot, †\r\nRobert R. Road, copilot, †\r\nBryan W. Merrill, steward.\r\nPassengers:\r\nJ. F. Phillpotts, †\r\nPeter Phillpotts.\n", "probable_cause": "With respect to the erection of the poles in question, it does not appear that the Power and Light Company gave formal or informal notification of the fact of their erection prior to, during the course of, or at the completion of their erection, to the operators of the aircraft, the airport authorizations, or to any other governmental authority concerned with the safety of operation of aircraft at the airport, Furthermore, it was established the these poles were not lighted or marked in any manner which would serve to warn the crew of aircraft NC13739 of their presence. \r\nTo establish the element of notice, the company claimed that one of its employees, who had investigation the failure in the underground circuit, used the public telephone in the Administration Building of the airport to call his office and report the trouble to his superior and to advise the erection of an overhead line. This call was reported to have been made between 7:30 and 9:30 p.m., August 9, that later, during the installation of the poles and wires, another of its employees used the same telephone, that the men on duty in the airport office should have observed the men at work along the road with their equipment and lights, setting up the poles and stringing the wire, and also that the air lines using the airport know from previous occasions that, as a temporary measure, such poles had been set up to give service to customers. It appears from the Board investigation that the condition and functioning of the aircraft and its power plant were normal, and that the take-off likewise was normal. Its is the  opinion of the Board that the probable cause of this accident was the absence of reasonable notice to those operating and navigating the aircraft that an object had been erected which constituted a hazard to the aircraft taking off. \n"}