{"url": "https://www.baaa-acro.com/crash/crash-aerospatiale-sn601-corvette-cordoba-1-killed", "date": "Nov 25, 2000 at 0604 LT", "type": "Aérospatiale SN.601 Corvette", "operator": "Mayoral Executive Jet", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Málaga - Córdoba", "msn": "27", "yom": 1976, "flight_number": "MYO611", "city": "Córdoba", "zone": "Andalusia", "country": "Spain", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6232, "captain_hours_type": 3251, "copilot_hours": 1875, "copilot_hours_type": 22, "aircraft_hours": 5743, "circumstances": "The aircraft departed Málaga-Pablo Ruiz Picasso Airport at 0543LT on a positioning flight to Córdoba. On board were two pilots who were flying to Córdoba to pick up a medical team for a transplantation mission. Fifteen minutes after takeoff, the crew started the descent but encountered poor visibility due to the night and foggy conditions. At that moment, the horizontal visibility was 300 metres and the vertical visibility about 500 feet. As Córdoba Airport was not equipped with an ILS system, the crew decided to attempt an approach via a GPS system. On final approach, the aircraft was too low, struck a utility pole then crashed onto a uninhabited house located 1,500 metres short of runway 21. The aircraft was destroyed, one pilot was killed and the second was seriously injured. ", "probable_cause": "The accident occurred when the aircraft crew carried out an approach maneuver to Córdoba Airport in conditions of very reduced visibility in fog, based exclusively on the GPS receiver of the communications navigation system installed in the aircraft and without reliably monitoring the ground separation. It is likely that the decision to carry out this maneuver was influenced by a pressure to complete the mission, self-generated by the crew members, or self-generated by the pilot-in-command, and induced or not by him and the copilot, as a consequence of an urgent humanitarian operation that entrusted about the confidence of the pilot-in-command and his experience, the navigation system that equipped the aircraft and the knowledge of the destination airport."}