{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47-dl-warrnambool", "date": "Apr 2, 1965 at 0817 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Airlines%20of%20NSW-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Warrnambool – Melbourne", "msn": "9105", "yom": 1943, "flight_number": "WX001", "city": "Warrnambool", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 20, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6181, "captain_hours_type": 1738, "copilot_hours": 1770, "copilot_hours_type": 1561, "aircraft_hours": null, "circumstances": "Flight No. 1 was a scheduled domestic flight from Hamilton to Melbourne via Warrnambool, Victoria, and the aircraft landed at Warrnambool at 2159 hours GMT after an uneventful flight. After a stay on the ground of 17 minutes, during which time there were load changes, the aircraft taxied for take-off on runway 31. The pre-take-off checks did not indicate any abnormality and the aircraft proceeded to take off. After becoming airborne, but prior to undercarriage retraction, a loss of engine power occurred and the pilot- in-command deduced that the port engine had failed. He feathered the port engine and then became aware that the starboard engine was delivering only partial power, which was insufficient to sustain the aircraft in flight. A suitable area was selected immediately and a landing with wheels and flaps retracted was made in grassy paddocks on level terrain, but the aircraft passed through three fences before coming to rest. All occupants survived while the aircraft was written off. ", "probable_cause": "The cause of the accident was that the pilot-in-command, on becoming aware of a loss of engine power, took action to feather the propeller after adopting procedures which failed to ensure correct identification of the defective engine. "}