{"url": "https://www.baaa-acro.com/crash/crash-cessna-402-lantana-1-killed", "date": "Jan 11, 1992 at 1147 LT", "type": "Cessna 402", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Lantana - Jacksonville", "msn": "402B-0617", "yom": 1974, "flight_number": null, "city": "Palm Beach County Park-Lantana", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10400, "captain_hours_type": 300, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5501, "circumstances": "Flight departed and upon reaching a point approx 35 miles north of airport pilot requested return to airport from ATC. Pilot did not declare emergency or report an engine problem. Upon entering traffic pattern at uncontrolled airport pilot stated he would follow a Cessna 152 for landing. On short final aircraft was seen making s turns to maintain spacing behind 152. Pilot then declared he had an engine shutdown and needed to land. 152 was in landing flare and landed. With 152 on runway pilot attempted a go around with full flaps extended, gear down, left engine shutdown, and at a slow airspeed. Aircraft rolled to left upon application of right engine power and nosed down from which it crashed. The number two cylinder of the left engine had suffered separation of the head from the barrel. Pilot logbook did not reflect pilot having current biennial flight review. The pilot, sole on board, was killed. ", "probable_cause": "The pilot in commands failure to maintain airspeed above single engine minimum control speed resulting in an inflight loss of control and collision with terrain. Contributing to the accident was the pilot in command's failure to declare an emergency and request priority landing and his decision to follow a slower aircraft in the pattern."}