{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-25-dk-atlanta", "date": "Jun 15, 1954 at 1745 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Delta-Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Atlanta – Chattanooga – Knoxville – Cincinnati – Chicago", "msn": "13759", "yom": 1944, "flight_number": "DL134X", "city": "Atlanta-William Berry Hartsfield", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6014, "captain_hours_type": 4575, "copilot_hours": 6803, "copilot_hours_type": 6800, "aircraft_hours": 18827, "circumstances": "As the aircraft became airborne the landing gear was retracted. Light rain was encountered at this time. When the air-craft had climbed to 200 to 250 feet, power was reduced to 35 inches of manifold pressure and a shallow right turn was begun. Before a reduction in r.p.m. was made the aircraft began to settle and the airspeed was observed to decrease rapidly from above 105 to 80 knots. The nose was immediately lowered to level flight, & the turn stopped, and full power applied. When this was done, the air-speed returned to about 100 knots and the settling appeared to lessen considerably. The increased airspeed with the attendant better flying characteristics was monetary, however, as the airspeed abruptly dropped to 60 knots and the airplane again began to settle. As the aircraft continued to settle and it became obvious that it was going to strike the ground, the first officer attempted to raise tile nose. Upon feeling the aircraft strike the ground, both throttles were closed. The aircraft then skidded to a stop in a wooded area approximately 600 feet north-west of the far end of runway 21. The airplane was destroyed and both pilots were injured. ", "probable_cause": "The Board determines that the probable cause of this accident was a rapid loss of airspeed immediately following takeoff caused by unexpected, strong gusts or divergent winds accompanying a local rain shower. The following findings were reported:\r\n- At the time of takeoff a large thunderstorm was 8 to 10 miles south of the airport and a local rain shower was approaching the southeast end of runway,\r\n- The aircraft took off from runway 21 and climbed to approximately 200 to 250 feet,\r\n- A portion of the rain shower was encountered which contained strong gusts,\r\n- While in the rain shower the aircraft lost airspeed and settled to the ground."}