{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-ii-near-benalla-6-killed", "date": "Jul 28, 2004 at 1048 LT", "type": "Piper PA-31 Cheyenne", "operator": "D & R Henderson", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Mountains", "schedule": "Bankstown – Benalla", "msn": "31-7920026", "yom": 1979, "flight_number": null, "city": "Benalla", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 14017, "captain_hours_type": 3100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5496, "circumstances": "At 0906 Eastern Standard Time on 28 July 2004, a Piper Aircraft Corporation PA31T Cheyenne aircraft, registered VH-TNP, with one pilot and five passengers, departed Bankstown, New South Wales on a private, instrument flight rules (IFR) flight to Benalla, Victoria. Instrument meteorological conditions at the destination necessitated an instrument approach and the pilot reported commencing a Global Positioning System (GPS) non-precision approach (NPA) to Benalla. When the pilot had not reported landing at Benalla as expected, a search for the aircraft was commenced. Late that afternoon the crew of a search helicopter located the burning wreckage on the eastern slope of a tree covered ridge, approximately 34 km southeast of Benalla. All occupants were fatally injured and the aircraft was destroyed by impact forces and a post-impact fire. ", "probable_cause": "Significant factors:\r\n1. The pilot was not aware that the aircraft had diverged from the intended track.\r\n2. The route flown did not pass over any ground-based navigation aids.\r\n3. The sector controller did not advise the pilot of the divergence from the cleared track.\r\n4. The sector controller twice cancelled the route adherence monitoring alerts without confirming the pilot’s tracking intentions.\r\n5. Cloud precluded the pilot from detecting, by external visual cues, that the aircraft was not flying the intended track.\r\n6. The pilot commenced the approach at an incorrect location.\r\n7. The aircraft’s radio altimeter did not provide the pilot with an adequate defence to avoid collision with terrain.\r\n8. The aircraft was not fitted with a terrain awareness warning system (TAWS)."}