{"url": "https://www.baaa-acro.com/crash/crash-aero-commander-500-near-ardestan-5-killed", "date": "Apr 17, 1961 at 1000 LT", "type": "Rockwell Aero Commander 500", "operator": "Air Taxi Company (Iran)", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Shiraz – Marvdasht – Tehran", "msn": null, "yom": null, "flight_number": null, "city": "Ardestan", "zone": "Isfahan", "country": "Iran", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 2866, "captain_hours_type": 503, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 16 April the aircraft departed Mehrabad Airport at 0228Z on a charter flight to Yazd and Bandar Abbas. On the same day the first stage of the return flight was made to Shiraz where an overnight stop was made. Next day EP-ABA left Shiraz at 0245Z to pick up four passengers at Marvdasht. At 0525Z it departed Marvdasht on a direct flight to Mehrabad Airport, Tehran, ETA 0800Z. A last contact was made with Esfahan at 0630Z reporting its position as 20 miles east of Esfahan - VFR, flight level 150, ETA Mehrabad 0800Z. This was the last message received from the aircraft. On 19 April word was received at Mehrabad Airport that the aircraft had crashed on the mountain 40 km south of Ardestan and 18 km west of Zafarkand Village. The pilot and four passengers were killed in the accident and the aircraft was destroyed. ", "probable_cause": "The pilot was unexpectedly confronted with severe carburetor icing conditions. A loss of engine power resulting from this impelled him to descend through the cloud layer when possibly the icing conditions became considerably worse, thus rendering a quick melting of the carburetor ice problematic. His already serious situation was intensified due to breaking cloud over mountainous terrain under conditions of bad visibility. In an effort to avoid the mountain barriers confronting him, he endeavored to fly through a narrow gorge and a visible gap at the top. He, however, to a still greatly diminished power from the persistent effects of carburetor icing, together with the most imposing turbulence and downdraught effects that he would undoubtedly encounter in the crest area, his attempt failed. Unfortunately, the protruding rock formation which he first hit presented a further great obstruction at the most critical point of his passage."}