{"url": "https://www.baaa-acro.com/crash/crash-gaf-nomad-n22s-mona-island-1-killed", "date": "Sep 18, 1998 at 1428 LT", "type": "GAF Nomad N.22", "operator": "US%20Customs", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Aguadilla - Willemstad", "msn": "160", "yom": 1983, "flight_number": null, "city": "Mona Island", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4286, "captain_hours_type": 982, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2983, "circumstances": "Two U.S. Customs Service airplanes collided in formation cruise flight while being evacuated from Borinquen, Puerto Rico, to Curacao, Dutch Antilles, due to an approaching hurricane. While in cruise flight at 6,500 ft. msl, N6305U maneuvered closer to the lead airplane, N6302W, to take some photographs. Several minutes later, N6305U's right side of the vertical stabilizer collided with the left side of the nose of N6302W. N6305U was ditched while on short final to an airstrip due to a lack of airplane controllability, while N6302W returned to Borinquen and landed without incident. Prior to departure, the crewmembers of both airplanes were directed to fly as a flight of two. Neither of the second-in-commands (SICs) of either airplane had any previous formation flying training, nor was it approved for the flight. Interviews with U.S. Customs personnel revealed that formation flight occurred, as did photographs taken from the SIC aboard N6305U during the accident flight. The U.S. Customs Service required two pilots to operate the airplane due to mission equipment installation.", "probable_cause": "The failure of the pilot-in-command of N6305U to maintain physical clearance from the other aircraft (N6302W). Contributing factors were the inadequate visual lookout of all four pilots involved. "}