{"url": "https://www.baaa-acro.com/crash/crash-saab-340-hsinchu-13-killed", "date": "Mar 18, 1998 at 1932 LT", "type": "Saab 340", "operator": "Formosa%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Hsinchu - Kaohsiung", "msn": "337", "yom": 1993, "flight_number": null, "city": "Hsinchu", "zone": "Hsinchu City (新竹市)", "country": "Taiwan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8076, "circumstances": "When the crew boarded the aircraft in Hsinchu for the flight to Kaohsiung it had been a long and demanding day for the captain who was to fly the aircraft. He had been on duty more than 11 hours and performed nine flights. The accident flight, which was planned to be his last flight of the day, was to take place in darkness. The weather was above minima but IMC. During the pre-flight check the crew noted a failure in the RH Main Bus. This caused a number of systems to be unavailable, a.o.: the autopilot, the left hand EFIS, LH/RH Flight Director, LH RMI, EFIS Comparators, and the no. 2 engine anti-ice start bleed valve being open (as a result of this, the ITT on this engine was approximately 15°C higher than normal at selected power on this engine). Despite the fact that, according to the Minimum Equipment List (MEL), taking off for a flight with any of the Main Buses inoperative was not allowed, the captain decided to continue. During taxi to runway 05 the aircraft was cleared for a Chunan One (CN1) departure. The aircraft took off at 19:29:09. Because of the autopilot was not available, the captain now had to fly manually. In addition, the flying had to be performed without support from the yaw-damper that was also inoperative as a result of the RH Main Bus failure. This means that more active rudder control was required, while the DFDR-data shows that such input was not made. The more than 30°C ITT-split between the engines, of which approximately 15°C was caused by the RH Engine Anti-ice Start Bleed Valve being open, did have little effect on the behavior of the aircraft in the initial start-sequence. But when the crew, 30 seconds after lift off, disengaged CTOT and started to manually adjust the RH PLA downwards, possibly to get equal ITT in the engines, this ended up in a torque-split of more than 13% between the engines, with the RH engine being lower in torque. This asymmetry tended to yaw and roll the aircraft to the right and required higher aileron input than normal to the left in order to keep the aircraft at a constant bank angle. Normally the flaps are retracted at around 1,000 feet during initial climb. In this flight the flap retraction was not initiated until the first officer was reading the Climb Check List in which the flap position should be checked and verified. Flap retraction was done just prior to the aircraft reaching VFE15 (175 KIAS, which is the maximum allowed speed with flaps extended). When the climb power was set, a symmetric PLA change was made. However, due to the earlier RH Power Lever Angle (PLA) pull in combination with the normal backlash in the power lever cables between the PLA and the HMU, the RH engine torque was decreased while the LH engine torque remained unchanged. Hence, a torque split occurred. This resulted in an increased aerodynamic asymmetry giving a force tending to yaw and bank the aircraft to the right. Consequently, still more aileron input was required in order to maintain a correct bank angle. Because the behavior of the aircraft was very different from what the captain was used to, the need for continuous manual flying under IMC-conditions may have totally occupied his capacity. This could also explain why, during this phase of flight, he did not observe the aircraft starting a turn to the right 78 seconds after take off instead of continuing the left turn for a heading of 260. At about this same time, and for no obvious reasons, the positive rate of climb decreased and the aircraft leveled out at approximately 2,000 feet for a short time instead of continuing the climb to its assigned altitude of 3,000 feet. The captain's actions could be interpreted as signs that he might have been suffering from fatigue or spatial disorientation. It is difficult to determine if the F/O was aware of the captain's deviation from the cleared departure route. All indications point to the fact that he was not aware or that he out of respect for the captain did not report of the deviations. For example, the F/O transmitted back to Taipei Approach 114 seconds after takeoff, \"Left 230, Bravo 12255,\" while at the same time the aircraft was in a right turn with a 21 degree right bank, passing through a heading of 312 degrees. In fact, his primary means for monitoring the flight were very limited due to dark, IMC-conditions since his EFIS instruments were black or flagged. This could also explain why the captain did not receive any support from the F/O about the flight becoming more and more uncontrolled. Not until 124 seconds after takeoff and 37 seconds prior to the last DFDR-recording did the captain state that he was having a problem with the heading and asked for help with the magnetic compass. At that time the aircraft was in a 24° right bank and 10° pitch up position and had a heading and roll rate by one degree per second. From that moment a continuous decrease in pitch angle was recorded down to -65,4° just prior to the impact. Just 19 seconds before the last DFDR-recording, with a heading of 022 and a bank angle of 36° to the right, the captain said \"Ask for a radar vector.\" At this moment, he also initiates a short aileron input to the right, further increasing the bank angle. The other crewmembers did not answer or give any notable response to the captain's request for help with the magnetic compass. The reason might be that they also were very confused about the situation and unable to take any relevant action. When the captain, 14 seconds before the last DFDR-recording, said \"Wah Sei!!! Everything is wrong.\" the aircraft was in a 8,4° pitch down and the right bank angle was 47,5°. Finally, only 10 seconds before the last data point was recorded, the first officer responds by asking \"Sir, shall we look at this one? \". Pitch down was then 15,8° and the right roll angle 71,7°. In the last part of the flight the pitch and bank angles were at extreme values not to be experienced in normal operation. At this stage of the flight, the control inputs recorded are rapid aileron inputs to the right that further increased the adverse attitudes. The aircraft was then totally uncontrolled and the airspeed and sink rate increased dramatically. Four seconds before impact the Vmo warning started. The aircraft then crashed into the sea.", "probable_cause": "The following factors were identified:\r\n- The flight crew's failure to maintain the situational awareness resulting in the loss of aircraft control,\r\n- The failure of R/H main electrical bus resulting in the malfunction of R/H navigation system and flight instruments,\r\n- Flight crew did not comply with MEL,\r\n- Night time and IMC resulted in no or limited visual reference for the flight crew,\r\n- The captain conducted the flight in a fatigue and spatial disorientation condition,\r\n- Flight crew did not comply with standard operation procedures."}