{"url": "https://www.baaa-acro.com/crash/crash-dornier-do228-201-siglufjordur", "date": "Jun 23, 2004 at 1941 LT", "type": "Dornier DO228", "operator": "Islandsflug.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sauðárkrókur - Siglufjörður", "msn": "8070", "yom": 1985, "flight_number": null, "city": "Siglufjörður", "zone": "Northeastern Region (Norðurland eystra)", "country": "Iceland", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8400, "captain_hours_type": 2345, "copilot_hours": 1117, "copilot_hours_type": 253, "aircraft_hours": null, "circumstances": "Following an uneventful passenger flight from Reykjavik to Sauðárkrókur, the crew decided to fly to Siglufjörður Airport to perform a competence control flight for this airfield. On approach in good weather conditions (visibility over 10 km with clouds at 1,500 feet), the captain disconnected the GPWS system to avoid repetitive alarms. After landing on runway 07, he attended to perform a touch-and-go so he increased engine power and took off. During initial climb, the landing gears were raised and the crew made a right hand turn circuit at an altitude of 500 feet. Following a second approach to runway 07, the aircraft landed on its belly and slid for 280 metres before coming to rest. Both pilots evacuated safely while the aircraft was damaged beyond repair. ", "probable_cause": "Belly landing after the crew failed to follow the approach checklist and failed to lower the landing gear for a second touch-and-go manoeuvre. The following contributing factors were identified: \r\n- The crew failed to check that the three green lights were ON, \r\n- The aircraft was unstable on final approach, \r\n- The captain took over control without knowing how to proceed for the approach, \r\n- The presence of birds in the vicinity of the runway disturbed the crew, \r\n- The landing gear alert system was not properly set,\r\n- The right hand circuit was completed at a low altitude of 500 feet. "}