{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-chigwell-2-killed", "date": "Oct 3, 2015 at 1020 LT", "type": "Beechcraft 200 Super King Air", "operator": "London-Executive-Aviation-2", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Stapleford - Brize Norton", "msn": "BB-966", "yom": 1982, "flight_number": null, "city": "Stapleford", "zone": "Essex", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1941, "captain_hours_type": 162, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14493, "circumstances": "G-BYCP was planned to operate a non-commercial flight from Stapleford Aerodrome to RAF Brize Norton with two company employees on board (including the pilot) to pick up two passengers for onward travel. The pilot (the aircraft commander) held a Commercial Pilot’s Licence (CPL) and occupied the left seat and another pilot, who held an Airline Transport Pilot’s Licence (ATPL), occupied the right. The second occupant worked for the operator of G-BYCP but his licence was valid on Bombardier Challenger 300 and Embraer ERJ 135/145 aircraft and not on the King Air. The pilot reported for work at approximately 0715 hrs for a planned departure at 0815 hrs but he delayed the flight because of poor meteorological visibility. The general weather conditions were fog and low cloud with a calm wind. At approximately 0850 hrs the visibility was judged to be approximately 600 m, based on the known distance from the operations room to a feature on the aerodrome. At approximately 0915 hrs, trees were visible just beyond the end of Runway 22L, indicating that visibility was at least 1,000 m and the pilot decided that conditions were suitable for departure. At 0908 hrs, the pilot called the en-route Air Navigation Service Provider (ANSP) on his mobile phone to ask for a departure clearance. He was instructed to remain clear of controlled airspace when airborne and call London Tactical Control Northeast (TCNE) on 118.825 MHz. The planned departure was to turn right after takeoff and intercept the 128° radial from Brookman’s Park VOR (BPK) heading towards the beacon, and climb to a maximum altitude of 2,400 ft amsl to remain below the London TMA  which has a lower limit of 2,500 ft amsl. The aircraft took off at 0921 hrs and was observed climbing in a wings level attitude until it faded from view shortly after takeoff. After takeoff, the aircraft climbed on a track of approximately 205°M and, when passing approximately 750 ft amsl (565 ft aal), began to turn right. The aircraft continued to climb in the turn until it reached 875 ft amsl (690 ft aal) when it began to descend. The descent continued until the aircraft struck some trees at the edge of a field approximately 1.8 nm southwest of the aerodrome. The pilot and passenger were both fatally injured in the accident, which was not survivable. A secondary radar return, thought to be G-BYCP, was observed briefly near Stapleford Aerodrome by London ATC but no radio transmission was received from the aircraft. A witness was walking approximately 30 m north-east of where the aircraft struck the trees. She suddenly heard the aircraft, turned towards the sound and saw the aircraft in a nose‑down attitude fly into the trees. Although she saw the aircraft only briefly, she saw clearly that the right wing was slightly low, and that the aircraft appeared to be intact and was not on fire. She also stated that the aircraft was “not falling” but flew “full pelt” into the ground.", "probable_cause": "Examination of the powerplants showed that they were probably producing medium to high power at impact. There was contradictory evidence as to whether or not the left inboard flap was fully extended at impact but it was concluded that the aircraft would have been controllable even if there had been a flap asymmetry. The possibility of a preaccident control restriction could not be discounted, although the late change of aircraft attitude showed that, had there been a restriction, it cleared itself. The evidence available suggested a loss of aircraft control while in IMC followed by an unsuccessful attempt to recover the aircraft to safe flight. It is possible that the pilot lost control through a lack of skill but this seemed highly unlikely given that he was properly licensed and had just completed an extensive period of supervised training. Incapacitation of the pilot, followed by an attempted recovery by the additional crew member, was a possibility consistent with the evidence and supported by the post-mortem report. Without direct evidence from within the cockpit, it could not be stated unequivocally that the pilot became incapacitated. Likewise, loss of control due to a lack of skill, control restriction or distraction due to flap asymmetry could not be excluded entirely. On the balance of probabilities, however, it was likely that the pilot lost control of the aircraft due to medical incapacitation and the additional crew member was unable to recover the aircraft in the height available."}