{"url": "https://www.baaa-acro.com/crash/crash-cessna-t207-skywagon-homer-1-killed", "date": "Feb 6, 1998 at 1245 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Southcentral%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Homer - English Bay", "msn": "207-0020", "yom": 1969, "flight_number": null, "city": "Homer", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1358, "captain_hours_type": 48, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11192, "circumstances": "The certificated commercial pilot was departing on a 14 CFR 135 cargo flight. The airplane lifted off and climbed to about 200 feet. Instead of turning right toward the intended destination, the airplane began a left turn toward the runway. The angle of bank increased to about 45 degrees. The airplane then nosed down, and descended into snow covered terrain, about 200 yards north of the runway. Examination of the engine revealed the number six cylinder head was fractured, and slightly separated from the cylinder barrel. The area around the point of separation was blackened and oily. Similar discoloration was noted on the inside of the engine cowl. A metallurgical examination of the cylinder head revealed a fatigue fracture along a large segment of the thread root radius between the 5th and 6th threads. The engine's cylinder compression is part of the operator's approved airworthiness inspection program. The number six cylinder compression, recorded 121 hours before the accident, was noted as 60 PSI. The last engine inspection, 27 hours before the accident, did not include a record of the engine compression. ", "probable_cause": "A fatigue failure, and partial separation of the number 6 engine cylinder head assembly, the operator's inadequate progressive inspection performed by company maintenance personnel, and the pilot's inadvertent stall during a maneuvering turn toward an emergency landing area. "}