{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-92c-yap-island", "date": "Nov 21, 1980 at 0952 LT", "type": "Boeing 727-100", "operator": "Air%20Micronesia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Saipan – Agana – Yap – Palau", "msn": "19174", "yom": 1966, "flight_number": "CO614", "city": "Colonia", "zone": "Yap Island", "country": "Federated States of Micronesia", "region": "Oceania", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 67, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14000, "captain_hours_type": 700, "copilot_hours": 7000, "copilot_hours_type": 5500, "aircraft_hours": 30878, "circumstances": "Air Micronesia Flight 614 departed Saipan at 07:30 for a flight to Palau with intermediate stops in Guam and Yap, Western Caroline Islands. The aircraft departed Guam at 08:30 and climbed to FL350. An en route descent to Yap was made from the north through broken to scattered clouds and the captain, who was flying the aircraft, turned onto a downwind leg at the northeast portion of the airport. The downwind leg was flown at an altitude of 600 feet above the runway 07 elevation while the crew checked to see if the runway was clear, to see if the fire truck was in place, and to see the direction of the windsock. The flaps were set at 30° on the base leg. Abeam the approach end of runway 07, the captain began a right 90° and a left turn manoeuvre to align the aircraft with the final approach to runway 07. During a portion of the downwind leg, the captain relinquished control of the aircraft to the first officer while the captain took pictures of the airport. He then resumed control and passed the camera to the second officer and asked him to take pictures of the runway. As the aircraft passed through 90deg from the runway heading, it had descended to about 300 feet above the runway elevation of 52 feet msl. When the aircraft was aligned with the runway heading, it was about 480 feet above runway elevation at a point 1.5 miles from the approach end of the runway. At 09:52 the aircraft touched down 13 feet short of runway 07. The right main landing gear immediately separated from the aircraft. The aircraft gradually veered off the runway and came to rest in the jungle about 1,700 feet beyond the initial touchdown. A severe ground fire erupted immediately along the right side of the aircraft as it came to rest. All occupants had evacuated within about 1 minute after the aircraft came to rest.", "probable_cause": "The Captain's premature reduction of thrust in combination with flying a shallow approach slope angle to an improper touchdown aim point. These actions resulted in a high rate of descent and a touchdown on upward sloping terrain short of the runway threshold, which generated loads that exceeded the design strength and failed the right-hand landing gear. Contributing to the accident were the Captain's lack of recent experience in the B-727 aircraft and a transfer of his DC-10 aircraft landing habits and techniques to the operation of the B-727 aircraft."}