{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-near-brevard-1-killed", "date": "Nov 12, 1982 at 0514 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Hill-Williford Aviation", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Columbus - Asheville", "msn": "31-7652401", "yom": 1976, "flight_number": null, "city": "Brevard", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3300, "captain_hours_type": 900, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5131, "circumstances": "After a missed approach at Asheville the flight was cleared to the Greenville-Spartanburg Airport at Greer, SC. Enroute to Greer radar contact was lost. In response to a query from Atlanta artcc the pilot verified his position as being on the 235° radial of Spartanburg VOR and 11.9 miles southwest. He was then cleared to descend to 2,700 feet and execute an ILS approach. The aircraft impacted a mountain at the 3,200 feet level. The wreckage was found on the 235° radial of the Sugarloaf mountain vortac and at 24 miles. Review of the aircraft's logbook revealed that mechanical irregularities reported were not corrected for long periods of time. No corrective action was listed for an \"outer marker inop aural and visual (needs to be fixed now, since ADF is also inoperative) and 'light in #2 VOR head out'. The marker beacon was described as inoperative on three dates beginning 22 August 1981 and the ADF was described as inoperative on seven dates beginning 8 May 1981. No corrective action was listed for any entry about the marker beacon or ADF. The pilot, sole on board, was killed. ", "probable_cause": "Occurrence #1: in flight collision with terrain/water\r\nPhase of operation: descent - normal\r\nFindings\r\n1. (f) comm/nav equipment - inoperative\r\n2. (f) maintenance - not performed - company maintenance personnel\r\n3. (f) operation with known deficiencies in equipment - attempted - pilot in command\r\n4. (f) company-induced pressure - company/operator management\r\n5. (f) light condition - dark night\r\n6. (f) weather condition - low ceiling\r\n7. (f) missed approach - performed - pilot in command\r\n8. (c) ifr procedure - improper - pilot in command\r\n9. (c) flight/navigation instrument(s) - improper use of - pilot in command\r\n10. (f) company-induced pressure - company/operator management\r\n11. (f) excessive workload (task overload) - pilot in command"}