{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-tu-6a-beaver-burlington-5-killed", "date": "Dec 6, 1970", "type": "De Havilland DHC-2 Beaver", "operator": "United%20States%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Burlington - Laconia - Bedford - Warwick", "msn": "253", "yom": 1952, "flight_number": null, "city": "Burlington", "zone": "Vermont", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "LTC Mendes of the U.S. 1st Army borrowed the plane, designated as a TU-6A from the Rhode Island Army National Guard on the previous day (Saturday) under the pretence of obtaining additional flight time for his certification.  Officially, Mendes’ mission was to deliver a helicopter part to the Vermont Army National Guard. He took off from the Theodore Francis Green airport in Warwick, RI., and flew to Burlington, VT., with two stops en route – contrary to his official flight plan. At Hanscom Field in Bedford, MA., he picked up three persons – all unauthorized civilians. In Laconia, NH., they were joined by another unauthorized civilian. On arrival in Burlington, they stopped overnight. Sunday afternoon, the TU-6A Beaver took off from Burlington in a serious snow squall and shortly after lift-off LTC Mendes radioed that he was experiencing trouble with an aileron. The aircraft subsequently spun into the ground. It appears that no pre flight check was completed and the accident was caused by a build up of ice on the wings. The aircraft is reported as destroyed and the pilot and the four passengers received fatal injuries.\r\nSource: www.dhc-2.com", "probable_cause": "The aircraft stalled after takeoff due to an excessive accumulation of ice on wings and fuselage. Poor flight preparation as the aircraft was not deiced prior to departure. "}