{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-27-bujari", "date": "Sep 22, 2001 at 1207 LT", "type": "Britten-Norman Islander", "operator": "FUNAI", "flight_phase": "Flight", "flight_type": "Aerial photography", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Rio Branco - Rio Branco", "msn": "493", "yom": 1976, "flight_number": null, "city": "Bujari", "zone": "Acre", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12000, "captain_hours_type": 300, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Rio Branco with four passengers and one pilot on board. The goal of the flight was to carry four Japanese journalists who wanted to perform aerial views from various tribes located in the region of Santa Rosa do Purus. About 30 minutes into the flight, an oil leak occurred on the left engine that lost power. The pilot reduced his altitude and attempted an emergency landing when the aircraft crashed near Bujari, about 39 km from Rio Branco. The wreckage was found near motorway BR364 and all five occupants were slightly injured. ", "probable_cause": "The following findings were identified:\r\n- It is likely that the pilot did not use the controls properly to maintain an adequate control of the airplane in a single-engine configuration while the airplane was operated within weight and balance limits,\r\n- The left propeller retainer had been replaced by similar but not original equipment, using glue to ensure its tightness, which was non compliant with the engine manufacturer's procedures,\r\n- The aircraft maintenance documents were not kept up to date by the operator,\r\n- Poor flight preparation on the part of the pilot who did not notice that the maintenance documents were not up to date,\r\n- The operator was not compliant with the current Brazilian Civil Aviation Authority legislation."}