{"url": "https://www.baaa-acro.com/crash/crash-polikarpov-p-5-kazan-1-killed", "date": "Feb 26, 1935 at 1220 LT", "type": "Polikarpov P-5", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sverdlovsk – Yanaul – Kazan – Moscow", "msn": "6259", "yom": 1933, "flight_number": null, "city": "Kazan", "zone": "Republic of Tatarstan", "country": "Russia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot departed Sverdlovsk Airport on a mail/cargo flight to Moscow with intermediate stops in Yanaul and Kazan. After passing the night in Yanaul, he departed Yanaul bound for Kazan. Upon arrival, weather conditions worsened with limited visibility due to fog. At a height of about 70-80 metres on approach, the airplane collided with a 105 metres high radio antenna. The left fuel tank was punched and a fire erupted. The airplane continued for a distance of 200 metres then crashed in a field, bursting into flames. The pilot, sole on board, was killed. ", "probable_cause": "The accident was the consequence of a collision at low altitude and in poor visibility with the mast of a radio antenna. \r\nThe following contributing factors were identified:\r\n- Marginal weather conditions at destination with 8-10 octas at 300-600 metres altitude, wind from the south at 15-25 km/h, fog with 500 metres visibility,\r\n- The pilot was cleared for takeoff despite the weather conditions at destination were considered as poor,\r\n- The pilot has not been informed about the deterioration of the weather conditions at destination, \r\n- The pilot was freshly licensed, inexperienced and flew this route for the first time, \r\n- The pilot descended below the minimum safe altitude of 100 metres. \n"}