{"url": "https://www.baaa-acro.com/crash/crash-vickers-619-wellington-x-raf-topcliffe-3-killed", "date": "Jan 13, 1948 at 1500 LT", "type": "Vickers 619 Wellington X", "operator": "Royal-Air-Force-4", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Topcliffe - Topcliffe", "msn": null, "yom": null, "flight_number": null, "city": "Topcliffe AFB", "zone": "North Yorkshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off from RAF Topcliffe in the mid-afternoon so the pilot could train on instrument flying. Also on board was a second pilot who was acting as an instructor, a radio operator and a passenger. The purpose of the latter was so that he could carry out radar tests during the flight. The aircraft took off in the gusty conditions with the pilot having to use both hands to maintain lateral control, the aircraft climbed normally to 400 feet but after which the nose rose sharply. The pilot pushed the control column forward to try and make the aircraft return to level but this had no effect, full power was applied but the aircraft continued to climb at this rate until it was at about 1000 feet. The speed of it had now dropped to 80 knots so the pilot ordered the crew to bale out before it stalled. Only the second pilot was able to get out before the nose sank and the aircraft entered a dive from which it could not be recovered from. The survivor sustained slight injuries after being dragged by his parachute when on the ground after it caught in the strong wind. The other three had no chance to get out before it crashed and were sadly killed in the crash at 1500LT.\r\nSource: \r\nhttp://www.yorkshire-aircraft.co.uk/aircraft/yorkshire/rp555.html ", "probable_cause": "The resulting investigation found that the aircraft had been stored outside in a strong wind without any control locks been installed. The strong wind had, over time, effected the elevator control cable and it was thought that it had become disconnected. Whilst it appeared to operate normally when the control column was moved it had no effect on the elevators."}