{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-stalingrad-3-killed", "date": "Jan 9, 1952 at 0222 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow – Voronezh – Stalingrad – Baku", "msn": "184 274 10", "yom": 29, "flight_number": "SU203", "city": "Stalingrad", "zone": "Volgograd oblast", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4736, "circumstances": "The crew was performing a cargo flight from Moscow to Baku with intermediate stops in Voronezh and Stalingrad, carrying a load of 1,793 kilos of various goods consisting of 517 kilos of brass sheets and mail. The approach to Stalingrad Airport was completed by night and marginal weather conditions. On final, while at a height of about 250 meters some 2,300 meters short of runway, the aircraft lost altitude and then stalled and crashed in a snow covered field, about 60 meters to the right of the center line. The aircraft broke in two and the radio operator was seriously injured while three other occupants were killed. ", "probable_cause": "It was determined that the young copilot was seated on the left seat while the captain was seated on the right seat at the time of the accident, which was against all regulations and company procedures as the captain did not have sufficient experience to complete a night approach in such configuration. Investigations revealed that the stall was caused by an insufficient approach speed due to an inadequate approach configuration on part of the crew who failed to monitor their instruments properly, especially the speed indicator. The following factors were considered as contributory:\n- Lack of coordination during final approach,\n- Negligence,\n- Lack of discipline,\n- Wrong approach configuration,\n- Poor flight preparation. "}