{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-rankin-inlet", "date": "Jul 18, 2010 at 1330 LT", "type": "Rockwell Shrike Commander 500", "operator": "Aircraft%20Guaranty%20Corp%20Trustee", "flight_phase": "Takeoff (climb)", "flight_type": "Delivery", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Portland - Rankin Inlet - Iqaluit - Bern", "msn": "500-3082", "yom": 1970, "flight_number": null, "city": "Rankin Inlet", "zone": "Nunavut", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 23100, "captain_hours_type": 40, "copilot_hours": 5400, "copilot_hours_type": 13, "aircraft_hours": null, "circumstances": "The Aero Commander 500S had recently been purchased. The new owner of the aircraft retained the services of 2 experienced pilots to deliver the aircraft from Portland, Oregon, United States, to Bern, Switzerland. After having flown several positioning legs, the aircraft arrived at Rankin Inlet for refuelling. The aircraft was refuelled from two 45-gallon drums and was to continue on to Iqaluit, Nunavut. The pilot-in-command occupied the right seat and the pilot flying the aircraft occupied the left seat. The aircraft was at its maximum takeoff weight of 7000 pounds. Prior to take off, the crew conducted a run-up and all indications seemed normal. During the takeoff roll, the engines did not produce full power and the crew elected to reject the takeoff. After returning to the ramp, a second run-up was completed and once again all indications seemed normal. Shortly after second rotation, cylinder head temperatures increased and both Lycoming TIO-540-E1B5 engines began to lose power. The pilots attempted to return to the airport, but were unable to maintain altitude. The landing gear was extended and a forced landing was made on a flat section of land, approximately 1500 feet to the southwest of the runway 13 threshold. There were no injuries and the aircraft sustained substantial damage. \n", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. At the fuel compound, the 45-gallon drum containing slops was located near the stock of sealed 45-gallon drums of 100LL AVGAS, contributing to the fuel handler selecting the drum of slops in error. \r\n2. The 45-gallon drum of slops had similar markings to the stock of sealed 45-gallon drums of 100LL AVGAS, preventing ready identification of the contaminated drum. \r\n3. The fuel handler did not notice that the large bung plug was not sealed on the second 45-gallon drum and, as a result, delivered the drum of slops to the aircraft. \r\n4. The pilots did not notice that the large bung plug was not sealed on the second 45-gallon drum and, as a result, fuelled the aircraft with contaminated fuel. \r\n5. The pilots were inexperienced with refuelling from 45-gallon drums and did not take steps to ascertain the proper fuel grade in the second 45-gallon drum. As a result, slops, rather than 100LL AVGAS, was pumped into the aircraft’s fuel system. \r\n6. The fuel system design was such that the fuel from both wing fuel cells combined in the centre fuel cell and, as a result, contaminated fuel was fed to both engines. \r\n7. The contaminated fuel resulted in engine power loss in both engines and the aircraft was unable to maintain altitude after takeoff. \r\nFinding as to Risk:\r\n1. The impact force angles were substantially different from that of the ELT’s G-switch orientation. As a result, the ELT did not activate during the impact. This could have delayed search and rescue (SAR) notification."}