{"url": "https://www.baaa-acro.com/crash/crash-bristol-170-freighter-21e-mallala-3-killed", "date": "Nov 25, 1953", "type": "Bristol 170 Freighter", "operator": "Royal-Australian-Air-Force-3", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": null, "msn": "12805", "yom": 1946, "flight_number": null, "city": "Mallala", "zone": "South Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While on an IFR training flight from Mallala by day in clear weather, the port mainplane parted from the fuselage. The aircraft crashed into a wheat field 2 miles from the RAAF Station. The three crew members were killed. The crash set the wheat field ablaze and the RAAF Mallala fire crews had to extinguish the the field fire to reach the crash site.  The port wing was found 1.5 miles away. \r\nCrew:\r\nF/Lt J. D. Entwhistle, \r\nF/O Leonard Murphy\r\nF/O Donald Shillinglaw.\r\nSource: http://www.goodall.com.au", "probable_cause": "RAAF investigation determined that the wing was placed under severe load during a separate training flight on the morning of the accident's day. The morning exercise included recovery from unusual attitudes using only a limited instrument panel. On two occasions the training captain placed the aircraft into a steep diving turn, recovery from which pulled high G force, to the extent a second pilot seated at the Navigator position blacked out. The subsequent investigations traced the problem to fatigue failure in the wing root ends and main spar structure. Bristol produced a modification which was proven successful. Most British and European civil B170s were flown to Western Airways at Weston-super-Mare to have the extensive modification carried out at Bristol expense. Australian B170s had went to Bristol Aviation Services at Bankstown to have their wings removed and the modifications installed."}