{"url": "https://www.baaa-acro.com/crash/crash-vickers-755d-viscount-antilla-17-killed", "date": "Nov 1, 1958 at 0201 LT", "type": "Vickers Viscount", "operator": "Cubana-de-Aviacion-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Miami – Varadero", "msn": "91", "yom": 1956, "flight_number": "CU495", "city": "Antilla", "zone": "Holguín", "country": "Cuba", "region": "Central America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 16, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 17, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Flight 495, a scheduled flight, departed Miami at 2200 hours en route to Varadero, a distance of about 200 miles, estimating its time of arrival at 2249 hours. It carried 16 passengers and a crew of 4. As there was no news of the flight at 2249 hours, an alert was declared. It was subsequently learned that the aircraft had crashed over 400 miles from Varadero at approximately 0210 hours in the Nipe Bay, Central Preston, Oriente Province, killing all aboard except 3 passengers. The aircraft left Miami with 1,600 gallons of fuel, total endurance thus being 3.47 hours, giving ample reserve for the intended flight. It was later proved that impact with the water occurred at 0210 hours. Thus, the aircraft had flown 23 minutes beyond the estimated endurance. Even though fuel on board always exceeds the amount required for a given flight, at the time of impact only 8 gallons remained in the tanks. According to testimony of residents in the accident area, the aircraft circled over the spot a number of times, finally making a wide turn, passing over the town of Antilla in the direction of Preston Airport, on final approach. It suddenly fell into the bay at about 400 metres from the coastline and 2 km from the airport. The direction of travel was reversed by the force of the impact with the water, and the aircraft travelled about 200 metres, furrowing the muddy bottom, which is at a depth of 2 fathoms. \r\nAfter salvage the following evidence was found: \r\n- The right wing was intact over its entire length, but the left wing tip was not found,\r\n- Engines Nos. 3 and 4 were in perfect condition; engine No, 1 was lacking the hub and propeller; the propeller blades on No. 2 were bent backward,\r\n- The tail section was completely separated from the fuselage, floating about 80 metres from the rest of the aircraft,\r\n- When the cockpit was salvaged intact, it was found that all routine landing operations had been carried out. \r\nThe above information indicated that the pilot attempted to raise the aircraft's nose but was too near the water, which the tail hit, parting from the fuselage over a length of about 4 metres.", "probable_cause": "The pilot was trying to land at Preston Airport when the aircraft ran out of fuel on final approach and loss of control followed. It was reported that five hijackers went through the cockpit few minutes after takeoff from Miami and forced the crew to divert to Antilla-Preston Airport. "}