{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700a-bellingham", "date": "Feb 27, 2017 at 1220 LT", "type": "Socata TBM-700", "operator": "4197802 Manitoba", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bellingham – Pierce County", "msn": "210", "yom": 2002, "flight_number": null, "city": "Bellingham", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1703, "captain_hours_type": 381, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1962, "circumstances": "The pilot reported that, during the preflight, it was snowing, and he wiped the snow that had accumulated on the wings off \"as best as [he] could.\" He added that, while taxiing to the runway, \"snow was falling heavily,\" and he observed \"light accumulation of wet snow\" on the wings. During the takeoff roll, he observed the snow \"sloughing off\" the wings as the airspeed increased. Subsequently, during the climb to about 150 ft above the ground, the airplane yawed to the left, and he attempted to recover using right aileron. He reported that he \"could see a stall forming,\" so he lowered the nose and reduced power to idle. The airplane impacted the general aviation ramp in a left-wing-down attitude and slid 500 to 600 ft. The pilot reported on the National Transportation Safety Board Aircraft Accident/ Incident Report 6120.1 form that the airplane stalled, and he recommended \"better deicing\" before takeoff. The airplane sustained substantial damage to the fuselage and left wing. The pilot reported that there were no preaccident mechanical failures or malfunctions with the airframe or engine that would have precluded normal operation. A review of recorded data from the automated weather observation station located on the airport revealed that, about 27 minutes before the accident, the wind was 010° at 8 knots, 1/2-mile visibility, moderate snow, freezing fog, and sky condition broken at 500 ft above ground level (agl) and overcast at 1,500 ft agl. The airplane departed from runway 16. The Federal Aviation Administration (FAA) Aeronautical Information Manual stated, in part: \"The presence of aircraft airframe icing during takeoff, typically caused by improper or no deicing of the aircraft being accomplished prior to flight has contributed to many recent accidents in turbine aircraft.\" The manual further stated, \"Ensure that your aircraft's lift-generating surfaces are COMPLETELY free of contamination before flight through a tactile (hands on) check of the critical surfaces when feasible. Even when otherwise permitted, operators should avoid smooth or polished frost on lift-generating surfaces as an acceptable preflight condition.\" FAA Advisory Circular, AC 135-17, stated in part: \"Test data indicate that ice, snow, or frost formations having thickness and surface roughness similar to medium or course sandpaper on the leading edge and upper surfaces of a wing can reduce wing lift by as much as 30 percent and increase drag by 40 percent.\" Included in the public docket for this report is a copy of a service bulletin from the airplane manufacturer, which describes deicing and anti-icing ground procedures. It stated, in part:  During conditions conducive to aeroplane icing during ground operations, take-off shall not be attempted when ice, snow, slush or frost is present or adhering to the wings, propellers, control surfaces, engine inlets or other critical surfaces.  This is known as the \"Clean Aircraft Concept\". Any deposit of ice, snow or frost on the external surfaces may drastically affect its performance due to reduced aerodynamic lift and increased drag resulting from the disturbed airflow.", "probable_cause": "The pilot's failure to properly deice the airplane before takeoff, which resulted in an aerodynamic stall during the initial climb. "}