{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-near-goose-bay-4-killed", "date": "Mar 24, 1986 at 0955 LT", "type": "De Havilland DHC-3 Otter", "operator": "Goose Bay Air Services", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Snegamook Lake - Goose Bay", "msn": "400", "yom": 1961, "flight_number": null, "city": "Goose Bay", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13258, "circumstances": "A wheel/ski-equipped DHC-3 Otter aircraft was on the return leg of a charter flight to Snegamook Lake to retrieve a hunting party of four, along with their hunting gear and bounty of several hundred ptarmigan. It departed Snegamook Lake at 09:15. After takeoff, the engine began to run rough but improved somewhat when the power was reduced for cruising. As the aircraft was approaching Nipishish Lake, the pilot reported to company dispatch that the engine was again running rough, but he was able to maintain altitude, and he would follow the Crooked River toward Goose Bay in case a precautionary landing became necessary. Three minutes later, C-FAGM called dispatch again, advising them that he was intending to land on a large area on the Crooked River. He also indicated that there was an odour of smoke in the aircraft. The aircraft was in a nose-down, left- bank attitude, with the flaps fully extended and the skis retracted when it struck the frozen surface of the river. The Otter bounced clear of the surface, turned left came to rest in an upright position.", "probable_cause": "It was determined that a fatigue-initiated crack in the number nine cylinder head caused the engine to run rough and lose power. While the pilot was manoeuvring for the precautionary landing in whiteout conditions, the aircraft crashed. At impact, the fuel cells ruptured, and a fire erupted which destroyed the aircraft."}