{"url": "https://www.baaa-acro.com/crash/crash-handley-page-hp52-hampden-i-whitley-bay-4-killed", "date": "Apr 7, 1940 at 0421 LT", "type": "Handley Page H.P.52 Hampden", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Scampton – Scampton", "msn": null, "yom": null, "flight_number": null, "city": "Whitley Bay", "zone": "Tyne and Wear", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane departed RAF Scampton at 1915LT on April 6 on a maritime patrol flight over the North Sea. While returning, the crew sent SOS messages to the St Mary's lighthouse keeper when the aircraft crashed into the sea about half a mile off Whitley Bay. All four crew members were killed. \r\nCrew:\r\nP/O Wilfred Roberts, pilot,\r\nP/O Keith Brooke-Taylor, pilot,\r\nSgt Andrew McNicol, observer,\r\nAC1 Denis William Sharpe, wireless operator and air gunner.", "probable_cause": "The following conclusions were put forward by the RAF:\r\n- The fact that the pilot disregarded the instructions to fly to Acklington would suggest that the aircraft was damaged in such a way as to render a landing hazardous.\r\n- The fact that there were no bombs jettisoned over the sea would indicate that the bomb doors or bomb release gear was damaged.\r\n- The fact that the wireless operator remained with the aircraft leads us to assume he was unable to leave it, being badly wounded or killed. The wireless silence from 2153 hrs supports this theory.\r\nTherefore, the opinion of the RAF was that the hydraulic system of L4054 was so badly damaged that the aircraft could not lower its undercarriage or open the bomb doors. It would have been too dangerous to attempt a belly landing at Acklington and therefore wiser to remain in a known area until daylight and then safely evacuate the aircraft."}