{"url": "https://www.baaa-acro.com/crash/crash-cessna-414a-chancellor-mattapoisett-1-killed", "date": "Nov 20, 1998 at 1220 LT", "type": "Cessna 414 Chancellor", "operator": "Gemco", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Hyannis - New Bedford", "msn": "414A-0671", "yom": 1981, "flight_number": null, "city": "Mattapoisett", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3458, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2675, "circumstances": "The airplane was level at 2,000 feet, in instrument meteorological conditions, when the pilot reported 'we've just lost our ahh artificial horizon.' About 5 minutes later, air traffic control lost radar contact, and communications with the airplane. A witness about 1 mile north of the accident site stated he heard the sound of engine noise coming from the water and he described the sound as loud and constant. The sound lasted for about 30 seconds and was followed by an 'explosive collision/impact sound.' He further stated he walked to the shore and attempted to locate the source of the sound, but 'because of the fog, I couldn't see anything at all.' The airplane was located in about 25 feet of water, and was scattered over a 150 to 200 foot area. The recovered wreckage consisted of both engines, parts of the airplane's left wing, empennage, fuselage, seats, and interior. The airplane's attitude indicator was not recovered. A faint needle impression was found on the face of the airplane's vertical speed indicator between minus 2,500 and 3,000 feet per minute. Examination of the left and right vacuum pumps did not reveal any malfunctions or failures. ", "probable_cause": "The pilot's failure to maintain control of the airplane after an undetermined failure of the airplane's attitude indicator. A factor in this accident was fog. "}