{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-lytchett-matravers", "date": "Jul 7, 2000 at 1555 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Convergence Aviation", "flight_phase": "Flight", "flight_type": "Test", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Bournemouth - Bournemouth", "msn": "46-22116", "yom": 1990, "flight_number": null, "city": "Lytchett Matravers", "zone": "Dorset", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10481, "captain_hours_type": 14, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was undergoing a shakedown flight after having completed a 100 hr maintenance inspection and other engineering work at Bournemouth Airport. The pilot was not the owner of the aircraft, but had been requested to carry out the shakedown flight. There was no technical log available prior to the flight which could have indicated the quantity of fuel remaining on board, or when the aircraft was previously refuelled and the subsequent flight times. The pilot recalled that the fuel tank gauges showed the aircraft had 22 gall US in the left wing and 40 gall US in the right wing, a total fuel contents of 62 gall US. The Aircraft Flight Manual indicates that the maximum allowable lateral fuel imbalance is 10 gall US. The aircraft started up at 1448 hrs and taxied for departure from Runway 26. The right tank was selected for take off and the first part of the flight. The aircraft climbed to FL180 and the required engine checks were carried out satisfactorily. As the aircraft was being turned around in order to return to Bournemouth, the pilot recalled that the right fuel quantity indicator steadily dropped to zero. This caused him little concern at the time as the left  fuel tank had only been selected for part of the taxi out. The aircraft was also fitted with a digital 'fuel endurance remaining' indicator, which apparently indicated 'one hour' fuel endurance. Descent was commenced and the aircraft was transferred to Bournemouth Approach control in order to position it on radar for an ILS approach to Runway 08. At this time, the pilot recalled that the fuel flow and rpm indicators began to fluctuate, so he selected the left fuel tank to feed to the engine. The aircraft was given radar vectoring and the pilot requested a turn to avoid a cloud build up before becoming established on the ILS. The radar controller indicated that the aircraft had become established on the localiser at a range of 25 nm, in the descent to 3,000 feet amsl. At about ten miles from touchdown the engine fuel flow and RPM again fluctuated. The pilot reselected the right fuel tank but the engine did not recover. Reselecting the left tank restored power briefly but then the engine failed again. The pilot turned the aircraft to the left off the ILS and attempted to identify suitable sites for a forced landing. An open field with an uphill gradient was selected, the landing gear and full flap were selected. However, the aircraft touched down further into the field than the pilot would have wished. The touchdown was smooth but the pilot could not stop the aircraft before it ran into the far boundary hedge. The left wing was severely damaged during the impact sequence. There was no fire and the three occupants vacated the aircraft by the normal means, having sustained only minor injuries. ", "probable_cause": "The history of the aircraft's movements was traced from ATC records at the various airfields visited. It was established that the aircraft (piloted by its owner) had operated a flight from Rome-Ciampino to Southend, landing at Southend at 2016 hrs on 21 June 2000. The aircraft was then refuelled to full tanks with 326 litres of Avgas 100LL on 23 June, prior to departure at 1425 hrs for Bournemouth, where it arrived at 1521 hrs. The aircraft then operated four sectors on two round trips between Bournemouth and Exeter Airports between 23 June and 25 June. These totalled 1 hour 47 minutes airborne flight time. The aircraft then underwent its maintenance programme and did not fly again until the accident flight. The digital fuel quantity/endurance indication relied on being reset at the time of a refuelling and subsequently used engine fuel flow to continuously recalculate remaining endurance. The aircraft's owner indicated that the instrument had been reset at the time of the previous refuelling, but was not intended to accurately monitor fuel flow during prolonged ground operations. The aircraft's total fuel tank capacity was 455 litres/120 gall US. From the aircraft's performance information, the cruise fuel flow at normal cruise power was around 69 litres per hour (18 gall US per hour) at 20,000 feet cruise altitude. From the movement history, it is known that the aircraft had been airborne for a total of 2.72 hours, at somewhat less than optimum cruise altitudes. At least 188 litres of fuel would therefore have been consumed from the 455 litres on board at the time of departure from Southend on 23 June, leaving a total of 267 litres (70 gall US) of that fuel on board. Additional fuel consumption would also have occurred during taxying before and after each flight sector (10 occasions in all) and it is known that an engine run of at least 30 minutes duration also took place during the maintenance period. It is therefore likely that all of the taxi and ground running operations would have totalled more than 1.5 hours duration. The owner estimated that some 96 gall US of fuel was consumed during the five sectors flown after the previous refuelling to full tanks (120 gall US) at Southend.  Thus, it is likely that the aircraft had considerably less than the pilot's recollection of 62 gall US on board at the time of departure on the accident flight."}