{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-7-new-delhi-23-killed", "date": "May 15, 1958 at 2018 LT", "type": "Convair CV-240", "operator": "Pakistan%20International%20Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New Delhi – Karachi", "msn": "52", "yom": 1949, "flight_number": "PK205", "city": "New Delhi-Palam", "zone": "National Capital Territory of Delhi", "country": "India", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 4, "pax_on_board": 32, "pax_fatalities": 17, "other_fatalities": 2, "total_fatalities": 23, "captain_hours": 4775, "captain_hours_type": 324, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12668, "circumstances": "The aircraft had landed at Palam at 1902 hours following an uneventful flight from Karachi. A thorough service check was carried out, and it was refuelled and loaded for the return flight to Karachi. The total take-off weight indicated on the load sheet was 41 589 lbs. The investigation revealed an error in the empty weight of the aircraft and the actual gross take-off weight was determined to be 41 319 lbs, which is 1 181 lbs less than the maximum permissible all-up weight. At 2018 hours the aircraft commenced its take-off run and was airborne at the latter half of the runway. Soon afterwards flames were observed at the western boundary of the airfield. The crash crew chief had watched the aircraft take-off. He saw the aircraft becoming airborne and then climbing to a height estimated by him to be 50 ft. He then noticed the landing lights pointing downwards and the aircraft losing height. He feared that a crash was imminent and immediately instructed the crew to proceed in that direction. At about this time the crash siren was sounded. The crash tender reached the site of the accident in about 7 to 8 minutes by which time the fire had reached large proportions. Fatal injuries were sustained by 4 members of the crew, 17 passengers and 2 others who were in the vicinity of the crash. Nine passengers and one other were seriously injured. The aircraft was destroyed by impact and fire. ", "probable_cause": "The captain did not properly observe and Interpret his flight instruments and thus inadvertently permitted the aircraft to descend to the ground immediately after a night take-off during which no visual reference was possible. A contributory factor may have been the slow reactions of the captain due to his state of health."}