{"url": "https://www.baaa-acro.com/crash/crash-bristol-170-freighter-31-christchurch-4-killed", "date": "Nov 21, 1957 at 1133 LT", "type": "Bristol 170 Freighter", "operator": "Straits Air Freight Express", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Woodbourne – Paraparaumu – Timaru", "msn": "12828", "yom": 1947, "flight_number": null, "city": "Christchurch", "zone": "Canterbury Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7898, "circumstances": "The flight was a routine cargo flight from Woodbourne to Timaru via Paraparaumu. After take-off the aircraft was climbed to 2 500 ft on instruments and a period of asymmetric instrument flying followed during which the starboard pro- peller was feathered and rate half turns were made in both directions. The starboard propeller was unfeathered and when the minimum operating temperatures had been reached, normal power was applied. Two minutes later a sudden and severe vibration was felt throughout the aircraft. Feathering of the port engine was delayed until nearer the North Island coastline, and no further vibration was felt on the remainder of the flight to Paraparaumu. The aircraft was then loaded and one crew member was off-loaded prior to take-off on the second segment of the flight to Timaru. At 1127 hours the flight called Harewood Tower giving its position as 6 miles north of the Wairnakariri River mouth at 3 000 ft contact. It was subsequently cleared to maintain 3 000 ft to the Harewood Range Station. It then advised that it would descend VFR from the Range Station and proceed VFR to Timaru and was subsequently cleared for this procedure by Harewood Tower. At 1133 hours, at an approximate height of 2 000 ft, the aircraft was seen to suffer structural failure in the air. The starboard outer wing folded upwards and backwards and then separated. The remainder of the aircraft performed a series of violent manoeuvres while diving towards the ground at a mean angle of 35°' shedding a number of major components before finally striking the ground 1 000 yards beyond the point of wing separation. The 2 crew and 2 passengers aboard were killed, and the aircraft was destroyed. ", "probable_cause": "The accident was caused by in-flight structural fatigue failure of the starboard front lower spar boom. The circumstances which made the accident possible were created by the assessment of a life which was materially in excess of the safe life. The error in life assessment stemmed from the fact that simulated operational conditions from which the lifeing data was evolved were not truly representative of actual operating conditions. "}