{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-keene-1-killed", "date": "Jan 13, 2005 at 2215 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Airnow", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bangor – Manchester", "msn": "110-301", "yom": 1980, "flight_number": "BEN2352", "city": "Keene-Dillant-Hopkins", "zone": "New Hampshire", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2292, "captain_hours_type": 338, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 39466, "circumstances": "En route to the company's home airport, the twin-engine airplane either experienced a loss of power to the right engine, or the pilot decided to shut the engine down. Although the home airport had night visual meteorological conditions, and there was no evidence of any malfunction with the remaining engine, the pilot opted to fly a night precision instrument approach to an airport 45 nautical miles closer, with a 1-mile visibility and a 100-foot ceiling. Unknown to the pilot, there was also fog at the airport. The pilot did not advise or seek assistance from air traffic control or the company. When the airplane broke out of the clouds, it was not stable. Approaching the runway, at full flaps and exceeding the 25 percent maximum for a go-around, the pilot added full power to the left engine. The high power setting, slow airspeed, and full flaps combination resulted in a minimum control speed (Vmc) roll. No determination could be made as to why the right engine was inoperative, and there were no mechanical or fuel-related anomalies found that would have precluded normal operation.\n", "probable_cause": "The pilot's improper decision to attempt a single-engine missed approach with the airplane in a slow airspeed, full flap configuration, which resulted in a minimum control speed (Vmc) roll. Contributing factors included an inoperative engine for undetermined reasons, the pilot's in-flight decision to divert to an airport with low ceilings and visibility while better conditions existed elsewhere, the pilot's failure to advise or seek assistance from air traffic control or his company, and the low cloud ceilings, fog, and night lighting conditions."}