{"url": "https://www.baaa-acro.com/crash/crash-learjet-35-masset-5-killed", "date": "Jan 11, 1995 at 0149 LT", "type": "Learjet 35", "operator": "Canada%20Jet%20Charters", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Vancouver - Masset", "msn": "35-058", "yom": 1976, "flight_number": null, "city": "Masset", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 4550, "captain_hours_type": 2550, "copilot_hours": 2880, "copilot_hours_type": 61, "aircraft_hours": 11676, "circumstances": "On 11 January 1995, at 0035 Pacific standard time (PST), the twin-engine Learjet 35 departed Vancouver International Airport, British Columbia, on a night, instrument flight rules (IFR), medical evacuation (MEDEVAC) flight to the Masset aerodrome, on the northern end of the Queen Charlotte Islands. On board the Learjet were a flight crew of two pilots, and a medical team consisting of two attendants and a doctor. Their mission was to evacuate a patient from Masset and deliver her to Prince Rupert for treatment; the aircraft was then to return to Vancouver. The flight-planned route was at flight level (FL) 390, direct to Sandspit then direct to Masset. Following routine communications with Air Traffic Services (ATS), at about 0144, the aircraft reported \"outbound\" from the Masset non-directional beacon (NDB) on the published NDB \"A\" instrument approach procedure to runway 12. Air Traffic Control (ATC) radar, situated near Sandspit, tracked the aircraft as it flew the approach. Radar data shows that the aircraft began a descent about 10 seconds after it had completed the procedure turn and was established on the final inbound approach track. Forty-three seconds later, at a point 8.8 nautical miles (nm) from the threshold of runway 12 and on the final, inbound track, the aircraft disappeared from radar. Department of National Defence (DND) Search and Rescue (SAR) aircraft began searching the area shortly after the aircraft was declared missing, and were later assisted by other private and military aircraft and vessels. On the second day of the search, flotsam from the aircraft was found in the area. Extensive underwater searching using sonar and underwater cameras found the aircraft wreckage on 31 January 1995, in 260 feet of water, near the last known position. The aircraft had been destroyed. The bodies of two occupants were found several days after the accident, but the other three occupants have not been found and are presumed to have been fatally injured. The accident occurred at latitude 54/08NN and longitude 131/58NW, at about 0149 PST, during the hours of darkness in unknown weather conditions.", "probable_cause": "The crew most likely conducted the instrument approach with reference to an unintentionally mis-set altimeter of 30.17 in. Hg, and unknowingly flew the aircraft into the water. The circumstances leading to the incorrect altimeter setting could not be determined, nor was it determined why the crew did not detect the mis-set altimeter."}