{"url": "https://www.baaa-acro.com/crash/crash-sud-aviation-se-210-caravelle-iii-dhahran-49-killed", "date": "Apr 17, 1964 at 2232 LT", "type": "Sud-Aviation SE-210 Caravelle", "operator": "Middle%20East%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Beirut – Dhahran", "msn": "23", "yom": 1960, "flight_number": "ME444", "city": "Dhahran", "zone": "ash-Sharqīyah (الشرقية‎)", "country": "Saudi Arabia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 42, "pax_fatalities": 42, "other_fatalities": 0, "total_fatalities": 49, "captain_hours": 9193, "captain_hours_type": 3425, "copilot_hours": 7691, "copilot_hours_type": 1680, "aircraft_hours": null, "circumstances": "Flight ME 444 departed Beirut (BEY) at 17:09 UTC and climbed to its cruising altitude of FL300. At 19:04 the aircraft reported to Bahrain Control that it was estimating Dhahran (DHA) at 19:28, and was cleared to descend to reach FL50 over the Dhahran beacon. At 19:06 weather information was reported to flight 444, which read a NNE/10 knots wind, gusting to 16, and 0,5nm visibility (in a sandstorm). At 19:26 the pilot reported estimating the Dhahran NDB in two minutes. At 19:28 it contacted Dhahran and reported \"5 000 feet descending\" and was cleared for an ADF approach. The controller requested the crew to report at 4000 feet and outbound at 2000 feet. One minute later it reported leaving 4000 feet and at 19:30 passing 2500 feet and turning inbound. It was then cleared to final approach and requested to report reaching minimum and runway in sight. At approximately 19:32 a short loud transmission noise was recorded by the Tower. No further message was received from the flight. It was subsequently found that the aircraft struck the sea at the completion of the procedure turn 4 NM off shore and 10 NM south of Dhahran Airport. The investigation team concluded that there was no mechanical failure that could have caused the accident. Several theories were investigated, a.o. erroneous radio altimeter indications as a result of the sandstorm (these effects have been proven in tests done by Air France), but the team was not able to prove any of those theories.", "probable_cause": "The probable cause of this accident can not be ascertained."}