{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b60-duke-springfield-4-killed", "date": "Jul 20, 1997 at 1630 LT", "type": "Beechcraft 60 Duke", "operator": "Corporate Aircraft Management", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Springfield – Chesterfield", "msn": "P-400", "yom": 1976, "flight_number": null, "city": "Springfield-Branson", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 10734, "captain_hours_type": 46, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3358, "circumstances": "The pilot and passengers departed the Spirit of St. Louis Airport and flew to Springfield Regional Airport, a 50 to 60 minute flight. The fuel on board was about 25 to 30 gallons in the left wing tanks, and 75 to 80 gallons in the right wing tanks. Each engine burned about 25 to 30 gallons per hour. The airplane was not fueled prior to the return flight. About five minutes after takeoff, the airplane had reached 4,300 feet msl (3,033 feet agl) and began a 402 fpm descent. The airplane continued the descent away from the airport for about 7 nm before turning 180 degrees to the left. The airplane had descended to 2,200 feet msl (933 feet agl) and was 10 miles from the airport. The pilot reported to the controller that he had a '...partial engine failure on the left side.' The airplane impacted the ground in an inverted, vertical nose down attitude. The landing gear were down at impact. Neither propeller was feathered. The right wing, right engine, fuselage, and empennage received extensive fire damage. The left wing was consumed by fire between the nacelle and the wing root. The remaining left wing, left nacelle, and engine were not destroyed by fire. Examination of the engines and airframe did not reveal any pre-existing anomalies that prevented normal operation. The Airplane Flight Manual did not contain procedures which explained fuel cross feeding procedures in case of fuel exhaustion to a wing's fuel tanks. ", "probable_cause": "The pilot's fuel mismanagement and his failure to maintain adequate airspeed which resulted in fuel exhaustion followed by the loss of power in one engine and the loss of aircraft control.\r\nContributing was the pilot's failure to refuel the aircraft, the pilot's failure to feather the propeller of the non-operating engine, and his extension of the landing gear."}