{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-fort-yukon", "date": "Sep 30, 2005 at 1210 LT", "type": "Cessna 550 Citation II", "operator": "Univesity%20of%20North%20Dakota", "flight_phase": "Flight", "flight_type": "Meteorological / Weather", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Fairbanks - Fairbanks", "msn": "550-0005", "yom": 1978, "flight_number": null, "city": "Fort Yukon", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3712, "captain_hours_type": 948, "copilot_hours": 5696, "copilot_hours_type": 141, "aircraft_hours": 4262, "circumstances": "The flight crew, an airline transport certificated captain, and a commercial certificated co-pilot, were flying a restricted category, icing research equipped airplane in instrument meteorological icing conditions under Title 14, CFR Part 91. The purpose of the flight was to locate icing conditions for a prototype helicopter's in-flight icing tests. While in cruise flight, the airplane encountered icing conditions, and had accumulated about 1\" of ice on the leading edges of the wings. The captain reported that he activated the wing deicing pneumatic boots, and the ice was shed from both wings. About 4 minutes after activating the deice boots, both engines simultaneously lost all power. The crew attempted several engine restarts, but were unsuccessful, and made a forced landing on frozen, snow-covered terrain. During the landing, the airplane struck several small, burned trees, and sustained substantial damage. The airplane's ice control system is comprised of two separate systems, one an anti-ice, the other, a deice. The majority of the wings' surfaces are deiced by pneumatic, inflating boots. The inboard section of the wings, directly in front of the engine air inlets, and the engine air inlets themselves, utilize a heated, anti-ice surface to preclude any ice accretion and potential for ice ingestion into the engines. The anti-ice system is not automatic, and must be activated by the flight crew prior to entering icing conditions. A researcher in the aft cabin photographed the airplane's wings before and after the activation of the deice boots. The photographs taken prior to the deice boot activation depicted about 1\" of ice on the wings, as well as on the anti-ice (heated) inboard portion of the wings. The photographs taken after the deice boot activation revealed that the ice had been removed from the booted portion of the wings, but ice remained on the inboard, anti-ice segment. An engineer from the airplane's manufacturer said that if the anti-ice system was activated after ice had accumulated on the wings, it would take 2-4 minutes for the anti-ice portion of the wings and engine inlets to heat sufficiently to shed the ice. A postaccident inspection of the anti-ice components found no anomalies, and there was no record of any recent problems with the anti-ice system. The flight crew reported that the anti-ice activation switch is on the captain's side, and they could not recall if or when the anti-ice system was activated. They stated that they did not discuss its use, or use a checklist that addressed the use of the anti-ice system. A section of the airplane's flight manual states: \"Failure to switch on the [anti-ice] system before ice accumulation has begun may result in engine damage due to ice ingestion.\" An inspection by an NTSB power plant engineer disclosed catastrophic engine damage consistent with ice ingestion. ", "probable_cause": "The pilot's improper use of anti-icing equipment during cruise flight, which resulted in ice ingestion into both engines (foreign object damage), the complete loss of engine power in both engines, and an emergency descent and landing on tree covered terrain. Factors associated with the accident were the icing conditions, inadequate crew resource management, and failure to use a checklist."}