{"url": "https://www.baaa-acro.com/crash/crash-yakovlev-yak-40-near-vanavara-28-killed", "date": "Sep 26, 1994 at 1738 LT", "type": "Yakovlev Yak-40", "operator": "Cheremshanka Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Krasnoyarsk - Tura", "msn": "9 44 13 37", "yom": 1974, "flight_number": null, "city": "Vanavara", "zone": "Krasnoyarsk Krai", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 24, "pax_fatalities": 24, "other_fatalities": 0, "total_fatalities": 28, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 22203, "circumstances": "Following an uneventful flight from Krasnoyarsk, the crew was approaching Tura Airport when he encountered poor weather conditions and limited visibility upon arrival. Unable to establish a visual contact with the runway, the crew decided to initiate a go-around and followed a holding pattern. Two other approaches were abandoned during the following minutes. Eventually, the crew decided to divert to Vanavara Airport which is located 450 km southeast of Tura. Following a total flight time of 3 hours and 45 minutes, while descending to Vanavara Airport, all three engines stopped simultaneously. The captain attempted an emergency landing in a cleared area when the aircraft struck trees at a speed of 235 km/h. Out of control, it crashed on the shore of the Chamba river, coming to rest upside down. The wreckage was found 41 km north-northwest of Vanavara and all 28 occupants were killed. ", "probable_cause": "It was determined that all three engine failed simultaneously due to a fuel exhaustion. Following a poor flight planning, the crew decided to chose Vanavara as the alternate airport (450 km from Tura) while the airport of Baykit was located 110 km from Tura and weather conditions were good at this time. \r\nThe following contributing factors were reported: \r\n- The crew incorrectly calculated the total amount of fuel necessary for the request flight and the alternate airport, \r\n- The crew was unaware of the deterioration of the weather conditions in Tura after the ground personnel based at Tura Airport failed to conduct efficient observations and inform the crew accordingly, \r\n- The deviation, allowed by crew during the first straight-in approach, which was caused, probably, by short-term de-energizing of the Outer Marker beacon and by incorrect determination by the crew of removal to VPP under these conditions,\r\n- Failure of the crew to monitor the approach pattern parameters during the second and third approaches to Tura Airport in below minimums visibility,\r\n- The crew started the descent to Vanavara Airport prematurely following a wrong flight altitude selection."}