{"url": "https://www.baaa-acro.com/crash/crash-cessna-501-citation-isp-franklin-5-killed", "date": "Mar 15, 2012 at 1350 LT", "type": "Cessna 501 Citation I", "operator": "BigTex", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Venice - Franklin", "msn": "501-0248", "yom": 1982, "flight_number": null, "city": "Franklin-Macon County", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 1159, "captain_hours_type": 185, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4825, "circumstances": "The pilot was not familiar with the mountain airport. The airplane was high during the first visual approach to the runway. The pilot performed a go-around and the airplane was again high for the second approach. During the second approach, the approach angle steepened, and the airplane pitched nose-down toward the runway. The nosegear touched down about halfway down the runway followed by main gear touchdown. The airplane then bounced and the sound of engine noise increased as the airplane banked right and the right wing contacted the ground. The airplane subsequently flipped over and off the right side of the runway, and a postcrash fire ensued. Examination of the airframe and engines did not reveal any preimpact mechanical malfunctions. The examination also revealed that the right engine thrust reverser was deployed during the impact sequence, and the left engine thrust reverser was stowed. Although manufacturer data revealed single-engine reversing has been demonstrated during normal landings and is easily controllable, the airplane had already porpoised and bounced during the landing. The pilot’s subsequent activation of only the right engine’s thrust reverser would have created an asymmetrical thrust and most likely exacerbated an already uncontrolled touchdown. Had the touchdown been controlled, the airplane could have stopped on the remaining runway or the pilot could have performed a go-around uneventfully.", "probable_cause": "The pilot's failure to achieve a stabilized approach, resulting in a nose-first, bounced landing. Contributing to the accident was the pilot's activation of only one thrust reverser, resulting in asymmetrical thrust.\n"}