{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-1247e-chamberlain-9-killed", "date": "Nov 30, 2019 at 1233 LT", "type": "Pilatus PC-12", "operator": "Conrad%20%26%20Bischoff", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chamberlain – Idaho Falls", "msn": "1431", "yom": 2013, "flight_number": null, "city": "Chamberlain", "zone": "South Dakota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 11, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 2314, "captain_hours_type": 1274, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1725, "circumstances": "The pilot and passengers flew in the day before the accident and the airplane remained parked outside on the airport ramp overnight. Light to moderate snow and freezing drizzle persisted during the 12 to 24-hour period preceding the accident. In addition, low instrument meteorological conditions existed at the time of the accident takeoff. Before the flight, the pilot removed snow and ice from the airplane wings. However, the horizontal stabilizer was not accessible to the pilot and was not cleared of accumulated snow. In addition, the airplane was loaded over the maximum certificated gross weight and beyond the aft center-of-gravity limit. A total of 12 occupants were on board the airplane, though only 10 seats were available. None of the occupants qualified as lap children under regulations. The takeoff rotation was initiated about 88 kts which was about 4 kts slower than specified with the airplane configured for icing conditions. After takeoff, the airplane entered a left turn. Airspeed varied between 89 and 97 kts during the initial climb; however, it decayed to about 80 kts as the airplane altitude and bank angle peaked. The airplane ultimately reached a left bank angle of 64° at the peak altitude of about 380 ft above ground level. The airplane then entered a descent that continued until impact. The stall warning and stick shaker activated about 1 second after liftoff. The stick pusher became active about 15 seconds after liftoff. All three continued intermittently for the duration of the flight. A witness located about 1/2-mile northwest of the airport reported hearing the airplane takeoff. It was cloudy and snowing at the time. He was not able to see the airplane but noted that it entered a left turn based on the sound. He heard the airplane for about 4 or 5 seconds and the engine seemed to be “running good” until the sound stopped. The airplane impacted a dormant corn field about 3/4-mile west of the airport. A postaccident airframe examination did not reveal any anomalies consistent with a preimpact failure or malfunction. On board recorder data indicated that the engine was operating normally at the time of the accident. An airplane performance analysis indicated that the accumulated snow and ice on the empennage did not significantly degrade the airplane performance after takeoff. However, the effect of the snow and ice on the airplane center-of-gravity and the pitch (elevator) control forces could not be determined. Simulations indicated that the pitch oscillations recorded on the flight could be duplicated with control inputs, and that the flight control authority available to the pilot would have been sufficient to maintain control until the airplane entered an aerodynamic stall about 22 seconds after lifting off (the maximum bank angle of 64° occurred after the critical angle-of-attack was exceeded). In addition, similar but less extreme pitch oscillations recorded on the previous flight (during which the airplane was not contaminated with snow but was loaded to a similar center-of-gravity position) suggest that the pitch oscillations on both flights were the result of the improper loading and not the effects of accumulated snow and ice. Flight recorder data revealed that the accident pilot tended to rotate more rapidly and to a higher pitch angle during takeoff than a second pilot who flew the airplane regularly. Piloted simulations suggested that the accident pilot’s rotation technique, which involved a relatively abrupt and heavy pull on the control column, when combined with the extreme aft CG, heavy weight, and early rotation on the accident takeoff, contributed to the airplane’s high angle-of attack immediately after rotation, the triggering of the stick shaker and stick pusher, and the pilot’s pitch control difficulties after liftoff. The resulting pitch oscillations eventually resulted in a deep penetration into the aerodynamic stall region and subsequent loss of control. Although conditions were conducive to the development of spatial disorientation, the circumstances of this accident are more consistent with the pilot’s efforts to respond to the activation of the airplane stall protection system upon takeoff. These efforts were hindered by the heightened airplane pitch sensitivity resulting from the aft-CG condition. As a result, spatial disorientation is not considered to be a factor in this accident.", "probable_cause": "The pilot’s loss of control shortly after takeoff, which resulted in an inadvertent, low-altitude aerodynamic stall. Contributing to the accident was the pilot’s improper loading of the airplane, which resulted in reduced static longitudinal stability and his decision to depart into low instrument meteorological conditions."}