{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-1247-solemont-4-killed", "date": "Aug 24, 2012 at 1800 LT", "type": "Pilatus PC-12", "operator": "Air%20Sarina", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Antwerp - Saanen (Gstaad)", "msn": "702", "yom": 2006, "flight_number": null, "city": "Solemont", "zone": "Doubs", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 5971, "captain_hours_type": 1785, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot took off from Anvers (Belgium) at around 14 h 40 bound for Saanen (Switzerland) where he was supposed to drop off his three passengers. The flight was performed in IFR then VFR, at a cruise altitude of 26,000 ft. After about 1 h 15 min of flight, still under IFR, the Geneva controller cleared the pilot to descend towards FL 210 and to fly towards Saanen with a view to an approach. A short time later, the radar data showed that the aeroplane deviated from the planned trajectory. Following a question from the controller, the pilot said he had an autopilot problem. The controller then asked the pilot to follow heading 165°, which the pilot read back, then asked him ‘‘are you okay, okay for the safety, it’s good for you? ‘‘. The pilot answered that he had a ‘‘big problem’’. The radar data show tight turns on descent. During these manœuvres, in reply to a request from the controller, the pilot said that he was in ‘‘total IMC’’. During this communication, the aeroplane‘s overspeed warning could be heard. The aeroplane was then descending at 15,500 ft/min. About ten seconds later, it was climbing at 15,500 ft/min. The right wing broke off about twenty seconds later. The indicated airspeed was then 274 kt and the altitude was 12,750 ft. The wreckage was found in woods in the commune of Solemont (25). A piece of the right wing was found about 2.5 km from the main wreckage. Some debris, all from the right wing, was found on a south-west/north-east axis. The aeroplane part that was furthest away was found 10 km from the main site. The aircraft disintegrated on impact and all four occupants were killed. ", "probable_cause": "The in-flight failure of the right wing was due to exceeding the aeroplane’s structural limits (ultimate loads) during loss of control by the pilot. In the absence of any flight recorders, the investigation was not able to determine the causes of this loss of control. It is possible that it may have been induced by a loss of situational awareness by the pilot at the controls of an aeroplane affected by an icing phenomenon. This phenomenon may have affected the aeroplane’s wings or an area around the roll control."}