{"url": "https://www.baaa-acro.com/crash/crash-vickers-720-viscount-sydney-15-killed", "date": "Nov 30, 1961 at 1925 LT", "type": "Vickers Viscount", "operator": "Ansett-ANA%20-1957-1968", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Sydney – Canberra", "msn": "46", "yom": 1954, "flight_number": "AN325", "city": "Sydney", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": 16016, "captain_hours_type": 2748, "copilot_hours": 4145, "copilot_hours_type": 1731, "aircraft_hours": 16946, "circumstances": "The aircraft was engaged on a scheduled transport service from Sydney to Canberra. It carried a crew of four and eleven passengers. According to the approved flight plan, the pilot proposed to proceed to Canberra via the 222 track to Marulan, the first reporting point. At the time of departure this was changed, because of inbound traffic, to the 244 diversion, which avoids Botany Bay. At 1915:43 the Approach Controller instructed the flight to \"continue runway heading to 3 000 ft before turning left and to pass over the field at 5 000 ft or above. The flight was then cleared for take-off from runway 07. At 1921:50 the Approach Controller asked the aircraft to report its altitude. It was at 6 000 ft. Shortly thereafter (at 1922:05) the controller communicated as follows:\" . . . now if you haven't passed over the field you can proceed via the 217 from Padstow. The 222 is available, but I suggest the 217 due to the storm to the south of the field, report setting course from Padstow 217.\" The flight acknowledged at 1922:20 hours. None of the messages that followed from the Approach Controller were answered. Between 1925 and 1926 hours the aircraft plunged into Botany Bay, killing all aboard. ", "probable_cause": "During a descent in excess of 260 kt, the pilot's actions, when trying to regain control of the aircraft, caused the aircraft to exceed its stress limits. This factor together with speed and turbulence caused the starboard outer wing to fail."}