{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-21-new-york-4-killed", "date": "Jan 19, 1961 at 2017 LT", "type": "Douglas DC-8", "operator": "Aeronaves%20de%20Mexico", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Mexico City", "msn": "45432", "yom": 1960, "flight_number": "AM401", "city": "New York-Idlewild", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 9, "crew_fatalities": 4, "pax_on_board": 97, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 15210, "captain_hours_type": 46, "copilot_hours": 8260, "copilot_hours_type": 125, "aircraft_hours": 529, "circumstances": "The first approximate 6,200 feet of takeoff roll was observed by control tower personnel, visually, until the aircraft was lost to view by obscuring snow, approximately 3,800 feet from the control tower. They stated that at that time the aircraft had not taken off or rotated. Another tower controller observed the aircraft by airport surface-detection *** radar from the start of its roll to the eastern end of runway 7R, where it disappeared from view. A few seconds later he observed a bright orange flash on the sky northeast of the airport. He could not tell if the aircraft left the runway. Emergency procedures were started immediately by the controllers and an unsuccessful attempt was made to contact the flight on the departure radio frequency. Captain Poe was the only survivor of the four cockpit occupants. He stated as follows: The checklist was accomplished normally. The runway condition was good and everything apparently occurred in a routine manner through the 100-knot time check when the first officer called out \"***\" (Spanish for 100). Upon reaching approximately 130 knots (the V1 speed) the first officer called out V1 and VR rapid succession. The aircraft was then rotated quickly and somewhat excessively. Poe did not see the airspeed go over 130 knots and as rotation started he saw the airspeed start to drop back quite rapidly to about 110 knots. At this time the Aeronaves captain called or pointed to the airspeed indicator. Poe felt that the aircraft could not become airborne under these conditions and that the runway remaining was not long enough to put the nose back down to start the takeoff again from that speed. His only choice, so he stated, was to try to get the aircraft stopped on the runway. Poe unfastened his safety belt, stood to gauge progress down the runway, moved forward, shoved the throttles forward briefly, noted a normal and uniform response from the engine instruments (the EPR gauges were reading normally from 2.52 to 2.54), and then pulled the throttles full back. Captain Gonzales \"immediately\" pulled the reverse throttles back into reverse thrust and used wheel brakes. Poe extended the spoilers and then sat down on the jump seat without refastening his seat belt. He believes that the aircraft did not take off Whether it did or not wall be discussed later in this report. Poe's actions would have taken about three seconds, an shown by later test.  The aircraft continued ahead the full length of the 10,000-foot runway, beyond it, through a blast fence, 3 catching on fire, through the airport boundary fence, and across Rockaway Boulevard where it struck an automobile injuring the driver and sole occupant. After going through the blast fence, many parts were shed before the aircraft came to rest in flames 830 feet beyond the end of the runway. Emergency vehicles from the airport and of the New York Fire Department were quickly started for the scene. Although impeded somewhat by weather conditions, they reached it within about six minutes and extinguished the fire. Evacuation and rescue of the occupants had already been effected in a total time of about five minutes, although most persons were out of the wreckage and away from the fire site in half this time. Many of the survivors were taken to hospital in privately owned vehicles. Destruction of the aircraft was extensive.", "probable_cause": "The Board concludes that the aircraft did become airborne. Investigation of the accident has pointed out that Captain Poe erroneously believed that if the speed of rotation were appreciably below the calculated VR speed, a longer takeoff run would result. The Board concludes that the takeoff was discontinued as a result of the action of the check pilot, who was not seated in a pilot seat, in reaching forward without warning and pulling the throttles back. This action caused power to be decreased or all four engines. \r\nThe Board determines that the probable cause of this accident was the unnecess discontinuing of the takeoff by the check pilot, who was not in either pilot seat. The contributing factors in this accident were the marginally poor weather, snow on the runway, and the possibility of the Pitot head heat not having been on."}