{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-64-albatross-fort-pierce-2-killed", "date": "Sep 25, 2003 at 1126 LT", "type": "Grumman G-64 Albatross", "operator": "Corsair Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Pierce - Fort Pierce", "msn": "G-418", "yom": 1955, "flight_number": null, "city": "Fort Pierce-St Lucie County", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 13000, "captain_hours_type": 450, "copilot_hours": 12800, "copilot_hours_type": null, "aircraft_hours": 4276, "circumstances": "According to the pilot, during climb-out from runway 09 at an altitude of approximately 500 feet the right engine warning red magnetic chip detector light illuminated. The pilot decided to shut down the right engine and return to the airport. Shortly after making that decision the left engine began to lose power. The airplane was unable to maintain altitude, and the pilot prepared to make an off-airport emergency landing in a field. The airplane collided with the trees as the pilot maneuvered for the emergency landing. Examination of the airframe, and flight controls revealed no anomalies. Examination of the left and right engine revealed no mechanical anomalies. Examination of cockpit fuel selector controls revealed that the left engine fuel selector handle was in the off position and the right engine fuel selector handle was set in the left tank position. During the in-flight engine secure procedures the pilot is required to place the inoperative engine fuel selector in the off position.", "probable_cause": "A loss of engine power due to the pilot placing the fuel selector in the off position which resulted in fuel starvation to the left engine, after the pilot intentionally shut down the right engine."}