{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-0-memphis", "date": "Jun 22, 1949 at 1313 LT", "type": "Convair CV-240", "operator": "American-Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dallas – Texarkana – Little Rock – Memphis – Washington DC", "msn": "139", "yom": 1949, "flight_number": "AA402", "city": "Memphis", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 41, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8239, "captain_hours_type": 469, "copilot_hours": 7077, "copilot_hours_type": 135, "aircraft_hours": null, "circumstances": "After 2.700 feet of takeoff roll the aircraft became airborne with an estimated air speed of 120 miles per hour, but at an altitude from 20 to 50 feet the right engine failed and the right propeller automatically feathered. Retraction of the landing gear was accomplished after momentary hesitation as the flight continued straight ahead, gaining altitude very slowly. It passed over the end of the runway at about 50 feet. A power transmission line, 11,700 feet from the start of the takeoff roll. was located across the flight's course. Two towers of this transmission line between which the aircraft was flown extended to an elevation of 371 feet, or a height of 111 feet above the southwest end of Runway 2 from where the takeoff was started. Elevation of the lowest point of the top series of wires as they hung between the two towers was 335 feet or 75 feet above the southwest end of Runway 2. The flight cleared these wires at this lowest point by 10 to 20 feet. Just before flying over the power lines at an air speed of 110 miles per hour, a slow retraction of the flaps was started. After crossing the power lines, the air speed fell to 105 miles per hour even though the left engine continued to develop full takeoff power. Not being able to hold altitude, a shallow right turn was made to relatively clear terrain where the aircraft was crash landed 18,713 feet northeast from the starting point of the takeoff. The aircraft slid over the ground for a distance of 217 feet, skidded over an embankment and a highway, then came to rest. Control tower personnel had observed the feathering of the right propeller and the slow rate of climb. Feeling that the aircraft would not remain airborne, the airport controller instructed another air carrier flight, then on a landing approach to Memphis, to circle the Convair so as to keep the tower advised of its position. Instructions were immediately transmitted to the field's fire and crash personnel following which the city fire and police departments and hospitals were notified. Since fire and crash equipment had actually been dispatched while the aircraft was still in flight, it arrived only two or three minutes after the crash. Fire which started in the left engine nacelle after landing was quickly extinguished, and prompt medical attention was available for all occupants. Although the stewardess had received minor injuries, she, with the aid of one of the passengers, had opened two emergency exits. She had then deplaned all passengers. Thirteen passengers and one crew member received serious injuries, and 18 passengers and two crew members received minor injuries.", "probable_cause": "The Board determines that the probable cause of this accident was a reduction in air speed resulting from flying the aircraft at a steep climbing attitude after power failure of the right engine. followed by retraction of the flaps which destroyed the aircraft's climb performance.\r\nThe following factors were considered as contributory:\r\n- Failure of the right engine resulted from failure of the impeller shaft thrust bearing which caused the flow of fuel into the induction system of the right engine to be interrupted,\r\n- Retraction of the landing gear was accomplished shortly after failure of the right engine,\r\n- The left engine developed full takeoff power continuously during takeoff and climb,\r\n- The manner in which the flaps were to be used under emergency conditions was left to the captain's discretion and was not specifically pointed out in the manual of operation,\r\n- The aircraft was flown 10 to 20 feet over wires which were 75 feet above and 11,700 feet from the point of takeoff,\r\n- Just before flying over the wires and at an air speed of 110 miles per hour, flaps were slowly but fully retracted from the takeoff position of 16 degrees,\r\n- After crossing the wires, the air speed fell to 105 miles per hour."}