{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-pickle-lake", "date": "Oct 2, 1999 at 1430 LT", "type": "De Havilland DHC-2 Beaver", "operator": "North%20Star%20Air", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Big Trout Lake - Geraldton", "msn": "919", "yom": 1956, "flight_number": null, "city": "Pickle Lake", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1420, "captain_hours_type": 725, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13372, "circumstances": "The de Havilland DHC-2 Beaver seaplane departed from Big Trout Lake, Ontario, on a visual flight rules flight for Geraldton, Ontario, with a pilot and an aircraft maintenance engineer on board. After encountering adverse weather conditions en route to Geraldton, the pilot decided to divert to Pickle Lake, Ontario. At about 1430 central daylight time, the engine lost power at an altitude of about 300 feet above ground level while in the descent for Pickle Lake. The pilot turned the aircraft toward a nearby narrow river. In an attempt to restart the engine, the pilot confirmed that the fuel pressure was normal, the fuel selector was on the fullest tank (front), the throttle was at idle, the mixture was rich, and the ignition switch was on both, then he operated the wobble pump. When the engine did not restart, he switched to the centre fuel tank and operated the wobble pump again, but the engine still did not restart. He then switched back to the front tank and tried another restart, without success. He then landed the aircraft on the river at an estimated landing speed of about 40 to 45 mph. After the forced landing, the left wingtip collided with trees on the river bank, and the aircraft yawed to the left about 180 degrees and struck the river bank, breaking off the floats and the float struts. Impact with more trees on the river bank damaged the right wing and elevator. Both occupants were wearing lap belts with shoulder harnesses and were uninjured. The aircraft was substantially damaged. The pilot advised Thunder Bay flight service station by radio of the engine failure and crash and the crew were rescued two hours later.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n- The engine quit operating because the aircraft fuel system was contaminated with a large amount of water.\r\n- The most likely source of the water contamination was the drums from which the aircraft was refuelled.\r\n- A proper filter to prevent water contamination was not used when the aircraft was refuelled.\r\n- The nose-level aircraft attitude when beached and the freezing of water probably prevented the water contamination from being drained from the front tank during the pilot's pre-flight checks. \r\nOther Findings:\r\n- The aircraft's maintenance records indicate that the aircraft was certified, equipped, and maintained in accordance with existing regulations and approved procedures.\r\n- The use of the available shoulder harnesses probably prevented serious injury to the pilot and engineer."}