{"url": "https://www.baaa-acro.com/crash/crash-learjet-24d-ronne", "date": "Sep 15, 2012 at 1340 LT", "type": "Learjet 24", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Strausberg - Rønne", "msn": "24-328", "yom": 1976, "flight_number": null, "city": "Rønne (Bornholm Island)", "zone": "Hovedstaden", "country": "Denmark", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The accident occurred during a private IFR flight from Strausberg Airport (EDAY), Germany, to Bornholm Airport (EKRN), Denmark. Before the flight, an ATS flight plan was filed. Before takeoff at EDAY, the aircraft was refueled with 200 liters of jet fuel. According to the ATS flight plan, the pilot stated the total endurance to be 01:30 hrs and the Estimated Elapsed Time (EET) to be 00:30 hrs. The pilot informed the AIB DK that the estimated total endurance before takeoff at EDAY was approximately 01:00 hrs. The aircraft departed EDAY at 10:58. Enroute, the pilot observed a low fuel quantity warning light. Otherwise, the flight was uneventful until the approach to EKRN. At 11:32:00 hrs and at a distance of approximately18 nm southwest of EKRN, the pilot cancelled the IFR flight plan and continued VFR for a visual approach to runway 29. While descending inbound EKRN, the airspeed was decreasing. At 11:37:08 hrs, the pilot reported to Roenne Tower that the aircraft was turning final for runway 29. The aircraft was cleared to land. The wind conditions were reported to be 280° 19 knots maximum 29 knots. The aircraft was configured for landing (the landing gear was down and the flaps extended to 40°). On a left base to runway 29, both engines suffered from fuel starvation. At 11:39:18 hrs, the pilot three times declared an emergency. The aircraft entered a stall and impacted terrain in a field of sweet corn. A search and rescue mission was immediately initiated.  ", "probable_cause": "CONCLUSION:\r\nInadequate en route fuel management resulted in fuel starvation of both engines, while the aircraft was flying at low altitude and the airspeed was decreasing. The dual engine flame out and the subsequent aircraft speed control led to an unrecoverable stall and consequently caused the accident.\r\nFINDINGS:\r\nOn board the aircraft in the pilot’s personal belongings, the AIB DK found 2 Airline Transport Pilot Licenses (ATPL) issued by the US Federal Aviation Administration (FAA). The 2 US ATPL licenses had the same FAA license number but the names of the license holders were different. The names of the license holders were inconsistent with the pilot’s Iranian identity.  \r\nThe BFU informed the AIB DK that the pilot was neither in possession of a valid German pilot license nor a German validation of an US license, which was required to operate a German registered aircraft.\r\nThe NTSB informed the AIB DK that the pilot was not in possession of a valid US pilot license.  \r\nIt has not been possible for the AIB DK to determine whether or not the pilot was in possession of valid pilot license issued by another state. \r\nThe BFU informed the AIB DK that the certificate of aircraft registration was cancelled in 2009. Later on in the investigation, the BFU corrected this information. On February 2nd , 2012 and due to a missing airworthiness certificate, the Luftfahrt-Bundesamt (CAA - Germany) revoked the certificate of aircraft registration.  \r\nThe latest valid airworthiness certificate was issued on the 8th of March 2004 and expired on the 31st of March 2005. \r\n At the time of the accident, the aircraft was not recorded to be maintained by a JAR 145 maintenance organization, a maintenance program or a Continuing Airworthiness Management Organization (CAMO). "}