{"url": "https://www.baaa-acro.com/crash/crash-rockwell-gulfstream-690c-jetprop-840-arctic-ocean-3-killed", "date": "Oct 11, 1990 at 1730 LT", "type": "Rockwell Gulfstream 690C Jetprop 840", "operator": "Alaska Helicopters", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Deadhorse - Deadhorse", "msn": "690-11623", "yom": 1980, "flight_number": null, "city": "Arctic Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 17500, "captain_hours_type": 1200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3115, "circumstances": "On October 11, 1990, about 1730 Alaska daylight time, a wheel-equipped Gulfstream Aerospace 690C Turbine Commander airplane, N45Q, is presumed to have crashed in the Arctic Ocean about 200 miles north-northwest of Deadhorse, Alaska. Neither the airplane nor its occupants have been located. The airplane was being operated by the US Department of the Interior, as a visual flight rules (VFR) public use local game management flight, for the purpose of locating radio collared polar bears, when the accident occurred. The airplane, registered to Bowhead Equipment Company of Seattle, Washington, and operated by Alaska Helicopters, Inc. of Anchorage, Alaska, is presumed to have been destroyed. The certificated airline transport pilot, and the two passengers, are presumed to have received fatal injuries. Visual meteorological conditions prevailed at the point of departure. A VFR flight plan was filed by the pilot for a 5.5 hour flight originating and terminating at Deadhorse. The accident flight originated at the Deadhorse Airport about 1429. According to information received from the Federal Aviation Administration's (FAA), Air Route Traffic Control Center, radar contact was lost with the accident airplane while it was maneuvering at 22,000 feet msl, about 200 miles north-northwest of Deadhorse. The accident airplane did not reach the intended destination of Deadhorse, and was not located at any airport. The FAA issued an alert notice (ALNOT) at 2221. Search personnel began an extensive search effort that included a high altitude, special radar-equipped airplane, surface vessels, and ground search personnel. The search was suspended on October 26, 1990.", "probable_cause": "The cause of the accident could not be determined. "}