{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-118a-liftmaster-near-sainte-anne-des-monts-4-killed", "date": "Jun 26, 1989 at 1940 LT", "type": "Douglas C-118 Liftmaster", "operator": "Conifair", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Mountains", "schedule": "Bonaventure - Bonaventure", "msn": "43717", "yom": 1953, "flight_number": null, "city": "Sainte-Anne-des-Monts", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 24220, "circumstances": "A Douglas C-118A (DC-6A) fire fighting plane was destroyed in an accident near Sainte-Anne-des-Monts, QC, Canada. All four crew members were killed. The Conifair plane took off from Bonaventure Airport, QC (YVB) at 19:15 for a spray operation 30 miles southeast of Sainte-Anne-des-Monts. This was to be the last spraying flight of the season out of the Bonaventure base. A crew of four was on board, including two flight engineers who were on a familiarization training flight. The aircraft was carrying 2,952 U.S. gallons of Dipel 132, a non-toxic microbial insecticide. The aircraft arrived over the spray area at 19:35. An inertial navigation system (INS) to follow pre-established spraying tracks. The first track was sprayed uneventfully. At the end of the first track, the aircraft made a 180-degree turn to spray the second track, which was parallel to and about 800 feet northeast of the first track. This meant that the aircraft had to fly from a valley at an elevation of 1,000 feet above sea level (asl) up a mountain consisting of two levels. The first level is about 1,800 feet asl and about 3,280 feet along the flight path. After the first level, the terrain rose within approximately 1,000 feet along the flight path, to the summit of the mountain at an elevation of 2,175 feet asl. The two occupants of a Cessna 310 spotter aircraft observed a decrease of the DC-6A ground speed during the climb over the first level of the mountain. They then noticed that the aircraft yawed and started a steep, left turn. The spotter crew stated that, shortly after the start of the left turn, the DC-6A left wing began to strike trees. The aircraft nosed down, crashed on the side of the mountain, and exploded at an elevation of 2,050 feet asl.", "probable_cause": "On a low-level spraying flight, the crew attempted a climb over rising terrain which exceeded the climb performance of the aircraft."}