{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-new-albany-2-killed", "date": "May 2, 2010 at 2016 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Deems Holdings", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Paducah – Louisville", "msn": "46-36192", "yom": 1999, "flight_number": null, "city": "New Albany", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2494, "captain_hours_type": 14, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1396, "circumstances": "The instrument-rated pilot was issued a clearance to descend to 4,000 feet for radar vectors to a non precision instrument approach in instrument meteorological conditions (IMC). The last 1 minute 23 seconds of radar data indicated the airplane leveled at 4,000 feet for about 35 seconds and then varied between 3,800 feet and 3,900 feet for the remainder of the flight for which data was available. During this timeframe, the airspeed decreased from 131 knots to 57 knots. Witnesses observed the airplane descending in a spin, and one reported hearing the engine running. Recorded engine data showed an increase in engine power near stall speed, which was likely the pilot's response to the low airspeed. The airplane damage was consistent with a low-speed impact with some rotation about the airplane's vertical axis. The pilot did not make any transmissions to air traffic control indicating any abnormalities or emergency. Post accident examination of the airplane revealed no anomalies that would have precluded normal operation. During training on the accident airplane, the instructor recommended that the pilot get 25 to 50 hours of flight in visual meteorological conditions before flying in IMC in order to gain more familiarity with the radios, switches, and navigation equipment. The pilot only had 14 hours of flight time in the accident airplane before the accident flight, however it could not determined whether this played a role in the accident.", "probable_cause": "The pilot’s failure to maintain airspeed in instrument meteorological conditions, which resulted in an aerodynamic stall."}