{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-99a-airliner-puerto-montt-9-killed", "date": "Jul 10, 2008 at 1025 LT", "type": "Beechcraft 99 Airliner", "operator": "Aerocord", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Puerto Montt - Melinka", "msn": "U-145", "yom": 1971, "flight_number": null, "city": "Puerto Montt-Marcel Marchant (La Paloma)", "zone": "Región de Los Lagos", "country": "Chile", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 17145, "captain_hours_type": 563, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after take off, while in initial climb, the pilot declared an emergency after the left engine cowling accidentally opened. He decided to return for an emergency landing and completed a turn. While on final, the pilot elected to maintain 200 feet but the aircraft stalled and crashed 1,500 metres short of runway 01. The aircraft was totally destroyed and all nine occupants were killed. ", "probable_cause": "Operational error of the pilot in command by not applying normal approach procedures recommended by the manufacturer and loss control of the aircraft (stall) while returning to land with the left engine cowling open.\r\nThe following contributing factors were identified: \r\n- During the preflight inspection, the pilot failed to detect that the left engine cowling was unlatched,\r\n- Return with the intention of landing with a speed very close to the stall speed, possibly to avoid the detachment of the engine cowling due to the wind force,\r\n- Probable increased stall speed by altering the left wing aerodynamics due to the engine open cowl,\r\n- Not having high enough altitude to recover from a stall condition,\r\n- Possible decreased physiological capabilities of the commander of the aircraft, due to the presence of alcohol in his system,\r\n- Possible pilot distraction due to weather conditions and the opening of the engine cowling. "}