{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-mt-elizabeth-3-killed", "date": "Jan 23, 2013 at 0827 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Kenn%20Borek%20Air-2_0", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Mountains", "schedule": "Amundsen-Scott Station - Terra Nova-Zucchelli Station", "msn": "650", "yom": 1979, "flight_number": null, "city": "Mt Elizabeth", "zone": "All Antarctica", "country": "Antarctica", "region": "Antarctica", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 22300, "captain_hours_type": 7770, "copilot_hours": 790, "copilot_hours_type": 450, "aircraft_hours": 28200, "circumstances": "The aircraft departed South Pole Station, Antarctica, at 0523 Coordinated Universal Time on 23 January 2013 for a visual flight rules repositioning flight to Terra Nova Bay, Antarctica, with a crew of 3 on board. The aircraft failed to make its last radio check-in scheduled at 0827, and the flight was considered overdue. An emergency locator transmitter signal was detected in the vicinity of Mount Elizabeth, Antarctica, and a search and rescue effort was initiated. Extreme weather conditions hampered the search and rescue operation, preventing the search and rescue team from accessing the site for 2 days. Once on site, it was determined that the aircraft had impacted terrain and crew members of C-GKBC had not survived. Adverse weather, high altitude and the condition of the aircraft prevented the recovery of the crew and comprehensive examination of the aircraft. There were no indications of fire on the limited portions of the aircraft that were visible. The accident occurred during daylight hours.", "probable_cause": "The accident was caused by a controlled flight into terrain (CFIT).\r\nFindings:\r\nThe crew of C-GKBC made a turn prior to reaching the open region of the Ross Shelf. The aircraft might have entered an area covered by cloud that ultimately led to the aircraft contacting the rising terrain of Mount Elizabeth.\r\nOther findings:\r\nThe cockpit voice recorder (CVR) was not serviceable at the time of the occurrence.\r\nThe company did not have a practice in place to verify the functionality of the CVR prior to flight.\r\nThe rate of climb recorded in the SkyTrac ISAT-100 tracking equipment prior to contacting terrain was consistent with the performance figures in the DHC-6 Twin Otter Series 300 Operating Data Manual 1-63-1, Revision 7."}