{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-avon-park", "date": "Jul 15, 1997 at 1953 LT", "type": "Learjet 35", "operator": "Orion Aircraft Leasing", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Lauderdale - Avon Park", "msn": "35-279", "yom": 1980, "flight_number": null, "city": "Avon Park", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 20076, "captain_hours_type": 1500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13726, "circumstances": "Witnesses near the airport saw the flight approach on a left base to runway 4, touchdown on the runway, and takeoff again. One witness, a pilot, said the airplane turned onto final to the 'south' (right) of the runway centerline.' The airplane made a 'sharp' turn to the left to realign with the runway center, slightly overshot the runway to the left, turned to the right 'sharply,' and touched down on the runway. The witness further stated, '...by the time the pilot was on the runway he had wasted approximately 1,200 to 1,500 feet of runway 4, they hit reverse thrusters [sic] and were on full bore till they crossed runway 27 and 9.' The witness saw heat come out of both engine thrust reversers, the nose gear touched down and then came up again. He then saw the airplane come off the ground about 30 to 40 feet, wobble left and right at a 'slow airspeed,' crossover a highway at a low altitude, right wing low, strike some wires, go into a field, and catch fire. The pilot said, when he touched down on the runway, the airplane seemed to 'lurch' to the side. He said at this point his airspeed was 126 knots. He elected to abort the landing, and applied full power. He said the engines would not develop thrust and he elected to land in a field less than 1/4 mile in front of him. Examination of the left thrust reverser revealed that the translator was in the deployed position, with the blocker doors fully open. Both the left and right pneumatic latches were found in the unlocked position. Examination of the right thrust reverser revealed that the translator was in the deployed position, with the blocker doors fully closed. The left pneumatic latch was found in the locked position. The right pneumatic latch was found in the unlocked position. The inboard sequence latches were found about 2 inches forward of full aft travel. The thrust reverser switch was found in the 'NORMAL' position. According to Gates Lear Jet Airworthiness Directive (AD) 79-08-01, '...to preclude inadvertent thrust reverser deployment and possible loss of aircraft control....,' the following limitations apply to all gates Lear Jet Model 35, 36, 35A, 36A, aircraft equipped with Aeronca Thrust reversers. According to the AD, Section I-LIMITATION; '....Thrust Reversers must not be operated prior to takeoff...Thrust Reversers must not be used for touch and go landings...After Thrust Reversers have been deployed, a visual check of proper door stowing must be made prior to takeoff...Operational Procedures in this Thrust Reverser Supplement are mandatory.' According to Lear Jet and FlightSafety International, the procedures that are taught to Lear Jet pilots in the use of thrust reverse and spoilers during landings are; '...pilots [are] to use thrust reverse only on full stop Lear Jet landings. Pilot are trained not to deploy spoilers or thrust reverse during touch and go's or during balked landings.' The pilot-in-command of N19LH at the time of the accident, told the NTSB investigator-in-charge (IIC) that he was 'aware' of the limitations on the Aeronca Thrust Reverser and he knew that once the Thrust Reverser was deployed that he was 'committed' to land. The pilot told the IIC that he knew of the limitations and that he was committed to land. ", "probable_cause": "A loss of engine power as a result of the thrust reversers being deployed and subsequent inflight collision was wires. Factors in this accident were the pilot's disregard for procedures, and the improper use of the thrust reversers. "}