{"url": "https://www.baaa-acro.com/crash/crash-cessna-208-caravan-i-dillingham-10-killed", "date": "Oct 10, 2001 at 0926 LT", "type": "Cessna 208A Caravan", "operator": "PenAir-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dillingham – King Salmon", "msn": "208-0088", "yom": 1986, "flight_number": "KS350", "city": "Dillingham", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 3100, "captain_hours_type": 869, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10080, "circumstances": "The airplane was parked outside on the ramp the night before the accident and was subjected to rain, snow, and temperatures that dropped below 32 degrees F. Other pilots whose airplanes were also parked outside overnight stated that about 1/4 to 1/2 inch of snow/frost covered a layer of ice on their airplanes the morning of the accident. Because of these conditions, ramp personnel deiced the accident airplane with a heated mixture of glycol and water. The PenAir ramp supervisor who conducted the deicing stated that he believed the upper surface of the wing was clear of ice but that he did not physically touch the wing to check for the presence of ice. Investigators were unable to determine whether the accident pilot visually or physically checked the wing and tail surfaces for contamination after the accident airplane was deiced. However, the airplane's high-wing configuration would have hindered the pilot's ability to see residual clear ice on the surface of the wing after the deicing procedures. Company records indicate that the certificated commercial pilot completed his initial CE-208 flight training 2 months before the accident and had accumulated a total of 74 hours in this make and model of airplane. The airplane, with the pilot and nine passengers onboard, crashed shortly after takeoff from runway 01. A witness observed that the airplane's flight appeared to be normal until the airplane suddenly pitched up, rolled 90 degrees to the left, and yawed to the left. The airplane then descended nose-down until it disappeared from view. Data from the engine monitoring system revealed that the maximum altitude obtained during the accident flight was about 651 feet mean sea level. The airplane crashed in a level attitude. Investigators found no evidence of pre-impact failures in the structure, flight control systems, or instruments. Further, examination of the engine and propeller revealed no pre-impact failures and that the engine was running when the airplane hit the ground.", "probable_cause": "An in-flight loss of control resulting from upper surface ice contamination that the pilot-in-command failed to detect during his preflight inspection of the airplane. Contributing to the accident was the lack of a preflight inspection requirement for CE-208 pilots to examine at close range the upper surface of the wing for ice contamination when ground icing conditions exist."}