{"url": "https://www.baaa-acro.com/crash/crash-cessna-441-conquest-ii-near-winchester-3-killed", "date": "Feb 7, 2021 at 1648 LT", "type": "Cessna 441 Conquest", "operator": "BCD Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Thomasville – Winchester", "msn": "441-0121", "yom": 1980, "flight_number": null, "city": "Winchester", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On February 7, 2021, about 1648 central standard time, a Cessna 441, N44776, was destroyed when it was involved in an accident near Belvidere, Tennessee. The airline transport pilot and a commercial pilot-rated passenger were fatally injured. The airplane was operated as a Title 14 Code of Federal Regulations Part 91 personal flight. According to preliminary radar and communications information obtained from the Federal Aviation Administration, the pilot took off from Thomasville Regional Airport (TVI), Thomasville, Georgia about 1527 with a destination of Winchester Municipal Airport (BGF), Winchester, Tennessee. As the airplane was descending to 4,000 ft mean sea level (msl), the pilot established contact with the Bowling Green, Kentucky radar controller. The flight was then cleared for the RNAV runway 36 approach. As the airplane descended through 2,300 ft, the radar target disappeared, which was normal due to the radar coverage in the area. About 3 minutes later, the controller attempted to contact the pilot with no response. There was no further communication with the pilot. Later that evening, the wreckage was found about 6 miles south of BGF. The wreckage path was about 500 ft in length, and oriented on a northerly heading. A large portion of the fuselage and both wings were consumed by a postimpact fire.", "probable_cause": null}