{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-guaymaral", "date": "Sep 22, 2020 at 0655 LT", "type": "Cessna 208B Grand Caravan", "operator": "Henry Moreno Cortazar", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Guaymaral – Flandes", "msn": "208B-0968", "yom": 2002, "flight_number": null, "city": "Bogotá-Guaymaral", "zone": "Bogotá Capital District", "country": "Colombia", "region": "South America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13220, "captain_hours_type": 1506, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2830, "circumstances": "After takeoff from Guaymaral-Flaminio Suárez Camacho Airport runway 29, while climbing to a height of 200 feet, the engine suffered and explosion and lost power. The airplane started to descend, impacted a brick wall and lost its undercarriage. It then crash landed in a prairie and slid for few dozen metres before coming to rest. All five occupants escaped uninjured. The accident occurred three minutes after takeoff. ", "probable_cause": "The investigation determined that the accident was caused by the following probable causes:\r\n- Emergency landing of the aircraft on an unprepared field, as a result of a decrease in power, generated by engine failure.\r\n- An engine failure caused by the fracture of three (3) blades of the rotor disk of the high pressure compressor, which caused severe backwards damage to the hot and power section.\r\nContributing Factors:\r\n- Non-compliance in the engine maintenance process, of what was ordered in AD. No. 2014-17-08R1 FAA (year 2014), which establishes the replacement of the engine blades high pressure compressor in anticipation of material failures in these components.\r\n- Deficient maintenance processes by the provider of this service to the aircraft HK4669G, by not detecting the condition of the high-pressure rotor blades in the boroscopic inspections of the high pressure during routine boroscopic inspections.\r\n- Deficient verification of the Operator's contracted maintenance processes, by not verifying the quality and compliance the quality and full compliance of these processes by the maintenance service provider."}