{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh106-comet-barcelona-112-killed", "date": "Jul 3, 1970 at 1805 LT", "type": "De Havilland DH.106 Comet", "operator": "Dan-Air%20London", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Manchester - Barcelona", "msn": "6415", "yom": 1959, "flight_number": "DA1903", "city": "Arbúcies", "zone": "Catalonia", "country": "Spain", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 105, "pax_fatalities": 105, "other_fatalities": 0, "total_fatalities": 112, "captain_hours": 7427, "captain_hours_type": 605, "copilot_hours": 4765, "copilot_hours_type": 189, "aircraft_hours": 25786, "circumstances": "Comet G-APDN departed Manchester at 1608 for a charter flight to Barcelona. ATC delays in the Paris area resulted in a different route to be flown. At 1753LT the pilot contacted Barcelona ACC. The aircraft was then cleared to descend from FL220 to FL90. At 1759LT the flight switched to Barcelona Approach. Barcelona Approach cleared the crew direct to the Sabadell beacon and cleared them to descend to FL60. While carrying out a left turn to a heading of 140°, as instructed by Barcelona Approach, the crew mistakenly reported passing the Sabadell NDB. At that time another aircraft overflew Sabadell, causing the error to go unnoticed by the controller. The controller then cleared the Comet to descend to 2,800 feet. At approx. 1805LT the aircraft struck beech trees on the northeast slopes of the cloud-covered Les Agudes peak at an altitude of about 3,800 feet and crashed. The wreckage was found in the Sierra del Montseny, near the village of Arbúcies. The aircraft was totally destroyed and all 112 occupants have been killed. ", "probable_cause": "To sum up, it can be deduced that the combination of erroneous information regarding reporting points, together with the existence of a radar echo over Sabadell NDB (coinciding with the report from the aircraft of passing that reporting point), led both the aircraft and APP to believe, erroneously, that the aircraft was already over Sabadell; this was an involuntary error (on both sides: ATC and aircraft) which was physically impossible to correct when Air Traffic Control realised it."}