{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-columbia", "date": "Jan 19, 1996 at 0923 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Bankair", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Columbia - Columbia", "msn": "784", "yom": 1980, "flight_number": null, "city": "Columbia", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16878, "captain_hours_type": 4348, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6073, "circumstances": "The flight departed on a maintenance test flight with known wind gusts to 27 knots. Before takeoff the pilot performed an NTS check to each engine with no discrepancies noted. During flight the pilot performed an NTS check to the left engine. Two attempts to restart the left engine were unsuccessful. Each time the propeller came out of the feathered position and started to rotate but there was no fuel flow or ignition. The flight returned to land and while on short final to runway 29 with the wind from 250 degrees at 20 knots, a witness observed the airplane pitch nose up then down then heard the sound of power applied to the right engine. The airplane than rolled to the left, pitched nose down, impacted the ground coming to rest nearly inverted with the wing section separated. Postaccident examination of the left engine and accessories revealed no evidence of preimpact failure or malfunction. The left engine fuel shutoff valve was found in the 'closed' position and no fuel was found aft of the fuel shutoff valve. The pilot stated that he has no recollection of the accident. The left and right engines had just been installed following 'hot section' work to both, and both were then started the day after installation with no discrepancies noted by company maintenance personnel. ", "probable_cause": "A total loss of power on one engine for undetermined reasons, and the pilot-in-command's failure to maintain airspeed (VMC) resulting in an in-flight loss of control. Contributing to the accident was the wind gusts encountered while on final approach to land. "}