{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-30cf-faro-56-killed", "date": "Dec 21, 1992 at 0833 LT", "type": "Douglas DC-10", "operator": "Martinair%20Holland.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Amsterdam - Faro", "msn": "46924", "yom": 1975, "flight_number": "MP495", "city": "Faro", "zone": "Algarve", "country": "Portugal", "region": "Europe", "crew_on_board": 13, "crew_fatalities": 2, "pax_on_board": 327, "pax_fatalities": 54, "other_fatalities": 0, "total_fatalities": 56, "captain_hours": 14441, "captain_hours_type": 1497, "copilot_hours": 2288, "copilot_hours_type": 1787, "aircraft_hours": 61543, "circumstances": "At 0552LT, the aircraft departed Amsterdam-Schiphol Airport on a charter flight to Faro. The flight had been delayed for 40 minutes due to n°2 engine reverser problems. After a flight of 2 hours and 17 minutes, the crew was cleared to descend to FL070. Shortly afterwards Faro Approach Control provided the crew with the following weather: wind 15°/18 knots; 2,500 metres visibility, thunderstorms with 3/8 clouds at 500 feet, 7/8 clouds at 2,300 feet and 1/8 cumulonimbus at 2,500 feet, OAT 16° C. Clearance to descend to 1,220 metres was given at 0820LT, followed by a clearance to 915 metres and 650 metres 4, respectively 6 minutes later. At 0829LT the crew were informed that the runway was flooded. At an altitude of 303 metres and at a speed of 140 knots, the aircraft became unstable and at 177 metres the first officer switched the autopilot from CMD (command mode) to CWS (control-wheel steering). One minute later it was switched from CWS to manual and the airspeed began falling below approach reference speed. About 3-4 seconds short of touchdown, elevator was pulled to pitch up and engine power was increased. When the n°3 and 5 spoilers extended, the aircraft banked to the right to an angle of 25°. The right main gear struck the the runway surface with a rate of descent of 900 feet per minute and at a speed of 126 knots. With a nose up attitude of 8,79° and a roll angle of 5,62°, the aircraft touched down with a positive acceleration of 1,95 g. Upon impact, the right wing separated while the aircraft slid down the runway and came to rest 1,100 metres from the runway 11 threshold and 100 metres to the right of the centreline, bursting into flames. Two crew members and 54 passengers were killed while 284 other occupants were evacuated, among them 106 were seriously injured. ", "probable_cause": "The high rate of descent in the final phase of the approach and the landing made on the right landing gear, which exceeded the structural limitations of the aircraft.; The crosswind, which exceeded the aircrafts limits and which occurred in the final phase of the approach and during landing. The combination of both factors determined stresses which exceeded the structural limitations of the aircraft. Contributing factors were: The instability of the approach; the premature power reduction, and the sustaining of this condition, probably due to crew action; the incorrect wind information delivered by Approach Control; the absence of an approach light system; the incorrect evaluation by the crew of the runway conditions; CWS mode being switched off at approx. 80ft RA, causing the aircraft to be in manual control in a critical phase of the landing; the delayed action of the crew in increasing power; the degradation of the lift coefficient due to heavy showers. The Netherlands Aviation Safety Board commented that the probable cause should read: \"a sudden and unexpected wind variation in direction and speed (windshear) in the final stage of the approach. Subsequently a high rate of descent and an extreme lateral displacement developed, causing a hard landing on the right-hand main gear, which in combination with a considerable crab angle exceeded the aircraft structural limitations. Contributing factors: From the forecast and the prevailing weather the crew of MP495 did not expect the existence of windshear phenomena.; The premature large power reduction and sustained flight idle thrust, most probable due to crew action.; CWS mode being disengaged at approx. 80ft RA, causing the aircraft to be in manual control at a critical stage in the landing phase."}