{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-praia-1-killed", "date": "Sep 28, 1998 at 1330 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "TACV%20Cabo%20Verde%20Airlines.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Government", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Campo de Priguiça – Praia", "msn": "550", "yom": 1977, "flight_number": "VR5301", "city": "Praia", "zone": "All Cabo Verde", "country": "Cabo Verde", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 19, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft was completing a government flight (VR5301) from Campo de Priguiça to Praia, carrying three crew members and the Prime Minister Carlos Veiga and his team. On approach to Praia-Francisco Mendes Airport, the crew encountered poor weather conditions with thunderstorm activity, heavy rain falls and strong winds. The crew was cleared to make a low pass over runway 22 then make a sharp turn to the left, causing the left wing tip to struck the ground. Out of control, the aircraft crashed 150 metres from the runway 04 threshold. A passenger, a Prime Minister's bodyguard, was killed while 21 other occupants were injured, four seriously. ", "probable_cause": "It was reported that prior to departure from Campo de Priguiça Airport, the crew was informed about weather conditions at destination that were considered as good with 10 km visibility and clouds at 1,400 feet. It was determined that weather conditions at Praia Airport deteriorated en route and the crew failed to obtain a second bulletin from ATC based at Praia. Also, the crew departed Campo de Priguiça Airport with insufficient fuel reserve, which contributed to the precipitation of the last flight sequence. "}