{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61p-aerostar-ted-smith-601-near-carrollton", "date": "Oct 20, 2016 at 1110 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Ian McMahon", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Hampton – Carrollton", "msn": "61-0183-012", "yom": 1974, "flight_number": null, "city": "Carrollton", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1338, "captain_hours_type": 36, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2236, "circumstances": "The pilot reported that the purpose of the flight was to reposition the airplane to another airport for refuel. During preflight, he reported that the airplane's two fuel gauges read \"low,\" but the supplemental electronic fuel totalizer displayed 55 total gallons. He further reported that it is not feasible to visual check the fuel quantity, because the fueling ports are located near the wingtips and the fuel quantity cannot be measured with any \"external measuring device.\" According to the pilot, his planned flight was 20 minutes and the fuel quantity, as indicated by the fuel totalizer, was sufficient. The pilot reported that about 12 nautical miles from the destination airport, both engines began to \"surge\" and subsequently lost power. During the forced landing, the pilot deviated to land in grass between a highway, the airplane touched down hard, and the landing gear collapsed. The fuselage and both wings sustained substantial damage. The pilot reported no preaccident mechanical malfunctions or failures with the airplane that would have precluded normal operation. The pilot reported in the National Transportation Safety Board Pilot/ Operator Aircraft Accident Report that there was a \"disparity\" between the actual fuel quantity and the fuel quantity set in the electronic fuel totalizer. He further reported that a few days before the accident, he set the total fuel totalizer quantity to full after refueling, but in hindsight, he did not believe the fuel tanks were actually full because the wings may not have been level during the fueling. The \"Preflight\" chapter within the operating manual for the fuel totalizer in part states: \"Digiflo-L is a fuel flow measuring system and NOT a quantity-sensing device. A visual inspection and positive determination of the usable fuel in the fuel tanks is a necessity. Therefore, it is imperative that the determined available usable fuel be manually entered into the system.\"", "probable_cause": "The pilot's failure to verify the usable fuel in the fuel tanks, which resulted in an inaccurate fuel totalizer setting during preflight, fuel exhaustion, and a total loss of engine power."}