{"url": "https://www.baaa-acro.com/crash/crash-antonov-32-mogadishu-1-killed", "date": "Oct 9, 1992", "type": "Antonov AN-32", "operator": "Kievskoye MAP", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nairobi - Mogadishu", "msn": "29 05", "yom": 1992, "flight_number": null, "city": "Mogadishu", "zone": "Banaadir (بنادر‎)", "country": "Somalia", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Nairobi on a cargo flight to Mogadishu, carrying seven passengers and six crew members. Due to unavailable information about the destination airport, the crew failed to prepare the flight properly and this was his first flight in the area. By night, the crew attempted to land at Mogadishu-North Airfield which was not equipped with any lighting system, so the crew completed the approach with the aircraft's approach lights only. A poor approach configuration caused the aircraft to land too far down the runway which is 1,500 metres long, about 1,000 metres past the runway threshold. The aircraft rolled for about 500 metres, overran at a speed of 280 km/h and came to rest 250 metres further in a ravine, broken in two. Twelve occupants were injured, among them six seriously, and the navigator was killed. ", "probable_cause": "The accident was caused by the combination of the following factors: \r\n- Poor flight planning, \r\n- Despite a lack of suitable information and data about the destination airport, the crew decided to initiate the flight, \r\n- Poor approach planning, \r\n- The crew was not familiar with the area, \r\n- The captain decided to land on an unsuitable terrain and failed to initiate a go-around procedure, \r\n- Poor crew interactions on final approach as the copilot and the navigator failed to assist the captain in the approach and landing procedures, \r\n- The crew failed to respond to the captain's instruction to deploy the flaps to an angle of 25° on approach, which contributed to a too long landing, \r\n- Wrong approach configuration."}