{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-innemincka", "date": "May 29, 1993 at 1258 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Augusta Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Port Augusta – Innamincka – Durham Downs", "msn": "31-7652173", "yom": 1976, "flight_number": null, "city": "Innamincka", "zone": "South Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2930, "captain_hours_type": 966, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was conducting a scheduled passenger service flight from Port Augusta with a stop at Innamincka. A commercial pilot, travelling as a non-paying passenger, occupied the co-pilot's seat to observe the operation. Two additional passengers were on board the aircraft for the entire flight. After landing at Innamincka, the aircraft was refuelled by the pilot in command and the oil levels of both engines were checked by the observer, who experienced difficulty securing the combination oil filler cap-dipsticks. He asked the pilot for instructions and, although some advice was given, the pilot did not check the security of the dipsticks. Take-off was commenced towards the north into a 10-15 knot wind with a surface temperature of about 20 degrees C. Shortly after lift-off, at the first power reduction, the observer in the co-pilot's seat advised that there was oil seeping back along the cowl from the right side oil filler hatch. The pilot reported that he increased power to both engines but believed there was no response from the right. He began an immediate left turn to complete a circuit and attempted to secure the right engine and feather the propeller. The aircraft then began a roll to the right, the nose dropped and the aircraft impacted the ground. As the aircraft rolled right and the nose dropped, the pilot reported that he had secured the left engine and feathered the propeller. The observer in the co-pilot seat reported hearing a continuous stall warning horn as the right wing began to drop. All occupants, although injured, were able to vacate the aircraft through the main cabin door. The pilot provided assistance to the passengers and then returned to the airport to summon help.", "probable_cause": "Examination of the wreckage revealed that the aircraft impacted the ground in a nose down, right wing low attitude while turning right. The landing gear collapsed due to impact forces and the right wing separated. Deceleration and impact forces were severe. The right propeller was found in the fine pitch range with no damage to the uppermost blade and the other two bent backwards. The right engine oil filler cap-dipstick was found to be correctly installed in the oil filler neck. There was a pattern of engine oil over the rear of the engine and inside the cowl originating from the oil filler neck. The left engine was partially torn from its mountings and displaced about 90 degrees to the right. Its propeller was in the fully feathered position. The oil filler cap-dipstick was on the ground adjacent to the engine. An oil spill pattern similar to that on the right engine was evident.\r\nSignificant Factors:\r\n- The pilot-in-command reacted inappropriately to a perceived engine problem shortly after take-off.\r\n- Control of the aircraft was lost at a height insufficient to effect a recovery."}