{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-1245-sea-okhotsk", "date": "Jul 8, 2001 at 1345 LT", "type": "Pilatus PC-12", "operator": "Access Air", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Hakodate - Magadan", "msn": "356", "yom": 2000, "flight_number": null, "city": "Sea of Okhotsk", "zone": "All Russia", "country": "Russia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On July 8, 2001, approximately 1345 local time (0245UTC), a Pilatus PC-12/45, N660NR, registered to a US private owner, operated by Jeflyn Aviation, Inc. doing business as Access Air, and being flown by a US certificated airline transport rated pilot, was presumed destroyed following a ditching in the Sea of Okhotsk, Western Pacific Ocean. The pilot sustained minor injuries and the three remaining Japanese passengers were uninjured. Instrument meteorological conditions prevailed, and an IFR flight plan had been filed and activated. The flight, which was returning to the United States following a round-the-world trip, was being operated under 14CFR91 as a business trip. The aircraft had originated from Hakodate, Japan, departing 0910 hours local time and was destined for Magadan, Russia. The pilot reported in a telephonic interview that the aircraft was established in cruise at 8,100 meters altitude when he felt a vibration followed by a rapid increase in the engine's Turbine Temperature Indication (TTI). He reported that the TTI reached 1144 degrees during which there was a compressor stall. He shut the engine down, feathered the propeller, and initiated a power off emergency descent. During the emergency descent the pilot radioed a mayday on 121.5 MHz, set his transponder to code 7700, and manually activated the emergency locator beacon. The aircraft descended through multiple cloud layers during which the pilot and passengers prepared for the ditching. The pilot reported that upon breaking through the bottom of the last overcast layer, at 100 feet above the water, he encountered swells of approximately 8-12 feet height. He ditched the aircraft on the crest of a swell and the aircraft came to a stop floating in an upright, level attitude. All four occupants exited the aircraft through the main cabin door into a life raft. Over a period of several hours the occupants lost sight of the floating aircraft and after about 15 hours they were picked up by a Russian container ship and airlifted to Sakhalin Island.", "probable_cause": "Engine failure for unknown reasons. "}