{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-134a-3-petrozavodsk-47-killed", "date": "Jun 20, 2011 at 2340 LT", "type": "Tupolev TU-134", "operator": "RusAir", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Petrozavodsk", "msn": "63195", "yom": 1980, "flight_number": "CGI9605", "city": "Petrozavodsk", "zone": "Republic of Karelia", "country": "Russia", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 8, "pax_on_board": 43, "pax_fatalities": 39, "other_fatalities": 0, "total_fatalities": 47, "captain_hours": 8501, "captain_hours_type": 3158, "copilot_hours": 2846, "copilot_hours_type": 1099, "aircraft_hours": 35591, "circumstances": "Aircraft left Moscow-Domodedovo Airport in 2224LT for Petrozavodsk, Karelia. On final approach by night and fog reducing vertical visibility to 300 metres, crew descended too low without a visual contact was established with the runway lights. Aircraft descended below the MDA, hit an electric pole, crashed on a road and came to rest in a garden, 570 metres short of runway 02. Eight people were rescued as all other 44 occupants were killed. Flight was operated by RusAir on behalf of RusLine (flight 243). Russian FIFA's football referee Vladimir Pettaï was also killed in this accident. Two days later, a survivor died from his injuries. The weekend following the accident (five days and six days later), two survivors died from their injuries (burns). ", "probable_cause": "When the aircraft approached the airfield in weather below minimums for the aerodrome descending on autopilot at a fixed vertical speed, crew failed to decide to go around in absence of visual contact with approach lights and landmarks and permitted the aircraft to descend below minimum descent altitude, which led to impact with trees and the ground in controlled flight.\r\nFollowing factors were considered as contirbutory:\r\n- unsatisfactory crew resource management by the commander who effectively removed the first officer from the control loop in the final stages of the accident flight and who subordinated himself to the navigator showing increased activity however in the state of mild alcoholic intoxication.\r\n- the navigator was in the state of mild alcoholic intoxication\r\n- unjustified weather forecasts by height of cloud base, visibility and severe weather including fog as well as the non-conformity of weather data of Petrozavodsk Airport transmitted to the crew 30 and 10 minutes prior to estimated landing.\r\n- Failure to use indications by the ADFs and other devices of the aircraft while using indications by an unapproved satellite navigation system KLN-90 in violation of flight manual supplements for the TU-134. "}