{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154m-novgorodskoye-170-killed", "date": "Aug 22, 2006 at 1539 LT", "type": "Tupolev TU-154", "operator": "Pulkovo%20Aviation.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Anapa - Saint Petersburg", "msn": "91A-894", "yom": 1991, "flight_number": "FV612", "city": "Novgorodskoye", "zone": "Donetsk Oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 160, "pax_fatalities": 160, "other_fatalities": 0, "total_fatalities": 170, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 24215, "circumstances": "The aircraft departed Anapa Airport at 1505LT and climbed to the assigned altitude of 11,700 metres. Due to the presence of stormy weather ahead, the crew was cleared to modify his route and changed heading to avoid the thunderstorm area with CB's up to 15 km. The aircraft encountered severe turbulences and climbed from 11,961 metres to 12,794 metres within 10 seconds, reaching a super critical angle of attack of 46° with a speed dropping from 350 km/h to zero, causing all three engines to stop. The crew was able to send a brief message then the aircraft entered an uncontrolled descent in a flat spin. At an altitude of 3,300 metres, the crew informed ATC that control was totally lost. The aircraft crashed in a prairie located near Novgorodskoye, about 45 km northwest of Donetsk. It was totally destroyed by impact forces and a post crash fire, and all 170 occupants were killed.", "probable_cause": "The cause of the accident was a loss of control in manual flight mode after the aircraft reached a super critical angle of attack, causing a stall with the subsequent transition to a flat spin and collision with the ground with a large vertical velocity. The following contributing factors were identified:\r\n- Poor crew coordination, \r\n- Failure of the crew to follow the flight manual instructions to identify and prevent a stall condition, \r\n- The crew training methods used were insufficient to demonstrate the dangers of manual flight at high altitudes."}