{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-c-mt-rae-2-killed", "date": "Aug 1, 2018 at 1336 LT", "type": "Piper PA-31-310 Navajo", "operator": "Aries%20Aviation%20International", "flight_phase": "Flight", "flight_type": "Geographical / Geophysical / Scientific", "survivors": "No", "site": "Mountains", "schedule": "Penticton - Calgary", "msn": "31-8112007", "yom": 1981, "flight_number": null, "city": "Mt Rae", "zone": "Alberta", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4400, "captain_hours_type": 2800, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7277, "circumstances": "On 01 August 2018, after completing 2 hours of survey work near Penticton, British Columbia (BC), an Aries Aviation International Piper PA-31 aircraft (registration C-FNCI, serial number 31-8112007) proceeded on an instrument flight rules flight plan from Penticton Airport (CYYF), BC, to Calgary/Springbank Airport (CYBW), Alberta, at 15 000 feet above sea level. The pilot and a survey technician were on board. When the aircraft was approximately 40 nautical miles southwest of CYBW, air traffic control began sequencing the aircraft for arrival into the Calgary airspace and requested that the pilot slow the aircraft to 150 knots indicated airspeed and descend to 13 000 feet above sea level. At this time, the right engine began operating at a lower power setting than the left engine. About 90 seconds later, at approximately 13 500 feet above sea level, the aircraft departed controlled flight. It collided with terrain near the summit of Mount Rae at 1336 Mountain Daylight Time. A brief impact explosion and fire occurred during the collision with terrain. The pilot and survey technician both received fatal injuries. The Canadian Mission Control Centre received a 406 MHz emergency locator transmitter signal from the occurrence aircraft and notified the Trenton Joint Rescue Coordination Centre. Search and rescue arrived on site approximately 1 hour after the accident.", "probable_cause": "Findings as to causes and contributing factors:\r\n1. The pilot did not continuously use oxygen above 13 000 feet and likely became hypoxic as the aircraft climbed to 15 000 feet. The pilot did not recognize his symptoms or take action to restore his supply of oxygen.\r\n2. As a result of hypoxia-related cognitive and perceptual degradations, the pilot was unable to maintain effective control of the aircraft or to respond appropriately to the asymmetric power condition.\r\n3. The aircraft departed controlled flight and entered a spin to the right because the airspeed was below both the published minimum control speed in the air and the stall speed, and because there was a significant power asymmetry, a high angle of attack, and significant asymmetric drag from the windmilling propeller of the right engine.\r\n4. When the aircraft exited cloud, the pilot completed only 1 of the 7 spin-recovery steps: reducing the power to idle. As the aircraft continued to descend, the pilot took no further recovery action, except to respond to air traffic control and inform the controller that there was an emergency.\n\r\nFindings as to risk:\r\n1. If flight crews do not undergo practical hypoxia training, there is a risk that they will not recognize the onset of hypoxia when flying above 13 000 feet without continuous use of supplemental oxygen.\n\r\nOther findings:\r\n1. The weather information collected during the investigation identified that the loss of control was not due to in-flight icing, thunderstorms, or turbulence.\r\n2. Because the Appareo camera had been bumped and its position changed, the pilot’s actions on the power controls could not be determined. Therefore, the investigation was unable to determine whether the power asymmetry was the result of power-quadrant manipulation by the pilot or of an aircraft system malfunction.\r\n3. The flight path data, audio files, and image files retrieved from the Appareo system enabled the investigators to better understand the underlying factors that contributed to the accident."}