{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-4-medicine-bow-peak-66-killed", "date": "Oct 6, 1955 at 0726 LT", "type": "Douglas DC-4", "operator": "United-Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "New York – Chicago – Denver – Salt Lake City – San Francisco", "msn": "18389", "yom": 1944, "flight_number": "UA409", "city": "Medicine Bow Peak", "zone": "Wyoming", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 63, "pax_fatalities": 63, "other_fatalities": 0, "total_fatalities": 66, "captain_hours": 9807, "captain_hours_type": 2289, "copilot_hours": 2418, "copilot_hours_type": 343, "aircraft_hours": 28755, "circumstances": "Flight 409 originated at New York, New York, on October 5, 1955, destination San Francisco, California, with intermediate stops including Chicago, Illinois, Denver, Colorado, and Salt Lake City, Utah. The trip to Denver was routine except for traffic delays, caused principally by weather, and the flight arrived there at 0551, October 6, one hour and 11 minutes late. Routine crew changes were made at Chicago and Denver, the last crew consisting of 'Captain Clinton C. Cooks, Jr., First Officer Ralph D. Salisbury, Jr., and Stewardess Patricia D. Shuttleworth. No discrepancies were reported by the former crew and none were found at Denver. While at Denver the aircraft was refueled to a total of 1,000 gallons of gasoline. Prior to departure Captain Cooke was briefed by the company's dispatcher on the en route weather, based on both U. S. Weather Bureau sequence reports and forecasts and the company meteorologist's forecasts and analysis. Following this briefing the flight me dispatched to Salt Lake City via airways V-4, V-118, V-6, and V-32, to cruise at 10,000 feet, and to fly in accordance with Visual Right Rules (VFR). The estimated time en route was two hours and 33 minutes. The only obligatory reporting point along the route was Rock Springs, Wyoming. The flight departed Denver at 0633, with 63 passengers, including two infants. At takeoff, the gross weight of the aircraft was 64,147 pounds, 653 pounds under the allowable weight of 64,800 pounds; an error of 100 pounds in excess of the allowable rear baggage compartment weight 2 was made in loading. Flight 409 reported its time off to the company and this was the last known radio contact with the flight. When the flight failed to report at Rock Springs at 0811, its estimated reporting time, repeated efforts were wade to establish radio contact with it. These were unsuccessful and the company then declared an emergency. A widespread search was immediately coordinated by Air Search and Rescue, which included the Wyoming Air National Guard, the Civil Air Patrol, and United Air Lines. At approximately 1140 the same day the wreckage was sighted near Medicine Bow Peak, 33 miles west of Laramie, Wyoming. The Laramie weather at 0728 was; Scattered clouds, 5,500 feet; visibility 40 miles; wind west-northwest 13 knots; snow showers of unknown intensity over the mountains. The aircraft struck the almost vertical rock cliff of the east slope of Medicine Bow Peak (elevation 12,005 feet) located in the Medicine Bow Mountains. The crash occurred at an elevation of 11,570 feet, 60 feet below the top of that portion of the mountain directly above it. Two large smudge marks were apparent on the face of the mountain. In these marks were four scars, evenly spaced and in a horizontal line, the result of the engines and propellers of the aircraft striking the cliff. At impact the aircraft disintegrated and the wreckage me strewn over a wide area. Some parts were thrown to the mountain top above the crash site, others rested on ledges at various levels, and the remainder fell to the elope below. All 66 occupants have been killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the action of the pilot in deviating from the planned route for reasons unknown. The following findings were reported: \r\n- The weather along the prescribed route was good and the aircraft could have been flown safely at an altitude of 10,000 feet,\r\n- The pilot deviated from the planned route,\r\n- The aircraft was observed flying in and out of clouds at an approximate altitude of 10,000 feet, 10 miles southeast of the accident scene and 21 miles west of the prescribed course,\r\n- The aircraft struck the mountain peak at an altitude of 11,570 feet,\r\n- Examination of the recovered sections of the aircraft failed to indicate any fire, structural failure, or malfunctioning of the aircraft or its components prior to impact."}