{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-lake-coeur-dalene-6-killed", "date": "Jul 5, 2020 at 1422 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Brooks%20Seaplane%20Service", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Coeur d'Alene - Coeur d'Alene", "msn": "1131", "yom": 1957, "flight_number": null, "city": "Lake Coeur d'Alene", "zone": "Idaho", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 21173, "captain_hours_type": 217, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6171, "circumstances": "The float-equipped De Havilland DHC-2 was on a tour flight, and the Cessna 206 was on a personal flight. The airplanes collided in midair over a lake during day visual meteorological conditions. No radar or automatic dependent surveillance-broadcast data were available for either airplane. Witnesses reported that the airplanes were flying directly toward each other before they collided about 700 to 800 ft above the water. Other witnesses reported that the Cessna was at a lower altitude and had initiated a climb before the collision. Review of 2 seconds of video captured as part of a witness’ “live” photo showed that both airplanes appeared to be in level flight before the collision. No evidence of any preexisting mechanical malfunction was observed with either airplane. Recovered wreckage and impact signatures were consistent with the upper fuselage of the Cessna colliding with the floats and the lower fuselage of the De Havilland. The impact angle could not be determined due to the lack of available evidence, including unrecovered wreckage. The available evidence was consistent with both pilots’ failure to see and avoid the other airplane.", "probable_cause": "The failure of the pilots of both airplanes to see and avoid the other airplane."}