{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-80-dl-tajumbina-peak-29-killed", "date": "Dec 24, 1966 at 0956 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Avianca-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Bogotá – Pasto", "msn": "19630", "yom": 1944, "flight_number": "AV729", "city": "Mt Tajumbina", "zone": "Putumayo", "country": "Colombia", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 26, "pax_fatalities": 26, "other_fatalities": 0, "total_fatalities": 29, "captain_hours": 6653, "captain_hours_type": 2069, "copilot_hours": 1701, "copilot_hours_type": 1097, "aircraft_hours": 28422, "circumstances": "Flight 739 was a scheduled domestic flight from Bogotá-El Dorado Airport to Pasta-Cano Airport. It was scheduled to depart Bogotá at 0615 hours local time; however, when the crew reported to the Avianca operations office at 0550 hours they were advised that Eldorado Airport was closed owing to thick fog. The airport was reopened to operations at 0750 hours. At about 0830 hours Flight 729 was observed to have commenced taxiing and entered the runway system without having received a clearance to do so. The flight was then given instructions for Runway 30 but further transmissions on 121.9 mc/s were not acknowledged. The flight was subsequently contacted on 118.1 mc/s and the pilot stated he had confused instructions with those given to another aircraft. Take-off was made on runway 10 and when over the threshold of Runway 12 the aircraft commenced a very steep turn to the left in a nose-high attitude. Recovery was effected and the aircraft departed at 0838 hours on a VFR flight plan. After the take-off and climb the flight left the Bogota tower frequency and subsequently contacted Bogota Control and Route Control on 5589 Kc/s. The following position reports were received: 12 500 ft over Guataqui at 0842 hrs, over El Paso at 0902 hrs, over Tuluá at 0924 hrs; at 8 500 ft over Cali, at 0942 hrs, and at 8 500 it over Santander at 0948 hrs estimating Dos Rios at 1014 hrs. No position report for Dos Rios was received. The Tuluá position report was transmitted to Cali as follows: \"Tuluá 0922 descending to 8 500, estimating Cali 0942\". As the message was very weak the flight was requested to confirm its departure and position; it reported on route frequency 5476.5 KC/S its departure as 0825/38. The flight was then requested to change to VHF frequency 119.1 for radio contact when approaching Cali. It did so but as its signals were not heard it returned to the route frequency stating that it would remain on that frequency since it had not been able to establish contact on the VHF frequency. At 1030 hrs Cali requested information on the flight from Pasto, which reported that the flight had not arrived and there was no information about it. From 1030 hrs onwards the aircraft was called on all available frequencies but no reply was received. An alert phase was declared at 1100 hrs and followed by a distress phase at 1125 hrs. The wreckage of the aircraft was found on 3 January 1967 after 11 days of searching. It had crashed and caught fire at an elevation of approximately 11 600 ft on the southern slopes of Tajumbina Peak (elevation 13 572 ft) in the El Descanse Police Inspectorate. Coordinates of the site of accident were 1° 20' 30\" N 76° 47' 30\" W. The accident occurred at approximately 0956 hrs on 24 December 1966. The aircraft was destroyed by impact forces and a post crash fire and all 29 occupants have been killed. ", "probable_cause": "The accident was attributed to pilot error consisting of inflight indiscipline and rash imprudence on the part of the pilot-in-command of the aircraft for: \r\n- Not having made use of the regulation rest period and having consumed alcoholic drinks a few hours before flying,\r\n- Not having followed the route recommended in the Manual of Colombian Air Routes, which he reported he was taking; having reported positions that did not correspond to reality,\r\n- Continuing a visual flight in unfavourable IFR conditions thereby failing to comply with the standards laid down in Part V of the Manual of Aeronautical Rules,\r\n- Having flown at an altitude below the minimum safety altitude laid down for visual flying in Part V of the Manual of Aeronautical Rules (he flew along the Canon del Rfo Cascabel and subsequently crashed at an altitude of about 11 600 ft), \r\nA possible contributory cause of this accident was inadequate supervision by the Airline consisting of a lack of control over the flight crews. "}