{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46r-350t-matrix-vannes", "date": "Oct 5, 2020 at 1415 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Indigo Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Vannes - La Môle", "msn": "46-92057", "yom": 2008, "flight_number": null, "city": "Vannes", "zone": "Morbihan", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 845, "captain_hours_type": 565, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the morning of the day of the accident, the pilot, accompanied by a passenger, flew under IFR flight mode from La Môle (83) to Quiberon (56). The flight took 3 hours and 40 minutes and the return was scheduled in the afternoon. After landing in Quiberon, the pilot learned that there was no possibility to refuel with AVGAS, information that was not specified by NOTAM. The pilot then decided to refuel at Vannes-Meucon Airport before leaving to St Tropez-La Môle. He said he was upset by this situation and by the bad weather conditions in the area. During the pre-flight visit to Quiberon, the pilot added oil. He indicates that he also carried out a pre-flight inspection before takeoff from Vannes. During the takeoff roll from runway 22 at Vannes-Meucon Airport, the rotation took place in the first third of the runway. Just after liftoff, he saw the engine cowling open. He immediately thaught he forgot to tighten the dipstick and decided to abort the takeoff and landed on the remaining runway. The runway being long, he believed he can stop before the runway end. He put the power levers in the \"full, reduced and choke\" position and tried to land the plane quickly. As the aircraft already reached a high speed, it landed 200 metres short of runway end and deviated longitudinally and crossed the runway end safety area, known as RESA. It came to a stop a 100 metres further on an embankment. The left wing was partially torn off and the aircraft was damaged beyond repair. There was no fire. Both occupants escaped uninjured. ", "probable_cause": null}