{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-raf-brize-norton", "date": "Jun 11, 1986 at 1145 LT", "type": "Piper PA-31-310 Navajo", "operator": "Airways%20International%20Cymru", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Oxford – Cardiff", "msn": "31-405", "yom": 1968, "flight_number": null, "city": "Brize Norton AFB", "zone": "Oxfordshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7000, "captain_hours_type": 150, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Kidlington at 1133 hrs, the takeoff and initial climb to 1,500 feet being uneventful. Radio contact was made with Brize Norton Controller who requested the aircraft to climb to 2,000 feet on the Brize Norton QFE of 1005 millibars. This was complied with, and at 1140 hrs the aircraft experienced surging of one, then both engines culminating in a complete loss of power at a position 5 nautical miles north north west of Brize Norton. The commander advised the controlled that an engine problem had developed and that he was turning southwards towards the airfield. He subsequently declared a Mayday after opening the crossfeed and switching on the two electric fuel pumps to no avail. The commander stated that up until that time he had been on straight feed, ie right inboard tank feeding the right engine and left inboard tank feeding the left engine, with the crossfeed OFF. The commander also stated that during the unsuccessful attempts to restart the engines, the tank selectors remained as selected as he was aware of the physical presence of fuel in both inboard tanks prior to the departure from Cardiff, and uncertain of the contents of the outboards. The company pilot seated behind the front seats recalled the right fuel gauge was still reading over FULL, and that the left gauge was indicating empty. The commander decided that a forced landing short of the airfield was inevitable, and lowered the gear. The passengers were also warned to tighten their seat belts. At approximately 250 feet above ground level, the mixture levers were pulled back to idle cut off, and the magneto switches thought to have been selected to OFF. The aircraft landed in a field of standing barley and the nose gear detaches causing the nose and the right wing to strike the ground, the aircraft rotate approximately 180° to the right, and the main gear to collapse. On impact, the right engine caught fire immediately followed by the cabin, with fire spreading rearwards along the aisle. The two front seat occupants left by the left main door, the rear passenger by the right overwing exit. Minor injuries were suffered, the commander being detained in hospital for 24 hours with burns. The aircraft was destroyed by a severe fire.", "probable_cause": "Double engine failure caused by a fuel exhaustion. "}