{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-30-niger-170-killed", "date": "Sep 19, 1989 at 1359 LT", "type": "Douglas DC-10", "operator": "UTA", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Desert", "schedule": "Brazzaville – N’Djamena – Paris", "msn": "46852", "yom": 1973, "flight_number": "UT772", "city": "Niger", "zone": "All Niger", "country": "Niger", "region": "Africa", "crew_on_board": 14, "crew_fatalities": 14, "pax_on_board": 156, "pax_fatalities": 156, "other_fatalities": 0, "total_fatalities": 170, "captain_hours": 11039, "captain_hours_type": 2723, "copilot_hours": 8357, "copilot_hours_type": 754, "aircraft_hours": 60267, "circumstances": "The DC-10 departed N'Djamena Airport at 1313LT bound for Paris-Roissy-Charles de Gaulle Airport. Forty-six minutes later, while cruising at an altitude of 35,000 feet over Niger, the aircraft disappeared from radar screens and the crew did not send any distress call. It was quickly understood that the aircraft exploded in mid-air and crashed somewhere in the desert. SAR operations were initiated and the wreckage was found a day later in the Ténéré Desert, about 650 km north of N'Djamena, northeast from the Termit Mountain Range. Debris scattered on 100 km2 and none of the 170 occupants survived the crash. ", "probable_cause": "It was determined that the accident was the aircraft was destroyed by an explosion. The following findings were reported: \r\n- The destruction was due to an explosive charge placed in a container located in position 13R in the forward cargo hold.\r\n- The bomb was formed of pentrite, namely an explosive composed with a powerful and very sensitive crystalline nitric ester.\r\n- The Investigation Commission assert that the most plausible hypothesis is that the explosive charge was inside baggage loaded at Brazzaville Airport.\r\n- Observations made shortly after the accident on Brazzaville Airport made it clear that, at that time, the airport security measures in force were not in accordance with the ICAO standards and recommended practices (Annex 17 to the Convention on International Civil Aviation and Civil Aviation Security Manual (DOC 8973))."}