{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900d-gander", "date": "Apr 20, 2016 at 2130 LT", "type": "Beechcraft 1900D", "operator": "Air-Canada-Express", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Goose Bay – Gander", "msn": "UE-126", "yom": 1994, "flight_number": null, "city": "Gander", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 14, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2381, "captain_hours_type": 1031, "copilot_hours": 1504, "copilot_hours_type": 174, "aircraft_hours": 32959, "circumstances": "The Exploits Valley Air Services Beechcraft 1900D (registration C-FEVA, serial number UE-126), operating as Air Canada Express flight EV7804, was on a scheduled passenger flight from Goose Bay International Airport, Newfoundland and Labrador, to Gander International Airport, Newfoundland and Labrador. At 2130 Newfoundland Daylight Time, while landing on Runway 03, the aircraft touched down right of the centreline and almost immediately veered to the right. The nosewheel struck a compacted snow windrow on the runway, causing the nose landing gear to collapse. As the aircraft’s nose began to drop, the propeller blades struck the snow and runway surface. All of the left-side propeller blades and 3 of the right-side propeller blades separated at the blade root. A portion of a blade from the right-side propeller penetrated the cabin wall. The aircraft slid to a stop on the runway. All occupants on board — 14 passengers and 2 crew members — were evacuated. Three passengers sustained minor injuries. The aircraft was substantially damaged. There was no post-impact fire. There were insufficient forward impact forces to automatically activate the 121.5 MHz emergency locator transmitter. The accident occurred during the hours of darkness.", "probable_cause": "Findings as to causes and contributing factors:\r\n1. Neither pilot had considered that the combination of landing at night, in reduced visibility, with a crosswind and blowing snow, on a runway with no centreline lighting, was a hazard that may create additional risks.\r\n2. The blowing snow made it difficult to identify the runway centreline markings, thereby reducing visual cues available to the captain. This situation was exacerbated by the absence of centreline lighting and a possible visual illusion caused by blowing snow.\r\n3. Due to the gusty crosswind conditions, the aircraft drifted to the right during the landing flare, which was not recognized by the crew.\r\n4. It is likely that the captain had difficulty determining aircraft position during the landing flare.\r\n5. The flight crew’s decision to continue with the landing was consistent with plan continuation bias.\r\n6. During landing, the nosewheel struck the compacted snow windrow on the runway, causing the nose landing gear to collapse.\n\r\nFindings as to risk:\r\n1. If aircraft are not equipped with a 406 MHz-capable emergency locator transmitter, flight crews and passengers are at increased risk of injury or death following an accident because search-and-rescue assistance may be delayed.\r\n2. If operators do not have defined crosswind limits, there is a risk that pilots may land in crosswinds that exceed their abilities, which could jeopardize the safety of flight.\r\n3. If composite propeller blades contact objects and separate, and then strike or penetrate the cabin, there is a risk of injury or death to occupants seated in the propeller’s plane of rotation.\r\n4. If modern crew resource management training is not a regulatory requirement, then it is less likely to be introduced by operators and, as a result, pilots may not be fully prepared to recognize and mitigate hazards encountered during flight.\r\n5. If organizations do not use modern safety management practices and do not have a robust safety culture, then there is an increased risk that hazards will not be identified and mitigated.\r\n6. When testing an emergency locator transmitter’s (ELT) automatic activation system, a sticking g-switch may go undetected if more than 1 football throw is necessary to activate the ELT. As a result, the ELT might not activate during an accident, and search-and-rescue assistance may be delayed, placing flight crews and passenger at an increased risk for injury or death."}