{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-e9-arusha", "date": "Jul 26, 1999 at 1610 LT", "type": "Let L-410", "operator": "Precisionair2", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Arusha - Arusha", "msn": "96 27 15", "yom": 1996, "flight_number": null, "city": "Arusha", "zone": "Arusha Region", "country": "Tanzania", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12000, "captain_hours_type": 700, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off from Arusha Airport (ARK) at 12:35 hours for a circuit training. It was carrying one instructor, a pilot trainee and three passengers. The aircraft was flying VFR. The instructor said that he intended to execute nine touch and go circuit operations, three of which were to be performed with 42° flaps, another three with 18° flaps and the rest with zero degree flaps. The first six circuits were performed uneventfully. Before initiating the first flapless landing the instructor ordered the trainee to extend his approach and establish a six-mile final to runway 09. When the aircraft was established on the final for runway 09 the instructor saw that the aircraft was a bit too low and ordered the trainee to adjust his approach. After 5H-PAB was established on the approach slope the instructor advised the trainee to call when he needed props fully forward (setting propellers into full coarse pitch). This he subsequently did and the instructor, aware of the relatively high aircraft speed for the configuration advised the trainee to be careful on the flare in order to avoid the possibility of the tail skid hitting the ground. When the aircraft was flared, the tail skid hit and scraped the ground followed by the belly and the nose underside section. After sliding for 164 metres the aircraft came to rest on the runway with the engines still running. The instructor carried out the emergency shut down checks and evacuated the aircraft. It was only after touchdown that the crew realised that they had belly landed. The commander then proceeded to select reverse thrust. There was no fire and none of the occupants was injured. The instructor said that he had forgotten to lower the landing gear because of his preoccupation with the rate of descent and the execution of the flapless flare. The pilot under instruction testified that he had concentrated too much an the technical side of flying to the point of forgetting to call for the gear down selection. There was only one checklist in use in the cockpit which was contained in a book and this was being used by the instructor. The instructor testified to have used the checklist for the first six landings. The checklist was not used for the accident landing. None pilot of the pilots reported to have heard the landing gear horn.", "probable_cause": "Failure of the crew to follow the approach checklist and to lower the landing gear. "}