{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-2-172-chicago", "date": "May 31, 1936 at 2104 LT", "type": "Douglas DC-2", "operator": "TWA-1", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Newark – Chicago", "msn": "1409", "yom": 1935, "flight_number": "TW009", "city": "Chicago-Midway", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 12, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Difficulty was first encountered in the vicinity of Goshen, Indiana, approximately 100 miles from Chicago, when the oil pressure on the left engine raised to 90 lbs. and then gradually dropped to below 50 lbs. As the altitude at this time was about 3000 feet, the pilot climbed to 4000 feet on both engines and throttled the left engine back. He continued to climb on up to 4700 feet using the right engine alone. He advised Columbus of his trouble and was given the option of landing at South Bend, Indiana. He elected to proceed on to Chicago, his reasons for this being that direct radio communication with the South Bend airport was impossible and the lighting there was not as good as at Chicago. The flight continued until within the vicinity of Chicago Municipal Airport, with the right propeller in high pitch, the left engine stopped and the left gasoline valve shut off to save fuel. At this time, Pilot Smith requested and obtained clearance from the control tower to come into the field. He was granted the right of way over other aircraft. The surface wind over the airport was eight miles per hour. However, due to a recent thunderstorm, it was gusty and at an altitude of 2000 feet, increased to a velocity of 34 miles per hour. In approaching the airport at an elevation of about 2000 feet, using the right engine only, the wing flaps and undercarriage were lowered and the air-speed was reduced to about 80 miles per hour in preparation for landing. The winds above the airport were much stronger than the pilot had anticipated and it soon became apparent that the airplane was losing altitude too fast to reach the airport. The pilot attempted to correct this situation by use of the one engine. The effect was to turn the airplane to the left and, due to the reduced air-speed, full control movement proved ineffective against it. Before the speed of the airplane could be increased by Getting the flaps and undercarriage raised and the left engine started, it became evident that it would be impossible to reach the airport and the pilot attempted to head due south and land in an open area. The right wing struck a tree, causing the airplane to collide with a house and then strike the ground. While the aircraft was destroyed, all occupants were injured. ", "probable_cause": "It is the opinion of the Bureau of Air Commerce that the probable cause of this accident was poor judgment on the part of the pilot for not having started the left engine prior to his approach for a landing so that it could have been used in case of emergency and also for reducing the air-speed of the airplane below a safe minimum for single engine performance. Contributory causes were the indicated drop in oil pressure, cause undetermined, and the unexpected strong winds of unknown velocity to the pilot, which he encountered while landing."}