{"url": "https://www.baaa-acro.com/crash/crash-lockheed-pv-1-ventura-near-smithtown-3-killed", "date": "Jan 26, 1956 at 1633 LT", "type": "Lockheed PV-1 Ventura", "operator": "Swiftlite Aircraft Corporation", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Ronkonkoma - Ronkonkoma", "msn": "5243", "yom": 1943, "flight_number": null, "city": "Smithtown", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 800, "captain_hours_type": 600, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2216, "circumstances": "N2000C took off at 1625 on January 26, 1956, from MacArthur Field, Ronkonkoma, Long Island, New York, its home base, on a local flight with three pilots. They were Bernard J. Malloy, check pilot, and Pilots Raymond Hamberg and Hugo D. Filangeri. The purpose of the flight was to qualify Pilot Hamberg on the Lockheed PV-1 aircraft, a type he had never piloted. The takeoff of N 2000C was normal, toward the northwest, and made under VFR (Visual Flight Rules) conditions with Pilot Hamberg occupying the left or captain's to scat and Pilot Malloy, as check pilot, seated on the right as copilot; Pilot Filangeri acted as observer. Subsequently the PV-1 was seen over the Smithtown area, flying westerly at an estimated altitude of 2,500-3,000 feet, where a witness reported that the engines sounded normal but that the aircraft appeared to be flying at a slow airspeed. Witnesses stated that shortly thereafter the engine power sounded as though it was cut momentarily and then came back on. At an altitude of approximately 2,000 feet the aircraft was seen to dip down and pull up, slightly nose-high, and then fall off to the left, making two to three turns of a descending spiral, and disappear behind the tree-topped horizon. Flames erupted frost the woods over the point where the aircraft was last seen, followed quickly by a large column of black smoke. All three pilots were killed. ", "probable_cause": "The Board determines that the probable cause of this accident loss of control resulting in a stall at an altitude too low to effect recovery. The following findings were reported: \r\n- Weather was not a major factor,\r\n- The altitude probably did not exceed 3,500 feet above the ground during the eight minutes the aircraft wan in the air,\r\n- There wan no fire prior to impact,\r\n- There was no evidence of failure of the airframe or malfunction of controls as far as could be drained,\r\n- There was no evidence of power failure of either engine,\r\n- The purpose of the flight was pilot familiarization and included slow flight,\r\n- The aircraft was observed to stall at low airspeed approximately 2,000-2,500 feet above the ground."}