{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-64-tenerife-146-killed", "date": "Apr 25, 1980 at 1321 LT", "type": "Boeing 727-100", "operator": "Dan-Air%20London", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Manchester - Tenerife", "msn": "19279", "yom": 1966, "flight_number": "DA1008", "city": "Tenerife-Norte-Los Rodeos", "zone": "Canary Islands", "country": "Spain", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 138, "pax_fatalities": 138, "other_fatalities": 0, "total_fatalities": 146, "captain_hours": 15299, "captain_hours_type": 1912, "copilot_hours": 3492, "copilot_hours_type": 618, "aircraft_hours": 30622, "circumstances": "Dan-Air flight 1008 took off from Manchester Airport (MAN) at 09:22 UTC en route for Tenerife-Norte Los Rodeos Airport (TFN). After an uneventful flight, the crew contacted Tenerife North Airport Approach Control at 13:14, informing them that they were at FL110 and at 14 nautical miles from the TFN VOR/DME. Approach Control replied, \"Dan Air one zero zero eight, cleared to the Foxtrot Papa beacon via Tango Foxtrot November, flight level one one zero expect runway one two, no delay.\" The Dan Air crew repeated the clearance and requested meteorological information, which was given as: \"OK runway in use one two, the wind one two zero zero five, visibility six from seven kilometres clouds, two oktas at one two zero metres, plus four oktas at two five zero metres, plus two oktas at three five zero metres, November Hotel one zero three, temperature one six, dew point one, and drizzle.\" Approximately one minute later Approach Control told the aircraft to descend and maintain FL60. Receipt of this message was acknowledged by the aircraft, whereupon the controller immediately requested it to indicate its distance from the TFN beacon. The crew replied that it was at 7 NM from TFN. At 13:18:48 UTC the aircraft notified Approach Control that it had just passed TFN and that it was heading for the 'FP' beacon. The controller then informed them of an unpublished hold over Foxtrot Papa: \"Roger, the standard holding over Foxtrot Papa is inbound heading one five zero, turn to the left, call you back shortly.\" Dan Air 1008 only replied \"Roger\" without repeating the information received, which was not compulsory under the ICAO regulations in force at the time of the accident. Almost one minute later, the aircraft the crew reported: \"Dan Air one zero eight, Foxtrot Papa level at six zero, taking up the hold\" and Tenerife APP replied: \"Roger\". Instead of passing overhead FP, the flight had passed this navaid at 1.59 NM to the South. Instead of entering the 255 radial, the Boeing 727 continued its trajectory in the direction of 263 degrees for a duration of more than 20 seconds, entering an area with a minimum safety altitude (MSA) of 14500 ft. The co-pilot at that point said: \"Bloody strange hold, isn't it?\" The captain remarked \"Yes, doesn't isn't parallel with the runway or anything.\" The flight engineer then also made some remarks about the holding procedure. Approach control then cleared them down to 5000 feet. The captain then remarked: \"Hey did he say it was one five zero inbound?\". It appears that at this moment the information received on the holding flashed back to the Captain's mind, making him realize that his manoeuvre was taking him to magnetic course 150 degrees outbound from 'FP', whereas the information received was \"inbound\" on the holding, heading 150 degrees towards 'FP'. The copilot responded: \"Inbound yeh\". \"I don't like that\", the captain said. The GPWS alarm sounded. The captain interrupted his left hand turn and entered a right hand turn and ordered an overshoot. They overflew a valley, temporarily deactivating the GPWS warning. The copilot suggested: \"I suggest a heading of one two two actually and er take us through the overshoot, ah.\" But the captain continued with the turn to the right, because he was convinced that the turn he had been making to the left was taking him to the mountains. The captain contacted Approach Control at 13:21: \"Er ... Dan Air one zero zero eight, we've had a ground proximity Warning.\" About two seconds later the aircraft flew into the side of a mountain at an altitude of approximately 5450 ft (1662 m) and at 11.5 km off course.", "probable_cause": "The captain, without taking into account the altitude at which he was flying, took the aircraft into an area of very high ground, and for this reason he did not maintain the correct safety distance above the ground, as was his obligation. Contributing factors were:\r\na) the performance of a manoeuvre without having clearly defined it;\r\nb) imprecise navigation on the part of the captain, showing his loss of bearings;\r\nc) lack of teamwork between captain and co-pilot;\r\nd) the short space of time between the information given and the arrival at 'FP';\r\ne) the fact that the holding was not published\" (Spanish report)\r\nUK authorities agreed in general with the report, but added some comments to give the report 'a proper balance':\r\n1. the information concerning the holding pattern at FP, which was transmitted by ATC, was ambiguous and contributed directly to the disorientation of the crew;\r\n2. no minimum safe altitude computed for holding pattern;\r\n3. track for holding pattern at 'FP' is unrealistic."}