{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-22-hendersonville-79-killed", "date": "Jul 19, 1967 at 1201 LT", "type": "Boeing 727-100", "operator": "Piedmont%20Airlines2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Atlanta – Asheville – Roanoke – Washington DC", "msn": "18295", "yom": 1963, "flight_number": "PI022", "city": "Hendersonville", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 74, "pax_fatalities": 74, "other_fatalities": 0, "total_fatalities": 79, "captain_hours": 18383, "captain_hours_type": 151, "copilot_hours": 3364, "copilot_hours_type": 135, "aircraft_hours": 6445, "circumstances": "The three engine aircraft departed Asheville Regional Airport at 1158LT and climbed to its assigned altitude. About three minutes later, while climbing to an altitude of 6,132 feet in a limited visibility due to clouds, the aircraft collided with a Cessna 310 registered N3121S. Operated by Lanseair, it was carrying two passengers and a pilot. Following the collision, both aircraft dove into the ground and crashed in a dense wooded area located about nine miles southeast of Asheville Airport. The wreckage of the 727 was found in a forest along a highway located in Hendersonville. All 82 occupants in both aircraft were killed. ", "probable_cause": "The deviation of the Cessna from its IFR clearance resulting in a flight path into airspace allocated to the Piedmont Boeing 727. The reason for such deviation cannot be specifically or positively identified. The minimum control procedures utilized by the FAA in handling of the Cessna were a contributing factor. In June 2006, NTSB accepted to reopen the investigations following elements submitted by an independent expert who proved the following findings:\r\n- Investigators ignored that the Cessna 310 pilot informed ATC about his heading, \r\n- Investigators failed to report that a small fire occurred in the 727's cockpit 35 seconds prior to impact, \r\n- The inspector in charge of investigations was the brother of the Piedmont Airlines VP."}