{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-15-dc-skymaster-near-bronson-creek-1-killed", "date": "Aug 14, 1996 at 1200 LT", "type": "Douglas C-54 Skymaster", "operator": "Air-North", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Bronson Creek - Whitehorse - Wrangell", "msn": "10389", "yom": 1944, "flight_number": null, "city": "Bronson Creek", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 12500, "captain_hours_type": 1500, "copilot_hours": 2900, "copilot_hours_type": 420, "aircraft_hours": 50754, "circumstances": "The DC-4 aircraft (serial number 10389) was on a visual flight rules flight from Bronson Creek, British Columbia, to Wrangell, Alaska, with a crew of three and about 16,600 pounds of cargo on board. The departure from the remote mining strip was uneventful until the aircraft approached 1,500 feet above sea level, when the crew heard a whining noise in their headsets. Believing that the whining was caused by an inverter problem, they switched inverters, but the problem persisted. Electrical instrument indications in the cockpit then became erratic, and the number 2 engine, on the left wing, began to misfire; its fire warning light in the cockpit illuminated briefly, but without the accompanying bell. The captain confirmed visually that the number 2 engine was on fire and the crew carried out the engine fire drill; however, the fire did not extinguish. The captain commenced a right-hand turn to return to the Bronson Creek airstrip, and announced to the crew that the number 2 engine had separated from the wing. The captain applied maximum power to the three remaining engines; however, the aircraft began to lose altitude. Both pilots held the rudder and aileron controls at full right deflection in an attempt to prevent the aircraft from yawing or rolling to the left. The aircraft was shaking violently at that time, and the crew members were unable to read any of the engine or flight instruments. At about 50 feet above ground level, just short of the Iskut River, the pilots closed the  throttles. The aircraft descended rapidly, and the burning left wing struck a tree just as the fuselage contacted the surface of the river. The three occupants escaped the burning aircraft, and the first officer and load master swam to safety. The captain is missing and is presumed to have drowned. The aircraft was destroyed.", "probable_cause": "The n°2 engine separated from the aircraft as a result of an intense fire in the wing. The loss of the engine rendered the aircraft uncontrollable, and the pilots were forced to land in the river"}