{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-newnan-2-killed", "date": "Sep 21, 1999 at 0522 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Baltimore Air Transport", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Charlotte - Newnan", "msn": "31-7752163", "yom": 1977, "flight_number": null, "city": "Newnan-Coweta County", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2000, "captain_hours_type": 250, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8340, "circumstances": "The flight was cleared for a localizer approach to runway 32 at Newnan-Coweta County Airport during dark night conditions. About 8 minutes later the pilot reported to air traffic control that he had missed approach and would like to try another approach. The flight was radar vectored to the final approach course and again cleared for the localizer runway 32 approach. The flight was observed on radar to continue the approach until a point about 4 nautical miles from the airport, at which time radar contact was lost. The last observed altitude was 1,600 feet msl. The aircraft collided with 80-foot tall trees, while established on the localizer for runway 32, about 1.3 nautical miles from the runway. About the time of the accident the weather at the airport was reported as a cloud ceiling 200 feet agl, and visibility .75 statute miles. Post crash examination of the aircraft structure, flight controls, engines, propellers, and systems showed no evidence of pre-crash failure or malfunction. ", "probable_cause": "The pilot's failure to maintain the minimum descent altitude while executing a localizer approach. Contributing factors were low ceilings and dark night conditions as well as the trees. "}