{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-augusta-4-killed", "date": "Aug 7, 1993 at 1515 LT", "type": "Beechcraft 90 King Air", "operator": "Critical%20Care%20Medflight", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Adel - Augusta", "msn": "LJ-718", "yom": 1977, "flight_number": null, "city": "Augusta-Bush Field", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1875, "captain_hours_type": 300, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3301, "circumstances": "The instrument flight was cleared for an ILS approach to the destination airport. While maneuvering for the final approach course, the flight encountered convective activity (thunderstorms). The pilot was questioned by the tower concerning his position on the approach course. The tower radar placed the flight's position 1/4 to 1/2 mile east of the final approach course. The pilot stated that he was on the localizer. Subsequent functional checks of the ils system by air ways facilities, failed to reveal a problem with the ils approach system. The airplane collided with trees about one and one half miles northeast of the airport and one half mile east of the approach course. Weather reports recorded level four thunderstorm activity within the immediate vicinity of the destination airport. Wreckage examination failed to disclose any mechanical problems with the airplane. The air traffic controllers provided the pilot with current weather conditions at the airport throughout the final minutes of the flight, therefore the pilot was aware of the thunderstorm activity near and at the airport. All four occupants were killed. ", "probable_cause": "Was the pilot's failure to adequately evaluate inflight weather conditions which resulted in a loss of control when the airplane encountered a thunderstorm. "}