{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90gt-king-air-near-caieiras-1-killed", "date": "Dec 2, 2019 at 0602 LT", "type": "Beechcraft 90 King Air", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Mountains", "schedule": "Jundiaí – Campo de Marte", "msn": "LJ-1839", "yom": 2008, "flight_number": null, "city": "Caieiras", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6000, "captain_hours_type": 211, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot departed Jundiaí-Comandante Rolim Adolfo Amaro Airport at 0550LT on a short transfer flight to Campo de Marte, São Paulo. While descending to Campo de Marte Airport, he encountered poor weather conditions and was instructed by ATC to return to Jundiaí. Few minutes later, while flying in limited visibility, the twin engine airplane impacted trees and crashed in a wooded area located in Mt Cantareira, near Caieiras. The aircraft was destroyed by impact forces and a post crash fire and the pilot, sole on board, was killed. ", "probable_cause": "The accident was the consequence of the combination of the following factors:\r\n- Attention – undetermined.\r\nIt is likely that the pilot has experienced a lowering of his attention in relation to the available information and the stimuli of that operational context in face of the adverse conditions faced.\r\n- Attitude – a contributor.\r\nIt was concluded that there was no reaction to the warnings of proximity to the ground (Caution Terrain) and evasive action to avoid collision (Pull Up), a fact that revealed difficulties in thinking and acting in the face of an imminent collision condition, in which the aircraft was found.\r\n- Adverse meteorological conditions – a contributor.\r\nThe clouds height and visibility conditions did not allow the flight to be conducted, up to SBMT, under VFR rules.\r\n- Piloting judgment – a contributor.\r\nThe attempt to continue with the visual flight, without the minimum conditions for such, revealed an inadequate assessment, by the pilot, of parameters related to the operation of the aircraft, even though he was qualified to operate it.\r\n- Perception – a contributor\r\nThe ability to recognize and project hazards related to continuing flight under visual rules, in marginal ceiling conditions and forward visibility, was impaired, resulting in reduced pilot situational awareness, probable geographic disorientation, and the phenomenon known as \" tunnel vision''.\r\n- Decision-making process – a contributor.\r\nThe impairment of the pilot's perception in relation to the risks related to the continuation of the flight in marginal safety conditions negatively affected his ability to perceive, analyze, choose alternatives and act appropriately due to inadequate judgments and the apparent fixation on keeping the flight under visual rules, which also contributed to this occurrence."}