{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-mobile-1-killed", "date": "Apr 24, 2003 at 2012 LT", "type": "Socata TBM-700", "operator": "Quest%20Diagnostics", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Lawrenceville – Mobile", "msn": "231", "yom": 2002, "flight_number": "LBQ850", "city": "Mobile", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10000, "captain_hours_type": 408, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1222, "circumstances": "A review of communications between Mobile Downtown Control Tower, and the pilot revealed that while on approach the pilot reported having a problem. The Ground Controller reported that he had the airplane in sight and cleared the flight to land on runway 18. The pilot stated that he had a \"run away engine\", and elected to shut down the engine and continued the approach. The Controller then cleared the pilot again to runway 18. The pilot then stated that he did not think that he was going to \"make it.\" The airplane collided with a utility pole and the ground and burst into flames short of the runway. The post-accident examination of the engine found that the fuel control unit arm to the fuel control unit interconnect rod end connection was separated from the rod end swivel ball assembly. The swivel ball assembly was found improperly attached to the inboard side of the arm, with the bolt head facing inboard, instead of outboard, and the washer and nut attached to the arm's outboard side instead of the inboard side. The rod separation would resulted in a loss of power lever control. The published emergency procedures for \"Power Lever Control Lose,\" states; If minimum power obtained is excessive: 1) reduce airspeed by setting airplane in nose-up attitude at IAS < 178 KIAS. 2) \"inert Sep\" switch--On. 3) if ITT >800 C \"Inert Sep\"--Off. 4) Landing Gear Control--Down. 5) Flaps--Takeoff. 6) Establish a long final or an ILS approach respecting IAS < 178 KIAS. 7) When runway is assured: Condition Lever to --Cut Off. 8) Propeller Governor Lever to-- Feather. 9) Flaps --Landing as required (at IAS <122 KIAS). 10) Land Normally without reverse. 11) Braking as required. The pilot stated to Mobile Downtown Control Tower, Ground Control that he had a \"run away engine\" and that he \"had to shut down the engine\". As a result of the pilot not following the published emergency procedures, the airplane was unable to reach the runway during the emergency. ", "probable_cause": "The improper installation of the power control linkage on the engine fuel control unit by maintenance personnel which resulted in a loss of power lever control, and the pilot's failure to  follow emergency procedures and his intentional engine shutdown which resulted in a forced landing and subsequent inflight collision with a light pole."}