{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-27-near-hampton", "date": "Mar 7, 1997 at 1400 LT", "type": "Convair CV-240", "operator": "Dodita Air Cargo", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Griffin - Augusta", "msn": "340", "yom": 1953, "flight_number": null, "city": "Hampton-Henry County", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 18000, "captain_hours_type": 35, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16331, "circumstances": "About two minutes into the flight, the pilot noticed a high cylinder head temperature on the right engine. The pilot opened the cowl flap doors and the cylinder head temperature dropped 200 degrees. When the pilot noticed a reduction in right engine power, he elected to shut down the engine. The copilot was instructed to secure the right engine in accordance with the emergency procedures. Unable to maintain altitude, the pilot selected an emergency landing to a large open field, and the landing gear collapsed during the landing. Examination of the airplane at the accident site disclosed that the engine cowl flaps on both engines were in the open position. Examinations of the right engine subsystems failed to disclose a mechanical malfunction or component failure. A review of the normal and emergency procedures for the aircraft disclosed that the cowl flaps normal position for the shutdown engine is closed. A review of the aircraft performance data revealed that the airplane was capable of maintaining flight and a climb attitude with one engine. There was no cargo on the airplane. During the pilot's subsequent type rating reexamination in the Convair 240-27, the pilot failed to demonstrate a satisfactory level of knowledge in emergency procedures during the oral examination. The pilot subsequently surrendered the Convair 240-27 type rating to the FAA. ", "probable_cause": "A partial loss of power on one engine for undetermined reason(s), and the pilot's failure to follow aircraft emergency procedures. A factor was inadequate transition/upgrade training. "}