{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-near-oksibil-15-killed", "date": "Aug 2, 2009 at 1100 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Merpati-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Jayapura - Oksibil", "msn": "626", "yom": 1979, "flight_number": "MZ9760D", "city": "Oksibil", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": 8387, "captain_hours_type": 8387, "copilot_hours": 1207, "copilot_hours_type": 1207, "aircraft_hours": 27336, "circumstances": "On the morning of Sunday, 2 August 2009, a de Havilland DHC-6 Twin Otter aircraft, registered PK-NVC, operated by PT. Merpati Nusantara Airlines as flight number MZ-7960D, departed from Sentani Airport, Jayapura for Oksibil Airport. The flight was planned in accordance with the visual flight rules (VFR). There were 15 persons on board; two pilots, one engineer, 10 adult passengers and two infants. The estimated flight time was 50 minutes. The fuel on board was sufficient for 2 hours and 50 minutes flight time. About 15 minutes prior to the estimated time of arrival at Oksibil the crew of another aircraft informed the Twin Otter crew that the weather in the Oksibil area was partly cloudy. There were no further reports of radio transmissions from the Twin Otter, and it did not arrive at Oksibil. A search was initiated at the time the aircraft would have run out of fuel. On the morning of 4 August 2009, searchers located the wreckage of the Twin Otter at an elevation of about 9,300 feet about 6 Nm from Oksibil. The aircraft was destroyed by impact forces, and all of the occupants were fatally injured. \n", "probable_cause": "The pilots did not maintain visual flight procedures when flying below lowest safe altitude, and the aircraft was flown into cloud in the vicinity of gap north west of Oksibil. In conclusion, the accident was consistent with controlled flight into terrain. \n"}