{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-3q8-sharm-el-sheikh-148-killed", "date": "Jan 3, 2004 at 0445 LT", "type": "Boeing 737-300", "operator": "Flash%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Sharm el-Sheikh - Cairo - Paris", "msn": "26283", "yom": 1992, "flight_number": "FSH604", "city": "Sharm el-Sheikh", "zone": "South Sinai", "country": "Egypt", "region": "Africa", "crew_on_board": 13, "crew_fatalities": 13, "pax_on_board": 135, "pax_fatalities": 135, "other_fatalities": 0, "total_fatalities": 148, "captain_hours": 7443, "captain_hours_type": 474, "copilot_hours": 788, "copilot_hours_type": 242, "aircraft_hours": 25603, "circumstances": "Following a night takeoff from runway 22R at Sharm el Sheikh-Ophira Airport, the plane climbed and maneuvered for a procedural left turn to intercept the 306 radial from the Sharm el Sheikh VOR station. When the autopilot was engaged the captain made an exclamation and the autopilot was immediately switched off again. The captain then requested Heading Select to be engaged. The plane then began to bank to the right. The copilot then warned the captain a few times about the fact that the bank angle was increasing. At a bank angle of 40° to the right the captain stated \"OK come out\". The ailerons returned briefly to neutral before additional aileron movements commanded an increase in the right bank. The aircraft had reached a maximum altitude of 5,460 feet with a 50° bank when the copilot stated 'overbank'. Repeating himself as the bank angle kept increasing. The maximum bank angle recorded was 111° right. Pitch attitude at that time was 43° nose down and altitude was 3,470 feet. The observer on the flight deck, a trainee copilot, called 'retard power, retard power, retard power'. Both throttles were moved to idle and the airplane gently seemed to recover from the nose-down, right bank attitude. Speed however increased, causing an overspeed warning. At 04:45 the airplane struck the surface of the water in a 24° right bank, 24° nose-down, at a speed of 416 kts and with a 3,9 G load. The aircraft disintegrated on impact and debris sank by a depth of 900 metres. All 148 occupants were killed, among them 133 French citizens, one Moroccan, one Japanese and 13 Egyptian (all crew members, among them six who should disembark at Cairo). Weather at the time of accident was good with excellent visibility, outside temperature of 17° C and light wind. On January 17, the FDR was found at a depth of 1,020 metres and the CVR was found a day later at a depth of 1,050 metres. ", "probable_cause": "No conclusive evidence could be found from the findings gathered through this investigation to determine the probable cause. However, based on the work done, it could be concluded that any combination of these findings could have caused or contributed to the accident. Although the crew at the last stage of this accident attempted to correctly recover, the gravity upset condition with regards to attitude, altitude and speed made this attempt insufficient to achieve a successful recovery.\r\nPossible causes:\r\n- Trim/Feel Unit Fault (Aileron Trim Runaway),\r\n- Temporarily, Spoiler wing cable jam (Spoiler offset of the neutral position),\r\n- Temporarily, F/O wheel jam (Spoilers offset of the neutral position),\r\n- Autopilot Actuator Hardover Fault.\r\nPossible contributing factors:\r\n- A distraction developing to Spatial Disorientation (SD) until the time the F/O announced 'A/C turning right' with acknowledgment of the captain, \r\n- Technical log copies were kept on board with no copy left at departure station,\r\n- Operator write up of defects was not accurately performed and resulting in unclear knowledge of actual technical status,\r\n- There are conflicting signals which make unclear whether the captain remained in SD or was the crew unable to perceive the cause that was creating an upset condition until the time when the F/O announced that there was no A/P in action, \r\n- After the time then the F/O announced 'no A/P commander' the crew behavior suggests the recovery attempt was consistent with expected crew reaction, evidences show that the corrective action was initiated in full, however the gravity of the upset condition with regards to attitude, altitude and speed made this attempt insufficient to achieve a successful recovery.\r\nAdditional findings:\r\n- The ECAA authorization for RAM B737 simulator was issued at a date later than the date of training for the accident crew although the inspection and acceptance test were carried out at an earlier date.\r\n- Several recorded FDR parameters were unreliable and could not be used for the investigation. "}