{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-cleburne", "date": "Jul 22, 2010 at 1100 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Aeropremiere", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cleburne - Mena", "msn": "61-0332-095", "yom": 1976, "flight_number": null, "city": "Cleburne", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 28000, "captain_hours_type": 332, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After takeoff, the right engine experienced a loss of power followed by the left engine losing power. The pilot maneuvered the airplane toward the nearest open field and the airplane impacted terrain during landing, resulting in a circumferential split in fuselage near the aft pressure bulkhead. The airplane was equipped with 4 fuel tanks: 2 located in each wing outboard of the engine nacelle (65-gallon capacity), 1 main fuselage tank (about 44-gallon capacity), and 1 auxiliary tank located in forward section of baggage compartment (45-gallon capacity). The airplane was capable of carrying 209.5 gallons usable fuel and the pilot stated that prior to departure he filled the main fuselage tank to capacity, added 20 gallons in the auxiliary tank and 25 gallons in each wing tank, which he equated to a total of 131 gallons on board. The fuselage contained two fuel filler necks, one for each fuselage tank (main and auxiliary). The auxiliary tank was clearly placarded with a red placard visibly standing out against a silver paint stripe; the main tank was not clearly placarded, with a red placard blending easily with red paint stripe. A salvage retriever recalled that during recovery the left wing contained 17 gallons of fuel, the right wing contained 57 gallons of fuel, the main fuselage tank contained 2.5 gallons of fuel, and the auxiliary fuselage tank contained 28 gallons of fuel. A postaccident examination of the airplane and engines revealed no anomalies that would have precluded normal operation. The main fuselage tank and auxiliary fuselage tank were not breached and the fuel sumps contained check valves which prevent the back-flow of fuel from one fuel tank to another. Based on the evidence it is likely that the pilot exhausted the airplane's fuel supply in the main fuselage tank, which resulted in the loss of power to both engines.", "probable_cause": "A total loss of engine power due to fuel starvation as a result of the pilot’s improper fuel management. Contributing to the accident were the critical fuel placards that were difficult to see due to the airplane's paint scheme."}