{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-81-ketchikan-1-killed", "date": "Apr 5, 1976 at 0819 LT", "type": "Boeing 727-100", "operator": "Alaska%20Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Anchorage - Juneau - Ketchikan - Seattle", "msn": "18821/124", "yom": 1965, "flight_number": "AS060", "city": "Ketchikan", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 43, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 19813, "captain_hours_type": 2140, "copilot_hours": 3193, "copilot_hours_type": 1980, "aircraft_hours": 25360, "circumstances": "About 0738LT on April 5, 1976, Alaska Airlines, Inc., Flight 60, a B-727-81, N124AS, departed Juneau, Alaska, on a regularly scheduled passenger flight to Seattle, Washington; an en route stop was scheduled for Ketchikan International Airport, Ketchikan, Alaska. There were 43 passengers and a crew of 7 on board. Anchorage air route traffic control center (ARTCC) cleared Flight 60 on an instrument flight rules (IFR) flight plan to the Ketchikan International Airport; the flight was routine en route. At 0805, Anchorage ARTCC cleared Flight 60 for an approach to runway 11 at Ketchikan. At 0807, the flight was 30 DME miles from the airport. At 0811, Flight 60 reported out of 10,000 feet and was cleared to contact Ketchikan Flight Service Station (FSS); the FSS advised the flight that the 0805 weather was: ceiling 800 ft., obscured, visibility 2 mi, light snow, fog, wind 330° at 5 kt. The FSS also advised the flight that braking action on runway 11 was poor; this report was based on braking tests performed by the airport manager. The captain testified that he did not recall hearing the braking condition report. Upon receipt of the clearance, the crew of Flight 60 began an ILS approach to Ketchikan. Near the 17-mile DME fix, as the flight descended through 4,000 feet, the crew acquired visual contact with the ground and water. As the flight approached Guard Island, the captain had the Island in sight and decided to abandon the ILS approach and to continue the approach visually. The captain testified that he established a 'visual glide slope of my own' at an altitude of about 1,000 feet, and stated that his eyes were '... the most reliable thing I have.' Visual contact with the approach lights was established about 2 miles from the runway threshold. The airport was visible shortly thereafter. The captain did not recall the airspeed at touchdown, but estimated that he touched down about 1,500 feet past the threshold of runway 11. He also testified that he did not see the yellow, 1,000-foot markers on the runway; he further testified that the runway '... was just wet.' A passenger on Flight 60, who was seated in seat 5A (just forward of the wing's leading edge), stated that the yellow runway marks were visible to him. The first officer has no recollection of the sequence of events leading to the accident; however, the second officer testified that airspeeds and descent rates were called out during the last 1,000 feet. The captain could not recall the flap setting either on approach or at touchdown. However, the second officer testified that after the landing gear was extended the first officer remarked, 'We're high,' and lowered the flaps from 30° to 40°. None of the cockpit crew remembered the airspeeds, descent rates, or altitudes of the aircraft during the approach and touchdown. Reference speed was calculated to be 117 kns with 40° flaps and 121 kns with 30° flaps. The captain testified that after touchdown he deployed the ground spoilers, reversed the engines, and applied the wheel brakes. Upon discovering that the braking action was poor, he decided to execute a go-around. He retracted the ground spoilers, called for 25° flaps, and attempted to obtain takeoff thrust. The thrust reverser mechanism did not disengage fully and the forward thrust could not be obtained. He then applied full reversing and quickly moved the thrust levers to 'idle.' This attempt to obtain forward thrust also was not successful. The captain then reapplied reverse thrust and again deployed the ground spoilers in an attempt to slow the aircraft. When he realized that the aircraft could not be stopped on the runway, he turned the aircraft to the right, raised the nose, and passed over a gully and a service road beyond the departure end of the runway. The aircraft came to rest in a ravine, 700 feet past the departure end of runway 11 and 125 feet to the right of the runway centerline. Flight attendants reported nothing unusual about the approach and touchdown, except for the relatively short time between the illumination of the no-smoking sign and the touchdown. The two flight attendants assigned to the rear jumpseats and the attendant assigned to the forward jumpseat did not have sufficient time to reach their assigned seats and had to sit in passenger seats. None of the flight attendants felt the aircraft decelerate or heard normal reverse thrust. Many passengers anticipated the accident because of the high speed of the aircraft after touchdown and the lack of deceleration. Two ground witnesses, who are also pilots, saw the aircraft when it was at an altitude of 500 to 700 feet and in level flight. The witnesses were located about 7,000 feet northwest of the threshold of runway 11. They stated that the landing gear was up and that the aircraft seemed to be 'fast' for that portion of the approach. When the aircraft disappeared behind an obstruction, these witnesses moved to another location to continue watching the aircraft. They saw the nose gear in transit and stated that it appeared to be completely down as the aircraft crossed over the first two approach lights. The first two approach lights are located about 3,000 feet from the runway threshold. A witness, who was located on the fifth floor of the airport terminal, saw the aircraft when it was about 25 feet over the runway. The witness stated that the aircraft was in a level attitude, but that it appeared 'very fast.' He stated that the aircraft touched down about one-quarter way down the runway, that it bounced slightly, and that it landed again on the nose gear only. It then began a porpoising motion which continued until the aircraft was past midfield. Most witnesses placed the touchdown between one-quarter and one-half way down the runway and reported that the aircraft seemed faster-than-normal during the landing roll. Witnesses reported varying degrees of reverse thrust, but most reported only a short burst of reverse thrust as the aircraft passed the airport terminal, about 3,800 feet past the threshold of runway 11.", "probable_cause": "The captain's faulty judgement in initiating a go-around after he was committed to a full stop landing following an excessively long and fast touchdown from an unstabilized approach. Contributing to the accident was the pilot's unprofessional decision to abandon the precision approach. The following findings were reported:\r\n- There is no evidence of aircraft structure or component failure or malfunction before the aircraft crashed.\r\n- The flight crew was aware of the airport and weather conditions at Ketchikan.\r\n- The weather conditions and runway conditions dictated that a precision approach should have been flown.\r\n- The approach was not made according to prescribed procedures and was not stabilized. The aircraft was not in the proper position at decision height to assure a safe landing because of excessive airspeed, excessive altitude, and improperly configured flaps and landing gear. \r\n- The aircraft's altitude was higher-than-normal when it crossed the threshold of runway 11 and its airspeed was excessively high.\r\n- The captain did not use good judgment when he initiated a go-around after he was committed to full-stop landing following the touchdown.\r\n- There is no evidence that the first and second officers apprised the captain of his departure from prescribed procedures and safe practices, or that they acted in any way to assure a more professional performance, except for the comment by the first officer, when near the threshold, that they were high after which he lowered the flaps to 40°.\r\n- After applying reverse thrust shortly after touchdown, the captain was unable to regain forward thrust because the high speed of the aircraft produced higher-than-normal airloads on the thrust deflector doors.\r\n- Braking action on runway 11 was adequate for stopping the aircraft before it reached the departure end of the runway.\r\n- Before the accident the FAA had not determined adequately the airport's firefighting capabilities.\r\n- Postaccident hearing tests conducted on the captain indicated a medically disqualifying hearing loss; however, the evidence was inadequate to conclude that this condition had any bearing on the accident. "}