{"url": "https://www.baaa-acro.com/crash/crash-avro-748-105-1-near-cutral-co-34-killed", "date": "Apr 15, 1976 at 1625 LT", "type": "Avro 748", "operator": "YPFA-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Rincón de Los Sauces – Cutral Có", "msn": "1540", "yom": 1962, "flight_number": null, "city": "Cutral Có", "zone": "Neuquén", "country": "Argentina", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 31, "pax_fatalities": 31, "other_fatalities": 0, "total_fatalities": 34, "captain_hours": 4576, "captain_hours_type": 1762, "copilot_hours": 7268, "copilot_hours_type": 1280, "aircraft_hours": 25753, "circumstances": "At 1555LT, the airplane departed Rincón de Los Sauces Airport bound for Cutral Có, carrying 31 employees of the Yacimientos Petroliferos Fiscales Company. While descending to Cutral Có, the crew informed ATC about its ETA at 1633LT and requested the last weather briefing for destination Airport. Less than two minutes later, while flying at an altitude of 4,000 feet, the right wing detached and separated. Out of control, the airplane entered a dive and crashed 35 km north of Cutral Có. The aircraft was totally destroyed and all 34 occupants have been killed. ", "probable_cause": "The accident was the result of detachment of the right hand wing in normal flight, through structural failure of the wing in the area between stringers 3 and 12 and in the area of the engine outer rib. Within the area indicated, one may identify among the origins of the fatigue the reinforcing plate, and especially, the holes in it for rivets. The cause of these fatigue cracks, since the material of which they were made was satisfactory, must be attributed to stress concentration in the area concerned due to geometry of the design, these cracks becoming critical sooner than had been estimated. The cracks remained undetected and became critical because the manufacturer's inspection programme for the area concerned was insufficiently precise and made it possible for the operator not to detect and correct them in time."}