{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-ithaca-2-killed", "date": "Jan 5, 1982 at 0749 LT", "type": "Piper PA-31-310 Navajo", "operator": "Empire%20Airlines%20NY", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Utica – Ithaca – Washington DC", "msn": "31-709", "yom": 1971, "flight_number": "EMP141", "city": "Ithaca-Tompkins", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3300, "captain_hours_type": 728, "copilot_hours": 2200, "copilot_hours_type": 380, "aircraft_hours": 5906, "circumstances": "The airplane crashed while attempting an approach to Tompkins County Airport, Ithaca, New York, an en route stop from schedule flight 141 from Utica to Washington DC. The flight crew had contacted Elmira approach control and had received instructions for an instrument landing system (ILS) approach to runway 32 at Tompkins County Airport. About 07:40 EST, the copilot declared an emergency stating that the airplane had a landing flap problem; he later stated that only one flap was down. He also stated that they were not able to maintain altitude and that the airplane was descending. Elmira approach lost radar contact with the airplane about 07:41 EST; the last radio transmission from the flight was recorded about 07:45 EST. The airplane crashed in a wooded area near three suburban residences. The pilot and copilot, the only persons aboard, were killed. There were no injuries to personnel on the ground. The airplane was destroyed by impact and post impact fire.", "probable_cause": "The probable cause of the accident was excessive wear of the left flap motor/flexible drive spline and certification of the airplane with a flap system that did not meet the requirements of Civil Air Regulation 3.339. The worn spline caused a split flap condition of 34 that resulted in marginal flight control authority. Moderate low altitude turbulence and transient low level wind shear may have contributed to the upset and loss of control."}