{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-0-vitoria-23-killed", "date": "May 9, 1962 at 1930 LT", "type": "Convair CV-240", "operator": "Cruzeiro-do-Sul-11", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rio de Janeiro – Vitória", "msn": "25", "yom": 1949, "flight_number": null, "city": "Vitoria", "zone": "Espírito Santo", "country": "Brazil", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 22, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 23, "captain_hours": 18386, "captain_hours_type": 2526, "copilot_hours": 3637, "copilot_hours_type": 395, "aircraft_hours": null, "circumstances": "The aircraft was flying the Rio de Janeiro - Vitória segment of a scheduled international flight. A 2220 GMT it reported it was over Guararapi at 2,700 m and in IMC. The aircraft was authorized to descend to 2,100 m and told to maintain that altitude until reaching the Vitória NDB. At 2228 it reported it was three minutes out at 2,100 m and in VMC. The flight continued its descent and was given landing instructions for runway 23. The controller in the tower watched the aircraft descending, and at the end of the downwind leg he saw the landing lights being adjusted. When the aircraft reported on final, the landing instructions were repeated. Shortly thereafter power was applied in an effort to climb the aircraft, but it collided with a eucalyptus tree at a height of 40 m, 1,860 m from the threshold of runway 23. At that stage of the approach the aircraft should been at a minimum altitude of 190 m (150 m above the ground). Fire broke following impact and destroyed the airplane. Two passengers were seriously injured while all 23 other occupants were killed. ", "probable_cause": "The pilot did not carry out the approach in accordance with the procedures prescribed by the airline and misjudged his distance from the runway. "}