{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-42-720-cheyenne-iiia-zurich", "date": "Oct 28, 2003 at 0742 LT", "type": "Piper PA-42 Cheyenne", "operator": "Cirrus-Aviation-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Leipzig – Zurich", "msn": "42-8001101", "yom": 1982, "flight_number": "RUS1050", "city": "Zurich-Kloten", "zone": "Zurich", "country": "Switzerland", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1000, "captain_hours_type": 900, "copilot_hours": 500, "copilot_hours_type": 34, "aircraft_hours": 5276, "circumstances": "The crew was completing a positioning flight (RUS1050) from Leipzig to Zurich on behalf of FSH Luftfahrtunternehmen but under contract of Cirrus Aviation. On final approach to Zurich-Kloten Airport, the crew encountered poor visibility due to foggy conditions. Despite the RVR for runway 14 was estimated to be 275 metres (below minimums of 400 metres for a CAT II approach if aircraft and crew are qualified), the crew decided to continue the approach, descended below the MDA until the aircraft struck the ground between both runways 14 and 16. The aircraft rolled for few dozen metres then lost its undercarriage and came to rest in a frosty field. Both pilots escaped with minor injuries and the aircraft was damaged beyond repair. At the time of the accident, the vertical visibility was 300 feet, the horizontal visibility was 200 metres with freezing fog, an OAT of -3° C and a dew point of -4° C. ", "probable_cause": "The accident is due to the fact that the crew continued the approach below the decision height during an ILS approach to runway 14 without sufficient visual references. As a result, the plane struck the ground and crashed. The following factors contributed to the development of the accident:\r\n- The aircraft was neither equipped nor approved for approaches under the prevailing weather conditions.\r\n- The crew was not trained for approaches in such weather conditions.\r\n- The crew failed to comply with SOP's and did not assigned tasks.\r\n- The crew was not familiar with the procedural requirements.\r\n- The crew knowledge was insufficiently checked by the operator."}