{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-412f-bishkek-39-killed", "date": "Jan 16, 2017 at 0719 LT", "type": "Boeing 747-400", "operator": "Air%20ACT", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Hong Kong - Bishkek - Istanbul", "msn": "32897/1322", "yom": 2003, "flight_number": "TK6491", "city": "Bishkek-Manas", "zone": "Bishkek City", "country": "Kyrgyzstan", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 35, "total_fatalities": 39, "captain_hours": 10808, "captain_hours_type": 820, "copilot_hours": 5894, "copilot_hours_type": 1758, "aircraft_hours": 46820, "circumstances": "On 16.01.2017, the crew of the Boeing 747-412F TC-MCL aircraft was performing a THY6491 flight from Hong Kong via Bishkek (Manas Airport) to Istanbul (Ataturk Airport) in order to transport the commercial cargo (public consumer goods) of 85 618 kg. The cargo was planned to be offloaded in Istanbul (Ataturk Airport). Manas Airport was planned as a transit airport for crew change and refueling. From 12.01.2017 to 15.01.2017, the crew had a rest period of 69 h in a hotel in Hong Kong. The aircraft takeoff from the Hong Kong Airport was performed at 19:12 on 5.01.2017, with the delay of 2 h 02 min in respect to the planned takeoff time. During the takeoff, the climb and the on-route cruise flight, the aircraft systems operated normally. At 00:41, on 16.01.2017, the aircraft entered the Bishkek ATC Area Control Center over the reference point of KAMUD at flight level of 10 400 m (according to the separation system, established in the People's Republic of China). At 00:51, the crew requested a descent and reached the FL 220 (according to the separation system, established in the Kyrgyz Republic). At 00:59, the crew received the weather information for Manas Airport: \"the RVR at the RWY threshold 400 m, the RWY midpoint and RWY end 300 m, the vertical visibility 130 ft\". At 01:01, the crew received the specified data: \" in the center of the runway RVR three zero zero meters, vertical visibility one five zero feet.\" At 01:03, the crew requested a descent, the controller cleared for the descent not below FL 180. At 01:05, the crew was handed over to the Approach Control. At 01:06, the crew was cleared for the descent to FL 60, TOKPA 1 ILS approach chart, RWY 26. At 01:10, the controller reported the weather: wind calm, visibility 50 m, RVR 300 m, freezing fog, vertical visibility 160 ft, and requested the crew if they would continue the approach. The crew reported that they would continue the approach. The crew conducted the approach to RWY 26 in accordance with the standard approach chart. At 01:11, the controller informed the crew: \"… transition level six zero\" and cleared them for the ILS approach to RWY 26. At 01:15, the crew contacted the Tower controller. The Tower controller cleared them for landing on RWY 26 and reported the weather: \"…wind calm… RVR in the beginning of the runway four hundred meters, in the middle point three hundred two five meters and at the end of the runway four hundred meters and vertical visibility one six zero... feet\". The aircraft approached the RWY 26 threshold at the height significantly higher than the planned height. Continuing to descend, the aircraft flew over the entire length of the RWY and touched the ground at the distance of 900 m away from the farthest end of the runway (in relation to the direction of the approach) (the RWY 08 threshold). After the touchdown and landing roll, the aircraft impacted the concrete aerodrome barrier and the buildings of the suburban settlement and started to disintegrate, the fuel spillage occurred. As a result of the impact with the ground surface and the obstacles, the aircraft was completely disintegrated, a significant part of the aircraft structure was destroyed by the post-crash ground fire. At 01.17 UTC, the Tower controller requested the aircraft position, but the crew did not respond.", "probable_cause": "The cause of the Boeing 747-412F TC-MCL aircraft accident was the missing control of the crew over the aircraft position in relation to the glideslope during the automatic approach, conducted at night in the weather conditions, suitable for ICAO CAT II landing, and as a result, the measures to perform a go-around, not taken in due time with the aircraft, having a significant deviation from the established approach chart, which led to the controlled flight impact with terrain (CFIT) at the distance of ≈930 m beyond the end of the active RWY.\r\nThe contributing factors were, most probably, the following:\r\n- the insufficient pre-flight briefing of the flight crew members for the flight to Manas aerodrome (Bishkek), regarding the approach charts, as well as the non-optimal decisions taken by the crew when choosing the aircraft descent parameters, which led to the arrival at the established approach chart reference point at a considerably higher flight altitude;\r\n- the lack of the crew's effective measures to decrease the aircraft vertical position and its arrival at the established approach chart reference point while the crew members were aware of the actual aircraft position being higher than required by the established chart;\r\n- the lack of the requirements in the Tower controllers' job instructions to monitor for considerable aircraft position deviations from the established charts while the pertinent technical equipment for such monitoring was available;\r\n- the excessive psycho-emotional stress of the crew members caused by the complicated approach conditions (night time, CAT II landing, long-lasting working hours) and their failure to eliminate the flight altitude deviations during a long time period. Additionally, the stress level could have been increased due to the crew's (especially the PIC's) highly emotional discussion of the ATC controllers' instructions and actions. Moreover, the ATC controllers' instructions and actions were in compliance with the established operational procedures and charts;\r\n- the lack of the crew members' monitoring for crossing the established navigational reference points (the glideslope capture point, the LOM and LIM reporting points);\r\n- the crew's failure to conduct the standard operational procedure which calls for altitude verification at the FAF/FAP, which is stated in the FCOM and the airline's OM. On the other hand, the Jeppesen Route Manual, used by the crew, contains no FAF/FAP in the RWY 26 approach chart;\r\n- the onboard systems' \"capture\" of the false glideslope beam with the angle of ≈9°;\r\n- the design features of the Boeing 747-400 aircraft type regarding the continuation of the aircraft approach descent in the automatic mode with the constant descent angle of 3° (the inertial path) with the maintained green indication of the armed automatic landing mode (regardless of the actual aircraft position in relation to the RWY) while the aircraft systems detected that the glideslope signal was missing (after the glideslope signal \"capture\"). With that, the crew received the designed annunciation, including the aural and visual caution alerts;\r\n- the absence of the red warning alert for the flight crew in case of a \"false\" glideslope capture and the transition to the inertial mode trajectory, which would require immediate control actions from the part of the crew;\r\n- the lack of monitoring from the part of the crew over the aircraft position in regard to the approach chart, including the monitoring by means of the Navigation Display (ND), engaged in the MAP mode;\r\n- the crew's failure to conduct the Airline's Standard Operational Procedures (SOPs), regarding the performance of the go-around procedure in case the \"AUTOPILOT\" (the AP switching to the inertial mode) and \"GLIDESLOPE\" (the EGPWS annunciation of the significant glideslope deviation) alerts during the automatic CAT II landing at true heights below 1000 ft (with no visual reference established with either the runway environment or with the lighting system);\r\n- the delayed actions for initiating the go-around procedure with no visual reference established with the runway environment at the decision height (DH). In fact, the actions were initiated at the true height of 58 ft with the established minimum of 99 ft."}