{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh9-canberra-2-killed", "date": "Feb 11, 1926", "type": "De Havilland DH.9", "operator": "Royal-Australian-Air-Force-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Topographic", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Richmond - Canberra", "msn": "C6323", "yom": null, "flight_number": null, "city": "Canberra", "zone": "Australian Capital Territory", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 254, "circumstances": "Aircraft was carrying a pilot and a photographer for a topographic mission over the Murrumbidgee River. Flying at an altitude of about 150 feet, the plane was about to land at Ainslie, near Canberra, when it nose-dived and crashed in flames to the ground. A farm-hand, named Walter Johnston, who was ploughing 50 yards away, saw the smash and rushed to the scene. By the time he arrived the aeroplane had burst into flame. After crashing, the plane burst into flames and Flying-Officer Pitt was burnt to death. Observer Callendar was terribly injured and died in the Canberra Hospital a few hours after the accident. With the pilot and the observer dead, the cause of the disaster probably will never be known. Onlookers who saw the smash say the machine, when about to make a landing, seemed to lose flying speed and nose-dived to the ground at a terrific rate. \r\nSource: www.3squadron.org.au", "probable_cause": "An inquest on the victims was held on Friday when the opinion was reached that the crash was caused by an error of judgment on the part of the pilot.   Expert evidence was given by Flight Lieutenant Hepburn, Director of Works and Buildings, RAAF, Melbourne. He said that he had instructed the two men to report to him at Canberra at 0930LT on Thursday, and the machine was sighted shortly after that time. It appeared in good order, but passed the landing ground that had been mapped out and attempted to land from a north-westerly direction. When the pilot shut off the engine the aeroplane stalled. It spun in the air and dived about 100 feet to the ground. He was unable to recognise Flying-Officer Pitt's body. The cause of the mishap, in the opinion of witness, was an error of judgment. The majority of aeroplane accidents are due to the same cause. The machine was valued at £3,000.  "}