{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-345c-paris-123-killed", "date": "Jul 11, 1973 at 1403 LT", "type": "Boeing 707", "operator": "Varig.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "São Paulo – Rio de Janeiro – Paris", "msn": "19841", "yom": 1968, "flight_number": "RG820", "city": "Paris-Orly", "zone": "Val-de-Marne", "country": "France", "region": "Europe", "crew_on_board": 17, "crew_fatalities": 7, "pax_on_board": 117, "pax_fatalities": 116, "other_fatalities": 0, "total_fatalities": 123, "captain_hours": 17959, "captain_hours_type": 4642, "copilot_hours": 12613, "copilot_hours_type": 5055, "aircraft_hours": 21470, "circumstances": "The airplane departed Rio de Janeiro-Galeão Airport at 0303LT on flight RG820 to Paris-Orly Airport. The en route part of the flight was uneventful. At 13:57 the aircraft had descended to FL80 and contacted Orly approach, who told the crew to maintain FL80 and head to the OLS VOR which would take the aircraft to the downwind leg of runway 26. At 13:58:20 the flight crew contacted Orly approach and reported a \"problem with fire on board\". An emergency descent was requested. At 13:59 clearance was given to descend to 3000 feet for a runway 07 landing, making a straight-in approach possible. While the situation on board was getting worse (smoke entering the cockpit and passengers becoming asphyxiated), a clearance to descend to 2000 feet was given at 14:01:10. The flight crew put on oxygen masks as smoke was making it impossible to read the instruments. At 14:03 the pilot decided to make an emergency landing 5 km short of the runway with gear down and flaps at 80°. The Boeing approached with considerable nose-up attitude, in a slight left bank. The aircraft truncated some small trees and made a heavy landing on a field. Both main gears collapsed and the engines were torn off in the subsequent skid. The fuselage however, remained intact. Ten occupants (all crew members) evacuated the aircraft. By the time the firemen arrived (6-7 minutes later) the fire had burned through the roof and there was no sign of life. Of the four unconscious occupants the firemen could evacuate, only one survived.", "probable_cause": "A fire which appears to have started in the washbasin unit of the aft right toilet. It was detected because smoke had entered the adjacent left toilet. The fire may have been started by an electrical fault or by the carelessness of a passenger. The difficulty in locating the fire made the actions of cabin personnel ineffective. The flight crew did not have the facilities to intervene usefully from the cockpit against the spread of the fire and the invasion of smoke. The lack of visibility in the cockpit prompted the crew to decided on a forced landing. At the time of touch-down the fire was confined to the area of the aft toilets. The occupants of the passenger cabin were poisoned, to varying degrees by carbon monoxide and other combustion products."}