{"url": "https://www.baaa-acro.com/crash/crash-antonov-26-chersky-7-killed", "date": "Dec 9, 1978 at 1743 LT", "type": "Antonov AN-26", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Chersky - Zyrianka", "msn": "57302810", "yom": 1975, "flight_number": null, "city": "Chersky", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was engaged in a cargo flight from Chersky to Zyrianka, carrying two loadmasters, five crew members and a load consisting of eight wooden copper coils. During the takeoff roll, at a speed of 200 km/h, the pilot-in-command started the rotation (the rotation speed was calculated at 215 km/h). The airplane rotated and continued to climb until the altitude of 150 meters when it entered stall conditions. It turn to the right and crashed in a huge explosion on an hotel located near the airport. The aircraft and the hotel were totally destroyed by a post crash fire. All seven occupants were killed while no one on the ground was injured. ", "probable_cause": "It was determined that the stall and subsequent loss of control during initial climb was caused by the cargo shifting. Investigations revealed that the wooden copper coils were not properly installed and secured in the cabin but only fixed with the onboard winch cable. At liftoff, the wooden copper coils moved to the rear of the cabin, causing the CofG to be out of the enveloppe and the aircraft to be uncontrollable. Loadmasters failed to install and secure the wooden copper coils according to the published procedures and failed to use appropriate equipment such as nets or belts. The copilot exercised an unsatisfactory supervision of the loading while the captain decided to takeoff despite the load was improperly secured."}