{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2-marquise-denver-2-killed", "date": "Dec 10, 2004 at 1940 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Flightline", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Denver – Salt Lake City", "msn": "1538", "yom": 1981, "flight_number": "ACT900", "city": "Denver-Centennial", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2496, "captain_hours_type": 364, "copilot_hours": 857, "copilot_hours_type": 0, "aircraft_hours": 12665, "circumstances": "Shortly after takeoff, the pilot reported to air traffic control he needed to return to the airport to land. The controller asked the pilot if he required any assistance, and the pilot responded, \"negative for right now uh just need to get in as soon as possible.\" The controller then asked the pilot what the problem was, in which the pilot responded, \"stand by one minute.\" Approximately 30 seconds later and while the airplane was on a left downwind to runway 35R, the pilot stated he was declaring an emergency and \"...we've got an air an engine ta shut down uh please roll the equipment.\" The controller and other witnesses observed the airplane on the base leg and then overshoot the final approach to runway 35R. After observing the airplane overshoot the final approach, the controller then cleared the pilot to the next runway, runway 28, and there was no response from the pilot. The controller observed the airplane's landing lights turn down toward the terrain, and \"the MU2 was gone.\" A witness observed the airplane make an \"immediate sharp bank to the left and descend to the ground. The impact appeared to be just less than a 45 degree angle, nose first.\" A performance study revealed that while the airplane was on downwind, the airplane started to bank to the left. The bank angle indicated a constant left bank angle of about 24 degrees as the airplane turned to base leg. Twenty-three seconds later, the bank angle began to increase further as the airplane turned to final approach, overshooting the runway, while the angle of attack reached stall angle of about 17 degrees. The flight path angle then showed a decrease by 22 to 25 degrees, the calibrated airspeed showed a decrease by 40 to 70 knots, and the vertical speed indicated a 3,000 feet per minute descent rate just before impact. Examination of the airframe revealed the flaps were in the 20 degree position, and the landing gear was retracted. According to the airplane flight manual, during the base leg, the flaps should remain in the 5 degree position and the landing gear extended; and when landing is assured, the flaps then extended to 20 degrees and maintain 125 knots calibrated airspeed (KCAS) during final and 110 KCAS when over the runway. Minimum controllable airspeed (Vmc) for the airplane is 99 KCAS. Examination of the propellers revealed that at the time of impact, the left propeller was in the feathered position and the right propeller was in the normal operating range. Examination of the left engine revealed static witness marks on several internal engine components, and no anomalies were noted that would have precluded normal operation. The reason for the precautionary shutdown of the left engine was not determined. Examination of the right engine revealed rotational scorring and  metal spray deposits on several internal engine components. Four vanes of the oil pump transfer tube were separated and missing. The gearbox oil-scavenge pump was not free to rotate and was disassembled. Disassembly of the oil-scavenge pump revealed one separated oil pump transfer tube vane was located in the pump. Pitting and wear damage was noted on all of the roller bearing elements and the outer bearing race of the propeller shaft roller bearing. No additional anomalies were noted.", "probable_cause": "the pilot's failure to maintain minimum controllable airspeed during the night visual approach resulting in a loss of control and uncontrolled descent into terrain. A contributing factor was the precautionary shutdown of the left engine for undetermined reasons."}