{"url": "https://www.baaa-acro.com/crash/crash-learjet-23-near-palm-springs-8-killed", "date": "Nov 14, 1965 at 1721 LT", "type": "Learjet 23", "operator": "Paul Kelly Flying Service", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Palm Springs – Hollywood", "msn": "23-063", "yom": 1965, "flight_number": null, "city": "Palm Springs", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 15100, "captain_hours_type": 125, "copilot_hours": 160, "copilot_hours_type": 24, "aircraft_hours": 43, "circumstances": "About 1721 P.s.t., November 14, 1965, Lear Jet Model 23, N243F, operated as a free transportation flight by the Paul Kelly Flying Service, Inc., crashed shortly after a night takeoff from the Palm Springs Airport at Palm Springs, California. The crash was in the Indio Hills approximately 13 miles east of the airport. The six passengers and two crewmembers were fatally injured. The aircraft was destroyed by impact and fire. The flight, which was to transport the passengers to Burbank, California, was observed to depart Runway 13 in a normal manner, commence a low-angle climbout, and accelerate to a relatively high speed. Shortly after takeoff the pilot called the Thermal, California Flight Service Station. Although station personnel responded immediately, there were no other transmissions from the flight. About this time the aircraft was observed to make a left turn beneath a low cloud base of about 3,000 feet, proceed in a northerly direction and then enter a steep dive from horizontal flight, and crash. All eight occupants were killed. \n\n\n", "probable_cause": "The Board determines that the probable cause of this accident was spatial disorientation of the pilot, resulting in a loss of control."}