{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-sandy-bay-1-killed", "date": "Jan 7, 2007 at 2002 LT", "type": "Beechcraft 100 King Air", "operator": "Transwest%20Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "La Ronge – Sandy Bay", "msn": "B-190", "yom": 1974, "flight_number": "TW350", "city": "Sandy Bay", "zone": "Saskatchewan", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 8814, "captain_hours_type": 449, "copilot_hours": 672, "copilot_hours_type": 439, "aircraft_hours": 17066, "circumstances": "The aircraft departed La Ronge, Saskatchewan, at 1930 central standard time under instrument flight rules to Sandy Bay, with two flight crew members and two emergency medical technicians aboard. TW350 was operating under Part VII, Subpart 3, Air Taxi Operations, of the Canadian Aviation Regulations. At 1948, air traffic control cleared TW350 out of controlled airspace via the Sandy Bay Runway 05 non-directional beacon approach. The crew flew the approach straight-in to Runway 05 and initiated a go-around from the landing flare. The aircraft did not maintain a positive rate of climb during the go-around and collided with trees just beyond the departure end of the runway. All four occupants survived the impact and evacuated the aircraft. The captain died of his injuries before rescuers arrived. Both emergency medical technicians were seriously injured, and the first officer received minor injuries. The aircraft sustained substantial damage from impact forces and was subsequently destroyed by a post-impact fire. The accident occurred at 2002 during the hours of darkness. ", "probable_cause": "Findings as to Risk:\r\n1. Some Canadian Air Regulations (CARs) subpart 703 air taxi and subpart 704 commuter operators are unlikely to provide initial or recurrent CRM training to pilots in the absence of a regulatory requirement to do so. Consequently, these commercial pilots may be unprepared to avoid, trap, or mitigate crew errors encountered during flight. \r\n2. Transport Canada (TC) Prairie and Northern Region (PNR) management practices regarding the June 2006 replacement of the regional combined audit program, in order to manage safety management system (SMS) workload, did not conform to TC’s risk management decision-making policies. Reallocation of resources without assessment of risk could result in undetected regulatory non-compliance.\r\n3. Although TC safety oversight processes identified the existence of supervisory deficiencies within TWA, the extent of the deficiencies was not fully appreciated by the PNR managers because of the limitations of the oversight system in place at that time.\r\n4. It is likely that the National Aviation Company Information System (NACIS) records for other audits include inaccurate information resulting from data entry errors and wide use of the problematic audit tracking form, reducing the effectiveness of the NACIS as a management tracking system.\r\n5. Self-dispatch systems rely on correct assessment of operational hazards by pilots, particularly in the case of unscheduled commercial service into uncertified aerodromes. Unless pilots are provided with adequate decision support tools, flights may be dispatched with defences that are less than adequate.\r\n6. TWA King Air crews did not use any standard practice in applying cold temperature altitude corrections. Inconsistent application of temperature corrections by flight crews can result in reduction of obstacle clearance to less than the minimum required and reduced safety margins.\r\n7. The practice of not visually verifying wind/runway conditions at aerodromes where this information is otherwise unavailable increases the risk of post-touchdown problems.\r\n8. The company dispatched flights to Sandy Bay without a standard means for crews to deal with non-current altimeter settings. Use of non-current or inappropriate altimeter settings can reduce minimum obstacle clearance and safety margins. \r\n9. The crew was likely unaware of their ¼ nautical mile (nm) error in the aircraft position in relation to the runway threshold resulting from use of the global positioning system (GPS). Unauthorized and informal use of the GPS by untrained crews during instrument flight rules (IFR) approaches can introduce rather than mitigate risk.\r\n10. Widespread adaptations by the King Air pilots resulted in significant deviations from the company’s SOPs, notwithstanding the company’s disciplinary policy.\r\n11. In a SMS environment, inappropriate use of punitive actions can result in a decrease in the number of hazards and occurrences reported, thereby reducing effectiveness of the SMS.\r\n12. Pilot workload is increased and decision making becomes more complicated where limited visual cues are available for assessing aircraft orientation relative to runway and surrounding terrain.\r\n13. Aerodromes with limited visual cues and navigational aids are not explicitly identified in flight information publications as hazardous for night/IFR approaches. Passengers and crews will continue to be exposed to this hazard unless aircraft and aerodrome operators carry out risk assessments to identify them and take mitigating action.\r\n14. To properly assess applicants for pilot positions, operators need access to information on experience and performance that is factual, objective, and (preferably) standardized. Because some employers are unprepared to provide this information—fearing legal action—this may lead to the appointment of pilots to positions for which they are unsuited, thereby compromising safety.\r\nOther Findings:\r\n1. TWA’s safety management system was not yet capable or expected to be capable of detecting, analyzing, and mitigating the risks presented by the hazards underlying this occurrence.\r\n2. The first officer and captain met competency standards on the completion of their initial flight training before they began employment as line pilots. \r\n3. It is very likely that the captain became the pilot flying for the remaining 20 seconds of the flight. The scenario that neither pilot was controlling the aircraft at that time is considered very unlikely. "}