{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-danville-4-killed", "date": "Apr 23, 2021 at 1701 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Mark Andregg", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Muskogee – Williston", "msn": "46-8508102", "yom": 1985, "flight_number": null, "city": "Danville", "zone": "Arkansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1431, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was conducting an instrument flight rules cross-country flight and climbing to a planned altitude of 23,000 ft mean sea level (msl). According to air traffic control data, as the airplane climbed through 18,600 ft msl, its groundspeed was 171 knots, and a gradual reduction in groundspeed began. After reaching an altitude of about 20,200 ft msl, the airplane began a descent on a southeast heading. Just before the descent began, the airplane’s groundspeed had decreased to 145 knots. About 2 minutes after the descent began, the airplane turned right to a northeast heading on which it continued for about 30 seconds. The flightpath then became erratic before the data ended. The pilot made no distress calls and did not respond to repeated calls from the controller. The main wreckage of the airplane was located in densely forested terrain at an elevation of about 930 ft about 1,000 ft south of the last radar return. The outboard portion of the right wing, right aileron, right horizontal stabilizer, and right elevator were not located with the main wreckage and, despite ground and aerial searches with a small unmanned aircraft system, were not found. Examination of the wreckage indicated that the missing wing and tail sections separated in flight due to overload. Examination of the recovered airframe and engine did not reveal evidence of any pre-existing mechanical malfunctions or anomalies that would have precluded normal operation. Weather forecasts indicated that the accident site was in an area where moderate icing conditions up to 25,000 ft msl, embedded thunderstorms, and 2-inch hail were forecasted. Review of preflight weather information received by the pilot indicated that he was aware of the conditions forecast on the route of flight before initiating the flight. Meteorological data revealed that the airplane likely entered icing conditions that ranged from light to heavy as it climbed through 14,000 ft msl about 23 minutes after takeoff and remained in icing conditions for the remaining 16-minute duration of the flight. Freezing drizzle conditions were likely present along the flightpath. Although the airplane was equipped for flight in icing conditions, the pilot’s operating handbook contained a warning about flight into severe icing conditions, which stated that flight in freezing drizzle could result in ice build-up on protected surfaces exceeding the capability of the ice protection system. The airplane’s gradual loss of groundspeed as it climbed was consistent with ice accumulating on the airplane. It is likely that during the 16 minutes the airplane was operating in icing conditions, the capability of the ice protection system was exceeded, which resulted in a degradation of aircraft performance and subsequent aerodynamic stall. During the ensuing uncontrolled descent, the structural capability of the airplane was exceeded, which resulted in an inflight break up. A review of the pilot’s records revealed multiple certificate application failures for reasons that included inadequate knowledge of cross-country flight planning, aircraft performance, and stalls. Review of the pilot’s airman knowledge written tests found areas answered incorrectly over multiple exams included meteorology, aircraft performance, aeronautical decision-making, and stalls. The ethanol identified in the pilot’s cavity blood was most likely the result of postmortem production. Therefore, effects from ethanol did not play any role in this accident. The cargo was documented as it was removed from the airplane and remained secure until after it was weighed. Based upon the weight of the cargo, passengers, airplane, and fuel from the filed flight plan, at the time of departure, the airplane would have been about 361 lbs over maximum gross weight. According to the FAA Pilot’s Handbook of Aeronautical Knowledge, an overloaded airplane “may exhibit unexpected and unusually poor flight characteristics,” which include reduced maneuverability and an increased stall speed. ", "probable_cause": "The pilot’s improper decision to continue flight in an area of moderate-to-heavy icing conditions, which resulted in exceedance of the airplane’s anti-icing system capabilities, a degradation of aircraft performance, and subsequent aerodynamic stall."}