{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-somerset-4-killed", "date": "Jan 18, 2000 at 1202 LT", "type": "Beechcraft 90 King Air", "operator": "Hart Corporation Delaware Division", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Philadelphia - Columbus - Somerset", "msn": "LJ-620", "yom": 1974, "flight_number": null, "city": "Somerset", "zone": "Kentucky", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 19320, "captain_hours_type": 1270, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9118, "circumstances": "The pilot requested and received clearance to execute the SDF approach, and was instructed to maintain 4,000 feet until established on the approach. Radar data revealed the airplane was never established on the approach, and started to descend before reaching the IAF. The airplane passed the IAF at 2,900 feet, and continued in a descending left hand turn into unprotected airspace. The airplane disappeared from radar at 1,900 feet, as it completed 180 degrees of turn. The turn did not match any of the four instrument approaches to the airport. The airplane struck a guy wire on a lighted communications antenna 3.3 MN southeast of the airport on a heading of 360 degrees. No evidence of a mechanical failure or malfunction of the airplane or its systems was found. A flight check by the FAA confirmed no navigation signal was received for the approach, which had been turned off and listed as out of service for over 4 years. In addition, the pilot did not report the lack of a navigation signal to ATC or execute a missed approach. Interviews disclosed the ATC controller failed to verify the approach was in service before issuing the approach clearance. ", "probable_cause": "The failure of the pilot to follow his approach clearance, and subsequent descent into unprotected airspace which resulted in a collision with the guy wire. Factors were the failure of the air traffic controller to verify the approach he cleared the pilot to conduct was in service, and the clouds which restricted the visibility of the communications antenna. "}