{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-90-dl-near-sablayan-26-killed", "date": "Jun 29, 1966 at 1217 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Philippine%20Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Manila – Mamburao – San Jose", "msn": "20573", "yom": 1944, "flight_number": "PR785", "city": "Sablayan", "zone": "Occidental Mindoro", "country": "Philippines", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 24, "pax_fatalities": 22, "other_fatalities": 0, "total_fatalities": 26, "captain_hours": 4240, "captain_hours_type": 244, "copilot_hours": 1777, "copilot_hours_type": 396, "aircraft_hours": null, "circumstances": "Flight 785 was a scheduled domestic VFR flight from Manila to San Jose with an intermediate stop at Mamburao. The aircraft departed Manila at 1030 hours local time and arrived at Mamburao after an uneventful flight. It then took off from Mamburao at 1204 hours. At 1215 hours, the flight requested terminal weather information from San Jose Radio Station. The requested information was transmitted but was not acknowledged. A witness stated that at approximately that same time he had observed an aircraft flying at very low altitude towards the mountain on a heading of approximately 065° and that, soon after, the aircraft disappeared from sight, he heard a loud explosion coming from the mountains east of his position. Subsequent efforts of San Jose Radio Station to contact the flight on both VHF and HF frequencies proved unsuccessful. In the afternoon of 1 July 1966 the wreckage of the aircraft was found at 2,300 feet AMSL in a ravine at the northern slope of Mt Rabangan (altitude 3,500 feet) which is approximately midway between Mamburao and San Jos6 and approximately 10 nautical miles inland. Two passengers were seriously injured while 26 other occupants were killed. ", "probable_cause": "The Board determined that the probable cause of the accident was misjudgement of the terrain clearance which resulted in the collision with trees. The instrument meteorological conditions en-route accompanied by severe turbulence and strong gusty winds over the crash site were a contributory factor. The weather and the sky condition at the time the airplane as seen over Sablayan was described as low thick dark clouds with strong wind and heavy rain. The actual weather in the vicinity of the crash site was substantially similar to the weather forecast that was conveyed to the pilot by the dispatcher during the weather briefing prior to the flight. Thirteen minutes after take-off the pilot encountered instrument meteorological conditions en-route under a VFR flight clearance."}