{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-marshfield", "date": "Jun 12, 1993 at 1040 LT", "type": "Cessna 340", "operator": "Thoroughbred Technology", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ipswich - Marshfield", "msn": "340A-0313", "yom": 1977, "flight_number": null, "city": "Marshfield (Colerne)", "zone": "Wiltshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1194, "captain_hours_type": 570, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On his second visit to Marshfield Airstrip, the pilot noted that the surface wind was blowing from 300°, across the 880 yard long grass strip which is oriented 08/26. He recalled that the strip had a significant slope which he thought was iphill on runway 08 and he decided to land in that direction to take advantage of the deceleration gained by landing uphill. The pilot made two approached to the strip followed by go-arounds during which he assessed the strength of the crosswind which was stronger than forecast. On the third approach the aircraft cleared trees close to the runway threshold and touched down between one third and one half of the way along the strip. The pilot stated that touchdown in this area was a deliberate decision on his part which was justified by the aircraft's ability to stop quickly on an uphill grass surface. Unfortunately, he had in fact landed in the downhill, downwind direction and was unable to stop the aircraft on the wet grass before the end of the strip. The aircraft passed through a low, dry stone wall at the end of the grass at a speed of 15 knots and came to rest some 10 metres beyond it after all three landing gears had collapsed rearwards. No one was hurt and there was no fire; all the occupants were able to leave the aircraft through the normal exit door. §", "probable_cause": "The pilot landed on the wrong runway according to wind component. "}