{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-ketchikan-1-killed", "date": "Sep 29, 1997 at 1747 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Promech-Air-2", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Ketchikan - Ketchikan", "msn": "1330", "yom": 1959, "flight_number": null, "city": "Ketchikan", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2071, "captain_hours_type": 1200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 24267, "circumstances": "The float equipped airplane was observed taking off in light winds and calm water, and obtaining a steep climb and nose high attitude. Witnesses described hearing no reduction of engine noise from takeoff power to climb power. The airplane entered a steep left bank about 200 feet above the water, then rolled rapidly to the right and impacted at a steep angle into the water. The airplane had been modified with a Short Take Off and Landing (STOL) kit. Certification flight tests had determined that this modification eliminated aerodynamic warning of impending stalls, and therefore required an audible stall warning. Test results also required the addition of both a ventral fin, and horizontal stabilizer finlets, to meet directional stability certification. These tests determined that the least stable condition was in the takeoff flap configuration, during climb. The Supplemental Type Certificate (STC) for the modification required the ventral fin, and an audible stall warning system be installed. The manufacturer provided a marketing video, produced prior to the STC approval, which stated the stall warning system was not required in the U.S. The company indicated this tape was used for training, and was a basis for pilots routinely disabling the stall warning horn by pulling the circuit breaker. At the time of the accident, the airplane did not have the ventral fin installed, a takeoff flaps setting was selected, and the audible stall warning circuit breaker was in the pulled (disabled) position. The local FAA Flight Standards Office had inspected the accident airplane 14 times in the previous 29 months, and made no mention of the ventral fin not being installed. ", "probable_cause": "The pilot's excessive climb and turning maneuver at low altitude, the pilot's inadvertent stall, and the intentional operation of the airplane with the required stall warning system disabled. Factors associated with this accident were the pilot's overconfidence in the modified airplane's ability, the uninstalled ventral fin, inadequate compliance with the STC by the company, unclear information by the manufacturer, and inadequate surveillance by the FAA. "}