{"url": "https://www.baaa-acro.com/crash/crash-airbus-a319-132-palermo", "date": "Sep 24, 2010 at 2007 LT", "type": "Airbus A319", "operator": "Wind%20Jet", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rome - Palermo", "msn": "2424", "yom": 2005, "flight_number": "JET243", "city": "Palermo-Punta Raisi", "zone": "Sicily", "country": "Italy", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 124, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13860, "captain_hours_type": 2918, "copilot_hours": 1182, "copilot_hours_type": 937, "aircraft_hours": 15763, "circumstances": "Following an uneventful flight from Rome-Fiumicino Airport, the crew started a night approach to Palermo-Punta Raisi Airport in poor weather conditions with heavy rain falls, thunderstorm activity and reduced visibility. During the descent, weather information was transmitted to the crew, indicating a visibility of 4 km with few CB's at 1,800 feet and a windshear warning for runway 20. On final approach, at an altitude of 810 feet (100 feet above MDA), following the 'minimum' call, the captain instructed the copilot to continue the approach despite the copilot did not establish a visual contact with the runway. At an altitude of 240 feet, the copilot reported the runway in sight but informed the captain that all four PAPI's lights were red. The captain took over control and continued the approach after the airplane deviated from the descent profile. With an excessive rate of descent of 1,360 feet per minute, the aircraft impacted ground 367 metres short of runway 07 threshold and collided with the runway 25 localizer antenna. Upon impact, both main landing gear were partially torn off. The aircraft slid for about 850 metres before coming to rest on the left of the runway. All 129 occupants were rescued, among them 35 were injured. The aircraft was damaged beyond repair. ", "probable_cause": "The event is classified as short landing accident and the cause is mainly due to human factors. The fact that the aircraft contacted the ground took place about 367 meters short of the runway threshold was due to the crew's decision to continue the instrument approach without a declared shared acquisition of the necessary visual references for the completion of the non-precision procedure and of the landing maneuver. The investigation revealed no elements to consider that the incident occurred due to technical factors inherent in the aircraft.\r\nThe following contributing factors were identified: \r\n- The poor attitude of those present in the cockpit to use of basics of CRM, particularly with regard to interpersonal and cognitive abilities of each and, overwhelmingly, the commander.\r\n- Deliberate failure to comply with SOP in place which provided, reaching the MDA, to apply the missed approach procedure where adequate visual reference of the runway in use had not been in sight of both pilots.\r\n- Failure to apply, by those present in the cockpit, the operators rules, concerning in particular: the concept of \"sterile cockpit\"; to do the descent briefing; to make callouts on final approach.\r\n- The routine with the crew, carrying out approaches to Palermo-Punta Raisi Airport, from which the complacency to favor the personalization of the standards set by operator, and by law. The complacency is one of the most insidious aspects in the context of the human factor, as it creeps in individual self-satisfaction of a condition, which generates a lowering of situational awareness, however bringing them to believe they had found the best formula to operate.\r\n- The existence of adverse weather conditions, characterized by the presence of an extreme rainfall, which significantly reduced the overall visibility.\r\n- The \"black hole approach\" phenomenon, due to adverse weather conditions together with an approach carried out at night, the sea, to a coast characterized by few dimly lit urban settlements.\r\nThis created the illusion in the PF of \"feeling high\" compared to what he saw and believed to be the threshold, with the result to get him to abandon the ideal descent profile, hitherto maintained, to make a correction and the subsequent short landing.\r\n- The decrease of performance of the light beam produced by SLTH in extreme rain conditions; The only bright horizontal reference for the crew consisted of the crossbar of the SALS, probably mistaken for the threshold lights."}