{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-timmins", "date": "Sep 26, 2014 at 1740 LT", "type": "Beechcraft 100 King Air", "operator": "Air%20Creebec", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moosonee – Timmins", "msn": "B-210", "yom": 1975, "flight_number": "CRQ140", "city": "Timmins", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2400, "captain_hours_type": 1000, "copilot_hours": 580, "copilot_hours_type": 300, "aircraft_hours": 14985, "circumstances": "The aircraft was operating as Air Creebec flight 140 on a scheduled flight from Moosonee, Ontario, to Timmins, Ontario, with 2 crew members and 7 passengers on board. While on approach to Timmins, the crew selected “landing gear down,” but did not get an indication in the handle that the landing gear was down and locked. A fly-by at the airport provided visual confirmation that the landing gear was not fully extended. The crew followed the Quick Reference Handbook procedures and selected the alternate landing-gear extension system, but they were unable to lower the landing gear manually. An emergency was declared, and the aircraft landed with only the nose gear partially extended. The aircraft came to rest beyond the end of Runway 28. All occupants evacuated the aircraft through the main entrance door. No fire occurred, and there were no injuries to the occupants. Emergency services were on scene for the evacuation. The accident occurred during daylight hours, at 1740 Eastern Daylight Time.", "probable_cause": "Findings as to causes and contributing factors:\r\n1. During the extension of the landing gear, a wire bundle became entangled around the landing-gear rotating torque shaft, preventing full extension of the landing gear.\r\n2. The entanglement by the wire bundle also prevented the alternate landing-gear extension system from working. The crew was required to conduct a landing with only the nose gear partially extended.\r\nOther findings:\r\n1. The wire bundle consisted of wiring for the generator control circuits, and when damaged, disabled both generators. The battery became the only source of electrical power until the aircraft landed."}