{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-275-calgary", "date": "Mar 22, 1984 at 0742 LT", "type": "Boeing 737-200", "operator": "Pacific%20Western%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Calgary - Edmonton", "msn": "22265/755", "yom": 1981, "flight_number": "PW501", "city": "Calgary", "zone": "Alberta", "country": "Canada", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 114, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7447, "circumstances": "Pacific Western Airlines scheduled early morning flight 501 to Edmonton was pushed-back from the gate at 07:35. After engine start the aircraft taxied to runway 34 for departure. Takeoff was begun at 07:42 from the intersection of runway 34 and taxiway C-1. About 20 seconds into the takeoff roll, at an airspeed of approximately 70 knots, the flightcrew heard a loud bang which was accompanied by a slight veer to the left. The captain immediately rejected the takeoff using brakes and reverse thrust. Both the crew members suspected a tire on the left main landing gear had blown. The captain decided to taxi clear of the runway at taxiway C-4. Approaching C-4, the crew a.o. noted that left engine low pressure unit rpm was indicating 0 per cent. Twenty-three seconds after the initiation of the rejected takeoff, the first officer called clear of the runway on tower frequency: \"501 clear here on Charlie 4\". The purser then entered the flight deck and reported a fire on the left wing. The control tower then confirmed that there was a fire: \"Considerable amount off the back - on the left side engine there - and - eh - it's starting to diminish there. Eh - there's a fire going on the left side.\" One minute and two seconds had passed since the initiation of the rejected takeoff. Immediately after this the purser further stated that \"the whole left-hand side, the whole back side of it is burning\". The captain discharged a fire bottle into the engine and the first officer requested emergency equipment. At an elapsed time of 1 minute 36 seconds, the cockpit fire warning bell activated. Simultaneously, the purser re-entered the cockpit and reported that it was getting bad at the back. The captain stopped the aircraft the crew then carried out the procedures for an emergency evacuation, which was initiated at an elapsed time of 1 minute 55 seconds. All 119 occupants were evacuated, among them 29 were injured. The aircraft was destroyed. ", "probable_cause": "The accident was the consequence of the combination of the following factors: \r\n- An uncontained rupture of the left engine thirteenth stage compressor disc occurred approximately 1,300 feet into the take-off roll,\r\n- Failure of the disc was the result of fatigue cracking at three main locations in the rear snap and adjacent to 6 of the 12 tie-bolt holes,\r\n- Fatigue cracking initiated as a result of an unidentified combination of factors which developed progressively over an undefined period of time, following the last major overhaul in May 1981,\r\n- Some stator repair procedures carried out at the last major overhaul were not in accordance with the provisions of the Pratt & Whitney JT8D engine overhaul manual; as a result, deficiencies in the thirteenth stage stator assembly occurred,\r\n- The ruptured piece of the compressor disc exited the engine and penetrated the left lower inboard wing skin, puncturing a fuel cell,\r\n- Fuel leaking from the punctured fuel cell was ignited instantaneously,\r\n- The fuel-fed fire increased in size and engulfed the left wing and aft section of the aircraft."}