{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-rock-sound-3-killed", "date": "Jun 5, 2018 at 1545 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Hat Investments", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Rock Sound – Treasure Coast", "msn": "421B-0804", "yom": 1974, "flight_number": null, "city": "Rock Sound", "zone": "South Eleuthera", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 5th June, 2018 at approximately 3:45pm local, (Eastern Daylight Time) , a Cessna 421B aircraft crashed in dense bushes shortly after departure from Runway 27 at Rocksound Int’l Airport, Rock Sound, Eleuthera, Bahamas. The crash site was located approximately 2,503 feet / .41 nautical mile (nm) north of the threshold of Runway 09 and 8,588 feet / 1.42 nm from threshold of runway 27. The pilot and 2 passengers were killed and the aircraft was destroyed by impact forces and a post-crash fire. The aircraft made initial contact with trees before making contact with the ground and other trees in dense bushes. The aircraft descended right wing first, in an approximately 40 degree nose-down angle. A crater approximately 12 inches deep and 10 feet long by 5 feet wide was created when the aircraft hit the ground, subsequently crossing a dirt road, before coming to rest partially in an upward incline in trees. The nose of the aircraft came to rest on a heading of 355° degrees. The fuselage of the aircraft was located at Latitudes 24° 53’ 50”N and Longitude 076° 11’33”W. A fire ensued after the crash.", "probable_cause": "The Air Accident Investigation Department has determined the probable cause of this accident to be the pilot failure to maintain control of the airplane. Circumstances contributing to the failure to maintain control undetermined. Evidence exist to demonstrate the aircraft was not producing full power at the time it loss control, the reasons for the reduced power unknown. It could not be determined why the fuel selector was position to the auxiliary tank and not the main tank as required by manufacturer’s recommendation. Critical evidence were destroyed in the post impact fire."}