{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-karnack-1-killed", "date": "Jul 7, 2012 at 0404 LT", "type": "Beechcraft 90 King Air", "operator": "Win%20Win%20Aviation", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Plain, Valley", "schedule": "DeKalb - Brownsville", "msn": "LW-65", "yom": 1973, "flight_number": null, "city": "Karnack", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5300, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15082, "circumstances": "Before the flight, the pilot did not obtain a weather briefing and departed without approval from company personnel. The airplane departed the airport about 0230 and climbed to 14,500 feet mean sea level. The pilot obtained visual flight rules (VFR) flight following services from air traffic control (ATC) personnel during the flight. While the airplane was en route, ATC personnel advised the pilot that an area of moderate precipitation was located about 15 miles ahead along the airplane’s flight path. The pilot acknowledged the transmission and was then directed to contact another controller. About 3 minutes later, the new controller advised the pilot of an area of moderate to extreme precipitation about 2 miles ahead of the airplane. The pilot responded that he could see the weather and asked the controller for a recommendation for a reroute. The controller indicated he didn’t have a recommendation, but finished by saying a turn to the west (a right turn) away from the weather would probably be better. The pilot responded that he would make a right turn. There was no further radio contact with the pilot. Flight track data indicated the airplane was in a right turn when radar contact was lost. A review of the radar data, available weather information, and airplane wreckage indicated the airplane flew through a heavy to extreme weather radar echo containing a thunderstorm and subsequently broke up in flight. Postaccident examination revealed no mechanical malfunctions or anomalies with the airframe and engines that would have precluded normal operation. During the VFR flight, the pilot was responsible for remaining in VFR conditions and staying clear of clouds. However, Federal Aviation Administration directives instruct ATC personnel to issue pertinent weather information to pilots, provide guidance to pilots to avoid weather (when requested), and plan ahead and be prepared to suggest alternate routes or altitudes when there are areas of significant weather. The weather advisories and warnings issued to the pilot by ATC were not in compliance with these directives. The delay in providing information to the pilot about the heavy and extreme weather made avoiding the thunderstorm more difficult and contributed to the accident.", "probable_cause": "The pilot's inadvertent flight into thunderstorm activity, which resulted in the loss of airplane control and the subsequent exceedance of the airplane’s design limits and in-flight breakup. Contributing to the accident was the failure of air traffic control personnel to use available radar information to provide the pilot with a timely warning that he was about to encounter extreme precipitation and weather along his route of flight or to provide alternative routing to the pilot."}