{"url": "https://www.baaa-acro.com/crash/crash-martin-202-butte-21-killed", "date": "Nov 7, 1950 at 0815 LT", "type": "Martin 202", "operator": "Northwest%20Airlines2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago – Minneapolis – Billings – Great Falls – Helena – Butte – Seattle", "msn": "9161", "yom": 1947, "flight_number": "NW115", "city": "Butte", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 17, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": 8291, "captain_hours_type": 610, "copilot_hours": 2873, "copilot_hours_type": 80, "aircraft_hours": 6166, "circumstances": "The flight left Helena at 0753LT, using Runway 29. The flight plan, amended before takeoff, specified an altitude of 10,500 feet MSL under instrument flight rules via Amber Airway number 2 to the Whitehall (Montana) Range Station and from there to the Butte Airport via Red Airway number 2. Also, before taking off, the pilot asked the Helena Tower if the Homestake Fan normally and was informed that Butte Radio advised that it was. Following takeoff from Runway 29, the aircraft was flown in a climbing right turn so that it passed approximately over the Station as it headed south toward the Whitehall Range Station. At 0801 the flight reported to Helena that it had reached its cruising altitude. This message was acknowledged. The next message from the flight was to Butte at 0814 stating that it was over Whitehall (Range Station) at 0811 and starting descent. Butte acknowledged this message, gave that flight the station altimeter setting of 29.97, advised that the wind was south, calm, and that the Weather Bureau advised what the ceiling was lower to the east and north and better to the south and southwest. Flight 115 replied that it had vertical visibility at 10,500 feet. This was the last radio contact with the flight. A search was instituted after several futile attempts to contact the aircraft. On the following morning, the wreckage was sighted from a local search aircraft at about 0900. Ground parties immediately started for the crash site. All debris were found in a snow covered wooded area and all 21 occupants were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the failure of the captain to conduct the flight in accordance with the proscribed approach procedure. The following findings were reported: \r\n- The pilot failed to follows the carrier's prescribed number 2 instrument approach procedure to the Butte Airport, which procedure is approved by the Civil Aeronautics Administration, \r\n- The aircraft struck a mountain at about the 8,250-foot level, while on a heading of approximately 290 degrees magnetic,\r\n- The accident occurred during a local snowstorm and under conditions of variable ceiling and visibility."}