{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-80-dl-richmond-27-killed", "date": "May 16, 1946 at 0104 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Viking Air Transport", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Newark – Norfolk – Richmond – Atlanta – Houston", "msn": "19626", "yom": 1944, "flight_number": null, "city": "Richmond", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 25, "pax_fatalities": 25, "other_fatalities": 0, "total_fatalities": 27, "captain_hours": 2566, "captain_hours_type": 2325, "copilot_hours": 500, "copilot_hours_type": 100, "aircraft_hours": 1180, "circumstances": "Few minutes after takeoff from Richmond-Byrd Field Airport, while flying at an altitude of 3,000 feet, the crew informed ATC that an engine failed and obtained the permission to return to Richmond. In heavy rain falls and by night, the crew missed the airport and was forced to make a go around. Few seconds later, while trying to gain height, the aircraft went out of control and crashed 6 miles south of the airfield. The aircraft was totally destroyed and all 27 occupants were killed. ", "probable_cause": "The probable cause of this accident was the inability of the pilot to maintain adequate control of the aircraft to effect an emergency single-engine instrument approach under adverse weather conditions. Contributing factors were: The decision of the pilot to continue the flight into weather conditions that were considered as unsafe; the negligence of the pilot in failing to have an inspection of the aircraft engines made prior to departure from Richmond; the action of the pilot in shutting down the wrong engine when experiencing excessive vibration from a power plant; and the pilot's neglect in failing to retract the landing gear during an emergency go-around."}