{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-cradock", "date": "Dec 23, 2001 at 1630 LT", "type": "Beechcraft 90 King Air", "operator": "Prive37", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Port Elizabeth - Cradock", "msn": "LJ-523", "yom": 1971, "flight_number": null, "city": "Cradock", "zone": "Eastern Cape", "country": "South Africa", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3599, "captain_hours_type": 118, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The private pilot was accompanied by his wife and his two daughters on a flight from Port Elizabeth to his farm in the Cradock district. On arrival at Cradock, the pilot apparently over-flew the runway for inspection and was on the downwind leg when the aircraft started to roll and yaw to the left. All engine indications were normal and the pilot had to decrease power on the right-hand engine in order to maintain control of the aircraft. With the reduction in power of the right-hand engine, the pilot was unable to maintain height and executed a forced landing on an open field. The aircraft was extensively damaged during the forced landing but no injuries were sustained. An on-site investigation was carried out on 24 December 2000 after which the aircraft was recovered to Lanseria aerodrome for further inspection. On inspection of the Left-hand propeller it was noted that the carbon block of the low pitch proximity sensor, which normally runs inside the Low-Pitch stop collar, was bent down at an angle, which would have rendered the secondary Low-Pitch stop inoperative. Due to the fact that the aircraft sustained damage to it's electronic circuitry it was not possible to verify the proper operation of the propeller pitch control system.", "probable_cause": "Due to damage sustained during the accident, the proper operation of the propeller pitch control system could not be verified. The cause of the accident therefore remains undetermined."}