{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-wiscasset-2-killed", "date": "Jun 10, 1996 at 0600 LT", "type": "Beechcraft 90 King Air", "operator": "Ruma Advisory Company", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Wiscasset - Philadelphia", "msn": "LW-313", "yom": 1979, "flight_number": null, "city": "Wiscasset", "zone": "Maine", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 10516, "captain_hours_type": 1138, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6230, "circumstances": "The pilot took off on runway 07 and was cleared direct to the Wiscasset NDB, east of the airport. Shortly after takeoff, the airplane began turning to the left. The pilot then asked the controller, '. . . can you tell if I'm in a turn? I have a problem here.' Soon thereafter, the airplane collided with terrain in an uncontrolled descent, about 1.6 miles north of the airport. Investigation revealed that three days before the accident, a refueler had fueled the airplane's left wing with 840 pounds of fuel, then the fuel farm ran out of fuel. No further fueling was accomplished, and the pilot was not advised of the uneven fuel load. Procedures in the Beech E90 Pilot's Operating Manual (POM) included a check of the fuel tanks during preflight. The Beech C90 POM specified a maximum fuel imbalance of 200 pounds, but the E90 POM did not specify a maximum fuel imbalance. During examination of the wreckage, no preimpact malfunction or failure was found. ", "probable_cause": "Failure of the pilot to maintain control of the airplane while climbing after takeoff, due to spatial disorientation, which resulted in an uncontrolled descent and subsequent collision with terrain. Factors relating to the accident were: the improper refueling (servicing of the aircraft) by FBO personnel, and failure of the pilot to note the excessive lateral imbalance of the airplane during preflight. "}