{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-291-near-toacaso-3-killed", "date": "Aug 30, 2008 at 2103 LT", "type": "Boeing 737-200", "operator": "Conviasa", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "No", "site": "Mountains", "schedule": "Caracas – Latacunga", "msn": "21545/525", "yom": 1978, "flight_number": null, "city": "Toacaso", "zone": "Cotopaxi", "country": "Ecuador", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 9018, "captain_hours_type": 5915, "copilot_hours": 3000, "copilot_hours_type": 989, "aircraft_hours": 60117, "circumstances": "The aircraft was parked at Caracas Airport for a while and had just been sold to an Ecuadorian operator. A crew of three departed Caracas-Maiquetía-Simón Bolívar Airport in the evening on a delivery flight to Latacunga, Ecuador. After being cleared to descend to FL180, FL150 then FL130, the crew was flying over a mountainous area when the GPWS alarm sounded. The crew apparently elected to gain height but the alarm sounded for 22 seconds when the aircraft collided with the Iliniza Volcano. The aircraft disintegrated on impact and all three occupants were killed. The wreckage was found the following day at an altitude of 3,992 metres. ", "probable_cause": "Non-compliance by the crew of the technical procedures, configuration, speed and bank angle of the aircraft required for the completion of the initial turn of the Instrument Approach Procedure n°4 published in the AIP Ecuador, to Latacunga Airport, a failure that placed the aircraft outside of the protected area (published pattern), leading to high elevation mountainous terrain.\r\nContributing factors: \r\n- Ignorance of the crew of the area which was under the approach path.\r\n- Lack of documentation and procedures of the airline that govern the conduct of flights to non-scheduled and special airports."}