{"url": "https://www.baaa-acro.com/crash/crash-consolidated-pb4y-2-privateer-port-hardy", "date": "Aug 9, 1975 at 0015 LT", "type": "Consolidated PB4Y-2 Privateer", "operator": "Hawkins-Powers-Aviation-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Anchorage - Ketchikan - Greybull", "msn": "59876", "yom": 1943, "flight_number": "Tanker 125", "city": "Port Hardy", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1482, "circumstances": "During 1975, '13D was under contract to the US Department of the Interior and based at Anchorage, Alaska. Total flight time was approximately 1475 hours. On Friday, 8 August 197 5, the aircraft was being flown back to the lower 48 States from Anchorage with an eventual destination of Greybull, Wyoming. One engine had been shut down due to its running rough, and we understand that a planned fuel stop at Ketchikan, Alaska, was missed because of bad weather. Shortly after midnight on Saturday, 9 August, after seven hours of flight, BuNo 59876 ran out of fuel, and the engines that were still in operation began to quit! Luckily, they were over the northern tip of Vancouver Island, British Columbia, Canada, and below was the 5000 foot paved runway at Port Hardy. Unbelievably , during final approach with only one engine still running, the pilot considered he was too high to land and attempted to go-around! The aircraft struck the ground during the turn, crashed through the airport perimeter fence, crossed the rock and driftwood strewn beach, and came to rest in the ocean, approximately 100 yards offshore! When the radio operator in the control tower lost contact with the plane, he immediately sounded the alarm in the airport fire station. Since no aircraft, nor fire, could be seen, it was felt the plane must have gone down short of the airport, and a search was started in that area. When the aircraft finally came to a stop, the two-man crew was unsure of where they were and what had happened. Almost immediately, the cockpit started to fill with water, and the men struggled to climb out a roof escape hatch. After standing on top of the aircraft for a short while, they spotted a seat cushion floating by, grabbed it, and swam the hundred or so yards to shore. When they arrived on land, their legs were so cold they could not stand. After a short rest, the crew scrambled in the dark over logs and through bushes, and made it to the airport boundary fence. During this same time period, the fire and rescue crews decided the plane must have gone off the runway and into the ocean, so they returned to the airport to resume their search. As the pilot and copilot approached the fence, they saw an emergency vehicle speed toward them down the runway and then continue on by until it stopped at the hole in the fence where the plane had crashed through on its way to the ocean. A short time later, another truck arrived. They were able to get the attention of the driver by shouting and waving. The flight crew was taken to the fire hall where they were given blankets and hot drinks until an ambulance took them to the hospital for examination. Both the pilot and copilot received only minor injuries during their ordeal. The pilot was fired by H&P, but the copilot remained with the company, only to be killed in the crash of a C119 during 1980. N6813D received substantial damage to its nose gear and underbelly, and the left wing tip and flap were destroyed. \r\nSource: http://pb4y-2.org/pdf/all.pdf", "probable_cause": "Fuel exhaustion."}