{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47-dl-sharjah-20-killed", "date": "Jul 10, 1960 at 1030 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Gulf%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Bahraïn – Doha – Sharjah", "msn": "4273", "yom": 1941, "flight_number": null, "city": "Sharjah", "zone": "Sharjah (الشارقةّ)", "country": "United Arab Emirates", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 16, "pax_fatalities": 16, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Gulf Aviation DC-3 operated on a return flight from Bahrain to Sharjah via Doha. The DC-3 took off from Doha at 05:16 GMT following a 30-minute stopover. The DC-3 was cleared for FL70 and reported to Bahrain ATC at 06:04 that it was in contact with Sharjah, ETA being 06:45. Last radio contact was one minute later when the flight reported to Sharjah. The pilot of a de Havilland Heron plane, approaching Sharjah at FL50 reported hearing the DC-3 crew trying to contact Sharjah three times. These calls were not heard by Sharjah control and the airplane crashed into the sea off Sharjah in unknown circumstances. SAR operations were conducted but eventually suspended a week later as no trace of the aircraft nor the 20 occupants was ever found. ", "probable_cause": "Due to lack of evidences, investigations were unable to determine the exact cause of the accident. It can only be a matter of conjecture as the wreckage was not located. All possible factors were explored, but none appeared plausible. Absence of radio communication between the aircraft and Sharjah after the initial contact and the absence of any distress call might have led to the tentative conclusion that the aircraft had met with a catastrophic disaster while still over the sea. However, the interception of a radio call from the aircraft at about its expected time of arrive at Sharjah and the considerable tailwind on the route seem to indicate the possibility that the aircraft overflew Sharjah under conditions of poor visibility. It is noteworthy that the ETA given by the aircraft as 0642 did not allow for any appreciable tailwind component which was indicated by the evidence of the Heron pilot. Not accounting for this factor could have resulted in the aircraft's descent on its ETA into high ground to the east of Sharjah. It may also explain the inability of Sharjah, to receive any message which may have been transmitted on VHF. However, the NDB at Sharjah was fully operational during the period of the subject flight and should have indicated to the pilot that Sharjah had been overflown unless the ADF system in the aircraft was mishandled or suffered a multiple failure."}