{"url": "https://www.baaa-acro.com/crash/crash-cessna-421a-golden-eagle-i-annino-afb-2-killed", "date": "Aug 22, 2012 at 1517 LT", "type": "Cessna 421A Golden Eagle I", "operator": "Intertransavia", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Annino - Annino", "msn": "421A-0075", "yom": 1968, "flight_number": null, "city": "Annino AFB", "zone": "Leningrad oblast", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "In the afternoon, the crew departed Annino AFB (Gorelovo) to complete a local training mission consisting of touch-and-go maneuvers. After two circuits, the aircraft landed normally and the crew took off and started the rotation without informing ATC. After liftoff, at a height of about 10-15 metres, the aircraft rolled to the right to an angle of 70° then stalled and crashed in a kindergarten located one km from the airport, bursting into flames. The aircraft was destroyed and both pilots were killed. ", "probable_cause": "Most probably the accident with С-421 (FVSP) RA-0879G aircraft was caused by right and then left engine flameout during touch-and-go landing, flight speed decrease and aircraft stall entry resulted in aircraft ground impact with bank angle over 70°. Most probably engines flameout midair was caused by fuel-air mixture depletion due to low level of fuel in aircraft tanks that in combination with its inadequate quality resulted in engines trouble.\r\nCombination of the following factors could contribute to the accident:\r\n- Flight operation with low level of fuel on board.\r\n- Inadequate fuel quality.\r\n- Inadequate crew training for forthcoming flight.\r\n- Inadequate maintenance prior to aircraft familiarization flight after its long-term parking.\r\n- Touch-and-go landing and continued takeoff with engines trouble during run operation.\r\n- Non-feathering of switched-off engine propeller midair (non compliance with requirement of clause \"2\" of subsection 3 of «ENGINE INOPERATIVE PROCEDURE» section aircraft FOM).\r\n- Possible on position failure of fuel booster pump switches by crew before aircraft take-off.\r\n- Inadequate flight operation management, aircraft maintenance and efficiency discipline in \"Aviator\" Airclub\" LLC, weak monitoring from senior staff over maintenance operation on accident prevention. \r\n- The flight was performed by crew on aircraft without airworthiness certificate (violation of clause 1 article 35 of Air Code of RF and clause 1 of FAR-118)."}