{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-bolivia-34-killed", "date": "Jan 6, 1960 at 0238 LT", "type": "Douglas DC-6", "operator": "National-Airlines-4", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "New York – Miami", "msn": "43742", "yom": 1952, "flight_number": "NA2511", "city": "Bolivia", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 29, "pax_fatalities": 29, "other_fatalities": 0, "total_fatalities": 34, "captain_hours": 16117, "captain_hours_type": 8234, "copilot_hours": 3863, "copilot_hours_type": 723, "aircraft_hours": 24836, "circumstances": "Flight 2511 departed New York International (Idlewild) Airport at 2334LT on January 5 on an IFR clearance scheduled as a nonstop flight to Miami, Florida. The flight proceeded routinely in accordance with its flight plan until shortly after passing Wilmington, North Carolina. At 0231 Flight 2511 contacted the company radio station at Wilmington while over Carolina Beach at 18,000 feet, and transmitted a routine progress report. Shortly after the completion of this radio contact a dynamite explosion occurred in the passenger cabin. Following this explosion the aircraft entered a wide descending right turn and crashed 1-1/2 miles north-west of Bolivia at 0238 some 16 miles west of its intended flight path. All 29 passengers and the crew of five were killed. It is believed that Julian Frank was the author of this act of sabotage after he contracted a life-insurance for one million US$. But this assumption was not confirmed as he was himself seating in the aircraft when the explosion occurred. \r\nNo reference is made in this report concerning the placing of the dynamite aboard the aircraft or of the person or persons responsible for its detonation. The malicious destruction of an aircraft is a Federal crime. After the Board's determination that such was involved, the criminal aspects of this accident were referred to the Department of Justice through its Federal Bureau of Investigation", "probable_cause": "The Board determines that the probable cause of this accident was the detonation dynamite within the passenger cabin."}