{"url": "https://www.baaa-acro.com/crash/crash-vickers-953f-vanguard-marseille-3-killed", "date": "Feb 6, 1989 at 1824 LT", "type": "Vickers Vanguard", "operator": "ICS", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Marseille - Casablanca", "msn": "730", "yom": 1960, "flight_number": "ICS3132", "city": "Marseille-Marignane", "zone": "Bouches-du-Rhône", "country": "France", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 1808LT, the crew reached the runway 32R holding point and was cleared for takeoff 4 minutes later. During the takeoff roll, the captain noticed control problems and abandoned the takeoff procedure and returned to the apron. The crew proceeded to various checks and few minutes later, it was decided to take off again. Shortly after liftoff, while in initial climb, the aircraft rolled to the left then overturned and crashed in the Gulf of Lion few hundred meters offshore. The aircraft was destroyed and all three crew members were killed. ", "probable_cause": "The accident resulted from a loss of control of the aircraft during take-off following a failure (or disconnection) in the control chain of an aileron servo-compensator. This failure (disconnection) most likely occurred when using the thrust reversers on the last landing. This failure (disconnection) appears to be the result of an earlier damage probably located in the control chain of the left aileron servo-compensator, struck by a stepladder after the antepenultimate flight; however, the link between the two elements could not be formally established. Before take-off, the crew did detect the anomaly in the roll controls but performed an incorrect analysis and did not perform all the checks required by the flight manual in this case. The power reduction immediately after take-off exacerbated the loss of control of the aircraft by causing it to stall. The fact that this flight is an instruction flight and the relatively modest experience of this crew on aircraft of this technology were aggravating factors."}