{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-lakeway-2-killed", "date": "Sep 23, 2004 at 1619 LT", "type": "Cessna 421C Golden Eagle III", "operator": "N729DM LLC", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Angel Fire – Austin", "msn": "421C-1101", "yom": 1981, "flight_number": null, "city": "Lakeway", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 14000, "captain_hours_type": 9, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5328, "circumstances": "The 14,000-hour airline transport pilot was hired to fly the owner of the airplane and his mother on a cross country flight. Approximately 3 hours and 15 minutes into the flight, the pilot reported that he had a rough running engine and declared an emergency. A review of ATC voice communications revealed that the pilot had changed his mind several times during the emergency about diverting to a closer airport or continuing to the intended destination. Prior to his last communication, the pilot informed ATC that he, \"was not gonna make it.\" The sole survivor of the accident reported that the flight was normal until they approached their destination. He said, \"all of a sudden the engines did not sound right.\" The right engine sounded as if the power was going up and down and the left engine was sputtering. The airplane started to descended and the pilot made a forced landing in wooded area. The cockpit, fuselage, empennage, and the right wing were consumed by post-impact fire. A review of fueling records revealed that the pilot had filled the main tanks prior to the flight for a total of 213.4 gallons; of which 206 gallons were usable (103 gallons per side). During the impact sequence, the left wing separated at the wing root and did not sustain any fire damage. No fuel was found in the tank, and there was no discoloration of the vegetation along the left side of the wreckage path or around the area where the wing came to rest. The left fuel selector was found set to the LEFT MAIN tank, and the right fuel selector valve was set between the LEFT and RIGHT MAIN tanks. This configuration would have allowed fuel to be supplied from each tank to the right engine. A review of the airplane's Information Manual, Emergency Procedures Engine Failure During Flight (speed above air minimum control speed) instructed the pilot to re-start the engine, which included placing both fuel selector handles to the MAIN tanks (Feel for Detent). If the engine did not start, the pilot was to secure the engine, which included closing the throttle and feathering the propeller. The propellers were not feathered. Examination of the airplane and engine revealed no mechanical deficiencies. ", "probable_cause": "The pilot's improper positioning of the fuel selector valves, which resulted in a loss of power to the left engine due to fuel exhaustion. After the power loss, the pilot failed to follow checklist procedures and did not secure (feather) the left propeller, which resulted in a loss of altitude and subsequent forced landing."}