{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-aitkin-4-killed", "date": "Jun 2, 1996 at 1317 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Home Oil Stations", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "International Falls – Ottumwa", "msn": "46-08049", "yom": 1986, "flight_number": null, "city": "Aitkin", "zone": "Minnesota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1817, "captain_hours_type": 1084, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1049, "circumstances": "The airplane was in cruise flight at 17,000 feet msl when the pilot told Minneapolis ARTCC 'We're picking up some ice and rain, and we're going to turn around.' ARTCC approved the request. Two minutes later the pilot told ARTCC that 'We're looking for some help to get around this weather southbound.' ARTCC told the pilot that he could turn either east or west. The pilot turned west, then 4 minutes later turned back to the south. The pilot then told ARTCC that they were still encountering weather. ARTCC directed the pilot to turn north and then east whenever he could. Approximately 1 minute later ARTCC radar showed the airplane in a rapid descent. The pilot then told ARTCC 'Minneapolis center, N9114Q is out of control.' The pilot had received a FSS briefing prior to takeoff, and was advised of convective conditions and precipitation building to the south along his intended route of flight. The airplane was approximately 548 pounds over maximum takeoff weight. ", "probable_cause": "The pilot's continued flight into known adverse weather conditions and the pilot exceeding the design stress limits of the airplane. Factors contributing to this accident were: the thunderstorms, hail, and wind gusts, and the airplane's over maximum gross weight condition. "}