{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-36m-yogyakarta", "date": "Dec 20, 2011 at 1713 LT", "type": "Boeing 737-300", "operator": "Sriwijaya-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jakarta - Yogyakarta", "msn": "28333/2810", "yom": 1996, "flight_number": "SJY230", "city": "Yogyakarta", "zone": "Special Region of Yogyakarta", "country": "Indonesia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 131, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 29801, "captain_hours_type": null, "copilot_hours": 562, "copilot_hours_type": null, "aircraft_hours": 31281, "circumstances": "On 20 December 2011, a Boeing 737-300 aircraft, registered PK-CKM, was being operated by PT. Sriwijaya Air on a schedule passenger flight SJ230 from Soekarno Hatta International  Airport (WIII) Jakarta to Adisutjipto International Airport (WARJ), Yogyakarta. There were 141 persons on board; two pilots, four cabin crews and 135 passengers consisted124 adult, 7 children and 4 infant. The aircraft departed from Jakarta at 14.00 LT (07.00 UTC), the pilot in command was the pilot flying and the co-pilot was the pilot monitoring. At 08.10 UTC the aircraft made holding at 8 NM from JOG VOR due to bad weather. After the second holding and the weather was deteriorated, the airport authority closed the airport for takeoff and landing. The pilot requested divert to Juanda Airport (WARR), Surabaya and landed at 08.40 UTC. After refuelling and received the information about weather improvement in Yogyakarta then the aircraft departed, at 09.20 UTC, in this sequence of flight the PIC acted as PF, with 137 persons on board consisted of two pilots, four cabin crews and 131 passengers consisted 120 adult, 7 children and 4 infant. The aircraft was on the fifth sequence from seven aircraft approaching Adisucipto airport Yogyakarta. Passing JOG VOR it was seen on radar screen that the aircraft speed was read 203 Kts at 2700 ft. Approach Controller instructed to reduce the speed. At about 1200 ft, the pilot had the runway insight and disengaged the autopilot and auto throttle. The pilot made correction to the approach profile by roll up to 25 degrees and rate of descend up to 2040 ft per minute. The GPWS warning of ‘pull up’ and sink ‘rate were’  activated. Aircraft touched down at speed 156 Kts of 138 Kts target landing speed. During landing roll, the auto-brake and spoiler activated automatically. The thrust reverse were deployed and the N1 were recorded on the FDR increase and decrease to idle before increased to 80% prior to aircraft stop. The PIC noticed that the aircraft would not be able to stop in the runway and decided to turn the aircraft to the left. The aircraft stopped at 75 meter from the end of runway 09 and 54 meter on the left side of the centre line. Most of the passenger evacuated   through left and right forward escape slides. All passengers were evacuated safely. The passenger on the stretcher case was evacuated by the airport rescue. 6 passengers reported minor injured while all crew and the remaining passengers were not injured. The aircraft suffered major damage on the right main and nose wheel.", "probable_cause": "Findings:\r\n1. The aircraft was airworthy prior the accident. There was no evidence that the aircraft had malfunction during the flight. \r\n2. The crew had valid license and medical certificate. There was no evidence of crew incapacitation. \r\n3. In this flight Pilot in Command acted as Pilot Flying and Second In command acted as Pilot Monitoring. \r\n4. The flight crew did not conduct approach crew briefing. \r\n5. There was no checklist reading. \r\n6. The PIC as Pilot Flying did not have the instrument approach procedure immediately available to review during approach. \r\n7. During the approach, the PIC course indicator was set at 091 and the SIC was at 084. \r\n8. The rate of descend recorded vary and up to 1920 ft per minute and below 500 ft AGL the rate of descend recorded up to 2040 ft per minute. \r\n9. The approach did not meet the stabilize approach criteria as stated in the FCOM. \r\n10. There were several GPWS warning of ‘sink rate’ and ‘pull up’ activated during approach. \r\n11. The aircraft touched down at speed 156 Kt before bounced, instead of 138 Kt target landing speed. \r\n12. The flap extended to 40 after the aircraft touch down. \r\n13. The FDR recorded reduction in N1 during thrust reverser activation after landing. \r\n14. The CRM was not well implemented. \r\nFactors:\r\nUnsuccessful to recognize the two critical elements, namely fixation and complacency affected pilot decision to land the aircraft while the approach was not meet the criteria of stabilized approach. \n"}