{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-oshkosh", "date": "Jul 22, 2015 at 0744 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "DLM Holding Group", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Benton Harbor – Oshkosh", "msn": "46-8408065", "yom": 1984, "flight_number": null, "city": "Oshkosh", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 934, "captain_hours_type": 130, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5792, "circumstances": "The pilot was landing at a large fly-in/airshow and following the airshow arrival procedures that were in use. While descending on the downwind leg for runway 27, the pilot was cleared by a controller to turn right onto the base leg abeam the runway numbers and to land on the green dot (located about 2,500 ft from the runway's displaced threshold). About the time the pilot turned onto the base leg, he observed an airplane taxi onto the runway and start its takeoff roll. The controller instructed the pilot to continue the approach and land on the orange dot (located about 1,000 ft from the runway's displaced threshold) instead of the green dot. The pilot reported that he considered performing a go-around but decided to continue the approach. As the pilot reduced power, the airplane entered a stall and impacted the runway in a right-wing-low, nose-down attitude. Witnesses estimated that the bank angle before impact was greater than 60 degrees. A postaccident examination of the airframe and engine revealed no evidence of mechanical malfunctions or failures that would have precluded normal operation.\r\nAnalysis of a video recording of the accident showed that the airplane was about 180 ft above ground level (agl) when the turn onto the base leg began, and it descended to about 140 ft agl during the turn. The airplane's total inertial speed (the calculated vector sums of the airplane's ground speeds and vertical speeds) decreased from 98 knots (kts) to 80 kts during the turn. During the last 8 seconds of flight, the speed decreased below 70 kts, and the airplane descended from about 130 ft agl to ground impact. The wings-level stall speed of the airplane at maximum gross weight with landing gear and flaps down was 59 kts. In the same configuration at 60 degrees of bank, the stall speed was 86 kts and would have been higher at a bank angle greater than 60 degrees. Reduced runway separation standards for airplanes were in effect due to the airshow. When the accident airplane reached the runway threshold, the minimum distance required by the standards between the arriving accident airplane and the departing airplane was 1,500 ft. The video analysis indicated that it was likely that a minimum of 1,500 ft of separation was maintained during the accident sequence. Although the pilot was familiar with the procedures for flying into the airshow, the departing airplane\r\nand the modified landing clearance during a period of typically high workload likely interfered with the pilot's ability to adequately monitor his airspeed and altitude. As a result, the airplane entered an accelerated stall when the pilot turned the airplane at a steep bank angle and a low airspeed in an attempt to make the landing spot, which resulted in the airplane exceeding its critical angle of attack. At such a low altitude, recovery from the stall was not possible. Although the airshow arrival procedures stated that pilots have the option to go around if necessary, and the pilot considered going around, he instead continued the unstable landing approach and lost control of the airplane.", "probable_cause": "The pilot's failure to perform a go-around after receiving a modified landing clearance and his failure to maintain adequate airspeed while maneuvering to land, which resulted in the airplane exceeding its critical angle of attack in a steep bank and entering an accelerated stall at a low altitude. "}