{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-san-angelo", "date": "Jan 24, 2003 at 1015 LT", "type": "Cessna 208B Grand Caravan", "operator": "FedEx", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Angelo - San Angelo", "msn": "208B-0044", "yom": 1987, "flight_number": null, "city": "San Angelo-Ducote Airpark", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4356, "captain_hours_type": null, "copilot_hours": 13884, "copilot_hours_type": null, "aircraft_hours": 7503, "circumstances": "The airplane impacted a dirt field and a power line following a loss of control during a simulated engine failure while on a Part 135 proficiency check flight. Both pilots were seriously injured and could not recall any details of the flight after the simulated engine failure. Witnesses observed the airplane flying on a westerly heading at an altitude of 100 to 200 feet, and descending. They heard the sound of an engine “surging” and observed the airplane’s wings bank left and right. The airplane continued to descend and impacted the ground and power lines before becoming inverted. A pilot-rated witness reported that he observed about ¼ inch of clear and rime ice on the airplane’s protected surfaces (deice boots) and about ½ inch of ice on the airplane’s unprotected surfaces. An NTSB performance study of the accident flight based on radar data indicated that the airplane entered a descent rate of 1,300 feet per minute (fpm) about 1,100 feet above the ground. This rate of descent was associated with a decrease in airspeed from 130 knots to 92 knots over a span of 30 seconds. The airplane’s rate of descent leveled off at the 1,300 fpm rate for 45 seconds before increasing to a 2,000 fpm descent rate. The true airspeed fluctuated between a low of 88 knots to 102 knots during the last 45 seconds of flight. According to the aircraft manufacturer, the clean, wing flaps up stall speed was 78 knots. However, after a light rime encounter, the Pilot’s Operating Handbook (POH) instructed pilots to maintain additional airspeed (10 to 20 KIAS) on approach “to compensate for the increased pre-stall buffet associated with ice on the unprotected areas and the increased weight.” With flaps up, a minimum approach speed of 105 KIAS was recommended. The POH also stated that a significantly higher airspeed should be maintained if ½ inch of clear ice had accumulated on the wings.", "probable_cause": "The flight crew's failure to cycle the deice boots prior to conducting a simulated forced landing and their failure to maintain adequate airspeed during the maneuver, which resulted in an inadvertent stall and subsequent loss of control. A contributing factor was the ice accumulation on the leading edges of the airfoils."}