{"url": "https://www.baaa-acro.com/crash/crash-boeing-314a-clipper-lisbon-24-killed", "date": "Feb 22, 1943 at 1847 LT", "type": "Boeing 314 Clipper", "operator": "Pan%20Am.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "New York – Hamilton – Horta – Lisbon – Marseille", "msn": "1990", "yom": 1939, "flight_number": "PA9035", "city": "Lisbon", "zone": "Estremadura - Lisbon District", "country": "Portugal", "region": "Europe", "crew_on_board": 12, "crew_fatalities": 7, "pax_on_board": 27, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": 14352, "captain_hours_type": 3278, "copilot_hours": 1706, "copilot_hours_type": 1454, "aircraft_hours": 8505, "circumstances": "The flight maintained in altitude of approximately 7000 feet until it approached the mouth of the Tagus River, approximately 11 miles from Lisbon, when a gradual let-down was made to about 600 feet. The Portuguese authorities require that this altitude be maintained from the mouth of the river to the landing area. The flight arrived over the area at about 1835 GMT (6:35 p.m. Lisbon time) 3 hours and 52 minutes after take-off from Horta and 15 minutes ahead of its estimated arrival time. Since official sunset was at 6:20 p.m., PanAm's ground crew at Lisbon had set out as usual a string of landing lights, indicating that the landing was to be made from south to north. On this particular occasion the light arrangement was slightly different from normal, since the extreme downwind (south) light, which was usually green in color, had been replaced with a white light. The only reason for this change was that the green bulb had burned out and the PanAm station substituted the white bulb. Captain Sullivan indicated in his testimony that the substitution of lights was not confusing and had no bearing on the accident. This string of five landing lights extended over a distance of approximately 4500 feet. At the time the flight arrived an the area it was still light enough for the aircraft to be observed plainly by personnel in the PanAm launch and on the shore. The PanAm launch had patrolled the landing area east of the string of landing lights and had taken its station near the red light which was the extreme upwind (north) light of the landing strip. The landing conditions and barometric pressure were given to the flight by radio at 6:35 p.m. and were acknowledged with a statement from the flight that they would want flares when both landing lights were blinked. While proceeding in a northeasterly direction, at an estimated speed of 135 knots and at an altitude of between 500 and 600 feet over the area, about 1 1/2 miles east and abeam of the center light in the string of landing lights, the aircraft made a descending, turn to the left which continued until it was headed in a westerly direction when the left wing tip skimmed along the surface of the water, dug in and the plane crashed into the river. It remained partially submerged for approximately 10 minutes, then disappeared below the surface of the river. The PanAm launch, which had been standing by for the landing, proceeded to the scene of the accident, arriving about 10 minutes later, and began rescue operations. The PanAm launch was joined by a BOAC launch (British) and another PanAm launch approximately 10 minutes later. The American actress Tamara Drasin and the American novelist Ben Robertson were killed in the crash while the actress Jane Froman was seriously injured. ", "probable_cause": "It appears that the probable cause of this accident was an inadvertent contact of the left wing tip of the aircraft with the water while making a descending turn preparatory to landing."}