{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-marshfield-3-killed", "date": "Sep 29, 2001 at 1700 LT", "type": "Cessna 414 Chancellor", "operator": "Potter & Son", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Wisconsin Rapids - Poplar Bluff", "msn": "414-0496", "yom": 1974, "flight_number": null, "city": "Marshfield", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane was destroyed after an attempted landing following a reported partial power loss of the left engine while en route. The flight did not divert to the closest airport located about 27 nautical miles to the southwest while at an altitude of about 15,900 feet. This airport was a controlled field equipped with airport rescue and fire fighting (ARFF), and its longest runway was 9,005 feet. The flight diverted to the departure airport located about 93 nautical miles to the north. This airport was an uncontrolled field not equipped with ARFF, and its longest runway was 5,000 feet. No emergency was declared. The airplane was reported by a witness to be too high and too fast to land on runway 34 at the airport. The winds were from 140 degrees at 6 knots. The wreckage distribution was consistent with an impact resulting from a Vmc (minimum control speed with the critical engine inoperative) roll to the left. The pilot received a checkout from the right seat in the accident airplane by the airplane owner. The checkout was about 20 minutes in duration and did not include any single-engine flight maneuvers or emergency procedures. The owner did not hold a certified flight instructor certificate. The pilot had stopped flying for 12 years and just began giving flight instruction and flying in single-engine airplanes about a year prior to the accident. The pilot's recent multiengine flight experience was limited to a couple of non-revenue flights within the past year while seated in the right seat of a King Air. The King Air was used for commercial charter work which would involve one or two landings per flight. One landing was made on the day prior to the accident. The accident pilot asked the King Air pilot to accompany him along on the accident flight; the King Air pilot declined. A multiengine commercial rated pilot-rated passenger, who the accident pilot knew, was seated in the right front seat. Examination of the airplane's supplemental type certificate (STC) revealed that the airplane had undergone numerous inspections by different maintenance personnel. The left engine's variable absolute pressure controller had safety wire around its control arm, which precluded its normal operation and a pressure relief valve that was not called for in the STC drawings. At the time of issuance, Federal Regulation's did not require STC instructions for continued airworthiness. Reliance on the airplane and engine maintenance manuals would not have provided enough information for continued airworthiness in accordance with the STC and could have yielded a setting exceeding those for which the STC parts were originally certificated to and thus increasing Vmc speed. Examination of the left engine revealed a cylinder head separation on the number six cylinder assembly, which had accumulated an estimated time since installation of 240 hours. Visual inspection of the assembly revealed the presence of some undecipherable characters in its parts numbering. A cylinder head separation from another airplane was also examined. This cylinder assembly accumulated about 270 hours since installation. Both cylinder assembly examinations revealed the presence of additional material on the cylinder barrel threads and fatigue fracture on the cylinder head.", "probable_cause": "The pilot's failure to maintain adequate airspeed (Vmc) which resulted in a loss of control. Contributing factors were the improper in-flight planning/decision not to land at a closer airport and the lack of recent experience in multiengine airplanes by the pilot-in-command, the cylinder head separation, the inadequate manufacturing process, and the lack of continued airworthiness instructions relating to the Riley Super-8 STC."}