{"url": "https://www.baaa-acro.com/crash/crash-vickers-818-viscount-east-london-25-killed", "date": "Mar 13, 1967 at 1910 LT", "type": "Vickers Viscount", "operator": "South%20African%20Airways2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Port Elizabeth – East London – Bloemfontein – Johannesburg", "msn": "317", "yom": 1958, "flight_number": "SA406", "city": "East London", "zone": "Eastern Cape", "country": "South Africa", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 20, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 25, "captain_hours": 12344, "captain_hours_type": 3231, "copilot_hours": 3995, "copilot_hours_type": 109, "aircraft_hours": null, "circumstances": "On 13th March 1967 Vickers Viscount aircraft ZS-CVA, \"Rietbok\", was on a scheduled public transport flight No. SA 406 from Port Elizabeth to Johannesburg via East London and Bloemfontein. Its Estimated Time of Arrival at East London was 1714 GMT, but the weather there was poor. The captain had indicated that he would probably overfly East London, but that he would have a look at conditions there before deciding to do so.  The last communication from the aircraft was when it notified East London Airport Control that it was \"at 2,000 ft. with the coastline in sight\". It is estimated that the aircraft was then between 20 and 15 nautical miles from the Airport and that the time was approximately 1709 GMT. At 1710.08 GMT the aircraft crashed into the sea. The approximate position of the crash was 33°13.45’ S. , 27°38.3’ E.  On board were Captain Gordon Benjamin Lipawsky, First Officer Brian Albert Richard Trenwith, 3 cabin crew and 20 passengers. Air-sea rescue operations were put in hand promptly, but there were no survivors. Bits of floating wreckage, consisting mainly of cabin interior fittings, were recovered by naval vessels and other pieces were washed ashore.  The main wreckage of the aircraft is believed to he lying at a depth of between 180 and 220 feet, approximately 1½ miles off-shore. Extensive salvage operations were attempted, but were hindered by murky water, a current up to 8 kts and dangerous sea conditions. The aircraft was lost and all 25 occupants were killed. ", "probable_cause": "The available data is not sufficient for the originating cause of the accident to be determined with any degree of probability. In the opinion of the Board certain possibilities can be excluded as being inconsistent with the evidence and/or as being remote and improbable: among these possibilities are structural failure, failure of controls or control surfaces, multiple engine failure, instrument failure, explosion, fire, a \"bad weather\" accident and pilot error.  However, on the evidence the Board cannot exclude as the originating cause of the accident a heart attack suffered by the captain in the air, with ensuing loss of control of the aircraft, and with the first officer being unable in the time available to regain sufficient control to prevent contact with the sea."}