{"url": "https://www.baaa-acro.com/crash/crash-partenavia-p68b-victor-endelave-island", "date": "Jun 3, 2018 at 1422 LT", "type": "Partenavia P.68", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rendsburg - Endelave Island", "msn": "82", "yom": 1977, "flight_number": null, "city": "Endelave Island", "zone": "Sjælland", "country": "Denmark", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 950, "captain_hours_type": 70, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3260, "circumstances": "The accident occurred during a private VFR flight from EDXR (Rendsburg-Schachtholm) to Endelave (EKEL). When arriving overhead EKEL, the pilot made a visual inspection of the airstrip conditions. Upon a low approach at a shallow angle to runway 29 at EKEL, the pilot on short final reduced engine power and initiated the flare. Approximately 10 meters in front of the beginning of runway 29, the aircraft landed in a wheat field, and the main landing gear touched down at and collided with an upslope roadside next to a road crossing perpendicularly to the beginning of runway 29. When colliding with the upslope roadside, the left main landing gear collapsed. The aircraft started veering uncontrollably to the left and ran off the side of the airstrip. In the grass parking area next to the airstrip, the left wing of the aircraft collided with the nose landing gear of a parked aircraft. The aircraft continued veering to the left, impacted with a tree and a farm building, and came to rest. After impact with the tree and the farm building, the aircraft caught an explosive fire. Witnesses observing the landing and the impact with the tree and the farm building initiated a rescue mission. The aircraft was totally destroyed by a post crash fire and all four occupants were injured. ", "probable_cause": "An undershoot landing and touchdown at an upslope roadside next to a road crossing perpendicularly to the beginning of runway 29 resulted in a left main landing gear collapse. The aircraft uncontrollably veered to the left, ran off the side of the airstrip, collided with a parked aircraft, and impacted with a tree and a farm building. The aircraft caught an explosive fire. The resolute actions by witnesses and the local community in combination with an effective rescue mission were the difference between fatal and serious injuries."}