{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-young-7-killed", "date": "Jun 11, 1993 at 1918 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Monarch Airlines (Australia)", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sydney – Cowra – Young – Cootamundra", "msn": "31-8152083", "yom": 1981, "flight_number": "OB301", "city": "Young", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 1822, "captain_hours_type": 337, "copilot_hours": 954, "copilot_hours_type": 43, "aircraft_hours": 3936, "circumstances": "At about 1500 hours EST, 11 June 1993, a standard company flight plan held by the CAA at the Melbourne flight briefing facility was activated. The plan indicated that Piper PA-31-350 aircraft VH-NDU would be conducting flight OB 301, a regular public transport service from Sydney (Kingsford Smith) airport to Cootamundra NSW, with intermediate landings at Cowra and Young. The flight was planned to be operated in accordance with IFR procedures, with a scheduled departure time from Sydney of 1720. The aircraft was to be crewed by two pilots. Prior to departure, the company scheduled a second aircraft to operate the Sydney–Cowra sector. Consequently, VH-NDU was required to land only at Young and Cootamundra. At that time of the year, the 1720 departure time meant that the flight would be conducted entirely at night. VH-NDU departed Sydney at 1738 carrying five passengers, with a fuel endurance of about 253 minutes. The pilot-in-command occupied the left cockpit seat. The aircraft initially tracked via the direct Sydney to Cowra route and climbed to a cruising altitude of 8,000 feet. At 1801 the pilot reported to Sydney FIS that the aircraft was now tracking direct to Young, and would report at Riley, an en route reporting point located 62 NM from Young on the Katoomba– Young track. FIS advised the area QNH was 1003 hPa. At 1814 the pilot reported the aircraft was at Riley and estimated arrival at Young at 1835. By 1820 the pilot had reported on descent to Young, with in-flight conditions of cloud and heavy rain. Recorded radar data later showed that the aircraft passed 13.5 NM to the south-east of Riley, south of the direct Katoomba–Young track. At about 18.5 NM north-east of Rugby, the aircraft turned right and initially tracked about 280° before turning left to track direct to Young. When queried by FIS at 1836, the pilot amended the estimate for his arrival at Young to 1838. At 1842, after prompting from FIS, the pilot reported at Young that he was commencing an NDB approach, and would call again on the hour or in the circuit. Shortly after 1845 witnesses at Young aerodrome saw the lights of an aircraft, which they believed to be VH-NDU, pass low overhead after approaching from the east. Some minutes later the same aircraft was seen to pass over the aerodrome from the opposite direction and appear to climb away towards the east. On both occasions the runway and aerodrome lights were not illuminated, although the aerodrome was equipped with PAL and it was the responsibility of the pilot-in-command to activate it. At 1850 FIS advised VH-NDU of the proximity of Cessna 310 aircraft, VH-XMA, which was estimating arrival at Young at 1900. VH-XMA subsequently reported holding in visual conditions at about 8 NM north of Young. The pilot of VH-NDU reported at 1903 that he was on another overshoot at Young, about to commence another approach, and would report again at 1915. FIS provided additional traffic on Piper PA31 aircraft, VH-XML, which was also estimating Young at 1915. At about this time witnesses reported seeing the runway lights illuminate. VH-XMA then proceeded to Young and landed on runway 01 at about 1912. At 1916 VH-NDU reported in the Young circuit area and cancelled SARWATCH. A pilot witness said that the aircraft passed over the northern end of the aerodrome from a westerly direction before turning right and taking up a heading consistent with a right downwind leg for a landing on runway 01. The aircraft was then seen to turn right and pass to the south of the aerodrome before entering what appeared to be a right downwind leg for runway 19. When abeam the aerodrome the aircraft again turned right and overflew the aerodrome to enter a second right downwind leg for runway 01. Another witness thought the aircraft (VH-NDU) was significantly lower than another aircraft approaching from the east (VH-XML). Shortly after VH-NDU turned onto an apparent base leg the navigation lights were lost to sight. Almost immediately a fireball was observed, consistent with the final position of the aircraft (see figure 2). At 1918 the pilot of VH-XMA telephoned the 000 emergency services number and reported the accident to the Goulburn Ambulance Control Centre. By 1920 this information had been relayed to the Young Ambulance Service, the Young Police, and the Young SES. An off-duty Fire Brigade officer, who was waiting at the aerodrome, drove into Young and alerted the Fire Brigade at 1930. The emergency services initially travelled to Young Aerodrome but were unable to gain immediate access to the accident site, which was located on a hill some 2.2 km to the south-south-east of the aerodrome, in an area remote from roads and lighting. Access was finally gained from a road located south of the accident site. An ambulance reached the aircraft wreckage at 1952 and the crew were able to rescue and resuscitate the only survivor, who was critically injured, and transport her to the Young Hospital. She died at Camperdown Children’s Hospital at 0510 the next morning.", "probable_cause": "Significant factors\r\n1. The cloudbase in the Young circling area was below the minimum circling altitude, associated with dark night conditions and limited ground lighting.\r\n2. The workload of the pilot-in-command was substantially increased by the effects of aircraft equipment deficiencies, with a possible consequent degrading of his performance as a result of skill fatigue.\r\n3. The instrument approach and landing charts did not provide the flight crew with terrain information adequate for the assessment of obstacle clearance during a circling approach.\r\n4. The Monarch operations manual did not provide the flight crew with guidance or procedures for the safe avoidance of terrain at Young during a night-circling approach.\r\n5. The aircraft descended below the minimum circling altitude without adequate monitoring of obstacle clearance by the crew.\r\n6. The visual cues available to the flight crew were insufficient as a sole source of height judgement.\r\n7. There were organisational deficiencies in the management and operation of RPT services by Monarch.\r\n8. There were organisational deficiencies in the safety regulation of Monarch RPT operations by the CAA."}