{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-trislander-iii-1-hale", "date": "Feb 9, 1987 at 0906 LT", "type": "Britten-Norman Trislander", "operator": "Aviation%20West", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Liverpool – Douglas", "msn": "262", "yom": 1971, "flight_number": null, "city": "Hale", "zone": "Cheshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1800, "captain_hours_type": 130, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was engaged upon a contracted freight (mail) flight, from Liverpool to the Isle of Man, U.K, and was planned to depart Liverpool at 07:29 hrs. Prior to departure the fuel gauges indicated between 80 and 85 Imperial Gallons (IG). As the required fuel for the planned flight was 82 IG, the aircraft was not refuelled. After an uneventful flight, made a radar approach to runway 09 at the Ronaldsway-Isle of Man Airport. Having failed to see the runway by decision height, 460 feet, the commander carried out a go-around procedure and returned to the VOR approach beacon before departing on course to the selected diversion. Considering the wind, the pilot made a return to Liverpool (86 nm) instead of the planned diversion airfield of to Valley RAF Station (51 nm). When abeam the Wallasey VOR, 15 nm from Liverpool airport, the aircraft was positioned, by radar, downwind for an approach to runway 27. As the aircraft turned onto the final approach path, the right engine lost power but. The pilot did not feather the propeller, in the belief that the engine was still producing some power. As the rate of descent increased, he applied full throttle to all three engines but, despite this and the selection of the speed necessary to achieve the optimum climb rate, the aircraft continued to descend at a rate which made a landing considerably short of the runway inevitable. The commander made a truncated MAYDAY call and firmly placed the aircraft in a convenient open field below and slightly to the north of the normal approach path. The accident site was a low lying field of winter crop that was subject to tidal flooding. Approximately halfway across the field there was a 2.4 metre wide by 2.4 metre deep drainage ditch, which ran at 45 degrees to the direction of travel of the aircraft. The initial touchdown was some 76 metres to the east of the ditch, on a heading of 270 degrees magnetic. Just after initial touchdown, the right main landing gear failed rearwards and the aircraft continued on its nose and left landing gear, until a collision with an embankment bordering the ditch caused the remaining landing gears to collapse. The aircraft finally came to rest with its fuselage in the drainage ditch, supported by the wings which were resting on the embankments either side.", "probable_cause": "Examination of the flight profile, and associated flight times, showed that all the fuel aboard the aircraft would have been consumed and, therefore, the likely reason for the lack of response to full throttle, when the right engine failed, was a previous or simultaneous failure of the centre engine due to fuel starvation."}