{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-76td-karachi-11-killed", "date": "Nov 28, 2010 at 0145 LT", "type": "Ilyushin II-76", "operator": "Sun Way", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Karachi - Khartoum - Douala", "msn": "43452546", "yom": 1982, "flight_number": "MGC4412", "city": "Karachi-Muhammad Ali Jinnah-Quaid-e-Azam", "zone": "Sindh (سنڌ سندھ)", "country": "Pakistan", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 3, "total_fatalities": 11, "captain_hours": 7272, "captain_hours_type": 5502, "copilot_hours": 2220, "copilot_hours_type": null, "aircraft_hours": 8357, "circumstances": "On 27th November, 2010 the operating crew of mishap aircraft flew from Fujairah (UAE) to JIAP, Karachi (Pakistan) at 1000 UTC. The load onboard was weighing 9 tons (Packaged Boeing\r\n747 engine). The aircraft had flown to Fujairah airport from Kandahar. According to the provided information on the 27-11-2010 the crew comprising Aircraft Commander, Second Pilot, Navigator, Flight Engineer, Flight Radio Operator, and Flight Operator flew from Fujairah (UAE) to JIAP Karachi. After landing the crew members were shifted to “Regent Plaza” hotel in Karachi. The stay of crew in the hotel was not less than 8 hours. The aircraft was refuelled at JIAP, Karachi and total fuel onboard was 74 tons. A cargo load of 30.5 tons was also loaded after refuelling the aircraft. The aircraft mass was 197 tons with its CG at 30% Mean Aerodynamic Chord (MAC) before undertaking the mishap flight. The aircraft was scheduled for departure from JIAP, Karachi at 2025 UTC 28th November, 2010) on route “Karachi – Khartoum – Douala, Cameroon to deliver humanitarian aid (tents). The crew arrived at airport around 1900 UTC. The weather conditions were satisfactory. The weather details are mentioned in this report at Para 1.7. After starting engines the crew taxied the plane to Runway 25L and reported to the air traffic controller that the plane would take off in 3 minutes and the aircraft took off at 2048 UTC. According to the radar data the aircraft ascended to 600 feet, started descending and then disappeared from the radar screen. The air traffic controller did not receive any information from the crew members about emergency conditions onboard. The aircraft crashed at about 2050 UTC on a bearing of 070 degree and approximately 02 NM from JIAP, Karachi at geographical location N24°53.651’, E 067°06.406’. ", "probable_cause": "The cause of the occurrence was uncontained failure of the 2nd stage disk of LP compressor of Engine # 4 due to fatigue fracture which resulted in in-flight fire and damage to adjacent areas of right wing / flaps to an extent that flight could not be sustained.\r\nThe use of mishap engine beyond its manufacturer’s assigned life without assessment and life enhancement by the manufacturer was the cause of its uncontained fatigue failure."}