{"url": "https://www.baaa-acro.com/crash/crash-martin-pbm-5a-mariner-atlantic-ocean-36-killed", "date": "Nov 9, 1958 at 1321 LT", "type": "Martin PBM Mariner", "operator": "Aero Topografica", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Lisbon – Funchal", "msn": "45409", "yom": 1944, "flight_number": null, "city": "Atlantic Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 30, "pax_fatalities": 30, "other_fatalities": 0, "total_fatalities": 36, "captain_hours": 10671, "captain_hours_type": null, "copilot_hours": 3367, "copilot_hours_type": 890, "aircraft_hours": 2240, "circumstances": "The airplane was schedule to leave Lisbon at 0700LT but the departure was postponed to midday due to poor weather conditions. It finally left Lisbon-Cabo Ruivo Seaplane Base at 1223LT bound for Funchal, Madeira Island. Shortly after takeoff, the crew was cleared to climb to 8,000 feet and 17 minutes later, the pilot requested the permission to descent to 6,000 feet. At 1321LT, the captain was able to send a brief message 'QUG emergency'. As nothing further was heard from the crew, SAR operations were conducted but eventually suspended few days later as no trace of the aircraft nor the 36 occupants was found. The brevity of the message \"QUG EMERGENCY\" in which QUG means in the international code 'I am forced to alight immediately' and the absence of an answer to questions, show that there was an abnormal situation on board. The signal \"QUG\" may also mean, \"I will be forced to alight at. . . ' when followed by the indication of the place where the alighting will probably take place.", "probable_cause": "Due to lack of evidence, the exact cause of the accident could not be determined with certainty. However, the assumption that the accident may have been the result of an explosion or a major technical issue was not ruled out. "}