{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-alpine-5-killed", "date": "Jul 4, 2010 at 0015 LT", "type": "Cessna 421B Golden Eagle II", "operator": "O%27Hara%20Flying%20Service", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Alpine - Odessa", "msn": "421B-0473", "yom": 1973, "flight_number": null, "city": "Alpine-Casparis", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 1650, "captain_hours_type": 160, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2302, "circumstances": "The airplane impacted terrain shortly after takeoff. The wreckage distribution was consistent with a high airspeed, low angle-of-attack impact. Examination of the ground scars and wreckage indicated that the landing gear was down, the flaps were down, and the engines were operating at a high power setting at the time of impact. An examination of the airframe, engines, and related systems revealed no mechanical malfunctions or failures. According to the owner’s manual for the airplane, the flaps should have been retracted and the landing gear should have been brought up as soon as a climb profile was established. Based upon the location of the wreckage, the direction of the impact, and the location of the airport, it is likely that the airplane crashed within one or two minutes after takeoff. The extended landing gear and flaps degraded the climb performance of the airplane. The pilot held an airline transport pilot certificate and had recent night flight experience. Toxicological results were positive for azacyclonol and ibuprofen but were not at levels that would have affected his performance. According to family members, the pilot normally slept from 2230 or 2300 to 0700; the accident occurred at 0015. Although the investigation was unable to determine how long the pilot had been awake before the accident or his sleep schedule in the three days prior to the accident, it is possible that the pilot was fatigued, as the accident occurred at a time when the pilot was normally asleep. The company did not have, and was not required to have guidance or a policy addressing fatigue management.\n", "probable_cause": "The degraded performance of the airplane due to the pilot not properly setting the flaps and retracting the landing gear after takeoff. Contributing to the accident was the pilot’s fatigue.\n"}