{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-vestmannaeyjar-2-killed-0", "date": "Mar 6, 2001 at 0856 LT", "type": "Rockwell Shrike Commander 500", "operator": "Gwen Bloomingdale", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Keflavik – Stornoway", "msn": "500-3173", "yom": 1973, "flight_number": null, "city": "Vestmannaeyjar", "zone": "Southern Region (Suðurland)", "country": "Iceland", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2456, "captain_hours_type": 120, "copilot_hours": 704, "copilot_hours_type": 13, "aircraft_hours": null, "circumstances": "Two private pilots, citizens of the United States, who intended to participate in the “London - Sydney Air Race” set to take place 11 March to 7 April 2001, were operating the private aircraft, N272BB. The flight originated at Cape Cod in the United States and the aircraft was to be flown via Greenland, Iceland and Scotland to London, England, where the air-race was to commence. The aircraft arrived at Narsarsuaq, Greenland, on 4 March 2001 at 01:35 hrs. The next morning the pilots requested fuel and according to a statement by the Narsarsuaq airport personnel, 338 litres of LL100 avgas were put on the main fuel tanks that were filled. No fuel was put on the aircraft internal ferry-tank. The pilots received weather briefing and en-route information before departure and there was no anomalies noted by the airport personnel. The flight was planned at Fl-130 from Narsarsuaq, over the Greenland ice cap, to 62°N 040°W and then at FL110 to the border between the Greenland Soendrestrom Flight Information Region and the Reykjavik Flight Information Region. The takeoff from Narsarsuaq airport was at 14:29 hrs. The flight from Narsarsuaq Airport to Iceland was uneventful and the aircraft landed at Keflavik Airport Iceland at 18:59 hrs. Initially the pilots planned to continue the flight from Iceland that night but after studying the weather forecast they decided to stay overnight. At 19:50 hrs 447 litres of LL100 was put in the aircraft main tanks and the aircraft was then placed in a hangar. In the morning of 6 March 2001 the pilots arrived at Flight Operations Office at Keflavik Airport. The pilots were provided with current weather information and weather maps for the planned route and flight planning preparations for the flight to Stornoway, Scotland and onwards to London, England was completed. The plan was from Keflavik Airport (KEF) VOR, direct to ALDAN reporting point (62° 58' 49'' N 018° 45' 50'' W), direct to 61° N 012° 34' W, direct to 60° N 010° W, and direct to Stornoway. The flight level was 150 and the True Air Speed (TAS) was 145 kts. Prestwick in Scotland was filed as the alternate airport. The instrument flight plan was filed with the Air Traffic Control Centre in Reykjavik. The estimated flying time from KEF-VOR to ALDAN was 0:30 hrs, to 61° N 012° 34' W total 2:00 hrs and 02:30 hrs to 60° N 010° W. The planned time from Keflavik Airport to Stornoway was 4:00 hrs or the estimated time of arrival was at 12:19 hrs. The fuel endurance was given 10 hrs. The aircraft was cleared by ATC in accordance with the submitted instrument flight plan and assigned transponder code was 3575. The aircraft taxied out from the ramp at 08:08 hrs towards runway 11 and the take-off was at 08:19 hrs. After take-off the communication with Keflavik Approach Control was normal. The flight was then changed over to Reykjavik Area Control Centre (OACC) at 08:46 hrs and normal communication was established. The track to Aldan will take the aircraft overhead VM-NDB, 53 NM from KEF VOR, and then to Aldan, 120 NM from KEF VOR. Error was on the ATC slip indicating 30 minutes to Aldan. The controller changed that to 1:01, or estimate for Aldan at 09:20. The last communication with the crew took place at 08:49:50 when the aircraft was climbing slowly through about 14400 feet towards the planned cruising level, FL150. At 09:24:55 hrs Reykjavik OACC called N272BB in order to confirm the position, but there was no answer and repeated calls were in vain. The Shanwick Air Traffic Control Centre was notified at 09:29:15 hrs of the N272BB estimates and again at 09:38:01 hrs that ATC had lost contact with the aircraft. A subsequent replay of the ATC radar data showed that at 08:56 hrs the aircrafts target was lost from radar. The last plotted position was at 63° 32' 04'' N 020° 39' 36'' W, or about 8 NM from the south coast of Iceland. At 12:12 hrs a decision was taken to initiate a search in the area by available ships and fishing vessels in the area. An Icelandic Coast Guard helicopter was launched from Reykjavik into the search area at 12:32 hrs.  At 13:49 hrs a debris from the missing aircraft and human remains were subsequently found floating on the ocean in a line spread north-westwards over a distance of about 5 NM from the point the target disappeared from radar. Both female pilots were killed.", "probable_cause": "The following findings were identified:\r\n- The aircraft was operated in overweight conditions,\r\n- The flight departed Iceland into unfavourable weather conditions,\r\n- The aircraft was climbing in icing conditions prior to it went out of control,\r\n- The reason for the departure from a normal flight could not be positively determined,\r\n- The aircraft went into an uncontrolled descent, followed by an overstress and possible in-flight break-up during an attempted recovery."}