{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-agua-dulce-3-killed", "date": "Oct 20, 2002 at 1300 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "George W. Willard", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Agua Dulce – Bullhead City", "msn": "61-0652-7962140", "yom": 1979, "flight_number": null, "city": "Agua Dulce", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 685, "captain_hours_type": 185, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14235, "circumstances": "The airplane crashed into rising terrain after departure from an uncontrolled public airport. The runway used by the pilot is 4,600 feet long and has a 1.8 percent upward gradient. The density altitude was 4,937 feet msl, and a slight quartering tailwind existed at the time. The pilot held in position, powered up the engines, and started his departure. The airplane was observed using most of the runway length before rotation and then it assumed a higher than normal pitch attitude in the initial climb. Witnesses watched the airplane turn left following the route of a canyon and into rising terrain. The reciprocal runway departs towards decreasing elevations. In the area of the crash, two witnesses reported the airplane was at a low altitude, nose high, and wallowing just before it descended into a drainage area 0.69 miles from the runway. Post accident examination of the engines revealed worn camshaft lobes and tappets, which would negatively affect the ability of the engines to produce full rated power. One engine exhibited severe rust on the entire crankshaft. The accident site was located in a canyon, and the wreckage and ground scars was confined to an area about the diameter of the wing span. Major portions of the airframe and most of the engine accessories were consumed by a post accident fire. Examination of the wreckage established that all major components of the airframe and powerplants were at the site. ", "probable_cause": "The pilot's failure to attain and maintain a sufficient airspeed, which led to an inadvertent stall mush. The pilot's selection of the wrong runway for departure, considering the uphill gradient, the wind direction, and a takeoff path into rising terrain are also causal. The high density altitude and the degraded internal condition of the engines were factors."}