{"url": "https://www.baaa-acro.com/crash/crash-antonov-124-100-torino-4-killed", "date": "Oct 8, 1996 at 1050 LT", "type": "Antonov AN-124", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "City", "schedule": "Moscow - Torino - Abu Dhabi - Bandar Seri Begawan", "msn": "977305591", "yom": 1993, "flight_number": "SU9981", "city": "Torino-Caselle", "zone": "Piedmont", "country": "Italy", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 19, "pax_fatalities": 0, "other_fatalities": 2, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": 431, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Moscow-Chkalovsky Airport bound for Torino, carrying 19 passengers and four crew members. The aircraft should be loaded with Ferrari cars to be delivered in Bandar Seri Begawan, Brunei, following a fuel stop at Abu Dhabi Airport. While descending to Torino-Caselle Airport, the crew was informed about the weather conditions at destination: wind variable at 3 knots, visibility 2,000 metres, RVR runway 36 more than 1,500 metres, light rain, scattered at 1,500 feet, scattered at 3,500 feet, broken at 7,000 feet, OAT and dew point 13°C, QNH 1012. On final approach to runway 36, the crew was unable to establish a visual contact with the runway and the captain decided to initiate a go-around procedure. Unfortunately, this decision was taken too late. While climbing, the aircraft struck trees and crashed onto houses located in the village of San Francesco al Campo, about one km from the runway end. The aircraft, a house and a barn were destroyed. Both pilots, two people on the ground and 20 cows in the barn were killed. ", "probable_cause": "The following findings were reported:\r\n- Weather conditions were marginal, \r\n- At the time of the accident, the runway length was 2,350 metres instead of 3,300 metres due to work in progress,\r\n- The ILS CAT III system was inoperative during work in progress, \r\n- The pilots were warned that the crew of an aircraft that landed on the same runway 36 about 11 minutes earlier established a visual contact with the runway at an altitude of 200 feet only, \r\n- The crew continued the approach below MDA without establishing visual contact with the runway, \r\n- Poor crew coordination, \r\n- Poor approach planning, \r\n- The crew failed to follow the approach checklist,\r\n- The crew did not divide up the tasks in a correct manner,\r\n- The crew did not prepare for a possible go-around procedure,\r\n- The decision of the captain to initiate a go-around procedure was taken too late, \r\n- The crew encountered engine trouble after the power levers were suddenly moved,\r\n- The relative low experience of the captain on this type of aircraft."}