{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90gt-king-air-morgantown-1-killed", "date": "Jun 22, 2012 at 1001 LT", "type": "Beechcraft 90 King Air", "operator": "OZ Gas Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Plain, Valley", "schedule": "Tidioute - Farmington - Morgantown", "msn": "LJ-1775", "yom": 2008, "flight_number": null, "city": "Morgantown", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 22000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1439, "circumstances": "The airplane, operated by Oz Gas Aviation LLC, was substantially damaged when it struck a communications tower near Morgantown, West Virginia. The certificated airline transport pilot was fatally injured. No flight plan had been filed for the positioning flight from Nemacolin Airport (PA88), Farmington, Pennsylvania, to Morgantown Municipal Airport (MGW), Morgantown, West Virginia conducted under Title14 Code of Federal Regulations (CFR) Part 91. At 0924 on the morning of the accident, the airplane departed from Rigrtona Airport (13PA), Tidioute, Pennsylvania for PA88 with the pilot and three passengers onboard. The airplane landed on runway 23 at PA88 at 0944. The pilot then parked the airplane; shutdown both engines, and deplaned the three passengers. He advised them that he would be back on the following day to pick them up. After the passengers got on a shuttle bus for the Nemacolin Woodlands Resort, the pilot started the engines. He idled for approximately 2 minutes, and then back taxied on runway 23 for takeoff. At 0957, he departed from runway 23 for the approximately 19 nautical mile positioning flight to MGW, where he was going to refuel and spend the night. After departure from PA88, the airplane climbed to 3,100 feet above mean sea level (msl) on an approximately direct heading for MGW. The pilot then contacted Clarksburg Approach Control and was given a discrete code of 0130. When the airplane was approximately nine miles east of the Morgantown airport, the air traffic controller advised the pilot that he had \"radar contact\" with him. The airplane then descended to 3,000 feet, and approximately one minute later struck the communications tower on an approximate magnetic heading of 240 degrees. According to a witness who was cutting timber across the road from where the accident occurred; the weather was cloudy with lighting and thunder, and it had just started \"sprinkling\". He then heard a loud \"bang\", turned, and observed the airplane descending upside down, and then impact. About 20 minutes later it stopped \"sprinkling\". He advised that he could still see the top of the tower when it was \"sprinkling\".", "probable_cause": "The pilot's inadequate preflight route planning and in-flight route and altitude selection, which resulted in an in-flight collision with a communications tower in possible instrument\r\nmeteorological conditions. Contributing to the accident were the pilot's improper use of the enhanced ground proximity warning system's terrain inhibit switch and the air traffic controller's failure to issue a safety alert regarding the proximity of the tower.\n"}