{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-63cf-new-york-11-killed", "date": "Sep 8, 1970 at 1606 LT", "type": "Douglas DC-8", "operator": "Trans%20International%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Washington DC – London", "msn": "45951/414", "yom": 1968, "flight_number": "TV863", "city": "New York-JFK", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 11, "crew_fatalities": 11, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 22300, "captain_hours_type": 7100, "copilot_hours": 15775, "copilot_hours_type": 4750, "aircraft_hours": 7878, "circumstances": "Approximately 1,500 feet from the initiation of the takeoff roll, the aircraft was observed rotating to an excessively nose-high attitude. The aircraft became airborne about 2,800 feet down the runway after which it continued to rotate slowly upward to an attitude estimated to be between 60° and 90° above the horizontal, at an altitude estimated to be between  300 and 500 feet above the ground. The aircraft rolled about 20° to the right, rolled back to the left until it reached approximately a vertical angle of bank, and then fell to the ground in that attitude. The aircraft was destroyed by impact forces and post impact fire. All 11 crew members, the only occupants of the aircraft, died in the accident. ", "probable_cause": "The Board determined that the probable cause of this accident was a loss of pitch control caused by the entrapment of a pointed, asphalt-covered object between the leading edge of the right elevator and the right horizontal spar web access door in the aft part of the stabilizer. The restriction to elevator movement, caused by a highly unusual and unknown condition, was not detected by the crew in time to reject the takeoff successfully. However, an apparent lack of crew responsiveness to a highly unusual emergency situation, coupled with the captain's failure to monitor adequately the takeoff, contributed to the failure to reject the takeoff. "}