{"url": "https://www.baaa-acro.com/crash/crash-learjet-35-schenectady", "date": "Jan 4, 2001 at 1547 LT", "type": "Learjet 35", "operator": "Air Response North", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Schenectady – New York-LaGuardia", "msn": "35-018", "yom": 1975, "flight_number": null, "city": "Schenectady", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2570, "captain_hours_type": 1065, "copilot_hours": 1600, "copilot_hours_type": 497, "aircraft_hours": 16302, "circumstances": "The captain stated that prior to departure the flight controls were tested, with no abnormalities noted, and the takeoff trim was set to the \"middle of the takeoff range,\" without referring to any available pitch trim charts. During the takeoff roll, the pilot attempted to rotate the airplane twice, and then aborted the takeoff halfway down the 4,840 foot long runway, because the controls \"didn't feel right.\" The airplane traveled off the departure end of the runway and through a fence, and came to rest near a road. The pilot reported no particular malfunction with the airplane. Examination of the airplane revealed that the horizontal stabilizer was positioned at -4.6 degrees, the maximum nose down limit within the takeoff range. The horizontal stabilizer trim and elevator controls were checked, and moved freely through their full ranges of travel. According to the AFM TAKEOFF TRIM C.G. FUNCTION chart, a horizontal stabilizer trim setting of -7.2 was appropriate with the calculated C.G. of 20% MAC. Additionally, Learjet certification testing data stated that the pull force required at a trim setting of -6.0 degrees, the \"middle of the takeoff range\", was 33 pounds. With the trim set at the full nose down position (-1.7 degrees), 132 pounds of force was required.", "probable_cause": "The pilot's improper trim setting, which resulted in a runway overrun and impact with a fence."}