{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-5a-galaxy-saigon-155-killed", "date": "Apr 4, 1975 at 1630 LT", "type": "Lockheed C-5 Galaxy", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Humanitarian", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Saigon - Clark - Los Angeles", "msn": "500-0021", "yom": 1970, "flight_number": null, "city": "Saigon", "zone": "Thành phố Hồ Chí Minh City District", "country": "Vietnam", "region": "Asia", "crew_on_board": 16, "crew_fatalities": 5, "pax_on_board": 314, "pax_fatalities": 150, "other_fatalities": 0, "total_fatalities": 155, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane was engaged in a humanitarian flight, taking part to the 'Operation Babylift', a mission consisting to bring Vietnamese orphans back to the US in the few remaining days before the Republic of Vietnam fell. At 1603LT, the airplane departed Saigon-Tan Son Nhat Airport bound to the east. Twelve minutes later, while cruising at an altitude of 23,000 feet over the South China Sea, a technical issue occurred on the rear access ramp doors followed by a rapid decompression of the cabin. A crew member fell out of the airplane and shortly later, the access ramp door detached and fell into sea as well. The captain contacted ATC, declared an emergency and was cleared to return to Saigon Airport. At that time, two of the four hydraulic systems were out of order and control and trim cables to the rudder and elevators were severed, leaving only one aileron and wing spoilers operating. Nevertheless, the crew was able to descend to runway 25L when the rate of descent increased to 4,000 feet per minute. The airplane struck the ground a first time at a speed of 250 knots about 4 km short of runway 25L, bounced for three seconds and then crashed 500 meters further in a rice paddy field. The aircraft disintegrated on impact and debris scattered on a wide area. There were on board 149 orphans, 10 members of a medical team, 155 military personnels and 16 crew members. It was reported that 141 orphans were killed as well as six soldiers, five crew members and three of the medical team. The United States Navy amphibious cargo ship USS Durham, frigate USS Reasoner and command ship USS Blue Ridge were assigned to search for the flight data recorder in the South China Sea. The recorder was found and US Navy ships and helicopters also discovered debris from the doors in the South China Sea as well as the body of a crew member.", "probable_cause": "When the rear doors were eventually recovered from the sea, investigation determined that some of the locks had not engaged properly. Maintenance records showed that locks had been cannibalized for spares, then subsequently improperly refitted so that not all the door locks were engaging correctly. Accounts also indicated the initial maintenance inspection noticed 5 of the 7 locks were not operating and failed the aircraft for flight. With external organizational pressure to get the flight airborne, a second off-shift maintenance team was called in. They subsequently missed the locks during inspection and the aircraft was cleared for flight. Furthermore, the flight crew confirmed that they had encountered difficulty closing the doors before takeoff. As the air pressure differential increased with altitude, the few locks that were working correctly were unable to bear the load, and the door failed."}