{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-8kn-rostov-don-62-killed", "date": "Mar 19, 2016 at 0342 LT", "type": "Boeing 737-800", "operator": "FlyDubai.png", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dubai - Rostov-on-Don", "msn": "40241/3517", "yom": 2010, "flight_number": "FZ981", "city": "Rostov-on-Don", "zone": "Rostov oblast", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 55, "pax_fatalities": 55, "other_fatalities": 0, "total_fatalities": 62, "captain_hours": 5961, "captain_hours_type": 4682, "copilot_hours": 5767, "copilot_hours_type": 1100, "aircraft_hours": 21257, "circumstances": "At the overnight into 19.03.2016 the Flydubai airline flight crew, consisting of the PIC and F/O, was performing the round-trip international scheduled passenger flight FDB 981/982 on route\r\nDubai (OMDB) – Rostov-on-Don (URRR) – Dubai (OMDB) on the B737-8KN A6-FDN aircraft. At 18:37 on 18.03.2016 the aircraft took off from the Dubai airport. The flight had been performed in IFR. At 18:59:30 FL360 was reached. The further flight has been performed on this very FL. The descent from FL has been initiated at 22:17. Before starting the descent, the crew contacted the ATC on the Rostov-on-Don airport actual weather and the active RWY data. In progress of the glide path descent to perform landing with magnetic heading 218° (RWY22) the crew relayed the presence of “windshear” on final to the ATC (as per the aboard windshear warning system activation). At 22:42:05 from the altitude of 1080 ft (330 m) above runway level performed go-around. Further on the flight was proceeded at the holding area, first on FL080, then on FL150. At 00:23 on 19.03.2016, the crew requested descent for another approach. It was an ILS approach. The A/P was disengaged by the crew at the altitude of 2165 ft QNH (575 m QFE), and the A/T at the altitude of 1960 ft QNH (510 m QFE). . In the progress of another approach the crew made the decision to initiate go-around and at 00:40:50, from the altitude of 830 ft (253 m) above the runway level, started the maneuver. After the reach of the altitude of 3350 ft (1020 m) above the runway level the aircraft transitioned to a steep descent and at 00:41:49 impacted the ground (it collided the surface of the artificial runway at the distance of about 120 m off the RWY22 threshold) with the nose-down pitch of about 50⁰ and IAS about 340 kt (630 km/h). The aircraft disintegrated on impact and all 62 occupants were killed. ", "probable_cause": "The fatal air accident to the Boeing 737-8KN A6-FDN aircraft occurred during the second go around, due to an incorrect aircraft configuration and crew piloting, the subsequent loss of PIC’s situational awareness in nighttime in IMC. This resulted in a loss of control of the aircraft and its impact with the ground. The accident is classified as Loss of Control In-Flight (LOC-I) occurrence.\r\nMost probably, the contributing factors to the accident were:\r\n- The presence of turbulence and gusty wind with the parameters, classified as a moderate to-strong \"windshear\" that resulted in the need to perform two go-arounds;\r\n- The lack of psychological readiness (not go-around minded) of the PIC to perform the second go-around as he had the dominant mindset on the landing performance exactly at the destination aerodrome, having formed out of the \"emotional distress\" after the first unsuccessful approach (despite the RWY had been in sight and the aircraft stabilized on the glide path, the PIC had been forced to initiate go-around due to the windshear warning activation), concern on the potential exceedance of the duty time to perform the return flight and the recommendation of the airline on the priority of landing at the destination aerodrome;\r\n- The loss of the PIC’s leadership in the crew after the initiation of go-around and his \"confusion\" that led to the impossibility of the on-time transition of the flight mental mode from \"approach with landing\" into \"go-around\";\r\n- The absence of the instructions of the maneuver type specification at the go-around callout in the aircraft manufacturer documentation and the airline OM;\r\n- The crew’s uncoordinated actions during the second go-around: on the low weight aircraft the crew was performing the standard go-around procedure (with the retraction of landing gear and flaps), but with the maximum available thrust, consistent with the Windshear Escape Maneuver procedure that led to the generation of the substantial excessive nose-up moment and significant (up to 50 lb/23 kg) \"pushing\" forces on the control column to counteract it;\r\n- The failure of the PIC within a long time to create the pitch, required to perform go around and maintain the required climb profile while piloting aircraft unbalanced in forces;\r\n- The PIC’s insufficient knowledge and skills on the stabilizer manual trim operation, which led to the long-time (for 12 sec) continuous stabilizer nose-down trim with the subsequent substantial imbalance of the aircraft and its upset encounter with the generation of the negative G, which the crew had not been prepared to. The potential impact of the somatogravic \"pitch-up illusion\" on the PIC might have contributed to the long keeping the stabilizer trim switches pressed;\r\n- The psychological incapacitation of the PIC that resulted in his total spatial disorientation, did not allow him to respond to the correct prompts of the F/O;\r\n- The absence of the criteria of the psychological incapacitation in the airline OM, which prevented the F/O from the in-time recognition of the situation and undertaking more decisive actions;\r\n- The possible operational tiredness of the crew: by the time of the accident the crew had been proceeding the flight for 6 hours, of which 2 hours under intense workload that implied the need to make non-standard decisions; in this context the fatal accident occurred at the worst possible time in terms of the circadian rhythms, when the human performance is severely degraded and is at its lower level along with the increase of the risk of errors.\r\nThe lack of the objective information on the HUD operation (there were no flight tests of the unit carried out into the entire range of the operational G, including the negative ones; the impossibility to reproduce the real HUD readings in the progress of the accident flight, that is the image the pilot was watching with the consideration of his posture in the seat trough the stream video or at the FFS) did not allow making conclusion on its possible impact on the flight outcome. At the same time the investigation team is of the opinion that the specific features of the HUD indication and display in conditions existed during final phase of the accident flight (severe turbulence, the aircraft upset encounter with the resulting negative G, the significant difference between the actual and the target flight path) that generally do not occur under conditions of the standard simulator sessions, could have affected the situational awareness of the PIC, having been in the highly stressed state."}