{"url": "https://www.baaa-acro.com/crash/crash-lockheed-p2v-5f-neptune-white-sands-missile-range-2-killed", "date": "Sep 10, 1987 at 1530 LT", "type": "Lockheed P-2 Neptune", "operator": "Black Hills Aviation", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Desert", "schedule": null, "msn": "426-5315", "yom": 1954, "flight_number": null, "city": "White Sands Missile Range", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At approximately 3:00 p.m. on September 10, 1987, the Army called Black Hills Aviation to suppress a fire started by a FAADS missile. The missile was fired more than two hours before the crash. A P2V aircraft, Forest Service Number N96271 [\"Tanker 07\"], owned by Black Hills, was dispatched in response to the request for aerial fire suppression. Tanker 07 was piloted by Nathan Kolb and co-piloted by Woodard Miller, employees of Black Hills Aviation who were not Department of Defense personnel. Tanker 07 obtained authorization to enter the missile range's airspace from the missile range air controller. During the flight, Tanker 07 crashed on the missile range and both pilots were killed. The crash site was located approximately fifteen miles into the interior of the missile range, and was inside the testing site for the FAADS Project. ", "probable_cause": "Following the crash, an attorney from the Army Judge Advocate General's [JAG] Office at the missile range ordered markers to be placed at the crash site, and aerial photographs were taken. At that time, the Army JAG Officer anticipated litigation regarding the crash. Personnel at the missile range contacted the National Transportation Safety Board [NTSB] and the Army Safety Center in Fort Rucker, Alabama, and inquired whether either of these entities wished to investigate the crash. The NTSB replied that it was not interested in investigating, but would do so if specifically requested to do so by the missile range. Neither entity actually investigated the crash. Colonel Gary Epperson of the missile range was appointed to conduct an Army Regulation 15-6 Collateral Investigation into the facts and circumstances of the crash. The scope of the AR 15-6 investigation encompassed only the activities of the Army in regard to the crash of Tanker 07, and did not seek to determine the precise cause of the crash. Colonel Epperson's investigation consisted of viewing the crash scene, meeting with eyewitnesses to the crash, and asking for written statements."}