{"url": "https://www.baaa-acro.com/crash/crash-vickers-290-wellington-i-brandon-1-killed", "date": "Aug 29, 1939 at 1400 LT", "type": "Vickers 290 Wellington I", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Mildenhall - Mildenhall", "msn": null, "yom": null, "flight_number": null, "city": "Brandon", "zone": "Suffolk", "country": "United Kingdom", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after take off from RAF Mildenhall, while climbing, the radio operator informed ATC that an engine exploded. The Captain decided to make a turn back to the airport via a circuit to the north when the situation became critical. He attempted an emergency landing in Brandon, some 13 km northeast of the airbase, when the aircraft hit trees and crashed on a barn. A crew member was killed while all five other occupants were injured. \r\nCrew (149th Squadron):\r\nF/O Francis William Scott Turner, pilot,\r\nP/O Thomas Watson, pilot,\r\nSgt Anthony Frederick Adrian Freeman, observer, †\r\nSgt Horace James Weller, copilot,\r\nAC2 John Gerard Hoey, wireless operator, \r\nAC2 Cecil George Barker, air gunner. \r\nSource: http://www.rcawsey.co.uk/Acc1939.htm\n\r\nThanks to Anthony Frederick Adrian Freeman and Peter Cannings for the following testimony:\r\nThe pilot, Francis William Scott-Turner, told the Coroner that just before 5 pm on Tuesday 29th August the bomber took off to participate in a search for a missing aircraft. Everything was going well and then about an hour into the flight the port side engine caught fire and he carried out the procedure for ‘Fire In The Air’ and prepared the crew for a crash landing, which was probably about two or three miles north-east of Brandon. Sergeant Weller was instructed to bring Pilot Officer Watson out of the nose of the aircraft as soon as possible and bring him toamidships. The rest of the crew were told to sit own and hang on and then the plane came down among some trees. “I picked up Pilot Officer Watson and told him to get out as quickly as possible. I looked out and then was told that Freeman was still in the machine. Walking across the wing and getting back into the machine again through a hatch. I found Freeman on his knees against a step formed by a bomb micelle. We did not think it was advisable to move him until medical assistance arrived. The fire had gone out by this time.” Answering the coroner, he said that Freeman should have stayed where he was because it was the safest place in the machine and he must have moved away from it because of the location of his body. The deceased’s father asked if his son had been thrown from his seat, but the witness said that had not been the case because it looked like he had lowered the rear of his seat in order to evacuate from his position. A member of the jury asked if he was attempting to bail out but the witness said the aircraft was too low.\r\nThe co-pilot, Sergeant Weller, told the inquest of how the port engine had developed oil failure near North Walsham and they maintained a height off 600 or 700 feet on the starboard engine alone. When he saw they were low enough to see trees he sat down and hung on to the nearest spar. Weller had seen Freeman in the tail when he was talking to A/C Hoey and he presumed he was still sat there at this time. After the crash he left the aircraft and went straight away to the aircraft’s tail to assist Freeman but when he looked through the rear window he could not see him. He then walked along the aircraft and caught sight of Freeman’s head resting on top of the step. The witness answered the Coroner, and said that it was possible that as soon as Freeman got out of his seat he could have been thrown forward to the front. In the tail there was a celluloid hatch that could be cut away and through the hole he could have escaped. In his opinion the tail was the safest place to be in a crash. Cecil Barker told the inquest that he had changed places with Freeman during the flight but had returned to be amidships to prepare for impact. He had caught a glimpse of Freeman who had turned to face them and assumed he was trying to get out. The Coroner replied, “There must be a tendency, particularly in the case of a young fellow like this, for him to get with someone for whom he feels will give him moral support in the time of  emergency. I can understand that and I am sure the jury does.” John Hoey told the Coroner that he had sent out a message just before the crash. Police Constable Churchyard, based in Weeting and serving in the Norfolk Constabulary, told the inquest that the aircraft had landed on top of some pine trees, at a height of about 10 feet and about 350 yards from the Brandon-Weeting road. It had cut a swathe through the trees of 30 yards by 60 yards. He had helped remove the tail of the aircraft with the crew and assisted in the removal of the deceased’s body from the machine and it was taken to Mildenhall by ambulance.\r\nAn eyewitness, Mrs Mary Jane Leonard, of Weeting, said she had looked out of her bungalow window and saw the bomber flying too low, with smoke coming from the back of it and there was a crackling noise coming from the engine. It disappeared from view and then there was the sound of a crash. She stopped a passing car and sent them to fetch the Police.\r\nDr Jenkins, a R.A.F. Medical Officer, said the deceased had suffered broken ribs and a perforated lung. The Coroner expressed hi sympathy to the dead man’s family, “I have said it before, unfortunately, that we who are not in any arm of the Service owe a great debt of gratitude to these men who take risks that we may live in peace.” The jury returned a verdict of Misadventure and the foreman said the jury felt the crew had done their very best under the circumstances. The Coroner thanked the foreman for his kind words. The deceased’s father thanked his son’s colleagues and the R.A.F. Medical Officer.", "probable_cause": null}