{"url": "https://www.baaa-acro.com/crash/crash-bac-111-525ft-stockholm", "date": "Jun 7, 1997 at 1350 LT", "type": "BAc 111", "operator": "Tarom-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bucharest - Stockholm", "msn": "256", "yom": 1977, "flight_number": "RO335", "city": "Stockholm-Arlanda", "zone": "Uppland", "country": "Sweden", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 20, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12500, "captain_hours_type": 12000, "copilot_hours": 1866, "copilot_hours_type": 50, "aircraft_hours": 23901, "circumstances": "Flight ROT 335, a BAC 111 coming from Bucharest, was about to land on runway 26 at Stockholm/Arlanda airport. The pilots had visual contact with the field and the landing was performed according to visual flying rules (VFR). The commander, who was pilot flying (PF), has stated the following. The approach was normal with occasional turbulence and wind gusts from the south. When the aircraft was on 8 nautical miles1  final, the air-traffic controller in the tower reported the wind 160°/13 knots. To begin with the aircraft was somewhat above the glide slope but was on the glide slope when it passed the threshold. The touchdown on the runway was in the normal touchdown zone on the left main gear and nose up. Shortly thereafter came a strong wind gust whereupon the right main gear touched down and the nose gear heavily hit the runway. The commander controlled the aircraft with rudder, reversed the engines and braked lightly. He did not notice anything special in the behavior of the aircraft at that point. When - after the speed had become so low that rudder steering was no longer possible - he reverted to nose wheel steering he noticed that it was not functioning. He continued the light wheel braking but could not prevent the aircraft from veering to the right. He then braked fully but the aircraft continued towards the right runway edge. It left the runway at a speed of around 60 knots out onto the grass field. The retardation was soft and the passengers disembarked through ordinary exit. The airport rescue service was speedily on the scene but no action was necessary. The accident occurred on 7 June 1997 at 1350 hours in position 5939N 1755E; 121 feet (37 m) above sea level.", "probable_cause": "The accident was caused by the collapse of the nose gear as a result of overload when the aircraft touched down with its nosewheel first after two bounces. A contributing factor was shortcomings in cockpit’s CRM (Cockpit Resource Management) during the flight."}