{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-349c-sao-paulo-25-killed", "date": "Mar 21, 1989 at 1155 LT", "type": "Boeing 707", "operator": "Transbrasil", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Manaus – São Paulo", "msn": "19354", "yom": 1966, "flight_number": "TR801", "city": "São Paulo-Guarulhos", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 22, "total_fatalities": 25, "captain_hours": 10731, "captain_hours_type": 1458, "copilot_hours": 2265, "copilot_hours_type": 21, "aircraft_hours": 61053, "circumstances": "The crew (one captain under training, one instructor and one flight engineer) was completing a cargo flight from Manaus to São Paulo and the aircraft was carrying a load of 26 tons of electronic equipments. Initially cleared for an approach to runway 09L, the crew was instructed to change to runway 09R as runway 09L was blocked by an aircraft. The crew was aware of a notam saying that runway 09R would be closed to all traffic starting 1200LT due to maintenance. In such conditions, the instructor rushed the approach procedure, interrupted the instruction to the captain under supervision and commanded flaps and speed brake at the same time, causing the aircraft to descend. The left wing struck the roof of a house then crashed in a residential area located about 2,7 km short of runway, bursting into flames. All three crew members and 22 people on the ground were killed. 47 other people on the ground were seriously injured. ", "probable_cause": "The accident was the consequence of the combination of the following factors (findings):\r\n- The imminent interruption of operations in the aerodrome that would be used for landing the aircraft (closure of runway 09R due to works) stimulated the instructor to make a hurried descent, characterizing a potential state of anxiety,\r\n- Probable crew fatigue, \r\n- The instruction given to the pilot was discontinued and the local flight did not comply with the minima provided in RAC 3211,\r\n- The failures found in the instruction were due to poor supervision of the Company's operations sector,\r\n- Poor crew coordination,\r\n- During the descent procedure when working checklist, the instructor broke the sequence of standardized procedures, thus stopping the instruction and consequently, the student's core handling of the flight,\r\n- The instructor, without the student being informed beforehand, commanded the flaps together with the speed brakes. This action configured an abnormal attitude that contributed, without the pilots identifying, to the loss of control of the aircraft,\r\n- The flight engineer also failed to meet the checklist items,\r\n- The instructor did not follow the standardization of the instruction, when he executed a decision in a hurry,\r\n- The crew did not respond to the sinking and pull up warnings,\r\n- Error in the application of flight controls,\r\n- The crew did not operate in accordance with the operational standard issued by the manufacturer and endorsed by the company,\r\n- The air traffic controller contributed to the increase of the crew anxiety level by using non standard phraseology."}