{"url": "https://www.baaa-acro.com/crash/crash-handley-page-hpr7-dart-herald-207-near-damascus-54-killed", "date": "Apr 10, 1965 at 2320 LT", "type": "Handley Page HPR-7 Dart Herald", "operator": "Royal-Jordanian-2", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Beirut – Amman", "msn": "170", "yom": 1963, "flight_number": null, "city": "Damascus", "zone": "Damascus Governorate (مُحافظة دمشق‎)", "country": "Syria", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 50, "pax_fatalities": 50, "other_fatalities": 0, "total_fatalities": 54, "captain_hours": 7453, "captain_hours_type": 1053, "copilot_hours": 2021, "copilot_hours_type": 1161, "aircraft_hours": null, "circumstances": "The aircraft took off from Beirut International Airport, Lebanon, at 1955 hours GMT on a non-scheduled international flight to Amman, Jordan. The aircraft was cleared to climb to and maintain FL 135 according to the flight plan submitted. At 2014 hours the aircraft reported to Damascus Centre over Dakweh at FL 120 climbing to FL 135 and estimating Damascus beacon at 2019 hours. The aircraft having not reported over that beacon by 2020 hours, the Damascus Centre controller initiated a series of calls which were not answered by the aircraft. At 2035 hours, a telephone call indicated that an aircraft flying west to east was seen on fire and had crashed half-way between the Syrian border and Damascus. It was subsequently found that this was the subject aircraft, and that it had crashed at approximately 2016 hours on a 45° slope of a mountain at a height of 4 200 ft AMSL on a heading of 340°. The aircraft was totally destroyed and all 54 occupants have been killed. ", "probable_cause": "The cause of the accident was structural failure of the fuselage in flight. The structural failure of the fuselage occurred before any fire broke out. Although witnesses stated that they saw the aircraft on fire in the air, no positive evidence of fire in flight could be found in the wreckage. If such evidence did exist, it must have been destroyed by the ground fire. There was no evidence of any explosive object or materials having been placed in the aircraft. "}