{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-141a-20-lm-starlifter-mt-constance-16-killed", "date": "Mar 21, 1975 at 2315 LT", "type": "Lockheed C-141 Starlifter", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Mountains", "schedule": "Clark - Kadena - Yokota - McChord", "msn": "6054", "yom": 1964, "flight_number": null, "city": "Mt Constance", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16793, "circumstances": "The airplane was conducting a flight from Clark AFB, Philippines, to McChord AFB with intermediate stops at Kadena AFB, Okinawa, and Yokota AFB, Tokyo, carrying 16 people among them six marines. En route to McChord, while cruising by night, the crew established contact with ATC and was cleared to descend from FL370 to FL150 then FL100. Few minutes later, after confusing the C-141 with another Navy aircraft, the air traffic controller cleared the crew to descent to 5,000 feet which was a too low altitude for the area. While descending at an altitude of 7,000 feet in limited visibility, the four engine airplane struck the slope of Mt Constance (7,756 feet high) located in the Olympic National Park, about 52 miles northwest of McChord AFB. The airplane impacted the mountain about 150 feet below the summit and caused an avalanche. Debris were found scattered on a wide area and none of the 16 occupants survived the crash. ", "probable_cause": "The air traffic controller with whom the captain conversed mistook the C-141 with another Navy aircraft. As a result, he cleared him to descend to FL050 when the minimum prescribed altitude was FL100. Due to limited visibility caused by night, lack of ground visual references and clouds, the crew was unable to distinguish the mountain. This resulted to a controlled flight into terrain. "}