{"url": "https://www.baaa-acro.com/crash/crash-saab-340b-killeen", "date": "Mar 21, 2000 at 1914 LT", "type": "Saab 340", "operator": "American-Eagle-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dallas - Killeen", "msn": "353", "yom": 1993, "flight_number": "AA3789", "city": "Killeen", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 33, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12518, "captain_hours_type": 9251, "copilot_hours": 2105, "copilot_hours_type": 1040, "aircraft_hours": 11976, "circumstances": "The captain was the flying pilot for the night landing on runway 01 in instrument meteorological conditions (IMC), with a right cross wind from 110 degrees at 14 gusting 18 knots, drizzle, and a wet runway. Prior to starting the approach, the flightcrew determined that the landing approach speed (Vref) and the approach speed (Vapp) were 122 and 128 knots, respectively. DFDR data showed the airplane flying on autopilot as it passed the middle marker at 200 feet AGL at 130 knots on the ILS approach. Approximately 3 seconds after the first officer called \"runway in sight twelve o'clock,\" the captain disconnected the autopilot, while at a radio altitude of 132 feet and on a heading of approximately 18 degrees. Within approximately 11 seconds after the autopilot disconnect, the glideslope and localizer deviation increased. The first officer called \"runway over there.\" Approximately 5 seconds before touchdown, the airplane rolled right, then left, then right. DFDR data-based performance calculations showed the airplane crossed the threshold at an altitude of 35 feet and 130 knots. The airplane touched down 2,802 feet from the approach end of the 5,495-foot runway (844- foot displaced threshold) at 125 knots on a heading of 10 degrees. The airplane overran the runway and struck a ditch 175 feet beyond the departure end of the runway. Landing roll calculations showed a ground roll of 2,693 feet after touchdown, consisting of 1,016 feet ground roll before braking was initiated and 1,677 feet ground roll after braking was initiated until the airplane exited the pavement. According to Saab, for a wet runway, the aircraft would have needed 1,989 feet from the time of braking initiation to come to a complete stop. The American Eagle Airlines, Inc., FAA approved aircraft operating manual (AOM), states in part: Stabilized approaches are essential when landing on contaminated runways. Landing under adverse weather conditions, the desired touch-down point is still 1,000 feet from the approach end of the runway. Touchdown at the planned point. Cross the threshold at Vapp, then bleed off speed to land approximately Vref -5. Use reverse, if needed. To achieve maximum braking effect on wet runway, apply maximum and steady brake pressure. In 1992, the City of Killeen submitted a proposal that included extending the north end of runway 01 by 194 feet. The FAA originally disapproved the proposal, in part, because the runway extension decreased the length of the runway safety area (RSA) which was already shorter than the recommended 1,000 feet for a 14 CFR Part 139 certificated airport. The proposal was subsequently approved and a drainage ditch was installed in the north RSA, perpendicular to the runway and  approximately 175 feet north of the departure end of runway 01. In 1993, the airport received FAA Part 139 certification. The 1998 and 1999, FAA airport certification inspection reports noted the inadequate RSA; however, neither letter of correction, sent from the FAA to the City of Killeen following the inspections, mentioned the RSA. Following this accident, the ILS runway 01 was flight checked by the FAA and all components were found to be operating within prescribed tolerances. Examination of the airplane found no anomalies that would have prevented it from operating per design prior to departing the runway and encountering the ditch.", "probable_cause": "The captain's failure to follow standard operating procedure for landing on a contaminated runway in that he touched down long, which combined with his delayed braking resulted in a runway overrun. Contributing factors were the captain's failure to maintain runway alignment following his disconnect of the autopilot, the gusty crosswind and the wet runway. In addition, the following were contributing factors: \r\n(1) the airport operator's failure to fill in a ditch in the runway safety area, \r\n(2) the FAA's granting of 14 CFR Part 139 approval to the airport when the runway safety area (RSA) did not meet the recommended length for a Part 139 airport, and \r\n(3) the FAA's continued lack of acknowledgement to the airport of the inadequate RSA following their annual airport inspection checks."}