{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-rotterdam", "date": "Sep 19, 2005 at 0730 LT", "type": "Swearingen SA227 Metro III", "operator": "Dynamic%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rotterdam – Birmingham", "msn": "AC-523", "yom": 1982, "flight_number": null, "city": "Rotterdam", "zone": "South Holland", "country": "Netherlands", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 17, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 19 September 2005, the type F-Swearingen SA227-AC aircraft with registration PH-DYM was scheduled to make a charter flight from Rotterdam Airport to Birmingham Airport. Seventeen passengers and two cockpit crew members were on board. The planned departure time was 07.30 hours. The aircraft taxied to the beginning of runway 24 and lined up for take-off. During line-up, the speed levers for the engines were moved from taxi position to flight position. The nose wheel steering fault indicator lit up and the first officer, who was steering the aircraft, responded by saying that he had no nose wheel steering. The captain informed the first officer that he had forgotten to press the switch on the throttles, which activates the nose wheel steering system. The first officer then confirmed that he had nose wheel steering. With the engines in the low RPM range (taxi position, up to 70% of maximum RPM), the pilot can steer the aircraft using the rudder pedals while taxing. When the engines are operated in the high RPM selection (flight position, between 70% and 100% of the maximum RPM), the switch on the throttles, which activates the nose wheel steering system, must be pressed in during the first part of the take-off roll in order to be able to operate the nose wheel with the rudder pedal. At a speed around 50 knots, the switch which activates the nose wheel steering system is released. The aerodynamic forces of on the rudder are then sufficient to take over the steering from the nose wheel. Once take-off clearance was given by air traffic control, the first officer engaged power and started the take-off roll. He stated that once the nose wheel operating switch had been released, the aircraft almost immediately began moving towards the left hand side of the runway. He tried to use the brakes and the directional rudder, to return the aircraft to the centre of the runway. The aircraft had a speed of between 50 and 60 knots at that point. The crew rejected the take-off but could not prevent the aircraft ending up alongside the runway, on the left hand side.  The captain stated that various forces influence the directional control of an aircraft during the take-off, such as wind, propeller wash, increasing air speed, etc. These forces necessitate steering corrections during the take-off. Only when the nose wheel steering system was disengaged the captain realized something was wrong. The grass area alongside the runway is lower than the runway and the ground was soft. The left landing gear sank in the soft ground first and, as a result, the aircraft decelerated heavily and the left landing gear broke off almost immediately. The tip of the left wing struck the ground. This caused a ground loop effect and turned the aircraft further left. As a consequence the right landing gear and the nose gear also broke off. Once the aircraft had come to a standstill, the captain switched off all onboard systems and cut off the fuel supply to the engines. Simultaneously, the first officer was given the task of evacuating the passengers. The passengers were calm and left the aircraft without problems via the left hand door at the front of the aircraft. A moment later, the airport fire service arrived at the location of the accident. One of the passengers was taken to hospital for a check-up; he was able to leave hospital the same morning. There was severe damage despite the relatively slow speed at which the aircraft left the runway.", "probable_cause": "This accident was caused by an hydraulic leakage in the nose wheel steering system. The tyre tracks on the runway implied that the steering problem had occurred from the beginning of the take-off. The crew intervened as soon as after the nose wheel switch had been released and the nose wheel steering fault came on but were unable to prevent the aircraft leaving the runway."}