{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-whyalla-8-killed", "date": "May 31, 2000 at 1905 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Whyalla%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Adelaide - Whyalla", "msn": "31-8152180", "yom": 1981, "flight_number": "WW904", "city": "Whyalla", "zone": "South Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 2211, "captain_hours_type": 113, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11837, "circumstances": "On the evening of 31 May 2000, Piper Chieftain, VH-MZK, was being operated by Whyalla Airlines as Flight WW904 on a regular public transport service from Adelaide to Whyalla, South Australia. One pilot and seven passengers were on board. The aircraft departed at 1823 central Standard Time (CST) and, after being radar vectored a short distance to the west of Adelaide for traffic separation purposes, the pilot was cleared to track direct to Whyalla at 6,000 ft. A significant proportion of the track from Adelaide to Whyalla passed over the waters of Gulf St Vincent and Spencer Gulf. The entire flight was conducted in darkness. The aircraft reached 6,000 ft and proceeded apparently normally at that altitude on the direct track to Whyalla. At 1856 CST, the pilot reported to Adelaide Flight Information Service (FIS) that the aircraft was 35 NM south-south-east of Whyalla, commencing descent from 6,000 ft. Five minutes later the pilot transmitted a MAYDAY report to FIS. He indicated that both engines of the aircraft had failed, that there were eight persons on board and that he was going to have to ditch the aircraft, but was trying to reach Whyalla. He requested that assistance be arranged and that his company be advised of the situation. About three minutes later, the pilot reported his position as about 15 NM off the coast from Whyalla. FIS advised the pilot to communicate through another aircraft that was in the area if he lost contact with FIS. The pilot’s acknowledgment was the last transmission heard from the aircraft. A few minutes later, the crew of another aircraft heard an emergency locater transmitter (ELT) signal for 10–20 seconds. Early the following morning, a search and rescue operation located two deceased persons and a small amount of wreckage in Spencer Gulf, near the last reported position of the aircraft. The aircraft, together with five deceased occupants, was located several days later on the sea–bed. One passenger remained missing.", "probable_cause": "Engine operating practices:\r\n• High power piston engine operating practices of leaning at climb power, and leaning to near ‘best economy’ during cruise, may result in the formation of deposits on cylinder and piston surfaces that could cause preignition.\r\n• The engine operating practices of Whyalla Airlines included leaning at climb power and leaning to near ‘best economy’ during cruise.\r\nLeft engine:\r\nThe factors that resulted in the failure of the left engine were:\r\n• The accumulation of lead oxybromide compounds on the crowns of pistons and cylinder head surfaces.\r\n• Deposit induced preignition resulted in the increase of combustion chamber pressures and increased loading on connecting rod bearings.\r\n• The connecting rod big end bearing insert retention forces were reduced by the inclusion, during engine assembly, of a copper–based anti-galling compound. \r\n• The combination of increased bearing loads and decreased bearing insert retention forces resulted in the movement, deformation and subsequent destruction of the bearing inserts.\r\n• Contact between the edge of the damaged Number 6 connecting rod bearing insert and the Number 6 crankshaft journal fillet resulted in localised heating and consequent cracking of the nitrided surface zone.\r\n• Fatigue cracking in the Number 6 journal initiated at the site of a thermal crack and propagated over a period of approximately 50 flights.\r\n• Disconnection of the two sections of the journal following the completion of fatigue cracking in the journal and the fracture of the Number 6 connecting rod big end housing most likely resulted in the sudden stoppage of the left engine.\r\nRight engine:\r\nThe factors that were involved in the damage/malfunction of the right engine following the left engine malfunction/failure were:\r\n• Detonation of combustion end-gas.\r\n• Disruption of the gas boundary layers on the piston crowns and cylinder head surface increasing the rate of heat transfer to these components.\r\n• Increased heat transfer to the Number 6 piston and cylinder head resulted in localised melting.\r\n• The melting of the Number 6 piston allowed combustion gases to bypass the piston rings.\r\nThe flight:\r\nThe factors that contributed to the flight outcome were:\r\n• The pilot responded to the failed left engine by increasing power to the right engine.\r\n• The resultant change in operating conditions of the right engine led to loss of power from, and erratic operation of, that engine.\r\n• The pilot was forced to ditch the aircraft into a 0.5m to 1m swell in the waters of Spencer Gulf, in dark, moonless conditions.\r\n• The absence of upper body restraints, and life jackets or flotation devices, reduced the chances of survival of the occupants.\r\n• The Emergency Locator Transmitter functioned briefly on impact but ceased operating when the aircraft sank."}