{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-120er-brasilia-darwin-2-killed", "date": "Mar 22, 2010 at 1009 LT", "type": "Embraer EMB-120 Brasília", "operator": "Airnorth%20Regional", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Darwin - Darwin", "msn": "120-116", "yom": 1988, "flight_number": null, "city": "Darwin", "zone": "Northern Territory", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8217, "captain_hours_type": 3749, "copilot_hours": 5664, "copilot_hours_type": 3085, "aircraft_hours": 32799, "circumstances": "Aircraft crashed moments after takeoff from runway 29 at Darwin Airport, Northern Territory, fatally injuring both pilots. The flight was for the purpose of revalidating the command instrument rating of the pilot under check and was under the command of a training and checking captain, who occupied the copilot’s seat. The takeoff included a simulated engine failure.  Data from the aircraft’s flight recorders was used to establish the circumstances leading to the accident and showed that the pilot in command (PIC) retarded the left power lever to flight idle to simulate an engine failure. That introduced a simulated failure of the left engine and propeller autofeathering system. The increased drag from the ‘windmilling’ propeller increased the control forces required to maintain the aircraft’s flightpath. The pilot under check allowed the speed to decrease and the aircraft to bank toward the inoperative engine. Additionally, he increased power on the right engine, and engaged the yaw damper in an attempt to stabilize the aircraft’s flight. Those actions increased his workload and made control of the aircraft more difficult. The PIC did not restore power to the left engine to discontinue the manoeuvre. The few seconds available before the aircraft became uncontrollable were insufficient to allow ‘trouble shooting’ and deliberation before resolving the situation. ", "probable_cause": "• The pilot in command initiated a simulated left engine failure just after becoming airborne and at a speed that did not allow adequate margin for error. \r\n• The pilot in command simulated a failure of the left engine by selecting flight idle instead of zero thrust, thereby simulating a simultaneous failure of the left engine and its propeller autofeather system, instead of a failure of the engine alone. \r\n• The pilot under check operated the aircraft at a speed and attitude (bank angle) that when uncorrected, resulted in a loss of control. \r\n• The pilot under check increased his workload by increasing torque on the right engine and selecting the yaw damper. \r\n• The pilot in command probably became preoccupied and did not abandon the simulated engine failure after the heading and speed tolerance for the manoeuvre were exceeded and before control of the aircraft was lost. \n"}