{"url": "https://www.baaa-acro.com/crash/crash-iai-1124-westwind-moss-town", "date": "May 24, 2006 at 0055 LT", "type": "IAI 1124 Westwind", "operator": "Air%20Ambulance%20by%20Air%20Trek", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Juan – Norfolk", "msn": "270", "yom": 1979, "flight_number": null, "city": "Moss Town", "zone": "Exuma", "country": "Bahamas", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 0444Z On May 24 2006, Miami Centre (George Town Sector) informed Nassau ATC That Lifeguard Flight N475AT, a Westwind Jet (WW-1124), en-route from San Juan, Puerto Rico to Norfolk, Virginia reported that it had developed generator problems and the aircraft was looking to land at the nearest airport to its position. Miami Air Traffic Center vectored the aircraft to Exuma International Airport at Great Exuma, Bahamas, as that was the nearest airport. Attempts were made by Nassau ATC to contact the authorities at Exuma International Airport to have the runway lights turned on. At 0454Z, Miami ATC reported loss of contact with the aircraft; therefore, N475AT proceeded with an emergency landing, before Miami ATC could give further instructions. The uncontrolled aircraft came to rest approximately 800 feet beyond the end of runway 30 and approximately 300 feet right of the extended centre line of the runway. The aircraft landing gears were sheered off when the aircraft exited the runway, hence traveling into the clearing and then eventually into the bushes on the right side of the runway. The right wing of the aircraft collided with a mound of dirt, causing it to spin uncontrollably, resulting in it coming to rest on an easterly heading at an approximate 30 degree incline. The occupants were evacuated from the wreckage and received minor injuries while making their way thru the thick brush and shrubbery while being led to safety. All Crew members were ATP rated and both proficiency checks found to be were valid and current neither of the pilots was available for an interview at the time of the field investigation at Exuma International Airport.", "probable_cause": "Findings and Probable Cause could not be determined as the aircraft was stripped of its components, instrumentations, manuals and CVR by the owners of the aircraft, without permission or authorization from the Accident Investigation Personnel (Department of Civil Aviation). Documents and manuals requested of the owners were never obtained. The help of the NTSB as well as the FAA were enlisted in an effort to retrieve documents from the owners. All attempts were fruitless."}