{"url": "https://www.baaa-acro.com/crash/crash-fokker-100-brasilia", "date": "Mar 28, 2014 at 1742 LT", "type": "Fokker 100", "operator": "Avianca-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Petrolina – Brasília", "msn": "11415", "yom": 1992, "flight_number": "OC6393", "city": "Brasília", "zone": "Distrito Federal", "country": "Brazil", "region": "South America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 44, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4993, "captain_hours_type": 3060, "copilot_hours": 3357, "copilot_hours_type": 2844, "aircraft_hours": 44449, "circumstances": "The aircraft took off from the Senador Nilo Coelho Aerodrome (SBPL), Petrolina - PE, to Presidente Juscelino Kubitschek International Airport (SBBR), Brasilia - DF, at 1752 (UTC), in order to complete the scheduled cargo and personnel flight O6 6393, with 5 crewmembers and 44 passengers on board. During the level flight, thirty minutes after takeoff, the aircraft presented low level in the hydraulic system 1. The crew performed the planned operational procedures and continued the flight to Brasilia, with the hydraulic system degraded. During the SBBR landing procedures, the crew used the alternative system for lowering the landing gears. The main landing gears lowered and locked, the nose landing gear unlocked, but did not lower. After coordination with the air traffic control, the aircraft was instructed to land on SBBR runway 11R. The landing took place at 2042 (UTC). After the touchdown, the aircraft covered a total distance of 900 meters until its full stop. The initial 750 meters were with the aircraft supported only by the main landing gears and the last 150 meters were with the aircraft supported by the main landing gears and by the lower part of the front fuselage. The aircraft stopped on the runway. Substantial damage to structural elements of the aircraft occurred near the nose section. The evacuation of the crewmembers and passengers was safe and orderly. The copilot suffered fractures in the thoracic spine. The other crewmembers and passengers left unharmed.", "probable_cause": "The following findings were identified:\r\n- It was found that there was a restriction on the articulation movement of the right nose landing gear door and that the weight of this landing gear was not sufficient to overcome such restriction.\r\nUpon inspecting the hinges, it was found that there were no signs of recent lubrication, allowing the hypothesis of occurrence of any deviation or non-adherence to the inspection and lubrication requirements established by the manufacturer leading to a the scenario favorable to the right door movement restriction. The issue of the maintenance could also be related to some deviation, or nonadherence to the requirements established for the service of widening the holes of the hinges concerning the coating and corrosion protection of the worked surface. As a result, the area could have been more susceptible to corrosive processes.\r\n- The maintenance program, established by the manufacturer, may have contributed to the occurrence by not establishing adequate preventive maintenance parameters for the landing gear doors that were modified by reworking the hinges, incorporating larger radial pins and widening the lobe holes.\r\n- It was not possible to determine the causal root of the EDP1 gasket extrusion, which caused the leakage of hydraulic oil that caused the hydraulic system 1 to fail."}