{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-cranfield", "date": "Apr 29, 2021 at 1425 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "ZeroAvia", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cranfield - Cranfield", "msn": "46-36130", "yom": 1997, "flight_number": "86", "city": "Cranfield", "zone": "Bedfordshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 34620, "captain_hours_type": 1588, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the morning of the accident flight, G-HYZA was flown for approximately 16 minutes on test flight 85. The flight test team debriefed the results and prepared the aircraft for flight 86. The plan for this flight was for the HV battery to be switched off at the end of the downwind leg then, if able, to fly three or more circuits at 1,000 ft aal using the HFC only to provide electrical power. The flight test team discussed experimenting with combinations of higher airspeeds and propeller rpm that would reduce the aircraft angle of attack and improve the mass flow of air through the radiator which provided cooling for the HFC. This was considered as a potential strategy to manage a slow rise in temperature in the HFC which they had observed in previous flights when flying on that power source alone. The test card for flight 86 was not amended to reflect this intention. At 1406 hrs, following a normal start using both the HV battery and HFC to provide electrical power, the HV was switched off to preserve its electrical capacity. The aircraft taxied to the holding point and was cleared to line up on Runway 03. The weather was fair with good visibility and light winds from 010°. The aircraft entered the runway and backtracked to the threshold where the pilot commenced a run-up of the propulsion system to ensure the HFC could achieve thermal stability within the flight test parameters. Once the temperatures in the HFC were stable, the pilot switched on the HV battery to bring both power sources online and commenced the takeoff run. As the aircraft accelerated and the power lever was advanced, the observer operated the high temperature override switch  to maintain the temperature of the HFC within the operating limits. After takeoff, the pilot turned onto the crosswind leg and climbed to the circuit height of 1,000 ft agl. During the downwind leg of the right-hand circuit, the pilot stated the power was set to 95 kW, the propeller to 2,500 rpm and the airspeed to 100 kt. Once stabilized at these parameters, which were at variance with the flight test card conditions, the observer confirmed that the HFC operating temperatures were within limits. He then instructed the pilot to reduce power to 90 kW to assess the effect on the airspeed, which reduced to approximately 95 kt. The pilot increased the power to 95 kW to regain the target speed. The pilot set the power by reference to his display unit which was located below the throttle quadrant. When he looked up from this task, he recognized that the aircraft was in a late downwind position. He turned onto base leg and commented that they were losing speed in the turn. The observer suggested that they could increase power to 120 kW to regain the lost airspeed, then reduce power before turning off the HV battery to re-establish the test conditions. He also suggested a reduction in propeller rpm. The pilot increased power to 120 kW but did not reduce the propeller rpm. As he started to turn onto final, the pilot briefed that once he had established straight and level flight he would reduce the power slightly and turn off the HV battery leaving the electrical motors powered by the HFC. He called final on the radio and was cleared by ATC to fly through at circuit height. Approaching the runway threshold at approximately 940 ft agl, the pilot reduced power to 90 kW, set the airspeed to 90 kt then selected the HV battery to off. Immediately, all electrical drive to the propeller was lost. The pilot and observer made several unsuccessful attempts to reset the system to restore power from the HFC with the observer stating the action to be taken and the pilot making the switch selection. The observer instructed the pilot to select the HV battery to on to reconnect the alternative power source. HV power was not restored so the observer instructed the pilot to attempt a system reset with the HFC in the off position. Electrical power was still not restored and at 440 ft agl the observer declared “the voltage is too high”, to which the pilot replied, “we’ve got to do something quick”. The observer called for a further reset attempt and adjusted the power lever. The aircraft had now travelled the length of the runway and was at approximately 320 ft aal when the observer reported that power could not be restored. The pilot transmitted a MAYDAY call and initiated a turn to the left to position for a landing on Runway 21. Almost immediately he recognized that he did not have sufficient height to complete the manoeuvre so lowered the landing gear and selected full flap for a forced landing in a field that was now directly ahead on a north-westerly heading. The aircraft touched down at approximately 87 kt ground speed on a level grass field. The pilot applied the brakes, and the aircraft continued its movement until it struck, and passed through, a hedge during which the left wing broke away. The nosewheel and left main wheel entered a ditch and the aircraft came to an abrupt stop. The pilot and observer were uninjured and exited the aircraft through the upper half of the cabin door. The airport fire service arrived quickly at the scene. The observer returned to the aircraft and vented the hydrogen tank to atmosphere and disconnected the HV battery to make the aircraft safe.", "probable_cause": "The loss of power occurred during an interruption of the power supply when, as part of the test procedure, the battery was selected off with the intention of leaving the electrical motors solely powered by the hydrogen fuel cell. During this interruption the windmilling propeller generated a voltage high enough to operate the inverter protection system, which locked out the power to the motors. The pilot and observer were unable to reset the system and restore electrical power."}