{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-walney-island-1-killed", "date": "Nov 26, 1976 at 2005 LT", "type": "Piper PA-31-310 Navajo", "operator": "Vickers", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Edinburgh - Walney Island", "msn": "31-805", "yom": 1973, "flight_number": null, "city": "Walney Island", "zone": "Cumbria", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1647, "circumstances": "The aircraft was operating a company communications flight from Edinburgh to Walney Island (Barrow-in-Furness) and departed from Edinburgh at 1908 hrs with five passengers on board, one of whom occupied the right hand pilot's seat. The flight proceeded normally on airways at FL080 until leaving controlled airspace south of Dean Cross at 1940 hrs, when the pilot contacted Walney Island aerodrome and requested the latest weather and landing information. The tower reported that there was heavy rain and a strong wind from 300° at 25 to 30 knots, and the pilot was advised that the runway in use was 30 and the QFE 1001. It was dark night with an estimated visibility of 8 km. The aircraft was next in contact with Walney Island at 1952 hrs when the pilot queried the serviceability of the non-directional beacon (NDB) 'WL'. The tower replied that it was operating. The passenger in the right hand seat states that at about this time the lights of Barrow-in-Furness could be seen intermittently through the clouds, but that the pilot was unable to see the runway lights. The pilot then requested the other runway lights to be put on, and the tower confirmed that all the lights were on. A short time later, the pilot called to say that he was on a left hand base leg for runway 30 and he received clearance to land. The wind was reported to the aircraft at that stage as 300°, 25-30 knots and the weather as continuous rain. The aircraft was observed to make its approach over the slag bank to the south-east of the airfield; one witness stated that as it crossed Walney Channel the aircraft was lower than normal. The passenger in the right hand pilot seat states that the approach appeared normal; the landing lights were on and the left hand wind screen wiper was operating and he could see the runway sodium lights ahead. He was next aware of a sudden increase in engine power and looking ahead, he saw that the runway lights ha disappeared from view. He then saw some trees illuminated by the landing lights and immediately afterwards felt the aircraft's impact with the ground. When the aircraft failed to appear on the runway, the tower operator ordered the emergency services to search the approach end of runway 30. Some difficulty was experienced in locating the aircraft which had crashed below aerodrome level into the west bank of Walney Channel and was out of view. It was only when one of the passengers had extricated himself from the wreckage and climbed the bank, that the aircraft was found. There was no fire, but the aircraft was substantially damaged. The pilot received fatal injuries, and two o the passengers, including the one in the right hand pilot's seat were seriously injured. ", "probable_cause": "The accident was caused by the pilot allowing his aircraft to undershoot whilst making a difficult approach to a poorly lit runway in adverse weather conditions. Tiredness, lack of food, and poor visual accommodation were probably contributory factors. The effect of carbon monoxide in the pilot's blood may also have been a contributory factor. The following findings were reported:\r\n- The approach to runway 30 at night in adverse weather conditions demanded an abnormally high degree of concentration and awareness due to the insufficiency of runway lights and a lack of glide slope guidance."}