{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-puvirnituq", "date": "Oct 23, 1996 at 0850 LT", "type": "Swearingen SA226 Metro II", "operator": "Propair2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "La Grande - Puvirnituq", "msn": "TC-215E", "yom": 1975, "flight_number": "PRO450", "city": "Puvirnituq", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 11, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": 1050, "copilot_hours": null, "copilot_hours_type": 350, "aircraft_hours": null, "circumstances": "Propair flight 450, a Swearingen SA226TC (serial number TC-215E) with 13 persons on board, was on a charter flight from La Grande Rivière, Quebec, to Puvirnituq, Quebec. The co-pilot was in the right-hand seat and was flying the aircraft. Following an instrument approach to runway 19, the aircraft broke through the cloud layer and the co-pilot switched to visual for the final approach. As soon as the nose gear touched down on landing, the aircraft veered left. The co-pilot applied full right rudder and throttled back to GROUND IDLE in preparation for reversing thrust. A short time later, the pilot-in-command took the controls of the aircraft and left the throttle levers on GROUND IDLE. He then observed that the aircraft was drifting further to the left and that, even when he applied full right rudder, he was unable to correct the drift. As a last resort, he pressed the PARK button for the nosewheel steering system, but the aircraft continued its course toward the runway edge and crashed at the bottom of the embankment. The investigation established that the aircraft left the runway about 2,000 feet from the threshold after turning left 90 degrees relative to the runway centre line. The nose gear and main landing gear separated from the aircraft when the aircraft fell from the runway shoulder to the bottom of the embankment.", "probable_cause": "The aircraft left the runway during the landing roll because the nosewheel was probably deflected left, for reasons that could not be determined. Contributing to the accident were a lack of communication in the cockpit and the actions taken by the crew to maintain directional control of the aircraft."}