{"url": "https://www.baaa-acro.com/crash/crash-hawker-850xp-sulaymaniyah-7-killed", "date": "Feb 4, 2011 at 1749 LT", "type": "Hawker 850XP", "operator": "Sky%20Lounge%20Services", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sulaymānīyah - Ankara", "msn": "258804", "yom": 2006, "flight_number": null, "city": "Sulaymānīyah", "zone": "As-Sulaymāniyyah (السليمانية)", "country": "Iraq", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after take off from Sulaymaniyah Airport runway 31, while in initial climb, the aircraft stalled and crashed 2,100 metres from the airport, bursting into flames. The aircraft was totally destroyed by a post crash fire and all seven occupants were killed, among them four employees of the Iraqi communications company Asiacell. Weather conditions at the time of the accident were as follow: 1,500 metres visibility in snow falls, overcast 3,500 feet.", "probable_cause": "The following findings were identified:\r\n- The wings, elevator and horizontal stabilizer top surface were contaminated with ice and snow.\r\n- The crew was in a hurry due to early passenger arrival.\r\n- The crew didn’t remove the snow and ice contamination from the control surfaces nor did he call for de-icing actions.\r\n- Ice and snow contamination on tail section most likely cause sluggish rotation during the takeoff; this will resulting in over rotation and wing stall.\r\n- Snow and ice contamination on the wing, fuselage and tail will compromise the normal takeoff characteristics.\r\n- A combination of snow and ice causing disruptive air flow, heaver actual weights and over rotation, the combination of which most likely didn’t activate the stall warning safety design. The aircraft could stall asymmetrical without warning during takeoff.\r\n- That was the probable cause of the accident.\n"}