{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-near-samurskaya-18-killed", "date": "Oct 25, 1948 at 1401 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Krasnodar – Karachayevsk – Sukhumi – Tbilisi", "msn": "184 296 08", "yom": 1948, "flight_number": null, "city": "Samurskaya", "zone": "Krasnodar Krai", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 14, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 18, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 616, "circumstances": "The aircraft landed in Karachayevsk Airport at 0905LT and the crew took a break for lunch and drank vodka with some airport's officials. The aircraft took off from Karachayevsk at 1230LT bound for Sukhumi, overloaded by 366 kilos. After takeoff, the crew modified his route and continued to the northwest instead of southwest. While flying over mountainous terrain, the crew encountered poor weather conditions with low clouds, strong winds and icing. Few minutes later, the aircraft was caught by downdraft, hit two trees on the slope of a mountain, lost its both wings and eventually crashed into a precipice 80 meters down. As the airplane failed to arrive in Sukhumi, SAR operations were conducted but eventually suspended few days later as no trace of the aircraft nor the 18 occupants was found. On August 8, 1949, walkers found the wreckage of the aircraft at the altitude of 1,610 meters in a wooded area. Nobody survived.", "probable_cause": "If was determined that the the pilots drank alcohol prior to departure and that the aircraft was overloaded. En route, the crew took the decision to change his route several times, violating existing regulations. Poor operational planning, inadequate flight management and lack of assistance on part of the Georgian ATC were considered as contributory factors. "}