{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-near-terrace-2-killed", "date": "May 9, 1996 at 1430 LT", "type": "De Havilland DHC-3 Otter", "operator": "Buffalo Narrows Airways", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "No", "site": "Mountains", "schedule": "Ketchikan – Prince Rupert – Dawson Creek – Buffalo Narrows", "msn": "194", "yom": 1957, "flight_number": null, "city": "Terrace", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 10000, "captain_hours_type": null, "copilot_hours": 5000, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The single-engine, float-equipped DHC-3 Otter departed Ketchikan, Alaska, at 0905 Pacific daylight time (PDT) on 09 May 1996 with a pilot and co-pilot on board. They were on a visual flight rules (VFR) ferry flight to Dawson Creek, British Columbia, en route to Buffalo Narrows, Saskatchewan. After a refuelling stop and weather briefing at Prince Rupert, British Columbia, the aircraft departed eastbound along the published Telkwa Pass VFR route. When the aircraft did not arrive at Dawson Creek, it was reported overdue. The next day, an extensive search for the missing Otter was commenced and wreckage was located by search and rescue aircraft at 1930 PDT, 30 miles east of Terrace, in the Telkwa Pass. The aircraft had struck mountainous terrain and was destroyed. Both occupants were fatally injured.", "probable_cause": "The absence of aircraft wreckage and documentation precludes an analysis of the technical aspects of this accident. This analysis, therefore, concentrates solely on the operational aspects. The high impact speed is indicative of either a loss of control followed by a rapid descent into terrain or controlled flight into unseen terrain. Given that the pilot reported encountering snow showers within 15 miles of the accident site, it is possible that the weather continued to deteriorate and may have adversely affected the pilot's ability to maintain visual contact with the terrain.\r\nFindings:\r\n1. The weight and centre of gravity of the aircraft at the last take-off were estimated to have been within the prescribed limits. \r\n2. The pilot was certified, trained, and qualified for the flight in accordance with existing regulations. \r\n3. Marginal visual weather conditions existed in the vicinity of the accident site.\r\n4. It is possible that deteriorating weather affected the pilot's ability to maintain visual contact with the terrain. \r\nCauses and Contributing Factors:\r\nIt was not determined why the aircraft struck terrain; however, it is likely that the contact occurred during conditions of reduced visibility."}