{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-auburn-1-killed", "date": "Sep 22, 1985 at 1236 LT", "type": "Learjet 35", "operator": "Louisiana-Pacific%20Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Destin - Auburn", "msn": "35-104", "yom": 1977, "flight_number": null, "city": "Auburn-Opelika-Robert G. Pitts (University Regional)", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 8000, "captain_hours_type": 1100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4171, "circumstances": "During arrival, the aircrew of a Gates Learjet 35A, N873LP, canceled their IFR clearance and contacted the Auburn unicom, then entered the traffic pattern to land on runway 18. The unicom operator reported that the Learjet crew had reported their position on each portion of the traffic pattern. At approximately the same time, the pilot of an unregistered, experimental, Challenger II was in the traffic pattern for runway 10. The two runways intersected at their approach ends. Just before landing, the two aircraft collided as they were crossing over the intersection and crashed on the airport. The challenger (a two place version of an ultralight vehicle) was not equipped with a radio and the unicom operator was unaware of its presence in the traffic pattern. The Learjet pilot stated that neither he nor his copilot had seen any other traffic at the airport. No indication was found that either crew had taken evasive action. An exam of the crash site revealed evidence that the collision had occurred approximately 50 feet above the intersection. A pilot on board the Learjet was killed while six other occupants were injured. The pilot of the Challenger II was also killed. ", "probable_cause": "Occurrence #1: midair collision\r\nPhase of operation: approach - vfr pattern - final approach\r\nFindings\r\n1. Control tower - unavailable\r\n2. Radio communications - not possible - pilot of other aircraft\r\n3. (c) visual lookout - inadequate - pilot in command\r\n4. (c) visual lookout - inadequate - pilot of other aircraft\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled"}