{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-338c-rome-33-killed", "date": "Oct 17, 1988 at 0030 LT", "type": "Boeing 707", "operator": "Uganda%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "London - Rome - Entebbe", "msn": "19630", "yom": 1968, "flight_number": "QU775", "city": "Rome-Fiumicino-Leonardo da Vinci", "zone": "Lazio", "country": "Italy", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 45, "pax_fatalities": 26, "other_fatalities": 0, "total_fatalities": 33, "captain_hours": 8365, "captain_hours_type": null, "copilot_hours": 2202, "copilot_hours_type": null, "aircraft_hours": 58098, "circumstances": "Uganda Airlines flight 775, a Boeing 707-338C, took off from London-Gatwick Airport, United Kingdom, at 2110LT on a flight to Rome-Fiumicino Airport, Italy and Entebbe, Uganda. During the descent to Rome, clearance was received for a descent to 4,000 feet in preparation for an ILS approach to runway 16L. Visibility was deteriorating with RVR values of 400 meters (point Alfa), 1,000 meters (point Bravo) and 350 meters (point Charlie). A missed approach procedure was carried out at 0005. A second approach was attempted, this time to runway 25. This was also abandoned due to poor visibility. RVR values for runway 34L (1,600 m, 2,000 m and 150 meters respectively. At Alfa, Bravo and Charlie made the crew request radar vectoring to runway 34L. The aircraft was established on the localizer at 0028. The aircraft continued to descend below the 420 feet MDA, although the runway visual markings hadn't been located. Because the flight crew failed to use the altitude callouts, the GPWS sounded unexpectedly. The right wing collided with the roof of a car rental agency located 1,300 meters short of the runway, 100 meters to the right of the extended centreline. The aircraft continued and crashed 500 meters further, bursting into flames. 33 occupants were killed, among them all seven crew members, while 19 passengers were injured. ", "probable_cause": "The crew's lack of adequate preparation in the procedure for a Non Precision Approach on runway 34L at Fiumicino Airport, especially in the matter of crew coordination and altitude callouts and their continued descent beyond MDA without having located the runway visual markings.\r\nBesides, the following factors may have contributed to the cause of the accident:\r\n1) Presumed mental and physical fatigue, accumulated by the crew during the two previous landing approaches, which were also carried out in an environmental situation that was extremely unfavourable and operationally demanding.;\r\n2) A configuration of the Altitude Instruments, which although sufficient for the approaches that were carried out, consisted of a single radio altimeter with the acoustic warning of the MDA crossing inoperative;\r\n3) The attention of the crew was excessively concentrated on the luminous sources along runway 34L, instead of on the instrument readings.\r\nFurthermore (...) part of the Board of Inquiry as well as the representative of the Ugandan CA, disassociated themselves from the majority, during the phase of identifying the factors that may have contributed to causing the accident."}