{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-b-sundsvall-8-killed", "date": "Dec 9, 1999 at 1204 LT", "type": "Piper PA-31-310 Navajo", "operator": "Twin-Air", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Sundsvall – Göteborg", "msn": "31-7300947", "yom": 1973, "flight_number": null, "city": "Sundsvall", "zone": "Medelpad", "country": "Sweden", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 729, "captain_hours_type": 98, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7266, "circumstances": "Events prior to the flight:\r\nOn Wednesday the 8th of December 1999 at 08:32 hrs. the pilot took off with the aircraft from Gothenburg/Landvetter airport for an IFR flight to Sundsvall/Härnösand airport via Östersund/Frösön F4 airport. Present onboard were seven passengers, all employed by a company in Gothenburg. The flight proceeded via the reporting point of MEGEN (6001N 1424E) and they landed at 10:45 hrs. in Östersund. After a short groundstop to deplane one of the passengers, they took off 13 minutes later to continue the flight to Sundsvall. It was beautiful weather in Sundsvall. The wind was 320 degrees at 12 knots and the temperature –12°C. The pilot performed a visual approach to runway 34 and landed at 11:33 hrs. After the landing he parked the airplane for the night on spot 25 on the southern tarmac, designated “Apron S” (ref. 1.10). According to what he stated later that evening, he placed covers on the aircraft wings and stabilizer and connected electricity for heating in the cabin and engines before he, along with his passengers, departed for the city of Sundsvall. In Sundsvall they had lunch and had a business meeting with a subcontractor, which was concluded at approximately 16:00 hrs, at which time they were driven to the hotel. Around 19:00 hrs. the party dined at a restaurant together with a few of the employees from the subcontractor. The consumption of alcoholic beverages was sparse and none of the persons that SHK has talked with observed the pilot consume anything other than non-alcoholic beverage. Dinner concluded around 23:30, after which the party returned to the hotel. The following morning it was snowing. The group was picked-up around 08:00 hrs. and initially made a short visit at a factory. Thereafter they were driven to the subcontractor’s office where they had a short coffee break and then continued their business meeting. During the trip to the office the pilot called the airport and ordered weather information that was faxed to the office. On questions to the pilot concerning flying in the bad weather, his response was that it was no problem. If he had felt doubtful in that respect, he would cancel the flight. However, due to the weather situation the pilot decided not to perform the return flight to Gothenburg via Östersund. The passenger that was there had to get to Sundsvall with other means of transport and join the group at the airport.\r\nPreparations before the flight:\r\nThe business meeting was concluded at time 10:30 hrs. A taxi had been booked for that time. Due to the taxi being somewhat late the group arrived at the airport around 11:15. The passengers remained in the flight planning room in the terminal building while the pilot ordered fueling and went out to prepare the aircraft for the flight. He had filed a flight plan by telephone earlier in the day. Departure was planned for 11:30 hrs. and the flight time was estimated to be 2 hours and 20 minutes. When the fueling order came, the fueling personnel were busy refueling another aircraft with type JET A-1 fuel. The tanker truck with AVGAS 100LL fuel had not been in use earlier that day. Prior to re-fueling with this truck it was drained and prepared for refueling. When the fueling personnel arrived at the aircraft the pilot was already in the aircraft warming-up the engines. He cut the engines and requested to have “full wings”. A total of 396 liters of fuel were uploaded in the aircraft's four fuel tanks. The fueling personnel noted that the aircraft wings were free from ice and snow. The pilot contacted the air traffic controller in the tower at 11:41.38 and requested clearance to taxi, which was granted, to the flight planning office next to Apron M, in order to pick up his passengers. At 11:49.24 hrs. the pilot again contacted the tower controller and requested clearance to startup the engines and at the same time reported that he had received the weather information. Four minutes later he requested taxi instructions and was cleared to taxi to holding position “Charlie” on the taxiway (ref. 1.10). After further instructions from the air traffic controller the pilot taxied to the specified position and held there for a departing SAS (Scandinavian Airlines) aircraft. The air traffic controller thought that the aircraft appeared to be free from snow when it was parked on Apron M, but that a thin layer of snow had accumulated when it taxied out for take off. The Commander of the departing SAS aircraft has recounted that both the approach and the departure from Sundsvall that day were difficult due to poor visibility, heavy snowfall and gusty winds. During taxi on the runway snowdrifts had occurred that created strands of blowing snow. He estimated the visibility to be 600-700 meters. During take off he was “fully occupied maneuvering the 58 ton heavy MD 80 in the wind gusts. \r\nThe Flight:\r\nWhen the SAS aircraft had departed the pilot received clearance to taxi out to the take off position on runway 16. At the same time he received air traffic control clearance to Gothenburg/Landvetter via reporting point MEGEN at flight level 120 (approximately 3 660 meters), and the transponder code of 6377. He was also requested to report when the aircraft had reached the take off position, as the air traffic controller could not see the aircraft in the snowfall. At 12:00.18 hrs. the pilot reported that he had lined up into take off position. The controller then reported that the wind was 120 degrees at 17 knots, that the pilot was to make a right turn after take off and that he was cleared for takeoff. When the aircraft was airborne the pilot was to contact Sundsvall Control on frequency 135.02 MHz. The pilot read back these instructions and thereafter took off. The tower controller visually observed the aircraft a short moment during the take off as it passed abeam the control tower, then it disappeared again out of his sight due to the snowfall. A witness, who is a former pilot himself and was on the northern part of Alnön (an island), about 5 km south of the airport, heard the aircraft take off. After take off he heard that the engine rpm decreased somewhat and thereafter heard the characteristic sound that can arise on a multi-engine aircraft when the engines are not totally synchronized with the adjustment of the throttles and propeller levers. The sound of the engines became normal after a while. When the sound faded out is was perceived as normal for a twin engine aircraft. Witnesses who were situated along the flight path of the aircraft heard it and a few observed the aircraft during a short moment through the heavy snowfall. Several felt that the aircraft was flying low but that the sound of the engines was normal. One witness observed that the landing gear was retracted. In the vicinity of Kvickberget northwest of the airport a few witnesses heard that the engine rpm increased sharply. After that it was silent. Approximately two minutes after take off the tower controller observed that the echo from aircraft SE-GDN on his radarscope was not following the route cleared but had turned to the north. He made an inquiry with the air traffic controller at Sundsvall Control and received word that the same had not yet been contacted by the aircraft. The tower controller then contacted the aircraft on tower frequency and asked the pilot if he was experiencing problems. The pilot responded that he did have problems and in response to the controller’s inquiry about his intentions, the pilot answered “Climbing” twice and thereafter “-I have a problem with the eeee … uuumm .. with the compass at, at this moment, so could you, could you give me a … di, direction at this moment.” The tower controller then answered “Ja, you are climbing towards the north-west now, turn left about 90 degrees and climb as soon as possible, you meeting terrain.” Subsequently the tower controller was unable to attain any further radio contact with the aircraft. \r\nRescue operations:\r\nAt time 12:04.27 radio signals from an emergency locator transmitter were perceived in the area and the air traffic controller triggered the alarm button to the SOS center and alerted the air rescue services at ARCC. It was agreed upon to apply the yellow checklist, which meant assumed crash with unknown crash site. The airport was closed. The SOS center alerted according to the alert plan for an assumed crash. A suitable breakpoint (where the ground rescue party has to depart from the surface road structure) was chosen in connection with the area where the aircraft disappeared. ARCC alerted a search and rescue helicopter that was stationed at Sundsvall/Härnösand airport. The crew of the search and rescue helicopter received the alarm at 12:10 hrs. and was airborne with the helicopter at 12:24. Six minutes later the aircraft was located in the forest on the southern slope of a mountain known as Kvickberget. The helicopter lowered rescue personnel on the winch who ascertained that none of the persons on board had survived. They were only able however to find five persons and searched through an area around the downed aircraft without results. Police, ambulances and fire vehicles reached the breakpoint between 12:21 and 12:27 hrs. The SOS center received the exact position of the accident site at 12:35 hrs. and the breakpoint was moved to a road intersection about 4 km from there. The forest road towards the accident site was unplowed and two tracked vehicles had to begin the trip while snow plows cleared the forest road so that ambulances and fire vehicles could make their way. The last portion from the forest road up to the aircraft was approximately 300 meters long and consisted of a ravine and difficult terrain. Medical and fire personnel had to make there way on foot this last portion and reached the accident site at 13:30 hrs. They verified that none of the persons onboard had survived and found that there was an imminent risk of fire because of the large quantity of aviation gas that had been spread at the site. Hand-held fire extinguishers and police search and rescue dogs were requisitioned to the site. At 14:36 hrs. it was reported to SOS that additionally three people had been found in the aircraft. At 19:40 hrs. the last of the victims were transported from the accident site. A crisis group was established at Sundsvall/Härnösand airport. About 40 persons participated in the rescue operations at the site, which was concluded at 23:39 hrs. Despite the difficult terrain, which limited the availability of equipment, the general consensus was that the search and rescue action had worked well. The accident occurred at location: 6233N 1719E; approximately 200 m above sea level. All eight occupants were killed. ", "probable_cause": "The accident was caused by the pilot losing control of the aircraft during flight in IMC. \r\nThe following contributory factors were identified:\r\n- The weather situation was difficult,\r\n- The pilot’s time to prepare for the flight was insufficient,\r\n- The navigation system was in all probability misaligned,\r\n- The pilot mistrusted the flight instruments,\r\n- The aircraft was overloaded and tail-heavy,\r\n- The pilot probably felt pressured into carrying out the flight,\r\n- The pilot’s medical condition can have reduced his ability."}