{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-north-las-vegas-10-killed", "date": "Aug 30, 1978 at 0747 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Las%20Vegas%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "North Las Vegas - Santa Ana", "msn": "31-7852099", "yom": 1978, "flight_number": "6G44", "city": "North Las Vegas", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 6325, "captain_hours_type": 121, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After takeoff from runway 25, at an altitude of 100 feet above ground level, the aircraft pitched up and reached a maximum pitch attitude of 50° to 75°. The aircraft crossed the highway while climbing to an altitude of about 400 feet, 2,000 feet from the departure end of the runway. It then began what witnesses described as a 'wingover' or 'sudden violent nose down turn' to the right, recrossed the highway and crashed in an almost level pitch attitude while in a slight right bank and a slight left yaw. Witnesses to the accident were attracted to the aircraft by the high pitch attitude after takeoff. During the post takeoff maneuver, the engines were reported to be running at a high power setting. The aircraft crashed about one minute after the takeoff roll began; it came to rest in an open field about 1,150 feet past the departure end of the runway and about 650 feet to the right of the runway. The impact heading was 025° magnetic. All 10 occupants were killed, among them Australian tourists. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of the accident was the backed out elevator down-stop bolt that limited down elevator travel to 1/2 of normal 20 degree range, and made it impossible for the pilot to prevent a pitch up and stall after takeoff. The Board was not able to determine conclusively how down-stop bolt jam nut locking device came loose and allowed the stop bolt to back out. "}