{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-2-112-fairchance-12-killed", "date": "Apr 7, 1936 at 1020 LT", "type": "Douglas DC-2", "operator": "TWA-1", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Newark – Philadelphia – Pittsburgh – Kansas City – Los Angeles", "msn": "1247", "yom": 1934, "flight_number": "TW001", "city": "Fairchance", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 11, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew initiated the descent to Pittsburgh-Allegheny County from the southeast in poor weather conditions. While descending to the altitude of 3,800 feet south of Uniontown, the aircraft impacted the slope of Mt Chestnut Ridge located 5 km from Fairchance. A stewardess and a passenger were seriously injured while 12 other occupants were killed. \r\nCrew:\r\nOtto Ferguson, pilot, †\r\nHarry C. Lewis, copilot, †\r\nNelly H. Granger, stewardess.\r\nPassengers:\r\nDonald D. August, \r\nS. W. Bayersdorfer, †\r\nC. G. Challinor, †\r\nC. R. d'Arcy, †\r\nRobert Evans, †\r\nFrank Hardiman, †\r\nGeorge W. Hefferman, †\r\nCrawford T. Kelly, †\r\nJohn O'Neill, †\r\nCharles H. Smith, †\r\nM. C. Ellenstein. ", "probable_cause": "Blamed for the accident was poor judgement on the part of the pilot-in-command for flying by reference to the ground after having descended through the overcast and over the hazardous terrain without determining his position. His failure to follow the radio range course while operating in IMC violated both his company’s and US Department of Commerce’s regulations. An additional factor was that NC13721 had encountered crosswind drift, and at the time of impact had been about 15 NM south of the intended track, its crew apparently unaware of the discrepancy. No evidence was found of any prior mechanical failure in the aircraft or malfunctioning of the ground navigational aids. Subsequent to this crash, the Department of Commerce modified the Pittsburgh radio range, discontinuing the simultaneous voice broadcasts, moved the loop-type radio range beacon from that location to Akron, Ohio, and increased the power at the station located at Buckstown, Pennsylvania."}