{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-near-ivanhoe-lake-1-killed", "date": "Aug 22, 2013 at 1908 LT", "type": "De Havilland DHC-3 Otter", "operator": "Transwest%20Air-2", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Scott Lake Lodge - Ivanhoe Lake", "msn": "316", "yom": 1959, "flight_number": null, "city": "Ivanhoe Lake", "zone": "Northwest Territories", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1600, "captain_hours_type": 248, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The float-equipped Transwest Air Limited Partnership DHC-3 turbine Otter (registration C-FSGD, serial number 316) departed Scott Lake, Northwest Territories, at approximately 1850 Central Standard Time on a 33-nautical mile, day, visual flight rules flight to Ivanhoe Lake, Northwest Territories. The aircraft did not arrive at its destination, and was reported overdue at approximately 2100. The Joint Rescue Coordination Centre Trenton was notified by the company. There was no emergency locator transmitter signal. A search and rescue C-130 Hercules aircraft was dispatched; the aircraft wreckage was located on 23 August 2013, in an unnamed lake, 10 nautical miles north of the last reported position. The pilot, who was the sole occupant of the aircraft, sustained fatal injuries.", "probable_cause": "Findings as to causes and contributing factors:\r\n1. During approach to landing on the previous flight, the right-wing leading-edge and wing tip were damaged by impact with several trees.\r\n2. The damage to the aircraft was not evaluated or inspected by qualified personnel prior to take-off.\r\n3. Cumulative unmanaged stressors disrupted the pilot’s processing of safety-critical information, and likely contributed to an unsafe decision to depart with a damaged, uninspected aircraft.\r\n4. The aircraft was operated in a damaged condition and departed controlled flight likely due to interference between parts of the failing wing tip, acting under air loads, and the right aileron.\r\nFindings as to risk:\r\nNot applicable.\r\nOther findings:\r\n1. The emergency locator transmitter did not activate, due to crash damage and submersion in water.\r\n2. The aircraft was not fitted with FM radio equipment that is usually carried by aircraft servicing the lodge. Lodge personnel did not have a means to contact the pilot once the aircraft moved away from the dock."}