{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c-45f-expeditor-near-tanauan-6-killed", "date": "Oct 11, 1957 at 1830 LT", "type": "Beechcraft C-45 Expeditor", "operator": "Philippine Aviation Development Company - PADC", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Mountains", "schedule": "Ozamis City – Manila", "msn": null, "yom": null, "flight_number": null, "city": "Tanauan", "zone": "Leyte", "country": "Philippines", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At approximately 0540LT, PI-C622, with 5 passengers and a pilot aboard took off from the Manila International Airport on a charter flight to Ozamis City and return. The aircraft departed Ozamis on the return trip to Manila at approximately 1550LT the same day. At approximately 1830LT, radio contact with the Manila Tower was established and the aircraft reported its position to be over the Province of Batangas, which is about 60 nautical miles SW of Manila and lies on course on the route Ozamis-Manila. On the C-45F Beechcraft it takes about 25 minutes flight time to Manila. The pilot requested information as to the prevailing weather conditions over Manila and vicinity and the weather report as of 1800LT was relayed to and received by the pilot. Further efforts were made by the Tower at 1900LT and 1930LT to contact the aircraft but with negative results. At approximately 2030LT, the Manila Tower received the information from the Rescue Coordinating Centre that the aircraft crashed in a wooded area located on Mt Makiling, in the region of Tanauan, about 45 miles SW of Manila. The aircraft was totally destroyed and all six occupants were killed, among them Carlos P. Romulo, son of the US Ambassador in the Philippines. The pilot founded PADC in 1954. \nCrew:\nPaul L. Gunn, pilot.\nPassengers:\nCarlos P. Romulo,\nAllen O. Gorman, \nRaplh L. Tover,\nZane Duncan, \nHarold Broad. ", "probable_cause": "The Board determined that the probable cause of the accident was the unsuccessful procedure of the pilot in trying to avoid the severe thunderstorm existing over the area at that time. His attempt to fly below the thunderstorm resulted in a ground collision. A contributing factor was the weather over the area which, at the time of the accident, was zero visibility and almost zero ceiling, with a high degree of turbulence, heavy rain and lightning. Also, the Board concluded that even if the right engine of PI-C-622 was feathered at such 1,500-foot altitude over the vicinity of the crash, the aircraft could still have climbed. From evidence gathered by the Board, there was no factual finding either on the airframe or on the engine maintenance that might have contributed to the crash. The Board was more inclined to attach the circumstances surrounding the accident to the weather in that the pilot in all probability flew low to 'get under the overcast'"}