{"url": "https://www.baaa-acro.com/crash/crash-sikorsky-s-35-roosevelt-field-2-killed", "date": "Sep 21, 1926", "type": "Sikorsky S-35", "operator": "Argonauts", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Roosevelt Field - Paris", "msn": null, "yom": null, "flight_number": null, "city": "Roosevelt Field", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The first transatlantic attempt was scheduled for the 16SEP1926 but was abandoned after the aircraft developed a fuel leak. The next available break in the weather was to be the 21SEP1926 and the aircraft was fueled during the previous night with 50 barrels of gasoline. When the aircraft was weighed, it was found to be 4,000 lbs overweight (other sources said 10,000 pounds). The pilot René Fonck with his copilot Lt Lawrence W. Curtin of the United States Navy were joined by a radio operator and a Sikorsky mechanic for the flight. In front of a large crowd at Roosevelt Field the aircraft gathered speed when the auxiliary landing gear broke away. The aircraft failed to get airborne and plunged down a steep slope at the end of the runway and burst into flames. Both pilots escaped uninjured while the radio operator and the mechanic were killed. The aircraft which had cost $80,000 was not insured. The Sikorsky S-35 was an American twin-engined sesquiplane transport later modified to three-engines. It was designed and built by the Sikorsky Manufacturing Company for an attempt by Rene Fonck on a non-stop Atlantic crossing for the 'Orteig Prize'.\r\nCrew:\r\nRené Fonck, pilot\r\nLawrence W. Curtin, copilot,\r\nCharles Clavier, radio, †\r\nJacob Islamoff, mechanic. †", "probable_cause": "Overweight."}