{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-63cf-gander-256-killed", "date": "Dec 12, 1985 at 0645 LT", "type": "Douglas DC-8", "operator": "Arrow%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cairo – Cologne – Gander – Fort Campbell", "msn": "46058", "yom": 1969, "flight_number": "MF1285R", "city": "Gander", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 248, "pax_fatalities": 248, "other_fatalities": 0, "total_fatalities": 256, "captain_hours": 7001, "captain_hours_type": 1081, "copilot_hours": 5549, "copilot_hours_type": 918, "aircraft_hours": 50861, "circumstances": "On 11 December 1985, Arrow Air Flight MF1285R, a Douglas DC-8-63, U.S. registration N950JW, departed Cairo, Egypt on an international charter flight to Fort Campbell, Kentucky (Ky), U.S.A. via Cologne, Germany, and Gander, Newfoundland. On board were 8 crew members and 248 passengers. The flight was the return portion of the second in a series of three planned troop rotation flights originating at McChord Air Force Base (AFB), Washington, U.S.A. and terminating in Fort Campbell. The flight had been chartered by the Multinational Force and Observers (MFO) to transport troops, their personal effects, and some military equipment to and from peacekeeping duties in the Sinai Desert. All 248 passengers who departed Cairo on 11 December 1985 were members of 101st Airborne Division (United States Army), based in Fort Campbell. The flight departed Cairo at 2035 Greenwich Mean Time (GMT) and arrived at Cologne at 0121, 12 December 1985 for a planned technical stop. A complete crew change took place following which the flight departed for Gander at 0250. The flight arrived at Gander at 0904. Passengers were deplaned, the aircraft was refuelled, trash and waste water were removed, and catering supplies were boarded. The flight engineer was observed to conduct an external inspection of portions of the aircraft. The passengers then reboarded. Following engine start-up, the aircraft was taxied via taxiway \"D\" and runway 13 to runway 22 for departure. Take-off on runway 22 was begun from the intersection of runway 13 at 1015. The aircraft was observed to proceed down the runway and rotate in the vicinity of taxiway \"A\". Witnesses to the take-off reported that the aircraft gained little altitude after rotation and began to descend. Several witnesses, who were travelling on the Trans-Canada Highway approximately 900 feet beyond the departure end of runway 22, testified that the aircraft crossed the highway, which is at a lower elevation than the runway, at a very low altitude. Three described a yellow/orange glow emanating from the aircraft. Two of the witnesses testified that the glow was bright enough to illuminate the interior of the truck cabs they were driving. The third attributed the glow to the reflection of the runway approach lighting on the aircraft. Several witnesses observed the aircraft in a right bank as it crossed the Trans-Canada Highway. The pitch angle was also seen to increase, but the aircraft continued to descend until it struck downsloping terrain approximately 3,000 feet beyond the departure end of the runway. The aircraft was destroyed by impact forces and a severe fuel-fed fire. All 256 occupants on board sustained fatal injuries.", "probable_cause": "The Canadian Aviation Safety Board was unable to determine the exact sequence of events which led to this accident. The Board believes, however, that the weight of evidence supports the conclusion that, shortly after lift-off, the aircraft experienced an increase in drag and reduction in lift which resulted in a stall at low altitude from which recovery was not possible. The most probable cause of the stall was determined to be ice contamination on the leading edge and upper surface of the wing. Other possible factors such as a loss of thrust from the number four engine and inappropriate take-off reference speeds may have compounded the effects of the contamination. "}