{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-erie-5-killed", "date": "Aug 31, 2014 at 1150 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Real Estate School", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Denver - Erie", "msn": "46-22164", "yom": 1994, "flight_number": null, "city": "Erie", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 1300, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2910, "circumstances": "The private pilot was inbound to the airport, attempting to conduct a straight-in approach to runway 33. Due to the prevailing wind, traffic flow at the time of the pilot's arrival was on runway 15. Another airplane was departing the airport in the opposite direction and crossed in close proximity to the accident airplane. The departing traffic altered his course to the right to avoid the accident airplane while the accident airplane stayed on his final approach course. The two aircraft were in radio communication on the airport common traffic advisory frequency and were exercising see-and-avoid rules as required. Witnesses reported that as the airplane continued down runway 33 for landing, they heard the power increase and observed the airplane make a left-hand turn to depart the runway in an attempted go-around. The airplane entered a left bank with a nose-high attitude, failed to gain altitude, and subsequently stalled and impacted terrain. It is likely the pilot did not maintain the necessary airspeed during the attempted go-around and exceeded the airplane's critical angle of attack. The investigation did not reveal why the pilot chose to conduct the approach with opposing traffic or why he attempted a landing with a tailwind, but this likely increased the pilot's workload during a critical phase of flight. ", "probable_cause": "The pilot's failure to maintain adequate airspeed and exceedance of the critical angle of attack during a go-around with a tailwind condition, which resulted in an aerodynamic stall. A contributing factor to the accident was the pilot's decision to continue the approach with opposing traffic."}