{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110ej-bandeirante-feijo-2-killed", "date": "Sep 23, 1994 at 0635 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Purus Aerotaxi", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Feijó - Tarauacá - Rio Branco", "msn": "110-087", "yom": 1976, "flight_number": null, "city": "Feijó", "zone": "Acre", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4095, "captain_hours_type": 1119, "copilot_hours": 647, "copilot_hours_type": 187, "aircraft_hours": 21502, "circumstances": "The aircraft was completing a cargo flight from Feijó to Rio Branco with an intermediate stop in Tarauacá, carrying two pilots and a load of 635 kilos of various goods. As the flight to Tarauacá was 10 minutes only, the crew decided to leave the undercarriage down. Shortly after takeoff from Feijó Airport, the crew encountered technical problems with the right engine. The aircraft lost speed and height so the captain decided to raise the landing gear but this was too late. The aircraft struck a tree, causing 3,2 metres of the right wing to be torn off. Out of control, the aircraft crashed in a wooded area, bursting into flames. Both pilots were killed.", "probable_cause": "It was determined that the evening prior to the accident, the aircraft suffered an incident upon landing at Feijó Airport. Upon landing the copilot inadvertently mishandled the engines. Reverse pitch was not applied. Directional control was lost and the left main landing gear ran off the side of the runway. The airplane came to rest 40 metres past the runway end. It was towed to the ramp and the captain conducted an inspection of the airplane. As nothing wrong was noticed, the crew decided to continue the flight after the company base was notified of the occurrence. At the time of the accident, the crew was anxious about the event that occurred the preceding evening and the captain's attention was distracted. Thus, there was a higher level of stress in the cockpit at the time of the accident and the copilot did not want to be the PIC for the second leg due to anxiousness. As the right engine was totally destroyed by a post crash fire, it was not possible to determine the exact cause of its malfunction. Poor weather conditions, poor flight planning and insufficient control inputs on the rudder were considered as contributing factors. "}