{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3a-denver-3-killed", "date": "Dec 4, 1951 at 0725 LT", "type": "Douglas DC-3", "operator": "United-Airlines", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Denver - Denver", "msn": "4999", "yom": 1942, "flight_number": "UA016", "city": "Denver-Stapleton", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 5793, "captain_hours_type": 2404, "copilot_hours": 1250, "copilot_hours_type": 100, "aircraft_hours": 15041, "circumstances": "United Air Lines operates a Flight Training Center at Denver, Colorado, to train applicants for first officer positions with the company. The crew of United Trainer 16 consisted of Senior First Officer Jordan D. Kocher, who had been designated by United Air Lines as captain and instructor, and Trainee First Officers Laurence G. Wilson and Wayne C. Moen. The flight departed Stapleton Airfield at 0655LT. The 0628 weather conditions, upon which the crew had been briefed, were ceiling measured 15,000 feet, visibility 25 miles, and wind northwest 14 knots Ceiling and visibility were unlimited at the time of the accident, with the wind northwest 16 knots. No radio contacts were made by United Trainer 16 after reporting departure time. It was cleared for a training flight of four hours’ duration within a 25-mile radius of Denver Captain Kocher occupied the left pilot’s seat at takeoff. Upon departure, the aircraft load, in addition to the crew, was 820 gallons of gasoline, full oil tanks, and 650 pounds of sand ballast tied down in the rear baggage pit. The load was properly distributed with relation to the aircraft’s center of gravity, and the 22,910-pound gross weight at takeoff was within allowable limits. Witnesses reported that at between 0720 and 0725 the aircraft was seen to stall, enter a spin, and strike the ground in a diving attitude before recovery was effected.", "probable_cause": "The Board finds that the probable cause of this accident was an inadvertent spin at an altitude too low for recovery. The following findings were pointed out:\r\n- The load was properly distributed within approved center of gravity limits and the aircraft was lightly loaded, carrying only the crew in addition to the fuel, oil and ballast,\r\n- No malfunctioning of the aircraft or its components was reported prior to the accident, and no evidence of malfunctioning or failure was indicated by examination of the wreckage,\r\n- The aircraft stalled at an altitude of approximately 8,200 feet MSL (about 3,200 feet above the ground), entered a spin, and crashed before recovery could be effected,\r\n- Power was being developed by both engines upon impact."}