{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-i-jersey-1-killed", "date": "Oct 1, 1980 at 1902 LT", "type": "Cessna 500 Citation", "operator": "Penarth Commercial Properties", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cardiff - Jersey", "msn": "500-0403", "yom": 1980, "flight_number": null, "city": "Jersey", "zone": "Channel Islands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1787, "captain_hours_type": 132, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 138, "circumstances": "The pilot had completed three flights previous to the accident flight on the same day. He left Jersey at 0729 hrs to fly to Coventry via Cardiff for a day of business meetings in the Midlands and to return, again via Cardiff, to Jersey in the evening. Before leaving Coventry at 1729 hrs he had filed Air Traffic Control (ATC) Flight Plans for the sectors to Cardiff and to Jersey, he also checked the weather conditions at Jersey. The conditions shown in the forecast were of poor weather with low cloud and visibility intermittently falling to 400 metres in drizzle with 7 oktas of cloud below 100 feet. The 1650 hrs weather report for Jersey was noted on the top of his copy of the flight plan, this showed: surface wind 2900 at 11 knots, visibility 6000 metres, cloud 4 oktas at 100 feet, 7 oktas at 200 feet, intermittently becoming 3000 metres visibility in drizzle with 6 oktas cloud at 100 feet. Sufficient fuel for a return flight from Jersey was on-loaded at Cardiff, the pilot remarked, to the Customs Officer, that he might have to return because of the weather at Jersey. The aircraft departed Cardiff for Jersey at 1821 hrs. It could not be established whether the pilot obtained the latest weather reports for Jersey, issued at 1720 hrs and 1750 hrs whilst at Cardiff; or if he availed himself of the in-flight weather broadcast service by London Volmet South, which transmitted the 1820 hrs Jersey weather report whilst en route. Had he done so, he would have been aware of deteriorating landing conditions because the 1820 hrs report for Jersey showed: visibility 300 metres, runway visual range (RVR) 800 metres in drizzle and 8 oktas of cloud below 200 feet. By 1842 hrs the aircraft was descending towards Jersey. The pilot was in radio contact with 'Jersey Zone' ATC, he had received his inbound clearance and had been advised of the latest weather conditions at Jersey. Radar guidance was provided by Jersey Zone, then later, by Jersey Approach Control who also advised that the RVR had fallen to 850 metres and, later, to 650 metres. On receipt of this information the pilot asked for the Guernsey weather. He was informed that the weather at Guernsey had improved to 1800 metres visibility although the cloud base was still below 100 feet. At 1857 hrs, when at 7 miles on the approach to runway 27 at Jersey, the pilot reported that he was established on the Instrument Landing System (lLS). He then contacted Jersey Tower controller who cleared G-BPCP to land. During the final stages of the approach, about 45 seconds before the crash, the Tower controller advised that the RVR had improved to 850 metres. This message was not acknowledged. The approach controller continued to observe the progress of the aircraft towards the runway on his radar screen until it was about one mile from the threshold, at which point it appeared to be on the extended centre line of the runway. The approach controller then left the radar screen and went to the window to watch for the aircraft landing. When the aircraft was half a mile from the runway, it was observed by an eyewitness to be on a normal approach path for runway 27. It was lost to view as it passed behind an adjacent house and almost immediately afterwards there was an increase in engine power. This increase was also heard by a professional pilot who was on the aerodrome, about 500 metres from the end of the runway; he said that the \"engines started to spool-up as for an overshoot\" and shortly afterwards he saw a flash and heard an explosion. The aircraft struck the roof of a house situated 190 metres to the north of the runway threshold centre line. The house caught fire, the tail of the aircraft lodged in the blazing roof whilst the remaining structure fell into a courtyard where it was destroyed by fire. The four persons occupying the house at the time were able to escape with minor injuries although one, a young girl, was detained in hospital with serious bums. The pilot was killed. ", "probable_cause": "The accident was caused by the commander failing to execute correctly a missed approach 'go-around' manoeuvre in conditions of poor visibility and low cloud at night. He failed to fly an accurate procedure and allowed the aircraft to continue to descend and turn to the right. It is probable that this resulted from incorrect instrument flying technique but partial physical incapacitation cannot be ruled out. It is also probable that spatial disorientation was a causal factor to the accident. "}