{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-20-marquise-batesville", "date": "Apr 7, 1996 at 1155 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Ronald C. Bingham", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Montgomery - Batesville", "msn": "167", "yom": 1969, "flight_number": null, "city": "Batesville-Panola County", "zone": "Mississippi", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1400, "captain_hours_type": 89, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5400, "circumstances": "The pilot reported that loss of power occurred in both engines after he entered the traffic pattern for a full stop landing. The airplane collided with trees during an emergency landing in a cotton field near the airport. Subsequent review of the aircraft maintenance logs disclosed that Mitsubishi MU-2 Service Bulletin (SB) 130A had not been accomplished on this airplane. According to the manufacturer, an inadvertent failure or the improper installation of a filler cap after refueling may cause an air pressure differential between the center and outboard portions of the main integral fuel tank. Air leakage from the filler cap may result in failure of the fuel transfer system to move fuel from the outboard tank section to the center tank section. To eliminate this possible malfunction, the operator was to remove vent check valves from the bulkhead between the tanks in accordance with SB 130A. The operator's maintenance policies required that, company jet and turbo propeller aircraft be maintained under a maintenance program in accordance with FAR Parts 135.415, 135.417, 135.423, 135.443, and a corporate flight management approved aircraft inspection program (AAIP). The maintenance inspection program also included compliance with manufacturers' service bulletins and service letters. ", "probable_cause": "An anomaly in the fuel system that allowed a pressure differential to occur between the center and outer portions of the main integral fuel tank, which in turn resulted in fuel starvation of both engines. A factor relating to the accident was: failure of company maintenance personnel to remove fuel system vent check valves as recommended by Mitsubishi MU-2 Service Bulletin 130A. "}