{"url": "https://www.baaa-acro.com/crash/crash-short-360-100-sheffield", "date": "Feb 4, 2001 at 1921 LT", "type": "Short 360", "operator": "Aer%20Arann", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dublin – Sheffield", "msn": "3656", "yom": 1984, "flight_number": null, "city": "Sheffield", "zone": "South Yorkshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 25, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4484, "captain_hours_type": 1392, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew were planned to fly a scheduled passenger flight from Dublin to Sheffield airport and the commander was the handling pilot for the flight. Both pilots had operated into Sheffield between five and ten times in the previous three months. The aircraft, which was serviceable, took off from Dublin at 1814 hrs and was routed to Sheffield via the VOR/DME navigation beacon at Wallasey at FL90. Prior to descent, the crew obtained the most recent information from the Automatic Terminal Information Service (ATIS); this report, timed at 1820 hrs, was identified as 'Information Hotel'. The reported conditions at Sheffield were: surface wind variable at 03 kt, visibility 4,000 metres in rain and snow, a few clouds at 600 feet, scattered cloud at 1,200 feet and broken cloud at 3,000  feet, the temperature and dew point were coincident at +1°C and the QNH was 989 hPa. Air traffic control was passed to the Sheffield approach controller when the aircraft was 12 nm from the overhead at which time it was descending to 5,000 feet on the QNH. The crew were informed that the current ATIS was now 'Information India' and the aircraft was cleared to descend to 3,000 feet when within 10 nm of the airport. 'Information India', timed at 1850 hrs, contained no significant changes from 'Information Hotel'. The aircraft weight for the landing was calculated to be 11,100 kg with an associated threshold speed of 103 kt. The aircraft was cleared for the ILS/DME procedure for Runway 28 and the crew requested the QFE which was 980 hPa. The decision height for the approach was 400 feet. During the initial stages of the manually flown ILS approach the commander's flight director warning flag appeared briefly but then disappeared and did not reappear during the remaining period of flight. The de-ice boots had been selected to 'ON' early in the descent when the aircraft had briefly encountered light icing. These de-ice boots were selected to 'OFF' when at 5 nm from the runway at which stage there were no indications of icing and the indicated outside air temperature was +5°C. (This is indicative of an actual air temperature of +2°C.) At 1918:11 hrs the crew reported that they were established on the localiser. When the aircraft intercepted the glidepath, the flaps were set to 15° correctly configuring the aircraft for the approach. The handling pilot recalled that initially the rate of descent was slightly higher than the expected 650 ft/min leading him to suspect the presence of a tailwind, however, the rate of descent returned to a more normal value when approximately 4 nm from the runway. The propellers were set to the maximum rpm at 1,200 feet agl. When the crew reported that they were inside 4 nm they were cleared to land and passed the surface wind, which was variable at 2 kt; they were also warned that the runway surface was wet. Both pilots saw the runway lights when approaching 400 feet agl; the flaps were selected to 30° and confirmed at that position. Both pilots believed that the airspeed was satisfactory but, as the commander checked back on the control column for the landing, the rate of descent increased noticeably and the aircraft landed firmly. Both pilots believed that the power levers were in the flight idle position and neither was aware of any unusual control inputs during the landing flare. Two separate witnesses saw the aircraft during the later stages of the approach and the subsequent landing, one of these witnesses was in the control tower and the other was standing in front of the passenger terminal. They both saw the aircraft come into view at a height of approximately 400 feet and apparently travelling faster than normal. They described the aircraft striking the ground very hard with the left wing low; both heard a loud noise coincident with the initial contact. They then reported that the aircraft bounced before hitting the ground again, this time with the nose wheel first, before bouncing once more. Crew statements and flight data evidence indicate that the aircraft lifted no more than 8 feet before settling on the runway and then remained on the ground. The aircraft was then seen to travel about half way along the runway before slewing to the left and running onto the grass. When the aircraft stopped the left wing tip appeared to be touching the grass. When the aircraft came to rest the tower controller asked the crew if they required assistance, this call was timed at 1921:15 hrs. The crew asked for the fire services to be placed on standby but the controller judged that the situation required an immediate and full emergency response and activated the fire and rescue services. The airfield fire services arrived at the aircraft at 1924 hrs and all the passengers had been evacuated by 1925 hrs. The South Yorkshire fire and rescue services arrived at 1933 hrs and assisted in ferrying passengers to the terminal building. ", "probable_cause": "Evidence from the CVR indicated that the flight was conducted in a thoroughly professional manner in accordance the operator's normal procedures until the final stages of the approach. The recorded data indicate that three seconds prior to touchdown the propeller blade angle changed from the flight range to the ground range. Coincident with this change the CVR recorded sounds consistent with the propellers 'disking' and the FDR indicated that the aircraft then decelerated longitudinally and accelerated downwards. The engineering investigation revealed that the propeller control rigging and the operation of the flight idle baulk were correct. Selection of ground fine requires the pilot to firstly release the flight idle baulk and then lift and pull the propeller levers further back, this combined action rapidly becomes a programmed motor skill in the routine of daily operations. It is therefore possible that the handling pilot unintentionally selected the propellers into the ground fine position whilst still in the air. "}