{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-2-tulsa", "date": "Feb 27, 1951 at 1308 LT", "type": "Convair CV-240", "operator": "Mid-Continent%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Minneapolis – Kansas City – Tulsa – Houston", "msn": "59", "yom": 1948, "flight_number": "MD002", "city": "Tulsa", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 30, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14968, "captain_hours_type": 724, "copilot_hours": 5240, "copilot_hours_type": 704, "aircraft_hours": 4115, "circumstances": "The flight departed Minneapolis, Minnesota, at 0746LT, bound for Houston, Texas, via schedules intermediate points. A crew change was made at Kansas City, Missouri, and no mechanical discrepancies were reported by the incoming crew with the exception that the left engine torque meter pressure indication was approximately 90 FSI, the normal being approximately 145 PSI The flight departed Kansas City and proceeded in a routine manner to Tulsa, arriving at 1244. The left engine, torque meter pressure indicator was considered inoperative because of its low reading, and was, therefore, disregarded during the flight 2. Following touchdown at Tulsa, the propellers were placed in reverse thrust, and when being returned to positive thrust, the left propeller went to the full feathered position and the engine ceased operation. While taxiing to the loading ramp, attempts were made to start the left engine but were not successful. On departure from Tulsa, no difficulty was encountered in starting the left engine, and the propeller which was in the full feathered position was returned to the low pitch position by use of the propeller governor control. Take-off was accomplished from Tulsa at 1302LT, with 29 passengers, including one infant, and a flight crew consisting of Paul C. Walters, captain, Forrest A. Hull, copilot, Cecelia Littell and loan Stoltenberg, the two stewardesses. Total aircraft weight was 40,304 pounds, which was within the allowable gross weight of 40,500 pounds, and the load was distributed so that the center of gravity was within the certificated limits. Prior to take-off, the engines were run up and the pre-flight check accomplished using a check list. All items checked satisfactorily, with the exception that the left engine torque meter pressure indicator was abnormally low. Flaps were positioned at 24 degrees for take-off. The take-of roll was started on Runway 12, and the signal devices in the cockpit indicated that the automatic feathering unit and the anti-detonation injection unit were functioning. During the take-off roll, the copilot called out the following indicated air speeds. VMC, 107 miles per hour, V1, 121 miles per hour, and V2, 122 miles per hour. The aircraft became airborne at 124 miles per hour, or slightly higher. The landing gear was immediately retracted and the air speed was then observed to be 145 miles per hour at this time, at an altitude estimated to be not over 50 feet, the left propeller was observed to feather and then immediately to rotate slowly. It continued to rotate until the aircraft struck the ground. The crew first became aware that the left engine was malfunctioning when a severe vibration was felt immediately after the gear had been retracted and at the same time the aircraft yawed to the left momentarily. Both engine controls were left at the take-off setting, and a single-engine climb was then initiated. The air speed decreased to approximately 124 miles per hour during the climb to a maximum altitude of approximately 150 feet. At this point, since it was doubtful that this air speed could be maintained, the aircraft was leveled off and a shallow turn to the left was made to avoid flying over a building. As the aircraft started turning at an approximate air speed of 122 miles per hour, the captain, according to the copilot, gave the command to retract the flaps from the 24-degree position to the 12-degree position. The copilot states that he immediately executed the command, stopping the retraction of the flaps at 12 degrees. The captain states that he gave the following command, “ 12-degree flaps. No, leave them where they are.” However, the captain testified that the command was given when the air speed was 107 miles per hour and at a point approximately 3000 feet further along the flight path than where the copilot stated he retracted the flaps. While in the left turn, the aircraft was observed to lose altitude steadily until it struck a grove of trees at a point approximately 17 feet above the ground. After striking the trees it slid on the ground on the underside of the fuselage. All passengers and crew were evacuated safely and in an orderly manner. The aircraft was destroyed by fire.", "probable_cause": "The Board determines that the probable cause of the accident was the retraction of the flaps from the take-off setting at a critical air speed, following the failure of the left engine torque meter assembly.\r\nThe following findings were reported: \r\n- The left engine torque meter pressure indication was below normal, prior to take-off,\r\n- The aircraft became airborne at 124 miles per hour, or slightly higher,\r\n- Following the retraction of the gear at approximately 145 miles per hour, there was a failure of the left engine torque meter assembly which caused the left engine to automatically feather,\r\n- The propeller went to the feathered position, but continued to rotate because the failure of the torque meter assembly did not affect engine power output, since the throttle was still advanced and the mixture control was in the normal “rich” position, also, the ADI (anti-detonate injection) was being used and the ignition switch was “on”,\r\n- The aircraft climbed straight ahead to a maximum altitude of approximately 150 feet, at which time the air speed had reduced to approximately 124 miles per hour,\r\n- The aircraft began to lose air speed and a left turn was initiated to avoid flying over a building,\r\n- At the start of the turn, the flaps were retracted from the 24-degree position and the indicated air speed dropped to approximately 107 mph,\r\n- The aircraft continued to lose altitude until it struck the ground,\r\n- The flaps were found to be in the “up” or “near up” position."}