{"url": "https://www.baaa-acro.com/crash/crash-martin-404-near-silver-plume-32-killed", "date": "Oct 2, 1970 at 1300 LT", "type": "Martin 404", "operator": "Golden Eagle Aviation - USA", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Wichita - Denver - Logan", "msn": "14151", "yom": 1952, "flight_number": "GE108", "city": "Silver Plume", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 37, "pax_fatalities": 30, "other_fatalities": 0, "total_fatalities": 32, "captain_hours": 2452, "captain_hours_type": 123, "copilot_hours": 4500, "copilot_hours_type": 30, "aircraft_hours": null, "circumstances": "The airplane was chartered by the Wichita State University football team for a special flight from Wichita to Logan with an intermediate stop in Denver, carrying players and supporters. After departure from Denver-Stapleton Airport, the crew went off course and followed a wrong track. While cruising at an altitude of 10,800 feet, the airplane struck trees and crashed on the slope of Mt Trelease (12,447 feet high) located about 10,6 miles west of Silver Plume. Two crew members and 30 passengers were killed while eight other occupants were seriously injured. The aircraft was totally destroyed by impact forces and a post crash fire. ", "probable_cause": "The intentional operation of the aircraft over a mountain valley route at an altitude from which the aircraft could neither climb over the obstructing terrain ahead, nor execute a successful course reversal. Significant factors were the overloaded condition of the aircraft, the virtual absence of flight planning for the chosen route of flight from Denver to Logan, a lack of understanding on the part of the crew of the performance capabilities and limitations of the aircraft, and the lack of operational management to monitor and appropriately control the actions of the flightcrew."}