{"url": "https://www.baaa-acro.com/crash/crash-airspeed-as10-oxford-i-warrenpoint-3-killed", "date": "Jul 15, 1944", "type": "Airspeed AS.10 Oxford", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Demonstration", "survivors": "No", "site": "City", "schedule": "Newtownards - Newtownards", "msn": null, "yom": null, "flight_number": null, "city": "Warrenpoint", "zone": "Down", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 15th July 1944 two aircraft from 290 Squadron Royal Air Force, based at Newtownards, were entertaining a crowd of spectators at Warrenpoint during a Civil Defence Demonstration when disaster struck. The aircraft involved were a Miles Martinet TT1 (Number MS626), which was used by the Royal Air Force specifically for the role of towing targets and an Airspeed Oxford (Number LX 598) which was a twin engined trainer aircraft. There were misty conditions while the display was taking place and then, while one aircraft was climbing over the town the second aircraft approached from the direction of Carlingford Lough. It appears that the pilots saw each other at the last minute and both attempted to take evasive action with one climbing and the other diving however this was not to be as the tail sections struck each other and as an explosion occurred in the sky pieces of both aircraft rained down. Some sections of wreckage from the Martinet landed in the Church Street and Queen Street area of the town however most crashed at Duke Street and Church Street, where the cockpit was found with the dead crew inside. The Airspeed Oxford fell into Carlingford Lough near to the swimming baths and the bodies of the 3 Pilots who were killed were recovered and taken initially to the Charlotte Street Morgue then on to the Mortuary at Daisyhill Hospital in Newry.\nCrew (290th Squadron):\nW/O Lucien Arthur William Joseph Eccles, pilot,\nF/S Dennis Myers, pilot,\nSgt Peter Sturdy, pilot.\nCrew of the Miles Martinet: \nW/O Albert Gordon Gibb, pilot.\nSgt George William Mosey, air gunner. \nSource: http://ww2ni.webs.com/countydownpart4.htm", "probable_cause": null}