{"url": "https://www.baaa-acro.com/crash/crash-raytheon-390-premier-i-oshkosh", "date": "Jul 27, 2010 at 1816 LT", "type": "Raytheon 390 Premier I", "operator": "Roush%20Fenway%20Racing", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Detroit - Oshkosh", "msn": "RB-161", "yom": 2007, "flight_number": null, "city": "Oshkosh", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9095, "captain_hours_type": 1406, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1265, "circumstances": "The accident occurred during the Experimental Aircraft Association’s Airventure 2010 fly-in convention. Because of the high density of aircraft operations during the fly-in, the Federal Aviation Administration implemented special air traffic control procedures to accommodate traffic demand and maximize runway capacity. Arriving aircraft were issued landing instructions and clearances by a tower controller using a specified tower radio frequency. Departing aircraft were handled by another team of controllers operating on a separate radio frequency that was associated with a mobile operations unit located near the runway. Air traffic control data indicated that the accident airplane established contact with the tower controller and entered a left traffic pattern for runway 18R. As the accident airplane was turning from downwind to base leg, the controller handling departures cleared a Piper Cub for an immediate takeoff and angled departure (a procedure used by slower aircraft to clear the runway immediately after liftoff by turning across the runway edge). The accident pilot was not monitoring the departure frequency, and, therefore, he did not hear the radio transmissions indicating that the departing Piper Cub was going to offset to the left of the runway after liftoff. The accident pilot reported that, while on base leg, he became concerned that his descent path to the runway would conflict with the Piper Cub that was on takeoff roll. He stated that he overshot the runway centerline during his turn from base to final, and, when he completed the turn, his airplane was offset to the right of the runway. The pilot stated that, at this point, he decided not to land because of a perceived conflict with the departing Piper Cub that was ahead and to the left of his position. The pilot reported that he initiated a go-around, increasing engine power slightly, but not to takeoff power, as he looked for additional traffic to avoid. He estimated that he advanced the throttle levers \"probably a third of the way to the stop,\" and, as he looked for traffic, the stall warning stick-shaker and stick-pusher systems activated almost simultaneously as the right wing stalled. The airplane subsequently collided with terrain in a nose down, right wing low attitude. A postaccident review of available air traffic control communications, amateur video of the accident sequence, controller and witness statements, and position data recovered from the accident airplane indicated that the Piper Cub was already airborne, had turned left, and was clear of runway 18R when the accident airplane turned from base to final. The postaccident examination did not reveal any preimpact mechanical malfunctions or failures that would have precluded normal operation of the airplane. The airplane flight manual states that, in the event of a go-around, the pilot should first advance engine thrust to takeoff power and then establish Vref (reference landing approach speed). The pilot's decision not to select takeoff power during the go-around directly contributed to the development of the aerodynamic stall at a low altitude.\n", "probable_cause": "The pilot's decision not to advance the engines to takeoff power during the go-around, as stipulated by the airplane flight manual, which resulted in an aerodynamic stall at a low altitude.\n"}