{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900d-seven-islands-1-killed", "date": "Aug 12, 1999 at 2357 LT", "type": "Beechcraft 1900D", "operator": "R%C3%A9gionnair", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Port-Menier - Seven Islands", "msn": "UE-347", "yom": 1999, "flight_number": "RH347", "city": "Seven Islands", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7065, "captain_hours_type": 606, "copilot_hours": 2600, "copilot_hours_type": 179, "aircraft_hours": 373, "circumstances": "The RégionnAir flight took off from Port-Menier at 23:34 for an IFR flight to Seven Islands. The crew decided to carry out a straight-in GPS approach to runway 31. However, there is no published GPS approach for that runway. The descent from cruise flight into the airport was started late, and the aircraft was high and fast during the approach phase to the NDB. From an altitude of 10 000 feet at 9 nm from the NDB, the rate of descent generally exceeded 3000 fpm. The aircraft crossed the beacon at 600 feet asl. For the last 30 seconds of flight and from approximately 3 nm from the threshold, the aircraft descended steadily at approximately 850 fpm, at 140 to 150 knots indicated airspeed, with full flaps extended. The captain coached the first officer throughout the descent and called out altitudes and distances. The GPWS \"Minimums\" activation sounded, consistent with the decision height selection of 100 feet, to which the captain responded with directions to continue a slow descent. The last call was at 30 feet, 1.2 seconds before impact. Eight seconds before impact, the GPWS voice message \"Minimums, Minimums\" activated. The aircraft continued to descend and struck trees in a near-level attitude, in an area of rising terrain. A post-crash fire destroyed the wings, the right engine, and the right midside of the fuselage. The cabin area remained relatively intact, but the cockpit area separated and was crushed during the impact sequence. The Beechcraft in question was a brand new aircraft, registered just 2 months earlier. This accident was RégionnAir's second Beech 1900 loss in 1999; on January 4 an accident happened on approach to St. Augustin River. No one received fatal injuries in that accident however.", "probable_cause": "Findings as to causes and contributing factors:\r\n1. The pilot flying did not establish a maximum performance climb profile, although required by the company's standard operating procedures (SOPs), when the ground proximity warning system (GPWS) \"Terrain, Terrain\" warning sounded during the descent, in cloud, to the non-directional beacon (NDB).\r\n2. The pilot flying did not fly a stabilized approach, although required by the company's SOPs. The crew did not carry out a go-around when it was clear that the approach was not stabilized.\r\n3. The crew descended the aircraft well below safe minimum altitude while in instrument meteorological conditions.\r\n4. Throughout the approach, even at 100 feet above ground level (agl), the captain asked the pilot flying to continue the descent without having established any visual contact with the runway environment.\r\n5. After the GPWS \"Minimums, Minimums\" voice activation at 100 feet agl, the aircraft's rate of descent continued at 850 feet per minute until impact.\r\n6. The crew planned and conducted, in cloud and low visibility, a user-defined global positioning system approach to Runway 31, contrary to regulations and safe practices.\r\nFindings as to risk:\r\n1. At the time of the approach, the reported ceiling and visibility were well below the minima published on the approach chart.\r\n2. Because the runway was not equipped with a reporting runway visual range system, flying the NDB approach was allowable under the existing regulations.\r\n3. The crew did not follow company SOPs for the approach and missed-approach briefings.\r\n4. Both crew members had surpassed their maximum monthly and quarterly flight times and maximum daily flight duty times. They were thus at increased risk of fatigue, which leads to judgement and performance errors.\r\n5. The first officer likely suffered from chronic fatigue, having worked an average of 14 hours a day for the last 30 days, with only 1 day of rest.\r\n6. Transport Canada was not aware that the company's pilots were exceeding the flight and duty times.\r\n7. The company operations manager did not effectively supervise the flight and duty times of company pilots.\r\n8. The captain had not received the mandatory training in pilot decision making or crew resource management.\r\nOther findings:\r\n1. The emergency locator transmitter activated on initial impact but ceased to transmit shortly thereafter when its antenna cable was severed."}