{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-73v-san-andres-2-killed", "date": "Aug 16, 2010 at 0147 LT", "type": "Boeing 737-700", "operator": "Aires%20Colombia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bogotá – San Andrés", "msn": "32416/1270", "yom": 2002, "flight_number": "ARE8250", "city": "San Andrés-Gustavo Rojas Pinilla", "zone": "San Andrés, Providencia & Santa Catalina", "country": "Colombia", "region": "South America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 125, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7643, "captain_hours_type": 343, "copilot_hours": 1900, "copilot_hours_type": 800, "aircraft_hours": 23485, "circumstances": "The aircraft departed Bogotá-El Dorado Airport at 0007LT on a night schedule service to San Andres Island, carrying 125 passengers and a crew of six. While approaching San Andres-Gustavo Rojas Pinilla Airport, the crew encountered poor weather conditions. Due to heavy rain falls, the crew was informed by ATC that the visibility dropped to 4 km. On short final, flaps were selected down to 30° then the autopilot system was deactivated. After passing 500 feet on approach, the captain repeated the procedures in case of a go-around would be needed due to windshear conditions. Shortly later, the copilot shouted 'go-around' but half a second later, the airplane impacted ground 49 metres short of runway. On impact, the undercarriage and both engines were torn off. The aircraft slid for few dozen metres before coming to rest, broken in three. Two passengers were killed while 129 other occupants were injured, nine seriously.", "probable_cause": "Execution of the flight below the angle of approach, due to a misjudgment of the crew, believing to be much higher, leading the aircraft to fly a typical trajectory of a 'black hole' illusion, which was experienced during the night-time approach to a runway with low contrast surrounded in bright focused lights, aggravated by bad weather of heavy rain."}