{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-4l7-johannesburg", "date": "Oct 26, 2015 at 1206 LT", "type": "Boeing 737-400", "operator": "Comair_2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Port Elizabeth - Johannesburg", "msn": "26960/2483", "yom": 1993, "flight_number": "BA6234", "city": "Johannesburg-Oliver Reginald Tambo (Jan Smuts)", "zone": "Gauteng", "country": "South Africa", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 94, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9186, "captain_hours_type": 2899, "copilot_hours": 5817, "copilot_hours_type": 480, "aircraft_hours": 57543, "circumstances": "The aircraft Boeing 737-400, operated by Comair, flight number BA6234, was on a scheduled domestic flight operated under the provisions of Part 121 of the Civil Aviation Regulations (CARs). The aircraft was on the third leg for the day, after it had performed two uneventful legs. According to their recorded flight plan, the first leg departed from King Shaka International Airport (FALE) to O.R. Tambo International Airport (FAOR), the second leg was from FAOR to Port Elizabeth International Airport (FAPE) on the same day, during which the Captain was flying. During this third leg, the aircraft departed from FAPE at 0820Z on an instrument flight plan rule for FAOR. On board were six (6) crew members, ninety four (94) passengers and two (2) live animals. The departure from FAPE was uneventful, whereby the first officer (FO) was the flying pilot (FP) for this leg. During the approach to FAOR, the aircraft was cleared for landing on runway 03R. The accident occurred at approximately 1 km past the threshold. The crew stated that a few seconds after a successful touchdown, they felt the aircraft vibrating, during which they applied brakes and deployed the reverse thrust. The vibration was followed by the aircraft rolling slightly low to the left. It later came to a full stop slightly left of the runway centre line, resting on its right main landing gear and the number one engine, with the nose landing gear in the air. The crash alarm was activated by the FAOR Air Traffic Controller (ATC). The Airport Rescue and Fire Fighting (ARFF) personnel responded swiftly to the scene of the accident. The accident site was then secured with all relevant procedures put in place. The aircraft sustained substantial damage as the number one engine scraped along the runway surface when the landing gear detached from the fuselage. ARFF personnel had to prevent an engine fire in which they saw smoke as a result of runway contact. The occupants were allowed to disembark from the aircraft via the left aft door due to the attitude in which the aircraft came to rest. The accident occurred during daylight meteorological conditions on Runway 03R at O.R. Tambo International Airport (FAOR) located at GPS reading as: S 26°08’01.30” E 028°14’32.34” and the field elevation 5558 ft.", "probable_cause": "Unstable approach whereby the aircraft was flared too high with high forward speed resulting with a low sink rate in which during touch down the left landing gear\r\nexperienced excessive vibration and failed due to shimmy events. \r\nThe following findings were identified:\r\n- According to the FDR recordings, the aircraft flare was initiated earlier at 65ft than at 20ft as recommended by aircraft manufacture, which contributed to the low sink rate.\r\n- The shimmy damper failed the post-accident lab-test and fluid was found in the thermal relief valve, which could have contributed to the shimmy damper failure.\r\n- According to the lab results, significant wear was found on the upper torsion link bushing and flange, which could have contributed to undamped vibration\r\ncontinuation.\r\n- The aircraft had a tailwind component during landing, which could have prolonged the landing distance.\n"}