{"url": "https://www.baaa-acro.com/crash/crash-bac-111-525ft-kano-149-killed", "date": "May 4, 2002 at 1335 LT", "type": "BAc 111", "operator": "EAS-Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "City", "schedule": "Jos - Kano - Lagos", "msn": "266", "yom": 1980, "flight_number": "EXW4226", "city": "Kano", "zone": "Kano", "country": "Nigeria", "region": "Africa", "crew_on_board": 8, "crew_fatalities": 7, "pax_on_board": 71, "pax_fatalities": 0, "other_fatalities": 78, "total_fatalities": 85, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was completing a regular schedule flight from Jos to Lagos with an intermediate stop in Kano. Weather conditions were good but the OAT at the time of the accident was +42° C. Due to construction works (retreatment of the asphalt surface), the longest runway 24/06 was closed to traffic so the crew was departing from runway 23 at Kano-Mallam Aminu Kano Airport which is 2,600 metres long. Due to high temperature and reduced performances, the aircraft used the entire runway length, overran and rolled on a grassy area for few dozen metres before lifting off. During initial climb, the aircraft encountered difficulties to gain sufficient height and to follow a positive rate of climb when it collided with obstacles and crashed in the district of Gwammaja located about 2 km past the end of runway 23. The aircraft was totally destroyed by impact forces and a post crash fire as well a several buildings, among them a school and a mosque. Among the 77 people on board the aircraft, six survived (five passengers and one stewardess). All 71 other occupants were killed as well as 78 people on the ground. More than 70 other people on the ground were injured, some seriously. It was later reported that the aircraft was out of service for 52 days due to engine problems. Nevertheless, both engines were changed few days prior to the accident and accumulated 10 hours of flight since. ", "probable_cause": null}