{"url": "https://www.baaa-acro.com/crash/crash-north-american-b-25-mitchell-clifton-bluff-6-killed", "date": "Jul 13, 1943 at 1545 LT", "type": "North American B-25 Mitchell", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Nassau - Nassau", "msn": "82-5777", "yom": 1941, "flight_number": null, "city": "Clifton Bluff", "zone": "New Providence", "country": "Bahamas", "region": "Central America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane departed Nassau Airport on an anti-submarine exercise with six crew members on board. The crew reported his position over Great Sale Cay and requested permission for descent through exercise. It is believed that the pilot-in-command lost control of the airplane that crashed into the sea some 8 km southwest off Clifton Bluff. No trace of the wreckage was found and all six crew members, one RAAF and five RCAF were considered as deceased. \n\r\nThe following test was found from RAF record books:\n\r\nB-25 FR-383 DX airborne for Anti-Submarine Patrol Number 3, sent signal reporting position over Great Sale Cay, requested permission for descent through cloud exercise. Then aircraft failed to reply to signal to commence, exercise, was not heard again, failed to return to base, so overdue, action was taken. Four aircraft dispatched to search waters adjacent to island. B-25 FV-946 FF is airborne to search for missing aircraft 3 nm southwest of Main Field, when smoke is sighted through the trees, crew caught sight of wrecked plane in the area, circled aircraft found to be a Baltimore aircraft, signal sent to base conveying this information. Aircraft continued search, oil patch was sighted, patch was 50 yards wide and seemed to extend in an up wind direction, aircraft returned to base and the Captain gave fuller details to the Controller on the information passed. The Marine 216 Craft at Lyford Cay was ordered to put to sea to investigate the oil patches, aircraft set course for the position of the oil patch, aircraft passed the coast, the ASR launch from Lyford Cay was seen heading towards the oil patch, aircraft was directly over the oil patch, and a smoke float was dropped, aircraft flew to the launch and headed it towards the patch, and then dived to 100 feet over the patch, continued to search the oil patch, and the launch was observed to have reduced speed and to be proceeding to the southeast up the patch. Instructions were received to continue the search of the area, and a sailing vessel was observed 4 nm to the north of the patch, heading towards Nassau. Aircraft landed back with nothing further to report. B-25 FR-393 DF is airborne to search south of the island to a distance of 15 nm off shore for oil patch, aircraft circled to investigate, message was received from base, message was sent to base that the ASR launch was standing by and that the aircraft was over the oil patch, oil patch extended 3 miles in length in a west-to-east direction, patch appeared to extend up wind from narrow end, no sign of a dinghy, survivors or wreckage. Aircraft remained over patch for 45 minutes, a constant series of orange flashes were seen emerging from two points near the narrow point of the oil patch, flashes appeared to be on the surface and appeared frequently, but at irregular intervals, message was sent to base that the aircraft was returning. The ASR boat was still standing by. Aircraft landed back with nothing further to report whilst the aircraft was over oil patch, it was joined by two other aircraft. B-25 FV-949 FD is airborne to search for the missing aircraft on receipt of a signal from base to search in the area of the oil patch, the aircraft proceeded to the reported position and observed two other aircraft in the vicinity. The ASR launch was seen to be searching the oil patch series of yellow flashes on the surface of water appearing at the easterly end of the oil patch; these are presumed to be smoke floats, and the aircraft returned to base.", "probable_cause": null}