{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-20-dk-tehran", "date": "Jun 30, 1953 at 1135 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "IranAir", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tehran - Tehran", "msn": "12919", "yom": 1944, "flight_number": null, "city": "Tehran-Mehrabad", "zone": "Tehran City District", "country": "Iran", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft, engaged on a copilot's check in instrument flying and one engine flying, took off from Mehrabad Airport at 0909LT with a Captain acting as check pilot, four copilots under test and a flight engineer. Difficulties were met in feathering and unfeathering during the first flight and the aircraft returned to the apron for advice. The aircraft took off again at 1048 LT for further checks. At approximately 1129LT and at 6,700 feet the port propeller was feathered. A few minutes later the port propeller overspeeded when the Captain tried to unfeather it and, despite repeated efforts, the crew did not succeed in unfeathering or refeathering it and it continued to windmill at about 2100 RPM. Height could not be maintained and the aircraft crash landed in open country 1,500 meters short of Runway 11 at Mehrabad Airport. The aircraft was wrecked causing serious injuries to three occupants and minor injuries to the other three.", "probable_cause": "The Investigation Committee finds that the probable cause of the accident was that, with the left propeller windmilling, the right propeller did not develop sufficient thrust to enable an emergency landing to be carried out on Runway 11 at Mehrabad Airport. The Committee has concluded that this was caused by mishandling of the controls by one or more of the flight crew members since the Committee has not found any evidence of malfunctioning of the right engine or of its propeller. "}