{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46a-60-cs-commando-villavicencio-10-killed", "date": "Jul 9, 2000 at 0825 LT", "type": "Curtiss C-46 Commando", "operator": "Rolando Medina Marmolejo", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Villavicencio – Mitú", "msn": "383", "yom": 1945, "flight_number": null, "city": "Villavicencio", "zone": "Meta", "country": "Colombia", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 17, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 38837, "circumstances": "The aircraft, registered to a private individual, departed Villavicencio-La Vanguardia Airport on a charter flight to Mitú, carrying 17 passengers and two pilots while the aircraft was certified to carry 13 passengers maximum. The crew filed an flight plan with only six people on board. Shortly after takeoff, while in initial climb, the right engine caught fire. The crew activated the fire extinguishing system but as both bottles were empty, the fire could not be contained. The captain initiated a right hand turn to return to the airport when the aircraft stalled and crashed, bursting into flames, two minutes after takeoff. Both pilots and eight passengers were killed while nine other people were injured. The aircraft was totally destroyed by impact forces and a post crash fire. ", "probable_cause": "The decision and inappropriate operation of the pilot to return with a right hand turn with an uncontrolled fire in the n°2 engine leading to a loss of lift on the wing on that side and a loss of control over the aircraft. It was also determined that the aircraft was not airworthy at the time of the accident. The crew flying experience could not be determined as the crew failed to complete their personal logbook. Also, the captain's medical certificate was not valid anymore. "}