{"url": "https://www.baaa-acro.com/crash/crash-fokker-100-birigui", "date": "Aug 30, 2002 at 1045 LT", "type": "Fokker 100", "operator": "TAM%20Brasil-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "São Paulo – Campo Grande", "msn": "11512", "yom": 1994, "flight_number": "JJ3804", "city": "Birigui", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 24, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7300, "captain_hours_type": 4000, "copilot_hours": 4000, "copilot_hours_type": 1200, "aircraft_hours": null, "circumstances": "The aircraft departed São Paulo-Guarulhos Airport on a schedule flight (JJ3804) to Campo Grande, carrying 24 passengers and five crew members. Less than an hour into the flight, while cruising at FL350, the crew encountered technical problems with the fuel system, declared an emergency and was cleared to divert to Araçatuba Airport. On approach, at an altitude of 1,639 feet, both engines failed. The captain realized he could not reach Araçatuba Airport so he attempted an emergency landing in a prairie located 29,5 km from the airport. Upon landing, the aircraft lost its undercarriage, slid on the ground, killed a cow and came to rest. All 29 occupants evacuated, among them four were slightly injured. The aircraft was damaged beyond repair. ", "probable_cause": "While cruising at FL350, the crew noticed a technical problem with the 'fuel filter' and a 'fuel pressure low' was observed on the right engine. Following a check of the flight manual, the crew reported a fuel transfer issue and attempted an emergency diversion. It was determined that both engine stopped following the rupture of a fuel line connected to the right engine, causing a major fuel leak. The disconnection of the fuel line was the consequence of the rupture of a aluminium ring. "}