{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b350-super-king-air-west-houston", "date": "May 18, 2003 at 0935 LT", "type": "Beechcraft 350 Super King Air", "operator": "Oso Rio", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Houston-William P. Hobby – West Houston – Las Vegas", "msn": "FL-24", "yom": 1990, "flight_number": null, "city": "West Houston", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5200, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft overran the departure end of the runway while landing on Runway 33. The 5,200-hour pilot reported that while on the base leg, the annunciator light for the \"low pitch stop\" propeller system on the right side illuminated. The pilot pulled the circuit breaker and left it out, as per the pilot operating handbook (POH). During the landing-roll, the pilot encountered a severe yaw to the right. The pilot added power to the right engine and realigned the airplane down the centerline. He then applied brakes and reverse thrust. The pilot stated that \" it felt like I had no braking action and then felt the right side grab and brake, but not the left.\" The combination of right side braking and the right low pitch system malfunction caused considerable adverse yaw, jerking the plane to the right. The pilot applied power again and straightened the nose of the airplane. He then made the decision to go around, but at this point did not have adequate airspeed or runway length to safely accomplish a go around. He applied the brakes again, and the airplane immediately yawed to the right again, at which time the pilot was unable to compensate before the airplane caught the edge of the runway. The airplane went into the grass, where the pilot attempted to control the direction of the airplane and bring it to a complete stop. Examination of the hydraulic brake hoses from the left and right main landing gears revealed that both hoses appeared to have been damaged with a hand tool.", "probable_cause": "The severed hydraulic brake hoses induced a loss of braking action, which resulted in the pilot's failure to control the aircraft."}