{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130-hercules-california-3-killed", "date": "Jun 17, 2002 at 1445 LT", "type": "Lockheed C-130 Hercules", "operator": "Hawkins-Powers-Aviation-2", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Plain, Valley", "schedule": "Minden - Minden", "msn": "3146", "yom": 1956, "flight_number": "Tanker 130", "city": "Walker", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 10833, "captain_hours_type": null, "copilot_hours": 2407, "copilot_hours_type": null, "aircraft_hours": 21863, "circumstances": "The airplane was making a fire retardant drop over a mountain drainage valley when the wings separated from the fuselage. A videotape of the accident sequence showed the airplane as it flew down the valley and proceeded to make a fire retardant drop. When the drop was almost completed, the airplane's nose began moving up, and the airplane started to arrest its descent and level out. The nose of the airplane continued to rise, and the airplane's wings folded upward until they detached from the fuselage at the center wing box beam-to-fuselage attachment location. Close examination of the video revealed that the right wing folded upward first, followed by the left wing about 1 second later. Metallurgical examination of the center wing box lower skin revealed a 12-inch long fatigue crack on the lower surface of the right wing beneath the forward doubler, with two separate fatigue crack initiation sites at stringer attachment rivet holes (which join the external doubler and the internal stringers to the lower skin panel). The cracks from both initiation sites eventually linked up to create a single crack. The portion of the wing skin containing the fatigue crack was covered by a manufacturer-installed doubler, which would have hidden the crack from view and, therefore, prevented detection of the crack from a visual inspection of the exterior of the airplane. The investigation found that the airplane was probably operated within the maximum takeoff gross weight limits specified in the airplane flight manual. The airplane was delivered new to the U.S. Air Force (USAF) in 1957 and was retired from military service in 1978. The U.S. Forest Service (USFS) acquired it from the USAF in 1988 for use as a fire suppression tanker. Between 1978 and 1988, it was kept in a desert storage facility. It was transferred to a civilian contractor for firefighting operations and modified for that role, then sold to a Part 135 operator. The airplane was certificated by the FAA in the restricted category under a type certificate held by the USFS. A Lockheed study concluded that firefighting missions were substantially more severe than typical military logistics operations and aircraft operated in this role would require inspection intervals as much as 12 times more frequently than typical military transport usage for meeting damage tolerance requirements. Concerning the detectability of the cracks, Lockheed reported that nondestructive x-ray inspection methods in current industry and military depot level maintenance processes could have detected, with high confidence, the fatigue cracks when they were 0.50 to 0.75 inch long. Inspection intervals appropriate for this detectable crack size can be determined from a damage tolerance crack  growth analysis; however, this requires an extensive knowledge of the operational loads environment and internal stresses of the C-130A wing such as would be found in a military depot level maintenance program. The operating limitations accompanying the restricted certificate specified that it be flown and maintained in accordance with the then-current (1988) USAF technical orders for the C-130A. The USAF depot level maintenance program was not included in the maintenance technical orders and was not individually specified on the certificate's operating limitations. The limitations letter did not specify compliance with USAF maintenance program modifications/amendments in technical orders issued after 1988. The operator devised a maintenance and inspection program based on the specified USAF maintenance technical order but did not develop a depot level inspection requirement to ensure continued long-term airworthiness and damage tolerance that would account for the stresses on the airplane resulting from its new firefighting role and the increasing age of the airplanes. Investigation found that there are five separate FAA-issued type certificates owned by five separate firms for the C-130As used as tankers. Although the five certificates have similar maintenance requirements, none are standardized, there is no depot level maintenance program specified for any of them, and none require full compliance with all military airworthiness technical orders. In 1991, the Department of Interior (DOI) began to doubt the continued airworthiness of the C-130A firefighting tanker fleet and was specifically concerned that the lack of a depot level maintenance program or any requirement for compliance with all military airworthiness technical orders could compromise the safety of the airplane. The DOI asked the FAA to standardize the type certificate for the C-130A and mandate improvements in the maintenance and inspection requirements. In a written opinion, the USAF agreed and urged the FAA to mandate that operators establish a depot level type continuing airworthiness program for the airplane and mandate compliance with all technical orders. In a series of meetings held in 1993, FAA management internally agreed that the DOI and USAF positions held merit and began to develop requirements. In late 1993, in a meeting between the FAA, DOI, USFS, and the airplane operators, the USFS and the operators objected to the idea of depot level maintenance programs and full compliance with all technical orders on the basis of the potential economic impact of these requirements. As of the time of the accident, the FAA had not standardized the existing five type certificates nor had they imposed any additional maintenance or inspection program requirements.", "probable_cause": "The inflight failure of the right wing due to fatigue cracking in the center wing lower skin and underlying structural members. A factor contributing to the accident was inadequate maintenance procedures to detect fatigue cracking."}