{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-vancouver-2-killed", "date": "Jul 9, 2009 at 2208 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Canadian%20Air%20Charters", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Vancouver – Nanaimo – Victoria – Vancouver", "msn": "31-8052130", "yom": 1980, "flight_number": "APEX511", "city": "Vancouver", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2300, "captain_hours_type": null, "copilot_hours": 400, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Canadian Air Charters Piper PA-31-350 Chieftain (registration C-GNAF, serial number 31-8052130) was operating under visual flight rules as APEX 511 on the final leg of a multi-leg cargo flight from Vancouver to Nanaimo and Victoria, British Columbia, with a return to Vancouver. The weather was visual meteorological conditions and the last 9 minutes of the flight took place during official darkness. The flight was third for landing and turned onto the final approach course 1.5 nautical miles behind and 700 feet below the flight path of a heavier Airbus A321, approaching Runway 26 Right at the Vancouver International Airport. At 2208, Pacific Daylight Time, the target for APEX 511 disappeared from tower radar. The aircraft impacted the ground in an industrial area of Richmond, British Columbia, 3 nautical miles short of the runway. There was a post-impact explosion and fire. The 2 crew members on board were fatally injured. There was property damage, but no injuries on the ground. The onboard emergency locator transmitter was destroyed in the accident and no signal was detected.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. APEX 511 turned onto the final approach course within the wake turbulence area behind and below the heavier aircraft and encountered its wake, resulting in an upset and loss of control at an altitude that precluded recovery.\r\n2. The proximity of the faster trailing traffic limited the space available for APEX 511 to join the final approach course, requiring APEX 511 not to lag too far behind the preceding aircraft.\r\nFindings as to Risk:\r\n1. The current wake turbulence separation standards may be inadequate. As air traffic volume continues to grow, there is a risk that wake turbulence encounters will increase.\r\n2. Visual separation may not be an adequate defence to ensure that appropriate spacing for wake turbulence can be established or maintained, particularly in darkness.\r\n3. Neither the pilots nor Canadian Air Charters (CAC) were required by regulation to account for employee duty time acquired at other non-aviation related places of employment. As a result, there was increased risk that pilots were operating while fatigued.\r\n4. Not maintaining engine accessories in accordance with manufacturers’ recommendations can lead to failure of systems critical to safety.\r\nOther Finding:\r\n1. APEX 511 was not equipped with any type of cockpit recording devices, nor was it required to be. As a result, the level of collaboration and decision making discussion between the 2 pilots remains unknown."}