{"url": "https://www.baaa-acro.com/crash/crash-vickers-viscount-808-belfast", "date": "Mar 24, 1996 at 2135 LT", "type": "Vickers Viscount", "operator": "British%20World%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Belfast - Belfast", "msn": "291", "yom": 1958, "flight_number": null, "city": "Belfast-Aldergrove", "zone": "Antrim", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15601, "captain_hours_type": 3918, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The two crew members had reported at Stansted at 1130 hrs to catch a passenger flight to Belfast where they were rostered for a training detail; immediately prior to this duty day, they both had two days off. The first officer had completed a command course on the simulator the previous week and this training detail was part of his conversion to the left hand seat; the training captain had also been involved in the simulator the previous week. The detail was planned to involve two flights; the first would cover the mandatory items for the type rating test (1179) and the second would complete the first officer's base check and initial line check. On arrival at Belfast, the crew checked in to the airport hotel,changed into uniform and went to the meteorological office at approximately 1600 hrs for a weather briefing. This briefing indicated that the weather was close to the limits required for the completion of the type rating test items but, with a forecast of a suitable area to the north of the airfield, the crew decided to carry on with the detail. For the first flight, G-OPFE left the stand at 1815 hrs and took off at 1827 hrs. All the necessary items were completed successfully, albeit with some difficulty because of the variable cloud base, and the crew landed at 2010 hrs. By 2015 hrs, G-OPFE was back on stand and the crew kept the engines running while they had a short brief for the second flight. At 2025 hrs,they taxied off stand and positioned for a departure off Runway 07. On this second flight, following a take off at 2031 hrs, the training captain initiated an outboard engine failure just after VR by retarding the associated throttle. The appropriate remedial actions were simulated andthe first officer carried out a 3 engine ILS approach and go-around to Runway 17; there had been no abnormal switch positions required because of the simulated engine failure. The go-around was followed by a 3 engine VOR approach to landon Runway 07. The different runways were used because there is no ILS on Runway 07, the runway in use. After landing,the first officer repositioned G-OPFE and made a full power take-off from Runway 07, commencing his roll at the intersection with Runway 17. The aircraft was climbed to 4,000 feet amsl and established in the cruise at 200 kt IAS. During this cruise, there were no unserviceabilities noted with G-OPFE. The crew continued in a north-westerly direction until approximately 5 nm from Eglinton Airport when they requested, and were given, permission to turn back towards Belfast International Airport. For the subsequent approach, the surface wind was 090°/15 kt,visibility was 2,500 metres and the cloud was scattered at 1,000 feet and overcast at 4,200 feet agl. After establishing contact with Aldergrove radar, the crew were cleared to commence a VOR/DME approach to Runway 07 for afinal landing. It was confirmed from the CVR that the 'Initial Approach' checks were completed 'down to the line'. However,although the first officer at one stage commented that it was a bit early to complete the rest of the 'Initial Approach' checks,there was no evidence that these or the 'Finals' checks were subsequently requested or actioned. The landing gear would normally be selected down during the 'Initial Approach, below the line' checks and confirmed during the 'Finals' checks. The final approach profile was closely monitored by the commander and, from comments on the CVR, the approach appeared very stable. In the later stages of approach, the first officer was heard asking for 85% flap andthe training captain was heard confirming this selection. These were the only comments heard referring to flap selection or position,although it is acceptable company practice for crews to request flap changes by visual means. The final flap position (100%)is used to decrease ground roll and is selected during the flare or after touchdown. Other relevant comments which were heardon the CVR included a reference to landing lights; this is the last item on the \"Finals\" checks. As the throttles were retarded in the flare, the gear warning horn was heard on the CVR, followed within 23 seconds by sounds of the propellers contacting the runway surface. After coming to a stop on the runway, the crew secured and evacuated the aircraft. The airport Rescue and Fire Fighting Service were on the scene inless than one minute. ", "probable_cause": "Subsequent runway and aircraft examination showed that G-OPFE had made a gentle touchdown on Runway 07 close to the PAPI position, somewhat left of the centreline. Initial contact wason both inboard propeller tips. After a few metres, both outboard propellers contacted the runway, progressively followed by radio aerials mounted beneath the fuselage, the fuselage undersurface, the inboard part of both inboard flaps and the No 3 engine nacelle. The aircraft continued down the left side of the runway,across the intersecting Runway 17/35, and came to rest on Runway 07 after a ground slide of approximately 480 metres. Damage consisted of severe bending and scraping of all propeller blades, abrasion of much of the undersurface of the fuselage and the No 3 engine nacelle lower cowl, and abrasion and moderate distortion of the inboard flaps A very small quantity of fuel was reportedly released from the No 3 engine nacelle. There was no fire. Examination showed that the flaps had been in the fully deployed position (100%, 47°) at touchdown and the flap lever was found selected at 47°. All three landing gear legs had been fully retracted at touchdown and throughout the ground slide. After the aircraft had been lifted, the three legs deployed into downlock without difficulty using the emergency lowering procedure. The landing gear selector was found with the 'Down' button pushed in, but the electric actuator that is switched by the selector was found in the fully up position; this actuator had not been disturbed during recovery operations. The landing gear indicator was found in the 'Day' (ie bright) setting. Examination and testing of relevant systems was carried out, except for the hydraulic generation system; this indicated that the landing gear operating and indication systems functioned normally."}