{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226t-merlin-iii-byers-1-killed", "date": "Dec 19, 1997 at 2017 LT", "type": "Swearingen SA226T Merlin III", "operator": "Big Bang Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Front Range - Aspen", "msn": "T-225", "yom": 1973, "flight_number": null, "city": "Byers", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3316, "captain_hours_type": 479, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6599, "circumstances": "The pilot departed Front Range Airport (elevation 5512 feet) at approximately 2008, climbed to 7,000 feet msl, accelerated to 270 knots, and requested his IFR clearance. Weather at the time of N950TT's departure was 500 feet overcast; witnesses reported the tops of the thin cloud condition were 8,500 feet msl and it was very dark on top (no stars or moon). The pilot made several changes in airspeed and climb rate until radar indicated that he had entered an 8,500 fpm decent. The pilot reported to ATC that he had 'stalled' the airplane. Radar indicated that he then climbed at 7,500 fpm until his estimated airspeed was 10 knots, and then subsequently descended again at 8,400 fpm until he impacted the frozen ground. The pilot had flown 4 times for 7 hours in the previous 40 days. Five airline pilots, each of who had 3,000 to 5,000 hours in Swearingens, stated individually that even though the airplane is single pilot certified, they believed that 'its a two pilot airplane--because the work load is too high.'", "probable_cause": "The pilot inadvertently stalling the airplane and his subsequent spatial disorientation which prevented him from maintaining airplane control. Factors were excessive workload on the pilot and the dark night light conditions. "}