{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226t-merlin-iiib-bergen-3-killed", "date": "Jun 20, 2008 at 1026 LT", "type": "Swearingen SA226T Merlin", "operator": "Helitrans", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Bergen - Bergen", "msn": "T-342", "yom": 1980, "flight_number": null, "city": "Bergen", "zone": "Hordaland", "country": "Norway", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 15750, "captain_hours_type": 12000, "copilot_hours": 6310, "copilot_hours_type": null, "aircraft_hours": 13551, "circumstances": "The flight was a skill-test for a candidate that was hired as a first officer on SA226-T(B) Merlins for the operator Helitrans. He was one of two candidates that were employed by the company in early 2008. They underwent ground school and flight training in cooperation with the Swedish Type Rating Training Organisation (TRTO) Trafikkhögskolan. Later it became clear that the Swedish Civil Aviation Authority (CAA) did not accept skill-tests limited to first officer duties on a single pilot certified airplane, as the Norwegian CAA did. The candidates did not possess the skills to act as commanders on the Merlin, and there was a period of uncertainty while the operator and the Norwegian CAA discussed how to conduct the skill-tests, in particular whether to use a simulator or an actual airplane. After several months the issues were resolved and an examiner was appointed. There was a limited slot on a Thursday and a Friday where the examiner, the instructor/commander and the aircraft was available at Bergen Airport Flesland. The first candidate performed the skill-test on Thursday. The weather was not suited for flying skill tests. It was low ceiling, rain showers and winds up to 40 kt and turbulence. Turbulence caused the stick pusher to activate during the demonstration of slow flight. The commander decided to pull the circuit breaker for the Stall Avoidance and Stability Augmentation System (SAS) presumably to avoid nuisance activations of the stick pusher. After the slow flight demonstration, the examiner asked the candidate to demonstrate a stall. The candidate found this exercise frightening as she experienced great difficulties, having to use all her available physical strength to regain normal flight with the engines on full power and in IMC conditions. The weather was similar on Friday with even stronger winds. The SAS circuit breaker was not reset. This was confirmed during the start-up check. The examiner requested a similar program during this skill-test as he did the day before. However, when it came to demonstrating stalls, the examiner asked for a slow flight up to first indication of stall, and not an actual stall. He asked for call outs and a minimum loss of altitude recovery. The commander undertook the tasks of adding power and retracting gear and flaps on the candidate’s request. It was IMC. During this exercise the crew lost control of attitude and airspeed. The stall warning came on, but the airspeed decreased, even with full power applied. Radar data show that the altitude increased 200 – 400 ft during the period where control was lost. Airspeed decreased to about 30 kt and a sink rate of about 10 000 ft/min eventually developed. The airplane hit the sea in a near horizontal attitude about 37 sec. after control was lost. All three on board were fatally injured. The accident aircraft was used for coastguards duties and was modified with external sensors and antennas. The AIBN made a Computational Fluid Dynamics analysis in order to determine whether these installations influenced on stability and flight characteristics in the slow flight and pre-stall regime. It was found that the modifications reduced the overall performance, but did not result in any significant degradation of stability and control in this regime. There was no investigation as to any influence on the characteristics of a fully developed stall. The AIBN is of the opinion that this accident highlights the need for a change in the current training on initial stall recovery techniques, especially the focus on minimum loss of altitude at the expense of breaking the stall by lowering the nose and thus reducing the angle of attack. The AIBN has issued two safety recommendations to the Norwegian CAA; one regarding the conduct of skill-tests for pilots in a multi crew concept on single pilot airplanes, and one suggesting increased focus on flight examiners tasks.", "probable_cause": "The following findings were identified:\r\n- Even if the weather on the day of the accident was within the permitted limits, it was not suitable to perform 'airwork' or training exercises,\r\n- The captain thought the weather was not suitable for conducting the skill test for the second candidate. That he nevertheless agreed to take the test may be due to the fact that he felt\r\na pressure to complete the mission,\r\n- The flight was conducted in challenging conditions and there is reason to believe that atmospheric turbulences may have contributed to the loss of control during the skill flight,\r\n- The flight was completed in clouds, and it can be assumed that the lack of visual references in the clouds contributed to the loss of control."}