{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950-near-werris-creek-1-killed", "date": "Jul 19, 1988 at 1045 LT", "type": "Fletcher FU-24", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Werris Creek - Werris Creek", "msn": "162", "yom": 1970, "flight_number": null, "city": "Werris Creek", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was conducting superphosphate spreading operations in fine and clear weather conditions. The paddock being treated sloped uphill, and there were heavily timbered peaks beyond the paddock. The pilot had spread the paddock the previous day under similar conditions. On this occasion the aircraft was apparently performing normally as the first swath run was completed, but the aircraft did not appear to gain any appreciable height as it approached the hills. It was then seen to adopt a steep nose-up attitude and commence a wingover type manoeuvre. During this manoeuvre the aircraft struck trees and then impacted the ground. A fierce fire broke out and engulfed the wreckage. The pilot, sole on board, was killed.", "probable_cause": " Although the investigation was hampered by the extensive fire damage, no defect or malfunction was discovered which might have contributed to the accident. The reason the pilot, who had extensive agricultural experience, chose to conduct swath runs towards steeply rising ground was not determined. The wind direction had changed since the previous day, and the aircraft was likely to have been affected by downdrafts on the lee side of the hills. When the pilot realised the aircraft was not performing as expected, he evidently attempted to dump the remaining load and reverse the direction. However, there was insufficient aircraft performance available to successfully complete this manoeuvre.\r\nSignificant Factors:\r\nThe following factors were considered to be relevant to the development of the accident:\r\n1. The pilot elected to conduct spreading runs towards steeply rising ground, when safer alternatives were available.\r\n2. It was likely that downdraft conditions existed on the lee side of the hills. \r\n3. The pilot evidently misjudged the climb performance of the aircraft.\r\n4. The pilot delayed attempting a reversal of direction beyond the point where such a manoeuvre could be safely accomplished. "}