{"url": "https://www.baaa-acro.com/crash/crash-hawker-siddeley-hs121-trident-felthorpe-4-killed", "date": "Jun 3, 1966 at 1835 LT", "type": "Hawker Siddeley HS.121 Trident", "operator": "Hawker%20Siddeley", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Hatfield - Hatfield", "msn": "2126", "yom": 1965, "flight_number": null, "city": "Felthorpe", "zone": "Norfolk", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 4500, "captain_hours_type": 1600, "copilot_hours": 6800, "copilot_hours_type": null, "aircraft_hours": 1, "circumstances": "The aircraft took-off from Hatfield at 1652 hours to carry out the first of a series of production test flights for the purpose of qualifying for a Series Certificate of Airworthiness. The schedule for the flight called for stalling tests should the aircraft and the flight conditions be suitable. After take-off the aircraft climbed towards the north-east and at about 1830 hours, after completing the greater part of the flight test schedule, the stalling tests were begun. Three approaches to the stall were made in order to check the aircraft's stall warning and stall recovery systems and the flight engineer's log shows that with the aircraft in the landing configuration the stick shaker operated at 102 kt and the stall recovery system at 93 kt. The fourth stalling run was made at a height of 11 600 ft with the aircraft still in the landing configuration but, in accordance with the requirements of the test schedule, the stall warning and stall recovery systems had been made inoperative. Radio telephony communication with the aircraft consisted only of routine 11 messages until at 1834 hours when the pilot-in-command reported We are in a superstall at the moment\". This was the last radiocommunication received. At about this time the aircraft was seen over Felthorpe flying very slowly heading south-west at about 10 000 ft. The nose was seen to go up 30 to 40 degrees and the aircraft began to turn to port; the starboard wing then dropped sharply and, following a short burst of engine power, the aircraft went into a flat spin to starboard. The spin continued, the aircraft turning once every 6 to 8 seconds until it reached the ground about a minute and a half later. All four crew members were killed. ", "probable_cause": "During a stalling test decisive recovery action was delayed too long to prevent the aircraft from entering a superstall from which recovery was not possible. The flight was being conducted in accordance with an agreed test schedule. No evidence of pre-crash failure of the aircraft has come to light. During the final stalling run speed was reduced at a rate greater than 1 kt per second and recovery action was not initiated until the speed had fallen beyond the limit set by the test schedule. "}