{"url": "https://www.baaa-acro.com/crash/crash-douglas-ts-62-near-vitim-10-killed", "date": "Apr 17, 1950 at 0812 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Irkutsk – Kirensk – Olyokminsk – Yakutsk", "msn": "12136", "yom": 1943, "flight_number": "SU543", "city": "Vitim", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 16, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3686, "circumstances": "En route from Kirensk to Olyokminsk, the left engine caught fire. The captain decided to reduce his altitude but the fire spread to the wing and reached the cabin via the heating system. Descending to an altitude of 2,000 meters, the left engine separated from the aircraft and the aircraft later crash landed in a field located 29 km southwest of Vitim and came to rest in flames. All four crew members and six passengers were able to escape while ten passengers were killed, apparently intoxicated by smoke. ", "probable_cause": "The cause of the in flight fire on the left engine could not be determined with certainty. However, the assumption that the fire was caused by the failure of a connection on the fuel line was not ruled out. The following factors were considered as contributory: \r\n- the cabin crew failed to us the fire extinguisher, and also failed to close the heating system valve, which contributed to the quick propagation of the fire into the cabin, \r\n- the captain decided to perform a steep descent that also contributed to the fire's propagation,\r\n- the entire crew failed to give appropriate instructions to passengers prior to and after the accident, and failed to assist them for a safe evacuation, causing the death of 10 women and children. "}