{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-buenos-aires", "date": "Mar 7, 2019 at 1930 LT", "type": "Learjet 35", "operator": "Baires%20Fly", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rosario – Buenos Aires", "msn": "35-373", "yom": 1981, "flight_number": null, "city": "Buenos Aires-Aeroparque-Jorge Newbery", "zone": "Buenos Aires City", "country": "Argentina", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Rosario-Islas Malvinas Airport at 1900LT on a charter flight to Buenos Aires, carrying two passengers and two pilots. On approach to Buenos Aires-Aeroparque-Jorge Newbury Airport by night, the crew encountered poor weather conditions with thunderstorm activity, heavy rain falls and strong winds. The aircraft landed 200 metres past the runway 13 threshold and the crew stated the braking procedure. After a course of about 500 metres, the aircraft deviated to the left and veered off runway. It rolled on a grassy area then contacted the concrete taxiway, causing both main landing gear to be torn off. The aircraft came to rest 860 metres from the runway threshold and was damaged beyond repair. All four occupants evacuated safely. ", "probable_cause": "Conclusions regarding factors related to the accident:\r\n- At the time of the event, meteorological conditions were poor with a strong storm, rain and gusts of wind.\r\n- Visual cues may have been reduced due to heavy rain falls.\r\n- The aircraft was displaced from the runway center line when it made contact with the ground.\r\n- The aircraft made contact with the left landing gear off the runway due to strong gusts of wind.\r\n- The lateral excursion to the grassy area occurred due to the impossibility of recovering the trajectory of the aircraft, once it was displaced by the action of the wind."}