{"url": "https://www.baaa-acro.com/crash/crash-cessna-404-titan-ii-mt-meru-12-killed", "date": "Sep 1, 1999 at 1026 LT", "type": "Cessna 404 Titan", "operator": "Northern Air", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Seronera Lodge - Kilimanjaro", "msn": "404-0805", "yom": 1981, "flight_number": null, "city": "Mt Meru", "zone": "Arusha Region", "country": "Tanzania", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 16500, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Two Cessna 404 Titan II operated by Northern Air departed Seronera Lodge in the mid morning on a charter flight to Kilimanjaro Airport, carrying a total of 18 US tourists and two pilots (7 passengers and one pilot in the first aircraft and 11 passengers and one pilot in the second aircraft). The passengers should be later transferred from Kilimanjaro to Nairobi with an Air Kenya aircraft. After takeoff, the pilot in the first Cessna warned the second pilot about the lack of visibility in the area. While cruising in marginal weather conditions at an altitude of 8,770 feet, the second aircraft struck the southern slope of Mt Meru (4,565 metres high). The wreckage was found the following day at an altitude of 2,833 metres. The aircraft was destroyed by impact forces and all 12 occupants were killed. ", "probable_cause": "Controlled flight into terrain after the pilot failed to maintain the minimum safe altitude for the area of Mt Meru. It was determined that the pilot informed his colleague he wanted to maintain FL110 at a distance of 53 km from the first beacon but for unknown reasons, he was maintaining an insufficient altitude of 9,500 feet at a distance of 45 km from the first beacon. Investigations were unable to determine the reason why the pilot was unable to maintain the minimum safe altitude. Poor weather conditions with low clouds and drizzle was a contributing factor. "}