{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-23-cincinnati-58-killed", "date": "Nov 8, 1965 at 1902 LT", "type": "Boeing 727-100", "operator": "American-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York - Cincinnati", "msn": "18901", "yom": 1965, "flight_number": "AA383", "city": "Cincinnati-Northern Kentucky", "zone": "Kentucky", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 5, "pax_on_board": 56, "pax_fatalities": 53, "other_fatalities": 0, "total_fatalities": 58, "captain_hours": 16387, "captain_hours_type": 225, "copilot_hours": 14400, "copilot_hours_type": 35, "aircraft_hours": 938, "circumstances": "American Airlines Flight 383, a Boeing 727, N1996, departed New York-LaGuardia Airport (LGA) at 17:38 for a scheduled flight to the Greater Cincinnati Airport (CVG). It was to be an IFR flight with a requested cruising altitude of 35,000 ft and an estimated time en route of 1 hour 23 minutes. The en route part of the flight was uneventful. About 18:55, when the flight was about 27 miles southeast of the Greater Cincinnati Airport, radar traffic control was effected by Cincinnati Approach Control. Subsequent descent clearances were issued to the flight and at 18:57 flight 383 reported: \"...out of five for four and how about a control VFR, we have the airport.\" The Approach Controller replied: \"... continue to the airport and cleared for a visual approach to runway one eight, precip lying just to the west boundary of the airport and its ... southbound.\" The crew acknowledged the clearance and the controller cleared the flight to descend to 2,000 feet at their discretion. At 18:58 Approach Control advised the flight that its radar position was six miles southeast of the airport and instructed them to change to the Cincinnati tower frequency. One minute later the tower controller cleared the flight to land. During the approach the visibility at the airport deteriorated as it began to rain. The tower controller reported: \"American three eighty three we are beginning to pickup a little rain right now.\" At 19:01:14 the tower asked: \"American three eighty three you still got the runway Okay?\" To which the crew replied \"Ah just barely we'll ah pickup the ILS here\". At this point, thirteen seconds before impact, the 727 was descending at a rate of 2100 feet/min to an altitude of approximately 725 feet (165 ft below published field elevation) with the airspeed holding at 160 knots. The descent rate then decreased to about 625 ft/min for approximately the last 10 seconds of flight with the airspeed decreasing to 147 knots at impact. The right wing struck a tree at an altitude of 665 feet msl which is approximately 225 feet below the published field elevation. The aircraft slid a distance of 340 feet relatively intact through scrub trees and ground foilage before impacting and coming to rest amidst a group of larger trees. Following impact an intense ground fire erupted which completely destroyed the aircraft cabin forward of the tail section. A stewardess and three passengers survived while 58 other occupants were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the failure of the crew to properly monitor the altimeters during a visual approach into deteriorating visibility conditions."}