{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-manaus-0", "date": "Sep 16, 2019 at 1225 LT", "type": "Cessna 208B Grand Caravan", "operator": "twoflex", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Manaus - Maués", "msn": "208B-0543", "yom": 1996, "flight_number": null, "city": "Manaus-Eduardo Gomes", "zone": "Amazonas", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 22800, "captain_hours_type": 14150, "copilot_hours": 947, "copilot_hours_type": 791, "aircraft_hours": null, "circumstances": "The single engine airplane departed Manaus-Eduardo Gomes Airport Runway 29 in heavy rain falls as weather conditions deteriorated shortly prior to takeoff. After liftoff, while in initial climb, the airplane lost altitude and crashed in a dense wooded area located 600 metres past the runway end. The aircraft was destroyed by impact forces and all 10 occupants were injured, among them six seriously. At the time of the accident, weather conditions were poor with heavy rain falls, turbulence and windshear.", "probable_cause": "The accident was the consequence of the combination of the following factors:\r\n- Control skills – undetermined.\r\nWhile facing adverse conditions, the use of controls may have been inappropriate for the situation and may have contributed to the aircraft not being able to maintain a positive climb rate.\r\n- Attitude – undetermined.\r\nFamiliarization with the region may have led to an attitude, on the part of the PIC, of minimizing the importance of analyzing adverse weather conditions, to the detriment of compliance with the minimum limits established by the company in its manuals.\r\n- Training – undetermined.\r\nIt is possible that, due to possible inadequate training, the SIC did not identify the critical situation that arose shortly after the take-off in time to assist the PIC in maintaining flight control.\r\n- Tasks characteristics – undetermined.\r\nThe characteristics present in the type of operation, compliance with schedules without the possibility of delays, due to the runway closing period, may have favored the self imposed pressure on the part of the PIC, leading him to operate with reduced safety margins.\r\n- Adverse meteorological conditions – a contributor.\r\nThe conditions at the time of the take-off contributed to the aircraft not being able to maintain the flight with a positive climb rate. The probable occurrence of Windshear determined that the trajectory of the aircraft was modified until its collision with the ground.\r\n- Crew Resource Management – undetermined.\r\nOn the part of the SIC, no assertive attitude was perceived in the sense of alerting the PIC that those conditions were not favorable for takeoff. Thus, the crew decided to carry out the take-off despite the company's SOP.\r\n- Organizational culture – undetermined.\r\nThe company encouraged compliance with the legs even though, within the planning of flights, there was not an adequate margin of time to absorb any delays. This culture may have influenced the PIC's decision-making, which, despite encountering adverse conditions, chose to take off, since the short time on the ground in the intermediate locations did not allow room for delays.\r\n- Emotional state – undetermined.\r\nThe reports indicated that the PIC felt pressured to perform the take-off even in the weather conditions found on the day of this occurrence. Also, according to the interviewees, this pressure would be related to the fulfillment of the flight schedule and the need to keep to the scheduled times. In this way, it is possible that their assessment of the performance of the flight was influenced by the stress resulting from the pressure to complete the flight within the expected time, given the closing time of the runway for works. \r\n- Flight planning – a contributor.\r\nThe flight planning was not carried out properly, considering that the planned schedules and routes would end after the closing time of the SBEG runway for works, provided for in the NOTAM. This meant that there was little time to adjust the legs, increasing the workload and stress in the cabin.\r\n- Decision-making process – a contributor.\r\nThere was a wrong assessment of the meteorological conditions, which contributed to the decision of performing it in an adverse situation.\r\n- ATS publication– undetermined.\r\nThe TWR-EG did not inform, before the take-off, of the changes in the significant weather conditions that were occurring at the terminal, which could have contributed to the PIC's decision-making."}