{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-troopship-400m-lima-42-killed", "date": "Dec 8, 1987 at 2015 LT", "type": "Fokker F27 Friendship", "operator": "Aviacion%20Naval%20del%20Peru", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Pucallpa - Lima", "msn": "10548", "yom": 1977, "flight_number": null, "city": "Lima", "zone": "Lima", "country": "Peru", "region": "South America", "crew_on_board": 6, "crew_fatalities": 5, "pax_on_board": 37, "pax_fatalities": 37, "other_fatalities": 0, "total_fatalities": 42, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5908, "circumstances": "The aircraft, operated by the Peruvian Navy, crashed at sea off the coast of Lima, Peru. On board the aircraft were 16 football players of the Alianza Lima football team, staff, cheerleaders and referees. Alianza Lima had played a match against Deportivo Pucallpa and was returning to Lima in the evening. The aircraft departed Pucallpa at 18:30 hours. During the approach to Lima, the flight crew noticed an indication that the nose landing gear would not lock down. A low flyby was flown to let the air traffic control tower check the gear. The gear seemed OK and the flight repositioned for another approach. In darkness, at about 20:15 hours, the aircraft impacted the water. Initially three occupants survived the impact, but only the pilot was rescued alive the following morning. An investigation showed that the flight crew members were not accustomed to flying at night. The captain, the only survivor of the accident, recorded only 5.3 night-flight hours in the last 90 days before the accident, 3.3 hours in the last 60 days; and none in the last 30 days. The co-pilot had 90 minutes of night-flight experience two months before the crash. Also, because of the limited proficiency in English, the co-pilot carried out the wrong emergency procedure after being instructed by the captain to carry out a procedure to take care of the landing gear indication. Additionally, the aircraft was dispatched with several technical issues. The airplane did not have an inertial navigation system (INS); UHF communication had low reception; the very high frequency omnidirectional range (VOR) receiver had low sensitivity; the radio altimeter oscillated preventing the pilots from seeing the exact altitude; and finally, the actuator for the front landing gear had worn down.", "probable_cause": null}