{"url": "https://www.baaa-acro.com/crash/crash-boeing-c-97g-stratofreighter-mexico-city-65-killed", "date": "Jul 30, 1987 at 1703 LT", "type": "Boeing C-97 Stratofreighter", "operator": "Belize Air International", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "City", "schedule": "Mexico City - Miami", "msn": "16687", "yom": 1952, "flight_number": null, "city": "Mexico City-Benito Juarez", "zone": "Federal District of Mexico City", "country": "Mexico", "region": "Central America", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 54, "total_fatalities": 65, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine airplane departed Mexico City-Benito Juarez Airport at 1700LT on a cargo flight to Miami-Intl, Florida, carrying eight passengers, four crew members and a load consisting of 18 racing horses. After takeoff, during initial climb, the aircraft encountered difficulties to gain sufficient altitude. The crew elected to add power but the aircraft failed to gain height. The captain attempted an emergency landing on a road when the aircraft struck power lines and crashed in the city, few km from the airport. The aircraft as well as several houses and buildings were destroyed. The captain was rescued while 11 other occupants as well as 54 people on the ground were killed. 50 other people were wounded, some seriously. ", "probable_cause": "It was determined that the total weight of the aircraft was well above the MTOW at the time of the accident. It is also believed that the fuel stored in the tanks did not have the correct octane number since it had an index of 100 when it should have presented an index estimated between 130 and 145. This was presumably caused by poor flight preparation on part of the crew and the ground personnel. Due to insufficient octane index, the engine failed to provide sufficient power during initial climb, which was considered as a contributing factor. It was also reported  that the horses panicked and moved in the cabin, causing the CofG to be modified. In such conditions, the aircraft became unstable and difficult to control. "}