{"url": "https://www.baaa-acro.com/crash/crash-reims-cessna-f406-caravan-ii-morogoro-1-killed", "date": "Apr 24, 1996 at 0500 LT", "type": "Cessna 406 Caravan", "operator": "Tanzanair2", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dar es-Salaam – Morogoro – Tabora", "msn": "406-0029", "yom": 1989, "flight_number": null, "city": "Morogoro", "zone": "Morogoro", "country": "Tanzania", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 8922, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was operating a company charter flight. It took off from Dar es salaam International airport at 0418 hrs for a flight to Morogoro where it was to pick passengers destined for Tabora. The pilot was the oni y occupant. At 0419:49 hrs 5H-TZD passed to the Dar Control Tower his estimates for TMA as 0439 hrs and Morogoro 0449 hrs. At 0425:13 hrs the aircraft reported to be maintaining flight level 60 and the Dar es Salaam Approach (which was then combined with the Tower advised him to maintain FL060 and to report on checking the TMA boundary. Subsequent to this and at about the same time 5H-TZD contacted the Military base located at Ngerengere on 118.25 MHz and requested permission to transit the Military area (HT) P6 (A) UNLI/GND. Permission was not granted because the area was active. (The pilot subsequently advised Ngerengere that he was to proceed to Morogoro by flying south of the Prohibited Area. The last communication between the aircraft and Ngerengere took place at 0439 hrs when the aircraft was south of Ngerengere. At 0440.08 hrs 5H-TZD called on 118.3 MHz (the Dar es Salaam Tower frequency) advising that he was transmitting blind and revised the TMA estimate to 0441 hours FL60. The ETA for Morogoro was a1so revised to 0451 hours. He was to call on Top of Descent. At 0440:31 hrs the Dar Tower acknow1edged the transmission. Subsequent to this a sound which resembled a series ot clicks of the mike was heard in the Dar Tower. There was no further Communication between 5H-TZD and the Dar es Salaam Tower. At 0850 hrs the owner of the aircraft telephoned the Dar es salaam Control Centre to alert that 5H-TZD had not landed at Morogoro. The Dar ACC instituted an ALERT PHASE and activated the Rescue Coordination Centre. The wreckage of this aircraft was discovered by villagers on top of Palapala mountains on 5 May 1996. The search and rescue effort took 11 days because of adverse weather conditions, the thick tropical vegetation at the crash site and the fact that the route of the aircraft was not known. ", "probable_cause": "The accident was caused by the aircraft colliding with high ground in bad weather. The following contributing factors were reported:\r\n- The pilot' s decision to initiate descent in weather conditions which allowed no visual contact with the terrain,\r\n- The pilot's decision to rely on the GPS as a means of navigation into Morogoro,\r\n- The failure of the pilot to obtain enroute and destination weather information relevant to his flight,\r\n- The' pilot' s decision to fly the mountainous southern track instead of the northern track in adverse weather conditions,\r\n- The pilot' s decision to continue with the flight in bad weather instead of or diverting to his alternate.\n"}