{"url": "https://www.baaa-acro.com/crash/crash-cessna-207a-skywagon-put-bay", "date": "Jan 20, 2003 at 0945 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Dairy Air", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Put-in-Bay – Port Clinton", "msn": "207-0153", "yom": 1970, "flight_number": null, "city": "Put-in-Bay", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4500, "captain_hours_type": 405, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6283, "circumstances": "Shortly after takeoff, about 300 feet agl, the engine lost all power. The pilot activated the electric fuel pump, and moved the fuel selector several times. However, the engine did not regain power, and the pilot performed a forced landing into trees. After the accident, the pilot stated to a police officer that he might have departed with the fuel selector positioned to an empty tank. The pilot subsequently stated that both fuel gauges indicated \"1/4\" full, and he could not remember which tank was selected during the takeoff. Additionally, a passenger stated that he did not smell or observe fuel when he exited the airplane. The passenger added that in the past, the pilot had exhausted one fuel tank, then switched to the other tank and the engine re-started. Examination of the wreckage by an FAA inspector revealed that fuel selector was positioned to the right tank. The right fuel tank contained some fuel, and left fuel tank had ruptured. Following the accident, a successful engine test-run was performed.\n", "probable_cause": "The pilot's inadequate fuel management, which resulted in fuel starvation and a total loss of engine power during the initial climb."}