{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-stuart", "date": "Mar 14, 2014 at 1730 LT", "type": "Cessna 402", "operator": "Mardon Inc.", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Pierce - Stuart", "msn": "402B-0805", "yom": 1974, "flight_number": null, "city": "Stuart-Witham Field", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16000, "captain_hours_type": 8000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5860, "circumstances": "According to the pilot, he checked the fuel gauges before departure and believed he had enough fuel for the flight. As he approached his destination airport, he was instructed by an air traffic controller to enter a 2-mile left base. About 3 miles from the airport, the controller advised him to intercept a 6-mile final. About 1 1/2 miles from the runway, the left engine “quit.” The pilot repositioned the fuel valve to the left inboard fuel tank and was able to restart the engine, but, shortly after, the right engine “quit.” He then attempted to reposition the right fuel valve to the right inboard fuel tank to restart the right engine, but the left engine “quit” again, and the pilot subsequently made a forced landing in a field. An examination of the engine and airplane systems revealed no anomalies that would have precluded normal operation. The left wing fuel tanks were found empty. The right wing was found separated from the fuselage. No evidence of fuel was noted in the right wing fuel tanks, and no evidence of fuel leakage was found at the accident site. The pilot reported that he saw fuel leaking out of the right wing fuel vent after the accident; it is possible that a small quantity of the airplane’s unusable fuel for the right tank could have leaked out immediately after the accident. Although the pilot believed that the airplane had enough fuel onboard for the flight, his assessment was based on his calculations of the airplane’s fuel burn during several short flights he made after having the airplane topped off with fuel the night before the accident; he did not visually check the fuel level in the tanks before departing on the accident flight. The lack of fuel in the fuel tanks, the lack of evidence of fuel leakage, the loss of engine power in both engines, and the lack of mechanical anomalies are consistent with fuel exhaustion.", "probable_cause": "The pilot’s improper preflight planning and fuel management, which resulted in a total loss of power in both engines due to fuel exhaustion."}