{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-60-duke-kinston-3-killed", "date": "Apr 1, 1991 at 1326 LT", "type": "Beechcraft 60 Duke", "operator": "Kelco Aircraft Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Kinston – Stuart", "msn": "P-366", "yom": 1976, "flight_number": null, "city": "Kinston-Stallings Field", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2345, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During takeoff from runway 22, the pilot reported that he had a problem, then there was no further communication from the aircraft. Several witnesses saw an object fall from the aircraft and one witness observed that a 'hood' had opened. The aircraft was maneuvered onto final approach to runway 36. A witness said that as the aircraft was lining up on final approach, it entered a steep bank and descended out of his sight. Subsequently, it collided with trees in a 27° descent, crashed and burned. A bag from the nose baggage compartment was found near the departure end of runway 22. No preimpact part failure or system malfunction of the aircraft was found. Before the flight, a ramp person observed the pilot servicing the left engine with oil, but he did not know if the pilot had secured the baggage door. An examination of the recovered door assembly failed to disclose a malfunction of the rear latch assembly. The forward latch assembly area was destroyed by fire. All three occupants were killed. ", "probable_cause": "The pilot diverted his attention and failed to maintain control of the aircraft, while maneuvering for a precautionary landing. Factors related to the accident were: the unsecured baggage compartment door and the pilot's inadequate preflight."}