{"url": "https://www.baaa-acro.com/crash/crash-antonov-124-100-kodra-8-killed", "date": "Oct 13, 1992", "type": "Antonov AN-124", "operator": "Antonov%20Design%20Bureau", "flight_phase": "Flight", "flight_type": "Test", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Kiev - Kiev", "msn": "19530501003", "yom": 1984, "flight_number": null, "city": "Kodra", "zone": "Kiev oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 8, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Kiev-Gostomel Airport on a test flight part of a certification programme, carrying nine crew members. While cruising at an altitude of 19,000 feet and at a speed of 614 km/h, the radome disintegrated. This caused the front cargo door to open and to detach. Debris struck the engine n°3 that stopped automatically. The aircraft suffered strong vibrations and oscillations then the 3rd hydraulic system failed as well as the flight management system. In such conditions, the crew was unable to get valid data about speed, altitude or the angle of attack. The aircraft entered an uncontrolled descent during which flaps were selected down to reduce the speed, but due to an asymmetrical release of flaps, the descent rate increased until the aircraft crashed in a wooded area located 1,5 km south of Korda and 43 km west of Gostomel Airport. The aircraft was destroyed and eight occupants were killed. The engineer survived after he bailed out during the descent but was seriously injured. ", "probable_cause": "Loss of control following the in-flight disintegration of the radome and the subsequent failure and detachment of the front cargo door. The exact cause of the radome disintegration could not be determined but the assumption of a bird strike could not be ruled out. "}