{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-20e-peterborough", "date": "Jun 13, 2000 at 2250 LT", "type": "Dassault Falcon 20", "operator": "Grand%20Aire_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Louisville – Marion – Detroit – Peterborough", "msn": "266", "yom": 1972, "flight_number": "GAE184", "city": "Peterborough", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11800, "captain_hours_type": 9400, "copilot_hours": 2300, "copilot_hours_type": 150, "aircraft_hours": 15798, "circumstances": "The Dassault-Breguet Falcon 20E aircraft was on an unscheduled charter cargo flight from Detroit Willow Run, Michigan, USA, to Peterborough, Ontario. The flight was being conducted at night and under instrument flight rules in instrument meteorological conditions. Nearing the destination, the flight crew received a clearance to conduct a non-directional beacon runway 09 approach at Peterborough Airport. The flight crew did not acquire the runway environment during this approach and conducted a missed approach procedure. They obtained another clearance for the same approach from Toronto Area Control Centre. During this approach, the flight crew acquired the runway environment and manoeuvred the aircraft for landing on runway 09. The aircraft touched down near the runway midpoint, and the captain, who was the pilot flying, elected to abort the landing. The captain then conducted a left visual circuit to attempt another landing. As the aircraft was turning onto the final leg, the approach became unstabilized, and the flight crew elected to overshoot; however, the aircraft pitched nose-down, banked left, and struck terrain. As it travelled 400 feet through a ploughed farm field, the aircraft struck a tree line and came to rest about 2000 feet before the threshold of runway 09, facing the opposite direction. The aircraft was substantially damaged. No serious injuries occurred.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The captain's attempt to continue the landing during the second approach was contrary to company standard operating procedures and Federal Aviation Regulations, in that the approach was unstable and the aircraft was not in a position to land safely.\r\n2. Following the aborted landing, the flight crew proceeded to conduct a circling approach to runway 09, rather than the missed approach procedure as briefed.\r\n3. The pilot lost situational awareness during the overshoot after the third failed attempt to land, likely when he was subjected to somatogravic illusion.\r\n4. Breakdown in crew coordination after the aborted landing, lack of planning and briefing for the subsequent approach, operating in a dark, instrument meteorological conditions environment with limited visual cues, and inadequate monitoring of flight instruments contributed to the loss of situational awareness."}