{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-76td-anadyr", "date": "Jan 25, 1997 at 1454 LT", "type": "Ilyushin II-76", "operator": "VASO", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Anadyr – Magadan – Moscow", "msn": "10234 09319", "yom": 1992, "flight_number": null, "city": "Anadyr", "zone": "Chukotka okrug", "country": "Russia", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 0, "pax_on_board": 16, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3309, "circumstances": "During the takeoff roll, at a speed of 290 km/h, the copilot started the rotation. The aircraft lifted off, reached a height of 7 metres then entered a left bank of 3,5°. Following a course of 665 metres, the aircraft entered a critical angle of attack, nosed up to 35° then landed back on the runway while the undercarriage have just been retracted. The aircraft slid on its belly and came to rest 270 metres further, about 120 metres to the left of the runway centerline. All 25 occupants were rescued, among them two were seriously injured. The aircraft was damaged beyond repair. ", "probable_cause": "It was determined that the captain decided to seat on the right front seat, letting the command to the copilot seating in the left front seat, which was against the published procedures because the copilot was not authorized and did not have sufficient experience. The copilot forgot to extend the flaps in an appropriate angle for the takeoff procedure, which caused the aircraft to adopt a critical angle of attack after liftoff and to stall. Successives errors and poor crew coordination were considered as contributing factors as well as the fact that the crew failed to follow the pre-takeoff checklist and failed to identify that the aircraft was not properly configured for the takeoff procedure. "}