{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-manati-3-killed", "date": "Feb 11, 1996 at 1638 LT", "type": "Rockwell Shrike Commander 500", "operator": "Hill Construction", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "San Juan - San Juan", "msn": "500-3206", "yom": 1974, "flight_number": null, "city": "Manatí", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 6560, "captain_hours_type": 50, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3323, "circumstances": "The flight was a dual instruction flight for the purpose of giving the dual student an orientation to the aircraft. Witnesses observed the aircraft flying from east to west at a slow speed. The right wing dropped and then returned to level. The right wing and nose dropped and the aircraft descended in a 45-60 degree nose down attitude. As the aircraft descended the wings rolled back and forth and something was observed moving on the outboard right wing area. The aircraft did not recover from the descent and crashed nose first at a slow speed into a swamp area. Post crash examination of the aircraft showed no evidence to indicate pre-crash mechanical malfunction or failure of the aircraft structure, flight controls, engines, propellers, or systems. The rudder trim was found in the neutral position and the elevator trim was found set for 70% of the aircraft nose up trim. Toxicology tests showed the dual student had .319 ug/ml of marihuana in urine, .010 ug/ml marijuana in blood, and 10.90 ug/ml of acetaminophen in blood. The pilot-in-command/flight instructor had 47.90 ug/ml acetaminophen and 89.20 ug/ml salicylate in urine. The pilot-in-command had hand injuries consistent with operating the aircraft's controls at the time of the accident. The dual student did not have hand injuries consistent with operation of the aircraft's controls. ", "probable_cause": "Failure of the flight crew, for undetermined reasons, to recover from a stall and resulting uncontrolled descent. This resulted in the aircraft colliding with the terrain while in a 45-60 degree nose down attitude at a slow speed. "}