{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-121b-mt-la-soufriere-30-killed", "date": "Sep 17, 1965 at 0725 LT", "type": "Boeing 707", "operator": "Pan%20Am.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Fort-de-France – Saint John’s – Christiansted – San Juan – New York", "msn": "17586", "yom": 1957, "flight_number": "PA292", "city": "Mt Soufrière", "zone": "All Montserrat", "country": "Montserrat", "region": "Central America", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 21, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 30, "captain_hours": 15355, "captain_hours_type": 297, "copilot_hours": null, "copilot_hours_type": 181, "aircraft_hours": 19127, "circumstances": "PanAm Flight PA292 was a scheduled service from Fort-de-France, Martinique to New York with en route stops at Saint John's, Antigua, Christiansted, St Croix, and San Juan, Puerto Rico. An IFR flight plan had been filed for the 30-minute leg to Antigua. Cruising altitude would be FL165. The airplane christened 'Clipper Constitution' departed Fort-de-France's runway 27 at 0704LT. Cruising altitude was reached at 0709. The crew established radio contact with the Antigua controller at 0715. The controller cleared the flight to the Coolidge NDB beacon at 2 500 feet and told the crew to report at the beacon outbound leaving 2 500 feet or field in sight. At approximately 0725 the flight reported through FL40 with the field not yet in sight. At the same time the airplane was observed flying along the coast of the island of Montserrat in rain and below the clouds with landing gear down and flaps partially extended. Shortly afterwards the airplane struck a mountain at an elevation of 2 760 feet asl and 242 feet below the summit. The airplane was totally destroyed and all 30 occupants have been killed. Weather was poor at the time of the accident with thunderstorms activity, towering cumulus and heavy rain falls. ", "probable_cause": "The accident was the result of the aircraft descending below a safe height when its position had not been accurately established."}