{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-230-malang", "date": "Nov 1, 2007 at 1324 LT", "type": "Boeing 737-200", "operator": "Mandala", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jakarta – Malang", "msn": "22137/788", "yom": 1981, "flight_number": "RI260", "city": "Malang", "zone": "West Java", "country": "Indonesia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 89, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 19357, "captain_hours_type": 10667, "copilot_hours": 2300, "copilot_hours_type": 1528, "aircraft_hours": 57823, "circumstances": "On 1 November 2007, a Boeing Company B737-200 aircraft, registered PK-RIL, operated by PT. Mandala Airlines as flight number MDL 260, was on a scheduled passenger flight from Jakarta Soekarno-Hatta International Airport, Jakarta, to Abdurrachman Saleh Airport, Malang, East Java. The pilot in command (PIC) was the handling pilot, and the copilot was the support/monitoring pilot. There were 94 persons on board the aircraft, consisting of two pilots, three cabin crew, and 89 passengers. The aircraft landed at Malang at 1324 Western Indonesian Standard Time (06:24 Coordinated Universal Time (UTC). It was reported to have been raining heavily when the aircraft landed on runway 35 at Malang. The aircraft bounced twice after the initial severe hard landing, and the lower drag strut of the nose landing gear fractured, resulting in the rearwards collapse of the nose landing gear and separation of the lower nose landing gear shock strut and wheel assembly. The aircraft’s nose then contacted the runway, and the aircraft came to rest 290 metres before the departure end of runway 17. The crew subsequently reported that during the visual segment of the landing approach, they realized that the aircraft was too high with reference to the precision approach path indicator (PAPI) for runway 35. The PIC increased the aircraft’s rate of descent (ROD) to capture the PAPI. The high ROD was not arrested, and as a consequence, the severe hard landing occurred which substantially damaged the aircraft. No one of the passengers or crew was injured. ", "probable_cause": "The flight crew did not appear to have an awareness that the aircraft was above the desired approach path to runway 35 at Malang until they sighted the visual approach slope indication lighting system. The pilot in command continued the approach in reduced visibility and heavy rain; marginal visual meteorological conditions. Non-adherence by the flight crew to stabilized approach procedures, which resulted in the initial severe hard landing at Malang, together with the omission of a high bounced landing recovery, resulted in substantial damage to the aircraft. The following findings were identified:\r\n- The PIC allowed the approach at Malang to become unstabilized and did not correct that condition.\r\n- The PIC continued the approach in reduced visibility and heavy rain; marginal visual meteorological conditions.\r\n- Neither pilot responded appropriately to the ground proximity warning system voice aural ‘SINK RATE’ or ‘PULL UP’ warnings that sounded during the final approach to Malang.\r\n- The PIC did not initiate action to recover from the high bounced landing following the initial severe hard landing impact.\r\n- The PIC did not ensure that effective crew coordination was maintained during the landing approach. "}