{"url": "https://www.baaa-acro.com/crash/crash-martin-202-davenport-10-killed", "date": "Jan 16, 1951 at 1214 LT", "type": "Martin 202", "operator": "Northwest%20Airlines2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Minneapolis – Billings – Spokane – Wenatchee – Seattle", "msn": "9144", "yom": 1948, "flight_number": "NW115", "city": "Davenport", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 4850, "captain_hours_type": 277, "copilot_hours": 692, "copilot_hours_type": 84, "aircraft_hours": 5874, "circumstances": "At Spokane the aircraft was checked visually, and departed Geiger Field at 1204 with the same crew, seven passengers, and 800 gallons of fuel. The flight plan was under Instrument Flight Rules to cruise at 6,000 feet Mean Sea Level between Spokane and Wenatchee, Washington. At takeoff the aircraft’s total weight was 33,822 pounds, as compared with a maximum allowable of 37,780 pounds. The disposable load was distributed in such a manner that the aircraft’s center of gravity was within prescribed limits. Four minutes after takeoff, at 1208, the flight reported having reached the cruising level of 6,000 feet MSL at 1207. At 1212 it was given the Wenatchee weather which was below minima. The flight immediately asked clearance to the next scheduled stop, Yakima, where the weather was above minima. While the Spokane radio operator was obtaining the requested clearance, the flight broadcasted an emergency message. This was at about 1213, only some 15 seconds after asking for the new clearance. No difficulty of any sort had been reported previously. This emergency message was copied by company operators at Spokane, Yakima and Seattle. At the latter place it was also recorded on a magnetic tape by Aeronautical Radio, Inc., an independent radio organization serving several air carriers. The message was in three short sentences. All operators agree that the first was, “We are in trouble,” and that the last was, “Going down fast.” The middle sentence was interpreted by one operator as, “Plane gone nuts” and by the second as, “Right engine haywire.” The third operator put down a series of Q’s, meaning not understood. The actual context of the message will be discussed later in this reports. There was no further radio contact with the flight. At or about 1214 the aircraft crashed on the Pundy farm about three miles west of Reardan, Washington, and approximately 20 miles from Geiger Field. All aboard were killed. A flash fire followed impact and burning continued for some time at the end location throughout the wreckage area. Weather conditions during the short flight from Geiger Field to the impact site included restricted visibility due to light snow. At the flight level there was no icing or turbulence either forecast or reported. Instrument conditions prevailed at the flight’s altitude. At the place and time of the crash the ceiling was about 200 feet and the surface visibility about one-third mile.", "probable_cause": "The Board, after extensive study of all evidence determines that the probable cause of this accident was a sudden loss of control for reasons unknown, resulting in rapid descent to the ground. The following items were reported:\r\n- Weather was not contributory since there was no icing and little turbulence,\r\n- The flight was uneventful until 30 to 90 seconds before the crash,\r\n- A difficulty of undetermined origin resulted in loss of control and rapid descent to the ground,\r\n- Examination of the wreckage remaining failed to disclose any evidence of structural failure and/or fire in flight."}