{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-2a1c-cruzeiro-do-sul-3-killed", "date": "Jun 22, 1992 at 0605 LT", "type": "Boeing 737-200", "operator": "Vasp", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Rio Branco - Cruzeiro do Sul", "msn": "21188", "yom": 1975, "flight_number": null, "city": "Cruzeiro do Sul", "zone": "Acre", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4581, "captain_hours_type": 3081, "copilot_hours": 2437, "copilot_hours_type": 337, "aircraft_hours": 31980, "circumstances": "While descending to Cruzeiro do Sul Airport by night and good weather conditions, the crew encountered problems with the intermittent activation of a warning light in the instrument panel, warning them of a fire in the cargo compartment. On final approach, the aircraft struck trees and crashed in a dense wooded area located in hilly terrain. The wreckage was found 15 km from runway 10 threshold and all three occupants were killed.", "probable_cause": "The following findings were reported:\r\na. Human Factor\r\n(1) Physiological Aspect\r\n- There was no evidence of this aspect contributing to the occurrence of the accident.\r\n(2) Psychological Aspect - Contributed\r\n- The psychological aspect contributed through the generation of a high level of anxiety to perform the landing and in the diversion of the focus of attention during the approach manoeuvres to land.\r\n- The psychological aspect was influenced by the activation of the smoke alarm which generated an increase in the workload on board.\r\nb. Material Factor\r\n- There were no indications that this factor contributed to the accident.\r\nc. Operational Factor\r\n(1) Deficient Instruction\r\n- Although the instruction was carried out in accordance with what the standards recommend, the failures that contributed to the accident are characteristic of lack of experience in facing abnormalities simultaneously with the maintenance of flight control. Such failures could be avoided with more adequate simulator instructions and training involving the cockpit management aspects.\r\n(2) Poor Maintenance - Undetermined .\r\n- It was not possible to determine the cause of the activation of the 'Aft Cargo Smoke' alarm and whether the maintenance services contributed to this occurrence.\r\n(3) Deficient Cockpit Coordination\r\n- Inadequate performance of the duties assigned to each crew member. The procedures foreseen for the execution of descent by instrument have been modified and some have been deleted depending on the appearance of a complicator element (smoke alarm).\r\n(4) Influence of the environment\r\n- The dark night contributed to the creation of the 'black hole' phenomenon, or 'background figure', making it difficult to perceive external references for a possible identification of the vertical distance of the aircraft from the ground.\r\n(5) Deficient Oversight\r\n- The supervision, at cockpit level, contributed to the accident by the inadequate management of the resources available for the flight in the cockpit.\r\n- Company level supervision contributed to the accident by not identifying the need for cockpit management training and providing it to the crew involved.\r\n- Supervision, at company level, was also inadequate when climbing to the same mission, two pilots unfamiliar with the airplane to be used and in night operation.\r\n(6) Other Operational Aspects\r\n- The failure to comply with several 'Callouts', the non-use of the radio altimeter and the inadequate use of the 'altitude alert', as an aid to the accomplishment of the descent procedure, contributed to the occurrence of the accident."}