{"url": "https://www.baaa-acro.com/crash/crash-boeing-307-stratoliner-seattle", "date": "Mar 28, 2002 at 1310 LT", "type": "Boeing 307 Stratoliner", "operator": "SNASM", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Seattle - Seattle", "msn": "2003", "yom": 1940, "flight_number": null, "city": "Seattle-Boeing Field", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15000, "captain_hours_type": 62, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 20577, "circumstances": "The crew had originally planned to practice landings at an airport about 20 minutes away, then stop, refuel the airplane, and subsequently return to the original departure airport. Prior to the flight, the crew discussed fuel endurance, which was calculated to be 2 hours based on the captain's knowledge of the airplane's fuel consumption, and the quantity of fuel indicated on the gauges. The fuel tanks were not dipped. The flight was made at 1,500 feet msl. Upon reaching the practice airport, the crew conducted one full stop landing, then taxied back for takeoff. During takeoff, an engine had a momentary overspeed, and the crew decided to return to the original departure airport without refueling. Approaching the original departure airport, the airplane had to delay landing for about 7 minutes for a manual gear extension. Upon completion, it turned back toward the airport, and was about 6 miles from the runway when fuel pressure for one of the engines dropped. The boost pumps were turned on; however, the engine lost power. A low fuel pressure light then illuminated for another engine. The captain called for the flight engineer to switch fuel feed to another tank, but the flight engineer responded, \"we're out of fuel.\" The remaining engines subsequently lost power, and the captain ditched the airplane into a bay. The time from first takeoff until ditching was 1 hour, 19 minutes. The airplane had flown 39 hours since restoration, and exact fuel capacities, fuel flow calculations and unusable fuel amounts had not been established. A dipping chart had been prepared, with one person in the cockpit and one person with a yardstick putting fuel in a main tank in 25-gallon increments. However, the data had not been verified, and dipping was not considered to be part of the pre-flight inspection.", "probable_cause": "Loss of all engine power due to fuel exhaustion that resulted from the flight crew's failure to accurately determine onboard fuel during the pre-flight inspection. A factor contributing to the accident was a lack of adequate crew communication regarding the fuel status."}