{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-300-super-king-air-port-orange", "date": "Apr 14, 2004 at 1915 LT", "type": "Beechcraft 300 Super King Air", "operator": "Mass Bay Kustom Leasing", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Stuart – Daytona Beach", "msn": "FA-61", "yom": 1985, "flight_number": null, "city": "Port Orange-Spruce Creek", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3495, "captain_hours_type": 147, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot stated that he initiated a fuel transfer due to a fuel imbalance. To affect the fuel transfer, he said he \"began crossfeed right to left.\" When the airplane was about 5 to 10 miles away from Spruce Creek Airport, the pilot said he began his descent from 12,500, and also executed a left turn to begin setting up to land, when suddenly, both engines ceased operating. When he leveled the wings both engines restarted due to auto-ignition. He said the fuel gages showed 300 to 350 lbs of fuel for the right tank, and 100 to 150 pounds on the left, so he decided to continue his approach to Spruce Creek Airport. As he approached Spruce Creek Airport, he again entered a left bank to prepare for a left base to runway 23, and while established in the left turn, both engines ceased operating a second time. He said he did not think he could reach the runway, and decided to make an landing on a taxiway. When the wings became level after the turn, he said both engines again restarted while in the vicinity of the beginning of the taxiway. As he was about to land, he said a car pulled out onto the taxiway, and stopped on the centerline, so he applied power to avoid the car. He said he climbed straight out, and when he made a climbing left turn, he said the engines ceased operating a third time, and the airplane descended towards a cluster of condos. With no runway or clear area in sight, the pilot said he guided the airplane to a retention pond. Follow-on/detailed examinations of the aircraft, engines, and propellers were conducted by an FAA Inspector, as well as technical representatives from Raytheon Aircraft Company, Pratt & Whitney Canada, and Hartzell Propeller Company, and no pre accident anomalies were noted with the airframe, flight controls, engines/accessories, or propellers. According to the FAA Inspector, and the technical representative from the airplane manufacturer, Raytheon Aircraft Company, the pilot was transferring fuel from the left fuel tank to the right fuel tank, and with the reduced amount of fuel in the left tank, as he performed left turns, the engine ceased operating. The Raytheon Aircraft Company representative stated that the Pilot Operating Handbook specifies the use of crossfeed for those times when the airplane is operating on a single engine.", "probable_cause": "The pilot's inadequate management of the airplane's fuel system, which resulted in fuel starvation, a loss of engine power, a forced landing, and damage to the airplane during the landing.\n"}