{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-35-marquise-den-helder", "date": "Jul 20, 2000", "type": "Mitsubishi MU-2 Marquise", "operator": "Skyline%20Aviation%20NL", "flight_phase": "Landing (descent or approach)", "flight_type": "Calibration", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Den Helder - Den Helder", "msn": "617", "yom": 1973, "flight_number": null, "city": "Den Helder-De Kooy", "zone": "North Holland", "country": "Netherlands", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5050, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Den Helder-De Kooy Airport on a radar tracking flight over the North Sea. Following an uneventful mission, the crew was returning to De Kooy Airport. After touchdown on runway 03, the crew activated the thrust reverser systems when the aircraft lost controllability. The pilot attempted to maintain control and selected the left throttle from 'reverse' again to turn to the right. Eventually, he feathered the right propeller and cut off the fuel supply, causing the right engine to stop. The aircraft veered off runway to the left and came to rest in a ditch. Both pilots escaped uninjured and the aircraft was damaged beyond repair. ", "probable_cause": "The landing speed, the touchdown point, the runway length and runway condition were considered as good. The problem was the consequence of an expired adjustment screw of the speed controller ('prop governor') on the right engine, so that it did not come into 'reverse pitch' but continued to provide forward thrust, causing an asymmetric aerodynamic braking effect. It was also determined that the Beta light indicator burned and could not light on, preventing the pilot from a possible issue on the reverse thrust system."}