{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh106-comet-4c-tripoli-16-killed", "date": "Jan 2, 1971 at 0325 LT", "type": "De Havilland DH.106 Comet", "operator": "United-Arab-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Algiers - Tripoli - Cairo", "msn": "6439", "yom": 1960, "flight_number": "MS844", "city": "Tripoli", "zone": "Tripoli (طرابلس)", "country": "Libya", "region": "Africa", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 25592, "circumstances": "Flight MS844 was a scheduled international flight from Algiers to Cairo with an intermediate stop at Tripoli. Departure on the outbound flight Cairo - Tripoli - Algiers had been delayed 29 hours due to adverse weather conditions along the route. At Algiers, following testing of the systems, the fire warning light of Zone I in n° 3 engine stayed \"ON\". Local personnel, who were not familiar with Comet aircraft, attempted to rectify the discrepancy and this caused a further delay of nearly 2 1/2 hours. The light eventually extinguished and the pilot-in-command, who had been considering cancellation of the flight and returning to Cairo without passengers, then decided to proceed with the service. There was no evidence that the crew had asked for, or received, a weather forecast before departing Algiers for Tripoli; however, it is possible that a verbal forecast was obtained. The QNH at Algiers was 1011 mb. As the aircraft entered the Tripoli Control Area, the crew was provided with a weather report which included a horizontal visibility of 1000 meters due to sand haze. This was below the minimum authorized by the airline; however, the vertical visibility was unlimited. The pilot-in-command checked Benina weather and then decided to attempt a landing at Tripoli wfth Malta as the alternative: he stated that he had 3 hours 50 minutes endurance. Both Tripoli Control and Tripoli Tower gave him a QNH of 1008 mb, additionally Tripoli Control gave an opinion that visibility was better than 1 000 m, and Tripoli Tower gave an opinion that he could see \"3 kilometres\". The airport's VOR was not available as it required calibration; the only ground aid available was the ADF facility. Coming from Algiers, the approach over the beacon located 0.6 NM north of Runway 18, the runway in use, involved joining the holding pattern in the opposite direction to the circuit so that a tear drop turn was necessary to re-approach the beacon on the outbound leg on an ADF procedure turn. Shortly after passing the beacon for the first time, the pilot-in-command reported at 3 000 ft. The last message received was when the aircraft was passing the beacon outbound for an ADF approach procedure turn. The altitude was not stated subsequent to entering the holding pattern.The flight path to Runway 18 crossed an expanse of sand dunes 160 ft AMSL rising steeply to 425 ft AMSL and then falling te the runway threshold elevation of 240 ft. The aircraft struck sand dunes at an elevation of 395 ft approximately 7 km before the threshold of the runway. The accident occurred at 01.25 hours GMT. The aircraft was destroyed and all 16 occupants were killed. ", "probable_cause": "The probable cause of the accident was the decision of the pilot-in-command to land while the prevailing visibility was below the Airline's minimum for that airport at night, and for undetermined reasons, the aircraft was lower than the altitude it ought to have been for an ADF approach to the runway in use. The weather was a contributing factor."}