{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-winnipeg-1-killed", "date": "Oct 6, 2005 at 0543 LT", "type": "Cessna 208B Grand Caravan", "operator": "FedEx", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Winnipeg – Thunder Bay", "msn": "208B-0542", "yom": 1996, "flight_number": "FDX8060", "city": "Winnipeg", "zone": "Manitoba", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4570, "captain_hours_type": 1500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6724, "circumstances": "On the day before the occurrence, the accident aircraft arrived in Winnipeg, Manitoba, on a flight from Thunder Bay, Ontario. The aircraft was parked in a heated hangar overnight and was pulled outside at about 0410 central daylight time. The pilot reviewed the weather information and completed planning for the flight, which was estimated to take two hours and six minutes. The aircraft was refuelled and taxied to Apron V at the Winnipeg International Airport, where it was loaded with cargo. After loading was complete, the pilot obtained an instrument flight rules (IFR) clearance for the flight to Thunder Bay, taxied to Runway 36, received take-off clearance, and departed. The aircraft climbed on runway heading for about one minute to an altitude of 1300 feet above sea level (asl), 500 feet above ground level (agl). The flight was cleared to 9000 feet asl direct to Thunder Bay, and the pilot turned on course. The aircraft continued to climb, reaching a maximum altitude of 2400 feet asl about 2.5 minutes after take-off. The aircraft then started a gradual descent averaging about 400 feet per minute (fpm) until it descended below radar coverage. The accident occurred during hours of darkness at 0543. The Winnipeg Fire Paramedic Service were notified and responded from a nearby station. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The aircraft departed at a weight exceeding the maximum take-off weight and the maximum weight for operation in icing conditions.\r\n2. After departure from Winnipeg, the aircraft encountered in-flight icing conditions in which the aircraftís performance deteriorated until the aircraft was unable to maintain altitude.\r\n3. During the attempt to return to the Winnipeg International Airport, the pilot lost control of the aircraft, likely with little or no warning, at an altitude from which recovery was not possible.\r\nFindings as to Risk:\r\n1. Aviation weather forecasts incorporate generic icing forecasts that may not accurately predict the effects of icing conditions on particular aircraft. As a result, specific aircraft types may experience more significant detrimental effects from icing than forecasts indicate.\r\n2. Bulk loading prevented determining the cargo weight in each zone, resulting in a risk that the individual zone weight limits could have been exceeded.\r\n3. The aircraftís centre of gravity (CG) could not be accurately determined, and may have been in the extrapolated shaded warning area on the CG limit chart. Although it was determined that the CG was likely forward of the maximum allowable aft CG, bulk loading increased the risk that the CG could have exceeded the maximum allowable aft CG.\r\n4. The incorrect tare weight on the Toronto cargo container presented a risk that other aircraft carrying cargo from that container could have been inadvertently overloaded. \r\nOther Findings:\r\n1. The pilotís weather information package was incomplete and had to be updated by a telephone briefing.\r\n2. The operatorís pilots were not pressured to avoid using aircraft de-icing facilities or to depart with aircraft unserviceabilities.\r\n3. The aircraft departed Winnipeg without significant contamination of its critical surfaces. \r\n4. The biological material on board the aircraft was disposed of after the accident, with no indication that any of the material had been released into the ground or the atmosphere.\r\n5. The fact that the aircraft was not equipped with flight data recorder or cockpit voice recorder equipment limited the information available for the occurrence investigation and the scope of the investigation. "}