{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-440-metropolitan-williamsport", "date": "Jul 23, 1965 at 1506 LT", "type": "Convair CV-440 Metropolitan", "operator": "Allegheny-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pittsburgh-Du Bois-Phillipsburg-Williamsport-Wilkes-Barre-Newark", "msn": "125", "yom": 1953, "flight_number": "AL604", "city": "Williamsport", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 36, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10071, "captain_hours_type": 1296, "copilot_hours": 5061, "copilot_hours_type": 1410, "aircraft_hours": 26266, "circumstances": "Allegheny Airlines, Inc., Flight 604, a Convair 340/440, N8415H, crashed 5 miles east-northeast of the Williamsport-Lycoming County Airport, Montoursville, Pennsylvania, on July 23, 1965. The 36 passengers, 3 crew members, and 1 jumpseat rider survived but received varying degrees of injuries. The flight, regularly scheduled from Pittsburgh, Pennsylvania to Newark, New Jersey, with intermediate stops at Dubois, Phillipsburg, Williamsport and Wilkes-Barre, Pennsylvania, departed Runway 09 at 1503. e.d.t. Shortly after takeoff smoke and fire were observed coming from the right engine and at approximately 1505:30 the captain advised \"Six oh four is coming back in, we've got the right engine feathered.” The crash occurred moments later on the crest of a ridge approximately 600 feet above the airport elevation. The aircraft was destroyed by fire. The failure of the right engine is attributed to the failure of the front row master rod and all the associated link rods. Damage to the rod ends precluded any determination of the cause of the master rod failure.", "probable_cause": "The Board determines that the probable cause of this accident was the failure of the crew to implement proper procedures for an engine failure on takeoff."}