{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-20e-kish-island-4-killed", "date": "Mar 3, 2014 at 1845 LT", "type": "Dassault Falcon 20", "operator": "Iran-Aseman-Airlines-22", "flight_phase": "Landing (descent or approach)", "flight_type": "Calibration", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Kish Island - Kish Island", "msn": "334", "yom": 1975, "flight_number": null, "city": "Kish Island", "zone": "Hormozgān", "country": "Iran", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Aircraft mission was Calibration flight. The flight was planned for departure from Mehrabad airport, Tehran to Kish Island airport. Eight persons were onboard of the aircraft (3 Pilots, 4 Ground technicians, a Security guard member). The flight was under operation of Iran Aseman Airline with valid Air Operation Certificate (AOC No; FS-102). The aircraft has taken off from RWY 29L from THR airport at 15:03 Local time and reached to cruise level FL270.The aircraft has landed on RWY 09 L Kish island airports at 16:44 local time. Four ground technicians have got off from the aircraft and refueling was done. At time 17:44 LMT , the aircraft has taken off RWY 27R and requested to join Right downwind up to 1000 ft. and 8 miles from the airport. After successful performing 7 complete flight (approach & climbing) for Navigation – Aids inspection purposes; at the 8th cycle, just at turning to the final stage of approach before runway threshold the aircraft crashed into the sea and was destroyed at time 18:45 local time. All four occupants were killed.  ", "probable_cause": "Regarding aforementioned analyses it seems that the fatigues of pilots have caused incapability to adopt themselves with flight conditions and their interactions are due to spatial disorientation\r\n(illusion). This type of error prevented pilots to avoid from crash in to the sea.\r\nContributing Factors:\r\n- Malfunction of aircraft radio altimeter.\r\n- Flight crew fatigue.\r\n- Lack of enough supervision on flight calibration operations."}