{"url": "https://www.baaa-acro.com/crash/crash-cessna-208-caravan-i-port-blair-1-killed", "date": "Sep 6, 1993 at 1132 LT", "type": "Cessna 208A Caravan", "operator": "Andaman%20%26%20Nicobar%20Administration", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Port Blair - Dugong Creek - Hut Bay - Port Blair", "msn": "208-0221", "yom": 1992, "flight_number": null, "city": "Port Blair", "zone": "Andaman and Nicobar Islands", "country": "India", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6300, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Cessna 208 Caravan aircraft VT-AAN operated by Andaman and Nicobar Administration was engaged in a flight from Port Blair - Dugong Creek - Hut Bay - Port Blair. There were four persons on board the aircraft including pilot-in-command. The flight from Dugong Creek to Hut Bay was uneventful. The aircraft took-off from Hut Bay for Port Blair where it was intended to land on sea\r\nadjacent to Viper Island. Soon after touchdown on seawater, the aircraft flipped over its nose and sank thereafter. Three persons including the pilot evacuated the aircraft. However, one person died due to drowning, as he remained strapped in his seat. The aircraft sustained substantial damage. There was no fire. ", "probable_cause": "The pilot failed to ensure that the landing gears are fully retracted before landing on water thereby causing the aircraft to flip on to its back as a result of abnormally high hydrodynamic drag generated on landing with landing gears remaining extended. Non-availability of the revised pilot's checklist, appropriate to the aircraft configuration and the practice adopted during conversion training of the pilot were the contributory factors."}