{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-224-denver", "date": "Aug 7, 1975 at 1611 LT", "type": "Boeing 727-200", "operator": "Continental%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Denver - Wichita", "msn": "19798/608", "yom": 1968, "flight_number": "CO426", "city": "Denver-Stapleton", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 124, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11465, "captain_hours_type": 483, "copilot_hours": 6555, "copilot_hours_type": 998, "aircraft_hours": 23850, "circumstances": "The takeoff from Denver-Stapleton Airport was completed from runway 35L in poor weather conditions. At that time, a thunderstorm with associated rain showers was moving over the northern portion of the airport. The Thunderstorm was surrounded by numerous other thunderstorms and associated rain showers but none of these were in the immediate vicinity of the airport. After liftoff, the airplane reached an altitude of 100 feet then lost about 41 kt of indicated airspeed in 5 seconds. The aircraft struck the ground 11.6 seconds after the airspeed began to decrease. The aircraft first hit the ground 387 feet south of the departure end of runway 35L and 106 feet to the right of the runway centerline. The aircraft continued northward to a second impact area about 135 feet north of the end of the first area. The main portion of the second area was 55 feet long and 4 feet wide. The aircraft slid northward from this area and came to rest about 1,600 feet north of the departure end of runway 35L and about 160 feet to the right of the extended runway centerline. All 131 occupants were evacuated, 15 of them were injured. ", "probable_cause": "The aircraft's encounter, immediately following take-off, with severe windshear at an altitude and airspeed which precluded recovery level flight; the windshear caused the aircraft to descend at a rate which could not be overcome even though the aircraft was flown at or near its maximum lift capability throughout the encounter. The windshear was generated by the outflow from a thunderstorm which was over the aircraft's departure path."}