{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-749-constellation-mont-blanc-48-killed", "date": "Nov 3, 1950 at 1043 LT", "type": "Lockheed L-749 Constellation", "operator": "Air-India", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Bombay – Cairo – Geneva – London", "msn": "2506", "yom": 1947, "flight_number": "AI109", "city": "Mont-Blanc", "zone": "Haute-Savoie", "country": "France", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 40, "pax_fatalities": 40, "other_fatalities": 0, "total_fatalities": 48, "captain_hours": null, "captain_hours_type": 1745, "copilot_hours": 4052, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine aircraft christened 'Malabar Princess' left Cairo-Almaza Airport at 0209LT on a direct flight to Geneva, completing an international service from Bombay to London, carrying 40 passengers and a crew of 8. All passengers were Indian and Pakistani marines who were joining their boat based in the harbor of Newcastle upon Tyne. About 20 minutes before its estimated time of arrival in Geneva-Cointrin Airport, while cruising at an altitude of 15,500 feet, the crew informed ATC that he was flying over Grenoble. The radio officer at Geneva Airport misbelieved this position and asked the crew to switch on 333 kHz for a direction finding check. The crew never contacted this frequency and the aircraft disappeared shortly later. As the airplane failed to arrive at Geneva Airport, SAR operations were conducted by the French, Swiss and Italian Authorities. The wreckage was found two days later, Sunday November 5, at an altitude of 4,671 meters, on the Rocher de la Tournette, about 300 meters from the Vallot Refuge. The aircraft disintegrated on impact and all 48 occupants were killed. ", "probable_cause": "At the time of the accident, a strong wind was blowing from the west and it is believed that the crew misinterpreted his position. The crew believed he was overflying Grenoble when in reality, the aircraft was approximately 111 km northeast of Grenoble, vertical to the Mont-Blanc Mountain range. In 1950, the area control center of Geneva-Cointrin was not equipped with a surveillance radar system. The only available systems were a medium-frequency direction finder and transmitters on shortwave (HF) with 4 available frequencies. At that time, Air India did not use the route Genoa - Torino - Geneva to avoid the Alps and preferred to fly the Nice - Gap - Grenoble - Geneva path marked by broadcast stations (BC) which unfortunately did not transmitted 24 hours a day. It appears that the accident was the result of a controlled flight into terrain mostly caused by unfavorable wind."}