{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-21a-goose-sula-1-killed", "date": "Jun 17, 2014 at 1700 LT", "type": "Grumman G-21A Goose", "operator": "Paul C. Ehlen", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Plain, Valley", "schedule": "Salmon - Hamilton", "msn": "B-70", "yom": 1944, "flight_number": null, "city": "Sula", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 9800, "captain_hours_type": 50, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6394, "circumstances": "The airline transport pilot was repositioning the airplane to an airport near the owner's summer home. The airplane was not maintained for instrument flight, and the pilot had diverted the day before the accident due to weather. On the day of the accident, the pilot departed for the destination, but returned shortly after due to weather. After waiting for the weather conditions to improve, the pilot departed again that afternoon, and refueled the airplane at an intermediate airport before continuing toward the destination. The route of flight followed a highway that traversed a mountain pass. A witness located along the highway stated that he saw the accident airplane traveling northbound toward the mountain pass, below the overcast cloud layer. He also stated that the mountain pass was obscured, and he could see a thunderstorm developing toward the west, which was moving east toward the pass. A second witness, located near the accident site, saw the airplane descend vertically from the base of the clouds while spinning in a level attitude and impact the ground. The second witness reported that it was snowing and that the visibility was about ¼ mile at the time of the accident. The airplane impacted terrain in a level attitude, and was consumed by a postcrash fire. Examination of the flight controls, airframe, and engine revealed no mechanical malfunctions or anomalies that would have precluded normal operation. It is likely that the pilot experienced spatial disorientation and a subsequent loss of aircraft control upon encountering instrument meteorological conditions. The airplane exceeded its critical angle of attack and entered a flat spin at low altitude, resulting in an uncontrolled descent and impact with terrain.", "probable_cause": "The pilot's decision to continue flight into deteriorating weather conditions in an airplane not maintained for instrument flight, which resulted in a loss of control due to spatial\r\ndisorientation. "}