{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-vieques", "date": "Aug 17, 1983 at 1640 LT", "type": "Beechcraft 100 King Air", "operator": "Padosa Productions", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Christiansted - San Juan", "msn": "B-134", "yom": 1972, "flight_number": null, "city": "Vieques", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7558, "captain_hours_type": 28, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9420, "circumstances": "The aircraft crash landed during a touch and go landing. The pilot said that the aircraft was caught in a windshear or violent downdraft and would not climb. He did not say why he was doing a touch and go landing with 9 passengers on board. The pilots account of the accident was: after touchdown I raised the flaps and set takeoff power. At 103 knots and with 500 feet of runway remaining the aircraft was lifted off. At about 150 feet agl and climbing I started to raise landing gear but the aircraft started to sink so I left gear down. The trees were moving violently. I felt I was caught in a windshear because of a sharp drop in airspeed and the aircraft quit performing. The aircraft continued sinking and I decided on a controlled crash to save the passengers. A witness stated he (the pilot) took off without enough power. I saw the plane with its nose high and tail low and I lost the plane when it went into the trees. The aircraft hit several citrus trees at a shallow angle of descent 1,200 feet from the end of the runway. The aircraft went 150 feet through the trees and 350 feet on the ground before stopping. All 11 occupants escaped uninjured. ", "probable_cause": "Occurrence #1: in flight collision with terrain/water\r\nPhase of operation: takeoff - initial climb\r\nFindings\r\n1. (f) object - tree(s)\r\n2. (c) judgment - poor - pilot in command\r\n3. (c) lift-off - premature - pilot in command\r\n4. (c) distance - inadequate - pilot in command\r\n5. (c) airspeed (vlof) - below - pilot in command"}