{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-26-islander-saint-johns-3-killed", "date": "Oct 7, 2012 at 1610 LT", "type": "Britten-Norman Islander", "operator": "Fly%20Montserrat", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Saint John’s – Montserrat", "msn": "82", "yom": 1969, "flight_number": "MNT107", "city": "Saint John's-V. C. Bird", "zone": "All Antigua", "country": "Antigua", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 710, "captain_hours_type": 510, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 22064, "circumstances": "The aircraft was operating a VFR scheduled commercial air transport flight from VC Bird International Airport, Antigua (TAPA), to John A Osborne Airport, Montserrat (TRPG). The accident occurred during the aircraft’s fourth sector of the day. Prior to the accident flight, another pilot had flown two sectors in it, from John A Osborne to VC Bird and return, before going off duty. The accident pilot reported for duty at 1130 hrs, completed pre-flight preparations, and operated the aircraft to VC Bird. After the aircraft’s arrival at VC Bird, the airport closed to VFR traffic because of cumulonimbus activity and heavy rain. The airport re-opened for VFR operations shortly before the aircraft’s departure. A cumulonimbus cloud was present on the approach to Runway 07, and although the surface wind was westerly, Runway 07 was in use for departures. On board the aircraft were the pilot, three passengers, and bags weighing 150 lb. The fuel load on departure was 65 USG of AVGAS. The takeoff mass was shown on the load sheet as 5,540 lb, which was below the structural maximum takeoff weight of 6,600 lb; the performance-regulated takeoff weight at the ambient temperature of 24 °C was greater than the structural limit. The passengers and pilot travelled in a bus from the airport terminal to the aircraft. The passengers boarded the aircraft, and the baggage was loaded into the compartment behind the rear-most seats. The pilot then boarded the aircraft. The pilot was not observed to carry out a drain of the fuel system’s water traps (the operations manual did not stipulate that a drain check should be carried out). The pilot called the VC Bird Ground Movement Control (GMC) controller for permission to start engines, and was instructed to wait while the controller contacted Montserrat ATC to enquire about the weather there. The pilot then asked for surface wind information for VC Bird and was informed it was from 240° at 10 kts. The controller gave permission for start and passed the Montserrat weather, which was suitable for the operation. The pilot was instructed to taxi to holding position Bravo. The pilot contacted the Tower controller and was instructed to enter, backtrack, and line up on Runway 07. The controller described the weather observed from the Tower to the pilot, and the pilot requested a left-hand turn-out after departure. The surface wind was transmitted as from 270° at 10 kts and the aircraft was cleared for takeoff. The aircraft entered the runway at Bravo but did not backtrack. No power checks were carried out (other evidence indicated that power checks were routinely not carried out other than on each pilot’s first flight of the day). The aircraft took off, and the early part of the climb appeared normal. Analysis of the eye witness reports, and consideration of their locations and fields of view, led to a deduction that this normal climb continued to a height of between 200 and 300 ft above the ground. The aircraft then appeared to ‘sink’, losing a small amount of height without yawing or rolling, before yawing to the right, then rolling to the right, and pitching nose down into an incipient spin to the right. The surviving passenger recalled that the stall warning sounded, and its accompanying red light (which was mounted on the right-hand side of the instrument panel and in his line of sight) illuminated throughout this period and until impact. Witnesses described that the (incipient) spin continued until the aircraft struck the ground. ATC staff in the visual control room activated the airport’s crash alarm. The rescue and fire-fighting service (RFFS) responded promptly from their station; the crew of one RFFS vehicle, working on the airport, observed the accident and responded directly to it. The pilot and one passenger were fatally injured on impact. Another passenger succumbed to her injuries before she could be extricated from the wreckage, and the third passenger, who had sustained serious injuries, was taken to hospital. ", "probable_cause": "The investigation identified the following causal factors:\r\n1. Significant rainfall, and anomalies in the aircraft’s fuel filler neck and cap, led to the presence of water in the right-hand fuel tank,\r\n2. Shortly after takeoff, the water in the right-hand fuel tank entered the engine fuel system causing the engine to stop running,\r\n3. Control of the aircraft was not retained after the right-hand engine stopped.\r\nContributing factors:\r\n1. No pre-flight water drain check was carried out; such a check would have allowed the presence of water in the right-hand fuel tank to be detected and corrective action taken.\r\n2. It is possible that performance-reducing windshear, encountered during the downwind departure, contributed to a reduction in airspeed shortly before the aircraft stalled."}