{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-marco-island-1-killed", "date": "Mar 31, 2001 at 1015 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Crosco", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Venice - Marco Island", "msn": "61-0555-239", "yom": 1978, "flight_number": null, "city": "Marco Island", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 12980, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3633, "circumstances": "Witnesses watching N900CE's approach for landing to runway 17 at Marco Island Executive Airport stated the pilot appeared to have difficulty aligning the Machen modified Aerostar with the runway centerline. They stated the aircraft appeared unstable about the yaw and roll axes, and appeared too fast. Winds were from the southwest at about 15 knots, gusting to about 20 knots. One pilot/witness close to the touchdown area saw the right wheel touch down instantly, and climb back up to about 50 feet, agl without the full addition of engine power. Most witnesses thought he was either performing a go-around or an extended touch down further down the runway. The airplane continued, \"..more and more wobbly\" until it entered a climbing attitude and sharp left bank and turn. About half way down the runway the left wing dropped until it contacted the terrain left of the runway, and the aircraft slid into mangrove trees and burned. During postcrash examination, flight control continuity from surface to cockpit floorboards was confirmed. No condition was found with either engine or propeller that would have precluded proper operation, precrash. A witness listening to the pilot's initial radio call up for approach and landing stated that no abnormality was reported by the pilot. Postmortem toxicology testing on specimens obtained from the pilot by the FAA Toxicology and Accident Research Laboratory and the Dade County Medical Examiner revealed quinine found in the blood and urine. The side effects of quinine can include disturbances of vision, hearing, and balance.", "probable_cause": "The failure of the pilot to maintain control of the aircraft during a rejected landing and the collision with the terrain and mangrove trees. A finding in the investigation was the presence of quinine in the blood and urine during postmortem toxicological testing of specimens from the pilot."}