{"url": "https://www.baaa-acro.com/crash/crash-reims-cessna-f406-caravan-ii-arusha", "date": "Nov 27, 2004 at 1618 LT", "type": "Cessna 406 Caravan", "operator": "Regional%20Air%20Services", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Arusha – Seronera", "msn": "406-0005", "yom": 1986, "flight_number": null, "city": "Arusha", "zone": "Arusha Region", "country": "Tanzania", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": 80, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was taking off for a scheduled flight from Arusha to Seronera. At 12:15 hours the aircraft taxied from the apron to the threshold of runway 27 at which point take off for Seronera was initiated. The controller, who was handling the flight, said that the initial segment of the take off roll was normal. When the aircraft had covered about 500 metres he saw the left main landing gear collapsing and the aircraft swinging to the left of the runway. It continued to run on its belly pod on a grass hedge parallel to runway 27 and came to rest at the eastern edge of the apron. There was no fire and all the occupants deplaned without injuries. The aircraft sustained damage to propellers, the right wing, the fuselage and underside structure. The cargo pod in the belly was completely destroyed and its debris was scattered along the wreckage trail.", "probable_cause": "There does not appear to be any defects in the aircraft, which could have contributed to this accident. The available evidence would point to premature rotation and premature retraction of the landing gear. Much of the pilot’s recent flying was on low speed aircraft. He had flown Cessna 208s and Twin Otters for many years. His experience on the Cessna 406 was 80 hours. In fact he had flown a Twin Otter only hours before switching to the Cessna 406."}