{"url": "https://www.baaa-acro.com/crash/crash-consolidated-pby-5a-catalina-near-caqueza-14-killed", "date": "Dec 8, 1956 at 0705 LT", "type": "Consolidated PBY Catalina", "operator": "AIDA", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Bogotá – Medellín - Quibdó", "msn": "21998", "yom": 1943, "flight_number": null, "city": "Cáqueza", "zone": "Cundinamarca", "country": "Colombia", "region": "South America", "crew_on_board": 5, "crew_fatalities": 4, "pax_on_board": 11, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Santa Cecilia Airport, Bogotá at 0647LT bound for Medellín and Quibdó, carrying a crew of 5 and 11 passengers. Take-off was made at a time when the airport was closed due to poor visibility. While flying on instruments a few moments after take-off, the starboard engine failed. The aircraft continued its flight over the Sabana de Bogotá for approximately 23 minutes, following which, while flying on a magnetic heading of approximately 280 degrees, it crashed violently (at approximately 0705LT) against the Quetame Hill located near Cáqueza, about 30 km southeast of Bogotá, at an elevation of 9,170 feet. The flight engineer and one passenger were injured while 14 other occupants were killed.", "probable_cause": "The probable cause of the accident was a complete failure of the starboard engine due to the breakdown of the lubricating system. The following factors were considered as contributing:\r\n- Recklessness of the pilot in taking off from a closed airport while aware of the poor weather conditions prevailing throughout the Sabana, a circumstance which prevented returning to the airport of departure when complete breakdown of the starboard engine occurred,\r\n- The 1,506 kg overload of the aircraft above the maximum gross operating weight for Bogotá according to the performance curves of the aircraft,\r\n- The adverse weather conditions prevailing from the moment of take-off until the moment of the accident,\r\n- An error of judgment on the part of the Operations and Maintenance Sections of the Company in failing to provide for a test flight of the aircraft after the turbine section had been changed and in finding aircraft HK-133 airworthy for the purpose of a scheduled flight with passengers under such conditions,\r\n- The lack of competent air traffic and weather authorities at Santa Cecilia airport in a position to check civil aviation regulations and to prohibit take off from a closed airport,\r\n- Faulty internal organization within AIDA which should have defined exactly the duties of the Maintenance Superintendent, of the Maintenance Chief and of the Dispatcher,\r\n- The failure of the Company to have available a spare engine which would have avoided carrying out such delicate repair work in a hasty manner."}