{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-hunter-point-2-killed", "date": "Jun 23, 1994 at 1100 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Harbour%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Hunter Point – Sandspit", "msn": "37", "yom": 1949, "flight_number": null, "city": "Hunter Point", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2586, "captain_hours_type": 1268, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11615, "circumstances": "The amphibious DHC-2 Beaver was being operated from the Harbour Air base at Sandspit, British Columbia, located on the Queen Charlotte Islands. On the first flight on the day of the accident, the aircraft carried baggage from the Sandspit Airport to a floating fishing resort at anchor in Givenchy Bay. This bay is located in the Kano Inlet on the west coast of the Queen Charlotte Islands, 28 nautical miles (nm) west of Sandspit. On board the aircraft with the pilot was a passenger who would remain with the flight for the return trip to Sandspit. The aircraft departed Sandspit under visual flight rules (VFR) at 1015 Pacific daylight time (PDT)  and landed at the fishing resort at 1039. The pilot had taken the most direct route to the destination through a low pass and over Yakoun Lake. He advised the company dispatch on the company radio frequency that the weather was quite poor along that route and that he planned to take the Skidegate Channel for the return trip. On arrival at the Givenchy resort, the aircraft was loaded with the fish to be transported to Sandspit; it then departed Givenchy at 1051. When the aircraft did not arrive at Sandspit, a search was organized. The wreckage was located at 1245 at Hunter Point, about 7 nm from Givenchy, at latitude 53°15'N, longitude 132°42'W. The accident had occurred during the hours of daylight at approximately 1100. The aircraft was destroyed and the pilot and passenger were fatally injured upon impact.", "probable_cause": "The aircraft likely stalled at an altitude insufficient to permit recovery. The reason why the aircraft may have stalled could not be determined."}