{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-exeter-1-killed", "date": "Feb 17, 2002 at 1752 LT", "type": "Rockwell Shrike Commander 500", "operator": "Madeira Helicopters", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Wilmington - Newport", "msn": "500-3277", "yom": 1976, "flight_number": null, "city": "Exeter", "zone": "Rhode Island", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 900, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2145, "circumstances": "The airplane was in instrument meteorological conditions and the pilot was cleared for an approach. As the airplane neared the final approach fix, the controller observed the airplane diverge from the approach course and change altitude rapidly. Shortly thereafter, the pilot said he had \"all sorts of problems.\" The pilot requested and received vectors to an alternate airport. At 1748:29, the pilot was cleared for an ILS approach and was told to report when \"established\" on the approach. When asked if he was established on the ILS course, the pilot replied \"I sure hope so.\" The controller observed the airplane descend below the published glide slope intercept altitude and advised the pilot to climb back to 2,000 feet. The pilot reported \"I have problems.\" When asked the nature of the problem, the pilot reported \"...I'm all over the place...I think I'm iced up...\" Radar data indicated the airplane's radar track began following a left descending turn from 1,900 feet, about 1 minute before radar contact was lost. At 1751:33, the controller advised the pilot that his altitude was 1,000 feet, and requested that he climb to 3,000 feet. The pilot responded, \"hey, I'm trying like hell.\" Radar contact with the airplane was lost about 1752, at 800 feet. A witness near the accident site stated he observed the airplane come out of the clouds, \"wobbling\" from side to side, make a \"hard\" left turn and strike the ground. He stated the engine was \"loud\" and seemed to be at \"full throttle.\" Examination of the airplane did not reveal any pre impact mechanical malfunctions. The pilot purchased the accident airplane about 2 months prior to the accident. His total flight time in make and model was estimated to be about 200 hours. Airman's Meteorological Information (AIRMET) Zulu, Update 4, for Ice and Freezing Level was valid for the accident site area at the time of the accident. The AIRMET advised of occasional moderate rime/mixed icing in cloud in precipitation below 12,000 feet. The AIRMET reported the freezing level was from the surface to 4,000 feet. According to United States Naval Observatory astronomical data obtained for the accident site area, Sunset occurred at 1723, and the end of civil twilight was at 1751. The airplane was equipped with both wing leading edge and empennage de-icing boots. The switches for the de-icing boots were observed in the \"Auto\" position. The propeller de-ice and windshield anti-ice switches were observed in the \"off\" position.", "probable_cause": "The pilot's failure to maintain control after encountering icing conditions while on approach for landing. Factors in this accident were the night light conditions and pilot's failure to select the airplane's propeller de-icing switches to the \"on\" position."}