{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-davis-inlet-1-killed", "date": "Mar 19, 1999 at 0945 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Provincial%20Airlines2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Goose Bay - Davis Inlet", "msn": "724", "yom": 1980, "flight_number": "PB960", "city": "Davis Inlet", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1600, "captain_hours_type": 2500, "copilot_hours": 500, "copilot_hours_type": 70, "aircraft_hours": 30490, "circumstances": "The flight was a pilot self-dispatched, non-scheduled cargo flight from Goose Bay to Davis Inlet, Newfoundland, and was operating as Speed Air 960 under a defence visual flight rules flight plan. Before the flight, the captain received weather information from the St. John's, Newfoundland, flight service station (FSS) via telephone and fax. The aircraft departed for Davis Inlet at 0815 Atlantic standard time (AST). The captain was the pilot flying (PF). During the first approach, the first officer (FO) had occasional visual glimpses of the snow on the surface. The captain descended the aircraft to the minimum descent altitude (MDA) of 1340 feet above sea level (asl). When the crew did not acquire the required visual references at the missed approach point, they executed a missed approach. On the second approach, the captain flew outbound from the beacon at 3000 feet asl until turning on the inbound track. It was decided that if visual contact of the surface was made at any time during the approach procedure, they would continue below the MDA in anticipation of the required visual references. The captain initiated a constant descent at approximately 1500 feet per minute with 10 degrees flap selected. The FO occasionally caught glimpses of the surface. At MDA, in whiteout conditions, the captain continued the descent. In the final stages of the descent, the FO acquired visual ground contact; 16 seconds before impact, the captain also acquired visual ground contact. At 8 seconds before impact, the crew selected maximum propeller revolutions per minute. The aircraft struck the ice in controlled flight two nautical miles (nm) from the airport (see Appendix B). During both approaches, the aircraft encountered airframe icing. The crew selected wing de-ice, which functioned normally by removing the ice.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The captain decided to descend below the minimum descent altitude (MDA) without the required visual references.\r\n2. After descending below MDA, both pilots were preoccupied with acquiring and maintaining visual contact with the ground and did not adequately monitor the flight instruments; thus, the aircraft flew into the ice.\r\nFindings as to Risk:\r\n1. The flight crew did not follow company standard operating procedures.\r\n2. Portions of the flight were conducted in areas where the minimum visual meteorological conditions required for visual flight rules flight were not present.\r\n3. Although both pilots recently attended crew resource management (CRM) training, important CRM concepts were not applied during the flight.\r\n4. The cargo was not adequately secured before departure, which increased the risk of injury to the crew.\r\n5. The company manager and the pilot-in-command did not ensure that safe aircraft loading procedures were followed for the occurrence flight.\r\n6. There were lapses in the company's management of the Goose Bay operation; these lapses were not detected by Transport Canada's safety oversight activities.\r\n7. The aircraft was not equipped with a ground proximity warning system, nor was one required by regulation.\r\n8. Records establish that the aircraft departed approximately 500 pounds overweight.\r\nOther Findings:\r\n1. The flight crew were certified, trained, and qualified to operate the flight in accordance with existing regulations and had recently attended CRM training.\r\n2. During both instrument approaches, the aircraft was operating in instrument meteorological conditions and icing conditions.\r\n3. There was no airframe failure or system malfunction prior to or during the flight. In particular, the airframe de-icing system was serviceable and in operation during both approaches.\r\n4. It was determined that an ice-contaminated tailplane stall did not occur.\r\n5. The fuel weight was not properly recorded in the journey logbook.\r\n6. The wreckage pattern was consistent with a controlled, shallow descent.\r\n7. The emergency locator transmitter was damaged due to impact forces during the accident, rendering it inoperable."}