{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-300-mt-knukur-8-killed", "date": "Sep 26, 1970 at 1056 LT", "type": "Fokker F27 Friendship", "operator": "Flugfelag-Islands-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Reykjavik – Vágar", "msn": "10356", "yom": 1968, "flight_number": "FI701", "city": "Mt Knúkur", "zone": "Vágar", "country": "Faroe Islands", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 1, "pax_on_board": 30, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5419, "circumstances": "Flights from Reykjavik to Vágar were cancelled on 23 and 24 September. On 25 September, while approaching the Faroe Islands, weather was poor and the crew diverted to Bergen Airport, Norway. In the morning of 26 September, it appears that weather conditions improved slightly at Vágar Airport. On approach, the crew encountered clouds and limited visibility so the pilot was unable to locate the fjord mouth. Following a holding circuit of 25 minutes over the MY NDB, the crew initiated a descent. A minute later, while at an altitude of 1,55 feet, the airplane struck the slope of Mt Knukur located few km from the airfield. A crew members and seven passengers were killed while 26 other occupants were injured. ", "probable_cause": "The cause of the accident was that FI 701 began a descent through cloud procedure from a starting point other than over \"MY\" NDB. During this procedure the aircraft hit close to the highest point of Myggenaes at an altitude of about 1500 ft. The reason for starting the procedure from a position other than \"MY\", has probably been an interference caused by FI 701's weather radar, which on the ADF's has given the crew an erroneous indication that they were passing \"MY\" NDB."}