{"url": "https://www.baaa-acro.com/crash/crash-fokker-f12-crawley-2-killed", "date": "Nov 19, 1936 at 0338 LT", "type": "Fokker F12", "operator": "British-Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Postal (mail)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Hanover – London", "msn": "5300", "yom": 1931, "flight_number": null, "city": "Crawley", "zone": "West Sussex", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5000, "captain_hours_type": 2, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was employed on the regular night mail service between Gatwick and Hanover and the crash occurred on the return flight from Hanover when the pilot was preparing to approach the vicinity of Gatwick Airport. The pilot Hattersley was, in fact, on his first ever return flight on this route with this type of aircraft, although he had flown the double journey four times previously in a DH.86. On the flight in question the pilot had been flying in cloud over most of the route and particularly over England. The weather conditions were bad with lots of low cloud at about 200 metres and there was a strong NE wind reaching as much as 60kn/h at ground level. The pilot navigated by means of W/T bearings sent from Croydon, Lympne, Pulham and Gatwick. Hattersley successfully brought the Fokker through cloud to the vicinity of the airport, and his engines were clearly heard from the ground. Control told him that they had heard him and sent a further five bearings in quick succession - no acknowledgement was received for the last bearing and the Fokker sent no further messages. Repeated attempts were made to communicate with G-AEOT but without success. Gatwick then telephoned every local police station in an endeavour to learn whether anyone had heard anything of the aircraft. A search party, including the airport ambulance and fire engine, set out. At 0610 the wireless operator (C.G.V. Wheeler) of the missing aircraft telephoned the control officer at Crawley and stated that the machine had crashed to the south of Crawley. The local ambulance was informed and it left immediately for the scene of the accident. G-AEOT had crashed into trees on Round Hill, 4 miles south of Gatwick Airport. It was upside down and extensively damaged, with the fuselage completely broken up. The flight engineer, G.R.C. Blowers, was lying injured on the ground near the machine, and Hattersley and the second pilot, V.C.W. Bredenkamp, were both dead in the wreckage.\r\nSource: http://sussexhistoryforum.co.uk/index.php?topic=925.0", "probable_cause": "The AAIB Inquiry decided that the accident was caused by the pilot making an error of judgement in that he hadn't taken into account that the very strong NE wind would greatly widen his low altitude turn, causing the Fokker to drift off course and hit the high ground. "}