{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-20f-lugano", "date": "Jan 15, 1988 at 0924 LT", "type": "Dassault Falcon 20", "operator": "Segas International", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lugano - Rome", "msn": "244", "yom": 1970, "flight_number": null, "city": "Lugano-Agno", "zone": "Ticino", "country": "Switzerland", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7618, "captain_hours_type": 1574, "copilot_hours": 2747, "copilot_hours_type": 1456, "aircraft_hours": 6569, "circumstances": "During the takeoff roll on runway 21, just before reaching V1 (112 knots), the captain thought that the right engine lost power. He decided to abandon the takeoff maneuver and initiated an emergency braking procedure. Unable to stop within the remaining distance, the aircraft overran at a speed of about 60-70 knots, rolled in a snow covered field and eventually collided with an embankment, coming to rest, broken in two. Both pilots were injured.", "probable_cause": "The accident is attributable to a rejected take-off just before reaching the critical speed of decision (V1), due to an alleged loss of power of the right engine. \r\nThe following contributing factors were reported:\r\n- The lack of data for the calculation of the accelerate-stop distance in the operating manual (AOM) of the Dassault aircraft for takeoff on wet or contaminated runways;\r\n- Insufficient consideration of the state of the runway, to determine the maximum take-off mass, in regard to the \"accelerate-stop\" distance;\r\n- Insufficient preparation for takeoff;\r\n- Lack of coordination between the crew at the time of engine failure;\r\n- Insufficient mental preparation of the crew before takeoff;\r\n- The non-inclusion of de-icing system of the engines, in dangerous meteorological conditions with freezing temperatures;\r\n- Insufficient training of the crew on the flight simulator, especially for what concerns the problems and take-off interruption;\r\n- Aquaplaning;\r\n- No airbrakes extended;\r\n- Failure to use the braking parachute."}