{"url": "https://www.baaa-acro.com/crash/crash-boeing-247d-near-newhall-5-killed", "date": "Jan 12, 1937 at 1107 LT", "type": "Boeing 247", "operator": "Western%20Air%20Express-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Salt Lake City – Las Vegas – Burbank – Long Beach – San Diego", "msn": "1696", "yom": 1935, "flight_number": "WX007", "city": "Newhall", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 10, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Passing over Saugus at 5,200 feet, the aircraft was already 300 feet below the minimum prescribed altitude. The pilot elected to contact ATC without any success. Due to low visibility caused by foggy conditions, the pilot failed to realize he was flying at an insufficient altitude. With a rate of descent of 525 feet per minute, the twin engine aircraft impacted the slope of the Pinetos Peak located near Newhall. The copilot and four passengers, among them the explorer Martin Johnson, were killed.\r\nCrew:\r\nWilliam W. Lewis, pilot,\r\nClifford P. Owens, copilot, †\r\nEsther Jo Connor, stewardess.\r\nPassengers:\r\nJames Braden, †\r\nMartin Johnson, †\r\nOsa Johnson,\r\nA. L. Loomis, †\r\nE. E. Spencer, †\r\nArthur Robinson,\r\nR. T. Andersen,\r\nH. H. Hulse,\r\nLita James,\r\nT. E. Tillinghast. ", "probable_cause": "Summarizing, therefore, it is evident that several factors gave rise to this accident. Advance notification to the control tower at Burbank, either by the pilot or company personnel, would have assured continuous localizer operation, available to the pilot when needed. Continuing down the Saugus range for two minutes before switching to the Burbank localizer, as prescribed by the company, would have kept the pilot on course for at least two minutes longer and the danger of colliding with the mountains would have been reduced by that much. However, the Saugus range was in continuous operation and it is not understood why the pilot did not immediately switch back to this range when he discovered that the Burbank frequency was busy with voice transmission. This would have definitely guided him through the high mountains or until he had requested and received continuous operation of the Burbank range. Likewise, it is not understood why the pilot continued in descending flight without the aid of range guidance. It is the opinion of the Accident Board that the probable cause of this accident was error on the part of the pilot for descending to a dangerously low altitude without positive knowledge of his position."}