{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-382-mt-potosi-22-killed", "date": "Jan 16, 1942 at 1920 LT", "type": "Douglas DC-3", "operator": "TWA-1", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "New York – Saint Louis – Albuquerque – Winslow – Las Vegas – Burbank – Los Angeles", "msn": "3295", "yom": 1941, "flight_number": "TW003", "city": "Mt Potosi", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 19, "pax_fatalities": 19, "other_fatalities": 0, "total_fatalities": 22, "captain_hours": 12024, "captain_hours_type": 3500, "copilot_hours": 1330, "copilot_hours_type": 650, "aircraft_hours": null, "circumstances": "The airplane was en route from New York to Los Angeles with several intermediate stops, carrying 19 passengers and a crew of three. About fifteen minutes after take off from Las Vegas-McCarran Airport, while leveling off at night, the airplane impacted the slope of Mt Potosi located 51 km southwest of Las Vegas. The airplane disintegrated on impact and all 22 occupants were killed. At the time of the accident, the aircraft was cruising at an altitude of 7,700 feet while the summit of the mountain is about 8,500 feet. The visibility was limited. Among the victims was the American actress Carole Lombard, aged 33, her mother Elizabeth Peters and her agent.\r\nCrew:\r\nWayne C. Williams, pilot,\r\nM. A. Gillette, copilot,\r\nAlice Frances Getz, stewardess.\r\nSource & photos:\r\nhttp://www.lostflights.com/Commercial-Aviation/11642-TWA-TWA-Douglas-DC-3/5007934_mqCvFr", "probable_cause": "Upon the basis of the foregoing findings and of the entire record available at this time, investigation board found that the probable cause of the accident  was the failure of the captain after departure from Las Vegas to follow the proper course by making use of the navigational facilities available to him. \r\nContributing factors:\r\n- The use of an erroneous compass course, \r\n- Blackout of most of the beacons in the neighborhood of the accident,\r\n- Failure of the pilot to comply with TWA's directive of July 17, 1941, issued in accordance with a suggestion from the Administrator of Civil Aeronautics requesting pilots to confine their flight movements to the actual on-course signals."}