{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-kamloops-1-killed", "date": "Nov 22, 1995 at 1902 LT", "type": "Piper PA-31-310 Navajo", "operator": "Nav%20Air%20Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Postal (mail)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Williams Lake – Kamloops – Vancouver", "msn": "31-598", "yom": 1970, "flight_number": "FCV705", "city": "Kamloops", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Navair Charter Piper PA-31, flight FCV705, a mail courier with a crew of two, was on a night, instrument flight rules (IFR) flight plan from Williams Lake, British Columbia, to Kamloops. While the crew was conducting an instrument procedure to the Kamloops airport, they flew into an area that was clear of cloud. The captain cancelled his IFR flight plan and descended for a visual flight rules (VFR) approach to the airport. At 1902 PST, the aircraft collided with trees at an elevation of 2,400 feet above sea level (asl), seven nautical miles (nm) east-southeast of the Kamloops airport. The captain was fatally injured on impact, and the first officer was seriously injured; the aircraft was destroyed during the crash and post-crash fire.", "probable_cause": "The aircraft collided with trees during a night, VFR descent over mountainous terrain because the crew had inadequate visual cues to accurately determine their height above the ground. Contributing to this accident were the captain's decision to cancel his IFR flight plan and attempt a visual approach from well outside the published VFR circuit area, the inherent risks of VFR flight in mountainous regions, and a requirement by the crew to remain clear of departing IFR traffic from the Kamloops airport."}