{"url": "https://www.baaa-acro.com/crash/crash-rockwell-sabreliner-60-phoenix", "date": "Nov 7, 1992 at 2226 LT", "type": "Rockwell Sabreliner 60", "operator": "Halford R. Price", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Salina - Phoenix", "msn": "306-45", "yom": 1969, "flight_number": null, "city": "Phoenix-Sky Harbor", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8456, "captain_hours_type": 961, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9366, "circumstances": "Upon landing at the completion of a cross country flight, the captain of the turbojet aircraft employed aerodynamic braking and thrust reverse to slow the airplane to about 60 knots. The captain was allowing the airplane to roll toward the end of the runway where the owner/copilot's hanger was located. With about 4,000 feet of runway remaining, the captain applied the brakes. No braking action was noted. The airplane continued off the end of the runway, through a fence and block wall into a parking lot where the left wing of the airplane was severed. A post crash fire consumed about half of the airplane. Emergency braking procedures were not employed. The crew reported that the were unable to shut down the engines. The copilot lacked experience in the aircraft and crew coordination during the approach, landing, and emergency was ineffective. The airplane traveled about 11,000 feet from point of touchdown to point of rest. Examination of the braking and hydraulic systems failed to pinpoint a malfunction. ", "probable_cause": "The delay of the pic to apply normal braking and his failure to execute the appropriate emergency procedures. Contributing to this accident was an undetermined antiskid malfunction; the copilot's inexperience in the aircraft; and inadequate crew coordination."}