{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-jumla-9-killed", "date": "Jun 21, 2006 at 1203 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Yeti-Airlines-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Nepālganj – Surkhet – Jumla", "msn": "708", "yom": 1980, "flight_number": null, "city": "Jumla", "zone": "Karnali", "country": "Nepal", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 23392, "circumstances": "The twin engine aircraft departed Nepālganj Airport on a domestic service to Jumla with an intermediate stop in Surkhet, carrying six passengers, three crew members and a load consisting of bags containing grains for a total of 941 kilos. While approaching Jumla Airport, the crew was informed that runway 27 was in use with a wind from 240 at 4 knots. For unknown reasons, the captain started the approach to runway 09 at 1201LT. At an excessive speed, he missed the runway, initiated a go-around procedure and passed to the right of the tower. Then, he started a steep turn to the left when the aircraft lost height and speed and crashed in a field located 500 meters east of the airport, bursting into flames. The aircraft was totally destroyed by impact forces and a post crash fire and all 9 occupants were killed. ", "probable_cause": "The crew's attempt to make a sudden go-around while close to runway 09 threshold with a very low circuit altitude and subsequent attempt to turn in a tight circuit with excessive angle of bank that led to a stall. The aircraft subsequently contacted terrain due to insufficient clearance available for effective stall recovery. The quick decisions to change runway added to the crew workload at a critical period which was aggravated by the breakdown of cockpit discipline. The other contributory factors leading to the accident were:\r\n- Violation of company Standard Operating Procedures by flight crew,\r\n- Insufficient monitoring of its flight training program and line operations by Yeti management,\r\n- Inadequate oversight of Yeti Airlines by CAAN."}