{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-fawcett-lake-4-killed", "date": "May 18, 2004 at 1800 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Pickerel Arm Camps", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Pickeral Arm Camp - Fawcett Lake", "msn": "682", "yom": 1954, "flight_number": null, "city": "Fawcett Lake", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1688, "captain_hours_type": 344, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Pickerel Arm Camps is located about 22 km south of Sioux Lookout, Ontario. It operates a main campsite at its water base and several remote fishing lodges. The company operates two float equipped de Havilland DHC-2 Beaver aircraft to fly guests and supplies to their remote sites. Seven guests of the company arrived at the water base on 18 May 2004, the day before their scheduled four-day fishing trip at Fawcett Lake, one of the remote lodges. Because the remote lodge was available, a decision was made to fly in that afternoon. The group was divided in two, and a group of three guests and all the supplies for the seven guests were to go in the first aircraft. The second group of four, with their personal baggage, was to follow in the company’s other Beaver. The occurrence aircraft, a de Havilland DHC-2 Beaver (C-GQHT, serial number 682) with one pilot and three camp guests on board, departed the company water base at approximately 1700 eastern daylight time on a day visual flight rules flight to Fawcett Lake. At approximately 1930, the pilot and the other four guests arrived in the second aircraft to discover that the first group had not arrived. The guests later found the accident aircraft overturned in the lake. Ontario Provincial Police divers recovered the bodies of the pilot and the three passengers. The aircraft sustained substantial damage. There was no fire.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The pilot flew a high-drag approach configuration for which his proficiency was not established.\r\n2. The pilot most likely allowed the airspeed to decrease to the point that the aircraft stalled on approach at an altitude at which recovery was unlikely.\r\n3. The impact was non-survivable because of the high impact forces. \r\nFindings as to Risk:\r\n1. The emergency locator transmitter (ELT) airframe antenna was broken off above the fuselage; however, the flight was within the 30-day period allowed by regulation for flight with an unserviceable ELT.\r\n2. The pilot did not secure the cargo prior to flight, which allowed the cargo to shift forward on impact.\r\n3. The weight and centre of gravity (C of G) were not indicated in the operational flight plan and load record, and the aircraft’s weight and C of G could only be estimated."}