{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-near-fort-collins-50-killed", "date": "Jun 30, 1951 at 0200 LT", "type": "Douglas DC-6", "operator": "United-Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "San Francisco – Oakland – Salt Lake City – Denver – Chicago", "msn": "43144", "yom": 1950, "flight_number": "UA610", "city": "Fort Collins", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 45, "pax_fatalities": 45, "other_fatalities": 0, "total_fatalities": 50, "captain_hours": 10565, "captain_hours_type": 106, "copilot_hours": 5848, "copilot_hours_type": 1526, "aircraft_hours": 3784, "circumstances": "Flight 610 of June 29, 1951, originated in San Francisco, California, and was scheduled to Chicago, Illinois, with en route stops, among which were Oakland, California, Salt Lake City, Utah, and Denver, Colorado. The crew consisted of Captain J R Appleby, First Officer H G Tower, Flight Engineer A T Petrovitch, and Stewardesses C J Baymond and F M Smith. The flight departed San Francisco on schedule at 1915 and after stopping at Oakland proceeded to Salt Lake City, arriving there at 2324. It departed Salt Lake City at 0011, June 30, 1951, 26 minutes behind schedule due to the reloading of bulky cargo At the time of departure the aircraft weighed 78,597 pounds, which was within the certificated gross take-off weight of 79,380 pounds, the load was properly distributed with respect to the center of gravity. There were five crew members, forty-four adult passengers and one infant on board. The approved flight clearance indicated an IFR flight, via Bed Airway 49, Green Airway 3, and Amber Airway 3, to Denver at a cruising altitude of 15,000 feet, with Omaha, Nebraska, designated as the alternate airport.  The flight proceeded in a routine manner and at 0104 reported over Rock Springs, Wyoming, at 15,000 feet, estimating its arrival over Cheyeme, Wyoming, at 0147 and over Denver at 0207 2 Forty-three minutes later, at 0147, the flight reported having passed the Silver Crown fan marker (located 12 miles west of Cheyenne) and requested a lower altitude Accordingly, a new clearance was immediately issued-\"ARTC clears United 610 to Dupont intersection, 3 descend to 8500 feet immediately after passing Cheyenne, maintain 8500 feet, no delay expected, contact approach control over Dacono \"4 This clearance was acknowledged and the flight reported that it was over Cheyenne at 0147, at 15,000 feet and was now starting to descend. The Denver altimeter setting was then given the flight as being 30 19 inches. Nine minutes later, at 0156, the flight reported reaching its assigned altitude of 8,500 feet No further communication was received from the flight. At 0200, the Denver Control Tower requested the company radio operator to advise the flight to call approach control Repeated calls were made without an answer. It was later determined that Flight 610 had crashed on a mountain (Mt Crystal) 18 miles west-southwest of Fort Collins, Colorado. All 50 occupants were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was that, after passing Cheyenne, the flight for reasons undetermined failed to follow the prescribed route to Denver and continued beyond the boundary of the airway on a course which resulted in the aircraft striking mountainous terrain."}