{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-near-canadian-2-killed", "date": "Feb 15, 2019 at 1000 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Charles S. Azzopardi", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Amarillo – Canadian", "msn": "421C-0874", "yom": 1980, "flight_number": null, "city": "Canadian", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6227, "circumstances": "The pilot was conducting a personal cross-country flight with one passenger in his twin-engine airplane. There was no record that the pilot received a weather briefing before the accident flight. While en route to the destination, the pilot was in contact with air traffic control and received visual flight rules flightfollowing services. About 18 miles from the destination airport, the radar service was terminated, as is typical in this geographic region due to insufficient radio and radar coverage below 7,000 ft. The airplane was heading northeast at 4,900 ft mean sea level (msl) (about 2,200 ft above ground level [agl]). About 4 minutes later, radar coverage resumed, and the airplane was 6 miles west of the airport at 4,100 ft msl (1,400 ft agl) and climbing to the north. The airplane climbed through 6,000 ft msl (3,300 ft agl), then began a shallow left turn and climbed to 6,600 ft msl (3,800 ft agl), then began to descend while continuing the shallow left turn ; the last radar data point showed the airplane was about 20 nm northwest of the airport, 5,100 ft msl (2,350 ft agl) on a southwest heading. The final recorded data was about 13 miles northwest of the accident site. A witness near the destination airport heard the pilot on the radio. He reported that the pilot asked about the cloud height and the witness responded that the clouds were 800 to 1,000 ft agl. In his final radio call, the pilot told the witness, \"Ok, see you in a little bit.\" The witness did not see the airplane in the air. The airplane impacted terrain in a slightly nose-low and wings-level attitude with no evidence of forward movement, and a postimpact fire destroyed a majority of the wreckage. The damage to the airplane was consistent with a relatively flat spin to the left at the time of impact. A postaccident examination did not reveal any preimpact mechanical malfunctions or anomalies that would have precluded normal operation. A detailed examination of the cockpit instruments and other portions of the wreckage was not possible due to the fire damage. A cold front had advanced from the northeast and instrument meteorological conditions prevailed across the region surrounding the accident site and the destination airport; the cloud ceilings were 400 ft to 900 ft above ground level. The airplane likely experienced wind shear below 3,000 ft, and there was likely icing in the clouds. While moderate icing conditions were forecast for the accident site, about the time of  the accident, investigators were unable to determine the amount and severity of icing the flight may have experienced. The weather conditions had deteriorated over the previous 1 to 2 hours. The conditions at the destination airport had been clear about 2 hours before accident, and visual flight rules conditions about 1 hour before accident, when the pilot departed. Based on the available evidence it is likely that the pilot was unable to maintain control of the airplane, which resulted in an aerodynamic stall and spin into terrain.", "probable_cause": "The pilot's failure to maintain control of the airplane while in instrument meteorological conditions with icing conditions present, which resulted in an aerodynamic stall and spin into terrain.\n"}