{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-120rt-brasilia-vilhena", "date": "Mar 3, 1997 at 0044 LT", "type": "Embraer EMB-120 Brasília", "operator": "Pantanal%20Linhas%20Aereas.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Campo Grande - Vilhena", "msn": "120-206", "yom": 1990, "flight_number": "PTN126", "city": "Vilhena", "zone": "Rondônia", "country": "Brazil", "region": "South America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 13, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9280, "captain_hours_type": 2501, "copilot_hours": 4153, "copilot_hours_type": 1988, "aircraft_hours": null, "circumstances": "En route from Campo Grande to Vilhena, while in cruising altitude, the crew received the last weather bulletin about Vilhena with conditions below minimums. The copilot (under line check on this flight) suggested to divert to the alternate airport but the captain/instructor preferred to attempt an approach via Echo 1 and the NDB for runway 03. If visual contact would not be established at decision height, the crew would divert to the alternate airport. Then the copilot set the decision height at 2,500 feet which was wrong as the correct decision height was fixed at 2,560 feet. Nor the copilot nor the captain realized this mistake prior to start the descent to Vilhena Airport. On approach, the copilot was told by captain to monitor the horizon. He focused his attention on the horizon and failed to monitor the altimer. On his side, the captain elected to establish a visual contact with the ground and the runway light but is was later confirmed that the city of Vilhena suffered a general blackout. On final, the aircraft descended below MDA then struck trees and crashed less than one km from the runway threshold, bursting into flames. All 16 occupants evacuated safely while the aircraft was destroyed by fire. ", "probable_cause": "The following findings were identified:\r\n- Poor crew coordination, \r\n- Wrong approach configuration, \r\n- The crew's attention was focused on their respective tasks without monitoring the approach configuration, causing the aircraft to descent below the glide,\r\n- The captain/instructor failed to supervise properly the copilot's manoeuvres, \r\n- No approach briefing, \r\n- Lack of visibility due to a general blackout.\n\n"}