{"url": "https://www.baaa-acro.com/crash/crash-antonov-24rv-yakutsk", "date": "Jul 13, 2002 at 1418 LT", "type": "Antonov AN-24", "operator": "Sakha%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yakutsk - Yakutsk", "msn": "47309601", "yom": 1974, "flight_number": null, "city": "Yakutsk-Intl (Platon Oyunsky)", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Antonov departed Yakutsk on a crew training flight. Two approach and landings were carried out using flap settings of 38 and 15 degrees. During the third approach the captain called for lowering of the landing gear. The flight engineer moved the landing gear handle from neutral into the \"retract\" position. He did not check for three greens so failed to notice his mistake. Then the captain requested the flaps to be selected at 10 degrees. The Antonov turned to finals, but the crew did not carry out the final approach checks and continued after having obtained landing clearance. Fourteen seconds before touchdown an air traffic controller informed the crew that they should go around because the landing gear was not down. The captain did not hear this because at that moment height and speed were called out by the flight engineer. Five seconds later the controller repeated his warning. One of the crew members heard the call and noticed three reds on the instrument panel. He informed that captain about this, but it was already too late. The captain added takeoff power, but within three seconds the tail struck the runway. The airplane skidded about 1000 metres before coming to rest.", "probable_cause": "The accident was caused by the combination of the following factors:\r\n- The erroneous actions of the flight engineer when trying to lower the landing gear,\r\n- Failure of the flight crew to conduct the necessary (final approach) checks,\r\n- The failure by the crew to check and respond to landing gear warning indications,\r\n- The execution of a flight with an incomplete composition of crew, causing additional workload on the flight engineer during the approach (height and speed call outs),\r\n- Late commands to go around by the air traffic controller,\r\n- On the Yak-40 the landing gear handle moves to the opposite direction for retraction and lowering compared to the Antonov 24 (the flight mechanic had more, and recent, flight experience on the Yakovlev 40 jet),\r\n- The large workload and fatigue of the crew during the recent six days before the incident."}