{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-islander-block-island-8-killed", "date": "Nov 28, 1989 at 1825 LT", "type": "Britten-Norman Islander", "operator": "New%20England%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Block Island - Westerly", "msn": "69", "yom": 1969, "flight_number": null, "city": "Block Island", "zone": "Rhode Island", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 2800, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On dark (moonless) night, non schedule domestic passenger flight departed Block Island for Westerly, RI, with 7 passengers and 2 dogs. It crashed along route in Block Island Sound, 3 to 5 miles northwest of island (an area lacking visibility reference on SFC). Later, main wreckage was found in 130 feet of water. Additional wreckage and bodies of pilot, 3 passengers and 2 dogs were found. Aircraft was badly damaged during impact (left wing separated outbound of left engine, extensive damage to forward part of aircraft), but no preimpact part failure/malfunction was found. Commercial/instructor rated pilot was part time employee. He was on medication for lyme disease, but no physiological problem was found that would have resulted in accident. At approximately 1720 est, there was a pirep of a broken cloud layer at 10,000 feet. Another pilot, who was flying at about the same time, reported scattered clouds above 10,000 feet, over 10 miles visibility, wind westerly at 15 to 25 mph and light to moderate turbulences. Sigmet (golf 4) warned of moderate occasional severe turbulences below 6,000 feet and potential of low level windshear. Accident occurred along bird migratory route. There had been no recent FAA inspection of base, ramp, cockpit (en route check), ground/flight training program, crew/dispatch/trip record. All eight occupants were killed. ", "probable_cause": "The aircraft crashed for an undetermined reason, during an overwater flight on a dark (moonless) night under a cloud layer. A sigmet was in effect warning of moderate to occasionally severe turbulence below 6,000 feet and the potential of low level wind shear."}