{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-222-chicago-45-killed", "date": "Dec 8, 1972 at 1428 LT", "type": "Boeing 737-200", "operator": "United-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "City", "schedule": "Washington DC - Chicago - Omaha", "msn": "19069/75", "yom": 1968, "flight_number": "UA553", "city": "Chicago-Midway", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 3, "pax_on_board": 55, "pax_fatalities": 40, "other_fatalities": 2, "total_fatalities": 45, "captain_hours": 18000, "captain_hours_type": 2435, "copilot_hours": 10638, "copilot_hours_type": 1676, "aircraft_hours": 7247, "circumstances": "Flight UA553 departed Washington-National Airport at 1250LT for Omaha with an intermediate stop at Chicago-Midway Airport. Chicago ARTCC cleared the crew to descend to 4000 feet and the flight was given vectors for a Midway Airport runway 31L localizer course. At 14:19 the flight was transferred to Chicago Approach Control which later requested UA553 to slow down to 180 knots and later down to 160 knots. After issuing a descent clearance down to 2000 feet at 14:23 the controller requested the flight to slow down to approach speed because of separation between UA553 and a preceding Aero Commander. At 14:24 the Aero Commander passed the Outer Marker and was cleared to land on runway 31L. Two minutes later UA553 passed the Outer Marker inbound. Then, at 14:27:04 the air traffic controller decided to issue a missed approach clearance: \"United 553 execute a missed approach make a left turn to a heading of 180 climb to 2000\". At the same time, having just reached 1000 feet, the stick shaker suddenly activated. Full power was applied and the gear was retracted in an attempt to execute a missed approach. The Boeing continued to descend however, attaining a high nose up attitude (of at least 30deg, according to some survivors). The aircraft then clipped a tree and impacted trees, houses, utility pole cables and garages before coming to rest. Post crash fire destroyed part of the fuselage.", "probable_cause": "The captain's failure to exercise positive flight management during the execution of a non-precision approach, which culminated in a critical deterioration of airspeed into the stall regime where level flight could no longer be maintained."}