{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-mt-chachacomani-39-killed", "date": "Mar 15, 1963 at 1355 LT", "type": "Douglas DC-6", "operator": "LAB%20Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Arica – La Paz – Cochabamba", "msn": "43547", "yom": 1951, "flight_number": "LB915", "city": "Mt Chachacomani", "zone": "Tacna", "country": "Peru", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 36, "pax_fatalities": 36, "other_fatalities": 0, "total_fatalities": 39, "captain_hours": 10069, "captain_hours_type": 1319, "copilot_hours": 4034, "copilot_hours_type": 910, "aircraft_hours": null, "circumstances": "The airplane departed Arica on the return flight at approximately 1327 hours Bolivian time. It was to be an eight-hour, VFR flight, and the aircraft was to cruise at 17,000 feet. Eight minutes after take-off the crew advised ATC at Cochabamba of the departure time, the number of passengers on board, the aircraft's weight and the amount of fuel being carried. Between 1347 and 1348 the air traffic controller at La Paz advised that Panagra flights 701 and 393, flying at 22,000 and 21,000 feet were estimating Charaña at 1355 and Arica at 1351 respectively. Flight 915 acknowledged the message. ATC at La Paz called the flight at approximately 1400 hours, and several times thereafter, to report on the new positions of the two Panagra aircraft, which were in the Arica zone but received no reply. It was determined subsequently that the aircraft crashed into Chachacomani Peak (latitude 17°49'00'', longitude 69°50'00''W) in Peruvian territory near the Chilean border at an altitude of 14,250 feet, sometime between 1351 and 1355. The wreckage was spotted by the crew of a reconnaissance aircraft few hours later and the first rescuers arrived on scene later to confirm that all 39 occupants have been killed. ", "probable_cause": "A flight under visual flight rules was attempted below the minimum altitude indicated in the flight plan in weather conditions that were marginal for this type of operation and were associated with the severe turbulence which usually exists in that region (western area)."}