{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-marco-island-2-killed", "date": "Dec 31, 1995 at 1225 LT", "type": "Cessna 550 Citation II", "operator": "Moran Foods", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Saint Louis - Marco Island", "msn": "550-0101", "yom": 1979, "flight_number": null, "city": "Marco Island", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 13026, "captain_hours_type": 2500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6025, "circumstances": "The flight was cleared for the VOR/DME approach to runway 17 at the Marco Island Airport. The CVR recorded conversation between the pilot and co-pilot reference to the approach, specifically the MDA both in mean sea level and absolute altitude for a straight-in-approach to runway 17. The flight crew announced that the flight was landing on runway 35. The flight crew did not discuss the missed approach procedure nor the circling minimums. The flight continued and the co-pilot announced that the flight was 5 miles from the airport to descend to the MDA to visually acquire the airport. While descending about 8.5 feet of the left wing of the airplane was severed by a guy wire about 587 feet above ground level from an antenna that was 3.36 nautical miles from the threshold of runway 17. The tower is listed on the approach chart that was provided to the flight crew. The airplane then rolled left wing low, recovered to wings level, then was observed to roll to the left, pitch nose down, and impacted the ground. A fireball was then observed by witnesses. The altimeters, air data computer, and pilot's airspeed indicator were last calibrated about 8 months before the accident. The co-pilots altimeter was found set .01 high from the last known altimeter setting provided to the flight crew. The CVR did not record any conversation pertaining to failure or malfunction of either the pilot or copilot's HSI, the DME or Altimeters. There were no alarms from the VOR/DME monitoring equipment the day of the accident. The flight crew of another airplane executed the same approach about 30 minutes before the accident and they reported no discrepancies with the approach. The MDA for the segment of the approach between where the tower is located is no lower than 974 feet above ground level. \n", "probable_cause": "The pilot's disregard for the MDA for a specific segment of the VOR/DME approach which resulted in the inflight collision with a guy wire of an antenna and separation of 8.5 feet of the left wing. "}