{"url": "https://www.baaa-acro.com/crash/crash-fokker-100-sao-paulo-99-killed", "date": "Oct 31, 1996 at 0827 LT", "type": "Fokker 100", "operator": "TAM%20Brasil-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "City", "schedule": "São Paulo – Rio de Janeiro", "msn": "11440", "yom": 1993, "flight_number": "KK402", "city": "São Paulo-Congonhas", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 89, "pax_fatalities": 89, "other_fatalities": 4, "total_fatalities": 99, "captain_hours": 6433, "captain_hours_type": 2392, "copilot_hours": 3000, "copilot_hours_type": 230, "aircraft_hours": 8171, "circumstances": "TAM flight 402 was a regular flight between São Paulo (CGH) and Rio de Janeiro (SDU). At 08:25 the flight received clearance for takeoff from runway 17R. Wind was given as 060 degrees. At 08:26:00 the throttles were advanced for takeoff power. Ten seconds later a double beep was heard. The captain said \"O auto-throttle tá fora\" and the copilot adjusted the throttles manually and informed the captain: \"thrust check\". With this information he confirmed that the takeoff power had been adjusted and verified. At 08:26:19 the airplane accelerated through 80 kts. At 08:26:32 the copilot indicated \"V one\". Two seconds later the airplane rotated at a speed of 131 kts. At 08:26:36 the air/ground switch transited from \"ground\" \"to \"air\". The speed was 136 kts and the airplane was climbing at an angle of 10 degrees. At that same moment a shock was felt and the EPR of engine no. 2 dropped from 1.69 to 1.34, indicating the loss of power. In fact, the no. 2 engine thrust reverser had deployed. An eye witness confirmed to have seen at least two complete cycles of opening and closing of the no. 2 thrust reverser buckets during the flight. The loss of power on the right side caused the plane to roll to the right. The captain applied left rudder and left aileron to counteract the movement of the plane. The copilot advanced both thrust levers, but they retarded again almost immediately, causing the power of the no. 1 engine to drop to 1.328 EPR and engine no. 2 to 1,133 EPR. Both crew members were preoccupied by the movement of the throttles and did not know that the thrust reverser on the no. 2 engine had deployed. The throttles were forced forward again. At 08:26:44 the captain ordered the autothrottle to be disengaged. One second later the no. 2 thrust lever retarded again and remained at idle for two seconds. The airspeed fell to 126 kts. At 08:26:48 the copilot announced that he had disengaged the autothrottles. He then jammed the no. 2 thrust lever fully forward again. Both engines now reached 1,724 EPR. With the thrust reverser deployed, the airspeed declined at 2 kts per second. At 08:26:55 the stick shaker activated, warning of an impeding stall. The airplane rolled to a 39 degree bank angle and the GPWS activated: \"Don't sink!\". Seven seconds later the airplane impacted a building and crashed into a heavily populated neighborhood.", "probable_cause": "The following findings were reported:\r\na. Contributing Factors\r\nPsychological Aspect - Contributed\r\na) organizational aspect\r\nThe lack of information, instructions in writing and practice, contributed to the non-recognition of the abnormality during its unfolding.\r\nb) Individual aspect\r\nThe unusual occurrence of the quick reduction of the lever, on a particularly difficult phase of the operation (transition from take-off run to flight); the nonoccurrence of failure discriminating (sound and visual) warnings, and the lack of cognizance and specific training for such abnormality bring on surprise and distraction of the crew members' attention.\r\n- The release of the restriction of the lever of engine 2 at the idle detent without the occurrence of the abnormality warnings strengthened the tendency (in at least one of the crew members) to try to recover the power on the engine.\r\n- The lack of warnings and the difficulties that are characteristic of such abnormality have diverted the crew members' concentration from the procedures provided for, to concentrate it on the solution of the abnormality, initially imagined as being an auto-throttle failure, and later the recovery of thrust\r\n- The occurrence of auto-throttle failure warnings (before the 80 Kt) and the lack of specific reverse opening warnings (Master Caution and RSVS UNLK) have strengthened, in the crew members, the belief that they were experiencing an autothrottle failure (illusion).\r\nb. Material Factor\r\n(1). Desing Deficiency - Contributed\r\nThe reverser fault tree chart made recently by the manufacturer considering the Post-Mod version, even not taking into account a dormant fail, has indicated that the probability of an inadvertent opening of the reversers is of the order of 10\"6. The Post-Mod version does not meet the airworthiness requirements of FAR/RBHA 25.1309.\r\nOn two phases of the complete reversers cycle, at the beginning of the opening and at the end of the shell closing, it is possible to apply power higher than IDLE with the shells partially open, which does not meet RBHA/FAR 25.933.\r\nThe reverser unlocked indication system is inhibited at speeds higher than 80 Kt and up to the height of 1000 feet, exactly at an instant when the pilots would need such information most.\r\nThe SECONDARY LOCK ACTUATORS (S/N 874 and S/N 870) that equipped the aircraft that suffered the accident, on the operational tests proposed and carried out, presented a performance much below the minimum acceptable to assure the safety and reliability of the system.\r\nThe applicable FAR 25.993(a)(3) requirements determine that each [reverse] system is to be provided with means to prevent the engine from producing power higher than idle power upon a failure on the reverse system [not stipulating the type of failure]. Such requirement has not been complied with, both in relation to the control system, which permitted the shells to open in flight, and in relation to protection, which became non-existent when the separation of the FEEDBACK CABLE occurred due to the unpredicted pilot's action on the lever, with the intention of recovering the power of the affected engine.\r\nThe TURNBUCKLE is installed on the side to which the connection moves when the reverser is commanded to open, i.e., the same side towards which the connection moves when the situation occurs in which the lever is forcibly held forward while the reverser is opening (deploying).\r\nThe THRUST SELECTOR VALVE may be moved with less than 2% of the normal functioning pressure, when the selector valve is de-energized, which was the condition at the time of the accident.\r\nThe inductive loads as those of SEC. LCK. ACTUATOR are detrimental to the contacts that command them, particularly on de-energization, in case there is no protection diode, which is apparently the case of SEC. LCK. ACTUATOR.\r\nThe THRUST REVERSER ACTUATOR, in the Post-Mod configuration, incorporated to the assembly line by the manufacturer, remains de-energized during the periods in which there is no commanding by the pilot, and this way it stays in an unstable and dangerous situation.\r\nDesign faults, an insufficient assessment of the fault tree diagram as compared to FAR 25.1309 and 25.933, and in the guidance to the operator not to train the abnormality that occurred on that phase, have indirectly contributed to the sequence of events that led to place the crew facing an unprecedented situation, without possibilities of recognizing and responding properly to avoid the loss of control.\r\nc. Operational Factor\r\n(1). Little experience on the aircraft - Indeterminate\r\nLimitation of information and aids to the pilot. He had 230:00 total flight hours on this aircraft model, however the condition under which the unusual abnormality presented itself renders indeterminate the degree of experience that may be expected from a crew member to face such condition.\r\n(2). Deficient Application of Control - Indeterminate\r\nFor three times, the thrust lever of engine 2 has been reduced and advanced. Such interventions on that lever have brought on the reduction of the thrust lever of the left hand engine, impairing the aircraft's performance. The non-return of the left hand lever to take-off thrust immediately, and the another four seconds delay in attaining such thrust, have contributed to deteriorate even more the aircraft's climbing capability.\r\nThe condition under which the unusual abnormality presented itself to the crew, and the lack of warning signals, has rendered the intentionality of the action indeterminate, and furthermore it was not possible to determine which of the two crew members has actuated the levers.\r\n(3). Deficient Judgement - Indeterminate\r\nThe lack of cognizance, on the part of the crew members, for insufficiency of warning signals and information about the abnormality, has been a determinant for them to abandon the normal sequence of procedures, such as retracting the landing gear and actuating the Auto-Pilot, in order to take the initiatives of prioritizing the solution of an unusual situation installed in the cockpit, below safety height and that eventually brought on the loss of control of the aircraft, whereby it has also not been possible to determine which one of them took the initiative. Such facts render such aspect indeterminate.\r\nd. Other Aspects\r\n(1). External Inspection - Contributor\r\nThere is no condition of seeing the 'Secondary Lock' open, during the external inspection.\r\n(2). Performing Action Below 400 feet - Contributor\r\nDoctrinally, any action by a crew facing any abnormality in the cockpit environment below 400 feet is NOT RECOMMENDABLE.\r\nThe crew tried to manage the 'abnormality' concurrently with the control of the aircraft below 400 feet. Under such risk condition, a power reduction occurred on the other engine, compromising the aircraft's performance. As a consequence, the crew was obligated to prioritize the thrust needs to the detriment of other procedures.\r\n(3). Inadequate Action In Face of an Unpredicted Failure - Contributor.\r\nBased on the data collected on the SSFDR about the FUEL FLOW and EPR parameters, the lever of engine no. 2 was brought to the maximum power position, after the locking of said lever at the IDLE position.\r\nSuch locking occurred immediately after the lift-off, when the lever was reduced by itself to the 'IDLE' position, staying locked for about three (3) seconds. However, the system itself released the lever, inducing the copilot to bring it to the full power position, even after having informed the pilot about its locking.\r\nIt should be pointed out that the pilot has not requested such action after having been informed about the locking, as well as that the copilot has not asked whether such action should be done or not.\r\nThe airplane has not provided means for both pilots to be able to imagine how untimely such attitude would become at that extremely critical moment of the flight. In case the action has not been performed by the copilot, the suspicion falls upon the pilot, induced by the same reasons presented before."}