{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-63af-naha-4-killed", "date": "Jul 27, 1970 at 1136 LT", "type": "Douglas DC-8", "operator": "Flying%20Tiger%20Line", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Los Angeles – San Francisco – Seattle – Cold Bay – Naha – Cam Ranh Bay – Đà Nẵng", "msn": "45005/412", "yom": 1968, "flight_number": "FT045", "city": "Naha", "zone": "Okinawa", "country": "Japan", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 12488, "captain_hours_type": 1381, "copilot_hours": 12206, "copilot_hours_type": 1157, "aircraft_hours": 6047, "circumstances": "The airplane departed Los Angeles for a flight to Da Nang AFB, Vietnam with intermediate stops at San Francisco, CA, Seattle, WA, Cold Bay, AK, Tokyo, Okinawa and Cam Ranh Bay. Flight 45 departed Tokyo 09:29 for the IFR flight to Okinawa. The flight proceeded without difficulty to Okinawa, and was cleared for an en route descent to an altitude of 1,000 feet msl to make a precision radar approach to runway 18 at Naha AFB. At 11:31 the flight was advised \"... have reduced visibility on final ... tower just advised approach lights and strobe lights are on ....\". At 11:32:46, a new altimeter setting of 25.84 inches was given to the crew and acknowledged. The landing checklist, including full flaps. setting of radio altimeters, gear down and locked, and spoilers armed, was completed at 11:33:49. At slightly less than 5 miles from touchdown, the crew was instructed to begin the descent onto glidepath and was cleared to land. The approach continued, with various heading changes and, at 11:34:53, the crew was advised that they were slightly below the glidepath 3 miles from touchdown. Additional vectors were provided and at 11:35:14, 2 miles from touchdown, the crew was again advised \"...dropping slightly below glidepath ... you have a 10 knot tailwind.\" At 11:35:34, the controller advised the crew that they were on glidepath. The DC-8 continued to descend and broke out of heavy rain and low clouds at an estimated altitude of 75 to 100 feet. The aircraft struck the water approximately 2,200 feet short of the runway at a speed of 144 kts.", "probable_cause": "An unarrested rate of descent due to inattention of the crew to instrument altitude references while the pilot was attempting to establish outside visual contact in meteorological conditions which precluded such contact during that segment of a precision radar approach inbound from the Decision Height."}