{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200t-super-king-air-west-palm-beach", "date": "Jan 27, 2017 at 1750 LT", "type": "Beechcraft 200 Super King Air", "operator": "Eastern Air Express", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Treasure Cay - West Palm Beach", "msn": "BT-7", "yom": 1979, "flight_number": null, "city": "West Palm Beach", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14414, "captain_hours_type": 631, "copilot_hours": 1560, "copilot_hours_type": null, "aircraft_hours": 15782, "circumstances": "The airline transport pilot reported that, before landing following an uneventful flight, he extended the wing flaps to the approach position and extended the landing gear; the gear indicator lights showed \"3 green.\" After touchdown, he heard noises, and the airplane started to sink. After the airplane came to a stop on the right side of the runway, he noticed that the landing gear handle was up. The pilot stated to the copilot, \"How did the gear handle get up?\" then placed the handle to the down position and the flight crew exited the airplane. The copilot reported that he was acting as an observer during the flight and that he also saw three green landing gear down-and-locked indicator lights before landing. The airframe sustained substantial damage from contact with the runway. All three landing gear were found in a partially-extended position. Skid marks from all three tires were observed on the runway leading up to the main wreckage. Both propeller assemblies were damaged due to contact with the runway. The pressure vessel was compromised from contact with a propeller blade. The nose landing gear actuator was forced up, into the nose gear well and penetrated the upper nose skin. Examination of the landing gear components did not reveal evidence of a preexisting mechanical malfunction or malfunction. The skid marks leading to the wreckage and the partially-extended gear were inconsistent with the pilot's account that the gear handle was up after the airplane came to rest and was then lowered. The gear handle consisted of an electrical switch that required it to be pulled out of a detent before placing it up or down. There was no mechanical linkage between the gear handle and the landing gear, as the gear were driven by an electric motor. It is likely that the pilot realized that the gear were not extended just before touchdown and then tried to lower the gear, resulting in a touchdown with the gear only partially extended. The pilot reported that he had experienced several interruptions to his sleep the night before the accident. He also reported that he flew 7 legs on the day of the accident for a total of 5.2 hours, only eating a banana for breakfast during this time period. It is likely that the pilot's fatigue contributed to his failure to ensure that the landing gear were down and locked before landing. ", "probable_cause": "The pilot's failure to ensure that the landing gear were down and locked before touchdown. Contributing to the accident was the pilot's self-reported fatigue at the time of the accident. "}