{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-204c-buenos-aires-65-killed", "date": "Aug 31, 1999 at 2054 LT", "type": "Boeing 737-200", "operator": "Lineas%20Aereas%20Privadas%20Argentinas.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Buenos Aires – Córdoba", "msn": "20389", "yom": 1970, "flight_number": "MJ3142", "city": "Buenos Aires-Aeroparque-Jorge Newbery", "zone": "Buenos Aires City", "country": "Argentina", "region": "South America", "crew_on_board": 5, "crew_fatalities": 3, "pax_on_board": 95, "pax_fatalities": 60, "other_fatalities": 2, "total_fatalities": 65, "captain_hours": 6500, "captain_hours_type": 1710, "copilot_hours": 4085, "copilot_hours_type": 560, "aircraft_hours": 67864, "circumstances": "LAPA flight 3142 was scheduled to depart from Buenos Aires-Jorge Newbery Airport at 20:36 for a 1 hour and 15 minute flight to Córdoba, Argentina. The first officer and cabin crew were the first to arrive at the Boeing 737-200. The first officer notified one of the mechanics that the total fuel requirement was 8,500 kg, all to be stored in the wing tanks. The mechanic noticed there was still some fuel in the central tank and commenced transferring the fuel from the central to the wing tanks. At that moment the captain boarded the flight. He threw his paperwork on the ground, showing annoyance, confirming that attitude by later shutting off the fuel transfer between the main tank and the wing tanks. During their first four minutes on board, the captain, the co-pilot and the purser talked about trivial matters in good spirits, focusing on the purser's personal issues. When the purser left the cockpit, the conversation changed tone as they discussed a controversial situation about the family problems of the captain. The captain said that he was \"going through bad times\", to which the copilot replied that he was also having a bad day. Without interrupting the conversation, the crew began working the checklists, mixed with the personal issues that worried them and that led them to misread the checklist. In the process they omitted to select the flaps to the appropriate takeoff position. This confusing situation, in which the checklist procedure was mixed with conversation irrelevant to the crew's task, persisted during push back, engine start and taxiing, up to the moment of take-off, which was delayed by other aircraft waiting ahead of the LAPA flight and heavy arriving traffic. During this final wait, the crew members were smoking in the cockpit and continued their conversation. Take-off was started on runway 13 at 20:53 hours. During the takeoff roll the Take-off warning system sounded because the flaps had not been selected. The crew ignored the warning and continued the takeoff. After passing Vr, the pilot attempted to rotate the aircraft. The stick shaker activated as the aircraft entered a stall. It successively impacted the ILS antenna, the perimeter fence, a waiting shelter for buses, two automobiles, two excavators and an embankment where it stopped. Immediately a fire erupted. Three flight crew members, 60 passengers and two persons inside an automobile were killed.", "probable_cause": "The JIAAC considers as an immediate cause of the accident that the flight crew of the LAPA 3142 forgot to extend the flaps for takeoff and dismissed the alarm sound that warned about the lack of configuration for that maneuver.\r\nThe contributing factors were:\r\n- Lack of discipline of the crew that did not execute the logical reaction of aborting the takeoff and verification of the failure when the alarm began to sound when adding engine power and continued sounding until the rotation attempt.\r\n- Excess of conversations foreign to the flight and for moments of important emotional intensity between the pilots, that were mixed with the execution of the check lists, arriving at omitting the part of these last ones where the extension of flaps for takeoff had to be completed.\r\n- Personal and/or family and/or economic and/or other problems of both pilots, which affected their operational behavior.\r\n- Insufficiency of the psychic control system, which did not allow to detect when the pilots were suffering personal and/or family problems and/or of another type that influenced their operational capacity when diminishing their psychic stability.\r\n- Knowledge and treatment of very personal and extra-occupational issues among the pilots and even with the onboard commissioner, who facilitated the atmosphere of scarce seriousness and concentration in the operational tasks.\r\n- Background of negative flight characteristics of the commander that surfaced before his personal situation and relationship in the cockpit before and during the emergency.\r\n- Background of flight characteristics of the co-pilot, which manifested themselves during compliance with the procedural checklists in a cockpit where its components participated with a completely dispersed attention to particular interests outside the flight.\r\n- No immediate recognition or verification of both pilots, of the relationship between the type of intermittent audible alarm that indicated failure in the configuration for takeoff, with the absence of flaps in the position for this maneuver.\r\n- Design of the take-off configuration alarm system that does not allow, in this type of aircraft, a simple check by the crews to ensure periodic listening to this type of intermittent alarm."}