{"url": "https://www.baaa-acro.com/crash/crash-bae-4101-jetstream-41-columbus-5-killed", "date": "Jan 7, 1994 at 2321 LT", "type": "Bae Jetstream 41", "operator": "United-Express-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "City", "schedule": "Washington DC - Columbus", "msn": "41016", "yom": 1993, "flight_number": "UA6291", "city": "Columbus-John Glenn (Port Columbus)", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 5, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 3660, "captain_hours_type": 192, "copilot_hours": 2430, "copilot_hours_type": 31, "aircraft_hours": 1069, "circumstances": "The airplane stalled and crashed 1.2 nautical miles east of runway 28L during an ILS approach. The captain initiated the approach at high speed & crossed the FAF at a high speed without first having the airplane properly configured for a stabilized approach. The airspeed was not monitored nor maintained by the flightcrew. The airline had no specified callouts for airspeed deviations during instrument approaches. The captain failed to apply full power & configure the airplane in a timely manner. Both pilots had low flight time and experience in in the airplane and in any EFIS-equipped airplane. Additionally, the captain had low time and experience as a captain. Inadequate consideration was given to the possible consequences of pairing a newly upgraded captain, on a new airplane, with a first officer who had no airline experience in air carrier operations, nor do current FAA regulations address this issue.", "probable_cause": "The accident was the consequence of the following factors:\r\n(1) An aerodynamic stall that occurred when the flightcrew allowed the airspeed to decay to stall speed following a very poorly planned and executed approach characterized by an absence\r\nof procedural discipline; \r\n(2) Improper pilot response to the stall warning, including failure to advance the power levers to maximum, and inappropriately raising the flaps; \r\n(3) Flightcrew inexperience in 'glass cockpit' automatic aircraft, aircraft type, and in seat position, a situation exacerbated by a side letter of agreement between the company and its pilots; \r\n(4) The company's failure to provide adequate crew resource management training, and the FAA's failure to require such training; \r\n(5) The company's failure to provide adequate stabilized approach criteria, and the FAA's failure to require such criteria; and \r\n(6) The unavailability of suitable training simulators that precluded fully effective flightcrew training. \r\nNote: Items 1, 2, and 3 were approved by a Board vote of 4-0. Item 5 was adopted 3-1, with the dissenting Member believing the item was a contributory cause. The Board was divided 2-2 on items 4 and 6, two Members believing them causal and two Members, contributory."}