{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-vista-liner-300-grand-canyon-10-killed", "date": "Sep 27, 1989 at 0953 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Grand%20Canyon%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Grand Canyon - Grand Canyon", "msn": "439", "yom": 1974, "flight_number": "YR05", "city": "Grand Canyon", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 19, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 4120, "captain_hours_type": 2610, "copilot_hours": 1309, "copilot_hours_type": 339, "aircraft_hours": 11180, "circumstances": "Grand Canyon Airlines flight 5 (De Havilland DHC-6, N75GC) departed Grand Canyon National Park Airport on a local part 135, sightseeing flight. After returning from a normal trip, the flight was cleared to land on runway 21. Observers reported the approach to the airport was normal, but the aircraft traveled about 1,000 feet down the runway at an altitude of about 5 feet before touchdown. Reportedly, it bounced and traveled another 1,000 feet before touching down again. The aircraft then veered to the right and the flight crew initiated a go around (aborted landing). The aircraft climbed in a nose high altitude to about 150 feet to 200 feet agl, then it rolled to the left and crashed onto a wooded hill about 120 feet left of the runway. A power line was severed during impact, which interrupted electrical power to the airport and delayed emergency response to the crash. Surviving passengers reported the right seat pilot was flying the aircraft, while the left seat pilot narrated the tour; but after a hard touchdown, the left seat pilot took control of the aircraft and applied full power for a go-around. A scrape mark was found where the right wingtip scraped the runway during the 2nd touchdown. Both pilots and eight passengers were killed while 11 other passengers were injured, nine of them seriously. ", "probable_cause": "Improper pilot techniques and crew coordination during the landing attempt, bounce, and attempted go-around."}