{"url": "https://www.baaa-acro.com/crash/ground-accident-pilatus-pc-1247e-savannah", "date": "Jan 6, 2016 at 0835 LT", "type": "Pilatus PC-12", "operator": "PlaneSense", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Savannah - Lexington", "msn": "1078", "yom": 2008, "flight_number": "Cobalt Air 727", "city": "Savannah", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 23141, "captain_hours_type": 534, "copilot_hours": 7900, "copilot_hours_type": 5100, "aircraft_hours": 4209, "circumstances": "The aircraft collided with a ditch during a precautionary landing after takeoff from Savannah/Hilton Head International Airport (SAV), Savannah, Georgia. The pilot and copilot sustained minor injuries, and the airplane was substantially damaged. The airplane was registered to Upper Deck Holdings, Inc. and was being operated by PlaneSense, Inc,. as a Title 14 Code of Federal Regulations Part 91 positioning flight. Visual meteorological conditions prevailed, and an instrument flight rules flight plan was filed for the flight to Blue Grass Airport (LEX), Lexington, Kentucky. The pilot in the left seat was the pilot monitoring and the copilot in the right seat was the pilot flying. The crew had the full length of the runway 1 available (7,002 ft) for takeoff. The pilots reported that the acceleration and takeoff was normal and after establishing a positive rate of climb, the crew received an auditory annunciation and a red crew alerting system (CAS) torque warning. The engine torque indicated 5.3 pounds per square inch (psi); the nominal torque value for the conditions that day was reported by the crew to be 43.3 psi. With about 2,700 ft of runway remaining while at an altitude of 200 ft msl, the copilot elected to land immediately; the copilot pushed the nose down and executed a 90° left descending turn and subsequently landed in the grass. Although he applied \"hard\" braking in an attempt to stop, the airplane impacted a drainage ditch, resulting in substantial impact damage and a postimpact fire. The pilot reported that, after takeoff, he observed a low torque CAS message and the copilot told him to \"declare an emergency and run the checklist.\" The pilot confirmed that the landing gear were extended and the copilot turned the airplane to the left toward open ground between the runways and the terminal. About 60 seconds elapsed from the start of the takeoff roll until the accident. The airport was equipped with security cameras that captured the airplane from its initial climb through the landing and collision. One camera, pointed toward the west-southwest, recorded the airplane's left descending turn and its landing in the grass, followed by impact and smoke. A second camera, mounted on the control tower, pointed toward the southeast and showed the airplane during the initial climb before it leveled off and entered a descending left turn; it also showed the airplane land and roll through the grass before colliding with the ditch.", "probable_cause": "The pilots' failure to follow proper procedures in response to a crew alerting system warning for high engine torque values, which necessitated an off-runway emergency landing during which the airplane sustained substantial damage due to postimpact fire. Contributing to the accident was the erroneous engine torque indication for reasons that could not be determined."}