{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-52h-155-bw-stratofortress-guam-island-6-killed", "date": "Jul 21, 2008 at 0945 LT", "type": "Boeing B-52 Stratofortress", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Demonstration", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Andersen AFB - Andersen AFB", "msn": "464418", "yom": 1960, "flight_number": "Raider 21", "city": "Guam Island", "zone": "All Guam Island", "country": "Guam Island", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Andersen AFB on a flight around the Guam Island under call sign 'Raider 21' with 6 crew members on board, taking part to the Guam Liberation Day celebrations. About 15 minutes into the flight, while descending from 14,000 to 1,000 feet, the aircraft became uncontrollable and crashed in the sea about 50 km north of Guam Island. The aircraft disintegrated on impact and only few debris were found. All six crew members were killed. \r\nCrew:\r\nMaj Chris Cooper, pilot,\r\nCpt Michael Dodson, copilot,\r\n1st Lt Robert Gerren, electronic warfare officer, \r\n1st Lt Joshua Shepherd, navigator, \r\nMaj Brent Williams, radar navigator, \r\nCol George Martin, flight surgeon. ", "probable_cause": "Malfunctioning parts and late recognition of spiraling problems likely led to the fatal crash of a B-52H Stratofortress in July, an Air Force accident investigation board concluded in a report issued Feb. 13. The problem parts, investigators decided, were the bomber’s rear stabilizers — the large horizontal fins at the jet’s tail that help angle the B-52H up or down. Although the inquiry could not determine what led to the stabilizer problem, the board said it believed the stabilizers malfunctioned while the bomber was in a fast descent from 14,000 feet to 1,000 feet. “Even an experienced aircrew could have found it difficult to recognize, assess and recover from the very rapidly developing situation involving the rear stabilizer trim,” board president Brig. Gen. Mark Barrett concluded. The bomber did not carry a flight data recorder, so the investigation team pieced together events leading up to the crash from air traffic control radar information and from parts recovered from the ocean floor by remote-controlled Navy submarines. One recovered part was a component called a jackscrew that helps control the stabilizers. The jackscrew revealed the stabilizer trim was set at 4.5 to 5 degrees nose down, but parts that could have helped determine why the stabilizers were pointed down were not recovered. Based on flight simulations, the investigative team determined the flight was normal until the jet turned left and began to descend about 33 miles west of Guam. As the 48-year-old bomber dove toward the Pacific at a speed of more than 240 mph, the stabilizers suddenly unhinged, putting the jet into a dive with the nose pointed down 30 degrees and more. One of the pilots likely tried to level the stabilizers manually using a control wheel in the cockpit that moves the stabilizer 1 degree every two to three seconds, the report said. However, because the plane was already low, there wasn’t enough time to level the stabilizers. At least three crew members tried to bail out seconds before the plane hit the water, but the plane’s speed, altitude and angle already were past the point where they could survive the ejection."}