{"url": "https://www.baaa-acro.com/crash/ground-fire-short-360-100-houston", "date": "May 17, 2012 at 0715 LT", "type": "Short 360", "operator": "Air-Cargo-Carriers-2", "flight_phase": "Taxiing", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Houston – Austin", "msn": "3617", "yom": 1983, "flight_number": null, "city": "Houston-George Bush-Intercontinental", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5348, "captain_hours_type": 2305, "copilot_hours": 832, "copilot_hours_type": 171, "aircraft_hours": 27504, "circumstances": "The pilots reported that the cargo airplane was about 60 pounds over its maximum takeoff weight. Because their taxi to the assigned runway was long, they decided to reduce weight by using higher-than-normal engine power settings to burn fuel before takeoff while using the wheel brakes to control the airplane’s speed while taxiing. During the taxi, a fire ignited in the right wheel housing. The pilots brought the airplane to a stop on the taxiway, evacuated, and attempted to extinguish the fire with two handheld fire extinguishers. Airport firefighting personnel arrived on scene and extinguished the fire using foam suppressant. Although the fire damage was extensive, postaccident examination of the airplane did not show evidence of mechanical malfunctions or failures with the wheel and brake system that could have caused the fire. The right and left main landing gear tires deflated when the fusible plugs in the wheels blew due to overheating. The fusible plugs are designed to “fail” if the wheels overheat, and those plugs functioned as designed. The pilots stated that they had been trained to not ride the brakes while taxiing. However, the captain stated that he did not realize that he was in danger of blowing the tires much less causing a fire, otherwise he would not have attempted to bum off excess fuel while taxiing. ", "probable_cause": "The pilots’ improper decision to burn fuel during the taxi by operating the engines at a higher-than-normal power setting and using the wheel brakes to control taxi speed, which resulted in a wheel fire."}