{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-la-verne-1-killed", "date": "Dec 7, 1995 at 0624 LT", "type": "Cessna 340", "operator": "Hugh J. Gallagher", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Big Bear Lake - La Verne", "msn": "340A-0348", "yom": 1977, "flight_number": null, "city": "La Verne-Brackett Field", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5282, "captain_hours_type": 653, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot departed his home base in VFR conditions without filing a flight plan and did not request or receive a preflight or en route weather briefing from the FAA. While en route, he contacted Southern California TRACON (SOCAL) and requested an ILS runway 26 approach to the destination airport. SOCAL cleared the pilot for the approach and to change to an advisory frequency. There was no current weather report available at the airport because the tower was closed, but another pilot who was on the same frequency stated that the airport weather was 'zero zero.' (An automated weather observation system at the airport recorded 'zero zero' conditions near the time of the accident.) Ground witnesses heard the airplane as the pilot began a missed approach. However, the airplane collided with trees and a snack bar building about 1/4 mile northwest of the departure end of the runway. Impact occurred as the airplane was in a right turn through a heading of 345 degrees, which was the opposite direction of turn for the missed approach procedure. Toxicology test of the pilot's blood showed 1.518 mcg/ml Fenfluramine and 0.678 mcg/ml Phentermine; these are appetite suppressant drugs that are chemically related to amphetamines and have a high incidence of abuse. Neither of these drugs was approved by the FAA for use while flying aircraft. The amount of Fenfluramine in the pilot's blood was above a normal level for control of appetite. ", "probable_cause": "The pilot's impairment of judgment and performance due to drugs, his resultant improper planning/decision, his failure to follow proper IFR procedures, and his failure to maintain proper altitude during a missed approach. Factors relating to the accident were: the pilot's inadequate weather evaluation, and the adverse weather condition (below landing minimums). "}