{"url": "https://www.baaa-acro.com/crash/crash-bristol-175-britannia-308f-manston", "date": "Apr 20, 1967", "type": "Bristol Britannia", "operator": "British%20Eagle", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "London - Kuwait City", "msn": "12923", "yom": 1959, "flight_number": null, "city": "Manston", "zone": "Kent", "country": "United Kingdom", "region": "Europe", "crew_on_board": 11, "crew_fatalities": 0, "pax_on_board": 54, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7254, "captain_hours_type": 1874, "copilot_hours": 7000, "copilot_hours_type": 3840, "aircraft_hours": 10682, "circumstances": "Shortly after takeoff from London-Heathrow Airport, while climbing, the undercarriage wouldn't lock up after takeoff, so the crew recycled the gear a couple of times. On the third attempt, the bogie (which was not rotating in the right sequence) fouled the main hydraulic jack fracturing the attachment bolt of the shuttle valve for the main and emergency 'down' hydraulic lines. All hydraulic fluid escaped and the gear couldn't be extended anymore. In agreement with ATC, the captain decided to divert to Manston-Kent Airport where an emergency landing was carried out on a foamed runway. The airplane completed a belly landing and was damaged beyond repair while all 65 occupants escaped uninjured. ", "probable_cause": "The undercarriage failed to lock down due to loss of the hydraulic fluid from the main and emergency systems. This resulted from fracture of the hydraulic lines consequent upon fouling of the port undercarriage retraction jack head by the bogie through incorrect setting up of the retraction sequence valve. The following findings were reported:\r\n- The port main undercarriage retraction sequence valve, which was replaced before the flight, was not correctly set up,\r\n- The undercarriage retraction test to check the operation of the sequence valve was carried out in such a way that the incorrect sequence of retraction resulting from the finding indicated in the previous paragraph was not detected, \r\n- When the undercarriage was retracted after takeoff, the port bogie beam fouled the port main undercarriage retraction jack head,\r\n- 'Recycling' the undercarriage resulted in the detachment of the main and emergency 'down' lines, and the loss of all hydraulic fluid and other fluids with which the system was replenished, \r\n- None of the undercarriage units could be locked down and all collapsed during the landing. "}