{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-steamboat-springs-1-killed", "date": "May 5, 2001 at 0858 LT", "type": "Cessna 208B Grand Caravan", "operator": "FedEx", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Casper – Steamboat Springs", "msn": "208B-0052", "yom": 1987, "flight_number": "FDX8810", "city": "Steamboat Springs-Bob Adams", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2916, "captain_hours_type": 43, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8690, "circumstances": "The pilot obtained a weather briefing, filed an IFR flight plan, and departed on a nonscheduled domestic cargo flight, carrying 270 pounds of freight. The flight proceeded uneventfully until it was established on the VOR/DME-C approach. Radar data indicates that after turning inbound towards the VORTAC from the DME arc, the airplane began its descent from 10,600 feet to the VOR crossing altitude of 9,200 feet. Enlargement of the radar track showed the airplane correcting slightly to the left as it proceeded inbound to the VORTAC at 9,400 feet. Shortly thereafter, aircraft track and altitude deviated 0.75 miles northwest and 9,700 feet, 0.5 miles southeast and 9,600 feet, and 0.5 miles northwest and 9,400 feet before disappearing from radar. Witnesses said the weather at the time of the accident was 600 foot overcast, 1.5 miles visibility in \"misting\" rain that became \"almost slushy on the ground,\" and a temperature of 36 degrees Fahrenheit. One weather study indicated \"an icing potential greater than 50% and visible moisture\" in the accident area. Another report said \"icing conditions were likely present in the area of the accident.\" The airplane was equipped and certified for flight into known icing conditions. The wreckage was found in a closely area. There was no evidence of pre-impact airframe, engine, or propeller malfunction/failure. The pilot was properly certificated, but his flight time in aircraft make/model was only 38 hours. He had previously recorded 16 icing encounters, totaling 11.2 hours in actual meteorological conditions. He recorded no ice encounters and only 1.0 hour of simulated (hooded) instrument time in the Cessna 208. Microscopic examination of annunciator light bulbs revealed the GENERATOR OFF light was illuminated. This condition indicates a generator disconnection due to a line surge, tripped circuit breaker, or inadvertent switch operation. The operator's chief pilot agreed, noting that one of the items on the Before Landing Checklist requires the IGNITION SWITCH be placed in the ON position. The START SWITCH is located next to the IGNITION SWITCH. Inadvertently moving the START SWITCH to the ON position would cause the generator to disconnect and the GENERATOR OFF annunciator light to illuminate. He said this would be distracting to the pilot.", "probable_cause": "An inadvertent stall during an instrument approach, which resulted in a loss of control. Contributing factors were the pilot's attention being diverted by an abnormal indication, conditions conducive to airframe icing, and the pilot's lack of total experience in the type of operation (icing conditions) in aircraft make/model."}