{"url": "https://www.baaa-acro.com/crash/crash-iai-1124-westwind-alice-springs-3-killed", "date": "Apr 27, 1995 at 1957 LT", "type": "IAI 1124 Westwind", "operator": "Pel-Air2", "flight_phase": "Landing (descent or approach)", "flight_type": "Postal (mail)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Darwin – Katherine – Alice Springs – Adélaïde – Sydney", "msn": "221", "yom": 1978, "flight_number": null, "city": "Alice Springs", "zone": "Northern Territory", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 10108, "captain_hours_type": 2530, "copilot_hours": 3747, "copilot_hours_type": 85, "aircraft_hours": 11508, "circumstances": "The aircraft was on a scheduled freight service from Darwin via Tindal, Alice Springs, and Adelaide to Sydney under the IFR. The flight from Darwin to Tindal was apparently normal, and the aircraft departed Tindal slightly ahead of schedule at 1834 CST. The pilot in command occupied the left cockpit seat. At 1925, the aircraft reported at position DOLPI (200 miles north of Alice Springs) Flight Level 330, to Melbourne Control. Another Westwind aircraft was en route Darwin–Alice Springs and was more than 40 miles ahead of VH-AJS. Information from the aircraft cockpit voice recording confirmed that the pilot in command was flying the aircraft. At about 1929, he began issuing instructions to the co-pilot to program the aircraft navigation system in preparation for a locator/NDB approach to Alice Springs. The pilot in command asked the co-pilot to enter an offset position into the area navigation (RNAV) system for an 11-mile final for runway 12. The co-pilot entered the bearing as 292 degrees Alice Springs. (This was the outbound bearing from Alice Springs NDB to Simpson’s Gap locator indicated on the locator/NDB approach chart.) The pilot in command stated that he had wanted the bearing with respect to the runway, 296 degrees, entered but said that the setting could be left as 292 degrees. He then instructed the co-pilot to set Alice Springs NDB frequency on ADF 1, Simpson’s Gap locator on ADF 2, and to preset the Temple Bar locator frequency on ADF 2 so that it could be selected as soon as the aircraft passed overhead Simpson’s Gap. He indicated his intention to descend to 4,300 feet until overhead Simpson’s Gap, and said that the co-pilot should then set 3,450 feet on the altitude alert selector. On passing Temple Bar, the co-pilot was to set 2,780 feet on the altitude alert selector which the pilot in command said would be used as the minimum for the approach. At 1940, the co-pilot contacted Adelaide Flight Service (FIS) and was given the Alice Springs weather, including the local QNH. At 1945, he advised Adelaide FIS that the aircraft was leaving Flight Level 330 on descent. At about 30 miles from Alice Springs, the pilot in command turned the aircraft right to track for the offset RNAV position 292 degrees/11 miles Alice Springs. The crew set local QNH passing 16,000 feet and then completed the remaining transition altitude checks. These included selecting landing and taxi lights on. At 1949, the co-pilot advised Adelaide FIS that the aircraft was transferring frequency to the Alice Springs MTAF. At 1953, the aircraft passed Simpson’s Gap at about 4,300 feet and the copilot set 3,500 feet in the altitude alert selector. About 15 seconds later, the pilot in command told the co-pilot that, after the aircraft passed overhead the next locator, he was to set the ‘minima’ in the altitude alert selector. At 1954 , the pilot in command called that the aircraft was at 3,500 feet. A few seconds later, the co-pilot indicated that the aircraft was over the Temple Bar locator and that they could descend to 2,300 feet. The pilot in command repeated the 2,300 feet called by the co-pilot and asked him to select the landing gear down. The crew then completed the pre-landing checks. Eleven seconds later, the co-pilot reported that the aircraft was 300 feet above the minimum descent altitude. This was confirmed by the pilot in command. About 10 seconds later, there were two calls by the co-pilot to pull up. Immediately after the second call, the aircraft struck the top of the Ilparpa Range (approximately 9 kilometres north-west of Alice Springs Airport), while heading about 105 degrees at an altitude of about 2,250 feet in a very shallow climb. At approximately 1950, witnesses in a housing estate on the north-western side of the Ilparpa Range observed aircraft lights approaching from the north-west. They described the lights as appearing significantly lower than those of other aircraft they had observed approaching Alice Springs from the same direction. The lights illuminated buildings as the aircraft passed overhead and then they illuminated the northern escarpment of the range. This was followed almost immediately by fire/explosion at the top of the range.", "probable_cause": "The following factors were considered significant in the accident sequence:\r\n1. There were difficulties in the cockpit relationship between the pilot in command and the co-pilot.\r\n2. The level of crew resource management demonstrated by both crew members during the flight was low.\r\n3. The Alice Springs locator/NDB approach was unique.\r\n4. The briefing for the approach conducted by the pilot in command was not adequate.\r\n5. When asked for the ‘minima’ by the pilot in command, the co-pilot called, and the pilot in command accepted, an incorrect minimum altitude for the aircraft category and for the segment of the approach.\r\n6. The technique employed by the pilot in command in flying the approach involved a high cockpit workload.\r\n7. The crew did not use the radio altimeter during the approach."}