{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh60g-moth-canons-ashby", "date": "Aug 12, 2013 at 1130 LT", "type": "De Havilland DH.60 Moth", "operator": "Prive1", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Turweston - Turweston", "msn": "1253", "yom": 1930, "flight_number": null, "city": "Canons Ashby", "zone": "Northamptonshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 512, "captain_hours_type": 15, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was carrying out a local flight with a friend. The weather was good (CAVOK), with a westerly wind of about 12 to 15 kt. The passenger occupied the front cockpit and the pilot the rear. The engine started normally and the aircraft departed, climbing to an altitude of 1,200 ft. The pilot carried out two medium banked turns and a gentle wingover manoeuvre before entering another steep turn to the left. When established in the turn, the engine stopped and the aircraft entered a spin to the left. The pilot recovered from the spin but, due to the limited height available, could only pull out of the dive and carry out a forced landing in an isolated grass area, amongst trees and other obstacles. In doing so, the aircraft struck a ridge and furrow, which destroyed the landing gear and much of the forward fuselage. A member of the public witnessed the accident and called the emergency services, who recovered both occupants from the wreckage. The pilot and his passenger had suffered serious injuries and were transferred to hospital. There was no fire.The aircraft had recently been re-weighed. During that process, the fuel tank had been drained and the same fuel was then used to refill the tank. After that, the aircraft had flown some five hours, during which it had been refuelled twice at a licensed aerodrome. The second refuel had taken place prior to positioning the aircraft back to the private site from which the accident flight departed. It was reported that the engine had been consistently reliable. No reason for the engine failure was identified. The pilot considered that he had avoided a serious head injury because he was wearing a protective helmet. Also, he commented that he had since had discussions with others in the historic aircraft community regarding energy absorbing foam in seat pans and its potential for reducing the level of back injuries in the event of an accident.", "probable_cause": "Engine failure for undetermined reason. "}