{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-marine-city-10-killed", "date": "Jul 31, 1999 at 0825 LT", "type": "Beechcraft 90 King Air", "operator": "Parahawks%20Skydiving%20Center", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Marine City - Marine City", "msn": "LJ-251", "yom": 1967, "flight_number": null, "city": "Marine City", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 9700, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8986, "circumstances": "The airplane impacted the terrain approximately 2,065 feet south of the departure end of runway 22. Damage to the cockpit section of the wreckage indicated a nose down crush angle of approximately 80 degrees. The wreckage path was on a 208 degree heading, and the distance from the initial impact to the location of the empennage was about 142 feet. The cockpit and cabin were destroyed by post impact fire. Examination of the engines and propellers revealed no preexisting failures or conditions that would have prevented normal operation. The engines exhibited indications of rotation, and the witness marks on both sets of propellers were consistent with the propellers operating in the governing range at impact. Control continuity was established from the right aileron, elevator, and rudder. Witnesses reported the airplane seem to be operating normally during taxi and takeoff, but that it entered a steep left bank after clearing a 100 foot powerline located about 1,800 feet from the departure end of runway 22. After entering the steep left turn, the nose of the airplane dropped and the airplane impacted the ground. There was no evidence in the airplane's maintenance records of any annual maintenance inspection since August, 1997, although an airframe and powerplant mechanic reported that he had completed an inspection on June 30, 1999. There was no record in the airplane's maintenance records of compliance with five airworthiness directives applicable to the airplane. ", "probable_cause": "The pilot's failure to maintain adequate airspeed, which resulted in a stall, inflight loss of control, and collision with the ground. "}