{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-hawk-junction-2-killed", "date": "Jul 11, 2019 at 0853 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Hawk%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Hawk Junction - Oba Lake", "msn": "358", "yom": 1952, "flight_number": null, "city": "Hawk Junction", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1231, "captain_hours_type": 409, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17804, "circumstances": "On 11 July 2019, at approximately 0852 Eastern Daylight Time, the float-equipped de Havilland DHC-2 Mk. I Beaver aircraft (registration C-FBBG, serial number 358), operated by Hawk Air, departed from the Hawk Junction Water Aerodrome, on Hawk Lake, Ontario. The aircraft, with the pilot and 1 passenger on board, was on a daytime visual flight rules charter flight. The aircraft was going to drop off supplies at an outpost camp on Oba Lake, Ontario, approximately 35 nautical miles north-northeast of the Hawk Junction Water Aerodrome. The aircraft departed heading northeast. Shortly after takeoff, during the initial climb out, just past the northeast end of Hawk Lake, the aircraft crashed in a steep nose-down attitude, severing a power line immediately before impact, and coming to rest next to a hydro substation. The pilot and the passenger received fatal injuries. The aircraft was destroyed as a result of the impact, but there was no post-impact fire.", "probable_cause": "Findings as to causes and contributing factors:\r\nThese are conditions, acts or safety deficiencies that were found to have caused or contributed to this occurrence.\r\n1. The aircraft likely departed with the fuel selector set to the rear tank position,which did not contain sufficient fuel for departure. As a result, the engine lost power due to fuel starvation shortly after takeoff during the initial climb.\r\n2. After a loss of engine power at low altitude, a left turn was likely attempted in an effort to either return to the departure lake or head toward more desirable terrain for a forced landing. The aircraft stalled aerodynamically, entered an incipient spin, and subsequently crashed.\n\r\nFindings as to risk:\r\nThese are conditions, unsafe acts or safety deficiencies that were found not to be a factor in this occurrence but could have adverse consequences in future occurrences.\r\n1. If aircraft are not equipped with a stall warning system, pilots and passengers who travel on these aircraft will remain exposed to an elevated risk of injury or death as a result of a stall at low altitude.\r\n2. If air-taxi training requirements do not address the various classes of aircraft and operations included in the sector, there is a risk that significant type-, class-, or operation-specific emergency procedures will not be required to be included in training programs.\r\n3. If seasonal air operators conduct recurrent training at the end of the season rather than at the beginning, there is a risk that pilots will be less familiar with required emergency procedures.\r\n4. If air operators do not tailor their airborne training programs to address emergency procedures that are relevant to their operation, there is a risk that pilots will be unprepared in a real emergency.\r\n5. If pilots and passengers do not use available shoulder harnesses, there is an increased risk of injury in the event of an accident."}