{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-f90-king-air-nashville-4-killed", "date": "Jan 24, 2001 at 1510 LT", "type": "Beechcraft 90 King Air", "operator": "Amprite Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Nashville – Waukesha", "msn": "LA-80", "yom": 1980, "flight_number": null, "city": "Nashville", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1100, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5480, "circumstances": "Shortly after takeoff at less than 200 feet above ground level the pilot reported an engine failure, and requested to return to the airport. The controller saw the airplane in a right turn, descending, and observed the airplane level its wings just prior to impact with the tips of trees. The airplane collided with terrain approximately 2,000 feet east of the approach end of runway 20L. A post crash fire ensued and consumed a majority of the airplane. Examination of both engines displayed contact signatures to their internal components characteristic of the engines being powered, with the propellers out of feather at the time of impact, and a low power range. Examination of the propellers found the left propeller blades showed more damage then the blades from the right propeller. Both propellers were rotating with considerable rotational energy. However, examination showed that the left propeller had more power then the right.", "probable_cause": "The pilot's failure to follow loss of engine power emergency procedures by not feathering the propeller following the loss of engine power for undetermined reasons, resulting in a descent and collision with trees and the ground."}