{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-212b-dusseldorf", "date": "Jan 24, 2005 at 0605 LT", "type": "Boeing 747-200", "operator": "Atlas%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dubaï – Düsseldorf ", "msn": "21048", "yom": 1975, "flight_number": "GTI8995", "city": "Düsseldorf-Lohausen", "zone": "North Rhine-Westphalia", "country": "Germany", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 20000, "captain_hours_type": 2300, "copilot_hours": 14600, "copilot_hours_type": 3000, "aircraft_hours": 92024, "circumstances": "The aircraft departed Dubai on a cargo flight to Düsseldorf with three crew members on board. Following an uneventful flight, the crew established radio contact with Düsseldorf Radar at 0543LT. The crew were told that runway 23L was in use. Two minutes later the radar controller contacted flight 8995: \"I just talked to the tower and ah for the time being braking action on all parts of the runway is supposed to be good. They are measuring again right now because it started to snow again and I'll keep you advised.\" The flight was then cleared to descend to FL80. The flight crew decided to set the autobrakes for landing on Medium, to account for the snow. At 05:50 the radar controller again contacted the flight about the current weather circumstances: \"...latest update on the weather situation ahm the friction tester has reported braking action to be good for the moment however as its continuing to snow they are ah afraid that it might worsen, so they are going to do another friction test right before you land.\" In the following minutes the flight was given descent instructions and vectors for an approach to runway 23L. At 05:54 the controller radioed: \"weather update we now have a surface wind of three four zero degrees eleven knots, that's slight tail wind component by two knots. Visibility is down to one thousand five hundred meters, still in snow showers and ah cloud base is now five hundred feet only.\" The flight was subsequently cleared for the approach. At 05:57 the radar controller instructed the crew to contact Düsseldorf Tower. The Tower controller stated: \"Good morning,... we are just waiting for the braking action values from the friction tester stand by a second. The surface wind is actually three three zero degrees one two knots.\" Two minutes later the controller radioed: \"... the braking action was measured to be medium at all parts. And ah the visibility dropped right now due to the heavy snow showers at the field ah. The RVR value at the touchdown zone is presently nine hundred meters, at the mid-point one thousand one hundred meters and ah stop end one thousand one hundred meters.\" At that moment the flight was 3,5 nautical miles out. The flight was subsequently cleared to land. The airplane touched down about 1700 ft (518 m) past the runway threshold. Ground spoilers and thrust reversers deployed and the autobrakes activated. Still the airplane did not decelerate as expected and the pilot applied manual braking. The airplane failed to stop and overran the runway end. It collided with ILS equipments, which caused a fire in engines n°2 and 3. All three crew members evacuated safely and the aircraft was considered as damaged beyond repair. ", "probable_cause": "The accident is attributable to the fact that the braking values transmitted to the crew did not meet the conditions that had arisen as a result of heavy snowfall since the last measurement on the runway.\r\nThe following contributing factors were identified:\r\n- Fast changing weather,\r\n- The lack of an in all weather conditions reliable measurement method for the determination of braking coefficient."}