{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-moulamein-1-killed", "date": "Nov 15, 1971 at 0810 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Super%20Spread%20Aviation", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Dhuragoon - Dhuragoon ", "msn": "1536", "yom": 1963, "flight_number": null, "city": "Moulamein", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6700, "captain_hours_type": 4000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The area to be seeded was a flooded rice paddy, rectangular in shape and approximately 1,650 feet east/west by 800 feet north/south, with the western bank 95 feet to the east of a river. There was an extensive area of dense timber, generally about 70 feet in height, on the western side of the river and a line of trees along the eastern bank. After making an aerial inspection of the area the pilot arranged for the two men who were to act as markers to take up positions on the banks of the paddy in preparation for easterly and westerly seeding runs commencing along the southern side. The first run was made into the east, approaching over the timbered area and towards the low sun. run was then made to the west followed by a steep pull-up and turn over the trees. The third run, again into the east, was commenced but no seed was dropped on this occasion possibly because of difficulties in observing and lining up with the marker at the western end of the paddy. The next run was to the west and was apparently normal and this was followed again by a steep pull-up and turn over the trees. Towards the end of the turn the aircraft was at an estimated height of 100 feet above the trees which was higher than on the previous turn in this area and may have resulted from an endeavour to observe each of the two markers in order to line up for the next run. The aircraft commenced a steep descent, with the wings level, consistent with an approach for a seeding run to the east. A few seconds later, when about 250 feet short of the rice paddy, the aircraft struck the sparsely foliated upper branches of a tree which extended about 20 feet above the other trees in the vicinity and the starboard elevator was torn off. With no apparent power reduction, and little change of direction, the aircraft rolled steeply to the left, descended and, after travelling a further 150 feet, struck another tree on the eastern side of the river. The wings and empennage were torn off and the fuselage fell through the tree to the ground and burst into flames.", "probable_cause": "The evidence is insufficient for the cause of this accident to be determined but it is evident that the operation was being attempted in such a way as to allow little margin for error in the pilot's judgment of obstruction clearance."}