{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-7c-bordeaux-54-killed", "date": "Sep 24, 1959 at 2324 LT", "type": "Douglas DC-7", "operator": "TAI-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris – Bordeaux – Bamako – Abidjan", "msn": "45366", "yom": 1957, "flight_number": "TAI307", "city": "Bordeaux-Mérignac", "zone": "Gironde", "country": "France", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 56, "pax_fatalities": 45, "other_fatalities": 0, "total_fatalities": 54, "captain_hours": 11704, "captain_hours_type": 479, "copilot_hours": 10829, "copilot_hours_type": 312, "aircraft_hours": 5844, "circumstances": "Shortly after a night takeoff from runway 23 at Bordeaux-Mérignac Airport, the aircraft followed a straight-in path but failed to gain sufficient height. After a short course, while at an altitude of about 100 feet, the four engine aircraft struck pine trees, stalled and crashed in flames in a wooded area located 1,050 meters past the runway end. The aircraft was destroyed by impact forces and a post crash fire and all 9 crew members and 45 passengers were killed. Eleven passengers were seriously injured. ", "probable_cause": "The Board considered that the accident was probably caused by the most unfavorable combination of several of the following factors:\r\n- Failure of one or more engine, \r\n- Wrong maneuver of the undercarriage or flaps, \r\n- Malfunction of the control systems, \r\n- Incident in the cockpit, \r\n- False indication on one or more instruments, \r\n- Wrong indication of the artificial horizon, \r\n- Failure of the anemometer, \r\n- Incorrect altimeter setting, \r\n- Error in the variometer. \r\nThe reconstructed flight showed that during the first segment of climbout and during a very short critical phase, a slight increase in speed will produce a considerable decrease in rate of climb or even a slight loss of altitude. In view of the rapid sequence of cockpit operations during this phase, together with the rapid variation in flight parameters, and the lack of precision - even inaccuracy - of readings of certain instruments, and lacking time reference and external visual references, a pilot may follow a line of flight that will bring the aircraft back near the ground if, during this period, optimum climbing speed is not maintained and the altimeter is not carefully watched."}