{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-8bk-weno-island-1-killed", "date": "Sep 28, 2018 at 0924 LT", "type": "Boeing 737-800", "operator": "Air%20Niugini-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Kolonia – Chuuk – Port Moresby", "msn": "33024/1688", "yom": 2005, "flight_number": "PX073", "city": "Weno Island", "zone": "Chuuk Island", "country": "Federated States of Micronesia", "region": "Oceania", "crew_on_board": 12, "crew_fatalities": 0, "pax_on_board": 35, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 19780, "captain_hours_type": 2276, "copilot_hours": 4618, "copilot_hours_type": 368, "aircraft_hours": 37160, "circumstances": "On 28 September 2018, at 23:24:19 UTC2 (09:24 local time), a Boeing 737-8BK aircraft, registered P2-PXE (PXE), operated by Air Niugini Limited, was on a scheduled passenger flight number PX073, from Pohnpei to Chuuk, in the Federated States of Micronesia (FSM) when, during its final approach, the aircraft impacted the water of the Chuuk Lagoon, about 1,500 ft (460 m) short of the runway 04 threshold. The aircraft deflected across the water several times before it settled in the water and turned clockwise through 210 deg and drifted 460 ft (140 m) south east of the runway 04 extended centreline, with the nose of the aircraft pointing about 265°. The pilot in command (PIC) was the pilot flying, and the copilot was the support/monitoring pilot. An Aircraft Maintenance Engineer occupied the cockpit jump seat. The engineer videoed the final approach on his iPhone, which predominantly showed the cockpit instruments. Local boaters rescued 28 passengers and two cabin crew from the left over-wing exits. Two cabin crew, the two pilots and the engineer were rescued by local boaters from the forward door 1L. One life raft was launched from the left aft over-wing exit by cabin crew CC5 with the assistance of a passenger. The US Navy divers rescued six passengers and four cabin crew and the Load Master from the right aft over-wing exit. All injured passengers were evacuated from the left over-wing exits. One passenger was fatally injured, and local divers located his body in the aircraft three days after the accident. The Government of the Federated States of Micronesia commenced the investigation and on 14th February 2019 delegated the whole of the investigation to the PNG Accident Investigation Commission. The investigation determined that the flight crew’s level of compliance with Air Niugini Standard Operating Procedures Manual (SOPM) was not at a standard that would promote safe aircraft operations. The PIC intended to conduct an RNAV GPS approach to runway 04 at Chuuk International Airport and briefed the copilot accordingly. The descent and approach were initially conducted in Visual Meteorological Conditions (VMC), but from 546 ft (600 ft)4 the aircraft was flown in Instrument Meteorological Conditions (IMC). The flight crew did not adhere to Air Niugini SOPM and the approach and pre-landing checklists. The RNAV (GPS) Rwy 04 Approach chart procedure was not  adequately briefed. The RNAV approach specified a flight path descent angle guide of 3º. The aircraft was flown at a high rate of descent and a steep variable flight path angle averaging 4.5º during the approach, with lateral over-controlling; the approach was unstabilised. The Flight Data Recorder (FDR) recorded a total of 17 Enhanced Ground Proximity Warning System (EGPWS) alerts, specifically eight “Sink Rate” and nine “Glideslope”. The recorded information from the Cockpit Voice Recorder (CVR) showed that a total of 14 EGPWS aural alerts sounded after passing the Minimum Descent Altitude (MDA), between 307 ft (364 ft) and the impact point. A “100 ft” advisory was annunciated, in accordance with design standards, overriding one of the “Glideslope” aural alert. The other aural alerts were seven “Glideslope” and six “Sink Rate”. The investigation observed that the flight crew disregarded the alerts, and did not acknowledge the “minimums” and 100 ft alerts; a symptom of fixation and channelised attention. The crew were fixated on cues associated with the landing and control inputs due to the extension of 40° flap. Both pilots were not situationally aware and did not recognise the developing significant unsafe condition during the approach after passing the Missed Approach Point (MAP) when the aircraft entered a storm cell and heavy rain. The weather radar on the PIC’s Navigation Display showed a large red area indicating a storm cell immediately after the MAP, between the MAP and the runway. The copilot as the support/monitoring pilot was ineffective and was oblivious to the rapidly unfolding unsafe situation. He did not recognise the significant unsafe condition and therefore did not realise the need to challenge the PIC and take control of the aircraft, as required by the Air Niugini SOPM. The Air Niugini SOPM instructs a non-flying pilot to take control of the aircraft from the flying pilot, and restore a safe flight condition, when an unsafe condition continues to be uncorrected. The records showed that the copilot had been checked in the Simulator for EGPWS Alert (Terrain) however there was no evidence of simulator check sessions covering the vital actions and responses required to retrieve a perceived or real situation that might compromise the safe operation of the aircraft. Specifically sustained unstabilised approach below 1,000 ft amsl in IMC. The PIC did not conduct the missed approach at the MAP despite the criteria required for visually continuing the approach not being met, including visually acquiring the runway or the PAPI. The PIC did not conduct a go around after passing the MAP and subsequently the MDA although: \r\n• The aircraft had entered IMC; \r\n• the approach was unstable;\r\n• the glideslope indicator on the Primary Flight Display (PFD) was showing a rapid glideslope deviation from a half-dot low to 2-dots high within 9 seconds after passing the MDA;\r\n• the rate of descent high (more than 1,000 ft/min) and increasing;\r\n• there were EGPWS Sink Rate and Glideslope aural alerts; and\r\n• the EGPWS visual PULL UP warning message was displayed on the PFD.\r\nThe report highlights that deviations from recommended practice and SOPs are a potential hazard, particularly during the approach and landing phase of flight, and increase the risk of approach and landing accidents. It also highlights that crew coordination is less than effective if crew members do not work together as an integrated team. Support crew members have a duty and responsibility to ensure that the safety of a flight is not compromised by non-compliance with SOPs, standard phraseology and recommended practices. The investigation found that the Civil Aviation Safety Authority of PNG (CASA PNG) policy and procedures of accepting manuals rather than approving manuals, while in accordance with the Civil Aviation Rules requirements, placed a burden of responsibility on CASA PNG as the State Regulator to ensure accuracy and that safety standards are met. In accepting the Air Niugini manuals, CASA PNG did not meet the high standard of evidence-based assessment required for safety assurance, resulting in numerous deficiencies and errors in the Air Niugini Operational, Technical, and Safety manuals as noted in this report and the associated Safety Recommendations. The report includes a number of recommendations made by the AIC, with the intention of enhancing the safety of flight (See Part 4 of this report). It is important to note that none of the safety deficiencies brought to the attention of Air Niugini caused the accident. However, in accordance with Annex 13 Standards, identified safety deficiencies and concerns must be raised with the persons or organisations best placed to take safety action. Unless safety action is taken to address the identified safety deficiencies, death or injury might result in a future accident. The AIC notes that Air Niugini Limited took prompt action to address all safety deficiencies identified by the AIC in the 12 Safety Recommendations issued to Air Niugini, in an average time of 23 days. The quickest safety action being taken by Air Niugini was in 6 days. The AIC has closed all 12 Safety Recommendations issued to Air Niugini Limited. One safety concern prompting an AIC Safety Recommendation was issued to Honeywell Aerospace and the US FAA. The safety deficiency/concern that prompted this Safety Recommendation may have been a contributing factor in this accident. The PNG AIC is in continued discussion with the US NTSB, Honeywell, Boeing and US FAA. This recommendation is the subject of ongoing research and the AIC Recommendation will remain ACTIVE pending the results of that research.", "probable_cause": "The flight crew did not comply with Air Niugini Standard Operating Procedures Manual (SOPM) and the approach and pre-landing checklists. The RNAV (GPS) Rwy 04 Approach chart procedure was not adequately briefed. The aircraft’s flight path became unstable with lateral over-controlling commencing shortly after autopilot disconnect at 625 ft (677 ft). From 546 ft (600 ft) the aircraft was flown in Instrument Meteorological Conditions (IMC) and the rate of descent significantly exceeded 1,000 feet/min in Instrument Meteorological Conditions (IMC) from 420 ft (477 ft). The flight crew heard, but disregarded, 13 EGPWS aural alerts (Glideslope and Sink Rate), and flew a 4.5º average flight path (glideslope). The pilots lost situational awareness and their attention was channelised or fixated on completing the landing. The PIC did not execute the missed approach at the MAP despite: PAPI showing 3 whites just before entering IMC; the unstabilised approach; the glideslope indicator on the PFD showing a rapid glideslope deviation from half-dot low to 2-dots high within 9 seconds after passing the MDA; the excessive rate of descent; the EGPWS aural alerts: and the EGPWS visual PULL UP warning on the PFD. The copilot (support/monitoring pilot) was ineffective and was oblivious to the rapidly unfolding unsafe situation. It is likely that a continuous “WHOOP WHOOP PULL UP”70 hard aural warning, simultaneously with the visual display of PULL UP on the PFD (desirably a flashing visual display PULL UP on the PFD), could have been effective in alerting the crew of the imminent danger, prompting a pull up and execution of a missed approach, that may have prevented the accident."}