{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-214-tallinn", "date": "Feb 28, 2018 at 1711 LT", "type": "Airbus A320", "operator": "SmartLynx-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tallinn - Tallinn", "msn": "1213", "yom": 2000, "flight_number": "MYX9001", "city": "Tallinn-Lennart Meri-Ülemiste", "zone": "Harjumaa", "country": "Estonia", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 228, "captain_hours_type": 0, "copilot_hours": 24046, "copilot_hours_type": 40, "aircraft_hours": 44997, "circumstances": "On 28th February 2018 at 10:021, the Smartlynx Airlines Estonia Airbus A320-214 registered ES-SAN took off from Tallinn airport Estonia to perform training flights with 2 crew members (captain and safety pilot), 4 students and 1 ECAA inspector on board. Following several successful ILS approaches and touch-and-go cycles, at 15:04, after a successful touch down with the runway, the aircraft did not respond as expected to sidestick inputs when reaching rotation speed. After a brief lift-off, the aircraft lost altitude and hit the ground close to the end of the runway. In the impact, the aircraft engines impacted the runway and the landing gear doors were damaged. After the initial impact, the aircraft climbed to 1590 ft from ground level and pitched down again. The pilots were able to stabilize the flight path by using manual pitch trim and engine thrust and make a U-turn back towards the runway. The crew declared an emergency and the aircraft was cleared for an emergency landing. During the approach, the aircraft lost power in both engines. The aircraft landed 150 m before the threshold of runway at 15:11. On landing, aircraft tires burst, and the aircraft veered off the runway and finally came to a stop 15 m left to the runway. The safety pilot and one of the students suffered minor impact trauma in this accident. The aircraft landing gear doors, landing gears, both engine nacelles, engines and aircraft fuselage suffered severe damage in this accident resulting in aircraft hull loss.", "probable_cause": "Causal factors:\r\nThis accident results from the combination of the following factors:\r\n• The intermittent THSA override mechanism malfunction allowing to cause the loss of pitch control by both ELACs. The repetitive triggering of the ELAC PITCH faults was caused by the non or late activations of the PTA micro-switches, which were due to the OVM piston insufficient stroke. The insufficient OVM stroke was caused by the THSA OVM clutch unit non-standard friction. The oil in the THSA OVM casing appeared to be with a higher viscosity than defined in the CMM. The higher viscosity might have reduced the friction of the OVM clutch unit, causing the THSA OVM nonstandard friction.\r\n• SEC design flaw allowing for a single event, the left landing gear temporary dedecompression, to cause the loss of pitch control by both SECs. The absence of ground spoilers arming for landing in the context of touch and go's training may have contributed to the temporary decompression of the left main landing gear.\r\n• The training instructor`s decision for continuation of the flight despite repetitive ELAC PITCH FAULT ECAM caution messages. The lack of clear framework of operational rules for training flights, especially concerning the application of the MEL, and the specific nature of operations that caused pressure to complete the training program may have impacted the crew decision-making process.\n\r\nContributory factors\r\n• Smartlynx Estonia ATO TM does not clearly define the need for arming spoilers when performing touch-and-go training (ATO procedures not in accordance with Airbus SOP). The fact that there is no clear reference in the Smartlynx Estonia ATO TM Touch-And-Go air exercise section to additional procedures that should be used, in combination with lack of understanding of the importance for arming the spoilers during this type of flights contributed to TRI making a decision to disarm the spoilers during touch and go training enabling landing gear bounce on touch down.\r\n• At the time of the event Airbus QRH did not define the maximum allowed number of resets for the flight control computers.\r\n• At the time of the event Airbus FCTM did not require to consider MEL on touch-and-go and stop-and-go training.\r\n• The oil in the THS OVM casing was with higher viscosity than defined in the CMM. The higher viscosity might have reduced the friction of the OVM clutch unit.\r\n• The aircraft maintenance documentation does not require any test of the OVM during aircraft regular maintenance checks.\r\n• Smartlynx Estonia ATO OM does not clearly specify the role in the cockpit for the Safety Pilot. The lack of task sharing during the event caused the ECAM warnings to be left unnoticed and unannounced for a long period.\r\n• The crew not resetting the ELAC 1. The fact that ELAC 1 PITCH FAULT was left unreset lead to the degradation of the redundancy of the system. Considering the remoteness of the loss control of both elevators, there is no specific crew training for MECHANICAL BACKUP in pitch during approach, landing and take-off. This condition of the aircraft occurred for the crew in a sudden manner on rotation and during training flight, where the experienced TRI is not in PF role and cannot get immediate feedback of the aircraft behaviour and condition. Despite these difficult conditions the crew managed to stabilize and land the aircraft with no major damage to the persons on board. The crew performance factors that contributed to the safe landing of the aircraft are the following:\r\n• The TRI followed the golden rule of airmanship (fly, navigate, communicate), by stabilizing the aircraft pitch by using the trim wheel and by keeping the aircraft engine power as long as possible;\r\n• The Safety Pilot started to play a role in the cockpit by assisting the TRI and student by informing them about the status of the aircraft and later on taking the role of the PM."}