{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-islander-oudega-2-killed", "date": "Nov 9, 1966 at 1310 LT", "type": "Britten-Norman Islander", "operator": "Britten%20Norman", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Plain, Valley", "schedule": "Emden - Southampton", "msn": "1", "yom": 1965, "flight_number": null, "city": "Oudega", "zone": "Friesland", "country": "Netherlands", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7700, "captain_hours_type": 30, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 546, "circumstances": "The prototype aircraft, after having carried out several demonstration flights in Germany, was on its way back to England. It took off from Emden, Germany, at 1137 hrs local time on a non-scheduled international VFR flight to Southampton, England, with the pilot and one passenger. Two minutes after take-off the aircraft made radio contact with Eelde and at 1150 hrs informed Eelde that it was \"abeam Eelde VOR\" and flying at 1 500 ft VMC on top of cloud. At this position the aircraft could not have had any visual ground contact. At 1156 hrs the aircraft asked Amsterdam Flight Information Service for radar assistance in order to pass through Schiphol Control Zone but was informed it was not possible because positive radar contact could not be established. At 1209 hrs the aircraft was advised to divert to Eelde because weather conditions in the Schiphol Control Zone precluded VFR flight through the zone at 1500 ft. On receipt of this information the pilot informed Amsterdam that he would proceed according to his flight plan. At 1220 hrs when flying at 1 500 ft the pilot informed Schiphol that he would clear Schiphol Control Zone to the west. This was after the controller had positively instructed him to remain clear of the Control Zone and that it was impossible to pass through the zone at 1 500 ft under VFR. Reconstruction of the aircraft's flight path showed that at about 1225 hrs it deviated from its route and cleared the Schiphol area on a heading of about 040°. Shortly afterwards, at 1234 hrs the pilot reported he vas experiencing \"serious compass trouble1' and asked for a \"steer\" but Amsterdam still had no radar contact with the aircraft. According to eyewitnesses, the aircraft was, at about this time, flying at a very low height around the vicinity of the village of Rijs, returning to or passing over the same area several times. It was also established from these witnesses that the weather conditions were such i.e. fog and rain, that the pilot would not have had adequate visual reference. At 1240 hrs the pilot reported \"some compass trouble\" and again requested radar guidance but radar contact had still not been established. Flight at low altitude was apparently discontinued at about 1247 hrs and at 1249 hrs the pilot reported at 3 000 ft in IMC and that he had a serious instrument failure. Schiphol Control instructed him to maintain FL 30 (3 000 ft) and a heading of 200'. Contrary to this instruction, the pilot reported at 1251 hrs as being at FL 50 and at 1254 hrs at 6 000 ft. At 1255 hrs the controller asked if the aircraft was circling, the pilot replied in the affirmative and said \"I think I am going around it\". The controller acknowledged this transmission and remarked that he thought the aircraft should be heading 200°; the pilot then replied \"I cannot maintain a heading\". At that moment the aircraft was positively identified on the radar screen. Replying to the radar controller's instruction to fly specific headings and to make a left-hand turn the pilot said he could not maintain a heading and that right hand turns were easier to mase. At 1258 hrs the pilot requested the height of cloud tops and inquired if there were any clear layers in which he could find visual flight conditions. At his request he was cleared to climb to FL 80; however, a German military aircraft which had recently flown over Spijkerboor at PL 100 reported that it had been \"fully IMC\" there. At 1301 hrs the pilot reported at 8 700 ft and \"climbing as fast as I can, I want to pet out on top\"; this was the last recognizable transmission heard by Schiphol. The aircraft was observed on the radar screen until about 1309 hrs at which time radar contact was lost. According to the radar controller the indications observed on the screen for the last 10 to 12 minutes indicated that the aircraft made a series of random small radius right and left-hand turns. At 1310 hrs witnesses near Ringwiel lake saw parts of an aircraft falling, most of it into the lake; these were later identified as parts of the subject aircraft. Calculations and evidence suggested that the aircraft climbed to an altitude above 10 000 ft where it would have encountered severe icing and would have reached a region of moderate to severe turbulence. The time of impact was estimated to be approximately 1310 hrs. The aircraft was totally destroyed and both occupants were killed. ", "probable_cause": "The accident was caused by the failure of the starboard wing, as the result of overstressing during a fast descent. The descent was presumably caused by loss of control under conditions of heavy icing and turbulence, when the aircraft was flown beyond the operating limitations stipulated in its Certificate of Airworthiness. "}