{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-saint-louis-2-killed", "date": "Feb 21, 2010 at 1826 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Bingham Capital Markets St Louis", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Vero Beach – Saint Louis", "msn": "46-22082", "yom": 1989, "flight_number": null, "city": "Saint Louis-Downtown", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1750, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3209, "circumstances": "The airplane was on an instrument flight in night instrument meteorological conditions approaching the destination airport. The pilot contacted the approach control facility by radio and was subsequently cleared for an instrument landing system (ILS) approach to the destination airport. During the approach, the air traffic approach controller advised the pilot twice that the airplane was to the right of the approach course. The controller suggested a left turn of 5 to 7 degrees to the pilot. Once the airplane was back on the inbound course, the approach controller instructed the pilot to contact a tower controller. The pilot never contacted the tower controller, but later reestablished contact with the approach controller, who provided radar vectors for a second attempt at the ILS approach. During the second approach, the controller again advised the pilot that the airplane was to the right of the approach course and provided the pilot a low altitude alert. The airplane then started a climb and a turn back toward the inbound course. The controller advised the pilot that the airplane would intercept the inbound course at the locator outer marker (LOM) for the approach and asked if the pilot would like to abort the approach and try again. The pilot declined and responded that he would continue the approach. No further transmissions were received from the pilot. The airplane impacted a building about 0.4 nautical miles from the LOM. The building and airplane were almost completely consumed by the postimpact fire. A postaccident examination revealed no evidence of mechanical malfunction or failure. The airplane's turning ground track and the challenging visibility conditions were conducive to the onset of pilot spatial disorientation.", "probable_cause": "The pilot’s spatial disorientation and subsequent failure to maintain airplane control during the instrument approach."}