{"url": "https://www.baaa-acro.com/crash/crash-rockwell-turbo-commander-681-tamworth-1-killed", "date": "Feb 14, 1991 at 1025 LT", "type": "Rockwell Turbo Commander 680/681", "operator": "Amann Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Brisbane - Moree - Tamworth", "msn": "681-6004", "yom": 1969, "flight_number": null, "city": "Tamworth", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3022, "captain_hours_type": 37, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3717, "circumstances": "VH-NYG had departed Tamworth three days before the accident on an extended passenger charter through Sydney, Moree, Emerald, Brisbane, Moree, and Tamworth. On the day of the accident, the pilot had submitted a flight plan nominating a charter category, single pilot, Instrument Flight Rules flight from Brisbane to Moree, then Tamworth. The flight plan indicated that the aircraft carried 1400 Ib (635 kg) of fuel and had an endurance of 211 min. The aircraft, with four passengers on board, departed Brisbane at 0902 hours and landed at Moree at 1010 after an uneventful flight. All four passengers left the flight at Moree. The pilot reported taxiing at Moree to Dubbo Flight Service at 1047 and called airborne at 1050. At 1117 hours the aircraft was given a clearance to enter the Tamworth Control Zone on descent from 10000 ft. The pilot was told to expect a right downwind leg for runway 30. At 1125 the pilot requested a change of runway to runway 18, stating that there was a fuel flow problem with the left engine. The aerodrome controller (ADC) issued a change of runway (runway 18) to the aircraft, asking the pilot whether emergency conditions existed. The pilot answered in the negative and about 30 sec later informed the ADC that he was conducting one left orbit. The orbit was commenced at about 300 ft above ground level (agl) and approximately above the threshold of runway 18. The orbit was flown with an angle of bank of about 60°. The aircraft developed a high rate of descent during the orbit and rolled wings level in a pronounced nose-down attitude after turning through almost 360°. The aircraft then struck the ground in a grassed paddock about 350 m short of the threshold of runway 18 and in line with the right edge of the flight strip. The aircraft, largely intact, slid in the direction of the runway for 53 m before coming to rest. The pilot, sole on board, was killed. ", "probable_cause": "The following findings were reported:\r\n- The pilot was misled by erroneous fuel consumption data from the aircraft trend monitoring sheet, the endorsing pilot, and the company fuel planning figures.\r\n- The pilot did not ensure that sufficient fuel was carried in the aircraft to complete the planned flight.\r\n- The pilot made an improper in-flight decision to change runways during a forced landing attempt.\r\n- The pilot misjudged the forced landing approach.\r\n- The pilot was unable to recover the aircraft from the high rate of descent which developed during the approach."}