{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-cottage-point-6-killed", "date": "Dec 31, 2017 at 1515 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Sydney%20Seaplanes", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Cottage Point - Sydney", "msn": "1535", "yom": 1963, "flight_number": null, "city": "Cottage Point", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 10762, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 21872, "circumstances": "On 31 December 2017, at about 1045 Eastern Daylight-saving Time, five passengers arrived via water-taxi at the Sydney Seaplanes terminal, Rose Bay, New South Wales (NSW) for a charter fly-and-dine experience to a restaurant at Cottage Point on the Hawkesbury River. Cottage Point is about 26 km north of Sydney Harbour in the Ku-ring-gai Chase National Park, a 20 minute floatplane flight from Rose Bay. At about 1130, prior to boarding the aircraft, the passengers received a pre-flight safety briefing. At about 1135, the pilot and five passengers departed the Rose Bay terminal for the flight to Cottage Point via the northern beaches coastal route, in a de Havilland Canada DHC-2 Beaver floatplane, registered VH-NOO and operated by Sydney Seaplanes. The flight arrived at Cottage Point just before midday and the passengers disembarked. The pilot then conducted another four flights in VH-NOO between Cottage Point and Rose Bay. The pilot arrived at Cottage Point at about 1353. After securing the aircraft at the pontoon and disembarking passengers from that flight, the pilot walked to a kiosk at Cottage Point for a drink and food. At about 1415, the pilot received a phone call from the operator via the kiosk, asking the pilot to move the aircraft off the pontoon, which could only accommodate one aircraft at a time. This was to allow the pilot of the operator’s other DHC-2 aircraft (VH-AAM) to pick-up other restaurant passengers. The pilot of VH-NOO immediately returned to the aircraft and taxied away from the pontoon into Cowan Creek. The operator’s records indicated that VH-AAM arrived at the pontoon and shut down the engine at about 1419, and subsequently departed at about 1446. The pilot of VH-NOO returned to the pontoon after having taxied in Cowan Creek with the engine running for up to 27 minutes, while waiting for the other aircraft. During the taxi, closed-circuit television footage from a private residence at Cottage Point showed VH-NOO at 1444, with the pilot’s door ajar. After shutting down the aircraft, the pilot briefly went into the restaurant to see if the passengers were ready to leave, and then returned to the aircraft. The return flight to Rose Bay, scheduled to depart at 1500, provided sufficient time for the passengers to meet a previously booked water-taxi to transport them from Rose Bay to their hotel at 1545. At about 1457, the passengers commenced boarding the aircraft and at around 1504, the aircraft had commenced taxiing toward the designated take-off area in Cowan Creek. At about 1511, the aircraft took off towards the north-north-east in Cowan Creek, becoming airborne shortly before passing Cowan Point. The aircraft climbed straight ahead before commencing a right turn into Cowan Water. A witness, who was travelling east in a boat on the northern side of Cowan Water, photographed the aircraft passing over a location known as ‘Hole in the wall’. These photographs indicated that the aircraft was turning to the right with a bank angle of 15-20°. Witnesses observed the right turn continue above Little Shark Rock Point and Cowan Water. The last photograph taken by the passenger was when the aircraft was heading in a southerly direction towards Cowan Bay. At that time, the aircraft was estimated to be at an altitude of about 30 m (98 ft).Shortly after the turn in Cowan Water, several witnesses observed the aircraft heading directly towards and entering Jerusalem Bay flying level or slightly descending, below the height of the surrounding terrain. Witnesses also reported hearing the aircraft’s engine and stated that the sound was constant and appeared normal. About 1.1 km after entering Jerusalem Bay, near the entrance to Pinta Bay, multiple witnesses reported seeing the aircraft flying along the southern shoreline before it suddenly entered a steep right turn at low-level. Part-way through the turn, the aircraft’s nose suddenly dropped before the aircraft collided with the water, about 95 m from the northern shore and 1.2 km from the end of Jerusalem Bay. The aircraft came to rest inverted and with the cabin submerged. A number of people on watercraft who heard or observed the impact, responded to render assistance. Those people could not access the (underwater) aircraft cabin. The entire tail section and parts of both floats were initially above the waterline, but about 10 minutes later had completely submerged. The pilot and five passengers received fatal injuries. ", "probable_cause": "Contributing factors:\r\n- The aircraft entered Jerusalem Bay, a known confined area, below terrain height with a level or slightly descending flight path. There was no known operational need for the aircraft to be\r\noperating in the bay.\r\n- While conducting a steep turn in Jerusalem Bay, it was likely that the aircraft aerodynamically stalled at an altitude too low to effect a recovery before colliding with the water.\r\n- It was almost certain that there was elevated levels of carbon monoxide in the aircraft cabin, which resulted in the pilot and passengers having higher than normal levels of carboxyhaemoglobin in their blood.\r\n- Several pre-existing cracks in the exhaust collector ring, very likely released exhaust gas into the engine/accessory bay, which then very likely entered the cabin through holes in the main\r\nfirewall where three bolts were missing.\r\n- A 27 minute taxi before the passengers boarded, with the pilot’s door ajar likely exacerbated the pilot’s elevated carboxyhaemoglobin level.\r\n- It was likely that the pilot's ability to safely operate the aircraft was significantly degraded by carbon monoxide exposure.\r\n- Disposable chemical spot detectors, commonly used in general aviation, can be unreliable at detecting carbon monoxide in the aircraft cabin. Further, they do not draw a pilot's attention to a hazardous condition, instead they rely on the pilot noticing the changing colour of the sensor.\r\n- There was no regulatory requirement from the Civil Aviation Safety Authority for piston-engine aircraft to carry a carbon monoxide detector with an active warning to alert pilots to the presence of elevated levels of carbon monoxide in the cabin. (Safety issue)\n\r\nOther factors that increased risk:\r\n- It was likely that the effectiveness of the disposable carbon monoxide chemical spot detector fitted to the aircraft was reduced due to sun bleaching.\r\n- Although detectors were not required to be fitted to their aircraft, Sydney Seaplanes had no mechanism for monitoring the serviceability of the carbon monoxide detectors. (Safety issue)\r\n- The in situ bolts used by the maintenance organisation to secure the magneto access panels on the main firewall were worn, and were a combination of modified AN3-3A bolts and non-specific bolts. This increased the risk of the bolts either not tightening securely on installation and/or coming loose during operations.\r\n- The operator relied on volunteered passenger weights without allowances for variability, rather than actual passenger weights obtained just prior to a flight. This increased the risk of underestimating passenger weights and potentially overloading an aircraft.\r\n- The standard passenger weights specified in Civil Aviation Advisory Publication (CAAP) 235-1(1) Standard passenger and baggage weights did not accurately reflect the average weights of the current Australian population. Further, the CAAP did not provide guidance on the use of volunteered passenger weights as an alternative to weights derived just prior to a flight.\r\n- Australian civil aviation regulations did not mandate the fitment of flight recorders for passenger-carrying aircraft under 5,700 kg. Consequently, the determination of factors that influenced this accident, and other accidents, have been hampered by a lack of recorded data pertaining to the flight. This has likely resulted in the non-identification of safety issues, which continue to present a hazard to current and future passengercarrying operations. (Safety issue)\r\n- Annex 6 to the Convention of International Civil Aviation did not mandate the fitment of flight recorders for passenger-carrying aircraft under 5,700 kg. Consequently, the determination of factors that influenced this accident, and numerous other accidents have been hampered by a lack of recorded data pertaining to the flight. This has likely resulted in important safety issues not being identified, which may remain a hazard to current and future passenger carrying operations. (Safety issue)\n\r\nOther findings:\r\n- It was very likely that the middle row right passenger did not have his seatbelt fastened at the time of impact, however, the reason for this could not be determined. \r\n- The accident was not survivable due to the combination of the impact forces and the submersion of the aircraft. \r\n- The pilot had no known pre-existing medical conditions that could explain the accident."}