{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690-sydney-1-killed", "date": "Jan 14, 1994 at 0114 LT", "type": "Rockwell Grand Commander 690", "operator": "Newcastle Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Canberra - Sydney", "msn": "690-11044", "yom": 1972, "flight_number": null, "city": "Sydney-Kingsford Smith", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1800, "captain_hours_type": 50, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7975, "circumstances": "On 14 January 1994 at 0114, Aero Commander 690 aircraft VH-BSS struck the sea while being radar vectored to intercept the Instrument Landing System approach to runway 34 at Sydney (Kingsford-Smith) Airport, NSW. The last recorded position of the aircraft was about 10 miles to the south-east of the airport. At the time of the accident the aircraft was being operated as a cargo charter flight from Canberra to Sydney in accordance with the Instrument Flight Rules. The body of the pilot who was the sole occupant of the aircraft was never recovered. Although wreckage identified as part of the aircraft was located on the seabed shortly after the accident, salvage action was not initially undertaken. This decision was taken after consideration of the known circumstances of the occurrence and of the costs of salvage versus the potential safety benefit that might be gained from examination of the wreckage. About 18 months after the accident, the wing and tail sections of the aircraft were recovered from the sea by fishermen. As a result, a detailed examination of that wreckage was carried out to assess the validity of the Bureau’s original analysis that the airworthiness of the aircraft was unlikely to have been a factor in this accident. No evidence was found of any defect which may have affected the normal operation of the aircraft. The aircraft descended below the altitude it had been cleared to by air traffic control. From the evidence available it was determined that the circumstances of this accident were consistent with controlled flight into the sea.", "probable_cause": " Findings\r\n1. The pilot held a valid pilot licence, endorsed for Aero Commander 690 aircraft.\r\n2. The pilot held a valid multi-engine command instrument rating.\r\n3. There was no evidence found to indicate that the performance of the pilot was adversely affected by any physiological or psychological condition.\r\n4. The aircraft was airworthy for the intended flight, despite the existence of minor anomalies in maintenance and serviceability of aircraft systems.\r\n5. The aircraft carried fuel sufficient for the flight.\r\n6. The weight and balance of the aircraft were estimated to have been within the normal limits.\r\n7. Recorded radio communications relevant to the operation of the aircraft were normal.\r\n8. Relevant ground-based aids to navigation were serviceable.\r\n9. At the time of impact the aircraft was capable of normal flight.\r\n10. The aircraft was fitted with an altitude alerting system.\r\n11. The aircraft was not fitted with a ground proximity warning system.\r\n12. The aircraft was equipped with a transponder which provided aircraft altitude information to be displayed on Air Traffic Control radar equipment.\r\n3.2 Significant factors\r\n1. The pilot was relatively inexperienced in single-pilot Instrument Flight Rules operations on the type of aircraft being flown.\r\n2. The aircraft was being descended over the sea in dark-night conditions.\r\n3. The workload of the pilot was significantly increased by his adoption of a steep descent profile at high speed, during a phase of flight which required multiple tasks to be completed in a limited time prior to landing. Radio communications with another company aircraft during that critical phase of flight added to that workload. \r\n4. The pilot probably lost awareness of the vertical position of the aircraft as a result of distraction by other tasks.\r\n5. The aircraft was inadvertently descended below the altitude authorized by Air Traffic Control.\r\n6. The secondary surveillance radar system in operation at the time provided an aircraft altitude readout which was only updated on every sixth sweep of the radar display.\r\n7. The approach controller did not notice a gross change of aircraft altitude shortly after a normal radio communication with the pilot. "}