{"url": "https://www.baaa-acro.com/crash/crash-canadair-cl-600-challenger-fort-lauderdale", "date": "Aug 16, 1999 at 2347 LT", "type": "Canadair CL-600 Challenger", "operator": "Hop-A-Jet", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pueblo – Columbia", "msn": "1021", "yom": 1981, "flight_number": null, "city": "Fort Lauderdale-Executive", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10162, "captain_hours_type": 540, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9503, "circumstances": "While enroute from Pueblo, Colorado, to Columbia, South Carolina, the captain's windshield delaminated, and the flight diverted to Fort Lauderdale, Florida, for repairs. The flight crew stated the first officer was flying the airplane and had been instructed by the captain to make a firm landing at Fort Lauderdale to get the airplanes weight on the wheels, due to the airplane being light. The landing was firm and the first officer activated the engine thrust reversers. As the nose landing gear touched down, the airplane began veering to the left. Attempts to control the veer to the left were unsuccessful and the airplane ran off the left side of the runway. The airplane then ran over a taxiway and collided with a taxiway sign and the concrete base for the sign. The nose landing gear collapsed and the airplane came to rest. Examination of the runway showed alternating dark and light marks from the left main landing gear tire were present on the runway about 160 feet before marks from the right main landing gear tire are present. Post accident examination of the airplanes landing gear, tires, wheels, bakes, spoilers, and engine thrust reversers, showed no evidence of pre-accident failure or malfunction. At the time of the accident the flight crew had been on duty for about 17 hours 45 minutes. ", "probable_cause": "The failure of the flight crew to main directional control of the airplane after landing, resulting in the airplane going off the side of the runway and colliding with a taxiway sign, collapsing the nose landing gear, and causing substantial damage to the airplane. A factor in the accident was flight crew fatigue due to being on duty for about 17 hours 45 minutes. "}