{"url": "https://www.baaa-acro.com/crash/crash-partenavia-p68c-adjuntas-2-killed", "date": "Jan 15, 2007 at 0415 LT", "type": "Partenavia P.68", "operator": "Larry L. Galloway", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Aguadilla - Ponce", "msn": "365", "yom": 1985, "flight_number": null, "city": "Adjuntas", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 13000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9611, "circumstances": "The non-instrument rated pilot departed VFR on a dark night at 0359, with an adequate fuel supply for the intended flight, and proceeded in a south-southeasterly heading (approximately 150 degrees) climbing to a maximum altitude of 4,700 feet msl. The flight continued on the south-southeasterly heading, descended to 4,500 feet msl, then descended gradually to 3,800 feet msl where radar contact was lost at 0411:37. The flight continued 4.6 nautical miles on the south-southeasterly heading, and impacted trees in upslope mountainous terrain while on a magnetic heading of 150 degrees. The airplane was destroyed by impact and a  postcrash fire; the accident site was located north of, and approximately 146 feet below an east-west oriented ridge line. The tree elevation was 3,299 feet msl, while the elevation at a ridge south of the site was 3,445 feet msl. Cloud tops in the area were calculated to be about 4,000 feet msl. Examination of the airplane structure, flight controls, engines, propellers, and systems revealed no evidence of preimpact failure or malfunction. The altimeter settings for the departure and destination airports were 30.02 inches Hg and 30.01 inches Hg, respectively. The altimeter was found positioned to 29.91 inches Hg. This error would have resulted in the altimeter reading 100 feet lower than if the correct altimeter setting was entered.", "probable_cause": "The pilot's failure to maintain altitude/clearance with mountainous terrain for undetermined reasons during a normal descent under instrument meteorological and dark night conditions."}