{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-1-dl-near-vallejo-9-killed", "date": "Dec 7, 1949 at 1715 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "California Arrow Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Burbank – Oakland – Sacramento", "msn": "9201", "yom": 1943, "flight_number": null, "city": "Vallejo", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7722, "circumstances": "The flight departed Burbank, California, at 1420, bound for Oakland and Sacramento, with a crew consisting of James S. Garnett, pilot, Joseph Dillon, copilot and Susan DeVore, stewardess. Takeoff was accomplished from Oakland at 1656 at which time the aircraft carried six passengers, out no cargo. Total aircraft weight was within the certificated limits and the load was properly distributed. The aircraft carried fuel sufficient for a flight of two hours and thirty minutes and the estimated flight time to Sacramento was thirty minutes. Following take off, the flight cruised five miles northwest of the Oakland Airport for seven minutes while waiting for receipt of an instrument flight clearance which provided for a cruising altitude of 4,000 feet to Sacramento. The flight then proceeded on course, and at 1708 reported over the Richmond Radio flange Intersection, 16 miles northwest of Oakland, stating that it would be over the Fairfield Radio flange Station, 41 miles northeast of Richmond, at 1723. Since there was no routine mention of altitude, Air Route Traffic Control immediately requested the information, and the flight replied that at was at 4,000 feet. This was the last communication received from the flight. Approximately one hour after the position report over Richmond, CAA Communications received a report that the flight had crashed six miles east of Vallejo. All occupants were killed and the aircraft was destroyed.", "probable_cause": "The Board determines that the probable cause of this accident was failure of the flight to fly at the assigned altitude on an instrument flight plan, which resulted in the aircraft striking a hill obscured by clouds."}