{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-nikolai", "date": "Dec 28, 2002 at 1230 LT", "type": "De Havilland DHC-3 Otter", "operator": "Grasshopper Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nikolai – Wasilla", "msn": "54", "yom": 1954, "flight_number": null, "city": "Nikolai", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4000, "captain_hours_type": 400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16437, "circumstances": "The commercial certificated pilot reported that just after takeoff in a wheel/ski equipped airplane, he heard a very loud bang, followed by a loud rattling noise. As he turned towards the departure airstrip, he had difficulty using the airplane's rudder pedals. Using a combination of aileron input and the remaining amount of rudder control, he was able to maneuver the airplane for a landing on the airstrip. He said that as the airplane passed over the approach end of the airstrip, it drifted to the right, and he initiated a go-around. The airplane subsequently collided with a stand of trees bordering the airstrip, and sustained structural damage to the wings, fuselage, and empennage. In a written statement to the NTSB, the pilot stated that he suspected that the right elevator's outboard and center hinges or hinge pins failed, allowing the right elevator to swing rearward and jam the airplane's rudder. An FAA airworthiness inspector traveled to the accident scene to examine the airplane. He reported that the right elevator was discovered about 150 feet behind the airplane, within the wreckage debris path through a stand of trees. He said that the right elevator sustained a significant amount of damage along the leading edge, which would normally be protected by the horizontal stabilizer. The FAA inspector examined the airplane's horizontal stabilizer in the area where the right and left elevators connect, and noted signs of new paint on the rivets that held the torque tube support assembly, indicating recent reinstallation or replacement of the torque tube support assembly. He indicated that the torque tube support assembly was installed at a slight angle to the right, which allowed the right elevator to eventually slip off of the center and outboard hinge pins. The inspector said that witness marks on the center and outboard hinge pins showed signs of excessive wear towards the outboard portion of each pin. The inspector noted that a review of the airplane's maintenance records failed to disclose any entries of repair/replacement of the elevator torque tube support assembly.", "probable_cause": "An improper and undocumented major repair of the elevator torque tube support assembly by an unknown person, which resulted in an in-flight disconnection of the airplane's right elevator, and a jammed rudder. A factor associated with the accident is the inadequate inspection of the airplane by company maintenance personnel."}