{"url": "https://www.baaa-acro.com/crash/crash-handley-page-hp12-ostana", "date": "Jun 30, 1920 at 1500 LT", "type": "Handley Page H.P.12", "operator": "Handley-Page-Transport-2", "flight_phase": "Takeoff (climb)", "flight_type": "Demonstration", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Kjeller – Karlstad – Stockholm - Copenhagen", "msn": "HP.22", "yom": 1919, "flight_number": null, "city": "Östanå", "zone": "Skåne", "country": "Sweden", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 06.50 pm the Handley Page O/400, G-EAKE, departed for the last time from Kjeller and despite the strong winds it climbed to its cruising altitude at 2,440 metres (8,000 feet). The average speed that day was 100 kmh. Donovan explained Mrs Meisterlin under the first leg of the trip how they would fly to Karlstad and Stockholm. They crossed the Norwegian-Swedish border at 7.35 pm and Arvika at 7.55 pm. The clouds were by now getting thicker and at 8.25 pm they flew above Karlstad in 1,000 metres. They looked for Hallvard Næss and his Norman Thompson N.T.2B flying boat N-13, but in vein. He was delayed. At 9 pm they cross a landscape with thousands of tree and no possibility for an emergency landing. By now it was dark and only the fire coming from the exhaust pipe lighted up the sky. At 9.50 pm they flew above the large lake Mälaren and could enjoy a beautiful view. Donovan said, “Thumbs up – Stockholm!”, when at 11.20 pm a large city was in sight. But instead of going down, the Handley Page O/400 continued in the eastern direction and ended up above the lovely archipelago north of Stockholm. They started to fly around in circles and Donovan said, “I think they have lost themselves”. It was now decided to find as soon as possible a suitable landing site and finally the crew found a field that looked good enough. They flew in low altitude above houses and fields and finally land safely in a cornfield. Sergeant Rogers thought that the field was a regular meadow, but it turned out to be a cornfield. The aircraft suffered no damages. The following day the crew together Captain Meisterlin returned to the field where sergeant Rogers the night before had landed. The aircraft looked undamaged and therefore it was decided to start that day and proceed to Stockholm and the original landing site at Häsgerstalund. The owner of the manor gathered some local workers, who would help plough a lane through the cornfield. The lane was 5 metres wide and 300 metres long. At 3 pm the “runway” was ready and crew and passengers boarded the plane after thanking the hosts for the hospitality. Rogers switched on the engines and slowly the aircraft started on its take-off. It was however soon clear that the lane was not wide enough and that the two metres high corn touched the wings making the aircraft unstable. Sergeant Rogers tried to keep the aircraft straight, failed to do so and instead he tried to lift the aircraft from the field. By now the corn had twisted itself into the undercarriage and the aircraft crashed on its noose, tipping nearly completely around. Some were thrown out of the aircraft, while others were trapped into the fuselage. After the crash Sergeant Rogers shouted to turn off the petrol in order to avoid fire. Lieutenant Gottenborg managed to get out of the aircraft and ran to Captain Meisterlin, Donovan and Sergeant Rogers in order to free them. Donovan was the one with the worst injuries. He had burns in his face and on its hands and was in great pain. He managed to get out by himself. To get out Captain Meisterlin and Sergeant Rogers from the wreckage help was needed from the local workers. Sergeant Rogers’s leg injury (from the motor cycle accident in Norway) had worsened and he and Donovan were taken by stretcher to the ambulance and driven to the hospital in Östanå.  Fortunately Dr. Nicolaysen was not hurt and could offer first aid. Mrs Meisterlin and Lieutenant Gottenborg were all unhurt and the journalist Qviller had broken his arm. Finally, the aircraft was now a total wreck and was damaged beyond repair. The flight to Stockholm and København was subsequently cancelled.\r\nCrew:\r\nSergeant W. Rogers, pilot\r\nMr. Donovan, mechanic.\r\nObservers: Captain Wilhelm Meisterlin and Lieutenant Brynjulf Gottenborg.\r\nPassengers: \r\nDr. Nicolaysen,\r\nMrs Astrid Meisterlin\r\nMr. Haakon Qviller, journalist by the Norwegian newspaper Aftenposten.\n\r\nSource:\r\nRob Mulder - www.europeanairlines.no", "probable_cause": null}