{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-620-cheyenne-ii-concord-6-killed", "date": "Jul 14, 1984 at 1212 LT", "type": "Piper PA-31 Cheyenne", "operator": "Schröter Verwaltungs", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Santa Monica - Concord", "msn": "31-8120034", "yom": 1981, "flight_number": null, "city": "Concord-Buchanan Field", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 1400, "captain_hours_type": null, "copilot_hours": 200, "copilot_hours_type": 40, "aircraft_hours": 1050, "circumstances": "The piper PA-31T was a foreign registered aircraft (Federal Republic of Germany). The owner/pilot in the left front seat held a German commercial certificate with airplane instrument, single engine land and multi-engine land ratings. The pilot in the right front seat held an American private certificate with an airplane single engine land rating. During arrival, the aircraft was cleared to enter a right traffic pattern for runway 32R and was to follow a Decathlon that was landing on the same runway. When the PA-31 aircrew called turning onto a base leg, the tower asked if they had the Decathlon in sight, but they did not reply. The Decathlon pilot was then instructed to change his approach to 32L and was cleared to land. The PA-31 was observed to overshoot the turn to the final approach course to runway 32R. Witnesses reported the aircraft made an erratic, slow speed, nose high turn at low altitude, then it entered a right turn, nose down spin, crashed and burned. Impact occurred on a ground structure. An investigation revealed no preimpact/part failure or malfunction. Fire damaged to 5 autos. All six occupants were killed. ", "probable_cause": "Occurrence #1: loss of control - in flight\r\nPhase of operation: approach - VFR pattern - base leg/base to final\r\nFindings\r\n1. (f) planned approach - improper - pilot in command\r\n2. (f) diverted attention - pilot in command\r\n3. (c) airspeed - not maintained - pilot in command\r\n4. (c) stall/spin - inadvertent - pilot in command\r\n----------\r\nOccurrence #2: in flight collision with object\r\nPhase of operation: descent - uncontrolled\r\nFindings\r\n5. Object - building (nonresidential)"}