{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-hammond-2-killed", "date": "Oct 14, 2015 at 1548 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Aero One", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Hammond - Atlanta", "msn": "421B-0502", "yom": 1973, "flight_number": null, "city": "Hammond-Northshore", "zone": "Louisiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin-engine airplane, flown by a commercial pilot, was departing on a business flight from runway 31 when the right engine lost power. According to a pilot-rated witness, the airplane was about halfway down the 6,500 ft runway at an altitude of about 100 ft above ground level when he heard a \"loud pop\" and then saw the airplane's right propeller slow. The witness reported that the airplane yawed to the right and then began a right turn toward runway 18 with the right engine's propeller windmilling. The witness further reported that the airplane cleared a tree line by about 150 ft, rolled right, descended straight down to ground impact, and burst into flames. Postaccident examination of the airplane's right engine revealed that the crankshaft was fractured adjacent to the No. 2 main bearing, which had rotated. The crankcase halves adjacent to the No. 2 main bearing were fretted where the case through-studs were located. The fretting of the mating surfaces was consistent with insufficient clamping force due to insufficient torque of the through-stud nuts. Records indicated that all six cylinders on the right engine had been replaced at the airplane's most recent annual inspection 8 months before the accident. In order to replace the cylinders, the through-stud nuts had to be removed as they also served to hold down the cylinders. It is likely that when the cylinders were replaced, the through-stud nuts were not properly torqued, which, over time, allowed the case halves to move and led to the bearing spinning and the crankshaft fracturing. During the accident sequence, the pilot made a right turn in an attempt to return to the airport and did not feather the failed (right) engine's propeller, allowing it to windmill, thereby creating excessive drag. It is likely that the pilot allowed the airspeed to decay below the minimum required for the airplane to remain controllable, which combined with his failure to feather the failed engine's propeller and the turn in the direction of the failed engine resulted in a loss of airplane control. ", "probable_cause": "The loss of right engine power on takeoff due to maintenance personnel's failure to properly tighten the crankcase through-studs during cylinder replacement, which resulted in crankshaft fracture. Also causal were the pilot's failure to feather the propeller on the right engine and his failure to maintain control of the twin-engine airplane while maneuvering to return to the airport."}