{"url": "https://www.baaa-acro.com/crash/crash-fokker-50-sharjah-43-killed", "date": "Feb 10, 2004 at 1138 LT", "type": "Fokker 50", "operator": "Kish-Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kish Island - Sharjah", "msn": "20273", "yom": 1993, "flight_number": "IRK1770", "city": "Sharjah", "zone": "Sharjah (الشارقةّ)", "country": "United Arab Emirates", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 40, "pax_fatalities": 37, "other_fatalities": 0, "total_fatalities": 43, "captain_hours": 6440, "captain_hours_type": 1516, "copilot_hours": 3978, "copilot_hours_type": 517, "aircraft_hours": 20466, "circumstances": "The aircraft was operating as a scheduled flight from Kish Island, Iran to Sharjah, UAE with the captain initially as the pilot flying (PF). During the cruise and just prior to descent, the captain unexpectedly handed over control of the aircraft to the First Officer prior to the approach to Sharjah. The first officer did not accept this willingly and stated that he was not confident of his ability to conduct a VOR/DME approach into Sharjah. This statement was not consistent with his previous experience and could indicate either a cultural or professional issue. The captain insisted the first officer fly the aircraft and encouraged and instructed him during the approach. At 11:24 hours local time, the aircraft contacted Dubai Arrivals and was cleared from 9000 ft to 5000 ft and instructed to expect a VOR/DME approach to runway 12 at Sharjah International Airport. At 11:29 hours the aircraft was further cleared to 2500 ft and cleared for the approach. The aircraft was under its own navigation and the daylight conditions were fine with excellent visibility. At 11:35 hours the aircraft was instructed to contact Sharjah Tower and the pilot reported that the aircraft was established on the VOR final approach for runway 12. The Tower cleared IRK7170 to land and advised that the wind was calm. At that point the aircraft was slightly above the approach profile. The initial speed for the approach was at least 50 kt high at approximately 190 kt with no flap and no landing gear. The aircraft should have been configured with landing gear down and flap 10° during the approach and stabilized at 130 kt prior to the MDA. Approaching the MDA at flight idle setting, the autopilot was disengaged and the first Officer called for flap 10 at 186 kt (limiting speed of 180 kt) and flap 25 was selected by the Captain, a setting uncalled for by the Pilot Flying at 183 kt (limiting speed of 160 kt), and the landing gear was called for and selected at approximately 185 kt (limiting speed of 170 kt). The captain then took control of the aircraft and shortly afterwards the ground range selectors were heard by Cockpit Voice Recorder to be lifted and the power levers moved from the flight idle stop into the ground control range. The left propeller then went to full reverse whilst the right propeller remained in positive pitch within the ground control range. The aircraft descended in an extreme nose low left bank attitude until impact. The aircraft crashed 2.6 nm from the runway onto an unprepared sandy area adjacent to a road and residential buildings. The aircraft broke apart on impact and a fire started immediately. Three passengers suffered injuries while 43 other occupants were killed. ", "probable_cause": "During the final approach, the power levers were moved by a pilot from the flight idle position into the ground control range, which led to an irreversible loss of flight control. The following contributing factors were identified: \r\n1. By suddenly insisting the First Officer fly the final approach, the pilot in command created an environment, which led to a breakdown of crew resource management processes, the non observance of the operator’s standard operating procedures and a resultant excessive high approach speed.\r\n2. An attempt to rectify this excessive high approach speed most likely resulted in the non compliance with the Standard Operating Procedures and the movement of the power levers below flight idle.\r\n3. The unmodified version of the Skid Control Unit failed to provide adequate protection at the time of the event."}