{"url": "https://www.baaa-acro.com/crash/crash-comp-air-ca-8-everglades-city-1-killed", "date": "Apr 6, 2012 at 1645 LT", "type": "Comp Air CA-8", "operator": "Spanish-Fly", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Everglades City - Merritt Island", "msn": "0585552921", "yom": 2006, "flight_number": null, "city": "Everglades City", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1208, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Witnesses observed the airplane depart the airport to the north and make an abrupt right turn at an altitude of about 150 feet. One witness, who was also a pilot, described the wings as “shimmying,” appearing as if the airplane stalled before it banked to the right in a nose-down attitude. The airplane crashed and was nearly consumed during the postcrash fire. A postaccident examination was conducted with no preimpact mechanical anomalies noted. Records indicate that the pilot built the airplane from a kit about 6 years before the accident. The pilot and airplane logbooks were not located during the investigation; therefore, the maintenance history for the airplane, and the pilot’s recent (and total) flight experience could not be determined. Postaccident toxicological testing revealed metabolites of the drug diazepam (Valium) in the pilot’s blood and urine. Valium is a prescription benzodiazepine classed as a central nervous system depressant and tranquilizer, used as a sleep aid and to inhibit anxiety. The amount noted in the pilot’s blood suggested he took the drug 12 to 24 hours before the accident, and, as a result, it would not have affected his performance.", "probable_cause": "The pilot’s failure to maintain sufficient airspeed during the initial climb after takeoff, which resulted in an aerodynamic stall and loss of airplane control."}