{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-la-grande-3", "date": "May 14, 1998 at 0947 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Avionair", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Montreal – Rouyn – La Grande Rivière", "msn": "31-7405451", "yom": 1974, "flight_number": null, "city": "La Grande-3", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1560, "captain_hours_type": 60, "copilot_hours": 265, "copilot_hours_type": 15, "aircraft_hours": null, "circumstances": "At 0525 eastern daylight time, a Piper Navajo PA-31, registration C-GUVK, serial number 31-7405451, with two pilots on board, took off from Dorval Airport, Quebec, on a three-day charter flight. Two passengers boarded at Rouyn, Quebec, travelling to La Grande Rivière, Quebec. All flight segments over the three-day period were planned in accordance with instrument flight rules. At La Grande Rivière, the aircraft completed a VOR/DME approach to runway 31, but could not land due to weather. A missed approach was executed, and the aircraft proceeded toward the alternate airport, La Grande 4. About 15 nautical miles north of La Grande 3, the engines misfired. The fuel selector lever was reselected, and the engines operated normally for about five minutes, and then stopped. The pilot-in-command declared an emergency and proceeded toward La Grande 3 Airport for an LOC/DME approach to runway 29. The aircraft broke through the cloud layer at approximately 300 feet above ground level and the pilot set the aircraft down in some trees beside a small lake, four nautical miles southeast of La Grande 3 Airport. The accident occurred at 0957. One of the two passengers sustained minor leg injuries. The other occupants were uninjured. They were rescued by helicopter approximately 45 minutes later. The aircraft sustained substantial damage.", "probable_cause": "The crew did not refuel at Rouyn as planned, and did not have sufficient fuel to complete the segment. Contributing to the accident were the following: the crew did not fully understand the flight plan documents and did not calculate fuel consumption en route."}