{"url": "https://www.baaa-acro.com/crash/crash-cessna-401a-gustavus-4-killed", "date": "Jul 13, 2003 at 2135 LT", "type": "Cessna 401", "operator": "Gary Ostler", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Port Angeles – Gustavus", "msn": "401A-0096", "yom": 1969, "flight_number": null, "city": "Gustavus", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 2100, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The private pilot departed on a cross-country personal flight with five passengers, en route to an Alaskan coastal community. The airplane had about 140 gallons of usable fuel aboard. The flight's intended destination was located about 757 nautical miles away. The pilot planned to make one stop in order to purchase fuel before continuing on to the destination airport. As the accident flight progressed towards the intended fuel stop airport, the pilot requested to continue on to another airport located about 100 miles away, and closer to the final destination airport. As the flight neared the second fuel stop airport, the pilot again made a request to the Air Traffic Control (ATC) specialist on duty, and said, in part: \"I'm going to change my destination ah...one more time, this will be the final time...\" The flight was then cleared to the pilot's intended destination airport. When the flight was about 22 miles southeast of the destination airport, the pilot informed the ATC specialist that he was concerned about his remaining fuel. He stated, in part: \" ... I'm really low on fuel, and still 30 miles out.\" When asked by the ATC specialist how much fuel he had remaining, the pilot responded by saying: \" Well... lets see, its very low... Below 5 gallons in both tanks.\" The ATC specialist then informed the pilot of an alternate airport that was located closer to the flight's present position, but the pilot was not familiar with the airport, and he elected to proceed on. Shortly thereafter, the pilot reported to the ATC specialist he was \"...out of gas, both engines.\" The pilot selected a forced landing site located about 12 miles short of his intended destination airport, in open ocean waters. According to the two surviving passengers, after the collision with the water, all of the airplane's occupants lost consciousness momentarily. When the two survivors regained consciousness, there was about 2 feet of water in the airplane, and the airplane was sinking. The survivors said four of the six occupants successfully evacuated the airplane into the water. They added that the pilot was one of the four occupants who exited the sinking airplane. The two remaining occupants remained inside the airplane as it sank. The four survivors then began to swim to the closest shoreline, located about 1 mile from the accident site. During the swim to shore, the two surviving occupants became separated from the other two other occupants. To date, neither the two occupants who remained in the airplane, nor the pilot and the one occupant who were able to exit the airplane before it sank, have been located. ", "probable_cause": "The pilot's inadequate in-flight decision making process, and failure to refuel the airplane prior to fuel exhaustion, which resulted in a total loss of engine power. A factor associated with the accident was the lack of a suitable forced landing site.\n"}