{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-lewisville-1-killed", "date": "Dec 4, 2002 at 0616 LT", "type": "Cessna 402", "operator": "TexStar AirFreight", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Denton - Dallas", "msn": "402C-0010", "yom": 1979, "flight_number": null, "city": "Lewisville", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1290, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16464, "circumstances": "The twin-engine airplane impacted the ground during an uncontrolled descent while maneuvering in dark night instrument meteorological conditions in the vicinity of Lewisville, Texas. The commercial pilot contacted the approach controller and stated that his attitude indicator was \"not helping\" and needed \"a little bit of help with trying to keep it straight.\" The pilot was instructed by approach control to maintain an altitude of 3,000 feet msl. The approach controller confirmed with the pilot that he could not fly headings, and instructed the pilot to turn right. Seconds afterwards, the pilot was instructed to turn left and the controller would tell him when to stop the turn. The pilot acknowledged. There were no further communications between the pilot and air traffic control. The airplane initially impacted in a near vertical attitude into a wooded area adjacent to a rural paved road, slid across the road, and impacted a residence. Radar data showed that the airplane's magnetic heading was erratic throughout the 5-minute flight. The gyro instruments found at the accident site were the copilot's direction gyro (vacuum), a turn and bank indicator (electric), and the pilot's attitude indicator (vacuum). The gyros were disassembled, and visually examined. The co-pilot's direction gyro examination revealed rotation signatures on the gyro and the gyro housing. The turn and bank indicator revealed a \"faint\" rotational signature on the gyro. The pilot's attitude indicator gyro had no rotational signatures, and exhibited blunt impressions corresponding to the gyro buckets on the inside of the gyro-housing wall. A maintenance repair data plate (\"Functional Tested\") was found on the attitude indicator's instrument housing dated 12/2/02. Due to the extent of the fire damage, no instrument readings could be obtained. Seven days prior to the accident flight, a company pilot who flew the accident airplane reported that the pilot's attitude indicator (part number 102-0041-04, serial number 92B0346) \"rotated\" and the flight was aborted. The next day, the attitude indicator was removed and bench checked, cleaned, and adjusted. The attitude indicator was reinstalled and an operational check on the ground was performed. Three days prior to the accident the pilot's attitude indicator was again removed for an overhaul. According to company maintenance personnel, the attitude indicator was reinstalled the night prior to the morning of the accident, and an operational check on the ground was performed. Radar data showed that the aircraft did not stabilize on a particular heading throughout the flight. Physical evidence showed that the pilot's attitude gyro was not \"spooled\" at the time of impact.", "probable_cause": "The failure of the attitude indicator, and the pilot's failure to maintain aircraft control as a result of spatial disorientation following the failure of the attitude indicator. Contributing factors were a low ceiling, clouds, and dark night conditions."}