{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-dalton-1-killed", "date": "Aug 14, 1997 at 0611 LT", "type": "Beechcraft 200 Super King Air", "operator": "Colvin%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Athens - Dalton", "msn": "BB-340", "yom": 1978, "flight_number": null, "city": "Dalton", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2398, "captain_hours_type": 103, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6328, "circumstances": "The pilot was cleared for a localizer approach by Atlanta Center and told to maintain 5,000 feet until crossing the final approach fix (FAF). Normal altitude at the FAF was 2,700 feet. The pilot was unable to land from this approach and performed a missed approach. He was handed off to Chattanooga Approach, then was cleared to cross the FAF at 3,000 feet and perform another localizer approach. About one mile from the FAF, the pilot was told to change to the airport advisory frequency. The pilot acknowledged, then there was no further communication with the aircraft. A short time later, witnesses heard the aircraft crash near the approach end of the runway. Examination of the crash site showed the aircraft had touched down in a grass area about 1,100 feet from the end of the runway, while on the localizer. Propeller slash marks showed both engines were operating at approach power and the aircraft was at approach speed. No evidence of precrash mechanical failure or malfunction of the aircraft structure, flight controls, systems, engines, or propellers was found. The 0621 weather was in part: 300 feet overcast and 1/2 mile visibility with fog. Minimum descent altitude (MDA) for the localizer approach was 1,180 feet msl; airport elevation was 710 feet. The pilot had flown 8 flight hours, was on duty for 13.6 hours the day before the accident, was off duty for about 6 hrs, and had about 4 hours of sleep before the accident flight. ", "probable_cause": "The pilot's improper IFR procedure, by failing to maintain the minimum descent altitude (MDA) during the ILS localizer approach, until the runway environment was in sight, which resulted in a collision with terrain short of the runway. Factors relating to the accident were: darkness, low ceiling, fog, pilot fatigue, and improper scheduling by the aircraft operator. "}