{"url": "https://www.baaa-acro.com/crash/crash-airbus-a300b4-203-kathmandu-167-killed", "date": "Sep 28, 1992 at 1430 LT", "type": "Airbus A300", "operator": "Pakistan%20International%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Karachi - Kathmandu", "msn": "025", "yom": 1976, "flight_number": "PK268", "city": "Kathmandu", "zone": "Bagmati", "country": "Nepal", "region": "Asia", "crew_on_board": 19, "crew_fatalities": 19, "pax_on_board": 148, "pax_fatalities": 148, "other_fatalities": 0, "total_fatalities": 167, "captain_hours": 13186, "captain_hours_type": 6260, "copilot_hours": 5849, "copilot_hours_type": 1469, "aircraft_hours": 39045, "circumstances": "The ill-fated aircraft departed Karachi Airport Pakistan, at 0613 hours UTC on 28 September 1992 as Pakistan International Airlines Flight Number PK 268, a non-stop service to Kathmandu, Nepal. The accident occurred at 0845 UTC (1430 hours local time) when the aircraft struck a mountain during an instrument approach to Kathmandu’s Tribhuvan International Airport. The impact site was at an altitude of 7280 feet above sea level (2890 feet above airport level), 9.16 nautical miles from the VOR/DME beacon and directly beneath the instrument approach track from the VOR/DME beacon (9.76 nm from and 2970 ft above the threshold of Runway 02 which is 77 feet below the airport datum). The flight through Pakistani and Indian airspace appears to have proceeded normally. At 0825 hrs UTC (1410 hrs local time) two-way contact between Pakistan 268 and Kathmandu Area Control West was established on VHF radio and the aircraft was procedurally cleared towards Kathmandu in accordance with its flight plan. After obtaining the Kathmandu weather and airfield details, the aircraft was given traffic information and instructed to report overhead the SIM (Simara) non-directional beacon (214°R  VOR/39 nm from Kathmandu’s KTM VOR/DME) at or above FL150 (flight level on standard altimeter) as cleared by the Calcutta Area Control Centre. At 08:37 hrs the copilot reported that the aircraft was approaching the SIM beacon at FL 150, whereupon procedural clearance was given to continue to position SIERRA (202°R/10 nm from the KTM beacon) and to descend to 11,500 feet altitude. No approach delay was forecast by the area controller and the co-pilot correctly read back both the clearance and the instruction to report at 25 DME. At 08:40:14 hrs, he reported that the aircraft was approaching 25 DME whereupon the crew were instructed to maintain 11,500 feet and change frequency to Kathmandu Tower. Two-way radio contact with the Tower was established a few seconds later and the crew reported that they were in the process of intercepting the final approach track of 022M (Magnetic) of Radial 202 KTM VOR ) They were instructed to expect a Sierra approach and to report at 16 DME. At 08:42:51 hrs the first officer reported “One six due at eleven thousand five hundred”. The tower controller responded by clearing the aircraft for the Sierra approach and instructing the crew to report at 10 DME. At 08:44:27 the first officer reported 10 DME and three seconds later he was asked,  “Report your level”. He replied, “We crossed out of eight thousand five hun,’ two hundred now”. The controller replied with the instruction “Roger clear for final. Report four DME Runway zero two”. The copilot responded to this instruction in a normal, calm and unhurried tone of voice; his reply was the last transmission heard from the aircraft, thirty-two seconds after the copilot reported 10 DME the aircraft crashed into steep, cloud-covered mountainside at 7,280 feet amsl and 9.16 nm on radial 202 of KTM VOR. All 167 occupants were killed. ", "probable_cause": "The balance of evidence suggests that the primary cause of the accident was that one or both pilots consistently failed to follow the approach procedure and inadvertently adopted a profile which, at each DME fix, was one altitude step ahead and below the correct procedure. Why and how that happened could not be determined with certainty because there was no record of the crew's conversation on the flight deck. Contributory causal factors were thought to be the inevitable complexity of the approach and the associated approach chart.\r\nThe following findings were reported:\r\n- The flight deck crew were properly licensed and medically fit,\r\n- The aircraft had been properly maintained and was fit for the flight and the essential aircraft systems were operating normally during the approach,\r\n- The SIERRA approach to Kathmandu is a demanding approach in any wide-bodied aircraft,\r\n- Unlawful interference and extreme weather were not causal factors,\r\n- The crash site was enveloped in cloud at the time of the accident,\r\n- There was no ATC clearance error,\r\n- The VOR DME beacons used for the approach were operating satisfactorily and there was no evidence of failure or malfunction within the aircraft’s DME equipment,\r\n- The aircraft acquired and maintained the correct final approach track but began descent too early and then continued to descend in accordance with an altitude profile which was consistent with being 'one step ahead' and below the correct profile,\r\n- At 16 DME the co-pilot mis-reported the aircraft’s altitude by 1,000 feet,\r\n- The commander did not adhere to the airline’s recommended technique for the final part of the approach which commenced at 10 DME,\r\n- The 10 DME position report requested by the Tower controller was made at an altitude below the minimum safe altitude for that portion of the approach,\r\n- The altitude profile on the Jeppesen approach chart which should have been used by the pilots was technically correct. However, the profile illustrated could not be flown in the A300 at V app, in common with any other wide-bodied jet of similar size and the minimum altitude at some DME fixes was not directly associated with the fix,\r\n- The aircraft did not have control column mounted chartboards,\r\n- As described in the report, there is scope for improving the SIERRA approach procedure and its associated charts,\r\n- Kathmandu was not a frequent destination for PIA’S A300 crews and neither pilot had operated that within the previous two months,\r\n- PIA’s training of air crews, briefing material and self-briefing facilities for the SIERRA approach to Kathmandu leave room for improvement,\r\n- PIA’s route checking and flight operations inspection procedures were ineffective,\r\n- The accident was inevitable 15 seconds before impact,\r\n- The Tower controller requested an altitude report immediately after the co-pilot reported at 10 DME. His failure to challenge the low altitude reported at 10 DME was a missed opportunity to prevent the accident but, even if he had done so, it is doubtful whether the accident could have been averted,\r\n- Some air controllers at Kathmandu had a low-self-esteem and was reluctant to intervene in piloting matters such as terrain separation,\r\n- The GPWS was probably serviceable but failed to warn the crew of impending flight towards high ground because of the combination of elderly equipment and rugged terrain,\r\n- Advice within the aircraft manufacturer’s operating manuals regarding pilot reaction to a GPWS warning was incomplete,\r\n- The MEL was being breached in that PIA wen not supplying their CAA with the required carry-forward defect summaries for analysis, neither was the CAA requesting them."}