{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-500b-grand-canyon", "date": "May 28, 2003 at 1720 LT", "type": "Rockwell Aero Commander 500", "operator": "Joseph L. Ciabattoni", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Grand Canyon - Rialto", "msn": "500-1442-156", "yom": 1964, "flight_number": null, "city": "Grand Canyon-National Park", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 26110, "captain_hours_type": 850, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4587, "circumstances": "The airplane did not gain altitude after takeoff and collided with trees and terrain off the departure end of the runway. Prior to takeoff the pilot received a computerized weather briefing that showed generally good conditions. The tower controller cleared the pilot to taxi to the active runway (runway 21) and issued winds, which were 300 degrees at 10 knots, a direct crosswind. During the initial climb after liftoff, the pilot saw that the airplane had stopped climbing and he asked for and received the wind information again. With the airplane not climbing and headed directly for some trees, the pilot maneuvered the airplane towards a clearing but the left wing hit a tree and the airplane descended into the ground. The pilot reported no mechanical problems with the airframe and engines. The density altitude was calculated to be 9,481 feet. The aircraft's gross weight at the time of takeoff was 6,000 pounds. Review of the Airplane Flight Manual climb performance charts for that aircraft weight at the pressure altitude and reported outside air temperature discloses that the airplane should have had a positive rate of climb of about 1,100 feet per minute. The airport was equipped with a wind information recording system, which had four sensors. Three sensors recorded wind information at ground level only. They were placed, one each, at the approach, middle, and departure ends of the runway. Wind data was recorded every 10 seconds. The system does not have the capability to predict or warn of wind shear events. During the aircraft's departure, the approach end sensor recorded winds at 068 degrees at 1 knot; the middle sensor recorded winds at 293 degrees at 5 knots; and the departure sensor recorded winds at 302 degrees at 2 knots. At the next data sampling (10 seconds later), the departure end sensor recorded a wind increase of 10 knots, and the approach end recorded a wind shift from a headwind to a tailwind at 10 knots. A full analysis of the weather conditions indicated that due to developing convection over the runway the airplane likely encountered a wind shear (increasing tailwind) event that seriously degraded the takeoff and climb performance.", "probable_cause": "The pilot's encounter with a wind shear just after liftoff."}