{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-c-lourdes-de-blanc-sablon-2-killed", "date": "Jan 11, 1994 at 1854 LT", "type": "Piper PA-31-310 Navajo", "operator": "Trans-Côte", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Saint Anthony - Lourdes-de-Blanc-Sablon", "msn": "31-7612033", "yom": 1976, "flight_number": null, "city": "Lourdes-de-Blanc-Sablon", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8000, "captain_hours_type": 1550, "copilot_hours": 1079, "copilot_hours_type": 650, "aircraft_hours": 11050, "circumstances": "On 11 January 1994, the crew were on a chartered round-robin flight on a PA-31 Navajo, between Lourdes-de-Blanc-Sablon airport, Quebec, and St. Anthony, Newfoundland, in accordance with visual flight rules (VFR) . During the return flight, at night, the crew advised the St. Anthony flight service station (FSS) that they departed at 1813 Newfoundland standard time (NST). At 1846 NST, the crew transmitted that they were flying at 2,500 feet and that they were 32 nautical miles (nm) and 13 minutes southeast of Blanc-Sablon. Seven minutes later, the crew called the Sept-Iles FSS through the Blanc-Sablon repeater. They requested airport information and reported being 16 nm and six minutes from the airport. After receiving information on the winds and the altimeter setting, the crew reported that they would use runway 05 and would call back on final. No further transmissions were received from the crew. Fishermen found the wreckage seven months later. ", "probable_cause": "The cause of the occurrence could not be determined; however, it is probable that the pilots did not monitor the altimeter properly and allowed the aircraft to descend until it struck the surface of the ice."}