{"url": "https://www.baaa-acro.com/crash/crash-antonov-12b-krasnoyarsk-13-killed", "date": "Nov 11, 1998 at 1122 LT", "type": "Antonov AN-12", "operator": "Vilyui", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Novosibirsk - Krasnoyarsk - Mirny", "msn": "8 3 455 06", "yom": 1968, "flight_number": "YR9301", "city": "Krasnoyarsk-Yemelyanovo (Severny)", "zone": "Krasnoyarsk Krai", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was completing a cargo flight from Novosibirsk to MIrny with an intermediate stop in Krasnoyarsk, carrying six passengers, seven crew members and a load of 13,380 kilos of various goods consisting of food, tobacco, clothing and footwear. Weather conditions were marginal with snow falls and icing conditions. During the takeoff roll, after a course of 2,400 metres, the pilot-in-command started the rotation at a speed of 280 km/h. After liftoff, the aircraft started to roll left and right but the crew was able to continue to climb with a rate of about 4 metres per second. During initial climb, at a height of 150 metres and at a speed of 330 km/h, the crew raised the flaps. At this time, the aircraft started to lose height, entered an uncontrolled descent, collided with trees and crashed in a wooded area located 5 km from the airport. The aircraft was totally destroyed by impact forces and a post crash fire and all 13 occupants were killed. ", "probable_cause": "Loss of control during initial climb after the crew raised the flaps due to the presence of severe icing conditions which impaired the controllability of the aircraft and its aerodynamic characteristics. The short distance between the aircraft and the ground did not allow the crew to expect recovery."}