{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-440-metropolitan-bishop-36-killed", "date": "Mar 13, 1974 at 2028 LT", "type": "Convair CV-440 Metropolitan", "operator": "Sierra%20Pacific%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Bishop - Burbank", "msn": "138", "yom": 1953, "flight_number": "SZ802", "city": "Bishop", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 32, "pax_fatalities": 32, "other_fatalities": 0, "total_fatalities": 36, "captain_hours": 9902, "captain_hours_type": 1742, "copilot_hours": 2845, "copilot_hours_type": 2500, "aircraft_hours": 41112, "circumstances": "The aircraft was chartered by Wolper Productions Inc. to fly a movie production crew from Bishop (BIH) to Burbank (BUR). The cast and crew of the television series 'Primal Man' was returning from shooting a prehistoric hunting sequence in the snow-covered Sierra. Amongst the crew were director-writer Dennis Azzarella and actor Janos Prohaska. Flight 802 departed Hollywood-Burbank Airport at 18:14 to pick up the passengers at Bishop. The flight from Burbank to Bishop was conducted under VFR conditions and at 19:10 the crew contacted the Tonopah Flight Service Station (FSS) and cancelled their VFR flight plan. The crew then \"air filed\" an IFR flight plan for the return trip from Bishop to Burbank. The aircraft landed at Bishop at 19:20. Baggage and equipment were loaded and 32 passengers boarded the flight. The Convair CV-440 departed the gate at about 20:20. The crew then contacted the Tonopah FSS and advised that they were taxiing for departure and requested that their IFR clearance be activated. After takeoff from runway 12 the flight made a climbing right turn, circled back over, or near, the BIH VOR and then proceeded outbound in an east-southeasterly direction. At 20:24 Flight 802 again contacted the Tonopah FSS and reported that they were off Bishop at 20:20 and were, \"climbing VFR over Bishop, awaiting clearance.\" About four minutes later the aircraft struck a foothill in the White Mountain range at an elevation of 6,100 feet. The aircraft was on a heading of about 175° magnetic and in an approximate 25° bank to the right at impact. All 36 occupants were killed. ", "probable_cause": "It was not possible to determine the probable cause of this accident. The reason why the flight crew did not maintain a safe distance from hazardous terrain during night visual flight conditions could not be established."}