{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-7h4-new-york", "date": "Jul 22, 2013 at 1744 LT", "type": "Boeing 737-700", "operator": "Southwest-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nashville – New York", "msn": "29848/400", "yom": 1999, "flight_number": "WN345", "city": "New York-LaGuardia", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 145, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12522, "captain_hours_type": 7909, "copilot_hours": 5200, "copilot_hours_type": 1100, "aircraft_hours": 49536, "circumstances": "As the airplane was on final approach, the captain, who was the pilot monitoring (PM), realized that the flaps were not configured as had been briefed, with a setting of 40 degrees for the landing. Data from the flight data recorder (FDR) indicate that the captain set the flaps to 40 degrees as the airplane was descending through about 500 ft altitude, which was about 51 seconds from touchdown. When the airplane was between 100 to 200 ft altitude, it was above the glideslope. Concerned that the airplane was too high, the captain exclaimed repeatedly \"get down\" to the first officer about 9 seconds from touchdown. About 3 seconds from touchdown when the airplane was about 27 ft altitude, the captain announced \"I got it,\" indicating that she was taking control of the airplane, and the first officer replied, \"ok, you got it.\" According to FDR data, after the captain took control, the control column was relaxed to a neutral position and the throttles were not advanced until about 1 second before touchdown. The airplane touched down at a descent rate of 960 ft per minute and a nose-down pitch attitude of -3.1 degrees, resulting in the nose gear contacting the runway first and a hard landing. The airplane came to a stop on the right side of the runway centerline about 2,500 ft from its initial touchdown. The operator's stabilized approach criteria require an immediate go-around if the airplane flaps or landing gear were not in the final landing configuration by 1,000 ft above the touchdown zone; in this case, the flaps were not correctly configured until the airplane was passing through 500 ft. Further, the airplane's deviation about the glideslope at 100 to 200 ft would have been another opportunity for the captain, as the PM at this point during the flight, to call for a go-around, as indicated in the Southwest Airlines Flight Operations Manual (FOM). Accident data suggest that pilots often fail to perform a go-around or missed approach when stabilized approach criteria are not met. A review of NTSB investigated accidents by human factors researchers found that about 75% of accidents were the result of plan continuation errors in which the crew continued an approach despite cues that suggested it should not be continued. Additionally, line operations safety audit data presented at the International Air Safety Summit in 2011 suggested that 97% of unstabilized approaches were continued to landing even though doing so was in violation of companies' standard operating procedures (SOPs). The Southwest FOM also states that the captain can take control of the airplane for safety reasons; however, the captain's decision to take control of the airplane at 27 ft above the ground did not allow her adequate time to correct the airplane's deteriorating energy state and prevent the nose landing gear from striking the runway. The late transfer of control resulted in neither pilot being able to effectively monitor the airplane's altitude and attitude. The first officer reported that, after the captain took control of the airplane, he scanned the altimeter and airspeed to gain situational awareness but that he became distracted by the runway \"rushing\" up to them and \"there was no time to say anything.\" The captain should have called for a go-around when it was apparent that the approach was unstabilized well before the point that she attempted to salvage the landing by taking control of the airplane at a very low altitude. In addition, the captain did not follow SOPs at several points during the flight. As PM, she should have made the standard callout per the Southwest FOM when the airplane was above glideslope, stating \"glideslope\" and adding a descriptive word or words to the callout (for example, \"one dot high\"). Rather than make this callout, however, the captain repeatedly said \"get down\" to the first officer before stating \"I got it.\" The way she handled the transfer of airplane control was also contrary to the FOM, which indicates that the PM should say \"I have the aircraft.\" The flight crew's performance was indicative of poor crew resource management.", "probable_cause": "The captain's attempt to recover from an unstabilized approach by transferring airplane control at low altitude instead of performing a go-around. Contributing to the accident was the captain's failure to comply with standard operating procedures.\n"}