{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-norman-2-killed", "date": "Dec 10, 2000 at 0448 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Four Twenty One", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Altus - Norman", "msn": "421B-0254", "yom": 1972, "flight_number": null, "city": "Norman-University of Oklahoma Westheimer", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 10000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5315, "circumstances": "According to air traffic control communication and radar data, the flight was VFR over the top, approximately 7,900 feet, and requested an IFR clearance to the destination airport. The flight was issued an IFR clearance and, subsequently, was cleared for the localizer runway 03 approach. Radar data indicates that the airplane intercepted the localizer and began tracking inbound. Once the airplane reached the final approach fix, the airplane entered a shallow descent, but did not reach the MDA until after passing the missed approach point (MAP). The airplane flew past the MAP, continued to descend and over flew the runway. The final radar return was captured at 1,200 feet and one mile northeast of the airport, where the airplane was later located. The weather observation facility located at the airport reported that, 11 minutes before the accident, the winds were from 140 degrees at 6 knots, ceiling 200 feet overcast, visibility 1/4 miles in fog, temperature 45 degrees Fahrenheit and dew point 45 degrees Fahrenheit. A person who was at the airport at the time of the accident reported that the \"clouds were low and visibility was poor.\" Toxicological testing performed on the pilot by the FAA's Civil Aeromedical Institute, Oklahoma City, Oklahoma, revealed the following: 0.121 (ug/ml, ug/g) amphetamine detected in blood, 0.419 (ug/ml, ug/g) amphetamine detected in liver, amphetamine detected in kidney, 4.595 (ug/ml, ug/g) methamphetamine detected in blood, 5.34 (ug/ml, ug/g) methamphetamine detected in liver, 3.715 (ug/ml, ug/g) methamphetamine detected in kidney, pseudoephedrine present in blood, and pseudoephedrine present in liver. The airframe and engines were examined and no anomalies were discovered that would have affected operation of the flight. ", "probable_cause": "The pilot's failure to follow the instrument approach procedure and his continued descent below the prescribed minimum descent altitude (MDA). Contributory factors were the pilot's physical impairment from drugs, the low ceiling, fog, and dark night light conditions. "}