{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-524-jakarta-62-killed", "date": "Jan 9, 2021 at 1440 LT", "type": "Boeing 737-500", "operator": "Sriwijaya-Air", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Jakarta - Pontianak", "msn": "27323/2616", "yom": 1994, "flight_number": "SJY182", "city": "Jakarta", "zone": "City District of Jakarta", "country": "Indonesia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 56, "pax_fatalities": 56, "other_fatalities": 0, "total_fatalities": 62, "captain_hours": 17904, "captain_hours_type": 9023, "copilot_hours": 5107, "copilot_hours_type": 4957, "aircraft_hours": 62983, "circumstances": "On 9 January 2021, a Boeing 737-500 aircraft, registration PK-CLC, was being operated by PT. Sriwijaya Air on a scheduled passenger flight from Soekarno-Hatta International Airport (WIII), Jakarta to Supadio International Airport (WIOO), Pontianak . The flight number was SJY182. According to the flight plan filed, the fuel endurance was 3 hours 50 minutes. At 0736 UTC (1436 LT) in daylight conditions, Flight SJY182 departed from Runway 25R of Jakarta. There were two pilots, four flight attendants, and 56 passengers onboard the aircraft. At 14:36:46 LT, the SJY182 pilot contacted the Terminal East (TE) controller and was instructed “SJY182 identified on departure, via SID (Standard Instrument Departure) unrestricted climb level 290”. The instruction was read back by the pilot. At 14:36:51 LT, the Flight Data Recorder (FDR) data recorded that the Autopilot (AP) system engaged at altitude of 1,980 feet. At 14:38:42 LT, the FDR data recorded that as the aircraft climbed past 8,150 feet, the thrust lever of the left engine started reducing, while the thrust lever position of the right engine remained. The FDR data also recorded the left engine N1 was decreasing whereas the right engine N1 remained. At 14:38:51 LT, the SJY182 pilot requested to the TE controller for a heading change to 075° to avoid weather conditions and the TE controller approved the request. At 14:39:01 LT, the TE controller instructed SJY182 pilot to stop their climb at 11,000 feet to avoid conflict with another aircraft with the same destination that was departing from Runway 25L. The instruction was read back by the SJY182 pilot. At 14:39:47 LT, the FDR data recorded the aircraft’s altitude was about 10,600 feet with a heading of 046° and continuously decreasing (i.e., the aircraft was turning to the left). The thrust lever of the left engine continued decreasing. The thrust lever of the right engine remained. At 14:39:54 LT, the TE controller instructed SJY182 to climb to an altitude of 13,000 feet, and the instruction was read back by an SJY182 pilot at 14:39:59 LT. This was the last known recorded radio transmission by the flight. At 14:40:05 LT, the FDR data recorded the aircraft altitude was about 10,900 feet, which was the highest altitude recorded in the FDR before the aircraft started its descent. The AP system then disengaged at that point with a heading of 016°, the pitch angle was about 4.5° nose up, and the aircraft rolled to the left to more than 45°. The thrust lever position of the left engine continued decreasing while the right engine thrust lever remained. At 14:40:10 LT, the FDR data recorded the autothrottle (A/T) system disengaged and the pitch angle was more than 10° nose down. About 20 seconds later the FDR stopped recording. The last aircraft coordinate recorded was 5°57'56.21\" S 106°34'24.86\" E. At 14:40:37 LT, the TE controller called SJY182 to request for the aircraft heading but did not receive any response from the pilot. At 14:40:48 LT, the radar target of the aircraft disappeared from the TE controller radar screen. At 14:40:46 LT, the TE controller again called SJY182 but did not receive any response from the pilot. The TE controller then put a measurement vector on the last known position of SJY182 and advised the supervisor of the disappearance of SJY182. The supervisor then reported the occurrence to the operation manager. The TE controller repeatedly called SJY182 several times and also asked other aircraft that flew near the last known location of SJY182 to call the SJY182. The TE controller then activated the emergency frequency of 121.5 MHz and called SJY182 on that frequency. All efforts were unsuccessful to get any responses from the SJY182 pilot. About 1455 LT, the operation manager reported the occurrence to the Indonesian Search and Rescue Agency (Badan Nasional Pencarian dan Pertolongan/BNPP). At 1542 LT, the Air Traffic Services (ATS) provider declared the uncertainty phase (INCERFA) of the SJY182. The distress phase of SJY182 (DETRESFA) was subsequently declared at 1643 LT.", "probable_cause": "The following contributing factors were identified:\r\n• The corrective maintenance processes of the A/T problem were unable to identify the friction or binding within the mechanical system of the thrust lever and resulted in the prolonged and unresolved of the A/T problem.\r\n• The right thrust lever did not reduce when required by the A/P to obtain selected rate of climb and aircraft speed due to the friction or binding within the mechanical system, as a result, the left thrust lever compensated by moving further backward which resulted in thrust asymmetry.\r\n• The delayed CTSM activation to disengage the A/T system during the thrust asymmetry event due to the undervalued spoiler angle position input resulted in greater power asymmetry.\r\n• The automation complacency and confirmation bias might have led to a decrease in active monitoring which resulted in the thrust lever asymmetry and deviation of the flight path were not being monitored.\r\n• The aircraft rolled to the left instead of to the right as intended while the control wheel deflected to the right and inadequate monitoring of the EADI might have created assumption that the aircraft was rolling excessively to the right which resulted in an action that was contrary in restoring the aircraft to safe flight parameters.\r\n• The absence of the guidance of the national standard for the UPRT, may have contributed to the training program not being adequately implemented to ensure that pilots have enough knowledge to prevent and recover of an upset condition effectively and timely."}