{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-1-dk-mergui", "date": "Jan 10, 1953", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Union-of-Burma-Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rangoon – Tavoy – Mergui", "msn": "14373/25818", "yom": 1944, "flight_number": null, "city": "Mergui", "zone": "Tanintharyi Region", "country": "Myanmar", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 15, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The accident took place while the aircraft was approaching to land at Mergui Airstrip on Runway 01 on a schedule Rangoon - Tavoy - Mergui flight with 15 passengers and 3 crew. The port wing of the aircraft hit trees on its final approach and the aircraft landed heavily about 820 feet from the threshold of the runway. On impact with the ground, the starboard engine became detached from the aircraft and the aircraft ran along on its port wheels and starboard propeller approximately 270 feet and finally came to rest about 475 feet from the threshold and approximately 50 feet from the edge of the runway. Fire broke out on the starboard side, possibly due to severed fuel lines and electrical short circuits. The fire consumed the forward portion of the aircraft up to the main rear entrance door. The wings sustained damage but were not consumed by the fire. The crew and passengers were safely evacuated although two of the passengers sustained minor injuries. The fire fighting equipment at the aerodrome was totally inadequate and the local fire brigade with its 400 gallons of plain water could not save the aircraft. ", "probable_cause": "The crash was attributed to an error of judgment on the part of the pilot, but there was nothing in the evidence to show what may have caused the error nor is there any evidence to show that the error was caused by negligence on the part of the pilot. "}