{"url": "https://www.baaa-acro.com/crash/crash-cessna-340-bartow-5-killed", "date": "Dec 24, 2017 at 0717 LT", "type": "Cessna 340", "operator": "Aviation Transportation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bartow – Key West", "msn": "340-0214", "yom": 1973, "flight_number": null, "city": "Bartow", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 1600, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1607, "circumstances": "The instrument-rated private pilot and four passengers boarded the multiengine airplane inside a hangar. The pilot then requested that the airplane be towed from the hangar to the ramp, since he did not want to hit anything on the ramp while taxiing in the dense fog. Witnesses heard the pre-takeoff engine run-up toward the end of the runway but could not see the airplane as it departed; the engines sounded normal during the run-up and takeoff. A witness video recorded the takeoff but the airplane was not visible due to the dense fog. During the takeoff roll the airplane's tires chirped, which is consistent with the wheels touching down on the runway with a side load. The video ended before the accident occurred. The witnesses stated that the takeoff continued and then they heard the airplane impact the ground and saw an explosion. The weather conditions at the time of the accident included visibility less than 1/4 mile in fog and an overcast ceiling at 300 ft above ground level. The airplane's weight at the time of the accident was about 105 lbs over the maximum takeoff weight, which exceeded the center of gravity moment envelope. The excess weight would have likely extended the takeoff roll, decreased the climb rate, and increased the amount of elevator pressure required to lift off of the runway. A majority of the airplane was consumed by postcrash fire. The ground impact marks and wreckage distribution were consistent with the airplane rolling left over the departure end of the runway and impacting the ground inverted in a nearly vertical, nose-low attitude. Examination of the engines revealed operating signatures consistent with takeoff power at the time of impact. The elevator trim tab and actuator were found beyond their full up travel limits and the trim cable exhibited tension overload separations near the actuator. It is likely that, when the cable separated in overload, the chain turned the sprocket and extended the actuator rod beyond full travel. No anomalies were observed with the airframe, engines, or cockpit instrumentation that would have precluded normal operation. The investigation was unable to determine the status of the autopilot during the accident takeoff. Based on the evidence it's likely that when the airplane entered instrument meteorological conditions the pilot experienced spatial disorientation, which resulted in a loss of control and descent into terrain.", "probable_cause": "The pilot's loss of control due to spatial disorientation during takeoff in instrument meteorological conditions."}