{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-25-dk-near-tofte-34-killed", "date": "Nov 20, 1949 at 1656 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Aero-Holland", "flight_phase": "Landing (descent or approach)", "flight_type": "Humanitarian", "survivors": "Yes", "site": "Mountains", "schedule": "Tunis – Brussels – Oslo", "msn": "13462", "yom": 1944, "flight_number": null, "city": "Tofte", "zone": "Buskerud", "country": "Norway", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 31, "pax_fatalities": 30, "other_fatalities": 0, "total_fatalities": 34, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1697, "circumstances": "The aircraft was flying from Tunis to Oslo via Brussels, carrying 28 Jewish children from Tunisia on their way to Norway, as an intermediary stop before making aliyah, the return to Israel. After passing The Netherlands, the crew continued at an altitude of 3,000 feet and was informed that weather conditions at destination was considered as good with a visibility of 12 km under the cloud layer. Approaching Oslo from the south at 1650LT, the crew requested a QDM bearing that was transmitted by ATC three minutes later. Despite the presence of several clouds layers and poor visibility, the crew continued the approach and reduced his altitude when the aircraft hit the slope of a hill and crashed in a wooded area located about 8 km north of Tofte, some 32 km south of Fornebu Airport. As all radio transmissions were interrupted and the aircraft failed to arrive, SAR operations were conducted but the rescuers found the wreckage two days later only. On site, a young boy aged 12 was found alive and transferred to a hospital in Oslo while all 34 other occupants were killed. ", "probable_cause": "It was determined that the crew took the decision to continue the approach to Oslo-Fornebu Airport in VFR mode in IMC conditions. Due to poor visibility caused by several cloud layers at 400, 750 and 900 meters, the crew was unable to distinguish the hilly terrain. "}