{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-749a-constellation-natuna-besar-island-16-killed", "date": "Apr 11, 1955 at 1625 LT", "type": "Lockheed L-749 Constellation", "operator": "Air-India", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "New Delhi – Hong Kong – Jakarta", "msn": "2666", "yom": 1951, "flight_number": null, "city": "Natuna Besar Island", "zone": "Riau Islands", "country": "Indonesia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 5, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off from Hong Kong-Kai Tak Airport bound for Jakarta at 0425 hours Greenwich Mean Time carrying 8 crew members and 11 passengers. The flight was uneventful until approximately five hours after take-off when a muffled explosion was heard in the aircraft while cruising at an altitude of 18,000 feet over the sea. Smoke started entering the cabin through the cold air ducts almost immediately and a localized fire was detected soon after on the starboard wing behind the number three engine nacelle. A rapid descent was commenced for ditching the aircraft and distress signals broadcast. In spite of fire fighting action, during which No. 3 engine was feathered, the fire spread very rapidly and caused hydraulic failure followed by electrical failure. During the final stages of the descent, executed under extremely difficult circumstances, dense smoke entered the cockpit reducing the visibility to almost nil. The aircraft impacted the water with the starboard wing tip, and the nose submerged almost instantaneously. Only three crew members survived the accident. The aircraft was destroyed. All passengers were Chinese and European journalists flying to Jakarta to take part to the Asia-Afro Bandung Conference. ", "probable_cause": "The cause of this accident was an explosion of a timed infernal machine placed in the starboard wheel well of the aircraft. This explosion resulted in the puncturing of No. 3 fuel tank and an uncontrollable fire. It is believed that the Chinese Premier Zhou Enlai was the target of this act of sabotage. His travel plans had been kept secret and he left China three days later. "}