{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-nassau", "date": "Apr 3, 2002 at 1210 LT", "type": "Cessna 402", "operator": "Southstream Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Nassau - Bimini", "msn": "402B-1066", "yom": 1976, "flight_number": null, "city": "Nassau-Lynden Pindling", "zone": "New Providence", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On April 3, 2002, about 1210 eastern standard time, a Cessna 402B, N768WC, registered to and operated by Southstream Aviation, Inc., was ditched in Coral Harbor Lake, southwest of the Nassau International Airport, Nassau, Bahamas. Visual meteorological conditions prevailed at the time and a VFR flight plan was filed for the 14 CFR Part 91 personal flight to Bimini, Bahamas. The airplane was substantially damaged and the commercial-rated pilot and a passenger were not injured. The flight originated about 6 minutes earlier from the Nassau International Airport. According to the passenger who is a U.S. certificated pilot, the airplane was fueled before takeoff. He checked the fuel tanks for contaminants after fueling; none were found. The flight departed from runway 14, then when turning on course to Bimini, the left engine sputtered. The pilot reduced then increased power from the left engine which then quit. He noted at that time the manifold and fuel pressure indications were decreasing. The pilot then turned back towards the Nassau airport to return when the right engine quit. Unable to return to the airport, the pilot ditched the airplane in the lake; the airplane remained upright in the approximately 1-4 feet deep water. Both occupants exited the airplane unaided. The accident site was located approximately 2.6 nautical miles southwest of the Nassau International Airport.", "probable_cause": null}