{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-113c-london-50-killed", "date": "Jan 5, 1969 at 0134 LT", "type": "Boeing 727-100", "operator": "Ariana%20Afghan%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Kabul - Kandahar - Beirut - Istanbul - Frankfurt - London", "msn": "19690/540", "yom": 1968, "flight_number": "FG701", "city": "London-Gatwick", "zone": "West Sussex", "country": "United Kingdom", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 5, "pax_on_board": 54, "pax_fatalities": 43, "other_fatalities": 2, "total_fatalities": 50, "captain_hours": 10400, "captain_hours_type": 512, "copilot_hours": 3259, "copilot_hours_type": 210, "aircraft_hours": 1715, "circumstances": "The accident occurred on a scheduled passenger flight from Frankfurt when the aircraft was making an ILS approach for a night landing on Runway 27 at Gatwick Airport. The weather was clear except that freezing fog persisted in places including the Gatwick area. The runway visual range (RVR) at Gatwick was 100 metres. The approach was commenced with the autopilot coupled to the instrument landing system (ILS) but after the glide-slope had been captured the commander who was at the controls, disconnected the autopilot because the \"stabiliser out of trim\" warning light illuminated. At the outer marker the flap setting was changed from 1° to 30° and shortly afterwards the rate of descent increased and the aircraft descended below the glide-slope. Some 200 feet from the ground the pilot realised that the aircraft was too low and initiated a missed approach procedure. The aircraft began to respond but the descent was not arrested in time to avoid a collision with trees and a house that destroyed both the aircraft and the house and set the wreckage on fire. 48 occupants as well as two people in the house were killed. 14 others were injured. The aircraft was totally destroyed by impact forces and a post crash fire. ", "probable_cause": "The accident was the result of the commander inadvertently allowing the aircraft to descend below the glide slope during the final stage of an approach to land until it was too low for recovery to be effected. The following findings were reported:\r\n- The deceptive nature of the weather conditions led the commander to an error of judgment in deciding to make an approach to Gatwick,\r\n- The commander's decision to conduct an approach was not in itself a cause of the accident,\r\n- Incorrect flap configuration at glide-slope interception led to a temporary out-of-trim condition during the automatic approach and the illumination of the stabilizer \"out-of-trim\" warning light,\r\n- The commander interpreted the \"out-of-trim\" warning light as indicating a possible malfunction and disconnected the auto-pilot,\r\n- Out-of-sequence and late selection of 30° flaps from 15° while the-aircraft was being flown manually resulted in an increase in the rate of descent, causing the aircraft to go rapidly below the glide-slope,\r\n- The commander did not become aware of the deviation from the glide-slope until it was too late to effect a full recovery,\r\n- The pilot's attention was probably directed outside the aircraft at the critical time in an attempt to discover sufficient visual reference to continue the approach rather than to the flight instruments,\r\n- Monitoring by precision approach radar would have warned the pilots of the deviation in time, if corrective action was taken promptly, to avoid the accident."}