{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh104-dove-1-formosa-6-killed", "date": "Feb 26, 1955 at 1550 LT", "type": "De Havilland DH.104 Dove", "operator": "Gouvernement%20Argentin", "flight_phase": "Takeoff (climb)", "flight_type": "Government", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "04094", "yom": 1947, "flight_number": null, "city": "Formosa", "zone": "Formosa", "country": "Argentina", "region": "South America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft on a personnel transfer flight was taking off at approximately 1550LT from Formosa-El Picú Airport with 4 passengers and 3 crew on board. It was observed to run for about 800 meters along the runway, rising only slightly a few meters before the end of the run. It then hit a runway end marker, the wire fence surrounding the aerodrome and a telephone pole, touching the ground twice. After demolishing another wire fence, it came to rest against a small hill and caught fire. Six of the occupants were killed instantly while the copilot Cpt Alberto Manuel González was seriously injured. He died some months later from burns sustained. The airplane was owned and operated by the Dirección Nacional de Aviación Civil (DINACIA).", "probable_cause": "The accident was due to the inability of the aircraft to reach its takeoff speed after a run of 800 meters on the runway, because of: \n- Insufficient driving power for operation, resulting from: \n     - Reduction in power in one or both engines from premature ignition and detonation, originating in the use of spark plugs inappropriate to the engine type,\n     - Probable reduction in the rpm rate of the engines during the takeoff run; following unnoticed slipping of the propeller controls,\n- Overloading of the aircraft in relation to maximum authorized takeoff weight,\n- The circumstances in which the operation was carried out indicate that the weather conditions in relation to the characteristics of the runway were a contributing cause of the accident."}