{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-gii-near-keningau-12-killed", "date": "Sep 4, 1991 at 1411 LT", "type": "Gulfstream GII", "operator": "Conoco", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Mountains", "schedule": "Tokyo - Kota Kinabalu - Jakarta", "msn": "143", "yom": 1974, "flight_number": null, "city": "Keningau", "zone": "Sabah", "country": "Malaysia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Tokyo-Narita Airport on a flight to Jakarta with a fuel stop at Kota Kinabalu Airport, carrying nine passengers and three crew members, among them four corporate members of the Conoco Group that leased the aircraft from DuPont de Nemours. Following an uneventful flight from Tokyo, the crew started the descent to Kota Kinabalu after being cleared to 10,000 then  5,000 feet. ATC instructed the crew to follow a route to the south (180°) and after passing VJN VOR at 4,000 feet, the crew could expect a clearance for an approach to runway 02. While descending to 4,000 feet, the aircraft disappeared from radar screens after it struck the slope of a mountain located in the Crocker Mountain Range, about 9 km northwest of Keningau and 57 km south of Kota Kinabalu Airport. The aircraft was destroyed upon impact and all 12 occupants were killed. ", "probable_cause": "The accident was the consequence of a series of error and omissions on part of the flying crew, resulting in a controlled flight into terrain. \r\nThe following contributing factors were reported:\r\n- The pilots did not slow the aircraft to approach speed when directed by ATC (Event69). This error put the aircraft over VJN VOR/DME approximately 15 minutes earlier than ATC expected. The average ground speed inbound to the VOR/DME, between Event65 (DME 37 nmi) and Event104 (DME 0.0 nmi), was 400 knots.\r\n- The pilots did not descend according to the published descent profile for their arrival sector. If the pilots had done this the aircraft would have been at 4,000 feet altitude over the VJN VOR/DME and in position for the initial approach segment for a VOR/DME approach procedure.\r\n- The CVR recording indicates the pilots did not consider any published approach other than the ILS approach. Nevertheless, the pilots did not specifically request the ILS approach.\r\n- The radiotelephone communication methods used by copilot Johnston were sloppy and not compliant with ICAO standards. Specifically, Johnston indicated to ATC he understood and would comply with the ATC directive to descend over the VJN VOR/DME to 9,500 feet. He did this by repeating (part of) the directive at Event118 suggesting to ATC he understood the directive and would comply.\r\n- The pilots did not ask for clarification on the ATC directive to “descend south of the airfield” and put the aircraft on a heading 180o. The aircraft ground track suggested by Frank Petersen in his deposition and in his report titled “REPORT OF INVESTIGATION INTO THE ACCIDENT INVOLVING N204C” (April 24, 1992) has the aircraft flying outbound from the VJN VOR/DME on the 180° radial. This ground track can not be correct since it would put the aircraft 3 nmi east of the crash site at the time the pilots initiated the right turn. The 3 nmi distance could not have been covered in the 25 seconds between initiating the right turn and the impact. (At 230 knots it would take over 46 seconds to cover this distance.) Furthermore, the aircraft would have crashed before it did into the mountains along the 180° radial from the VJN VOR/DME.\r\n- The cockpit conversation at Event179 indicates both pilots saw high terrain 52 seconds before impact. At this time the aircraft was less than 1 nmi from eye-level hills at 4,000 feet and less than 1.7 nmi from a peak at 4,875 feet. The pilots should have realized they were violating IFR approach procedures. (At this time of day the cloud cover near these hills would have been broken with cloud bases above 4,000 feet.) The pilots made no comment to ATC about the terrain or the cloud conditions.\r\nSource: DuPont GII N204C Crash by Roger K. Parsons - Seagull Publishing, Houston, TX"}