{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-211-warsaw-2-killed", "date": "Sep 14, 1993 at 1643 LT", "type": "Airbus A320", "operator": "Lufthansa-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Frankfurt - Warsaw", "msn": "105", "yom": 1990, "flight_number": "LH2904", "city": "Warsaw-Okęcie-Frederic Chopin", "zone": "Masovian Voivodeship (Mazowieckie)", "country": "Poland", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 1, "pax_on_board": 64, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 12778, "captain_hours_type": 1440, "copilot_hours": 11361, "copilot_hours_type": 1595, "aircraft_hours": 7546, "circumstances": "Following an uneventful flight from Frankfurt, the crew started the descent to Warsaw-Okecie Airport in poor weather conditions with thunderstorm activity, wind shear, rain falls and CB's. After being cleared to land on runway 11, the wind component changed during the last seconds. The right main gear touched down 770 metres past the runway threshold (aircraft's speed was 170 knots). The left main gear touched down 9 seconds later, 1,525 metres past the runway threshold. On a wet runway, the crew started the braking procedure and activated the thrust reversers and spoilers but the remaining distance was insufficient. At a speed of 72 knots, the aircraft overran, went down an embankment, lost its left engine and came to rest 90 metres further, bursting into flames. A female passenger and the captain were killed while all other occupants were rescued, among them 51 were seriously injured. The aircraft was destroyed by a post crash fire. ", "probable_cause": "Cause of the accident were incorrect decisions and actions of the flight crew taken in situation when the information about windshear at the approach to the runway was received. Wind shear was produced by the front just passing the aerodrome; the front was accompanied by intensive variation of wind parameters as well as by heavy rain on the aerodrome itself. Actions of the flight crew were also affected by design features of the aircraft which limited the feasibility of applying available braking systems as well as by insufficient information in the aircraft operations manual (AOM) relating to the increase of the landing distance."}