{"url": "https://www.baaa-acro.com/crash/crash-cessna-560xls-citation-excel-plainville-4-killed", "date": "Sep 2, 2021 at 0951 LT", "type": "Cessna 560XLS Citation Excel", "operator": "Brook Haven Properties", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "City", "schedule": "Plainville – Manteo", "msn": "560-6026", "yom": 2009, "flight_number": null, "city": "Plainville-Robertson", "zone": "Connecticut", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On September 2, 2021, at 0951 eastern daylight time, a Cessna 560XL airplane, N560AR, was destroyed when it was involved in an accident near Farmington, Connecticut. The two pilots and two passengers were fatally injured. One person on the ground sustained serious injuries and three people sustained minor injuries. The airplane was operated as a Title 14 Code of Federal Regulations Part 91 personal flight. The flight crew had filed an instrument flight rules (IFR) flight plan from Robertson Field Airport (4B8), Plainville, Connecticut to Dare County Regional Airport (MQI), Manteo, North Carolina. After obtaining their IFR clearance from air traffic control, the flight crew taxied the airplane onto runway 2 for departure. Two witnesses observed the takeoff roll with one reporting the airplane was “going slower” than they had seen during previous takeoffs. When the airplane was about 2/3 down the runway, one witness noted a puff of blue colored smoke from the back side of the airplane. The other witness stated that the nose landing gear was still on the ground as the airplane passed a taxiway intersection near the mid-point of the runway and he said to a friend with him that something was wrong. A third witness, who was beyond the departure end of the runway, noted the airplane departed the runway in a level attitude. After clearing the runway, the airplane’s nose pitched up, but the airplane was not climbing. The airplane then impacted a powerline pole, which caused a small explosion near the right engine followed by a shower of softball-size sparks. After hitting the pole, the noise of the engine went from normal sounding to a much more grinding, metallic sound. The airplane then began to oscillate about its pitch and roll axis before the witness lost sight of it behind trees. Postaccident examination of the 3,665-ft-long runway revealed tire skid marks from the right main landing gear tire that were right of the runway centerline beginning about 2,360 ft from the approach end of the runway. The mark from the right tire continued, while a mark from the left main landing gear tire was noted left of runway centerline beginning about 2,480 ft from the approach end of the runway. The marks from both main landing gear tires continued and veered slightly to the right but were continuous from where first observed to the end of the runway and onto a short width of grass immediately adjacent to the departure end of the runway. The grassy terrain beyond the departure end of the runway then sloped steeply downward toward a road, and the elevation change between the runway area and the road was about 20 ft. An approximate 3-ft-long section of airplane’s right inboard flap was found near the damaged power pole, which was located about 361 ft beyond the departure end of the runway. A ground scar was located in a grassy area adjacent to a building, about 850 ft north of the damaged power pole. The airplane subsequently impacted the building, and the cockpit, cabin, and wings were nearly consumed by the postimpact fire; the aft empennage, which remained outside the building, was relatively intact. Examination of the airframe revealed no evidence of any anomalies with any of the airplane’s primary or secondary flight control surfaces. Additionally, the parking brake handle in the cockpit, and the respective valve that it controlled, were both found in the brake set position. According to preliminary data recovered from the airplane’s flight data recorder (FDR), both thrust levers were set at 66°, and both engines remained at 91% N1 throughout the takeoff roll. While at an airspeed of about 100 knots, the elevator control surface position increased to a positive value, reaching about 16°. At this time the pitch of the airplane minimally changed to about +1°. The weight-on-wheels (WOW) indication remained in an on-ground state until beyond the departure end of the runway where the terrain began sloping downward. After departing the runway at an indicated airspeed of about 120 knots, the elevator position increased to a maximum recorded value of about 17° deflection, the airplane’s pitch rapidly increased to about +22°. Immediately thereafter the elevator position rapidly decreased to about -1.0° and the stick shaker (aerodynamic stall warning) activated. The FDR data further indicated that at about the time the WOW indication transitioned from on-ground to an in-air state, the airspeed accelerated from about 120 knots to a maximum airspeed of 123.75 knots. Additionally, the right engine fuel flow, N1, and N2 decreased with corresponding ITT increase about 1.8 seconds after the WOW transition. Given the airplane’s velocity between these two times, the deceleration of the right engine occurred when it was in close proximity to the power pole. Parking brake valve position and normal brake application were not recorded by the FDR, and the airplane’s takeoff configuration warning system did not incorporate parking brake valve position as part of its activation logic. Further review of the FDR data revealed that the longitudinal acceleration values recorded during the takeoff roll of the accident flight (0.245g) were less than the recorded values for the airplane’s two previous takeoffs (0.365g and 0.35g). Additionally, the time the airplane took to accelerate from 20 to 100 kts during the accident flight and the previous two takeoffs were 17 seconds, 11.5 seconds, and 12 seconds, respectively. Additionally, the elevator position and pitch attitude of the airplane at rotation during its previous takeoff were about 13°, and +1.6°, respectively. The pitch attitude then continued to increase to +10° and remained at that value as the airspeed increased and the elevator position decreased.", "probable_cause": null}