{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-83-bandar-e-mahshahr", "date": "Jan 27, 2020 at 0736 LT", "type": "McDonnell Douglas MD-83", "operator": "Caspian%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tehran - Bandar-e Mahshahr", "msn": "53464", "yom": 1994, "flight_number": "RV6936", "city": "Bandar-e Mahshahr", "zone": "Khuzestan", "country": "Iran", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 136, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 18430, "captain_hours_type": 7840, "copilot_hours": 300, "copilot_hours_type": 124, "aircraft_hours": null, "circumstances": "On Jan. 27, 2020, at 03:12 UTC Caspian Airlines (CPN) Flight 6936, an MD83, EP-CPZ took off from Mehrabad International Airport and climbed to FL320 as final cruising level. At about 03:45:37 UTC, the aircraft was flying according to the flight plan route on Airway B417 at an assigned FL320. Due to another traffic departing flight, an A320, IRA356 from Abadan Airport (OIAA) to destination Mashhad International Airport (OIMM), the ACC controller issued direct routing to the flight CPN 6936 position GODMO. At 03:49:34 UTC, CPN6936 requested descent clearance, so the flight was cleared to FL100. At 03:52:30 UTC, the pilot called Mahshahr AFISO and reported position 50 nm inbound GODMO and estimated time over GODMO at 03:59 UTC. At 03:52:51 UTC, Mahshahr AFISO reported necessary information as below: \"RWY active is 31; wind is now 280/08kts, CAVOK, temperature +06, DP 04 and QNH 1023, expected VOR approach RWY 31 via GODMO 1E ARRIVAL\" At 03:53: 33 UTC, the pilot requested RWY 13 and Mahshahr AFISO performed VOR/DME approach RWY 13, via GODMO 1F arrival. At 03:59:39 UTC, the pilot reported, “we are approaching position GODMO in contact with destination Mahshahr.” At 04:00:41UTC, the pilot reported his position “GODMO” to Mahshahr AFISO. At 04:02:46 UTC, the pilot reported leaving of IAF and received landing clearance for RWY13. Finally, at 04:06:11 UTC, the aircraft landed on RWY 13, passed two-thirds of RWY length and ran off the end of runway13 after landing at Mahshahr Airport at 04:06 UTC, Khuzestan province. The accident flight was being operated on an Instrument Flight Rules (IFR) flight plan in a Visual Meteorological Condition (VMC). The main door of the accident aircraft was opened in emergency condition, but the slide skid did not operate automatically. The cabin floor was just too close to the ground (grass surface) due to the impact of the nose and main landing gears strut which were broken after the runway overrun. The evacuation was performed from the main door, and all 136 passengers and 8 crew members disembarked. ", "probable_cause": "The Aircraft Accident Investigation Board determines that the probable causes of this accident were the pilots’ failures below, resulting in a runway overrun:\r\n- Poor decision-making for acceptance of the risk of high-speed landing;\r\n- Un-stabilized approach against the normal flight profile;\r\n- Poor CRM in the cockpit; and\r\n- Poor judgment and not accomplishing go-around while performing an unstabilized approach.\n\r\nContributing Factors:\r\n- Loading of 5 tons of extra fuel, which increased the landing distance required.\r\n- Decision to make a landing on RWY 13 with tailwind.\r\n- Inability of the copilot (PM) to take control of the aircraft and proper action to execute goaround."}