{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-20-dk-sydney", "date": "Apr 24, 1994 at 0910 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "South Pacific Airmotive - SPA", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Sydney - Norfolk Island - Lord Howe Island", "msn": "12874", "yom": 1944, "flight_number": null, "city": "Sydney-Kingsford Smith", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 21, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9186, "captain_hours_type": 927, "copilot_hours": 500, "copilot_hours_type": 250, "aircraft_hours": 40195, "circumstances": "This accident involved a DC-3 aircraft which was owned and operated by South Pacific Airmotive Pty Ltd, who were based at Camden, NSW. It was flown on commercial operations under an Air Operators Certificate held by Groupair, who were based at Moorabbin, Vic. The aircraft had been chartered to convey college students and their band equipment from Sydney to Norfolk Island to participate in Anzac Day celebrations on the island. A flight plan, submitted by the pilot in command, indicated that the aircraft was to proceed from Sydney (Kingsford-Smith) Airport to Norfolk Island, with an intermediate landing at Lord Howe Island to refuel. The flight was to be conducted in accordance with IFR procedures, with a departure time from Sydney of 0900. The aircraft, which was carrying 21 passengers, was crewed by two pilots, a supernumerary pilot and a flight attendant. Preparations for departure were completed shortly before 0900, and the aircraft was cleared to taxi for runway 16 via taxiway Bravo Three. The pilot in command occupied the left control position. The co-pilot was the handling pilot for the departure. The aircraft was cleared for takeoff at 0907:53. The crew subsequently reported to the investigation team that all engine indications were normal during the take-off roll and that the aircraft was flown off the runway at 81 kts. During the initial climb, at approximately 200 ft, with flaps up and the landing gear retracting, the crew heard a series of popping sounds above the engine noise. Almost immediately, the aircraft began to yaw left and at 0909:04 the pilot in command advised the TWR that the aircraft had a problem. The co-pilot determined that the left engine was malfunctioning. The crew subsequently recalled that the aircraft speed at this time had increased to at least 100 kts. The pilot in command, having verified that the left engine was malfunctioning, closed the left throttle and initiated propeller feathering action. During this period, full power (48 inches Hg and 2,700 RPM) was maintained on the right engine. However, the airspeed began to decay. The handling pilot reported that he had attempted to maintain 81 KIAS but was unable to do so. The aircraft diverged to the left of the runway centreline. The co-pilot and the supernumerary pilot subsequently reported that almost full right aileron had been used to control the aircraft. They could not recall the skid-ball indication. The copilot reported that he had full right rudder or near full right rudder applied. When he first became aware of the engine malfunction, the pilot in command assessed that, although a landing back on the runway may have been possible, the aircraft was capable of climbing safely on one engine. However, when he determined that the aircraft was not climbing, and that the airspeed had reduced below 81 kts, the pilot in command took control, and at 0909:38 advised the TWR that he was ditching the aircraft. He manoeuvred the aircraft as close as possible to the southern end of the partially constructed runway 16L. The aircraft was ditched approximately 46 seconds after the pilot in command first advised the TWR of the problem. The four crew and 21 passengers successfully evacuated the aircraft before it sank. They were taken on board pleasure craft and transferred to shore. After initial assessment, they were transported to various hospitals. All were discharged by 1430 that afternoon, with the exception of the flight attendant, who had suffered serious injuries.", "probable_cause": "The following factors were considered significant in the accident sequence.\r\n1. Compliance with the correct performance charts would have precluded the flight.\r\n2. Clear and unambiguous presentation of CAA EROPs documentation should have precluded the flight.\r\n3. The aircraft weight at takeoff exceeded the MTOW, the extent of which was unknown to the crew.\r\n4. An engine malfunction and resultant loss of performance occurred soon after takeoff.\r\n5. The operations manual take-off safety speed used by the crew was inappropriate for the overloaded condition of the aircraft.\r\n6. The available single-engine aircraft performance was degraded when the co-pilot mishandled the aircraft controls.\r\n7. The pilot in command delayed taking over control of the aircraft until the only remaining option was to conduct a controlled ditching.\r\n8. There were organisational deficiencies in the management and operation of the DC-3 involving both Groupair and SPA.\r\n9. There were organisational deficiencies in the safety regulation of both Groupair and SPA by the CAA district offices at Moorabbin and Bankstown.\r\n10. There were organisational deficiencies relating to safety regulation of EROPS by the CAA."}