{"url": "https://www.baaa-acro.com/crash/crash-vickers-802-viscount-belfast-7-killed", "date": "Oct 23, 1957 at 1651 LT", "type": "Vickers Viscount", "operator": "BEA", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "London - Belfast", "msn": "150", "yom": 1956, "flight_number": null, "city": "Belfast-Nutts Corner", "zone": "Antrim", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 7496, "captain_hours_type": 316, "copilot_hours": 7439, "copilot_hours_type": 259, "aircraft_hours": null, "circumstances": "The aircraft departed London Airport at 1516LT hours GMT on a flight to Belfast in pursuance of a special charter, carrying 5 crew and 2 company employees. At 1645 the aircraft was taken over by the Precision Approach Controller for a GCA talkdown on runway 28 (276°) in weather conditions which the captain thought would allow him to become visual at or above his critical height of 500 ft. Soon after '3/4 of a mile from touchdown' the aircraft was to the right of the centerline and shortly afterwards was 'well right of centerline', Just after '1/2 a mile from touchdown' the Precision Approach Controller said 'if you're overshooting turn left left 5° on overshoot over' to which the reply came '...overshooting'. At about this time a number of witnesses heard the aircraft \"rev-up\". Shortly thereafter (at 1651 hours) the aircraft crashed within the boundary of the airport approximately 1,000 ft to the south of the western end of runway 28, killing all occupants. ", "probable_cause": "A detailed examination of the autopilot equipment salvaged from the aircraft was carried out. There was nothing wrong with the auto pilot and it was not energized nor were the clutches engaged at the time of impact.  Careful work was done in the course of a study by an expert to try to establish the flight path followed during the final dive and particular attention was paid to the possibility of a bunt manoeuvre or of a partial recovery from a stall. It appears possible to obtain conditions at impact similar to those reported without requiring any structural failure or unserviceability of the aircraft but also that the manoeuvre required would be of a fairly violent nature. Something may have deceived the pilot into some violent manoeuvre of the kind envisaged. It would seem that the only possible source of such deception would be the Flight System and associated instruments. All that was recovered from the wreckage was subjected to an exhaustive examination by an impressive body of experts and they failed to find anything which pointed to the malfunctioning of any instrument or indicator which could have led the pilot into a disastrous operation of the controls. Thus, the cause of the accident was not determined. "}