{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46a-45-cu-commando-deline", "date": "Sep 25, 2015 at 1203 LT", "type": "Curtiss C-46 Commando", "operator": "Buffalo%20Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yellowknife – Norman Wells", "msn": "30386", "yom": 1944, "flight_number": "BFL525", "city": "Déline", "zone": "Northwest Territories", "country": "Canada", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Buffalo Airways Curtiss C-46A (C-GTXW) was operating as flight 525 from Yellowknife, NT (YZF) to Norman Wells, NT (YVQ). While en route, approximately 140 nautical miles southeast of Norman Wells at 6500 feet above sea level, the crew noticed a drop in the right engine oil quantity indicator in conjunction with a propeller overspeed. The propeller pitch was adjusted to control the overspeed however, oil quantity indication continued to drop rapidly. A visual confirmation of the right engine nacelle confirmed that oil was escaping via the engine breather vent at an abnormally high rate. The right propeller speed became uncontrollable and the crew completed the \"Prop overspeed drill\". However, the propeller did not feather as selected. Several additional attempts were made to feather the propeller before it eventually feathered. The engine was secured and the shutdown checklist completed. The crew elected to divert to Tulita, NT (ZFN), but quickly determined that the descent rate would not permit that as an option. The only other option for diversion was Déline, NT (YWJ) where weather was reported at half a mile visibility and 300 feet ceiling. An emergency was declared with Déline radio. BFL525 was able to land at Déline however, the landing gear was not selected down to prevent further loss of airspeed resulting in a belly landing approximately midpoint of runway 08. The aircraft continued off the end of the runway coming to a stop approximately 700 feet beyond the threshold. The crew evacuated the aircraft sustaining no injuries however, the aircraft was destroyed.", "probable_cause": "Buffalo Airways’ initial investigation revealed the engine oil scavenge pump had failed. No TSB-BST investigation was conducted on the event. "}