{"url": "https://www.baaa-acro.com/crash/crash-handley-page-hp57-halifax-i-baldersby-saint-james-6-killed", "date": "Jan 13, 1941 at 1153 LT", "type": "Handley Page H.P.57 Halifax I", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Linton-on-Ouse - Linton-on-Ouse", "msn": null, "yom": null, "flight_number": null, "city": "Baldersby Saint James", "zone": "North Yorkshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane departed RAF Linton-on-Ouse at 1120LT for a fuel consumption test and a measured climb to 12,000 feet. Shortly before noon, while cruising at an altitude of 8,000 feet with its undercarriage down, the bomber was seen with trailing smoke and flames. It entered an uncontrolled descent and crashed in an open field located in Howefield House, near Baldersby St James. All six crew members were killed.\r\nCrew:\r\nF/Lt Michael Thomas Gibson Henry, pilot, \r\nP/O Leslie Joseph McDonald, pilot,\r\nSgt John Naoier Hall, observer,\r\nSgt Francis Leslie Plowman, flight engineer,\r\nSgt Anthony Charles Henry Reid Russell, wireless operator and air gunner,\r\nSgt William Charles Browne Jesse, wireless operator and air gunner.", "probable_cause": "The cause of the fire was blamed on the failure of groundcrew at Linton on Ouse to put the fuel-filler cap back on one of the port fuel tanks after it had been refuelled. The vapour seen behind the port wing would also certainly have been fuel, which, by the time it ignited had soaked into the tail section of the aircraft. Also of note is that the port outer engine had been suffering trouble since its delivery. It suffered a coolant leak on 3 December 1940 which resulted in a new radiator being fitted and then the same engine showed low oil pressure, it was run-up on 24 December 1940 and a new oil relief valve had to be fitted. Following the crash all the engines were removed and taken away for inspection and this engine was found to have suffered an oil shortage in the air prior to the crash, part of the crankshaft had broken causing the failure of the engine. Further investigation of other early Halifaxes found that this was a design problem. When full of fuel and in a tail-down position the oil pumps on the outer engines were above the oil level. This oil system was later changed to stop the problem re-occuring. Why the undercarriage had droppped or been lowered is not known."}