{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-north-bend-2-killed", "date": "Mar 8, 1999 at 2145 LT", "type": "Cessna 421B Golden Eagle II", "operator": "John E. Hoesly", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "North Bend - Aurora", "msn": "421B-0446", "yom": 1973, "flight_number": null, "city": "North Bend", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1200, "captain_hours_type": 135, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2342, "circumstances": "Witnesses reported hearing the engines start and shortly thereafter, the airplane taxied to the runway. The pilot then contacted ATC for an IFR clearance. The clearance was given with a short void time. The pilot acknowledged the clearance and began the takeoff ground roll. Witnesses reported that the night-time takeoff roll and engine sound appeared normal. Witnesses near the end of the runway reported that the airplane was observed at about 50 feet above the runway with about 1,000 feet of runway remaining when engine power was reduced on both engines. The airplane was heard to touch down, then engine power was reapplied. Shortly thereafter, the sound of the impact was heard. The airplane collided with the terrain about 600 feet from the end of the runway. During the post-accident inspection of the airplane and engines, no evidence was found to indicate a mechanical failure or malfunction. Documentation of the events indicated that from the time the aircraft began its taxi to the runway, to the time the takeoff roll began, was approximately six minutes in duration. Before the takeoff roll began, the pilot had accepted a clearance with a void time of four minutes. By the time the pilot correctly read back the clearance, less than two minutes remained before the void time. Post accident documentation of the accident site revealed that neither the pilot nor the passenger were wearing their lap belts or shoulder harnesses. It was also noted that the pilot had not yet selected the discrete transponder code as indicated by the clearance. ", "probable_cause": "A delayed aborted takeoff for an undetermined reason. "}