{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-kamuela-1-killed", "date": "Jan 29, 1996 at 0435 LT", "type": "Cessna 402", "operator": "Trans Air - USA", "flight_phase": "Takeoff (climb)", "flight_type": "Postal (mail)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kamuela - Honolulu", "msn": "402B-0616", "yom": 1974, "flight_number": null, "city": "Kamuela", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3434, "captain_hours_type": 1250, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 19764, "circumstances": "The aircraft departed at night from runway 4R on a flight to transport mail. The pilot-in-command (PIC) was in the left seat, a pilot-rated cargo loader was in the right seat, and another cargo loader was aboard the aircraft, but was not in a seat. During takeoff, the aircraft entered a turn and flew into gradually rising terrain. The initial impact point was about 15 feet higher than the runway elevation and about 0.3 miles abeam the departure end of the runway. Investigation revealed that the company allowed pilot-rated cargo loaders to fly the aircraft from the right seat during positioning and ferry flight segments (to build multiengine flight time) as part of their compensation. There was evidence that at the time of the accident, the aircraft was being piloted on this flight from the copilot's position. The right side of the instrument panel was equipped with only EGT gauges (no flight instruments on the copilot's side). There were cloud layers in the vicinity, no moon illumination, and no visible ground lighting in the direction of flight. No preimpact mechanical malfunction or failure was identified during the investigation. Except at the pilot and copilot positions, the airplane had no other seat and/or restraint system. The operator stated that the pilot was not authorized to carry company personnel or passengers without the required seating. ", "probable_cause": "Failure of the copilot (pilot-rated cargo loader, who was flying the aircraft) to establish and maintain a positive rate of climb after taking off at night; and inadequate supervision by the pilot-in-command (PIC), by failing to ensure that proper altitude was obtained and maintained during the departure. Factors relating to the accident were: darkness; the lack of visual cues; and the resultant visual illusion, which the copilot failed to recognize during the night departure. Also, the lack of a restraint system (seat belt and/or shoulder harness) for the passenger was a possible related factor. "}