{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-lakeview-3-killed", "date": "Mar 4, 1989 at 1200 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Herbert G. Hinkelman", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Portland - Reno", "msn": "61-0829-8163438", "yom": 1981, "flight_number": null, "city": "Lakeview", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1300, "captain_hours_type": 108, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1297, "circumstances": "While en route, the pilot encountered headwinds and trace rime icing. He made a climb from 17,000 feet to FL190, then to FL210. After cruising at FL210 for about 27 minutes, the aircraft entered a descent (without ATC clearance). Radio and radar contact were lost in the vicinity of were the aircraft crashed. Just before impact, the aircraft was observed to descend out of low clouds in a spin. The pilot had been issued a Canadian instrument rating on 1/11/88, but it was valid for only 12 months. A person, who had given the pilot proficiency flight training in preparation for an instrument qualification check, reported that he had reservations about the pilot's ability to fly in instrument conditions without an autopilot. Avionics personnel at the departure airport reported the pilot had encountered an autopilot malfunction on the previous flight and that they had found an electrical short in the autopilot disconnect switch on the copilot control yoke. However, they were unable to repair it due to lack of a replacement part. Reportedly, the pilot borrowed a soldering iron to repair it himself. All three occupants were killed. ", "probable_cause": "Failure of the pilot to maintain control of the aircraft, which resulted in a spin and an uncontrolled descent. Factors related to the accident were: improper maintenance by the pilot, an autopilot malfunction, the adverse weather conditions, continued flight by the pilot into adverse weather conditions, and his lack of recent instrument experience."}