{"url": "https://www.baaa-acro.com/crash/crash-eclipse-ea500-near-swellendam-1-killed", "date": "Dec 7, 2015 at 1057 LT", "type": "Eclipse EA500", "operator": "Dixco Transport", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Lanseria - Cape Town", "msn": "142", "yom": 2008, "flight_number": null, "city": "Swellendam", "zone": "Western Cape", "country": "South Africa", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2977, "captain_hours_type": 506, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 714, "circumstances": "The aircraft had taken off on a private flight with the pilot being the sole occupant on board. The pilot had filed an IFR flight plan and had informed air traffic control (ATC) at FALA that the aircraft had a fuel endurance of 4 hours and his estimated flying time to FACT was approximately 2 hours and 30 minutes. After take-off the aircraft climbed to its cruising altitude of 36 000 feet (FL360) as was seen on the radar recordings. The pilot maintained communication with ATC until overhead Kimberley. Shortly thereafter the aircraft was observed to change course, turning slightly left before the town of Douglas. The aircraft remained at FL360 and was observed to fly south towards the waypoint OKTED, which was a substantial distance to the east of FACT. FACT could not get communication with the aircraft and the aeronautical rescue co-ordination centre (ARCC) was advised of the situation. The aircraft was kept under constant radar surveillance. The ARCC requested assistance from the South African Air Force (SAAF) and a Gripen (military jet) from Air Force Base Overberg (FAOB) was dispatched to intercept the aircraft. The pilot of the Gripen intercepted the aircraft approximately 3 minutes before it impacted the terrain. The Gripen pilot was unable to get close enough to the aircraft as it was flying very erratically, and he could therefore not see whether the pilot was conscious or not. The aircraft was observed entering a left spiral and continue spiraling down until it impacted the ground. The pilot was fatally injured and the aircraft was destroyed during the impact sequence.", "probable_cause": "The investigation revealed no anomalies on the part of the aircraft and all damage was attributed to the impact with the ground. The fatal injuries sustained by the pilot made it impossible to determine if the pilot was incapacitated or not. It was observed that the aircraft performed a series of unexplainable as well as erratic flying manoeuvres, which resulted in a loss of control and the aircraft to enter into a spiral dive, which was observed by the Gripen pilot before colliding with the ground."}