{"url": "https://www.baaa-acro.com/crash/crash-cessna-414a-chancellor-ashland-8-killed", "date": "Jan 3, 1982 at 1704 LT", "type": "Cessna 414 Chancellor", "operator": "Ashland Properties", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Boca Raton - Ashland", "msn": "414A-0299", "yom": 1979, "flight_number": null, "city": "Ashland", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 1809, "captain_hours_type": 250, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot received two weather briefings, one on the evening before the flight, another at 1009 EST, within three hours of the takeoff time. IFR conditions were forecasted at the uncontrolled, destination airport. The pilot filed an IFR flight plan, but did not list an alternate airport. The aircraft departed Boca Raton at 1257 EST. The flight was uneventful en route and all communications were normal. During arrival, the pilot was cleared for a VOR 3 approach to runway 16. The minimum descent altitude (MDS) for the approach was 800 feet MSL (595 feet AGL) and the minimum visibility was one mile. Several witnesses at and near the airport saw or heard the aircraft. They described the aircraft as crossing the airport from the west side to the east. Those who saw it described it to be approximately 150 to 200 feet AGL, in and out of the clouds. Reportedly, the aircraft then circled and crossed the airport again. Subsequently, it struck an 80 feet tree, then impacted the ground in a steep descent. There was no evidence of failure or malfunction of the airframe or powerplant before impact. The aircraft was estimated to be 46 lbs over the max gross weight limit during impact. All eight occupants were killed.", "probable_cause": "In flight collision with terrain during an uncontrolled descent due to improper IFR procedures. The following findings were reported:\r\n- Dusk,\r\n- Low ceiling, \r\n- Fog,\r\n- Rain,\r\n- The pilot continue into known adverse weather, \r\n- Trees,\r\n- Overconfidence in personal ability on part of the pilot."}