{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-30-dk-near-fort-mcmurray", "date": "Oct 4, 1957 at 1352 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Eldorado-Aviation", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Edmonton – Fort Smith – Yellowknife – Port Radium", "msn": "14009/25454", "yom": 1944, "flight_number": null, "city": "Fort McMurray", "zone": "Alberta", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Edmonton at 1137LT on a flight to Port Radium, NWT, with refuelling stops at Fort Smith and Yellowknife, NWT. The aircraft climbed to 9,000 feet on a direct route to Fort Smith. Between Edmonton and Fort McMurray, it encountered light rime ice which was easily disposed of by the deicing equipment. At approximately 1320LT, the aircraft was abeam Fort McMurray and encountered freezing rain about five minutes later. The course was altered for Embarras with the intention of joining the airway and following it as far as Fort Smith. The build-up of ice was very rapid at this time and could not be overcome by the deicing equipment. The crew requested permission to descend to 7,000 feet and during the descent additional ice was picked up. The aircraft could not maintain height at 7,000 feet and went down to 5,000 feet, still running through rain squalls. Throttle and propeller settings were for 40\" and 2 500 rpm respectively. Further altitude was lost and at about 4,500 feet, severe turbulence was encountered. This together with the accumulation of ice, caused a further loss of height, and the aircraft collided with trees. The pilot closed the throttles and at 1352LT and carried out a forced landing. Both pilots suffered serious injuries and the aircraft was destroyed. ", "probable_cause": "The aircraft continued its flight into an area of freezing precipitation until the accumulation of ice and severe turbulence resulted in partial loss of control during which the aircraft struck trees. The type of weather encountered was more severe than had been forecast, which was considered as a contributing factor. "}