{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-laredo-7-killed", "date": "Jan 24, 1982 at 0953 LT", "type": "Cessna 402", "operator": "Vernon L. Meyer", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dilley - Laredo", "msn": "402B-1026", "yom": 1975, "flight_number": null, "city": "Laredo", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 5666, "captain_hours_type": 42, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1524, "circumstances": "The aircraft was observed to be extremely slow throughout the approach and that the pilot appeared to be having some difficulty with overcontrolling the aircraft. It then leveled out at 50-80 feet on final over the threshold, entered a nose-high attitude and then stalled into a right spin. The pilot had flown to Memphis, two days prior to the accident with the other pilot to pick up the stol equipped aircraft. The vendor's chief pilot checked out the pilot in the aircraft during the return flight to Houston. On the day prior to the accident the two pilots who were onboard at the time of the accident flew a local flight for about two hours and then flow to Dilley for an additional 1.3 hours. When the accident occurred the pilot who had been checked out by the vendor's chief pilot was sitting in the right seat.", "probable_cause": "Loss of control in flight during final approach VFR pattern after the pilot failed to maintain airspeed. The following findings were reported:\r\n- Inadequate transition/upgrade training on part of the copilot, \r\n- Lack of total experience in type of aircraft on part of the copilot, \r\n- Inadvertent stall spin,\r\n- Inadequate supervision on part of the pilot-in-command, \r\n- Lack of total experience in type of aircraft on part of the pilot-in-command."}