{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-valley-13-killed", "date": "Jun 12, 1980 at 1546 LT", "type": "Swearingen SA226 Metro II", "operator": "Air%20Wisconsin-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Appleton - Minneapolis - Lincoln", "msn": "TC-228", "yom": 1977, "flight_number": "ZW965", "city": "Valley", "zone": "Nebraska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 13, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": 8391, "captain_hours_type": 6000, "copilot_hours": 4063, "copilot_hours_type": 143, "aircraft_hours": 8055, "circumstances": "The airplane departed Appleton, Wisconsin, at 1245LT on a regular schedule service (ZW965) to Lincoln, Nebraska, with an intermediate stop in Minneapolis. En route, while cruising at 12,000 feet, the crew encountered moderate turbulences and precipitation and was cleared to descend to 8,000 feet then later at 6,000 feet. As turbulences were getting worse, the crew was later cleared to descend to 4,000 feet and finally 3,000 feet. While descending to 6,000 feet, massive water ingestion caused both engines to lose power simultaneously. Both engines were restarted but the Metro couldn't recover and struck a muddy field in a slight nose down, right wing-down attitude. The aircraft bounced and hit the ground 288 feet further on. The plane skidded 1,022 feet before coming to rest inverted. There was no fire. Two passengers were seriously injured while 13 other occupants were killed. ", "probable_cause": "The flight crew's continued flight into an area of severe thunderstorms, and the resultant precipitation-induced flameout or loss of power of both engines at an altitude from which recovery could not be made. Contributing to the cause of the accident was the failure of the flight crew to utilise all available sources of weather information and the failure of the air traffic control system to disseminate critical weather information to the air traffic controllers and to the crew of Flight 965, the failure of air traffic control supervisory personnel to accomplish key job functions, and the failure of Center Weather Service Unit meteorologists to disseminate critical weather information to the Omaha Radar Approach Control Facility supervisors. Also contributing was the precipitation induced X-band radar attenuation which limited tile ability of airborne weather radar to detect the extent and intensity of the weather disturbances."}