{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a90-king-air-franca-2-killed", "date": "Mar 23, 1999 at 1910 LT", "type": "Beechcraft 90 King Air", "operator": "No Limits Taxi Aéreo", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Franca – Ribeirão Preto", "msn": "LJ-125", "yom": 1966, "flight_number": null, "city": "Franca", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3500, "captain_hours_type": 650, "copilot_hours": 206, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Less than a minute after takeoff from Franca Airport, while climbing in poor weather conditions, the twin engine aircraft nosed down and crashed in a huge explosion about 1,500 metres past the runway end. The aircraft was destroyed and both pilots were killed. They were completing a cargo flight to Ribeirão Preto, carrying documents on behalf of Banco do Brasil. ", "probable_cause": "The following findings were identified:\r\n- The crew was in a hurry to take off in order to avoid poor weather approaching the airport,\r\n- The crew took off from an intersection with a taxiway,\r\n- Immediately after takeoff, the aircraft entered clouds,\r\n- Approximately one minute after liftoff, the aircraft impacted ground,\r\n- After the first impact, the aircraft flew for another 200 metres and again collided with the ground and exploded,\r\n- The aircraft was totally destroyed by a post crash fire, \r\n- The pilot had a hearing problem that was stabilized and was being researched by HASP. Considering the relationship between ear and ear balance, spatial disorientation in the pilot in\r\nin the face of the adverse conditions it experienced: flight conditions by instruments associated with “windshear”. Since the search could not be completed above mentioned, this aspect remains undetermined,\r\n- Individual characteristics contributed due to the habits acquired by the pilot and his eventual practice of taking off from the taxiway, delaying the point from which the aircraft would achieve the best characteristics flight performance,\r\n- Poor weather conditions with CB's, sudden changes in wind, strong turbulence and rain, were conducive to the emergence of the phenomenon of “Windshear”, representing a real risk to the operation of any aircraft, being that voluntary entry or not, in this type of training, results almost always in the loss of control of the aircraft with unforeseeable consequences. The crew faced these conditions when the aircraft took off,\r\n- It was evident from the witness statements that the pilot was in a hurry to take off, in addition to having used runway 23 from the intersection and towards the sector most affected by poor weather."}