{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-jupiter", "date": "Aug 2, 2003 at 1301 LT", "type": "Piper PA-31-310 Navajo", "operator": "PLF Aviation", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Akron – Fort Lauderdale", "msn": "31-7300974", "yom": 1973, "flight_number": null, "city": "Jupiter", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1106, "captain_hours_type": 29, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1493, "circumstances": "The pilot stated that he and his wife were en route to a medical conference which was to be held aboard a cruise ship that was departing from Fort Lauderdale, Florida, at 1700. He stated that both tanks were full of fuel when he departed the Canton Regional Airport, Canton, Ohio, en route to Fort Lauderdale Executive Airport. According to the pilot, the inboard tanks had been selected for the first hour and a half and the outboard tanks for the following two hours. He said the flight was vectored around thunderstorms, and during the descent, when about 12 miles to the north of Palm Beach International Airport, Palm Beach, Florida, the left engine ceased operating. He said that at this time he noticed that both inboard fuel indicators showed the tanks to be empty, and he switched to the outboard tanks, both of which were shown to be a quarter full. The pilot stated that two minutes later both engines began to surge, and after making an emergency radio communications call, he was advised by the FAA Air Traffic  Controller that Tailwinds Airport was located 4 miles to the west. Unable to reach the runway at Tailwinds Airport, the pilot said he made a forced landing in an orange grove. the pilot also said that prior to the accident, there had not been any mechanical failure or malfunctions to the airplane or any of its systems. Examination of the accident site revealed that the airplane had incurred substantial damage, and there was little or no fuel present at the scene. Follow-on examination of the airplane, its fuel system and both engines revealed no anomalies.", "probable_cause": "The pilot's failure to adequately plan for the flight which resulted in fuel exhaustion, a forced landing, and damage to the airplane during the landing."}