{"url": "https://www.baaa-acro.com/crash/crash-bleriot-155-leigh-7-killed", "date": "Oct 2, 1926 at 1527 LT", "type": "Blériot 155", "operator": "Air-Union-France-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Paris - Croydon", "msn": "1", "yom": 1926, "flight_number": null, "city": "Penshurst", "zone": "Kent", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 2000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Le Bourget Airport at 1330LT bound for Croydon Airport, London. After crossing The Channel, the crew proceeded with a radio control over Tonbridge at 1524LT. At this time, all was OK on board according to the crew. Three minutes later, the port upper engine caught fire. Immediately, the pilot modified his route and diverted to Penshurst Airport close to his position to make an emergency landing. Eyewitnesses described the tail of the aircraft sinking whilst the aircraft gained a little height. Then the aircraft rolled over and dived to the ground where the wreckage was consumed by fire. The aircraft crashed in the grounds of a house named Southwood, in Leigh, Kent. All seven occupants were killed. The aircraft had been inspected before the flight, and a certificate issued by Bureau Veritas showing that it was fit for flight. The pilot was experienced, with over 2,000 hours flying time, and had been in the employ of Air Union since 1920. He had made 61 return flights between Paris and London. As both crew were French citizens, all five passengers were British. ", "probable_cause": "On being questioned, Major Cooper of the Air Ministry stated that there had never been a previous case of an airliner catching fire in the air. So, the exact cause of the inflight fire on the port upper engine could not be determined with certainty. "}