{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-near-raglan-3-killed", "date": "Oct 31, 2006 at 1855 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Armflame", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Emerald – Gladstone", "msn": "31-7752006", "yom": 1977, "flight_number": null, "city": "Raglan", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3900, "captain_hours_type": 70, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3977, "circumstances": "The aircraft was being operated on a private category instrument flight rules (IFR) flight from Emerald to Gladstone, Qld. On board the aircraft were the pilot in command and two passengers. One of the passengers was a qualified pilot, but who was not endorsed on the aircraft type. After departing Emerald at 1807 Eastern Standard Time, the pilot contacted air traffic control and reported climbing to 7,000 ft with an estimated time of arrival at Gladstone of 1915. At 1813:25, air traffic control advised the pilot that ZGZ was radar identified 15 NM east of Emerald. At 1815:12, the pilot requested clearance to climb to 9,000 ft. At 1817:05, air traffic control issued a clearance to the pilot for the aircraft to climb 9,000 ft, and to track direct to Gladstone. At 1820:26, the pilot reported level at 9,000 ft and requested clearance to divert up to 10 NM left and right of track to avoid anticipated weather activity ahead. Air traffic control approved that request. At 1830:56, the pilot requested clearance to divert up to 15 NM left and right of track, and 10 seconds later changed the request to 15 NM left of track. Air traffic control approved that request. At 1835:17, the pilot reported clear of the weather and requested clearance to track direct to Gladstone and to descend to 7,000 ft. Air traffic control approved those requests. At 1848:52, the pilot reported at ‘top of descent’ to Gladstone. Air traffic control cleared the pilot to descend. At 1852:45, the pilot reported changing frequency to the Gladstone common traffic advisory frequency (CTAF). Air traffic control advised the pilot that the aircraft was leaving 5,500 ft and that the radar and control services were terminated. The pilot acknowledged that transmission at 1852:57. Approximately 3 minutes later, at 1855:45, air traffic control noticed that the aircraft’s symbol was no longer evident on the air situation display screen and the controller attempted to contact the pilot of the aircraft by radio. The controller also requested pilots of other aircraft operating in the Gladstone area to attempt to contact the pilot of ZGZ on the Gladstone CTAF frequency. All attempts were unsuccessful. A witness in the Raglan area recalled hearing the sound of aircraft engine(s) overhead. He then heard the engine(s) ‘roar and shut off again’ a few times. A short time later, he saw a flash and a few seconds later heard the sound of an explosion. He realised that the aircraft had crashed and telephoned the Gladstone Police. Subsequently, wreckage of the aircraft was located near Raglan, approximately 39 km west of Gladstone. The three occupants were fatally injured. The aircraft was destroyed by impact forces and post-impact fire. ", "probable_cause": "From the evidence available, the following findings are made with respect to the loss of control event involving Piper Aircraft Corporation PA-31-350 aircraft registered VH-ZGZ and should not be read as apportioning blame or liability to any particular organisation or individual.\r\nContributing safety factors:\r\n• The aircraft diverged left from a steady, controlled descent and entered a steep, left spiral descent from which recovery was not achieved.\r\nOther safety factors:\r\n• The dark and very likely cloudy conditions that existed in the area where the aircraft suddenly diverged from its flight path meant that recovery to normal flight could only have been achieved by sole reference to the aircraft’s flight instruments. The difficulty associated with such a task when the aircraft was in a steep descent was likely to have been significant. "}