{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-2a8-patna-60-killed", "date": "Jul 17, 2000 at 0734 LT", "type": "Boeing 737-200", "operator": "Alliance%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "City", "schedule": "Calcutta – Patna – Lucknow – New Delhi", "msn": "22280", "yom": 1980, "flight_number": "CD7412", "city": "Patna", "zone": "Bihar", "country": "India", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 52, "pax_fatalities": 49, "other_fatalities": 5, "total_fatalities": 60, "captain_hours": 4361, "captain_hours_type": 1778, "copilot_hours": 4085, "copilot_hours_type": 3605, "aircraft_hours": 44087, "circumstances": "Alliance Air Flight No. CD-7412 departed Netaji Subhash Chandra Bose International Airport, Kolkata at 0651 hrs. on 17th July, 2000 bound for Patna-Lucknow-Delhi. After normal departure from Runway 01R, the aircraft climbed to FL260 on track to Patna via route W52. The aircraft was under the control of Kolkata Radar from 0652 hrs. to 0659 hrs. It changed over to Kolkata Area Control Centre. The aircraft reported position SAREK at FL 260 at 0712 hrs. and changed over to Patna Control with information that there was no reported traffic for descent. The aircraft contacted Patna ATC at 0713 hrs. and gave it’s ETA at Patna as 0736 hrs. Patna ATC cleared the aircraft to PPT VOR ILS/DME ARC Approach for R/W 25. The ATC Officer communicated that Patna METAR originated at 0650 hrs. stated “Wind calm, Visibility 4000 metres, Weather Haze, Clouds Broken 25000 feet, temp 29ºC, Dew Point 27º, QNH 996 hPa, No Sig”. The aircraft was cleared to descend to 7500’ and report 25 DME from PPT VOR. The aircraft reported 25 DME at 0726 hrs. The aircraft then descended to 4000’ on QNH 996 hPa and was asked to report 13 DME for ILS/DME ARC Approach R/W 25. The aircraft reported commencing the ARC at 0728 hrs. The aircraft reported crossing lead radial 080 at 0731 hrs. and coming on to the Localizer. The aircraft was then asked to descend to 1700’ on QNH 997 hPa with instructions to call established on Localizer. The aircraft informed Patna ATC at 0732 hrs. that it would like to do a 360º turn due to being high on approach. Patna ATC sought confirmation from the aircraft whether it had the airfield in sight and on receiving an affirmative reply, asked the aircraft to report on finals for R/W 25 after carrying out a 360º turn. This was acknowledged by the aircraft at 0732 hrs. This was the last communication from the aircraft. Immediately thereafter, the aircraft was spotted by the Air Traffic Controller in normal descent aligned with the R/W 25. It, however, appeared to be high on approach. The aircraft then turned steeply to the left losing height all of a sudden and disappeared from sight behind a row of trees. The Air Traffic Controller observed a huge column of smoke rising from the Gardani Bagh area outside the airfield perimeter and initiated crash action. All six crew members and 49 passengers were killed as well as five people on the ground. Three passengers escaped with serious injuries. ", "probable_cause": "The cause of the accident was loss of control of the aircraft due Human Error (air crew).  The crew had not followed the correct approach procedure, which resulted in the aircraft being high on approach.  They had kept the engines at idle thrust and allowed the air speed to reduce to a lower than normally permissible value on approach.  They then maneuvered the aircraft with high pitch attitude and executed rapid roll reversals.  This resulted in actuation of the stick shaker stall warning indicating an approaching stall.  At this stage, the crew initiated a Go Around procedure instead of Approach to Stall Recovery procedure resulting in an actual stall of the aircraft, loss of control and subsequent impact with the ground."}