{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2p-near-bidzhan-8-killed", "date": "May 2, 1983 at 1443 LT", "type": "PZL-Mielec AN-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Amurzet – Birobidzhan – Khabarovsk", "msn": "1G159-16", "yom": 1974, "flight_number": "SU274", "city": "Bidzhan", "zone": "Evreyskaya oblast (Jewish Autonomous oblast)", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 11, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8866, "circumstances": "The aircraft departed Amurzet at 1414LT on a flight to Khabarovsk with an intermediate stop in Birobidzhan, carrying 11 passengers and a crew of two. Weather conditions were considered as marginal with a visibility reduced to 5 km due to rain showers. The crew decided to take off despite the VHF radio communication system was unserviceable. About half an hour into the flight, while cruising at an altitude of 400 meters, weather conditions deteriorated with limited visibility due to mixed rain and snow. The aircraft struck trees and crashed in a wooded area located 15 km north of Bidzhan, bursting into flames. The copilot and four passengers were critically injured while eight other occupants were killed. ", "probable_cause": "The accident was the consequence of the followings: \r\n- The crew decided to take off while the visibility was below minimums, \r\n- The crew decided to take off while the VHF radio communication was unserviceable,\r\n- The crew failed to inform ATC about the deterioration of the weather conditions, \r\n- When weather conditions deteriorated, the crew failed to return and continued the flight into such conditions, \r\n- The crew modified its route without ATC clearance."}