{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-2j0f-puerto-carreno-5-killed", "date": "Dec 20, 2016 at 1722 LT", "type": "Boeing 727-200", "operator": "Aerosucre", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Puerto Carreño - Bogotá", "msn": "21105/1158", "yom": 1975, "flight_number": "KRE157", "city": "Puerto Carreño", "zone": "Vichada", "country": "Colombia", "region": "South America", "crew_on_board": 6, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 8708, "captain_hours_type": 6822, "copilot_hours": 3285, "copilot_hours_type": 3285, "aircraft_hours": 60199, "circumstances": "The crew started the takeoff procedure at 1718LT from Puerto Carreño-Germán Olano Airport Runway 07 which is 1,800 metres long. Following a long takeoff roll, the pilot-in-command initiated the rotation when the aircraft overran then rolled for about 95 metres. It collided with two perimeter fences, passed through a road then lifted off. During initial climb, the right main gear was torn off after it collided with a tree and the engine n°3 failed. The airplane continued to climb to an altitude of 790 feet then entered a right turn and eventually crashed in an open field located 7,5 km from the airport, bursting into flames. The flight engineer was seriously injured while five other occupants were killed.", "probable_cause": "The following findings were identified:\r\n- Inadequate flight planning by the operator of the aircraft, and by the crew, by failure to properly perform dispatch procedures, takeoff performance calculations and verification of limitations imposed by operational conditions of the aerodrome according to the configuration of the aircraft.\r\n- Wrong crew decision making by not considering a key aspect affecting aircraft performance, such as the prevailing tailwind at takeoff.\r\n- Erroneous selection of takeoff speeds V1/VR and V2, by the crew, corresponding to an aircraft without modification in its flap system, which led to rotate the aircraft with five more knots of speed, increasing the takeoff run.\r\n- Erroneous rotation technique applied by the Pilot, delayed maneuver that extended the long takeoff run even more.\r\n- Loss of components (landing gear, trailing inboard flap right) and damage to functional systems (loss of engine power n°3 and hydraulic system) necessary to control the aircraft in flight.\r\n- Loss of control in flight generated by asymmetries of lift, power and emptying of the main hydraulic systems that exceeded the capacity of the crew and made it impossible to maintain adequate directional control and stability of the aircraft.\r\nContributing Factors:\r\n- Non-compliance with the Aeronautical Regulations by the operating company of the aircraft, operating to an aerodrome unsuitable for the operation of B727-200 equipment, which, in addition, was not authorized for that type of aircraft in the company's Operating Specifications, approved by the Aeronautical Authority.\r\n- Lack of standardization and supervision of the operating company of the aircraft, allowing the operation of the B727-200 equipment, to which a modification had been applied to the flap system, with the reference tables of speeds corresponding to the aircraft without modification.\r\n- Execution of take-off with a weight that exceeded the maximum value established in the aircraft performance charts for the conditions prevailing at the Germán Olano airport.\r\n- Omission of the crew by not activating the Standby hydraulic system, which might have allowed emergency hydraulic pressure, to regain control of the aircraft.\r\n- Lack of supervision by the Aeronautical Authority, which allowed for several years the operation of equipment B727-200 of the company operating the aircraft at the Germán Olano aerodrome in Puerto Carreño, when the characteristics of the aerodrome did not allow it and without the operator being authorized to operate equipment B727-200 in that aerodrome."}