{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3a-s1c3g-conroe", "date": "Jun 20, 1996 at 1408 LT", "type": "Douglas DC-3", "operator": "Loren Davis Ministries", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Conroe - Conroe", "msn": "11650", "yom": 1943, "flight_number": null, "city": "Conroe", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16500, "captain_hours_type": 707, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 51307, "circumstances": "During initial takeoff climb the copilot who was manipulating the controls called for METO (maximum except takeoff) power. After the pilot-in-command set METO power, the left engine lost power. The PIC took the controls from the copilot and called for him to feather the left propeller. The copilot did not hear the call to feather the left propeller. Maintaining an indicated airspeed of 90 knots and wings level attitude, the airplane descended into trees and impacted a rural residential paved street. The cockpit area and main fuselage were consumed by a post crash fire. Examination of the throttle quadrant revealed the propeller control levers were forward, the mixture control levers were autorich, the throttle for the right engine was forward, and the throttle for the left engine was at idle. According to a FAA operations inspector maintaining 90 knots with the propeller not feathered would result in the aircraft descending. The pilot and copilot had not completed a proficiency check or flight check for the DC3 type aircraft within the previous 24 months. Examination of the left engine did not disclose any preexisting anomalies. ", "probable_cause": "The flight instructor's failure to use the single engine best angle of climb airspeed resulting in a loss of control of the aircraft. Factors were the loss of power to the left engine for undetermined reasons, the flight instructor not being qualified to be pilot-in-command in the DC3, his lack of recent experience in the DC3, and the lack of suitable terrain for the forced landing. "}