{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-jeffersonville-4-killed", "date": "Mar 24, 1983 at 0236 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "McCauley Aviation", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Jacksonville - Atlanta", "msn": "735", "yom": 1979, "flight_number": null, "city": "Jeffersonville", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3747, "captain_hours_type": 547, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on the return portion of a round trip flight, hauling canceled bank checks. When they boarded before takeoff, the pilot's wife, who was not a pilot, occupied the right front seat and his two daughter's, ages 4 and 6, were in the passenger seats. Previous legs of the flight were accomplished without incident. While en route on the 4th leg, a radar handoff was made from Jacksonville to Atlanta Center at 0225 est and the pilot reported at FL180. This was his last known transmission. At 0230, the ATC controller noted the aircraft was passing Macon VOR. Shortly thereafter, radar contact was lost and efforts to make radio contact were unsuccessful. Several persons in the vicinity heard the aircraft engines alternately at high speed, then demishing, before the accident. The wreckage was found scattered over a 2 miles area. An exam revealed the right wing had failed upward and the left wing and left horizontal stabilizer had failed downward from overload. There was evidence of course reversal and descent before breakup; light turbulence and icing at cruise alt. Reason for descent unknown. All four occupants were killed. ", "probable_cause": "The uncontrolled descent of the airplane for undetermined reasons and the overstress and breakup of the airplane structure during an attempted recovery by the pilot."}