{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-258f-amsterdam-47-killed", "date": "Oct 4, 1992 at 1835 LT", "type": "Boeing 747-200", "operator": "El-Al-Cargo", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "New York - Amsterdam - Tel Aviv", "msn": "21737", "yom": 1979, "flight_number": "LY1862", "city": "Amsterdam", "zone": "North Holland", "country": "Netherlands", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 43, "total_fatalities": 47, "captain_hours": 25000, "captain_hours_type": 9500, "copilot_hours": 4288, "copilot_hours_type": 612, "aircraft_hours": 45746, "circumstances": "The aircraft was on a flight from John F . Kennedy International Airport, New York, to Ben Gurion International Airport, Tel Aviv, with an intermediate stop at Schiphol Airport for a crew change and cargo processing. The aircraft arrived in Amsterdam at 13:40 and was scheduled for departure at 16:30 but received an air traffic control slot time of 17:20 for departure. The maintenance transit check was carried out. The aircraft was refuelled with 74,200 litres of Jet A1 fuel, making the total amount of fuel on board of 72 metric tons. The four people on board the aircraft at take off were the captain, copilot, flight engineer, and one non-revenue passenger. There was a total of 114.7 metric tons of cargo on board of which 6.5 metric tons were considered low grade dangerous goods. The flightcrew involved in the accident had arrived at Schiphol Airport on a previous El Al flight and had 20 hours crew rest prior to the beginning of their crew duty. The air traffic situation at Schiphol Airport prior to the departure of EI Al 1862 was not extraordinary, according to ATC witnesses. Two runways were in use, 01L for take off and 06 for landing. There was moderate inbound traffic for runway 06, a moderate number of departures from 01L and several VFR flights over the northern part of the city of Amsterdam. From the beginning of El Al 1862's emergency declaration, air traffic services for the flight were provided by Amsterdam Radar on 124.87, Schiphol Approach on 121.2, Schiphol Arrival on 118.4 and indirectly by Schiphol Tower. The captain requested clearance for push back at 17:04. The aircraft taxied out at 17:14. The copilot was to be the pilot flying (PF), and the captain was to be the pilot not flying (PNF). The takeoff roll on runway 01L started at 17:21, with a takeoff gross weight of 338.3 metric tons, and the aircraft followed the Pampus departure as cleared by ATC. The performance limited maximum takeoff gross weight for the prevailing conditions of the flight was 359.3 metric tons. No anomalies were evident during the initial climb until 17:27.30, as the aircraft was passing through an altitude of about 6,500 feet. The flight data recorder revealed that the n°3 and 4 engines and their pylons departed the right wing at this time. The copilot then transmitted the emergency call, \"El Al 1862, mayday, mayday, we have an emergency\". The aircraft turned to the right, and according to witnesses on the ground, started dumping fuel immediately. The Amsterdam Radar controller confirmed the emergency call and immediately cleared the area of other traffic. At 17:28.06 the controller, not knowing the reason for the emergency call, asked the crew if they wanted to return to Schiphol Airport. After the acknowledgement by the crew of their intention to return to the airport they were instructed to turn to heading 260 and were informed about their position relative to Schiphol Airport. At 17:28.17 the crew reported a fire on engine n°3 and subsequently they indicated loss of thrust on engines n°3 and 4. Witnesses heard one or more banging sounds and saw a dark plume of smoke trailing the aircraft. Some witnesses saw objects fall. Other witnesses also saw fire on the right wing which eventually disappeared. When the aircraft turned right two vapour trails were seen to emerge from the wingtips. At 17:28.57, El Al 1862 was informed that runway 06 was in use and the wind was 040° at 21 knots. The flight crew however requested runway 27 for landing. ATC then asked the crew if they could switch radio frequency to Schiphol Approach Control on 121.2 megahertz. The crew immediately switched frequency to Approach Control. Subsequently the flightcrew was instructed to switch to Schiphol Arrival on 118.4 megahertz. Because the aircraft was only 7 miles from the airport and still flying at an altitude of 5,000 feet, a straight in approach was not feasible and the crew was instructed to turn right to heading 360 and descend to 2,000 feet. The crew was again informed about the wind (by then 050° at 22 knots). About one minute later at 17:31.17 the controller asked what distance they required to touchdown. Shortly thereafter, the controller asked for the number of track miles the flight crew required for an approach. The crew stated that they needed \"12 miles final for landing\". Together with this reply to ATC, the call \"Flaps 1\" could be heard as background conversation in the cockpit. ATC instructed El Al 1862 to turn right to heading 100. During the turn the controller asked for the status of the aircraft and was informed : \"n°3 and 4 are out and we have problems with the flaps\". The airplane had turned through heading 100 and was maintaining heading 120. No corrective action was taken by the controller. The aircraft maintained an airspeed of 260 knots and was in a gradual descent. El Al 1862 was cleared for the approach and directed to turn right to heading 270 to intercept the final approach course. The airplane was then at an altitude of about 4,000 feet, with a ground speed of approximately 260 knots and on heading 120. The position was 3 nautical miles north of the centreline of runway 27 at a distance of about 11 miles projected on the extended centreline of runway 27. According to the radar plot, it took about thirty seconds before the aircraft actually changed heading. When it became apparent that the airplane was going to overshoot the localizer, the controller informed the crew accordingly and directed the aircraft to turn further to heading 290 in an attempt to intercept the final approach again but now from the south. Twenty seconds later a new heading instruction to 310 was given, along with descent clearance to 1,500 feet. The flightcrew acknowledged this instruction at 17:35.03 and added, \"and we have a controlling problem\". Approximately 25 seconds later the copilot called, \"Going down 1862, going down \". In the first part of this transmission commands from the captain to raise all the flaps and to lower the landing gear could be heard. During the middle part of this transmission a sound was heard, and in the final part of the transmission another sound was audible. These sounds were later analyzed and determined to be the stick shaker and the ground proximity warning system respectively. The airplane crashed at 17:35.42 into an eleven-floor apartment building in the Bijlmermeer, a suburb of Amsterdam, approximately 13 km east of Schiphol Airport. The impact was centred at the apex of two connected and angled blocks of apartments and fragments of the aircraft and the buildings were scattered over an area approximately 400 meters wide and 600 meters long. Firefighting and rescue operations started shortly after the crash. The aircraft was destroyed by the impact and the resulting fire. The accident occurred during dusk. All four occupants as well as 43 people on the ground were killed. 26 other people on the ground were injured, 11 of them seriously.", "probable_cause": "The design and certification of the B 747 pylon was found to be inadequate to provide the required level of safety. Furthermore the system to ensure structural integrity by inspection failed. This ultimately caused - probably initiated by fatigue in the inboard midspar fuse-pin - the n°3 pylon and engine to separate from the wing in such a way that the n°4 pylon and engine were torn off, part of the leading edge of the wing was damaged and the use of several systems was lost or limited. This subsequently left the flight crew with very limited control of the airplane. Because of the marginal controllability a safe landing became highly improbable, if not virtually impossible.\n"}