{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-12p-novossibirsk-29-killed", "date": "Sep 27, 1954 at 0057 LT", "type": "Ilyushin II-12", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Yuzhno-Sakhalinsk – Krasnoyarsk – Novosibirsk – Moscow", "msn": "30 086", "yom": 1947, "flight_number": "SU010", "city": "Novosibirsk-Severny", "zone": "Novosibirsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 24, "pax_fatalities": 24, "other_fatalities": 0, "total_fatalities": 29, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On a night approach to Novosibirsk-Severny Airport, the crew encountered bad visibility due to fog. On final, the aircraft was 300 meters to the left of the glide and the crew failed to have a visual contact with the runway and ground. In such conditions, the captain decided to abandon the approach and made a go around. Few minutes later, the crew started a second approach with a horizontal visibility of 100 meters. Without any visual contact with the ground or the runway, the pilot-in-command continued the approach, passed below the decision height when the airplane hit trees and crashed in a wooded area located few km short of runway. The aircraft was totally destroyed upon impact but there was no fire. All 29 occupants were killed. ", "probable_cause": "It was determined that the visibility was below minima at the time of the accident. Because the crew failed to establish any visual contact with the ground and did not have the runway in sight, it would be necessary to divert to the alternate airport for a safe landing. Continuing the approach without any visual contact with the ground and passing below the decision height, the crew engaged the aircraft in a controlled flight into terrain. "}