{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-178-burlington", "date": "Sep 20, 1948 at 1141 LT", "type": "Douglas DC-3", "operator": "Colonial%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Montreal –    Burlington – New York", "msn": "1921", "yom": 1937, "flight_number": "COL003", "city": "Burlington", "zone": "Vermont", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 14, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3727, "captain_hours_type": 2537, "copilot_hours": 5417, "copilot_hours_type": 1517, "aircraft_hours": 34238, "circumstances": "The flight departed Montreal at 1112LT and was cleared to Burlington by the Civil Aeronautics Air Route Traffic Control to proceed In accordance with visual flight rules. A message was received from the aircraft, by the Colonial radio at Burlington, indicating that it was over the Grand Isle Fan Marker, approximately 25 miles northwest of Burlington at 1135. Colonial radio acknowledged the report and transmitted the latest local weather ceiling 800 feet, visibility 1 mile in heavy rain. This report was acknowledged. Nearing the airport, light rain was encountered. The flight asked Burlington Tower for its existing traffic, and being in the approach control area, farther asked permission to make an approach from its present position. After checking with Boston Air Route Traffic Control establishing that no traffic was in the area, the aircraft was cleared to approach VFR. The windshield wipers were turned on and simultaneously wit passing over the range station at an altitude of approximately 700 feet and sighting the airport, the tower called and stated that it had the ship in sight and that the flight was cleared to land. Flight 3 previously had been informed that the surface wind was west, variable to northwest, 5 mph, and due to a heavy rain occurring east of the airport the pilot elected to use Runway 1. The aircraft headed southwest in order to widen the pattern and establish a downwind leg at a suitable distance from the runway. During the turn to final approach the flaps and landing gear were extended, and descent was made toward the airport aligned with Runway 01. The aircraft landed long and was unable to stop within the remaining runway, overran and came to rest in trees. All 17 occupants escaped slightly injured while the aircraft was damaged beyond repair.", "probable_cause": "The Board determines that the probable cause of this accident was the pilot's action in landing too fast and too far down the wet runway following a high approach.\r\nThe following factors were considered as contributory:\r\n- The captain elected to land on Runway 1, approximately 3,600 feet in length, the surface wind being west variable, northwest 5 mph,\r\n- Touchdown was at a distance of 1,875 feet from the approach end of the runway, followed by no perceptible deceleration of the aircraft,\r\n- The aircraft again became airborne only 175 feet from the end of the runway, and as a result struck trees adjacent to the airport."}