{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-near-olsberg-2-killed", "date": "Jun 23, 2014 at 1438 LT", "type": "Learjet 35", "operator": "GFD", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Plain, Valley", "schedule": "Hohn - Hohn", "msn": "35A-612", "yom": 1985, "flight_number": null, "city": "Olsberg", "zone": "North Rhine-Westphalia", "country": "Germany", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7505, "captain_hours_type": 3554, "copilot_hours": 3560, "copilot_hours_type": 745, "aircraft_hours": 8259, "circumstances": "On 23 June 2014 at 1522 hrs the Bundeswehr (German Armed Forces) informed the German Federal Bureau of Aircraft Accident Investigation (BFU) that a collision involving a civil Learjet 35A (Learjet) and a German Air Force Eurofighter had occurred during aerial target demonstrations. According to the Law Relating to the Investigation into Accidents and Incidents Associated with the Operation of Civil Aircraft (FlUUG) accidents and incidents involving civil and military aircraft will be investigated under the responsibility of the BFU. The BFU immediately deployed a team of five investigators to the accident site. The BFU was supported by the Directorate Aviation Safety of the German Armed Forces (AbtFlSichhBw). The Learjet, operated by a civil operator specializing in manned aerial target demonstrations, had taken off at Hohn Airport and had initially been flying with a southern heading in accordance with Instrument Flight Rules (IFR). At the time of the accident the Learjet had changed to Visual Flight Rules (VFR) and was flying in airspace E with a northern heading. A formation consisting of two Eurofighters had taken off from Nörvenich Air Base with the order to conduct a so-called Renegade mission, i.e. the unknown civil aircraft had to be intercepted, identified, and accompanied to a military airport. After the collision with a Eurofighter, the Learjet crashed to the ground. The pilots of the Learjet suffered fatal injuries and the aircraft was destroyed. The pilot of the Eurofighter could land the severely damaged airplane at Nörvenich Air Base. ", "probable_cause": "The causes of the flight accident were:\r\nImmediate Causes:\r\n- During positioning for the intervention the collision risk due to unexpected manoeuvres of the intercepted airplane was not sufficiently taken into consideration.\r\n- The Learjet crew did not take into account the risks due to possible limitations of the field of vision and the distraction by using the computer when deciding about the task distribution. Due to insufficient situational awareness during the intervention, the Learjet crew continued the turn with an excessive bank angle despite the loss of visual contact with the Eurofighter flying at the inside of the turn.\r\nSystemic Causes:\r\n- The operator had not specified in detail how the crew should distribute their tasks during Renegade exercises.\r\n- Neither the operator commissioned to conduct the aerial target demonstration nor the Air Force had sufficiently described the Renegade training nor had a commensurate risk analysis been done. "}