{"url": "https://www.baaa-acro.com/crash/crash-boeing-xb-29-super-fortress-seattle-34-killed", "date": "Feb 18, 1943 at 1226 LT", "type": "Boeing B-29 Superfortress", "operator": "Boeing", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "No", "site": "City", "schedule": "Seattle - Seattle", "msn": "2482", "yom": 1941, "flight_number": null, "city": "Seattle", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 11, "crew_fatalities": 11, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 23, "total_fatalities": 34, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was performing a test flight on this second prototype. Ten minutes after departure from Seattle-Boeing Field, the crew informed ATC that engine number one caught fire and attempted to return. At an altitude of 2,400 feet, pilot feathered the propeller and notified ATC that the fire was spreading quickly. One minute later, as it was about to land, the bomber struck a power line and crashed on an industrial butchery. Extensive emergency resources were dispatched to the scene where rescuers did not find any survivors among the debris scattered over a wide area. The building was destroyed as well and 34 dead bodies were found: all 11 occupants on board the airplane and 23 people on ground. Thirty others people were injured as well.\r\nCrew:\r\nEddie Allen, Chief test pilot by Boeing, \r\nBob Dansfield, captain. ", "probable_cause": "A fire on engine number one was likely due to the rupture of a supply fuel line. When fuel  contacted the engine nacelle and several other components whose temperature was high, a fire erupted that quickly spread across the wing. On final approach, a violent explosion occurred on the left wing when fire contacted the valves of the wing defrost system which was mainly composed of magnesium. In addition, air flowing under the leading edge slats  boosted flames significantly, which was considered as a contributory factor. Following this tragedy, Boeing technicians were forced to modify the engine fuel system as well as some others points."}