{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-1-dl-vancouver-1-killed", "date": "Aug 19, 1995 at 0906 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Air-North", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Vancouver – Whitehorse", "msn": "20833", "yom": 1944, "flight_number": null, "city": "Vancouver", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The DC-3 aircraft, with the captain, first officer, and an apprentice aircraft maintenance engineer on board, was to be ferried from Vancouver, British Columbia, to Whitehorse, Yukon. Just after take-off from runway 08, as the first officer was setting the engine power, the right propeller began to over-speed. The captain told the first officer to shut down and feather the right engine. The first officer did as instructed, and advised the Vancouver tower controller of the engine problem and that they would return to the airport to land on runway 08. The captain turned the aircraft to the right, onto downwind for runway 08; however, because the aircraft's altitude and airspeed were decreasing, the first officer advised the tower controller that they would land on runway 30. The aircraft continued to lose height, narrowly avoiding buildings in its path, and crashed to the ground, one mile short of runway 30. The three occupants were seriously injured during the impact and the post-crash fire; the captain died of his injuries eight days after the accident.", "probable_cause": "The aircraft's right engine oil system malfunctioned for reasons that were not determined, and the right propeller did not completely feather during the emergency shutdown. The aircraft was unable to maintain flight because of the drag generated by the windmilling right propeller."}