{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-82-detroit-156-killed", "date": "Aug 16, 1987 at 2045 LT", "type": "McDonnell Douglas MD-82", "operator": "Northwest%20Airlines2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Saginaw - Detroit - Phoenix - Santa Ana", "msn": "48090", "yom": 1981, "flight_number": "NW255", "city": "Detroit-Metropolitan-Wayne County", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 149, "pax_fatalities": 148, "other_fatalities": 2, "total_fatalities": 156, "captain_hours": 20859, "captain_hours_type": 1359, "copilot_hours": 8044, "copilot_hours_type": 1604, "aircraft_hours": 14928, "circumstances": "A McDonnell Douglas DC-9-82 operating Northwest Airlines flight 255 was destroyed when it crashed onto a road during takeoff from Detroit-Metropolitan Wayne County Airport, Michigan, USA. Just one of the 155 occupants survived the accident. Additionally, Two persons on the ground were killed. Flight NW255 was a regularly scheduled passenger flight between Saginaw, Michigan and Santa Ana, California, with en route stops at Detroit and Phoenix, Arizona. About 18:53, flight 255 departed Saginaw and about 19:42 arrived at its gate at Detroit. About 20:32, flight 255 departed the gate with 149 passengers and 6 crewmembers on board. During the pushback, the flightcrew accomplished the BEFORE (engine) START portion of the airplane checklist, and, at 20:33, they began starting the engines. The flight was then cleared to \"taxi via the ramp, hold short of (taxiway) delta and expect runway three center [3C] (for takeoff)...\" The ground controller amended the clearance, stating that the flight had to exit the ramp at taxiway Charlie. The crew was requested to change radio frequencies. The first officer repeated the taxi clearance, but he did not repeat the new radio frequency nor did he tune the radio to the new frequency. At 20:37, the captain asked the first officer if they could use runway 3C for takeoff as they had initially expected 21L or 21R. After consulting the Runway Takeoff Weight Chart Manual, the first officer told the captain runway 3C could be used for takeoff. During the taxi out, the captain missed the turnoff at taxiway C. When the first officer contacted ground control, the ground controller redirected them to taxi to runway 3C and again requested that they change radio frequencies. The first officer repeated the new frequency, changed over, and contacted the east ground controller. The east ground controller gave the flight a new taxi route to runway 3C, told them that windshear alerts were in effect, and that the altimeter setting was 29.85 inHg. The flightcrew acknowledged receipt of the information. At 20:42, the local controller cleared flight 255 to taxi into position on runway 3C and to hold. He told the flight there would be a 3-minute delay in order to get the required \"in-trail separation behind traffic just departing.\" At 20:44:04, flight 255 was cleared for takeoff. Engine power began increasing at 20:44:21. The flightcrew could not engage the autothrottle system at first, but, at 20:44:38, they did engage the system, and the first officer called 100 knots at 20:44:45. At 20:44:57, the first officer called \"Rotate.\" Eight seconds later, the stall warning stick shaker activated, accompanied by voice warnings of the supplemental stall recognition system (SSRS). The takeoff warning system indicating that the airplane was not configured properly for takeoff, did not sound at any time prior or during takeoff. After flight 255 became airborne it began rolling to the left and right before the left wing hit a light pole in a rental car lot. After impacting the light pole, flight 255 continued to roll to the left, continued across the car lot, struck a light pole in a second rental car lot, and struck the side wall of the roof of the auto rental facility in the second rental car lot. The airplane continued rolling to the left when it impacted the ground on a road outside the airport boundary. The airplane continued to slide along the road, struck a railroad embankment, and disintegrated as it slid along the ground. Fires erupted in airplane components scattered along the wreckage path. Three occupied vehicles on the road and numerous vacant vehicles in the auto rental parking lot along the airplane's path were destroyed by impact forces and or fire. One passenger, a 4-year-old child was injured seriously.", "probable_cause": "The flight crew's failure to use the taxi checklist to ensure that the flaps and slats were extended for take-off. Contributing the accident was the absence of electrical power to the airplane take-off warning system which thus did not warn the flight crew that the airplane was not configured properly for take-off. The reason for the absence of electrical power could not be determined."}