{"url": "https://www.baaa-acro.com/crash/crash-grumman-m-16-albatross-itacaja", "date": "Jan 17, 1979 at 0755 LT", "type": "Grumman HU-16 (SA-16) Albatross", "operator": "Forca-Aerea-Brasileira-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Carolina - Florianópolis", "msn": "G-45", "yom": 1950, "flight_number": null, "city": "Itacajá", "zone": "Tocantins", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9777, "captain_hours_type": 6270, "copilot_hours": 1128, "copilot_hours_type": 997, "aircraft_hours": null, "circumstances": "En route from Carolina to Florianópolis, while cruising at an altitude of 8,000 feet, the right engine failed due to a major oil leak. The crew of two, the only occupant, shut down the right engine and feathered its propeller. Despite full power was added on the left engine, the crew was unable to maintain a safe altitude and was forced to jettison some of the cargo and auxiliary tanks as well. Finally, the crew decided to attempt an emergency landing in an open field but on short final, the left engine lost power. This caused the undercarriage to be lowered too late and upon touchdown, they were not locked down. The aircraft crash landed and skidded on its belly before coming to rest. While both pilots were uninjured, the aircraft was damaged beyond repair. ", "probable_cause": "It was determined that the failure of the right engine was the consequence of a major oil leak on the head of the cylinder n°9 due to an important accumulation of steel and aluminium deposit in the internal part of the engine. It was also reported that the lubrication system was inoperative due to the failure of a hydraulic pump. Due to poor weather conditions in the area, it was not possible for the crew to attempt an emergency landing in the Tocantins River and the terrain chosen for the emergency procedure was not compatible and suitable for such aircraft type, which aggravated the damages upon landing. "}