{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900c-1-sao-tome-1-killed", "date": "Apr 7, 2013 at 1613 LT", "type": "Beechcraft 1900C", "operator": "Sahel%20Aviation%20Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Johannesburg – Ondangwa – São Tomé – Accra – Bamako", "msn": "UC-74", "yom": 1989, "flight_number": null, "city": "São Tomé", "zone": "Água Grande", "country": "São Tomé and Principe", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10756, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 23388, "circumstances": "The aircraft was planned to fly from Lanseria airport (FALA) in Republic of South Africa to Bamako airport (GABS) in Mali with a stopover in Ondangwa airport (FYOA) in Namibia, São Tomé International airport (FPST) in São Tomé and Príncipe and Accra airport (DGAA) in Ghana, with a rough estimating time of approximately 15hrs flying, not including the ground time at airports of stopover. The aircraft had been in Lanseria airport (FALA) in Republic of South Africa (RSA) for maintenance check (including but not limited to engine work and interior refurbishing). Prior to the planned flight, the aircraft underwent flight check for 45 minutes after completed planned maintenance on Saturday, April 6th, flown by the Captain and another SAS company pilot. The aircraft departed FALA to FYOA for its first stop over whose flight time was 03:35h. The planned departure from FYOA was delayed due to trouble in starting the right engine. The aircraft took off at 1021hrs contrary to planned 0830hrs. For the second leg of the flight, the aircraft departed FYOA to FPST with filed flight plan of 05 hours and 20 minutes (flight time) having FYOA as alternate. Leaving the Namibian airspace the pilot only contacted Luanda ATC and São Tomé Tower as destination, and at no time did he contact Brazzaville or Libreville for any further clearance within Brazzaville FIR: It is important to emphasize that on that day, the west coast of Africa in the vicinity of Gulf of Guinea had widespread moderate to severe thunderstorm activity with lighting and heavy rain. When initiating descent to São Tomé from FL 200 to 4000 feet as instructed by São Tomé ATC, the pilot was advised that weather was gradually deteriorating at airport vicinity. At 1610hrs the pilot had last transmission with Control Tower informing them about his position which was 9 nm inbound to São Tomé VOR at 4000 feet and also informed the ATC that he was encountering heavy rain. Having lost contact with aircraft at 1613hrs, the São Tomé ATC tried several times to contact the airplane by VHF118.9, 127.5, 121.5 and HF 8903 without success. Facing this situation the ATC sent messages to FIRs of Brazzaville and Accra and Libreville Control as well, some airlines flying within São Tomean an adjacent airspace were contacted for any information but all responses were negative. A Search and Rescue operation started on 7 April 2013 the same day the accident occurred and was conducted on the sea and on the island; no trace of aircraft or its debris, pilot or any cargo were found. The search was terminated on 20 April at 1730hrs.\n", "probable_cause": "By the fact that there is no evidence of the crash, the cause of the accident cannot be conclusively decided, however the investigation discovered series of discrepancies and noncompliance which includes:\r\nPilot:\r\n- Planned long flight as solo pilot from Lanseria to Bamako is excessive for pilot fatigue perspective (over 15 hours flying).\r\n- The First Class FAA (USA) medical Certificate issued on April 23rd 2012 had expired on October 31st 2012.\r\nMeteorological Conditions:\r\n- Adverse weather conditions enroute and on arrival on that day, the west coast of Africa in the vicinity of Gulf of Guinea had widespread moderate to severe thunderstorm activity with lighting and heavy rain. When initiating descent to Sao Tome, the pilot was advised that weather was gradually deteriorating at airport vicinity."}