{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-201-la-guardia-1-killed", "date": "Dec 30, 1945 at 2113 LT", "type": "Douglas DC-3", "operator": "Eastern-Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jacksonville – Savannah – Columbia – Raleigh – Richmond – Washington DC – Philadelphia – La Guardia", "msn": "1999", "yom": 1937, "flight_number": "EA014", "city": "New York-LaGuardia", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 11, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 8057, "captain_hours_type": 4957, "copilot_hours": 967, "copilot_hours_type": 215, "aircraft_hours": 21348, "circumstances": "Following an uneventful flight from Philadelphia, the crew started the descent by night to La Guardia Airport in unfavorable weather conditions. A first attempt to land was aborted and during the second one, the aircraft was too high when it passed over the runway threshold. The captain reduced engine power and the initial contact with the runway occurred well down on runway at an airspeed considerably above the stalling speed of the aircraft. The aircraft bounded approximately 20 feet in the air and remained airborne for several hundred feet before again contacting the runway. After another shorter bounce, the aircraft remained on the runway and brakes were applied in an attempt to stop. However, due to the airspeed, which was still relatively high, and the snow and slush which covered the runway, little deceleration was accomplished. The aircraft continued off the end of the runway, demolished a small wooden building which housed the localizer transmitter, and came to rest in the Flushing Bay, approximately 200 feet beyond the field boundary. The aircraft was destroyed, 13 occupants were rescued while a passenger was drowned. ", "probable_cause": "The Board determines that the probable cause of this accident was the decision of the pilot in attempting a landing from an approach which was too high and too fast."}