{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-max-8-jakarta-189-killed", "date": "Oct 29, 2018 at 0631 LT", "type": "Boeing 737 MAX 8", "operator": "Lion%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Jakarta - Pangkal Pinang", "msn": "43000", "yom": 2018, "flight_number": "JT610", "city": "Jakarta", "zone": "City District of Jakarta", "country": "Indonesia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 181, "pax_fatalities": 181, "other_fatalities": 0, "total_fatalities": 189, "captain_hours": 6028, "captain_hours_type": 5176, "copilot_hours": 5174, "copilot_hours_type": 4286, "aircraft_hours": 895, "circumstances": "The aircraft departed runway 25L at Jakarta-Soekarno-Hatta Airport at 0621LT bound for Pangkal Pinang, carrying 181 passengers and 8 crew members. The crew was cleared to climb but apparently encountered technical problems and was unable to reach a higher altitude than 5,375 feet. At this time, the flight shows erratic speed and altitude values. The pilot declared an emergency and elected to return to Jakarta when control was lost while at an altitude of 3,650 feet and at a speed of 345 knots. The airplane entered a dive and crashed 12 minutes after takeoff into the Kerawang Sea, about 63 km northeast from its departure point. The airplane disintegrated on impact and few debris were already recovered but unfortunately no survivors. It has been reported that the aircraft suffered various technical issues during the previous flight on Sunday night but was released for service on Monday morning. Brand new, the airplane was delivered to Lion Air last August 18. At the time of the accident, weather conditions were considered as good. The Cockpit Voice Recorder (CVR) was found on 14 January 2019. In the initial stages of the investigation, it was found that there is a potential for repeated automatic nose down trim commands of the horizontal stabilizer when the flight control system on a Boeing 737 MAX aircraft receives an erroneously high single AOA sensor input. Such a specific condition could among others potentially result in the stick shaker activating on the affected side and IAS, ALT and/or AOA DISAGREE alerts. The logic behind the automatic nose down trim lies in the aircraft's MCAS (Maneuvering Characteristics Augmentation System) that was introduced by Boeing on the MAX series aircraft. This feature was added to prevent the aircraft from entering a stall under specific conditions. On November 6, 2018, Boeing issued an Operations Manual Bulletin (OMB) directing operators to existing flight crew procedures to address circumstances where there is erroneous input from an AOA sensor. On November 7, the FAA issued an emergency Airworthiness Directive requiring \"revising certificate limitations and operating procedures of the airplane flight manual (AFM) to provide the flight crew with runaway horizontal stabilizer trim procedures to follow under certain conditions.", "probable_cause": "Contributing factors defines as actions, omissions, events, conditions, or a combination thereof, which, if eliminated, avoided or absent, would have reduced the probability of the accident or incident occurring, or mitigated the severity of the\r\nconsequences of the accident or incident. The presentation is based on chronological order and not to show the degree of contribution. \r\n1. During the design and certification of the Boeing 737-8 (MAX), assumptions were made about flight crew response to malfunctions which, even though consistent with current industry guidelines, turned out to be incorrect.\r\n2. Based on the incorrect assumptions about flight crew response and an incomplete review of associated multiple flight deck effects, MCAS’s reliance on a single sensor was deemed appropriate and met all certification requirements.\r\n3. MCAS was designed to rely on a single AOA sensor, making it vulnerable to erroneous input from that sensor.\r\n4. The absence of guidance on MCAS or more detailed use of trim in the flight manuals and in flight crew training, made it more difficult for flight crews to properly respond to uncommanded MCAS.\r\n5. The AOA DISAGREE alert was not correctly enabled during Boeing 737-8 (MAX) development. As a result, it did not appear during flight with the mis-calibrated AOA sensor, could not be documented by the flight crew and was therefore not available to help maintenance identify the mis-calibrated AOA sensor.\r\n6. The replacement AOA sensor that was installed on the accident aircraft had been mis-calibrated during an earlier repair. This mis-calibration was not detected during the repair.\r\n7. The investigation could not determine that the installation test of the AOA sensor was performed properly. The mis-calibration was not detected. \r\n8. Lack of documentation in the aircraft flight and maintenance log about the continuous stick shaker and use of the Runaway Stabilizer NNC meant that information was not available to the maintenance crew in Jakarta nor was it available to the accident crew, making it more difficult for each to take the appropriate actions.\r\n9. The multiple alerts, repetitive MCAS activations, and distractions related to numerous ATC communications were not able to be effectively managed. This was caused by the difficulty of the situation and performance in manual handling, NNC execution, and flight crew communication, leading to ineffective CRM application and workload management. These performances had previously been identified during training and reappeared during the accident flight."}