{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-300-super-king-air-concord", "date": "Oct 19, 2000 at 1538 LT", "type": "Beechcraft 300 Super King Air", "operator": "AeroSmith Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Concord - San Jose", "msn": "FA-109", "yom": 1986, "flight_number": null, "city": "Concord-Buchanan Field", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10868, "captain_hours_type": 35, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3801, "circumstances": "The twin turboprop airplane overran the runway, impacted two fences, and an occupied automobile after the airline transport pilot attempted to abort a takeoff. The pilot performed a rolling takeoff and was paying close attention to balancing the engine power and keeping runway centerline alignment. As the airplane accelerated, the pilot set the power above 80 percent and began an instrument scan. He then noted the airspeed indicator was reading zero with the needle resting on the peg. After a moment's hesitation, the pilot attempted to abort the takeoff by reducing the power levers to flight idle, and subsequently over the gate to ground fine. He reported to the FAA that he did not place the power controls into the reverse position. Air traffic controllers reported they observed the airplane with its nose wheel off of the ground approximately 3/4 of the way down the 4,602-foot long runway. The aircraft's left and right pitot/static systems were examined and tested after the accident, and no anomalies were noted. The pilot obtained verbal training on rejected/aborted takeoffs for the accident airplane. He obtained his type rating and 14 CFR 135 check-out in the accident airplane approximately 1 month prior to the accident. The pilot had accumulated a total of 10,867.5 hours of flight time, of which 34.7 hours were accumulated in the accident aircraft make and model. The pilot reported his total pilot-in-command flight time in the accident aircraft make and model as 20 hours, all of which were accumulated within the preceding 30 days of the accident. Examination of the airplane, the flight instruments and the pitot/static system found no explanation for the pilot reported lack of airspeed reading. The brakes were found to be fully functional. Review of the performance charts for the airplane disclosed that for the weight and ambient conditions of the takeoff, the airplane required 4,100 feet for an\r\naccelerate-stop distance; the runway was 4,602 feet long.", "probable_cause": "The pilot's delayed decision to abort the takeoff and his failure to utilize the propeller's reverse pitch function."}