{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-42-720-cheyenne-iii-sorocaba-2-killed", "date": "Mar 31, 2017 at 1445 LT", "type": "Piper PA-42 Cheyenne", "operator": "Itapara", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Manaus - Sorocaba", "msn": "42-8001035", "yom": 1980, "flight_number": null, "city": "Sorocaba", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3382, "captain_hours_type": 118, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Manaus-Aeroclub de Flores Airport on a flight to Barra do Garças, carrying one passenger and one pilot. After takeoff from Manaus, the pilot changed his mind and decided to fly to Sorocaba. On final approach to Sorocaba-Bertram Luiz Leupolz Airport in good weather conditions, the aircraft impacted trees and crashed in a wooded area located about one km short of runway 18. The aircraft was destroyed and both occupants were killed. There was no fire. ", "probable_cause": "Contributing factors:\r\n- Flight indiscipline – a contributor\r\nThe pilot failed to comply with the minimum fuel requirements laid down in the regulations, providing conditions for both engines to stop operating in flight, due to lack of fuel.\r\n- Piloting judgment – a contributor\r\nIt was found in this flight an inadequate evaluation for certain parameters related to aircraft operation, particularly with regard to the influence of the chosen flight level on fuel consumption. This misjudgment led to the decision to proceed with the flight to the Aerodrome where it was intended to land, to the detriment of the more conservative option of finding a suitable place for an intermediate landing and a refueling, which led to the depletion of usable fuel in flight.\r\n- Flight planning – a contributor\r\nInadequate flight preparation work, especially with regard to fuel calculation and cruise level selection, has degraded the safety level and also contributed to the actual accident. \r\n- Decision-making process – undetermined\r\nDifficulties in perceiving, analyzing, choosing alternatives, and acting appropriately due to inadequate judgment, may have resulted in poor assessment of flight parameters (available fuel, distance to destination, verified consumption, etc.), which may have favored the occurrence of lack of fuel failure.\n"}