{"url": "https://www.baaa-acro.com/crash/crash-vickers-417-wellington-iii-black-intake-moor-5-killed", "date": "Feb 12, 1943 at 2300 LT", "type": "Vickers 417 Wellington III", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Bombing", "survivors": "No", "site": "Mountains", "schedule": "Croft - Croft", "msn": null, "yom": null, "flight_number": null, "city": "Black Intake Moor", "zone": "North Yorkshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew of this Wellington christened 'A for Apple' took off from RAF Croft at 1726LT for what is believed to have been a mine laying operational flight. Aircraft from various squadrons were mine laying the waters around The Frisians and Helgoland on this night. Other modern accounts quote Le Havre as being a land target for bombs but this is believed to not be correct. The accident record card for this incident; the Form Am1180, makes no mention of what the target was hence the confusion. The crew dropped their cargo and headed for home but were hit by flak. Before they could land at base the aircraft flew across the North Yorkshire Moors, the Moors were covered in a thick band of cloud at the time and the crew became uncertain of their position on their return to Yorkshire; they had probably flown off course by a few degrees. They descended to try and work out their location but struck high ground east of Chop Gate on Black Intake Moor at 2300LT and all on the aircraft lost their lives in the crash which completely destroyed the aircraft. \r\nCrew (427th Squadron):\r\nSgt Oscar Philip Edwin Ronald J. Adlam, pilot,\r\nF/O Bryan Dunn, navigator,\r\nSgt William Charles Ivor Jelley, wireless operator and air gunner, \r\nSgt Arnold Charles Clifford, bombardier, \r\nSgt William Ball, air gunner.\r\nSource: \r\nhttp://www.yorkshire-aircraft.co.uk/aircraft/planes/43/bj778.html", "probable_cause": null}