{"url": "https://www.baaa-acro.com/crash/crash-avro-683-lancaster-i-gander-4-killed", "date": "Aug 25, 1946 at 2359 LT", "type": "Avro 683 Lancaster", "operator": "Royal-Air-Force-4", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Gander - Gander", "msn": null, "yom": null, "flight_number": null, "city": "Gander", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 4, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "August 25, 1946 is a date that recalls very painful memories for some people in Newfoundland. Some of the people to whom I refer are Gander residents. A squadron of Lancaster Bombers of Royal Air force Bomber Squadron No. 35, took off for a routine operation. Shortly after takeoff one of the bombers reported an unserviceable compass and was authorized to return and land on runway 14. It succeeded in land on what is now runway 13. It was then designated runway 14 and approximately 3,000 feet shorter than it is today. There were no barriers around the airport. As a matter of face, people regularly walked across runway 14 as a shortcut from the American side to the Canadian side. The perimeter road was so close to the ends of the runways that a system of lights and bells were erected to warn pedestrians and vehicles. The warning system was activated by the control tower a few minutes prior to the arrival of aircraft. The idea was to prevent traffic from travelling on the road until the aircraft had landed. This work well in normal situations, however, when an aircraft departed and had to return immediately, there wasn’t sufficient time for the warning system to be effective. A group of people had gathered near the end of runway 14, watching a squadron of military aircraft depart. Some of the people were on their way home from the United Church evening service. Fifteen year old Trixie Burton (Trixie Smith of Cotton Street, Gander), was hold the hand of her friend, 21 year old, Isola Clarke. They were look toward the runway. They heard nothing behind them – no noise, no gushing of wind, no aircraft engines – nothing! Then, suddenly, Miss Clarke was struck from behind by a propeller of the large Lancaster and killed immediately. It was dark and the controllers in the tower didn’t realize what had happened. They saw the aircraft brake sharply and do, what appeared to be, a ground loop. A ground loop is an uncontrolled turn of approximately 180 degrees. The control tower call the aircraft several times but received no reply. The aircraft, TW870, - not to be confused with Trans World airlines – landed at 2359 Greenwich mean time. Three other people were also killed. They were Raymond Parsons, 20, who had just completed two years of pre-med at Memorial College, Cyril Brazil, 27, and 57 year old Stanley Rideout, all from St. John’s. William J. Mcdonald of St. Mary’s was among several others who were injured. None of the people gathered around had heard any indication of the approaching disaster. The fact that they heard nothing can be partly explained by the fact that aircraft land into the wind, i.e. facing the wind. The people who were standing near the end of runway 14 watching aircraft departing from that runway meant that the wind was blowing toward their faces. They would hear the noises in front of them but not behind them. Something else that added to the cause of the accident was the fact the aircraft did not use its landing lights. This may have been because the crew was too occupied to turn them on or may be as a result of the habit of the night-flying pathfinder squadron during the war. Those aircraft regularly landed and took off without the use of their landing lights.\nSource: \nhttp://www.ganderairporthistoricalsociety.org/_html_4658/lancaster_tragedy.htm", "probable_cause": null}