{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-100-bathurst", "date": "May 31, 1974 at 1822 LT", "type": "Fokker F27 Friendship", "operator": "Eastwest%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sydney - Orange - Bathurst", "msn": "10344", "yom": 1967, "flight_number": "EW752", "city": "Bathurst", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 30, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8067, "captain_hours_type": 6000, "copilot_hours": 5420, "copilot_hours_type": 514, "aircraft_hours": 17210, "circumstances": "Fokker F-27, registered VH-EWL, was operating as East-West Airlines Flight 752/753 from Sydney (SYD) to Orange, Bathurst and back to Sydney. The flight departed from Sydney at 17:06 hours and proceeded to Orange without incident. The flight then departed from Orange at 18:10 hours and, flown by the First Officer, the aircraft cruised at an altitude of 5250 feet which is the lowest safe altitude for the route. There was no cloud below the aircraft and the visibility was unrestricted. At Bathurst the weather was reported as a five knot wind from the north-east and the altimeter setting was 1021 millibars. The crew commenced the descent from a position about 5.5 km west of the aerodrome, in visual conditions, with the lights of the city of Bathurst and the runway lights clearly visible. Initially, it was intended to overfly the aerodrome and then make a left-hand circuit preparatory to landing on runway 17, but when the captain saw what appeared to be a light rain shower slightly east of the runway 35 threshold, and which might have involved penetration during a left-hand circuit to runway 17, he decided to land on runway 35 instead. At 1817:30 hours the captain called Sydney Flight Service reporting that the aircraft had arrived in the Bathurst circuit area. The aircraft, which was still being flown by the First Officer, was turned some 90 degrees to the right and it joined the left downwind leg of the traffic circuit for a landing on runway 35. The aircraft proceeded downwind a little further than is usual then turned onto base leg of the circuit by which time all cockpit checks had been completed except for setting the engine fuel trims to 'full increase'. The captain states that whilst the aircraft was on the base leg he checked that the water methanol lights were on, and that the fuel trim indicators were at 'full increase'. The aircraft was turned onto final approach for landing, at which time the landing gear was down, 26.5 degrees of wing flap had been extended, it was aligned with the runway centre-line and no drift was evident. Flight conditions were smooth. Light rain was then encountered and the windscreen wipers were switched on to operate at slow speed. The flight path appeared to be normal at an airspeed of 110 knots reducing to 100 knots with the rate of descent stabilised at some 700 ft/min. At about this time the aircraft passed over the Great Western Highway (730 metres south of the runway 35 threshold) and at the normal height of about 300 feet above terrain; two or three noticeable turbulence bumps were then encountered and the aircraft commenced to drift to the left of the runway alignment. The aircraft heading was altered a few degrees to the right and the approach was continued in light to moderate turbulence with the rain intensity increasing to heavy as the aircraft approached the runway threshold; the windscreen wipers were then selected to operate at high speed. At  approximately 200-250 feet above terrain and prior to reaching the runway threshold, on the command of the Captain, the First Officer initiated a go-around because the aircraft had drifted too far to the left of the runway centre-line to safely effect a landing. The First Officer placed the power levers in the position for maximum power and he rotated the aircraft, by reference to the flight instruments, to the normal body attitude of 8 to 9 degrees for initial climb. The response of the engines appeared normal to the crew and they believed that full 'wet' power was being developed. Immediately after the engine power increased the captain raised the wing flaps from the setting of 26.5 degrees to 16.5 degrees, and he retracted the landing gear. At the commencement of the go-around the aircraft was still in conditions of turbulence and heavy rain and that, initially, the aircraft maintained its altitude; the indicated airspeed then decayed rapidly to 73 knots at which time the aircraft was estimated to be 80-100 feet above the runway. As the indicated airspeed decreased the First Officer lowered the nose of the aircraft slightly but still maintained a climbing attitude. At about this time the captain took hold of his control wheel but the First Officer continued to fly the aircraft by reference to his flight instruments. The indicated airspeed remained at 73 knots for a few seconds then rapidly increased to about 80-85 knots; it was not fluctuating and the turbulence had ceased. The rear fuselage of the aircraft then impacted the ground heavily just outside the boundary of the flight strip, at a point 1240 metres north of the runway 35 threshold, 48 metres to the right of the runway centre-line. The aircraft slid along on the fuselage for a distance of 625 metres during which the starboard engine was torn out of the wing. Cockpit impact drill was initiated by the flight crew during the ground slide and completed when the aircraft came to rest. The crew and passengers evacuated the aircraft at which time there was little or no rain at their location and there was a light breeze from a southerly direction.", "probable_cause": "During the climb performance of the aircraft was adversely affected by an unpredictable encounter with a large change in the horizontal wind component, and an associated downdraft, at a height too low to effect recovery."}