{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-14d-kiev-7-killed", "date": "Aug 17, 1957 at 2002 LT", "type": "Ilyushin II-14", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Kiev - Kiev", "msn": "1470 014 32", "yom": 0, "flight_number": null, "city": "Kiev-Zhuliany-Igor Sikorsky", "zone": "Kiev oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 3, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 157, "circumstances": "The crew was performing a local training flight at Kiev-Zhuliany. While flying at an altitude estimated between 250 to 300 meters, the aircraft collided with an Aeroflot Ilyushin II-14G registered CCCP-L2071 that was approaching the same airport following a cargo flight SU126 from Sofia with five crew members on board. Investigations determined that the propeller of the right engine of L2071 struck the right wing of the L1360, proving that both airplanes were facing each other. Following the collision, L1360 lost its right wing, dove into the ground and crashed while L2071 lost its right propeller that penetrated the cockpit and killed instantly both pilots. Out of control, the airplane also dove into the ground. Both aircraft crashed onto several houses located 4,5 km from the airport. All 9 crew members were killed as well as six people on the ground. 23 others were injured, 12 of them seriously.", "probable_cause": "It was determined that the collision was the consequence of a lack of radar coverage, guidance and assistance on part of the ATC at Kiev-Zhuliany Airport. It was reported that the crew of L2071 was not informed about the presence of a second aircraft performing training maneuvers in the vicinity of the airfield at the same altitude."}