{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-90-dl-palmeira-de-goias-24-killed", "date": "Aug 12, 1952 at 0940 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Transportes-Aereos-Nacional", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Jataí – Rio Verde – Goiânia – Uberlândia – Rio de Janeiro", "msn": "20187", "yom": 1944, "flight_number": null, "city": "Palmeira de Goiás", "zone": "Goiás", "country": "Brazil", "region": "South America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 20, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the leg from Rio Verde to Goiânia, the crew informed ground that a fire erupted in the cabin and the captain decided to divert to Palmeira de Goiás for a safe landing. The crew tried several times to extinguish the fire but without success. Eventually, the pilot-in-command reduced his altitude in an attempt to make an emergency landing when, at a height of about 20 meters, the airplane exploded in the air and crashed few km from the airport of Palmeira de Goiás. The aircraft disintegrated on impact and all 24 occupants were killed. ", "probable_cause": "Investigators arrived on scene two days after the crash and confirmed that the wreckage was looted by locals. Due to the absence of evidence, it was very difficult to establish the exact cause of the accident. Nevertheless, it is believed upon the testimony of several eyewitnesses that a fire erupted in the rear of the cabin and not in the fuel tanks located in the wings. It is possible that the fire was caused by inflammable materials stored in the bagage compartment. The fact that the aircraft was not equipped with fire detectors was considered as a contributory factor as it took time for the crew to analyse and understand the situation.  "}