{"url": "https://www.baaa-acro.com/crash/crash-tupolev-ant-20-tushino-44-killed", "date": "May 18, 1935 at 1245 LT", "type": "Tupolev ANT-20", "operator": "Tupolev", "flight_phase": "Flight", "flight_type": "Demonstration", "survivors": "No", "site": "City", "schedule": "Tushino - Tushino", "msn": "ANT-20-01", "yom": 1934, "flight_number": null, "city": "Tushino", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 33, "pax_fatalities": 33, "other_fatalities": 9, "total_fatalities": 44, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "This first prototype made his first flight on My 19, 1934. One year later, in Tushino, engineers, pilots and technicians working for Tupolev were engaged in a demonstration flight by the Tushino Air Show. Named 'Maxim Gorki', the eight engine machine was completing a demonstration flight over Moscow with three other aircraft: two Polikarpov I-5 and one Tupolev ANT-14. While cruising at a height of about 600 metres, the pilot of the Polikarpov I-5 cruising parallel to the Tupolev on its left side made a turn to complete a tour over the Tupolev. This manoeuvre was prohibited and unscheduled. Most probably the pilot of the Polikarpov misjudged the distance between both aircraft, and the Polikarpov collided with the Tupolev. Following the collision, both aircraft dove into the ground and crashed in a residential area located in Sokol, near the Tushino Airfield. All 35 occupants on board the 'Maxim Gorki' were killed as well as nine people on the ground and the pilot of the Polikarpov. Up to date, this crash was considered as the worst in the world. \r\nCrew: \r\nI. V. Mikheyev and I. S. Zhurov, pilots of the Maxim Gorki. \r\nNikolaï Blagin, pilot of the Polikarpov I-5. ", "probable_cause": "In flight collision caused by a poor judgement on part of the pilot of the Polikarpov I-5. "}