{"url": "https://www.baaa-acro.com/crash/crash-short-360-100-stornoway", "date": "Feb 9, 1998 at 1147 LT", "type": "Short 360", "operator": "British%20Regional%20Airlines.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Benbecula - Stornoway", "msn": "3641", "yom": 1984, "flight_number": null, "city": "Stornoway", "zone": "Hebrides Islands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 26, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5300, "captain_hours_type": 5000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "This final sector was flown at FL 50, with the aircraft in IMC conditions. The crew noted no indication of ice at this level and the use of the aircraft de-icing equipment was not required. Prior to their approach to Stornoway, the crew contacted ATC and noted the following information: Runway 36 in use, surface wind 260°/ 08 kt, visibility 15 km in light drizzle, cloud few at 800 feet and broken at 1,400 feet agl, temperature plus 7°C and QNH 1002 mb. The commander then briefed for a NDB/DME approach for Runway 36. With G-BLGB still at FL 50, the crew completed the 'Descent' checks and then, when cleared for the procedure completed the 'Approach' checks 'to the line'. The initial approach was normal and the crew were VMC at a range of approximately 8 nm from the airfield. At this stage the commander was certain of his geographical position and, with the agreement of his first officer, decided to continue visually. Although they were in sight of the surface, there appeared to be some patchy cloud in the direction of the airfield and neither pilot could see the runway. The crew completed the rest of the 'Approach' checks and then did the 'Final' checks down to 'Flaps'; Flap 15 had been selected. By now, the commander was level at his minimum descent altitude (MDA) of 430 feet amsl. Shortly afterwards, the crew acquired visual contact with the runway; the aircraft was to the right of the extended centreline and the crew could see the Precision Approach Path Indicators (PAPI) which were indicating 'four whites'; the commander estimated his range from the runway as one mile. He subsequently recalled that, at the time he considered 'going around' but, considering the length of Stornoway runway, decided to land. The commander called for \"Full flap\" and for \"Props to max\", and manoeuvred G-BLGB to the runway extended centreline. His subsequent approach was based on runway perspective with the intention of touching down beside the PAPIs. During this final approach, the first officer was monitoring the airspeed and initially called out \"Plus 10\"; this signified a speed of 113 kt based on a VAT of 103 kt. Thereafter, he called \"Plus 5\", \"VAT\" and then \"Minus 5\" before calling for \"Power\" on several occasions just before touchdown. Neither pilot could remember the PAPI lights during this final part of the approach and the commander did not think that he exceeded 1,000 feet per minute rate of descent. He was certain that the Ground Proximity Warning System (GPWS) had not activated during the final approach. The commander remembers pulling back on the control wheel just before touchdown but that this had no effect on the rate of descent; he also advanced the power levers but the aircraft had landed before any increase in power was apparent. Touchdown was 'Firm' and beside the PAPIs. On landing, there was a 'bang' and the left side of the aircraft went down. G-BLGB slewed to the left and the commander used full right rudder and brake in an attempt to counter this movement. The aircraft came to rest at the left edge of the runway. With the aircraft stopped, the first officer shut both engines down and the commander switched off the 'Electrics'. The commander then opened the door to the cabin and, saw that the rear emergency door at the rear right side was open and the evacuation was in progress; the flight crew followed the passengers out of the door. Immediately following the landing, the first officer declared a 'problem' to ATC. The controller had been monitoring the approach and noted the apparent lack of a normal flare; following the call from the crew, he immediately activated the 'Crash Alarm'. Within 30 seconds, the AFS had manned their vehicles and had checked in with the controller; the AFS were cleared direct to the aircraft and  arrived there within a minute of the initial call. There was no indication of fire but, with fluid leaking from the right gear, the AFS sprayed the area with foam.", "probable_cause": null}