{"url": "https://www.baaa-acro.com/crash/crash-consolidated-pby-5a-catalina-near-sona-lake", "date": "Oct 1, 1957", "type": "Consolidated PBY Catalina", "operator": "Eastern%20Provincial%20Airways", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Sona Lake - Goose Bay", "msn": "520", "yom": 1942, "flight_number": null, "city": "Sona Lake", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The ‘flying boat’ started her return trip after delivering fuel on Oct. 1, 1957 to an isolated communications site at Sona Lake. Her three-man crew had been watching dusk overtake the vast Labrador wilderness when, suddenly, about 80 kilometers from her destination, both engines began losing power. The port engine rapidly gave out. Distress calls were sent.  The pilots desperately tried to nurse his other still serviceable – but fading – engine long enough to reach a large lake he had seen below.  The power plant failed, however, and a landing in the trees became inevitable. The big amphibian mushed through treetops, bounced off a marsh, then struggled briefly back into the air until her starboard wing struck a small copse of pines.  The aircraft slewed around in a violent about-face the left the shaken but unhurt crew sighting along the path from which they’d come. The crew was reached the following day by a rescue float plane and soon the investigation team arrived to assess the Canso. Her leading edge was chopped by the trees, her hull was wrinkled and her props were bent.  The last ground loop had bent her port wing tip and cracked her spar.  The aircraft was written off.  Her cockpit was stripped and she was left to the wilderness.  For almost  three decades she lay in the bush – her paint work fading and her huge fabric surfaces slowly deteriorating.\r\nSource & photo:\r\nhttps://atlanticcanadaaviationmuseum.wordpress.com/2009/12/20/the-story-of-our-pby-5a-canso/", "probable_cause": null}