{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-1247-big-timber-2-killed", "date": "Jun 24, 2006 at 1420 LT", "type": "Pilatus PC-12", "operator": "JMH Capital", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Big Timber - Big Timber", "msn": "716", "yom": 2006, "flight_number": null, "city": "Big Timber", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3200, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 41, "circumstances": "The private pilot receiving instruction and his flight instructor departed on runway 06 with a headwind of 17 knots gusting to 23 knots. Witnesses said that the pilot had transmitted on Common Traffic Advisor Frequency the intention of practicing a loss of engine power after takeoff, and turning 180 degrees to return to the airport. Another witness said that the airplane pitched up 30 degrees while simultaneously banking hard to the right in an uncoordinated manner. He said that as the airplane rolled to the right, the nose of the airplane yawed down to nearly 45 degrees below the horizon. Subsequently, the airplane's wings rolled level, but the aircraft was still pitched nose down. He said the airplane appeared to be recovering from its dive. A witness said that the airplane appeared to be in a landing flare when he observed dirt and grass flying up behind the aircraft. He said the airplane's right wing tip and engine impacted terrain, and a fire ensued that consumed the airplane. Examination of the accident site revealed that the airplane's right wingtip hit a 10 inch in diameter rock and immediately impacted a wire fence 10 inches above the ground. Approximately 120 feet of triple wire fence continued with the airplane to the point of rest. No preimpact engine or airframe anomalies which might have affected the airplane's performance were identified. The weight and balance was computed for the accident airplane at the time of the accident and the center of gravity was determined to be approximately one inch forward of the forward limit.", "probable_cause": "The flight instructor's failure to maintain an adequate airspeed while maneuvering, which led to an inadvertent stall."}