{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-188c-electra-chicago-37-killed", "date": "Sep 17, 1961 at 0857 LT", "type": "Lockheed L-188 Electra", "operator": "Northwest%20Airlines2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Milwaukee – Chicago – Tampa – Fort Lauderdale – Miami", "msn": "1142", "yom": 1961, "flight_number": "NW706", "city": "Chicago-O'Hare", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 32, "pax_fatalities": 32, "other_fatalities": 0, "total_fatalities": 37, "captain_hours": 15898, "captain_hours_type": 314, "copilot_hours": 6643, "copilot_hours_type": 90, "aircraft_hours": 614, "circumstances": "At approximately 0855 1, the flight was cleared for takeoff on runway 14R. At this time the aircraft was taxing on a westerly heading in the runup area adjacent to runway 14R. Flight 706 acknowledged the clearance, while continuing toward the runway, and made a running takeoff No witnesses were found who observed the actual lift-off. N137US was observed after lift-off, 3,000 to 4,000 feet down the runway at an estimated altitude of 50 to 75 feet and in a normal climb attitude. At the 8,000-foot marker the altitude of the aircraft was estimated to have been approximately 100 feet, which is a slightly lower altitude than Electra aircraft normally attain at this point during takeoff. Five witnesses noted a change in engine sound during this portion of the flight. Between the 8,000 and the 9,000 foot runway marker the aircraft was observed to commence an apparently coordinated right turn with a slowly increasing rate of bank. When the bank angle was 30 to 45 degrees, the crew made a short, garbled transmission. Immediately thereafter, at a bank angle of 50 to 60 degrees, the aircraft began to lose altitude. The minimum altitude attained in the entire turn was 200 to 300 feet. The right wing near the No. 4 engine struck powerlines adjacent to the Chicago Northwestern Railroad tracks, severing the lines at an angle of about 70 degrees from the horizontal, and causing a bright bluish flash. The aircraft then continued in a direction of about 271 degrees magnetic and, when in a bank of about 85 degrees and a nose-down attitude of about 10 degrees, the right wing of the aircraft struck the railroad embankment. Continuing to roll about its longitudinal axis, the aircraft cartwheeled, the nose crashing into the ground 380 feet beyond the point of first Impact, and landed right side up It then slid tall first another 820 feet. The aircraft disintegrated throughout its path, and wreckage was strewn over an area 200 feet wide and 1,200 feet long. Evidence of ground fire was found at various points along this path. Impact occurred on airport property about 3,800 feet abeam and to the right of the end of runway 14R, about 500 feet north of Irving Park Road. After passing beyond the railroad embankment the aircraft was lost to view by most of the eye witnesses because of trees and other obstructions; immediately thereafter a large mushroom of orange-red flame accompanied by heavy black smoke was seen. Time of impact was established as 0857. The aircraft was demolished by impact and fire. All occupants were fatally injured.", "probable_cause": "The Board determines that the probable cause of this accident was a mechanical failure in the aileron primary control system due to an improper replacement of the aileron boost assembly, resulting in a loss of lateral control of the aircraft at an altitude too low to effect recovery."}