{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900d-beni", "date": "Sep 28, 2016 at 1230 LT", "type": "Beechcraft 1900D", "operator": "King%20Air%20Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Goma - Beni", "msn": "UE-32", "yom": 1992, "flight_number": "UNO830", "city": "Beni-Mavivi", "zone": "Nord-Kivu", "country": "Democratic Republic of Congo", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4728, "captain_hours_type": 921, "copilot_hours": 2258, "copilot_hours_type": 251, "aircraft_hours": 21498, "circumstances": "The twin engine aircraft departed Goma on a regular schedule flight (service UNO830) to Beni, carrying eight passengers and two pilots on behalf of the Monusco, the United Nations Organization Stabilization Mission in the Democratic Republic of Congo. On approach to Beni-Mavivi Airport, the crew completed the approach checklist and elected to configure the aircraft but realized that the undercarriage would not extend. After the circuit breaker was reset, the crew was able to lower the landing gear manually and continued the approach with no reporting to ATC. After touchdown on runway 11, the aircraft rolled for about 450 metres when the right main gear collapsed. Out of control the aircraft veered off runway to the right, slid in a grassy area, crossed a ditch and came to rest near the apron. All 10 occupants evacuated safely and the aircraft was damaged beyond repair. ", "probable_cause": "The following factors were identified:\r\n- The ovality due to the wear of the junction point of the arm (270) with the actuator (15) over time to the point that it finally broke and released the actuator from the whole undercarriage system.\r\n- Overheating of the time/delay relay caused the circuit breaker to trip.\r\n- The ovality created by the job(65) at the junction of the arm(270) to the actuator(15) eventually thinned and broke off the actuator."}