{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-52-auckland-2-killed", "date": "Jul 4, 1966 at 1559 LT", "type": "Douglas DC-8", "operator": "Air%20New%20Zealand-2", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Auckland - Auckland", "msn": "45751", "yom": 1965, "flight_number": null, "city": "Auckland", "zone": "Auckland Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 5, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 17966, "captain_hours_type": 497, "copilot_hours": 4200, "copilot_hours_type": 21, "aircraft_hours": 2275, "circumstances": "The aircraft was making the first take-off of a routine crew training flight at Auckland International Airport, New Zealand. Time of departure was 1559 hours New Zealand Standard Time. All five occupants were seated on the flight deck. Shortly after rotation, the starboard wing dropped, the aircraft failed to accelerate and gain height normally and side-slipped inward until the wing tip struck the ground. The aircraft then cartwheeled clockwise about the nose radome and progressively disintegrated. Initial impact took place 3,865 feet beyond the threshold and 97.5 ft to starboard of runway 23, the active runway. Two crew members were killed and three others were injured. The aircraft was totally destroyed. ", "probable_cause": "The primary cause of this accident was,the incurrence of reverse thrust during simulated failure of No. 4 engine on take-off. That condition arose when very rapid rearward movement of the power lever (customary only on crew training flights involving simulated engine failure) generated an inertia force which caused the associated thrust brake lever to rise and enter the reverse idle detent. After lift-off, the minimum control speed essentially required to overcome the prevailing state of thrust imbalance was never attained and an uncontrollable roll, accompanied by some degree of yaw and side-slip in the same direction, ensued. When the condition of reverse thrust was recognized and eliminated,insufficient time and height were available to allow the aircraft to recover from its precarious attitude before it struck the ground."}