{"url": "https://www.baaa-acro.com/crash/crash-yakovlev-yak-42d-ohrid-116-killed", "date": "Nov 20, 1993 at 2330 LT", "type": "Yakovlev Yak-42", "operator": "Avioimpex", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Geneva - Skopje", "msn": "40 16 557", "yom": 1990, "flight_number": "AXX110", "city": "Ohrid", "zone": "Southwestern", "country": "Macedonia", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 108, "pax_fatalities": 108, "other_fatalities": 0, "total_fatalities": 116, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The three engine aircraft departed Geneva-Cointrin Airport in the evening on a charter flight to Skopje, carrying 8 crew members and 108 passengers, most of them citizens from Kosovo working in Switzerland and returning home for the winter break. While descending to Skopje-Brazda Airport, the crew was instructed by ATC to divert to Ohrid due to poor weather at Skopje (snow falls). On final approach to Ohrid Airport in limited visibility, the crew failed to realize his altitude was insufficient when the GPWS alarm sounded for seven seconds. The aircraft struck tree tops and crashed on the slope of Mt Trojani (1,204 metres high) located 2 km from the airport. A man aged 20 was seriously injured while 115 other occupants were killed. Few days after the crash, the only survivor died from his injuries.  ", "probable_cause": "The accident was caused by a significant deviation of the aircraft from the established approach path and the lack of information from the crew about the exact position of the aircraft while descending in IMC conditions that excluded a visual approach. The following contributing factors were reported: \r\n- The Ohird VOR was unserviceable at the time of the accident, \r\n- The visibility was poor due to the night and marginal weather conditions, \r\n- The crew failed to follow the traffic pattern on approach to Ohrid Airport and continued to descend despite the fact they were unaware of their exact position, \r\n- The crew failed to comply with published procedures, which led to the loss of proper control over the parameters of the aircraft movement in altitude, the impossibility of landing from the first approach and the failure to maintain the established flight altitudes during subsequent maneuvers;\r\n- No VOR signal in the cockpit,\r\n-Insufficient illumination of the Ohrid motorway in relation to the possibility of using it as a spare, which, in the conditions of a malfunction of the RTO and the absence of radar control and radio direction finding, significantly complicated the actions of the crew and dispatcher to control the aircraft position,\r\n- Implementation by the crew of their unjustified decision to attempt a second approach without VOR indication on board, which led to the loss of his exact location,\r\n- Underestimation of the danger of the situation by ATC based at Ohrid Airport when he realized the loss of orientation by the crew while flying over a mountainous area. ATC failed to take all possible measures to prevent the aircraft from colliding with obstacles and disoriented the crew about the possibility of landing in this situation, expressed in the requirement to report receiving a signal derived from the localization beacon regulations (\"REPORT LOCALIZER ESTABLISHED\"), which was perceived by the crew as 'cleared to continue the approach'."}