{"url": "https://www.baaa-acro.com/crash/crash-cessna-425-conquest-i-san-jose-3-killed", "date": "Mar 6, 2002 at 1035 LT", "type": "Cessna 425 Conquest", "operator": "Henry Guenther", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "San Jose - La Paz", "msn": "425-0013", "yom": 1981, "flight_number": null, "city": "San Jose-Reid-Hillview", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4987, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4315, "circumstances": "The aircraft was on an IFR clearance and climbing through a cloud layer when it broke up in flight following an in-flight upset. The weather conditions included multiple cloud layers from 4,000 to 13,000 feet, with a freezing level around 7,000 feet msl. An AIRMET was in effect for occasional moderate rime to mixed icing-in-clouds and in-precipitation below 18,000 feet. As the airplane began to intercept a victor airway, climbing at about 2,000 feet per minute (fpm), and passing through 6,700 feet, the airplane began a series of heading and altitude changes that were not consistent with its ATC clearances. The airplane turned right and climbed to 8,600 feet, then turned left and descended to 8,000 feet. The airplane then turned right and climbed to 8,500 feet, where it began a rapidly descending right turn. At 1034:33, as the aircraft was descending through 7,000 feet, the pilot advised ATC \"four Juliet victor I just lost my needle give me...\" No further transmissions were received from the accident airplane and the last radar return showed it descending through 3,200 feet at about 11,000 fpm. Analysis of radar data shows the airplane was close to Vmo at the last Mode C return. Ground witnesses saw the airplane come out of the clouds in a high speed spiral descent just before it broke up about 1,000 feet agl. Examination of the wreckage showed that all structural failures were the result of overload. The aircraft was equipped with full flight instruments on both the left and right sides of the cockpit; however, the flight director system attitude director indicator and horizontal situation indicator were only on the left side. The aircraft was also equipped for flight into known icing conditions, with in part, heated pitot tubes (left and right sides), static sources, and stall warning vanes. During the on-scene cockpit examination, except for the pitot heat switches, the cockpit controls and switches were found to be configured in positions consistent with the aircraft's phase of flight prior to the in-flight upset. The right pitot heat switch was found in the ON position, while the left switch was in the OFF position. The left pitot heat switch toggle lever was noticeably displaced to the left by impact with an object in the cockpit. With the exception of the left pitot heat, the anti-ice and deice system switches were all configured for flight in icing conditions. The pitot heat switches, noted to be of the circuit breaker type (functions as both a toggle switch and circuit breaker), were removed from the panel and sent to a laboratory for examination and testing. Low power stereoscopic examination of the switches found that the right switch was intact, while the toggle lever mechanism of the left switch was broken loose from the housing. Microscopic examination of the left switches housing fracture surface revealed imbedded debris and wear marks indicative of an old fracture predating the accident. The broken left switch could be electrically switched by physically holding the toggle lever mechanism in the appropriate ON or OFF position. The electrical contact resistance measurements of the left switch varied between 0.3 and 1.4 ohms, and was noted to be intermittently open with the switch in the ON position. Both switches were then disassembled. While particulate debris was found in both switches, the left one had a significant amount of large coarse fibrous lint-like debris. The flexible copper conductor of the left switches circuit breaker section had several broken strands, and the electrical contacts were dirty. The laboratory report concluded that the left switches toggle was bent to the left in the impact sequence; however, the housing fracture predated the accident and allowed an internal build-up of large coarse fibrous lint-like debris. The combined effects of the broken housing, the resulting misalignment of the toggle mechanism, the dirty contacts, and the large coarse lint debris prevented reliable electrical switching of the device and presented the opportunity for intermittently open electrical contacts. Continuity of the plumbing from the pitot tubes and static ports to their respective instruments was verified. Electrical continuity was established from the bus power sources through the circuit breakers and switches to the heating elements of the pitot tubes and static sources. The heating elements were connected to a 12-volt battery and the operation of the heating elements verified.", "probable_cause": "The pilot's loss of control and resulting exceedance of the design stress limits of the aircraft, which led to an in-flight structural failure. The pilot's loss of control was due in part to the loss of primary airspeed reference resulting from pitot tube icing, which was caused by the internal failure of the pitot heat switch. Factors in the accident were the pilot's distraction caused by the airspeed reading anomaly and spatial disorientation."}