{"url": "https://www.baaa-acro.com/crash/crash-dornier-do228-212k-male", "date": "Oct 18, 1995 at 0946 LT", "type": "Dornier DO228", "operator": "Air%20Maldives", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Kadhdhoo - Male", "msn": "8213", "yom": 1992, "flight_number": "AMI3312", "city": "Male", "zone": "North Central Province", "country": "Maldivian Islands", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3152, "captain_hours_type": 2948, "copilot_hours": 226, "copilot_hours_type": 61, "aircraft_hours": 3857, "circumstances": "Following an uneventful flight from Kadhdhoo Airport, the crew initiated the approach to Male Intl Airport. The copilot was the pilot-in-command. The aircraft landed on runway 36 at the speed of 95 knots some 600 metres past the runway threshold. After touchdown, the aircraft deviated from the centerline to the left and the copilot overcorrected, causing the aircraft to veer to the right. The captain took over control but this was too late. The aircraft overran, struck a concrete wall and crashed in the sea. All eight occupants were injured and the aircraft was destroyed. ", "probable_cause": "The following factors were reported:\r\n- Failure of the PIC to take control when the aircraft touched at 20° angle to the centreline and continued towards the western edge of the runway after landing,\r\n- The \"over correction\" applied by the handling pilot to the prevalent crosswind, leading the aircraft to land at 20° to the centreline,\r\n- The over application of right rudder to get the aircraft onto centreline and subsequently failing to get the power levers to ground idle,\r\n- The lack of a CRM programme in the company had meant that the pilots albeit friendly, did not have an harmonious attitude towards one another; particularly the captain to the copilot,\r\n- The less than effective means of imparting company policy with respect to giving copilots (based on experience, flight conditions) to carry out landings/take-offs."}