{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-820c-caraja-almeirim-10-killed", "date": "Mar 12, 2013 at 2030 LT", "type": "Embraer EMB-820 Navajo/Carajá", "operator": "Fretax%20Taxi%20Aereo", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Belém - Almeirim", "msn": "820-140", "yom": 1986, "flight_number": null, "city": "Almeirim", "zone": "Pará", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 1300, "captain_hours_type": 70, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Belém-Val de Cans-Júlio Cezar Ribeiro Airport at 1907LT on a flight to Almeirim, carrying one pilot and nine employees of a company taking part to the construction of a hydro-electric station in the area. Following an eventful flight at FL85, the pilot started the descent to Almeirim and contacted ground at 2023LT. On final approach by night, the aircraft descended too low, impacted ground and crashed 5 km short of runway, bursting into flames. The aircraft was destroyed and all 10 occupants were killed. ", "probable_cause": "The following findings were identified:\r\n- The pilot took the risks inherent to that flight when he accepted to be the only crewmember on a night-time flight with an aircraft in which he lacked enough experience. It is therefore considered that the pilot was complacent when he accepted to fly the aircraft under those circumstances, taking the risks associated with the operation.\r\n- The fact that the pilot made a phone call to his father, to tell that he was feeling insecure for conducting the flight, may be considered an indication that he was not confident, and this condition may have influenced negatively his operational performance during the descent procedure.\r\n- It is possible that the motivation of the pilot in making a fast progress in his career contributed to his acceptance of the challenge to operate the flight, even if he was not feeling fully confident.\r\n- It is possible that the characteristics related to the type of flight, regions, time of the day, in addition to the fact that the pilot was flying the aircraft alone for the first time, contributed to an unclear perception of the relevant elements around him, leading him to a mistaken comprehension, which resulted in the deterioration of his ability to foresee the events.\r\n- The operational progress of the pilot in the company was expedited and, therefore, it is possible that for this reason he did not gather the necessary experience for conducting that type of flight.\r\n- It is possible that the way the work was organized within the company, with designation of pilots not readapted in the aircraft for night-time flights without artificial horizon, and for takeoffs with an aircraft weight above the one prescribed in the manual contributed to the event that resulted in the accident.\r\n- It is possible that the prioritization of the financial sector, in detriment of operational safety, contributed to the designation of a single pilot with short experience for transporting nine passengers.\r\n- It is probable that the pilot, during the preparation of the aircraft for landing, allowed the its speed and power to drop to a value below the minima required for maintenance of level flight on the downwind leg.\r\n- It is possible that the location of the runway in an isolated area of the Amazonian jungle region, without visual references in a night-time flight, contributed to the pilot’s difficulty maintaining a sustained flight.\r\n- It is possible that the training done by the pilot in a shortened manner deprived him from the knowledge and other technical abilities necessary for flying the aircraft. \r\n- The decisions of the company operation sector to designate a short-experienced pilot without a copilot for a night flight destined for an aerodrome located in a jungle region without visual reference with the terrain increased the risk of the operation. Therefore, the risk management process was probably inappropriate.\r\n- It was the first time the pilot was flying the aircraft on a night-time flight without a copilot. Since he had only little experience in the aircraft, it is possible that his operational performance was hindered in the management of tasks, weakening his situational awareness.\r\n- It was not possible to determine whether the company chose to dispense with the copilot on account of the need to transport a ninth passenger and, thus, did not consider in a conservative manner the prescription contained in the aircraft airworthiness certificate by designating just one pilot for the flight."}