{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-188a-electra-boston-62-killed", "date": "Oct 4, 1960 at 1740 LT", "type": "Lockheed L-188 Electra", "operator": "Eastern-Airlines-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Boston – Philadelphia – Atlanta", "msn": "1062", "yom": 1959, "flight_number": "EA375", "city": "Boston", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 3, "pax_on_board": 67, "pax_fatalities": 59, "other_fatalities": 0, "total_fatalities": 62, "captain_hours": 23195, "captain_hours_type": 1053, "copilot_hours": 5820, "copilot_hours_type": 201, "aircraft_hours": 3526, "circumstances": "On October 4, 1960, at 1740 e.d.t., an Eastern Air Lines Lockheed Electra, N 5533, crashed into Winthrop Bay immediately following takeoff from runway 9 at Logan International Airport, Boston, Massachusetts. Ten of the 72 persons aboard survived the crash. The aircraft was totally destroyed. A few seconds after becoming airborne, the aircraft struck a flock of starlings. A number of these birds were ingested In engines Nos. 1, 2, and 4. Engine No. 1 was shut down and its propeller was feathered. Nos. 2 and 4 experienced a substantial momentary loss of power. This abrupt and intermittent loss and recovery of power resulted in the aircraft yawing to the left and decelerating to the stall speed. As speed decayed during the continued yaw and skidding left turn, the stall speed was reached; the left wing dropped, the nose pitched up, and the aircraft rolled left into a spin and fell almost vertically into the water. An altitude of less than 150 feet precluded recovery. The Board determines that the probable cause of this accident was the unique and critical sequence of the loss and recovery of engine power following bird ingestion, resulting in loss of airspeed and control during takeoff.", "probable_cause": "The Board determines that the probable cause of this accident was the unique and critical sequence of the loss and recovery of engine power following bird ingestion, resulting in loss of airspeed and control during takeoff."}