{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-200-multan-45-killed", "date": "Jul 10, 2006 at 1205 LT", "type": "Fokker F27 Friendship", "operator": "Pakistan%20International%20Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Multan - Lahore", "msn": "10243", "yom": 1964, "flight_number": "PK688", "city": "Multan", "zone": "Punjab (پنجاب)", "country": "Pakistan", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 41, "pax_fatalities": 41, "other_fatalities": 0, "total_fatalities": 45, "captain_hours": 9320, "captain_hours_type": 138, "copilot_hours": 520, "copilot_hours_type": 303, "aircraft_hours": 73591, "circumstances": "On 10 July 2006, F-27 Fokker registration No AP-BAL, belonging to Pakistan International Airline was scheduled to fly from Multan to Lahore. The aircraft had 45 souls on board including four crew members. The Captain of the aircraft was Captain Hamid Qureshi. The aircraft took off for Lahore at 1205 hours Pakistan Standard Time (PST) from Multan Runway 36. Soon after takeoff, the aircraft was observed by the ATC and other eyewitnesses to be maintaining very low altitude and drifting right in a bank. ATC Control tower tried to establish contact with aircraft, but no contact was established. Subsequently a call from the local resident was received stating that an aircraft had crashed at about 2 km, NE of the Runway. All souls on board the aircraft sustained fatal injuries and the aircraft was completely burned. ", "probable_cause": "Accidents and losses are part of aviation business, but avoidable accidents hurt us the most. PIA or any other company can ill afford such losses. In this accident, while the aircraft had developed a problem in its right engine turbine, resulting in the engine failure, yet a professional handling by the aircrew could have saved 45 precious lives and a valuable aircraft. It is also felt that this accident may not be viewed as an isolated case of a pilot’s failure to handle the emergency. The problems were observed to be complex and deep routed and reflect towards the organization and her culture. The occurrence (right engine failure) took place due to improper assembly during overhaul. Quality Control system of PIA Engineering appears to be ineffective in detecting the weaknesses. The accident took place due to improper handling of the emergency by the air crew which reflected towards in adequacies of PIA Training/Assessment and Scheduling System. The CAA Airworthiness, too, can not be absolved of their responsibilities of regulating and monitoring the quality control system at PIAC Engineering. "}