{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46a-40-cu-commando-miami-4-killed", "date": "Aug 4, 1952 at 0030 LT", "type": "Curtiss C-46 Commando", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Burbank – San Antonio – Miami", "msn": "27038", "yom": 1944, "flight_number": null, "city": "Miami", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 5823, "captain_hours_type": 1412, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Burbank August 3 on a nonstop ferry flight to San Antonio, Texas. The aircraft, piloted by Douglas T. Dell, Chief Pilot of Resort Airlines, arrived at its destination at 2345 following an uneventful flight VFR direct. Two minor discrepancies were reported by the pilot on arrival at San Antonio; that the hydraulic system cycle every one minute and 20 seconds, and that the left engine dropped 100 RPM'S on the left magneto. These discrepancies were corrected y Slick Airways' maintenance crew at San Antonio, and at 1653, August 4, the aircraft departed for Miami, Florida, nonstop on a VFR flight plan to cruise at 10,000 feet. The crew on this flight consisted of Captain Robert E. Smith and Copilot John N. Goodman. Two non revenue passengers boarded the plane at San Antonio for the flight to Miami. The cabin of the aircraft contained no passenger seats. This equipment was to have been installed at Miami prior to placing the aircraft in service. The cockpit was equipped to accommodate a crew of three. One safety belt had been installed to accommodate one person riding in the cabin; however, no approved type seat was provided. The aircraft and engine log covering the flight from San Antonio to Miami, as well as a mutilated flight plan and log sheet recovered from the wreckage, indicated that the flight was made at an altitude of 10,000 feet. All entries in the flight plan and log sheet covering check points between San Antonio and Miami were completed up to and including Cross City, Florida, the last check point before reaching Miami. The last entry gave the estimated time of arrival at Miami as 2324. The estimated and actual time over the various cheek points along the route as reflected in the flight log indicated that the flight had progressed very nearly as estimated. On the recovered aircraft and engine log covering the San Antonio-Miami flight under heading entitled \"Difficulties Noted During Flight,\" there was found this entry, \"EXCESSIVE PLAY ON ELE.\" The log sheet had been signed by both the captain and the copilot. At approximately 2317 the Miami tower operator received a broken radio transmission from which he was unable to identify either the aircraft or the nature of the call. An attempt to establish contact was unsuccessful until the following message was received. \"Miami tower - NAN 79096 requesting emergency landing.\" Two-way contact was established and at approximately 2318 the flight was cleared to land on Runway 27L (preferential runway for calm wind) and the pilot was advised that if this runway was not satisfactory any runway was available. In the next transmission, the pilot advised the tower that the elevator control linkage was broken and he would attempt to bring the aircraft in, using trim tabs only. His position was given as high over the west boundary of the airport at an altitude estimated by the tower operator as 3,000 feet. Since the use of Runway 9R would permit an approach to be made over very thinly populated areas, it was suggested to the pilot that if it was satisfactory with him, Runway 9R be used. The pilot advised the tower that the change of runways was satisfactory. The area was cleared of all traffic while the aircraft made a circuit of the field, letting down slowly with a wide approach to a long final. As the aircraft neared the approach end of the runway, it appeared to tower personnel to be lined up properly. The following is quoted from testimony of the tower operator: \"As the aircraft neared the approach end of the runway and at an altitude of approximately 150 feet, the nose of the aircraft appeared to come up slightly, then crop about the same degree below the horizon. This was repeated several times, each time two maneuver becoming more violent, with the last pull-up very stoop. At an altitude of approximately 150 feet the aircraft appeared to fall off slightly on the left wing, the nose dropped, and the aircraft struck the ground almost vertically.\" The fire which followed the crash was quickly extinguished by the airport fire-fighting equipment, the crews of which had been altered and were in standby position prior to the crash. The aircraft was destroyed and all four occupants were killed. ", "probable_cause": "The Board finds that the probable cause of this accident was failure of the elevator control system in flight, resulting in loss of control of the aircraft during landing. The failure of the elevator control system was the result of poor workmanship and inadequate inspection during overhaul and modification. The following findings were pointed out:\r\n- Weather was not considered a factor in this accident,\r\n- Total flight time on the aircraft since overhaul and modification was approximately 13 hours 27 minutes,\r\n- At 2318 the flight advised the Miami tower that the elevator control linkage was broken and elevators functioning by use of trim tabs only,\r\n- The aircraft became uncontrollable and crashed during an attempted landing on Runway 09R,\r\n- The push-pull tube was found disconnected from its point of attachment on the elevator bellerrank."}