{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-verdigris", "date": "Mar 24, 2015 at 1507 LT", "type": "Cessna 208B Grand Caravan", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Test", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Tulsa - Tulsa", "msn": "208B-0106", "yom": 1988, "flight_number": null, "city": "Verdigris", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6500, "captain_hours_type": 970, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11443, "circumstances": "The pilot reported that, during the postmaintenance test flight, the turboprop engine lost power. The airplane was unable to maintain altitude, and the pilot conducted a forced landing, during which the airplane was substantially damaged. The engine had about 9 total flight hours at the time of the accident. A teardown of the fuel pump revealed that the high-pressure drive gear teeth exhibited wear and that material was missing from them, whereas the driven gear exhibited little to no visible wear. A metallurgical examination of the gears revealed that the damaged drive gear was made of a material similar to 300-series stainless steel instead of the harder specified M50 steel, whereas the driven gear was made of a material similar to the specified M50 steel. Subsequent to these findings, the airplane manufacturer determined that the gear manufacturer allowed three set-up gears  made from 300-series stainless steel to become part of the production inventory during the manufacturing process. One of those gears was installed in the fuel pump on the accident airplane, and the location of the two other gears could not be determined. Based on the evidence, it is likely that the nonconforming gear installed in the fuel pump failed because it was manufactured from a softer material than specified, which resulted in a loss of fuel flow to the engine and the subsequent loss of engine power. The manufacturer subsequently inspected its stock of gears and issued notices to customers that had engines with fuel pumps installed with the same part number gear set as the one installed on the accident airplane. The manufacturer also issued a service information letter and service bulletins regarding the fuel pump gear set for engines used in civilian and military applications. As of the date of this report, the two remaining gears have not been located. ", "probable_cause": "The fuel pump gear manufacturer’s allowance of set-up gears made from a nonconforming material to be put in the production inventory system, the installation of a nonconforming gear in the accident airplane’s production fuel pump, and the gear’s failure, which resulted in a loss of fuel flow to the engine and the subsequent loss of engine power."}