{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-1-dk-serrania-del-baudo-40-killed", "date": "Apr 22, 1962 at 1045 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "AVISPA - Aerovias Pilotos Associados de Medellín", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Bahía Solano – Quibdó", "msn": "12075", "yom": 1943, "flight_number": null, "city": "Serranía del Baudó", "zone": "Chocó", "country": "Colombia", "region": "South America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 36, "pax_fatalities": 36, "other_fatalities": 0, "total_fatalities": 40, "captain_hours": 7645, "captain_hours_type": 6606, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Bahía Solano at 1020LT on a non-scheduled domestic flight to Quibdó carrying a crew of 4 and probably 36 passengers. Following departure the aircraft was not hear by any radio station, and there is no knowledge of any departure information or position report having been received from it. The accident occurred at 1045LT. The wreckage of the aircraft was located four days later about 31 miles from the airport on Bonito Peak, at an elevation of 2,400 feet. The aircraft was destroyed and all 40 occupants were killed. The aircraft's certificate permitted it to carry 31 persons, including crew members. However, at the time of the accident the following were believed to be aboard: 4 crew, 29 passengers, 5 infants in arms and 2 children. The Colombian Civil Aeronautics Department had introduced a weight limit of 11,431 kg for all aircraft of this type engaged in passenger transport in Colombia. At the time of the accident the aircraft's weight was about 12,002 kg, i.e. 571 kg in excess of the figure allowed for aircraft engaged in passenger transport. As Bahía Solano is a fourth category airport the pilot-in-command should have completed a weight and balance manifest. He failed to do so. ", "probable_cause": "The cause of the accident was not determined. Possible contributing factors were:\r\n- Weather conditions at the time,\r\n- An error of the pilot in flying at an altitude unsuited to the route. "}