{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-83-mashhad", "date": "Jan 28, 2016 at 1937 LT", "type": "McDonnell Douglas MD-83", "operator": "Zagros-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Isfahan – Mashhad", "msn": "49930/1720", "yom": 1990, "flight_number": "ZV4010", "city": "Mashhad", "zone": "Razavi Khorasan", "country": "Iran", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 154, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9224, "captain_hours_type": 4341, "copilot_hours": 633, "copilot_hours_type": 471, "aircraft_hours": 51446, "circumstances": "Following an uneventful flight from Isfahan, the crew initiated the approach to Mashhad Airport by night and poor weather conditions with low visibility due to snow falls. After touchdown on runway 31R, the crew started the braking procedure and activated the reverse thrust systems. The aircraft skidded then veered off runway to th left, lost its both main undercarriage and came to rest 55 metres to the left of the runway, some 1,311 metres from the runway threshold. All 162 occupants evacuated safely while the aircraft was damaged beyond repair.", "probable_cause": "The following findings were identified:\r\n- Loss of control after touchdown due to an abnormal use by the captain of the reverse thrust systems, which caused the aircraft to slid and to become out of control,\r\n- Weather conditions deteriorated with a sudden drop in temperature and a reduced visibility,\r\n- Limited RVR to 811 metres, \r\n- The crew failed to initiate a go-around procedure, \r\n- Overconfidence on part of the captain due to his high experience, \r\n- Poor crew resource management, \r\n- The braking coefficient was low due to an excessive deposit of rubber on the runway surface, combined with a layer of snow that the airport authorities did not consider necessary to clear in due time. "}