{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-pamplona-2-killed", "date": "Mar 7, 2006 at 1648 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Aerovalles", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Madrid - Pamplona", "msn": "421C-0337", "yom": 1977, "flight_number": null, "city": "Pamplona", "zone": "Navarre", "country": "Spain", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1771, "captain_hours_type": 520, "copilot_hours": 7000, "copilot_hours_type": 460, "aircraft_hours": 3518, "circumstances": "The twin engine aircraft departed Madrid-Torrejón AFB on a charter flight to Pamplona with 4 businessmen and a crew of two on board. While descending to Pamplona-Noain Airport, the crew encountered marginal weather conditions. Unable to establish a visual contact with runway 15, the crew initiated a go-around procedure. Few minutes later, while flying at an insufficient altitude, the aircraft impacted ground and crashed in a hilly terrain located in the Sierra de Tajonar, near the village of Labiano. The copilot and a passenger were killed while all other occupants were seriously injured. The aircraft was totally destroyed by impact forces and a post crash fire. ", "probable_cause": "The crew did not establish a visual contact with the runway and initiated a go-around procedure during which approximations were noted in the flight techniques adopted by the pilots who continued the flight in unstable conditions. As a result, the aircraft was 16 ° off the prescribed path and was flying at an insufficient altitude. \r\nThe following contributing factors were identified:\r\n- The wind did not correspond to the component reported in the bulletin published for the destination airport, which affected the aircraft flight path,\r\n- The total weight of the airplane was higher than the allowable limit and the CofG was out of permissible limits, reducing the aircraft's performances and its maneuverability,\r\n- The pilots did not have sufficient experience in instrument flight conditions,\r\n- The lack of clear procedures within the operator,\r\n- The lack of supervision from the Spanish Civil Aviation Authority regarding the activities of the operator. "}