{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-2t4-tamanrasset-102-killed", "date": "Mar 6, 2003 at 1515 LT", "type": "Boeing 737-200", "operator": "Air%20Alg%C3%A9rie", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tamanrasset - Ghardaia - Algiers", "msn": "22700", "yom": 1983, "flight_number": "AH6289", "city": "Tamanrasset", "zone": "Tamanrasset", "country": "Algeria", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 97, "pax_fatalities": 96, "other_fatalities": 0, "total_fatalities": 102, "captain_hours": 10760, "captain_hours_type": 1087, "copilot_hours": 5219, "copilot_hours_type": 1292, "aircraft_hours": 41472, "circumstances": "The aircraft was taking off from Tamanrasset to undertake, with a three-hour delay, scheduled flight DAH 6289 to Ghardaïa and Algiers. Six crew members (two flight crew and four cabin crew) and 97 passengers were on board. The co-pilot was pilot flying. No technical exemptions or deferred maintenance items applied to the airplane; on departure from Algiers it had been subject to routine maintenance for a minor technical problem, a hydraulic pump having been changed in the circuit B landing gear bay. The speeds decided on by the crew were V1 = 144 kt, VR = 146 kt, V2 = 150 kt. The EPR displayed was 2.18, that is to say nominal maximum thrust on take-off. At 14 h 01 min 37 s, the crew requested start-up clearance. At 14 h 08 min 36 s, the tower cleared the airplane to taxi, enter and taxi up runway 02. The wind was 330 at 12 kt. At 14 h 12 min 30 s, the co-pilot called out “we’re ready”. At 14 h 12 min 31 s, the tower cleared flight 6289 to line up and take off. At 14 h 13 min 36 s, flight DAH 6289 announced take-off. About five seconds after airplane rotation, at the moment when gear retraction was requested, a sharp thumping noise was recorded on the CVR. The airplane’s heading veered to the left, followed by a track correction. The Captain announced that he was taking over the controls. A short time later, the co-pilot told the control tower “we have a small problem”. The airplane continued to climb and reached a recorded height of about 400 ft. The speed dropped progressively from 160 kt during airplane lift-off to stall speed at the end of the recording. In fact, about ten seconds before, the noise of the stick shaker is heard on the CVR (which usually indicates that the airplane is 7% from its stall speed). The “Don’t Sink” aural warning, which normally indicates a loss of altitude during take-off when the airplane is below nine hundred feet, appeared about six seconds before the end of the recording. The airplane, with landing gear extended, struck the ground on its right side. A severe fire broke out immediately. The airplane slid along, losing various parts, struck and knocked over the airport perimeter fence then crossed a road before coming to a halt in flames. The control tower immediately sounded the alert. ", "probable_cause": "Probable causes:\r\nThe accident was caused by the loss of an engine during a critical phase of flight, the non-retraction of the landing gear after the engine failure, and the Captain, the PNF, taking over control of the airplane before having clearly identified the problem.\r\nThe following factors probably contributed to the accident:\r\n• the perfunctory flight preparation, which meant that the crew were not equipped to face the situation that occurred at a critical moment of the flight;\r\n• the coincidence between the moment the failure occurred and the request to retract the landing gear;\r\n• the speed of the event that left the crew little time to recover the situation;\r\n• maintaining an inappropriate rate of climb, taking into account the failure of one engine;\r\n• the absence of any teamwork after the engine failure, which led to a failure to detect and correct parameters related to the conduct of the flight (speed, rate of climb, configuration, etc.);\r\n• the takeoff weight being close to the maximum with a high aerodrome altitude and high temperature;\r\n• the rocky environment around the aerodrome, unsuitable for an emergency landing. "}