{"url": "https://www.baaa-acro.com/crash/crash-fokker-100-skopje-83-killed", "date": "Mar 5, 1993 at 1112 LT", "type": "Fokker 100", "operator": "Palair%20Macedonian", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Skopje - Zurich", "msn": "11393", "yom": 1992, "flight_number": "PMK301", "city": "Skopje", "zone": "Skopje City District", "country": "Macedonia", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 4, "pax_on_board": 92, "pax_fatalities": 79, "other_fatalities": 0, "total_fatalities": 83, "captain_hours": 11200, "captain_hours_type": 1180, "copilot_hours": 5580, "copilot_hours_type": 65, "aircraft_hours": 188, "circumstances": "Palair Macedonian Airlines flight PMK301 was destroyed when it crashed immediately after takeoff from Skopje Airport, North Macedonia. Fourteen of the 97 occupants survived the accident. The aircraft, a Fokker 100 jet, was leased to Palair by Aircraft Financing and Trading (AFT) of the Netherlands since January 1993. AFT provided route training captains, while Palair provided the first officer or candidate Palair captain and the cabin crew. The aircraft arrived on a scheduled flight from Frankfurt to Skopje at 09:40 hours local time with a 35 minute delay. The new crew arrived at Skopje Airport at approximately 10:30 and they went straight to the aircraft. It was snowing lightly. The temperature was 0° Celsius, dewpoint -1° Celsius. The AFT Director Flight Operations was the pilot-in-command and was sitting in the right seat. He performed the first officer duties and was the pilot not flying (PNF). He was also giving route-instruction. A captain-under-training was sitting in the left seat. He was acting captain and was pilot flying (PF), receiving route-training. The dispatch officer checked both wing leading edges and saw they were not contaminated with ice or snow, but were only wet of melted snow. The Flying Station Engineer subsequently performed the walk around and was accompanied by three Palair ground handling crew members. The ground handling crew members stated that they had a brief discussion with the FSE about the weather and asked if the aircraft needed deicing since there was some snow on the right wing inner flap. The FSE replied that de-icing was not necessary and that any deposit would blow off the wing during take off. The total time the aircraft remained on the ground at Skopje Airport was about 1 hour 35 minutes. At 11:05 hours start-up was approved and clearance was given to taxi to holding point runway 34. During taxying, a Yak-42D from Vardar Air, which was standing on the apron, was de-iced. This was the first aircraft that day being deiced. In the meantime the snowfall had increased to moderate. According to the Cockpit Voice Recorder, no discussion about the weather conditions took place by the pilots. At 11:11 Palair 301 was cleared for take off, the wind was given as 010° with 3 knots. The tower controller stated that the visibility was 900 meters and it was snowing. The aircraft rotated normally and the PNF then called \"positive\", followed by the call \"gear up\" from the PF, which was confirmed by the PNF. Two seconds after lift off the aircraft experienced heavy vibrations followed by a sudden right bank to approximately 10°, immediately followed by approximately 50° left bank and 55° right bank in sequence within 2 seconds. The roll movements were counteracted by aileron and rudder input. Approximately 10 seconds before impact the PNF called \"deselect\" followed by sounds which were determined to be the autopilot cavalry charge (twice) followed by the GPWS aural alert, \"sink rate\" (twice). The aircraft right wingtip hit the ground 382 meters beyond the end of the runway with approximately 90° bank, the fuselage was more or less in a horizontal position. The right wing disintegrated towards the wing-fuselage attachment, followed by major impact of the fuselage, which broke up into three major parts, and the impact of the right engine and stabilizer. The right engine separated and subsequently impacted and penetrated the aft fuselage. The stabilizer and the upper part of the vertical tail plane also separated. Witnesses stated that explosions followed shortly after impact and several residual fires broke out on the debris.", "probable_cause": "The Board determined that the impact with the ground in a steep right bank shortly after lift off was caused by a loss of roll controllability due to contamination of the wings with ice. This situation resulted from an omission to carry out spraying of the aircraft with deicing or anti-icing fluid in meteorological conditions conducive to icing, due to a lack of ice-awareness of the flight crew and the Flying Station Engineer. Contributing factors were a lack of common background and procedures in a difficult multi-sources operational environment."}