{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-ii-perth-1-killed", "date": "May 3, 1981 at 1125 LT", "type": "Piper PA-31 Cheyenne", "operator": "MG%20Kailis%20Group_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "City", "schedule": "Jandakot - Perth", "msn": "31-7720046", "yom": 1977, "flight_number": null, "city": "Perth", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4279, "captain_hours_type": 576, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was flown from Jandakot to Perth at approximately 08:00 hours on 3.5.81. However, the engineer who had agreed to meet the pilot sent a message that he could not attend. At times during the morning, persons observed the aircraft parked at the airport. The engine cowls had been removed and the pilot was seen to be working in the area of the propeller governors. At about 11:00 hours, the pilot started the aircraft's engines, taxied to a clear area and carried out a series of checks\" at high power. Then, at 11:09 hours, he contacted Perth Surface Movement Control by radio and requested clearance for an air test at Flight Level 200. This was approved and the aircraft was instructed to taxi to Runway 20. After take-off, the aircraft turned right and tracked to the west on the 270 radial of the VHF omni-directional radio range (VOR), in accordance with departure instructions give n by Perth Tower. When asked for his intentions, the pilot advised that he wished to continue tracking to the west until further notice. Weather conditions in the Perth area were fine; there was no cloud and the surface wind was a light southwesterly. The aircraft as it climbed out appeared to be operating normally , except for a thin smoke trail which was observed coming from the right engine. At 11:19 hours, the pilot advised that his test was completed. He reported he was at 7,000 feet and 10 miles from the airport by distance measuring equipment (DME). During the next five minutes there were a series of routine exchanges between VH-CCW and Perth Tower as the aircraft was cleared to track visually, north of Perth city, to a right base position for Runway 20. During these exchanges the pilot did not indicate that any abnormality or emergency existed and his voice sounded normal. At 11:24 hours, he reported at right base and was cleared to land. The final transmission received from the aircraft was the usual acknowledgement of the landing clearance. The right base position for Runway 20 is over the suburb of Bassendean and local residents are used to aircraft overflying. However, attention was drawn to VH-CCW as it was lower than normal traffic, the engine noise was louder and smoke was trailing from its right engine. Otherwise, it appeared to be operating normally; both propellers were rotating and the landing gear was reported to be retracted. The aircraft had commenced an apparently normal right base turn when it suddenly rolled inverted. The nose of the aircraft may have pitched up just before the sudden roll. The aircraft then began to rotate and rapidly descend. At some stage, it rolled back to the normal upright attitude. After about two turns, the rotation stopped and the aircraft dropped vertically to the ground in the backyard of a private house. The left wing and tailplane struck the roof of the house just prior to ground impact. An intense fire immediately broke out and consumed most of the wreckage. Subsequent examination of the wreckage found no evidence of pre-existing defects or malfunctions, apart from loose attachment nuts on the left side of the propeller governor fitted to the right engine. Oil had leaked from the governor at this position, covering the engine and causing the smoke trail observed by witnesses. Internal inspection of the right engine established that all bearing surfaces were oil-wetted, but it could not be determined how much oil remained in the engine at the time of ground impact as any residual oil had leaked and been consumed by fire. Both engines had been operating at impact. The right engine was at a low power setting, probably idle. The left engine was at a higher power, although the exact power setting could not be determined. The left propeller was at a blade angle consistent with higher power output. The right propeller was at a blade angle outside the normal operating range but consistent with the propeller moving towards the feather position, either as a result of pilot selection or exhaustion of the engine oil supply. It was not possible to determine whether or not the pilot had initiated feathering. The stability augmentation system servo was at the maximum, elevator-down spring tension position. The automatic system would drive the servo to this position when the aircraft was flown at low airspeed. The elevator trim was set at 10 degrees nose-up, also consistent with low-speed flight. The rudder trim was at the full-left rudder position, indicating that the pilot had been operating the aircraft for some time with high power on the left engine and the right engine at a low power setting. The flaps were half extended and the landing gear was down at ground impact. Post-mortem examination found that the pilot had extensive coronary artery disease, such that he may have suffered a sudden incapacitating attack or death. Alternatively, he may have experienced severe chest pain, causing him to unintentionally apply coarse movements to the aircraft controls. The pilot had completed regular medical examinations for the renewal of his pilot's licence, but his condition had not been detected.", "probable_cause": "The exact cause of the accident could not be determined with certainty. However, the following defect was discovered: two nuts attaching the propeller governor to the right engine were loose, permitting oil to leak from the governor. "}