{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900c-billings-1-killed", "date": "May 23, 2008 at 0124 LT", "type": "Beechcraft 1900C", "operator": "Alpine-Air-2", "flight_phase": "Takeoff (climb)", "flight_type": "Postal (mail)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Billings - Great Falls", "msn": "UB-65", "yom": 1986, "flight_number": "AIP5008", "city": "Billings-Logan", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4770, "captain_hours_type": 362, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 34651, "circumstances": "About one minute after takeoff on a night Instrument Flight Rules (IFR) contract cargo flight, the tower controller advised the pilot that he was squawking the wrong transponder code. Although the pilot reset the transponder to the correct code, he was advised that he was still squawking the wrong code. He then realized that he had selected the wrong transponder, and then switched to the correct one. During the time the pilot was dealing with this issue, the airplane drifted about 30 degrees right of the assigned heading, but the pilot returned to the correct heading as he was contacting the departure controller. The departure controller cleared him to continue his climb and instructed him to turn left about 120 degrees, which he did. About 40 seconds after initiating his left turn of about 120 degrees, while climbing straight ahead through an altitude about 4,700 feet above ground level (AGL), the pilot was instructed to turn 20 degrees further left. Almost immediately thereafter, the airplane began turning to the right, and then suddenly entered a rapidly descending right turn. The airplane ultimately impacted the terrain in a nearly wings-level nose-down attitude of greater than 45 degrees. At the moment of impact the airplane was on a heading about 220 degrees to the right of the its last stabilized course. The investigation did not find any indication of an airframe, control system, or engine mechanical failure or malfunction that would have precluded normal flight, and no autopsy or toxicological information could be acquired due to the high amount of energy that was released when the airplane impacted the terrain. The determination of the initiating event that led to the uncontrolled descent into the terrain was not able to be determined.", "probable_cause": "The pilot's failure to maintain aircraft control during the initial climb for undetermined reasons."}