{"url": "https://www.baaa-acro.com/crash/crash-dewoitine-d332-corbigny-10-killed", "date": "Jan 15, 1934 at 1920 LT", "type": "Dewoitine D.332", "operator": "Air-France-31", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Saigon - Yangon - Calcutta - Karachi - Gwadar - Basra - Damascus - Athens - Rome - Marseille - Paris", "msn": "01", "yom": 1933, "flight_number": null, "city": "Corbigny", "zone": "Nièvre", "country": "France", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Due to sandstorm in Karachi, the crew continued his route to Gwadar, Baluchistan. At night, the aircraft landed long and hit an obstacle that damaged a landing gear. Following repairs, the aircraft departed Gwadar few hours later. In Marseille, the crew was informed about poor weather conditions on the leg to Paris so he decided to make an intermediate stop at Lyon-Bron Airport where it landed at 1620LT. Despite terrible weather conditions (snowstorm, low visibility and night), the crew departed Lyon at 1815LT bound for Paris. Several Officials were waiting on this aircraft flying from Saigon and a ceremony has been organized. About an hour into the flight, while cruising at an altitude of 1,700 metres in snow falls, the aircraft named 'Émeraude' entered an uncontrolled descent and crashed in the hill of La Linarde near Corbigny. The aircraft was totally destroyed by impact forces and a post crash fire and all 10 occupants were killed. \r\nCrew:\r\nAndré Launay, pilot,\r\nCamille Crampel, engineer,\r\nFerdinand Queyrel, radio navigator.\r\nPassengers: \r\nPierre Pasquier, Governor of Indochina, \r\nMaurice Noguès, Deputy Director by Air France,\r\nMaurice Balazuc, Director of Operations by Air France,\r\nEmmanuel Chaumié, Director of French Civil Aviation Authority, \r\nColette Chaumié, Mr. Chaumié's wife,  \r\nCpt Léon BrusseauX, personal assistant to Mr. Pierre Pasquier,\r\nJean-Jacques Larrieu, Head of mission by the Ministry of the Air.", "probable_cause": "The loss of control was the consequence of an excessive accumulation of ice on wings, fuselage and stabilizers. This situation increased the aircraft's weight, reduced its performances and modified its aerodynamic properties. It is also believed that a variation occurred about the center of gravity while the aircraft was flying in icing conditions, which could be considered as a contributory factor."}