{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-mount-dianne-5-killed", "date": "Feb 2, 1987 at 0639 LT", "type": "Cessna 402", "operator": "Gold-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cairns – Mount Dianne", "msn": "402B-1236", "yom": 1977, "flight_number": null, "city": "Mount Dianne", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was the first of a group of four aircraft being used to return staff to an alluvial gold mine after a weekend break. The weather in the area of the destination was not suitable for a visual arrival and the aircraft was initially held for several minutes in an area five kilometres to the south of the strip, awaiting an improvement in the weather. The aircraft was then flown towards the strip and the pilot reported to a following aircraft that there had been a lot of rain and that the strip looked wet. He also advised that he intended to carry out a precautionary circuit and check if it was safe to land. No further transmissions were received from VH-TLQ. The wreckage of the aircraft was subsequently found burning in a river valley, 300 metres west of the threshold of runway 34. Surviving passengers stated that the aircraft struck trees shortly before impact. There were no ground witnesses. The aircraft had impacted the ground in a steep nose down left wing low attitude, at a low forward speed, then cartwheeled up rising ground before coming to rest inverted, 42 metres from the point of impact. The cabin area was destroyed by an ensuing fire. ", "probable_cause": " An inspection of wreckage did not reveal any mechanical defect or failure that could have contributed to the accident. The reasons for the apparent loss of control of the aircraft could not be determined. "}