{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-papa-lealea", "date": "Jul 26, 2020 at 1246 LT", "type": "Cessna 402", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Illegal (smuggling)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Papa Lealea - Mareeba", "msn": "402C-0492", "yom": 1981, "flight_number": null, "city": "Papa Lealea", "zone": "Central", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 26 July 2020, at 12:46 local time (02:46 UTC), a Cessna 402C aircraft, registered VH-TSI collided with trees during an aborted take-off at an uncommissioned field near Papa-Lealea, about 16 nm North-West of Port Moresby, Papua New Guinea. The pilot, during interview with the AIC, stated that he departed at 09:30 that day from Mareeba Airport, Queensland Australia and tracked towards the North North-East with a planned track set slightly left of Jacksons International Airport, Port Moresby, National Capital District, Papua New Guinea. As the aircraft neared the Southern shoreline (within the Caution Bay area), he diverted left and began tracking towards the North West along the coast in order to avoid flying over villages in the area. He subsequently crossed over land before turning back to approach the intended landing field. As the aircraft approached to land, the outboard section of the left wing was clipped by a tree and separated from the aircraft. According to the pilot, he continued on with the approach and landed on the field at about 12:20. The pilot reported that he had flown to and within Papua New Guinea in the past and was familiar with the area and airspace. He confirmed that after departing Mareeba, he switched off the transponder. After shutting down the aircraft, the aircraft was refuelled with jerrycans full of fuel (AvGas) and loaded with cargo by persons waiting on the ground. The pilot reported that he estimated that a distance of 800 m would be required for the take-off. According to the pilot, at about 12:40, he lined up and commenced his take-off roll from the Southern end of the field. As the aircraft lifted off, he noticed that the airspeed indicator (ASI) was not working. He also observed that the aircraft was not achieving a positive rate of climb. He subsequently pulled the throttles back and manoeuvred the aircraft back towards the ground. The aircraft touched down with a speed that the pilot described as higher than normal, with about 400 m of usable field remaining. The aircraft continued off the end of the field and into the bushes clipping trees along the way until it came to rest. The pilot informed the AIC that he was the sole occupant of the aircraft, and sustained minor injuries as a result of the occurrence. The aircraft was substantially damaged. The investigation confirmed that the fire to the left wing and engine was a post-accident event and was deliberate. The pilot was later arrested and a load of 500 kilos of cocaine distributed in 28 bales was found at the scene. ", "probable_cause": "The investigation determined that the separation of the outboard section of the left wing, clipped by a tree during the approach to land phase, affected the ability of the left wing to produce lift. The investigation could not conclusively determine the actual weight and balance of the aircraft as it was not possible to determine the quantity and quality of fuel on board, nor the weight and distribution of the cargo that was on board. The evidence gathered during the investigation did not allow the AIC to discard overweight, balance or centre of gravity issues due to improper loading or restrain of the cargo as factors contributing to the inability of the aircraft to obtain a positive rate of climb during take-off. The evidence of tire marks found by the investigators on the uncommissioned field indicated that the aircraft touched down about 400 m before the end of the field, distance that was not enough for the aircraft to come to a stop, continuing its landing roll into the bushes and impacting trees until it got to its final position. The investigation determined that the aircraft was not airworthy at the time of the accident and was unserviceable for the conduct of the flight. The investigation also determined that there was no proper document control to conduct timely scheduled maintenance and that there was no record of a certificate of airworthiness (CoA) at the time of the accident."}