{"url": "https://www.baaa-acro.com/crash/crash-bac-111-516fp-manila-9-killed", "date": "Jul 21, 1989 at 1520 LT", "type": "BAc 111", "operator": "Philippine%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Zamboanga - Manila", "msn": "231", "yom": 1970, "flight_number": "PR124", "city": "Manila-Ninoy Aquino", "zone": "Metro Manila", "country": "Philippines", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 93, "pax_fatalities": 1, "other_fatalities": 8, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On approach to Manila-Ninoy Aquino Airport, the crew encountered poor weather conditions with strong winds and heavy rain falls. On final, the crew was informed by ATC he was too high on the glide and it would preferable to initiate a go-around. The captain continued the approach and the touchdown was made too far down a wet runway 06. Unable to stop within the remaining distance, the aircraft overran, went through a concrete wall, lost its undercarriage and came to rest on a motorway, hitting several vehicles. A passenger died as well as eight people on the ground. All other occupants on board the airplane were rescued, among them 87 were injured as well as 19 people on the ground. ", "probable_cause": "Wrong approach configuration on part of the flying crew who continued the approach with an unstable aircraft above the glide, causing the aircraft to land too far down the runway. The following contributing factors were reported:\r\n- The landing distance available after touchdown was insufficient due to a late landing,\r\n- The braking action was poor because the runway surface was wet, \r\n- The visibility was poor due to heavy rain falls, \r\n- The crew failed to initiate a go-around procedure despite caution from ATC,\r\n- The crew failed to take the appropriate corrective actions in a timely manner."}