{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh84-dragon-turnagain-island", "date": "May 12, 1948", "type": "De Havilland DH.84 Dragon", "operator": "Mandated-Airlines-21", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Lae – Daru – Horn Island – Sydney", "msn": "2061", "yom": 1943, "flight_number": null, "city": "Turnagain Island", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On May 11, the pilot John Spiers left Lae on a ferry flight to Sydney for the annual CofA renewal. On May 12, he departed Daru for Horn Island. Halfway across Torres Strait, he encountered a severe rain storm and turned back to Daru. At low level over sea, the pilot saw a small low mudflat island, so made a forced landing there, wrecking the Dragon. No radio on the aircraft, so Spiers waited to be found. A search was made by a Mandated Airlines C-47 with pilots Brian Carpenter and Tom Deegan as far south as the Australian Gulf country for 3 days. When returning to Daru from Horn Island, they spotted the Dragon on the mudflat island with Spiers sitting on the roof of the aircraft. He had been unable to find food and at high tide the island was mostly under water, so he stayed in the cabin of the Dragon while the sea gradually broke up the aircraft for 6 days without food, surviving by drinking rainwater. RAAF Catalina from Port Moresby landed off Turnagain Island, sent a crew member ashore in a rubber dinghy to collect Spiers. A storm blew up so Catalina returned to Moresby, leaving the two men on the island. They were rescued by a pearling lugger sent from Thursday Island. \r\nSource: http://www.goodall.com.au", "probable_cause": null}