{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-223-chicago", "date": "Feb 9, 1998 at 0954 LT", "type": "Boeing 727-200", "operator": "American-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kansas City - Chicago", "msn": "20986", "yom": 1975, "flight_number": "AA1340", "city": "Chicago-O'Hare", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 115, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11000, "captain_hours_type": 1319, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 59069, "circumstances": "On February 9, 1998, about 0954 central standard time (CST), a Boeing 727-223 (727), N845AA, operated by American Airlines as flight 1340, impacted the ground short of the runway 14R threshold at Chicago O'Hare International Airport (ORD) while conducting a Category II (CAT II) instrument landing system (ILS) coupled approach. Twenty-two passengers and one flight attendant received minor injuries, and the airplane was substantially damaged. The airplane, being operated by American Airlines as a scheduled domestic passenger flight under the provisions of 14 Code of Federal Regulations (CFR) Part 121, with 116 passengers, 3 flight crewmembers, and 3 flight attendants on board, was destined for Chicago, Illinois, from Kansas City International Airport (MCI), Kansas City, Missouri. Daylight instrument meteorological conditions prevailed at the time of the accident. ", "probable_cause": "The failure of the flight crew to maintain a proper pitch attitude for a successful landing or go-around. Contributing to the accident were the divergent pitch oscillations of the airplane, which occurred during the final approach and were the result of an improper autopilot desensitization rate. "}