{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-nuremberg-3-killed", "date": "Feb 8, 2001 at 1540 LT", "type": "Learjet 35", "operator": "E.A.S. Aeroservizi - Executive Aviation Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Nuremberg - Rome", "msn": "35-445", "yom": 1981, "flight_number": null, "city": "Nuremberg", "zone": "Bavaria", "country": "Germany", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2641, "captain_hours_type": 54, "copilot_hours": 575, "copilot_hours_type": 192, "aircraft_hours": null, "circumstances": "During an inspection of the right engine a technician found chips in the oil filter. The damage should have been repaired within the next 20 flight hours. Since the maintenance organization in Switzerland, who usually carry out necessary repairs, did not have the spare parts available on time, the task was assigned to an organization in Nuernberg. On 07.02.2001, the airplane was ferried to Nuernberg and repaired in the presence of the chief technician of the operator. The repairs and the replacement of the parts exclusively on the right engine were certified properly. The return flight to Rome was planned for the 8th of February 2001 at about 1530 o’clock. A charter flight from Rome was to be carried out on the following day. Two pilots and the chief technician of the operator were aboard the aircraft. The flight preparation was carried out by phone from the repair facility. A weather briefing and the NOTAM´s for the flight were obtained properly. The check lists for the take-off were read. During the preparation the unbalanced fuel distribution between the right and left-hand tanks, and the fact that the total amount yet was equal on both sides was discussed. Immediately afterwards the second pilot noticed the failure of his gyro instruments. The airplane was taxied via the taxiways \"Juliet\" and \"Foxtrot\" to runway 10. Pilot at the controls was the pilot in command while the second pilot carried out the radio communications with the air traffic control. The pilots received the clearance for a departure via the departure route Noerdlingen (NDG 1 M) to Rome. The take-off was at 1531 o'clock. After 5 nautical miles the airplane turned to the south, following the departure route. At 15:33:49 o'clock the left-hand engine failed without a previous warning. The noise of a down running engine was also heard by several witnesses on the ground. Smoke or a fire was not seen by them. The second pilot reported an emergency with the left-hand engine shortly after the occurrence to the control tower and informed them that they wanted to return for a landing on the runway 10. At that time there were visual meteorological conditions, and the runway was continuously to be seen. Since the departure control Nuernber APP wished to coordinate the flight, the frequency was changed for a short time upon request. After the second pilot had declared the emergency once again they switched back to the tower again and continued the approach to runway 10. Up to the final approach the flight was without particular occurrences. The flaps were first set to 8° and later on to 20°, afterwards the landing gear was extended. At this time the airplane was somewhat north of the extended centerline slightly above the glide path for an instrument approach. Approximately one kilometer in front of the runway, when flying over the main road no. 4 near the small town of Buch, the airplane was observed by different witnesses as it made unusual flight maneuvers. The airplane deviated then from the landing direction to the north, and made some reeling movements. Afterwards it seemed for a short\r\nperiod that the pilot intended to turn right to reach the runway. Immediately afterwards and near the ground the airplane abruptly stalled to the left approximately maintaining its height, then assuming a bank angle of more than 90°, and crashed nearly upside down at 1540 o’clock into a forest north of the runway. The airport fire service, who were in a standby position due to the announced safety landing of the Learjet reached the accident site approximately 4 minutes later and started to extinguish the fire. All three occupants had lost their lives during the impact. The airplane was destroyed.", "probable_cause": "The accident was caused by an in-flight failure of the left power plant approximately 3 minutes after take-off and an inadequate conduct of the subsequent single-engine landing procedure so that in short final the airplane stalled and crashed from low height. The failure of the left engine was caused by intergranular fractures of retention posts on the high pressure turbine disk. As a result of incorrect service life recordings the maximum number of cycles had considerably been exceeded.\n"}