{"url": "https://www.baaa-acro.com/crash/crash-lockheed-ec-130g-hercules-patuxent-river-nas", "date": "Jan 15, 1972", "type": "Lockheed C-130 Hercules", "operator": "US%20Navy", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Patuxent - Patuxent", "msn": "3871", "yom": 1963, "flight_number": null, "city": "Patuxent River NAS", "zone": "Maryland", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Navy Hercules 151890 had flown for over three months with a maintenance discrepancy on the number one fuel tank quantity indicator. Before the mishap flight, another attempt was made to repair the solder connections in the cannon plug. Maintenance personnel were unable to satisfactorily complete the repair in the time available before that days flight. They hurriedly reassembled the cannon plug and verbally warned the oncoming flight engineer to leave the number one fuel tank quantity indicator system circuit breaker out to prevent the indicator motor from running and ruining the internal clutch. The aircraft then flew four flights prior to the accident. The verbal warning was passed between flight engineers, except on the fourth flight. While conducting preflight procedures the fourth flight engineer noticed the circuit breaker to be out and reset it. The circuit breaker popped within seconds and was then left out for the flight back to home field. The circuit breaker was reset by an unknown person between the time the aircraft landed and the preflight the next day by the mishap crew. Shortly after takeoff from Patuxent River-NAS, MD (NHK), while climbing through 7500 feet, an explosion occurred in the outboard part of the left wing. A fire erupted. The no. 1 engine was shut down and the extinguisher bottles fired. The crew was unable to control the fire. Control difficulties forced the pilot to carry out a forced landing. An emergency descent was flown at a speed of 270 kts IAS and a forced landing was made in a corn field. After the aircraft came to rest, the fire burned for 36 minutes. The fire continued burning aft and inboard before it was extinguished by a local volunteer fire department.", "probable_cause": "The aircraft suffered an inflight explosion in the left wing 5 minutes after takeoff. The explosion occurred in the n°1 main fuel tank in the forward center area beneath the outboard access plate in the immediate vicinity of the n°10 fuel quantity probe. The explosion tore open the upper forward surface of the wing from OWS 369 to OWS 576. The surface of the fuel instantly ignited into a continuous fire forcing the flight crew to complete an emergency landing in an open field 5 minutes after the explosion. The aircraft's left wing continued to burn on the ground for an additional 36 minutes. Fifteen feet of the outer left wing was consumed by the fire. The explosion was caused by the introduction of 115 volt single phase 400 Hz power into the fuel quantity indicating system for the n°1 main fuel tank. An arc occured in the fuel tank airspace from either one of two sources:\r\n- From the n°10 fuel quantity probe to an unknown ground,\r\n- From the coax cable in the immediate vicinity of the n°10 fuel quantity probe to an unknown ground."}