{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-325-navajo-feilding-3-killed", "date": "Dec 17, 2002 at 2041 LT", "type": "Piper PA-31-310 Navajo", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Feilding – Paraparaumu", "msn": "31-7812129", "yom": 1978, "flight_number": null, "city": "Feilding", "zone": "Manawatu-Wanganui (Horizons Regional Council)", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1080, "captain_hours_type": 70, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1806, "circumstances": "The aircraft took off from Feilding Aerodrome on a visual flight rules flight to Paraparaumu. The normal flight time was about 17 minutes. The pilot and his 2 sons, aged 7 years and 5 years, were on board. Earlier that evening the pilot, his wife and 4 children had attended the pilotís farewell work function in Palmerston North. After the function they all went to Feilding Aerodrome where he prepared ZK-TZC for the flight. The pilotís wife saw him carry out a pre-flight inspection of the aeroplane, including checking the fuel. The pilot seemed to her to be his normal self and he gave her no indication that anything was amiss either with himself or ZK-TZC. She did not see the aeroplane taxi but did see it take off on runway 10 and then turn right. She thought the take-off and the departure were normal and saw nothing untoward. She then drove to Paraparaumu with her 2 younger children, the 2 older boys having left in ZK-TZC with their father. An aviation enthusiast, who lived by the aerodrome boundary, watched ZK-TZC taxi and take off, but he did not see or hear the pilot complete a ground run. He saw the aeroplane take off on runway 10 immediately after it taxied and thought the take-off and departure were normal. He did not notice anything untoward with the aeroplane. A radar data plot provided the time, track and altitude details for ZK-TZC. No radio transmissions from the pilot were heard or recorded by Palmerston North or Ohakea air traffic control. Palmerston North Control Tower was unattended from 2030 on the evening of the accident. The radar data plot showed that after take-off ZK-TZC turned right, climbed to 1000 feet above mean sea level (amsl) and headed for Paraparaumu. When the aeroplane was about 2.7 nautical miles (nm) (5 km) from Feilding Aerodrome and tracking approximately 1.3 nm (2.4 km) northwest of Palmerston North Aerodrome it turned to the left, descended and headed back to Feilding Aerodrome. The aeroplane descended at about 500 feet per minute rate of descent to 400 feet amsl. At 400 feet amsl (about 200 feet above the ground) the aeroplane passed about 0.5 nm (900 m) east of the aerodrome and threshold for runway 28, and joined left downwind for runway 10. In the downwind position the aeroplane was spaced about 0.3 nm (500 m) laterally from the runway at an initial height of 400 feet amsl, or about 200 feet above the ground. ZK-TZC departed from controlled flight when it was turning left at a low height during an apparent approach to land on runway 10, with its undercarriage and flaps extended. ZK-TZC first rotated to face away from the aerodrome before striking the ground in a nose down attitude. The 3 occupants were killed in the impact. Two witnesses, who were about 3.5 km southeast of Palmerston North Aerodrome and about 6 km from the aeroplane, saw the aeroplane at a normal height shortly before it turned back towards Feilding. They described what they thought was some darkish grey smoke behind the aeroplane shortly before it turned around. A witness near Palmerston North recalled seeing the aeroplane in level flight at about 1000 feet before it rolled quickly into a steep left turn and then headed back toward Feilding Aerodrome. After the steep turn the aeroplane descended. He thought that one or both engines were running unevenly. He did not see any smoke or anything unusual coming from the aeroplane. He lost sight of the aeroplane when it was in the vicinity of Feilding. He remembered that at the time it was getting on toward dark and that there was a high cloud base with gusty winds. Another witness travelling on a road from Feilding Aerodrome to Palmerston North saw the aeroplane fly low over his car. He saw the undercarriage extend then retract and that the left propeller was stationary. He believed the other engine sounded normal. He then saw the aeroplane continue toward Feilding Aerodrome and cross the eastern end of the runway. He thought the aeroplane was trying to turn and said it seemed to be quite low and slow. He did not see any smoke coming from the aeroplane. He was not overly concerned because he thought it was a training aeroplane. He said the weather at the time was clear with a high overcast. The aviation enthusiast saw ZK-TZC return for a landing and fly to a left downwind position for runway 10. He thought the aeroplane was quite low. He said the left propeller was feathered and was not turning and believed the right engine sounded normal. He did not see any smoke coming from the aeroplane. He could not recall the position of the undercarriage or flaps. After a while he became concerned when he had not seen the aeroplane land. He described the weather at the time as being fine with good visibility but that it was getting on toward dark. A further witness living near Feilding Aerodrome by the threshold to runway 10 heard the aeroplane coming and then fly overhead. He said the aeroplane sounded very low and very loud, as though its engine was at maximum speed (power). The engine sounded normal, except that it sounded as though it was under high power. He said there was a slight breeze, clear conditions and a high overcast at the time. A couple living by Feilding Aerodrome on the approach path to runway 10 heard the aeroplane coming from a northerly direction. They thought its engine sounded as though it was under a heavy load and said it was making a very loud noise like a topdressing aeroplane. The engine was making a steady sound and was not intermittent or running rough. The steady loud engine noise continued until they heard a loud thump, when the engine noise stopped abruptly. They said that at the time it was getting on toward dark but the weather was clear with good visibility. An eyewitness to the accident saw the aeroplane at a very low height, about the height of some nearby treetops, when it turned left to land. The aeroplane was turning left when she saw it nose up sharply and then suddenly turn back in the opposite direction, before nosing down and hitting the ground nose first. She said the aeroplane seemed to snap in half after it hit the ground. ", "probable_cause": "The following findings were identified:\r\n- The aircraft records showed ZK-TZC had been properly maintained and was airworthy before the accident.\r\n- No conclusive reason could be found to explain why the left propeller was feathered.\r\n- The pilot chose an improper course of action and flew an improbable circuit in attempting to land ZK-TZC back at the departure aerodrome with one engine inoperative, which led to the accident.\r\n- The pilot's handling of the emergency was unaccountable.\r\n- There was no indication that the training the 2 instructors gave the pilot was anything other than of a proper standard and above the minimum requirements.\r\n- Had the pilot applied the techniques that both instructors said they taught him for a one-engine-inoperative approach and landing, and chosen any of a number of safer options readily available to him, the accident would probably not have occurred. "}