{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-southampton", "date": "May 26, 1993 at 0634 LT", "type": "Cessna 550 Citation II", "operator": "Aerocharter Midlands", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Oxford - Southampton - Eindhoven", "msn": "550-0288", "yom": 1981, "flight_number": null, "city": "Southampton", "zone": "Hampshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16700, "captain_hours_type": 850, "copilot_hours": 1322, "copilot_hours_type": 109, "aircraft_hours": 4315, "circumstances": "Cessna Citation G-JETB was to fly eight passengers from Southampton (SOU) to Eindhoven (EIN). Because G-JETB had arrived at Oxford (OXF) the previous evening, the airplane had to be ferried to Southampton early in the morning. This as a regular occurrence. The co-pilot had agreed with the airport authorities at both Oxford and Southampton that the aircraft would operate outside normal hours on the understanding that no fire cover would be provided. Following the takeoff from Oxford at 05:19 the crew contacted Brize Norton ATC and agreed a Flight Information Service. They maintained VMC for the transit at 2,400 feet QNH and called Southampton ATC on their alternate radio at 05:25 when they were approximately 30 nm from Southampton. The Southampton controller was surprised at their initial call and advised them that the airport did not open until 06:00. The crew informed him that arrangements had been made for an early arrival and the controller asked them to standby while he checked this agreement. At 05:27 he called G-JETB, informed the crew that they could land before the normal opening hours and asked them to confirm that no fire cover was required. The crew confirmed this and were then told that runway 02 was in use with a wind of 020 deg./14 kt and that there was a thunderstorm right over the airport. The crew then advised Brize Norton radar that they were going to Southampton ATC and left the Brize Norton frequency. Following a further check with Southampton they were given the 0520 weather observation: \"Surface wind 040 deg/12 kt, thunderstorms, 2 oktas of stratus at 800 feet, 3 oktas of cumulonimbus at 1,800 feet, temperature 12 C, qnh 1007 mb, qfe 1006 mb, the runway is very wet.\" At 05:30 the controller asked the crew for the aircraft type and, after being told that it was a Citation II, told the crew that the visibility was deteriorating (\"Now 2,000 metres in heavy thunderstorms\" ) and cleared them to the Southampton VOR at 3,000 feet QNH. After checking that they were now IFR the controller confirmed the clearance, and the QNH of 1007 mb, and informed the crew that there was no controlled airspace and that he had no radar available to assist them. Shortly afterwards the controller advised the crew that: \"Entirely at your discretion you may establish on the ILS localiser for runway 20 for visual break-off to land on runway 02.\" The commander accepted this offer and, within the cockpit, asked the co-pilot for the surface wind. He was informed that it was 040 degrees but that earlier they had been given 020 deg/14 kt. At 05:32 the commander had positioned on the ILS for runway 20 and began his descent; the co-pilot advised Southampton that they were established. The controller acknowledged this and again passed the QNH. Shortly afterwards he asked the crew to report at the outer marker and this message was acknowledged. At 05:33 the crew called that they were visual with the runway and the controller cleared them for a visual approach, left or right at their convenience, for runway 02. As this transmission was taking place, the commander informed his co-pilot that they would land on runway 20. The commander decided this because he could see that the weather at the other end of the runway appeared very black and he had mentally computed the tailwind component to be about 10 kt. After a confirmation request from the co-pilot to the commander, the co-pilot informed the Southampton controller that they would land on runway 20. The controller then advised them that: \"You'll be landing with a fifteen knot, one five knot, tailwind component on a very wet runway\" ; this was immediately acknowledged by the co-pilot with: \"roger, copied thank you\". The crew continued with their approach, initially at 15 kt above their computed threshold speed (VREF) of 110 kt and then at a constant VREF+10 kt. Within the cockpit the commander briefed the co-pilot that if they were too fast the co-pilot was to select flap to the takeoff position and they would go-around; they also discussed the use of the speedbrake and the commander stated that he would call for it when he wanted it. The speed at touchdown was within 5 kt of the target threshold speed and touchdown was in the vicinity of the Precision Approach Path Indicators (PAPIs), according to witnesses in the Control Tower and on the airport; the commander was certain that he had made a touchdown within the first 300 feet of the runway. The PAPIs are located 267 metres along the runway. Speedbrake was selected as the aircraft touched down and, although the commander applied and maintained heavy foot pressure on the brakes, no retardation was apparent; external observers reported heavy spray from around the aircraft. At some stage down the runway the commander stated that the brakes were not stopping them and the co-pilot called for a go-around ; the commander replied : \"No we can't\" as he considered that a go-around at that stage would be more dangerous. He maintained brake pressure and, in an attempt to increase distance, steered the aircraft to the right edge of the runway before trying to steer back left. Initially the aircraft nose turned to the left and the aircraft slid diagonally off the right side of the runway on to the grass. It continued across the grass for a distance of approximately 233 metres while at the same time yawing to the left. However, 90 metres beyond the end of the runway there is an embankment which forms the side of the M27 motorway and G-JETB slid down this embankment on to the motorway. The aircraft continued to rotate as it descended and came to rest, having turned through approximately 150 degrees, with its tail on the central barrier. During these final manoeuvres the aircraft collided with two cars travelling on the eastbound carriageway; the aircraft and one of the cars caught fire. During the approach of the aircraft, the airport Rescue and Fire Fighting Service (RFFS) duty officer had discussed with the duty ATC controller the imminent arrival of G-JETB. Although not all checks had been complete, the fire officer offered his two fire vehicles as a weather standby ; he did not declare his section operational but agreed with ATC that they would position themselves to the west of the runway. When the aircraft was 1/2 to 2/3 down the runway, the ATC controller considered that the aircraft would not stop in the runway available and activated the crash alarm. The fire section obtained clearance to enter the runway after G-JETB had passed their position and followed the aircraft. Assessing the situation on the move, the fire officer ordered the FIRE 2 vehicle to disperse through the crash gate to the motorway, and took his own vehicle (FIRE 1) to the edge of the embankment. On arrival, the fire section contained the fires. The occupants of the aircraft and cars escaped with minor injuries.", "probable_cause": "The investigation identified the following causal factors:\r\n- The commander landed with a reported tailwind of 15 knots which was outside the aircraft maximum tailwind limit of 10 knots specified in the Cessna 550 Flight Manual.\r\n- The copilot did not warn the commander that he was landing with a reported tailwind component which was outside the aircraft limit.\r\n- With a tailwind component of 10 knots, the landing distance available was less than the landing distance required."}