{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-popayan-7-killed", "date": "Sep 15, 2019 at 1406 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "TransPacificos", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "City", "schedule": "Popayán - López de Micay", "msn": "31-7405212", "yom": 1974, "flight_number": null, "city": "Popayán-Guillermo León Valencia", "zone": "Cauca", "country": "Colombia", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 3291, "captain_hours_type": 991, "copilot_hours": 300, "copilot_hours_type": 55, "aircraft_hours": 12304, "circumstances": "The twin engine airplane departed Popayán-Guillermo León Valencia Airport runway 26 at 14:06:06. The aircraft encountered difficulties to gain sufficient height. About 20 seconds after liftoff, at a speed of 82 knots, the aircraft rolled to the right then entered an uncontrolled descent and crashed onto two houses located 530 metres past the runway end. Two passengers were seriously injured and seven other occupants were killed.", "probable_cause": "A loss of in-flight control of the aircraft due to possible excess weight. The aircraft probably managed to take off due to \"ground effect\", but, once in the air and out of ground effect, it was not able to obtain the speed that would allow it to safely accomplish the climb. \r\nContributing Factors:\r\n- Absence of Dispatch procedures of the operator to perform a correct Weight and Balance of the aircraft, and the effective control of the boarded cargo.\r\n- Incorrect calculation of the weight and balance of the aircraft by the crew, by not considering all the cargo that was loaded, causing the aircraft to take off with a possible excess weight.\r\n- Weak operational safety management processes of the operator by not considering the operating characteristics of airfields such as Popayán (high altitude, high ambient temperature) that significantly limit the operation."}