{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-201d-chesterfield-15-killed", "date": "Jul 30, 1949 at 1030 LT", "type": "Douglas DC-3", "operator": "Eastern-Airlines-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Boston – New York – Wilmington – Memphis", "msn": "2260", "yom": 1940, "flight_number": "EA557", "city": "Chesterfield-Spirit of St Louis", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": 10013, "captain_hours_type": 5595, "copilot_hours": 1397, "copilot_hours_type": null, "aircraft_hours": 37840, "circumstances": "The DC-3 was on a regularly scheduled flight en route from La Guardia Field, N Y., to Wilmington, Del., having originated at Boston, Mass., with Memphis, Tenn., as the destination. Takeoff from La Guardia was at 1000, with 12 revenue passengers and a fresh crew consisting of Captain L. R. Matthews, Pilot J. B. Simmons, and Flight Attendant Peter Gobleck. The aircraft was loaded within the prescribed limits for weight and location of center of gravity. The clearance was in accordance with Visual Flight Rules. The flight reported its position as over Freehold, N J., at 1017 and estimated arrival over Philadelphia, Pa., at 1037 and Wilmington, Del., at 1045. This was the last radio contact with the DC-3. The F-6-F-5 was en route from the Naval Air Station Anacostia, DC, to the Naval Air Station, Quonset Point R. I., on a training, or proficiency flight. Takeoff from Anacostia was at 0937 with the aircraft piloted by Lieutenant (j g) Robert V. Poe, USN. Clearance was in accordance with Visual Flight Rules, specifying a cruising speed of 160 knots (184 statute miles per hour) and an estimated time en route of two hours. There is no record of any position report or other radio contact from the F-6-F-5 after it was cleared for takeoff by the Anacostia tower. Weather conditions existing over the route of both aircraft were good. The visibility was 10 miles and there were scattered clouds at 12,000 feet. At about 1030 the F-6-F-5 was observed to perform acrobatics and to \"buzz\" a small civil aircraft in the neighborhood of Chesterfield, N. J. These maneuvers terminated in collision between the F-6-F-5 and the DC-3. Upon collision the fighter plane lost its left wing and the DC-3 lost the outer portion of its left wing. Both aircraft then fell in erratic paths, losing various parts while falling. The DC-3 burned when it struck the ground. The fighter's pilot was either seriously injured or killed at the time of the collision and was thrown clear of the aircraft during the descent. There was no indication that he attempted to use his parachute. The fighter did not burn on impact. All 16 occupants in both aircraft were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the reckless conduct of the Navy pilot in performing acrobatic maneuvers on a Civil Airway and his failure to notice the presence of an air carrier aircraft with which he collided.\r\nThe following findings were noted:\r\n- The Navy pilot was performing acrobatics on the airway immediately prior to and at the time of collision,\r\n- Neither aircraft was seen by the crew of the other in time to avoid collision."}