{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-820c-caraja-lencois-2-killed", "date": "Mar 31, 2008 at 0630 LT", "type": "Embraer EMB-820 Navajo/Carajá", "operator": "Abaet%C3%A9", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Salvador – Lençóis", "msn": "820-144", "yom": 1986, "flight_number": null, "city": "Lençóis", "zone": "Bahia", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 25000, "captain_hours_type": 1769, "copilot_hours": 750, "copilot_hours_type": 195, "aircraft_hours": 7293, "circumstances": "The twin engine aircraft departed Salvador Airport at 0525LT on a cargo flight to Lençóis, carrying two pilots and a load of bank documents. On final approach to Lençóis Airport, the crew encountered limited visibility due to marginal weather conditions. The captain decided to continue the approach and completed a turn to the left when the aircraft crashed 2 km from the runway threshold, bursting into flames. The aircraft was totally destroyed and both pilots were killed. ", "probable_cause": "The decision of the captain to continue the approach under VFR mode in IMC conditions to an airport that was not suitable for IFR operations. The following contributing factors were identified:\r\n- The lack of ground references may have contributed to the commander's spatial disorientation,\r\n- Although the weather conditions made it impossible to land under VFR conditions, the captain insisted on landing, neglecting IFR procedures,\r\n- The captain ignored the copilot's advice and continued with the approach procedure,\r\n- The captain put the aircraft in an attitude that caused it to stall,\r\n- Poor judgment on part of the captain,\r\n- Despite the implementation of a CRM program, the operator was unable to identify that the captain was violating the published procedures."}