{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-27-islander-norman-wells", "date": "Dec 17, 1986 at 1749 LT", "type": "Britten-Norman Islander", "operator": "Nahanni Air Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "169", "yom": 1970, "flight_number": null, "city": "Norman Wells", "zone": "Northwest Territories", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The BN-2A Islander was on a night visual approach to Norman Wells (YVQ) in conditions of low ceilings and reduced visibility. At 500 feet above ground level (agl), the aircraft was in and out of the cloud base, and the pilot observed lights below. Believing he was over the town of Norman Wells, the pilot descended in an attempt to get below the cloud base for a visual right-hand circling approach to runway 08. The pilot was turning onto a northerly heading, when the aircraft struck the ice of the Mackenzie River. The right main gear broke off, and the aircraft bounced and remained airborne for approximately half a mile. It then skidded 600 feet along smooth ice into an area where large blocks of ice brought the aircraft to a stop.", "probable_cause": "The following findings were reported:\r\n- The pilot mistook the lights of the oil installations for the lights of the town,\r\n- In an attempt to maintain visual contact with the ground, the pilot descended below a reported 500-foot cloud base in an area where the cloud merged with ground fog, with the result that the aircraft descended to ground level,\r\n- The unserviceable instrument panel light for the pilot's altimeter prevented the pilot from having continuous altitude information."}