{"url": "https://www.baaa-acro.com/crash/crash-cessna-t303-crusader-san-diego", "date": "May 7, 1999 at 2230 LT", "type": "Cessna 303 Crusader", "operator": "Neville A. Lewis", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Houston – San Diego", "msn": "303-00018", "yom": 1981, "flight_number": null, "city": "San Diego-Lindbergh Field", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 25000, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1832, "circumstances": "The airplane departed Houston, Texas, for a VFR flight to San Diego, California. The pilot in the left seat said that they originally planned to purchase fuel at Gila Bend, Arizona, but were told that the fueling was closed. The left seat pilot said they elected to land at a private airstrip and made arrangements to have an individual drive to Casa Grande airport to purchase fuel for them. The left seat pilot said they were worried about adequate runway length, so they elected to only purchase 65 gallons of fuel for the remainder of the flight to San Diego. En route to San Diego, the right seat pilot obtained weather for the destination from FSS and was advised of 1,000-foot overcast ceiling. The right seat pilot then requested and received an instrument clearance. The TRACON controller advised the pilot of the accident airplane that he would have to keep speed up due to jet traffic or be given delay vectors for traffic spacing. The pilot told ATC that they were fuel critical and later said they had about 45 minutes to 1 hour of fuel. The right seat pilot was cleared for the localizer runway 27 approach. Approximately 18 minutes later, the pilot elected to do a missed approach because he was too high to land and moments later told San Diego radar that he was fuel critical and only had about 5 minutes of fuel left. San Diego radar began to give the pilot vectors to the closest airport and told the pilot not to descend any further. The right seat pilot replied that they were a glider and later told San Diego police that they had run out of fuel. There were no discrepancies noted with either the airframe or the engines during the postaccident aircraft examination.", "probable_cause": "The pilot-in-command's inaccurate fuel consumption calculations that resulted in fuel exhaustion and the subsequent ditching. "}