{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh84a-dragon-lae", "date": "Aug 20, 1947", "type": "De Havilland DH.84 Dragon", "operator": "Mandated-Airlines-21", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Lae – Kokoda – Popondetta", "msn": "2065", "yom": 1943, "flight_number": null, "city": "Lae", "zone": "Morobe", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After takeoff from Lae-Nadzab Airport, while climbing vertical to the Huon Gulf, the right engine failed, followed shortly later by the left engine. The pilot reduced his altitude and ditched the aircraft off Lae. All three occupants were quickly rescued by a fisherman while the aircraft was lost. \r\nTestimony from the passenger: \r\n\"I had the day off and Johnny Rose was doing a trip to Kokoda and Popondetta. I'd never been there and when he offered me a seat I jumped at it. He had another passenger on board, engineer Fred Starr. We took off and headed across the Huon Gulf in the general direction of Salamaua. Then bang, the starboard engine went. I wasn't too worried, we were only a few minutes out of Lae and John was a good pilot. Then bang, the port engine cut. Must have been water in our fuel.  I said to John \"How are we going?” he said \"Not a hope in Hades\".\r\nWe hit the water with a tremendous splash, right alongside the Tenyo Maru. My seat belt snapped and I was hurled forward. My head went through the top of the cabin, right between the two metal spars. The hole was big enough to let me climb out as the Dragon settled in the water. I helped Fred Starr out and looked around for Johnny. There he was, still sitting in the cockpit with his head just above the water, fishing around for his camera. We persuaded him to join us on the upper wing.\"\r\nSource:\r\nhttp://www.goodall.com.au/australian-aviation/dh84-pt2/dh84-dragon-pt2.htm", "probable_cause": "Double engine failure, maybe due to fuel contaminated by water. "}