{"url": "https://www.baaa-acro.com/crash/crash-learjet-24-atlanta-7-killed", "date": "Feb 26, 1973 at 1012 LT", "type": "Learjet 24", "operator": "Machinery Buyers Corporation", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Atlanta - Miami", "msn": "24-121", "yom": 1966, "flight_number": null, "city": "Atlanta-DeKalb-Peachtree", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 5600, "captain_hours_type": 2150, "copilot_hours": 4000, "copilot_hours_type": 4, "aircraft_hours": 4041, "circumstances": "A Gates Learjet 24, N454RN, operated as a corporate flight by Machinery Buyers Corp., crashed following takeoff from runway 20L at DeKalb-Peachtree Airport, Atlanta, Georgia. The aircraft was destroyed by impact and fire. The two crewmembers and five passengers were fatally injured and one person on the ground sustained serious burns. An apartment building was damaged, three parked vehicles were destroyed, and another vehicle was damaged by impact and fire. The pilot had filed an Instrument Flight Rules (IFR) flight plan from Atlanta, Georgia, to Miami, Florida, with a proposed departure time of 09:50 and an en route altitude of Flight Level 410. The flight was cleared for takeoff from runway 20L at 10:10. The weather at the time of the accident was overcast, with ceiling 500 feet, visibility 4 miles in fog and smoke, wind 060° at 4 knots, altimeter setting 30.20 inches. Ground witnesses stated that the airplane had made a normal take-off, but was trailing blue-white or blue-gray smoke when it crossed the airport boundary. The following conversation with the flight was recorded by the airport control tower: \r\nTower - \"Lear 454RN it appeared the left engine laid a pretty good layer of smoke out of the left side there for approximately 300 or 400 feet.\"\r\n454RN - \"We just hit some birds.\"\r\nTower - \"Roger, you turning to land?\"\r\n454RN - \"Don't believe we're gonna make it.\" (Last transmission by the crew.\r\nThe aircraft climbed to a height about 250 to 300 feet above the ground before it started to settle in a nose-high attitude. The airplane collided initially with the roof of a three-story apartment building, approximately 2 miles south-southwest of the airport. The wreckage came to rest in a wooded ravine adjacent to a busy highway, 165 feet southwest of the damaged building. The airplane's takeoff path was over a residential area which contained numerous apartment complexes, shopping centers, and busy thoroughfares. A suitable emergency landing site was not available. The airplane's windshield and center post contained bird residue and bird feathers. After the accident, the remains of 15 cowbirds were found within 150 feet of the departure end of runway 20L. Both engines showed distortion and foreign object damage to the compressor rotor assemblies. Foreign material obstructed approximately 75 percent of the cooling air ports of the first-stage turbine nozzles.", "probable_cause": "The loss of engine thrust during takeoff due to ingestion of birds by the engines, resulting in loss of control of the airplane. The Federal Aviation Administration and the Airport Authority were aware of the bird hazard at the airport; however, contrary to previous commitments, the airport management did not take positive action to remove the bird hazard from the airport environment."}