{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31p-pressurized-navajo-louisville-1-killed", "date": "Sep 27, 1999 at 0605 LT", "type": "Piper PA-31-310 Navajo", "operator": "Merline Nix", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tupelo - Louisville", "msn": "31-7530003", "yom": 1975, "flight_number": null, "city": "Louisville-Winston County", "zone": "Mississippi", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4100, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot received a weather briefing before departure and when near the destination airport, cleared for the NDB approach. The pilot reported the procedure turn inbound; published MDA is 1,300 feet msl. Witnesses on the airport reported heavy low fog and heard the pilot announce over the UNICOM frequency, 'Oh there is fog rolling into Starkville too?' One of the witnesses advised the pilot they could go to another airport due to the fog; the pilot responded he would execute the approach. The witnesses heard the engines operating at full power then heard the impact and saw a fireball. The airplane impacted the runway inverted, slid across the runway, and came to rest in grass off the runway. A post crash fire destroyed the airplane. Tree contact approximately 972 feet northwest of the runway impact location separated approximately 51 inches of the left wing. Examination of the engines, propellers, and flight controls revealed no evidence of preimpact failure or malfunction. The pilot had twice failed his airline transport pilot checkride. The designated examiner of the second failed flight test indicated the pilot was marginal in all flight operations. The NDB was checked after the accident; no discrepancies were noted.", "probable_cause": "The pilot's disregard for the published minimum descent altitude resulting in tree contact and separation of 51 inches of the left wing. Findings in the investigation were the pilot's two failures of the ATP checkride in a multiengine airplane."}