{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-carnarvon", "date": "Aug 18, 1989 at 1856 LT", "type": "Piper PA-31-310 Navajo", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Geraldton – Carnarvon", "msn": "31-7812098", "yom": 1978, "flight_number": null, "city": "Carnarvon", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At approximately 1809, (23 minutes before last light) during final approach to landing at Carnarvon, the pilot noticed that the landing gear had not extended correctly. The aircraft remained in the circuit area whilst the pilot attempted to lower the landing gear using both manual and emergency methods. He also sought assistance from the company's, Perth based, duty pilot and Carnarvon based engineers. After exhausting all possible methods of lowering the gear the pilot decided to land with the landing gear and flaps retracted. The pilot rejected a landing on the sealed runways because he was apprehensive that it would cause unnecessary damage to the aircraft and could result in a fire. He considered landing in a riverbed (rejected by the Senior Operational Controller), alongside one of the sealed runways (the surface was unsuitable) and on one of the dirt strips. The pilot was offered a flare path on dirt runway 27 however, he declined and indicated that he would try to land using the available light. At 1856 (last light was at 1832) the pilot attempted a landing on runway 27. On late final approach the aircraft collided with a one and a half metre high levy bank, 270 metres short and 115 metres to the right of the threshold. The pilot was trapped in the wreckage for some time after the aircraft came to a stop. While the passenger was slightly injured, the pilot was seriously wounded. ", "probable_cause": "The landing gear problem arose when the left main landing gear would not lower. Examination of the aircraft revealed that both hinges fitted to the inboard landing gear door had fractured. The forward hinge had fractured as a result of fatigue and the rear hinge as a result of overload. The fatigue crack initiation had occurred at a sharp edged, prominent forging flash on the inner radius of the hinge and had grown over approximately 4000 load cycles. A similar fatigue problem had been identified on an earlier version of the hinge (part number 46653-00), however, regular inspections for fatigue cracking were discontinued when hinges with part number 47529-32 (as fitted to VH-DEG) were introduced in 1980. Similar fatigue cracking was found in the forward door hinge of another PA31 during the investigation. The fractured hinges jammed the left main landing gear mechanism and neither the normal or emergency extension systems could extend the gear. The pilot was apprehensive about wheels up landings. Much of his decision making was aimed at reducing the risk of fire and minimising the damage the aircraft would sustain during the landing. eg. Selection of a dirt runway instead of the sealed strip, landing with flaps retracted etc. During the pilot's attempts to rectify the landing gear problem, and up until the time of his touchdown, he was subjected to considerable radio transmission traffic involving questions, directions and suggestions which distracted him from his primary tasks. The pilot indicated on at least two occasions that he was ready to land, however, each time advice and questions from the ground personnel involved overrode his intentions. When the pilot was asked if he wanted a flare path on runway 27 there was still some natural light available and he was intending to land. However, by the time he was able to make his final approach it was dark and he was unable to see the ground. Studies have shown that aircrew subjected to high levels of stress can suffer skill fatigue and cognitive task saturation, which in turn can lead to a breakdown in the decision making process. It was apparent from the pilot's radio transmissions and the quality of the decisions made in the latter part of the flight that his information processing and decision making abilities had been degraded by the stress of continuous radio transmissions and continuous, and sometimes conflicting, instructions. As a result, what should have been a relatively simple wheels up landing in daylight was turned into an extremely difficult wheels up landing at night. With the landing gear retracted the aircraft's taxi and landing lights were not available to the pilot. \r\nThe following factors were considered relevant to the development of the accident:\r\n1. Manufacturing defect. A forging flash created a stress concentration which led to fatigue cracking.\r\n2. Inadequate inspection procedures. Previous inspection procedures introduced to disclose similar cracking were withdrawn on the introduction of later part numbered hinges.\r\n3. Apprehension of the pilot. The pilot was apprehensive about apparently significant dangers of landing an aircraft, wheels up, on a sealed runway.\r\n4. Inordinate interference in aircraft operations by ground based advisors. The ground advisors input overrode the pilot's decision on a number of occasions with the result that a simple exercise became very complicated.\r\n5. Cognitive task saturation and skill fatigue. The amount of information, advice and suggestions being passed via the radio communications system overloaded the pilot decision making abilities.\r\n6. Improper in-flight decisions. As a result of task saturation the final decision made by the pilot to attempt a night landing on an unlighted strip was incorrect.\r\n7. The pilot did not see and therefore was unable to avoid the levy bank. "}