{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-king-island-currie-1-killed", "date": "Feb 8, 1996 at 0507 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "King%20Island%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Postal (mail)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Melbourne - King Island", "msn": "31-7405222", "yom": 1974, "flight_number": null, "city": "King Island-Currie", "zone": "Tasmania", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5519, "captain_hours_type": 106, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A witness heard the aircraft pass King Island aerodrome at 0455 EST at the same time as he noticed the pilot-activated 10/28 runway lights illuminate. The pilot reported to Melbourne Control that he would be completing a runway 10, non-directional beacon (NDB) approach. A short time later he broadcast that the aircraft was at the minimum descent altitude, which is 640 feet above mean sea level (AMSL) for a runway 10 NDB approach. He also broadcast that there was a complete cloud cover. The aircraft did not enter a missed approach procedure but was heard to fly towards the south-east from overhead the NDB, which is located 1.3 km south-south-west of the centre of runway 10/28. A second witness, located near the NDB site, reported observing the aircraft's lights to the south-east. At 0507 a farmer heard the aircraft pass low over his house shortly before it crashed into trees, 3.5 km south-east of the aerodrome. The first responders arrived at the accident site at about 0530. The pilot had not survived.", "probable_cause": "The pilot continued a visual approach in conditions which prevented him from maintaining adequate visual clearance from the ground or obstacles and which made visual judgement of the approach difficult. Also, the pilot probably did not recognise that the conditions were not suitable for a visual approach.\n"}