{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-iii-headcorn-1-killed", "date": "Mar 11, 2007 at 1600 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Para-Flite", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Headcorn - Headcorn", "msn": "1632", "yom": 1966, "flight_number": null, "city": "Headcorn", "zone": "Kent", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 932, "captain_hours_type": 27, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was conducting flights for the purpose of parachute operations; these flights are known colloquially as ‘lifts’. On the previous day, he had conducted 13 lifts, of which eleven were to an altitude of 12,000 ft and two to an altitude of 5,500 ft or less. On the day of the accident the pilot recorded that he took off for the first lift at 0927 hrs. The aircraft, with nine parachutists aboard, climbed to 12,000 ft and landed at 0946 hrs. There followed three flights of an average 18 minute duration, between each of which the aircraft was on the ground for no more than 7 minutes. The last of these flights landed at 1100 hrs, after which the aircraft uplifted 230 ltr of Jet A1 fuel. The aircraft utilised the main runway, Runway 29, for each of these flights. The surface wind had freshened from the south and the pilot requested the use of the shorter Runway 21. The air/ground radio operator refused this request because he believed that the pilot had not been checked out to use this runway, as required by the Headcorn Aerodrome Manual. Accordingly, the pilot approached a nominated check pilot who agreed to observe his next flight. The check pilot briefed the pilot of OY-JRR on the procedures for using the short runway, emphasising the need to make an early decision to abort the takeoff if necessary. The check pilot stated that the pilot of OY-JRR performed a thorough pre-takeoff check using the full checklist available in the cockpit and that the subsequent flight was entirely satisfactory. Following the check flight the aircraft took off again at 1148 hrs and flew a further five flights, each separated by periods that ranged between 7 and 36 minutes. The check pilot observed several of these flights, all of which were from Runway 21, and most appeared to proceed normally. He and another witness noticed that on one occasion the climb gradient after takeoff appeared shallower than normal, but they believed that the wind speed had decreased at this time. The pilot recorded that the aircraft was refuelled again after landing at 1443 hrs, this time uplifting 266 ltr of fuel. The next takeoff was at 1447 hrs and having climbed to 12,000 ft again the aircraft landed at 1521 hrs. The accident occurred on the pilot’s eleventh flight of the day. Prior to the flight the aircraft was refuelled with a further 100 ltr at 1555 hrs. Shortly before 1605 hrs the aircraft taxied to Runway 21. It appeared to accelerate normally but at no time was the tail seen to rise in its usual manner prior to becoming airborne. Onboard, the experienced jump-master noticed that the aircraft was passing the aerodrome refuelling installation and several aircraft parked close to the runway, beyond the intersection of Runway 21 with Runway 29. He was aware that the aircraft had now passed the point where it would normally become airborne. Almost simultaneously, he heard the pilot shout “Abort”. One of the parachutists shouted to the other occupants “Brace - Brace, everyone on the floor”. The aircraft stopped abruptly when its left wing and cockpit collided with a camouflaged F100 fighter aircraft which was parked as a museum exhibit to the left of the southern edge of Runway 21. The occupants of the cabin were able to vacate the aircraft with mutual assistance. Members of the aerodrome fire service extinguished a small fire, which had started in the area of the engine, and other witnesses helped the occupants to move away from the aircraft. The pilot, however, remained unconscious in the cockpit. He was attended subsequently by paramedics and taken to hospital, where he succumbed to his injuries.", "probable_cause": "The pilot’s training was probably adequate for the normal and abnormal circumstances envisaged by his instructor. However, the pilot was not familiar with the handling or performance characteristics of the aircraft during takeoff with the flaps in the UP position and consequently he may not have identified that the aircraft was in the wrong configuration for takeoff. The design authority for this type considered that this configuration was “outside the normal flight envelope” and had produced no performance charts or procedures for its use. In such circumstances, it is essential that the pilot follows the published procedures and positively ensures that the aircraft is correctly configured for takeoff."}