{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-65-queen-air-lawrenceville-1-killed", "date": "Feb 8, 2010 at 1705 LT", "type": "Beechcraft 65 Queen Air", "operator": "Robert Peter Watson Sr.", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lawrenceville - Lawrenceville", "msn": "LF-17", "yom": 1960, "flight_number": null, "city": "Lawrenceville-Gwinett County-Briscoe", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10099, "captain_hours_type": 1332, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9234, "circumstances": "During the preflight inspection, some water was present in the fuel sample; it was drained until a clear sample was observed. Subsequently, the fuel tanks were topped off, and the remaining preflight inspection revealed no other anomalies. The pilot initiated a takeoff and upon reaching rotation speed, the airplane became airborne and the landing gear was retracted. The right engine immediately lost power, and the pilot feathered the engine and attempted to return to the airport. Shortly thereafter, the left engine lost power. The pilot informed the air traffic controller that the airplane had lost all power. The airplane subsequently collided with trees and terrain and a post crash fire ensued. A postaccident examination of the airframe and engine revealed no mechanical malfunctions or failures that would have precluded normal operation. Examination of fuel retrieved from the right main fuel tank, as well as fuel from the fixed base operator, revealed no anomalies. The left fuel selector valve was observed in the plugged port (no fluid flow) position, but it was most likely moved to that position during the accident sequence. The right fuel selector valve was partially aligned with the main fuel passageway and was unobstructed. The reason for the loss of engine power to both engines was not determined.", "probable_cause": "The failure of both engines for undetermined reasons."}