{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-giv-teterboro", "date": "Dec 1, 2004 at 1623 LT", "type": "Gulfstream GIV", "operator": "Gama%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Farnborough – Luton – Teterboro", "msn": "1058", "yom": 1988, "flight_number": "GMA946", "city": "Teterboro", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10000, "captain_hours_type": 1000, "copilot_hours": 8000, "copilot_hours_type": 2000, "aircraft_hours": 7452, "circumstances": "The flight was cleared for the ILS Runway 19 approach, circle-to-land on Runway 24; a 6,013-foot-long, 150-foot wide, asphalt runway. The auto throttle and autopilot were disengaged during the approach, about 800 feet agl. However, the auto throttle reengaged just prior to touchdown, about 35 feet agl. The flightcrew did not recall reengaging the auto throttle, and were not aware of the autothrottle reengagement. According to the auto throttle computers, the reengagement was commanded through one of the Engage/Disengage paddle switches located on each power lever. The target airspeed set for the auto throttle system was 138 knots. After touchdown, as the airplane decelerated below 138 knots, the auto throttle system gradually increased the power levers in an attempt to maintain the target airspeed. Without the power levers in the idle position, the ground spoilers and thrust reversers would not deploy. While the flightcrew was pulling up on the thrust reverser levers, they may not have initially provided enough aft force on the power levers (15 to 32 lbs.) to override and disconnect the auto throttle system. The flight data recorder indicated that the autothrottle system disengaged 16 seconds after the weight-on-wheels switches were activated in ground mode. As the airplane neared the end of the runway, the pilot engaged the emergency brake, and the airplane departed the right side of the runway. The autothrottle Engage/Disengage paddle switches were not equipped with switch guards. Although the autothrottle system provided an audible tone when disengaged, it did not provide a tone when engaged. The reported wind about the time of the accident was from 290 degrees at 16 knots, gusting to 25 knots, with a peak wind from 300 degrees at 32 knots. ", "probable_cause": "The flightcrew's inadvertent engagement of the autothrottle system, and their failure to recognize the engagement during landing, which resulted in a runway excursion. Factors were the lack of autothrottle switch guards, lack of an autothrottle engagement audible tone, and gusty winds."}