{"url": "https://www.baaa-acro.com/crash/crash-boeing-777-2h6er-near-hrabove-298-killed", "date": "Jul 17, 2014 at 1620 LT", "type": "Boeing 777-200", "operator": "Malaysia%20Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Amsterdam – Kuala Lumpur", "msn": "28411/84", "yom": 1997, "flight_number": "MH017", "city": "Hrabove", "zone": "Donetsk Oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 15, "crew_fatalities": 15, "pax_on_board": 283, "pax_fatalities": 283, "other_fatalities": 0, "total_fatalities": 298, "captain_hours": 12385, "captain_hours_type": 7303, "copilot_hours": 3190, "copilot_hours_type": 227, "aircraft_hours": 76322, "circumstances": "Flight MH17 departed the gate at Amsterdam-Schiphol Airport, the Netherlands at 12:13 hours local time, bound for Kuala Lumpur, Malaysia. It was airborne at 12:31 (10:31 UTC) from runway 36C and reached a cruising altitude of FL310 at 12:53 (10:53 UTC). Ninety minutes into the flight, at 12:01 UTC and just prior to entering Ukrainian airspace, the flight climbed to FL330. According to the flight plan, flight MH17 would continue at the flight level until the waypoint PEKIT, which is on the Flight Information Region (FIR) boundary between Kiev FIR (UKBV) and Dnipropetrovs’k FIR (UKDV). From waypoint PEKIT the flight plan indicates a climb to FL350 on airway L980 for the remaining part over Ukraine. According to ATC data, at 12:53 UTC the aircraft was flying within the Dnipropetrovs’k FIR, Control Sector 2, at FL330, controlled by Dnipro Control. At that time, Dnipro Control asked whether MH17 was able to climb to FL350 in accordance with the flight plan and also to clear a potential separation conflict with other traffic in the area. This traffic was Singapore Airlines flight SQ351 from Copenhagen, a Boeing 777, flying at FL330 and approaching from behind. The crew replied they were unable to comply and requested to maintain at FL330. This was agreed by Dnipro Control. As an alternative to solve the separation conflict, the other traffic climbed to FL350. According to ATC data, at 13:00 UTC the crew of flight MH17 requested to divert the track 20 NM to the left, due to weather. This also was agreed by Dnipro Control, after which the crew requested whether FL340 was available. Dnipro control informed MH17 that FL340 was not available at that moment and instructed the flight to maintain FL330 for a while. At 13:07 UTC the flight was transferred to Dnipropetrovs’k CTA 4, also with call sign Dnipro Control. At 13:19:53 UTC, radar data showed that the aircraft was 3.6 NM north of centreline of airway L980 having deviated left of track, when Dnipro Control directed the crew to alter their route directly to waypoint RND due to other traffic. The crew acknowledged at 13:19:56 hrs. At 13.20:00 hrs, Dnipro Control transmitted an onward ATC clearance to \"proceed direct to TIKNA after RND\", no acknowledgement was received. Data from the Flight Data Recorder and the Digital Cockpit Voice Recorder both stopped at 13:20:03 hrs. No distress messages were received from the aircraft. The airplane apparently broke up in mid-air as debris was found in a large area. The centre section of the fuselage along with parts of the horizontal and vertical stabilizers was found near Hrabove. The cockpit and lower nose section came down in a sunflower field in Rozsypne, nearly four miles (6,5 km) west-southwest of Hrabove. The L2 and R2 doors along with various parts of the fuselage were found near Petropavlivka, about 5 miles (8 km) west of Hrabove. At the point of last contact it was flying 1000 feet above airspace that had been classified as restricted by Ukrainian authorities as a result of ongoing fighting in the area. In the preceding days before the accident two Ukraine Air Force aircraft that were shot down in the region: a Su-25 and an An-26 transport plane.", "probable_cause": "Causes of the crash:\r\na. On 17 July 2014, Malaysia Airlines operated flight MH17, an airworthy Boeing 777-200 with the registration 9M-MRD, in cruise flight near the Ukrainian/Russian border at 33,000 feet, under the control of Ukrainian Air Traffic Control and was operated by a competent and qualified crew.\r\nb. At 13.20:03 hours (15.20:03 CET) a warhead detonated outside and above the left hand side of the cockpit of flight MH17. It was a 9N314M warhead carried on the 9M38-series of missiles as installed on the Buk surface-to-air missile system.\r\nc. Other scenarios that could have led to the disintegration of the aeroplane were considered, analyzed and excluded based on the evidence available.\r\nd. The impact killed the three persons in the cockpit and caused structural damage to the forward part of the aeroplane leading to an in-flight break-up. The break-up resulted in a wreckage area of 50 square km between the village of Petropavlivka and the town of Hrabove, Ukraine. All 298 occupants lost their lives."}