{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-near-carmelo-5-killed", "date": "May 27, 2014 at 1240 LT", "type": "Beechcraft 200 Super King Air", "operator": "Kowzef", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "San Fernando - Carmelo", "msn": "BB-1367", "yom": 1990, "flight_number": null, "city": "Carmelo", "zone": "Colonia", "country": "Uruguay", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 8039, "captain_hours_type": 478, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4616, "circumstances": "Owned by Grupo Kowzef (Federico Alejandro Bonomi), the twin engine aircraft departed San Fernando (Buenos Aires) at 1222LT on an executive flight to Carmelo, Uruguay. On approach to Carmelo-Zagarzazú Airport runway 35, the pilot encountered marginal weather conditions and initiated a go-around procedure. Few minutes later, he attempted a second approach under VFR mode. While completing a slight turn to the left in descent, the aircraft impacted the surface of the Río de la Plata and came to rest in shallow water some 10 km southwest of Carmelo Airport. The pilot and four passengers were killed and four other occupants were injured. The aircraft was destroyed. ", "probable_cause": "The accident was the consequence of a controlled flight into terrain after the pilot suffered a loss of situational awareness due to a poor evaluation of the flight conditions upon arrival. The following contributing factors were identified:\r\n- The pilot failed to return to his departure airport or to divert to the alternate airport due to poor weather conditions at the destination airport,\r\n- The pilot continued the approach under VFR mode in IMC conditions with visibility below minimums, \r\n- Poor evaluation of the flight conditions at destination on part of the pilot due to the combination of psychological and physiological factors. "}