{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-505-perm-88-killed", "date": "Sep 14, 2008 at 0510 LT", "type": "Boeing 737-500", "operator": "Aeroflot%20Nord", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Moscow - Perm", "msn": "25792/2353", "yom": 1992, "flight_number": "AUL821", "city": "Perm", "zone": "Perm Krai", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 82, "pax_fatalities": 82, "other_fatalities": 0, "total_fatalities": 88, "captain_hours": 3900, "captain_hours_type": 1190, "copilot_hours": 8900, "copilot_hours_type": 236, "aircraft_hours": 44533, "circumstances": "On September 13, 2008 an Aeroflot –Nord flight crew (Captain and copilot), were conducting a scheduled domestic passenger flight n°AFL821 on a B737-505 aircraft, registration VP-BKO, from Moscow (Sheremetyevo, UUEE) to Perm (Bolshoye Savino, USPP). Apart from the two-member flight crew there were 4 flight attendants and 82 passengers on board, which makes a total of 88 people, including 66 citizens of the Russian Federation, 8 citizens of Azerbaijan, 1 citizen of Byelorussia, 1 of Germany, 1 of Italy, 1 of China, 1 of Latvia, 1 of Turkey, 1 of Uzbekistan, 5 citizens of Ukraine and 2 of France. According to the load sheet, the aircraft payload (cargo and passengers) was 8079 kg. The takeoff weight was ~54000 kg (with the max TOW of 60554 kg), the CG was at 20.61 % MAC, which was within the B-737-500 FCOM limitations. The calculated landing weight was 49700 kg (with the maximum of 49895 kg), and the CG was at 21.9 % MAC, which was also within the B737-500 FCOM limitations. The pre-flight briefing was conducted in due time and in compliance with the standard procedures. All the crew members passed medical check at the medical office of Aeroflot – Russian Airlines on September 13, 2008 at 1948 hrs and got permissions to fly. On the basis of the dispatch information (aircraft condition, aeronautical information, weather information, aircraft load data and operational flight plan) the PIC at 1955 hrs made a decision to fly. The takeoff was performed at 2113 without delay. The climb and level flight at FL290, 9,100 metres were conducted without any deviations. At 2245 hrs the crew started descent from the flight level to waypoint Mendeleyevo (940 MN). After passing over Mendeleyevo, in compliance with the Perm Approach Control instruction, the aircraft flew via the outer marker (705 PX) of Runway 21 which is the initial approach fix (IAF) for Runway 21 (heading 212° magnetic). After passing over the RWY with heading 110° M, the crew, following the Controller’s instruction, turned right for back course and started maneuvering for ILS approach to Runway 21. After the base turn, approaching the landing course at 600 m with both autopilot and autothrottle disengaged, the aircraft started climbing up to 1300 m, rolled 360° over the left wing and collided with the ground. The aircraft was totally destroyed and partly burnt in the ground fire. All passengers and crew members on board died due to the ground impact. The accident occurred at 2310 hrs 12.4 km from aerodrome reference point (ARP) of Perm Airport, azimuth 60° M. Accident site elevation is 153 m.", "probable_cause": "The immediate cause of the accident was spatial disorientation of the crew, especially the Captain who was the pilot flying at the final stage of the flight, which led to the left flip-over, a steep descent and the crash of the aircraft. The spatial disorientation was experienced during the night time operation in clouds, with both autopilot and autothrottle disengaged. Contributing to the development of the spatial disorientation and failure to recover from it was a lack of proficiency in aircraft handling, crew resource management and of skills associated with upset recovery using \"western\"-type attitude indications that are found on foreign and modern Russian made aircraft. This type of indication differs from the one used on aircraft types previously flown by the crew (Tupolev 134, Antonov 2). The cause above was determined on the basis of flight recorders and ATC recorder data analysis, examination of the airframe and engine wreckage, results of the accident flight simulation, findings of the independent expertise conducted by test pilots from State Research Institute of Civil Aviation and Gromov Flight Research Institute as well as line pilots, and also on the basis of all the works conducted with participation of experts from Bermuda, France, Russia, UK and USA in the course of the investigation. The systemic cause of the accident was insufficient management by the airline of flight and maintenance operations of the Boeing 737 type of aircraft. These deficiencies in the aircraft maintenance also revealed through safety inspections conducted by the Russian Transport Oversight Authority and the Russian CAA after the accident. Deficiencies in the aircraft maintenance led to a situation when flights were performed for a long time with a throttle stagger that exceeded the limitations in the AMM and when the maintenance staff did not follow the AMM recommended troubleshooting procedures. The need to manage the throttle stagger during the approach increased crew workload. The forensic medical examination performed in the State Healthcare Center of Special Status “Perm Regional Forensic Expertise Bureau” confirmed the presence of ethyl alcohol in the Captain’s body before his death. The captain’s recent work schedule during the time period before the accident was conducive to fatigue and did not comply with national regulations."}