{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3c-charlotte-amalie", "date": "Jul 19, 2006 at 0720 LT", "type": "Douglas DC-3", "operator": "TolAir", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Charlotte Amalie - San Juan", "msn": "4382", "yom": 1942, "flight_number": null, "city": "Charlotte Amalie-Cyril E. King (ex Harry S. Truman)", "zone": "All US Virgin Islands", "country": "US Virgin Islands", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15750, "captain_hours_type": null, "copilot_hours": 305, "copilot_hours_type": null, "aircraft_hours": 32278, "circumstances": "The captain stated that the accident flight was a return flight to San Juan, Puerto Rico, after delivering U.S. Mail. The airplane was empty of cargo at the time of the accident. The first officer was flying the airplane. The takeoff roll and rotation at 84 knots was uneventful until about 100 feet above the ground when the gear was called out to be retracted. At that time, the left engine's rpm dropped from 2,700 to 1,000. He communicated to the first officer that he would be assuming control of the airplane. He then proceeded with verifying that the left engine had failed. Once confirmed, he proceeded with the failed engine check list and feathering the propeller. They advised air traffic control (ATC) of the situation and informed them that they were returning to land. The airplane would not maintain altitude and the  airspeed dropped to about 75 knots. The captain stated that he knew the airplane would not make it back to the airport. Instructions were given to the two passengers to don their life vests and prepared for a ditching. The captain elected to perform a controlled flight into the water. All onboard managed to exit the airplane through the cockpit overhead escape hatch onto the life raft as the airplane remained afloat. About ten minutes later the airplane sank nose first straight down. The airplane came to rest at the bottom of the ocean, in about 100 feet of water. The airplane was not recovered. Underwater photos provided by the operator showed the nose and cockpit area caved in, the left engine's propeller was in the feathered position, and the right engine's propeller was in a low pitch position. ", "probable_cause": "The airplane's inability to maintain altitude for undetermined reasons, following a loss of power from the left engine."}