{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46f-1-cu-commando-louisville-25-killed", "date": "Sep 28, 1953 at 1618 LT", "type": "Curtiss C-46 Commando", "operator": "Resort-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Philadelphia – Louisville", "msn": "22384", "yom": 1945, "flight_number": "RST1081", "city": "Louisville", "zone": "Kentucky", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 38, "pax_fatalities": 22, "other_fatalities": 0, "total_fatalities": 25, "captain_hours": 10565, "captain_hours_type": 899, "copilot_hours": 3728, "copilot_hours_type": 2018, "aircraft_hours": 12145, "circumstances": "The flight was operating between North Philadelphia, Pennsylvania, and Louisville. It departed North Philadelphia Airport at 1303 on a Visual Flight Rules flight plan. The crew consisted of Captain W. E. Moller, First Officer J. D. Pickel, and Stewardess D. J. Bush. At departure the gross weight of the aircraft was 44,940 pounds (allowable 45,300 pounds), with 775 gallons of fuel aboard. Distribution of the load was within prescribed center of gravity limitations. The trip between North Philadelphia and Louisville was normal and in good weather. In the vicinity of Standiford Airport, the pilot requested landing instructions and was cleared for landing on Runway 24 by the tower. The clearance was acknowledged by the pilot. One of the three controllers on duty observed that the approach appeared normal until the flare-out when the aircraft \"ballooned\" slightly, power was applied, and about 500 feet farther on entered a steep climb. The aircraft then yawed to the left and climbed with a steadily increasing angle of attack. At this point he noticed that a portion of the left elevator was hanging down and immediately advised the aircraft but received no acknowledgement of his warning. The aircraft continued in a steep climbing left turn until it reached an altitude of about 300 feet, stalled, fell off to the left, and struck the ground on the nose and left wing. The fuselage burst open upon impact. A number of the occupants were thrown free and emergency equipment immediately took survivors to nearby hospitals. Due to the severity of impact and the extent of damage, there was no organized evacuation by the occupants. Sixteen passengers were injured while 25 others occupants, among them all three crew members, were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was structural failure of the left elevator in flight, causing loss of control. This structural failure was brought about by the left outboard hinge bolt backing out of the assembly. The underlying cause was improper maintenance which resulted in the installation of hinge bolts and bearings not meeting specifications, and inadequate inspection which failed to detect this condition. The following findings were reported:\r\n- The flight between North Philadelphia and Standiford Airport, Louisville, was routine and in good weather,\r\n- The aircraft crashed on Standiford Airport when the left elevator failed at No. 2 hinge station,\r\n- The No. 1 hinge bolt worked free from the hinge fitting and thus resulted in the outboard third of the elevator being unsupported,\r\n- The four hinge bolts in the left elevator were a non approved type for this installation, as were three of the four interposer ball bearings; the bolts and bearings in the right elevator were approved types,\r\n- Major maintenance on Resort Airlines' aircraft was performed under contract by Slick Airways,\r\n- The left and right elevators were removed by Slick Airways' personnel during a No. 3 inspection of N 66534 at San Antonio, July 8-11, 1953,\r\n- Excessive wear and other deficiencies ware not noted in any inspection by Slick Airways, Airline Services, or the carrier's personnel curing the period between the No. 3 inspection and the day of the accident."}