{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-14m-near-ust-barguzin-48-killed", "date": "Jun 14, 1981 at 1622 LT", "type": "Ilyushin II-14", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Severomuysk – Nizhneangarsk - Ulan-Ude", "msn": "1470 011 41", "yom": 1957, "flight_number": "SU498", "city": "Ust-Barguzin", "zone": "Republic of Buryatia", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 44, "pax_fatalities": 44, "other_fatalities": 0, "total_fatalities": 48, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16185, "circumstances": "The airplane departed Severomuysk Airport at 1441LT on a schedule service to Ulan-Ude with an intermediate stop in Nizhneangarsk, carrying 44 passengers and a crew of four. Bound to the west, while cruising to an altitude of 3,600 meters, the crew was informed about poor weather conditions at destination. As the Nizhneangarsk Airport was closed to traffic, the crew was instructed to divert to Ust-Barguzin Airport located on the east shore of Lake Baykal, in the Svyatoi Nos peninsula. While descending to Ust-Barguzin Airport at an altitude of 1,300 meters, the airplane struck the slope of a mountain and crashed 30 km northwest of Ust-Barguzin. The airplane was destroyed upon impact and all 48 occupants were killed. ", "probable_cause": "It was determined that the crew failed to follow the prescribed procedures and initiated the descent prematurely under VFR mode in IMC conditions. Due to unfavorable wind component (200° at 25 km/h iso 250° at 50 km/h as initially forecasted), the airplane was not on the calculated route and ATC was unaware of the exact position of the airplane due to lack of contact from the crew and due to discrepancies in the radiogoniometer settings. This situation resulted in a controlled flight into terrain. "}