{"url": "https://www.baaa-acro.com/crash/crash-lockheed-18-56-23-lodestar-londonderry-2-killed", "date": "Dec 29, 1955 at 1240 LT", "type": "Lockheed 18 LodeStar", "operator": "Gulf-Oil-Corp", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Tulsa – Pittsburgh", "msn": "2387", "yom": 1943, "flight_number": null, "city": "Londonderry", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 9000, "captain_hours_type": null, "copilot_hours": 983, "copilot_hours_type": null, "aircraft_hours": 4372, "circumstances": "Pilot Gordon Whewell Silva and Copilot-Flight Mechanic Lloyd Littleton Cotton, on December 28, prepared N 33366 (hereinafter referred to as N 366) for a nonstop flight from Tulsa, Oklahoma, to Pittsburgh, Pennsylvania. After a study of the weather data Pilot Silva filed an IFR (Instrument Flight Rules) flight plan which called for a proposed departure at 0800 c. s. t. for Pittsburgh via Victor Airways 14, 72, and 12, with an estimated elapsed time of tour hours. It also showed fuel for 6:15 hours, an en route altitude of 9,000 feet, destination Pittsburgh, and alternate Wheeling, West Virginia. The flight departed Tulsa at 1810 c. s. t. and routine position reports were made until over Dayton, Ohio, at 1200. Starting with the Dayton position report in which the first mention of icing conditions was made, all of the entries in CAA station logs recording communications with N 366 are transcribed as follows: \"N366 over Dayton 1200E 9,000 feet estimate over Columbus 1218E Adamsville (will make next report from Adamsville.) Request lower altitude light to moderate rime icing.\" This message was delivered at 1203 to the Indianapolis center who replied, \"ATC advises unable approve lower altitude.\" This reply was delivered to N 366 at 1204. At 1221 CAA Columbus recorded the following from N 366, \"Over Columbus 1220, 9,000 m. s. l. estimate over Adamsville 33 HLG (will make next report via Wheeling). Destination Pittsburgh requesting 5,000 feet m. s. l.\" At 1224 the following was transmitted to N 366 by Columbus, \"ATC unable to approve 5,000 feet m. s. l. or 7,000 feet m. s. l.\" At 1227 Columbus received from N 366, \"Rime ice request lower altitude an soon as possible.\" And at 1234 N 366 advised Columbus, \"Over Adamsville 1233 9,000 feet m. s. l. Adena 47.\" The pilot was questioned about the Adena estimate and changed it to \"Wheeling\" (as next reporting point). Also in this communication he reported, \"Difficulty maintaining altitude and airspeed request lower altitude.\" At 1237 Columbus CAA transmitted, \"Clearance to descend and maintain 8,000 m. s. l.\" and the pilot replied, \"Leaving 9,000 m. s. l. at 1237E\". All further attempts to communicate with N 366 were unsuccessful. At approximately 1240 witnesses observed the aircraft below the overcast; it was on a westerly heading and was descending although it appeared to be in a normal attitude. Several components were seen to separate from the aircraft before it struck the ground. Both occupants were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the accumulation of enough ice to result in loss of control and the subsequent shedding of vertical surfaces from the tail group of the aircraft. The following findings were reported:\r\n- Pilot Silva was familiar with the forecasts of ice over the route involved, at altitudes of 10,000 feet and above, and he knew the limitations of the deicing equipment on his aircraft,\r\n- The flight encountered icing conditions at cruising altitude of 9,000 feet,\r\n- Traffic prevented ARTC from assigning a lower altitude when so requested several times by Pilot Silva,\r\n- After Pilot Silva reported difficulty in maintaining airspeed and altitude, ARTC assigned the 8,000-foot level and the pilot reported leaving 9,000 feet at 1237,\r\n- At low altitude the aircraft lost much of the vertical surface in its tail group and struck the ground at a steep angle,\r\n- No emergency was declared."}