{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-near-canning-dam-2-killed", "date": "Feb 27, 1986 at 0807 LT", "type": "Rockwell Shrike Commander 500", "operator": "Safcol", "flight_phase": "Flight", "flight_type": "Test", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Jandakot - Jandakot", "msn": "500-3263", "yom": 1976, "flight_number": null, "city": "Canning Dam", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight was planned to check the onboard survey equipment. After departing Jandakot the aircraft operated to the south of the airfield for about 80 minutes before the pilot advised that he would be extending his operation to the east over the Darling Ranges. The aircraft was then sighted, by several witnesses, over the foothills heading in an easterly direction. These witnesses reported that the engines were not operating normally. A short time later, the aircraft was observed to pass over the dam wall at an altitude of about 25 feet and head down a valley in a northerly direction before disappearing from sight. An inspection of the wreckage indicated that the aircraft had collided with two 30 metre high trees, in a nose high attitude at a low forward airspeed, before falling to the ground below the trees. At impact neither engine was delivering power. The fuel system, which was found to be relatively intact, contained only nine litres of fuel.", "probable_cause": " It was determined that the engines failed due to fuel starvation following the exhaustion of the useable fuel onboard the aircraft. The pilot was then faced with attempting a landing in unsuitable\r\nterrain. Evidence indicates that the aircraft departed Jandakot with both the fuel quantity indicating systems unserviceable. Although the maintenance documentation for the aircraft did not indicate that these systems were unserviceable, it is believed that the pilot was aware of the maintenance state of the aircraft before departure. "}