{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-500-phenom-100-houston", "date": "Nov 21, 2014 at 1010 LT", "type": "Embraer EMB-500 Phenom 100", "operator": "JetSuite", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Houston - Houston", "msn": "500-00140", "yom": 2010, "flight_number": "RSP526", "city": "Houston-Sugar Land", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6311, "captain_hours_type": 410, "copilot_hours": 4232, "copilot_hours_type": 814, "aircraft_hours": 3854, "circumstances": "The pilots of the very light jet were conducting a positioning flight in instrument meteorological conditions. The flight was cleared by air traffic control for the instrument landing system (ILS) approach; upon being cleared for landing, the tower controller reported to the crew that there was no standing water on the runway. Review of the airplane's flight data recorder (FDR) data revealed that the airplane reached 50 ft above touchdown zone elevation (TDZE) at an indicated airspeed of 118 knots (KIAS). The airplane crossed the runway displaced threshold about 112 KIAS, and it touched down on the runway at 104 KIAS with about a 7-knot tailwind. FDR data revealed that, about 1.6 seconds after touchdown of the main landing gear, the nose landing gear touched down and the pilot's brake pedal input increased, with intermediate oscillations, over a period of 7.5 seconds before reaching full pedal deflection. During this time, the airplane achieved its maximum wheel braking friction coefficient and deceleration. The cockpit voice recorder recorded both pilots express concern the that the airplane was not slowing. About 4 seconds after the airplane reached maximum deceleration, the pilot applied the emergency parking brake (EPB). Upon application of the EPB, the wheel speed dropped to zero and the airplane began to skid, which resulted in reverted-rubber hydroplaning, further decreasing the airplane's stopping performance. The airplane continued past the end of the runway, crossed a service road, and came to rest in a drainage ditch. Postaccident examination of the brake system and data downloaded from the brake control unit indicated that it functioned as commanded during the landing. The airplane was not equipped with thrust reversers or spoilers to aid in deceleration. The operator's standard operating procedures required pilots to conduct a go-around if the airspeed at 50 ft above TDZE exceeded 111 kts. Further, the landing distances published in the airplane flight manual (AFM) are based on the airplane slowing to its reference speed (Vref) of 101 KIAS at 50 ft over the runway threshold. The airplane's speed at that time exceeded Vref, which resulted in an increased runway distance required to stop; however, landing distance calculations performed in accordance with the AFM showed that the airplane should still have been able to stop on the available runway. An airplane performance study also showed that the airplane had adequate distance available on which to stop had the pilot continued to apply maximum braking rather than engage the EPB. The application of the EPB resulted in skidding, which increased the stopping distance. Although the runway was not contaminated with standing water at the time of the accident, the performance study revealed that the maximum wheel braking friction coefficient was significantly less than the values derived from the unfactored wet runway landing distances published in the AFM, and was more consistent with the AFM-provided landing distances for runways contaminated with standing water. Federal Aviation Administration Safety Alert for Operators (SAFO) 15009 warns operators that, \"the advisory data for wet runway landings may not provide a safe stopping margin under all conditions\" and advised them to assume \"a braking action of medium or fair when computing time-of-arrival landing performance or [increase] the factor applied to the wet runway time-of-arrival landing performance data.\" It is likely that, based on the landing data in the AFM, the crew expected a faster rate of deceleration upon application of maximum braking; when that rate of deceleration was not achieved, the pilot chose to engage the EPB, which only further degraded the airplane's braking performance.", "probable_cause": "The pilot's engagement of the emergency parking brake during the landing roll, which decreased the airplane's braking performance and prevented it from stopping on the available runway. Contributing to the pilot's decision to engage the emergency parking brake was the expectation of a faster rate of deceleration and considerably shorter wet runway landing distance provided by the airplane flight manual than that experienced by the crew upon touchdown and an actual wet runway friction level lower than the assumed runway fiction level used in the calculation of the stopping distances published in the airplane flight manual."}