{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-120-brasilia-detroit-29-killed", "date": "Jan 9, 1997 at 1554 LT", "type": "Embraer EMB-120 Brasília", "operator": "Comair%20Delta%20Connection", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Cincinnati - Detroit", "msn": "120-257", "yom": 1991, "flight_number": "OH3272", "city": "Monroe", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 26, "pax_fatalities": 26, "other_fatalities": 0, "total_fatalities": 29, "captain_hours": 5329, "captain_hours_type": 2302, "copilot_hours": 2582, "copilot_hours_type": 1494, "aircraft_hours": 12752, "circumstances": "The flight was being vectored for the approach to runway 3R at Detroit Metropolitan Wayne County Airport (DTW) when the aircraft descended and impacted the ground. The aircraft struck the ground in a steep nose-down attitude in a level field in a rural area about 19 nm southwest of DTW. The flight carried 26 passengers and 3 crew members. There were no survivors and the airplane was destroyed by impact forces and a post crash fire. Instrument meteorological conditions prevailed at the time of the accident. The investigation revealed that it was likely that the airplane gradually accumulated a thin, rough glaze/mixed ice coverage on the leading edge deicing boot surfaces, possibly with ice ridge formation on the leading edge upper surface, as the airplane descended from 7,000 feet mean sea level (msl) to 4,000 feet msl in icing conditions, which may have been imperceptible to the pilots. The pilots had been instructed by air traffic control to slow to 150 knots and according to flight data recorder information, the airplane began to show signs of departure from controlled flight as it decelerated from 155 to 156 knots while in a flaps-up configuration. The investigation disclosed that the FAA failed to adopt a systematic and proactive approach to the certification, and operational issues of turbopropeller-driven transport airplane icing. The icing certification process has been inadequate because it has not required manufacturers to demonstrate the airplane's flight handling and stall characteristics under a sufficiently realistic range of adverse ice accretion/flight handling conditions. The aircraft manufacturer had issued a revision in April, 1996 to the approved flight manual which included activation of the leading edge deicing boots at the first sign of ice formation. The airplane operator did not incorporate the procedure, because it was contrary to the company's trained procedures and practices and of the belief that enacting the changes would result in potentially unsafe operation. Investigators' discussion with management personnel at each of the seven U.S.-based operators of the aircraft indicated that at the time of the accident only two of these operators had changed their procedures to reflect the information in the revision. The FAA, at the time of the accident, did not require manufacturers of all turbine-engine driven airplanes to publish minimum airspeed information for various flap configurations and phases and conditions of flight. During Safety Board investigators postaccident interviews with company pilots, there were inconsistent answers on the complex and varied minimum airspeed requirements established by the company for both icing and nonicing conditions. It was also noted that the pilots uncertainty of the appropriate airspeeds might have been associated with the language used, the different airspeeds and criteria contained in the guidance, the company's methods of distribution, and the company's failure t o incorporate the guidance as a formal, permanent revision to the flight standards manual.", "probable_cause": "The Federal Aviation Administration's (FAA) failure to establish adequate aircraft certification standards for flight in icing conditions, the FAA's failure to ensure that at Centro Tecnico Aeroespacial/FAA-approved procedure for the accident airplane's deice system operation was implemented by U.S.-based air carriers, and the FAA's failure to require the establishment of\r\nadequate minimum airspeeds for icing conditions, which led to the loss of control when the airplane accumulated a thin, rough, accretion of ice on its lifting surfaces. Contributing to the \r\naccident were the flightcrew's decision to operate in icing conditions near the lower margin of the operating airspeed envelope (with flaps retracted) and Comair's failure to establish and adequately disseminate unambiguous minimum airspeed values for flap configurations and for flight in icing conditions. "}