{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154b-1-omsk-178-killed", "date": "Oct 11, 1984 at 0539 LT", "type": "Tupolev TU-154", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Krasnodar – Omsk – Novosibirsk", "msn": "77A243", "yom": 1977, "flight_number": "SU3352", "city": "Omsk-Intl", "zone": "Omsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 5, "pax_on_board": 170, "pax_fatalities": 169, "other_fatalities": 4, "total_fatalities": 178, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Krasnodar, the crew started the approach to Omsk Airport in a reduced visibility due to the night and rain falls. The aircraft landed at a speed of 270 km/h and about one second later, the captain noticed the presence of vehicles on the runway. He initiated a turn to the right when the left wing struck the vehicles. Upon impact, all three vehicles were destroyed and the four people on board were killed instantly. Out of control, the airplane turned to the left, veered off runway and came to rest upside down, broken in two, bursting into flames. Four crew members and one passenger survived while all 174 other occupants were killed. ", "probable_cause": "It was determined that the person in charge of the runway maintenance allowed a team of three vehicles to enter the runway for maintenance and then fell asleep. Thus, he failed to inform ATC about the presence of ground vehicles on the runway and the Air Traffic Controller based in the Airport Tower was unable to see the vehicles due to poor visibility caused by night and rain falls. As ATC was not aware of the presence of ground vehicles, he was unable to inform the crew prior to landing. Also, it was reported that the vehicles dispatched on the runway were not equipped with rotating flashing beacons and radios that would allow their personnel to listen the tower frequency. "}