{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-8-100-near-madang-28-killed", "date": "Oct 13, 2011 at 1717 LT", "type": "De Havilland DHC-8-100 (Dash-8)", "operator": "Airlines%20PNG", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Port Moresby - Lae - Madang", "msn": "125", "yom": 1988, "flight_number": "CG1600", "city": "Madang", "zone": "Madang", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 1, "pax_on_board": 28, "pax_fatalities": 27, "other_fatalities": 0, "total_fatalities": 28, "captain_hours": 18200, "captain_hours_type": 500, "copilot_hours": 2725, "copilot_hours_type": 391, "aircraft_hours": 38421, "circumstances": "On the afternoon of 13 October 2011, an Airlines PNG Bombardier DHC-8-103, registered P2-MCJ (MCJ), was conducting a regular public transport flight from Nadzab, Morobe Province, to Madang, Madang Province under the Instrument Flight Rules (IFR). On board the aircraft were two flight crew, a flight attendant, and 29 passengers. Earlier in the afternoon, the same crew had flown MCJ from Port Moresby to Nadzab. The autopilot could not be used because the yaw damper was unserviceable so the aircraft had to be hand-flown by the pilots. At Nadzab, the aircraft was refuelled with sufficient fuel for the flight to Madang and a planned subsequent flight from Madang to Port Moresby. MCJ departed Nadzab at 1647 LMT with the Pilot-in-Command as the handling pilot. The aircraft climbed to 16,000 ft with an estimated arrival time at Madang of 1717. Once in the cruise, the flight crew diverted right of the flight planned track to avoid thunderstorms and cloud. The Pilot-in-Command reported that communications between Madang Tower and an aircraft in the vicinity of Madang indicated a storm was approaching the aerodrome. He recalled that he had intended to descend below the cloud in order to be able to see across the sea to Madang and had been concentrating on manoeuvring the aircraft to remain clear of thunderstorms and cloud, so he had been looking mainly outside the cockpit. Because of the storm in the vicinity of the airport, he said there had been „some urgency‟ to descend beneath the cloud base to position for a right base for runway 07 at Madang, the anticipated approach. On this route, the descent to Madang was steep (because of the need to remain above the Finisterre Ranges until close to Madang) and, although the aircraft was descending steeply, the propellers were at their cruise setting of 900 revolutions per minute (RPM). Neither pilot noticed the airspeed increasing towards the maximum operating speed (VMO); the Pilot-in-Command reported afterwards that he had been „distracted‟ by the weather. When the aircraft reached VMO as it passed through 10,500 ft, with a rate of descent between 3,500 and 4,200 ft per minute, and the propellers set at 900 RPM, the VMO overspeed warning sounded. The Pilot-in-command reported that he had been about to ask the First Officer to increase the propeller speed to 1,050 RPM to slow the aircraft when this occurred. He raised the nose of the aircraft in response to the warning and this reduced the rate of descent to about 2,000 ft per minute, however, the VMO overspeed warning continued. The First Officer recalled the Pilot-in-Command moved the power levers back „quite quickly‟. Shortly after the power levers had been moved back, both propellers oversped simultaneously, exceeding their maximum permitted speed of 1,200 RPM by over 60 % and seriously damaging the left hand engine and rendering both engines unusable. Villagers on the ground reported hearing a loud „bang‟ as the aircraft passed overhead. The noise in the cockpit was deafening, rendering communication between the pilots extremely difficult, and internal damage to the engines caused smoke to enter the cockpit and cabin through the bleed air and air conditioning systems. The emergency caught both pilots by surprise. There was confusion and shock on the flight deck, a situation compounded by the extremely loud noise from the overspeeding propellers. About four seconds after the double propeller overspeed began, the beta warning horn started to sound intermittently, although the pilots stated afterwards they did not hear it. The left propeller RPM reduced to 900 RPM (in the governing range) after about 10 seconds. It remained in the governing range for about 5 seconds before overspeeding again for about 15 seconds, then returned to the governing range. During this second overspeed of the left propeller, the left engine high speed compressor increased above 110 % NH, becoming severely damaged in the process. About 3 seconds after the left propeller began overspeeding for the second time, the right propeller went into uncommanded feather due to a propeller control unit (PCU) beta switch malfunction, while the right engine was still running at flight idle (75% NH). Nine seconds after the double propeller overspeed event began, the Pilot-in-command shouted to the First Officer „what have we done?‟ The First Officer replied there had been a double propeller overspeed. The Pilot-in-command then shouted a second and third time „what have we done?‟. The First Officer repeated that there was a double propeller overspeed and said that the right engine had shut down. The Pilot-in-Command shouted that he could not hear the First Officer, who – just as the left propeller began governing again and the overspeed noise subsided – repeated that the right engine had shut down and asked if the left engine was still working. The Pilot-in-command replied that it was not working. Both pilots then agreed that they had „nothing‟. At this point, about 40 seconds after the propeller overspeed event began, the left propeller was windmilling and the left engine was no longer producing any power because of the damage caused to it by the overspeed. The right engine was operating at flight idle, although the propeller could not be unfeathered and therefore could not produce any thrust. On the order of the Pilot-in-Command, the First Officer made a mayday call to Madang Tower and gave the aircraft's GPS position; he remained in a radio exchange with Madang Tower for 63 seconds. The flight crew did not conduct emergency checklists and procedures. Instead, their attention turned to where they were going to make a forced landing. The aircraft descended at a high rate of descent, with the windmilling left propeller creating extra drag. The asymmetry between the windmilling left propeller and the feathered right propeller made the aircraft difficult to control. The average rate of descent between the onset of the emergency and arrival at the crash site was 2,500 ft per minute and at one point exceeded 6,000 ft per minute, and the VMO overspeed warning sounded again. During his long radio exchange with Madang Tower, the First Officer had said that they would ditch the aircraft, although, after a brief discussion, the Pilot-in-command subsequently decided to make a forced landing in the mouth of the Guabe River. The First Officer asked the Pilot-in-command if he should shut both engines down and the Pilot-in-command replied that he should shut „everything‟ down. Approximately 800 feet above ground level and 72 seconds before impact, the left propeller was feathered and both engines were shut down. The Pilot-in-Command reported afterwards that he ultimately decided to land beside the river instead of in the river bed because the river bed contained large boulders. The area chosen beside the river bed also contained boulders beneath the vegetation, but they were not readily visible from the air. He recalled afterwards that he overshot the area he had originally been aiming for. The aircraft impacted terrain at 114 knots with the flaps and the landing gear retracted. The Flight Attendant, who was facing the rear of the aircraft, reported that the tail impacted first. During the impact sequence, the left wing and tail became detached. The wreckage came to rest 300 metres from the initial impact point and was consumed by a fuel-fed fire. The front of the aircraft fractured behind the cockpit and rotated through 180 degrees, so that it was inverted when it came to rest. Of the 32 occupants of the aircraft only the two pilots, the flight attendant, and one passenger survived by escaping from the wreckage before it was destroyed by fire.", "probable_cause": "From the evidence available, the following findings are made with respect to the double propeller overspeed 35 km south south east of Madang on 13 October 2011 involving a Bombardier Inc. DHC-8-103 aircraft, registered P2-MCJ. They should not be read as apportioning blame or liability to any organisation or individual. \r\nContributing safety factors:\r\n- The Pilot-in-Command moved the power levers rearwards below the flight idle gate shortly after the VMO overspeed warning sounded. This means that the release triggers were lifted during the throttle movement. \r\n- The power levers were moved further behind the flight idle gate leading to ground beta operation in flight, loss of propeller speed control, double propeller overspeed, and loss of usable forward thrust, necessitating an off-field landing. \r\n- A significant number of DHC-8-100, -200, and -300 series aircraft worldwide did not have a means of preventing movement of the power levers below the flight idle gate in flight, or a means to prevent such movement resulting in a loss of propeller speed control. \r\nOther safety factors:\r\n- Prior to the VMO overspeed warning, the Pilot-in-Command allowed the rate of descent to increase to 4,200 ft per minute and the airspeed to increase to VMO. \r\n- The beta warning horn malfunctioned and did not sound immediately when one or both of the flight idle gate release triggers were lifted. When the beta warning horn did sound, it did so intermittently and only after the double propeller overspeed had commenced. The sound of the beta warning horn was masked by the noise of the propeller overspeeds. \r\n- There was an uncommanded feathering of the right propeller after the overspeed commenced due to a malfunction within the propeller control beta backup system during the initial stages of the propeller overspeed. \r\n- The right propeller control unit (PCU) fitted to MCJ was last overhauled at an approved overhaul facility which had a quality escape issue involving incorrect application of beta switch reassembly procedures, after a service bulletin modification. The quality escape led to an uncommanded feather incident in an aircraft in the United States due to a beta switch which stuck closed. \r\n- Due to the quality escape, numerous PCU‟s were recalled by the overhaul facility for rectification. The right PCU fitted to MCJ was identified as one of the units that may have been affected by the quality escape and would have been subject to recall had it still been in service.\r\nThe FDR data indicated that the right PCU fitted to MCJ had an uncommanded feather, most likely due to a beta switch stuck in the closed position, induced by the propeller overspeed. It was not possible to confirm if the overhaul facility quality escape issue contributed to the beta switch sticking closed, because the PCU was destroyed by the post-impact fire. \r\n- The landing gear and flaps remained retracted during the off-field landing. This led to a higher landing speed than could have been achieved if the gear and flaps had been extended, and increased the impact forces on the airframe and its occupants. \r\n- No DHC-8 emergency procedures or checklists were used by the flight crew after the emergency began. \r\n- The left propeller was not feathered by the flight crew after the engine failed. \r\n- The investigation identified several occurrences where a DHC-8 pilot inadvertently moved one or both power levers behind the flight idle gate in flight, leading to a loss of propeller speed control. Collectively, those events indicated a systemic design issue with the integration of the propeller control system and the aircraft. \r\nOther key findings:\r\n- The flaps and landing gear were available for use after the propeller overspeeds and the engine damage had occurred. \r\n- There was no regulatory requirement to fit the beta lockout system to any DHC-8 aircraft outside the USA at the time of the accident. \r\n- The autopilot could not be used during the accident flight. \r\n- The operator's checking and training system did not require the flight crew to have demonstrated the propeller overspeed emergency procedure in the simulator. \r\n- After the accident, the aircraft manufacturer identified a problem in the beta warning horn system that may have led to failures not being identified during regular and periodic tests of the system. "}