{"url": "https://www.baaa-acro.com/crash/crash-cessna-208-caravan-i-lake-teslin-2-killed", "date": "Aug 14, 2000 at 2357 LT", "type": "Cessna 208A Caravan", "operator": "RCMP-GRC%20Air%20Services", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Prince Rupert – Teslin Lake – Dease Lake", "msn": "208-0082", "yom": 1986, "flight_number": null, "city": "Teslin Lake", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3768, "captain_hours_type": 282, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A Cessna 208 Caravan I on amphibious floats, C-GMPB, serial number 20800082, was ferrying members of the Royal Canadian Mounted Police (RCMP) Emergency Response Team from Teslin, Yukon, to a site on the south end of Teslin Lake, British Columbia. At about 1645 Pacific daylight time, three team members, two dogs, and gear were unloaded on a gravel bar across from the mouth of the Jennings River. The aircraft departed for the Teslin airport at about 2355 with the pilot and one RCMP engineer on board. Shortly after take-off, the aircraft was seen to pitch up into a steep climb, stall, then descend at a steep angle into the water. The aircraft was destroyed, and the pilot and the passenger were fatally injured.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The pilot's decision to depart from the unlit location was likely the result of the many psychological and physiological stressors encountered during the day.\r\n2. The pilot most likely experienced spatial disorientation-precipitated by local geographic and environmental conditions-and lost control of the aircraft.\r\nFindings as to Risk:\r\n1. Without a safety management program that routinely disseminates safety information, RCMP pilots may be inadequately sensitized to the limitations of decision making and judgement.\r\n2. The RCMP had no current, concise standard operating procedures (SOPs) for its non-604 operations. Without useable SOPs, the pilots in some instances operate without clearly established limits and outside of acceptable tolerances."}