{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-northrepps", "date": "Sep 30, 2005 at 1817 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Golden Eagle Haulage Inc. Trustee", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "421C-0153", "yom": 1976, "flight_number": null, "city": "Northrepps", "zone": "Norfolk", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2475, "captain_hours_type": 255, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Northrepps Airfield has a single grass runway, orientated 18/36, and 1617 ft (493 m) long, with a down slope of 1.8% on Runway 18. On the day of the accident, the short grass was wet and an aftercast indicated that the wind at Northrepps was from approximately 210º at 10 to 13 kt. The pilot first flew an approach to Runway 18 and touched down close to the threshold; he subsequently reported that, looking at the slope of the runway ahead of him, he decided to go around and re‑position for a landing on Runway 36, to take advantage of the up-slope on that runway. The pilot stated that, during the approach to Runway 18, he had assessed that the braking effect of the wind would be insignificant in comparison to the braking effect that would be afforded by the uphill slope when landing on Runway 36. The pilot recalled seeing a “shortened” and “non‑standard” windsock mounted on a caravan adjacent to the Runway 18 threshold, but he did not believe that it could be relied upon for an accurate wind strength determination. He did not recall having seen the airfield’s other, larger, windsock. The approach for a short field landing on Runway 36 was normal and the pilot closed the throttles just before the threshold. The aircraft touched down close to the threshold, and the pilot immediately retracted the flaps. The pilot reported that he had lost two thirds of his touchdown speed by about the mid-point of the runway, and that the braking was within his expectations. He subsequently stated that he “seemed to get to a point… when I realised that I was effectively getting no braking at all from the wheels and the uphill slope had petered away”; he then experienced a sensation which he described as being similar to aquaplaning, with all braking authority seemingly lost. The aircraft continued along the runway, crossed the grassed overshoot area, ran over an earth bank beyond the end of the runway and came to rest on a public road just north of this bank. The pilot shut the aircraft down and all three occupants vacated the aircraft without difficulty.", "probable_cause": "Prior to the flight, the pilot did not use the aircraft flight manual to calculate his landing performance. Given the wind and the surface conditions at Northrepps at the  time of the intended operation, performance calculations showed that a landing could only be made safely if both the precise landing parameters and adequate braking were achieved. There was no evidence regarding the point of touchdown or the associated speed; it is therefore not possible to say with any certainty whether the failure to stop was the result of an imperfectly executed landing or the lack of braking effect on the short, wet grass."}