{"url": "https://www.baaa-acro.com/crash/crash-canadair-regionaljet-crj-100se-moscow", "date": "Feb 13, 2007 at 1637 LT", "type": "Canadair RegionalJet CRJ-100", "operator": "FortAero", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Berlin", "msn": "7099", "yom": 1996, "flight_number": null, "city": "Moscow-Vnukovo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9100, "captain_hours_type": null, "copilot_hours": 2679, "copilot_hours_type": 68, "aircraft_hours": 3814, "circumstances": "The crew was completing a positioning flight from Moscow to Berlin for maintenance purposes. After the crew was cleared to start up the engines, the aircraft was towed to the deicing pad where the crew requested a two-step deicing procedure. The deicing was completed at 1618LT and the crew was cleared for takeoff at 1636LT. After a course of 1,500 metres on runway 06 in snow falls, the pilot-in-command started the rotation when the aircraft rolled left and right. The right wing struck the ground, the aircraft went out of control, got inverted and crashed in a snow covered area located 450 metres further and 35 metres to the right of the runway. All three crew members escaped with minor injuries while the aircraft was destroyed. At the time of the accident, weather conditions were as follow: wind from 130 at 10 knots, horizontal visibility 1,000 metres in snow falls, vertical visibility 300 feet, OAT -6° and dewpoint at -7°. ", "probable_cause": "Loss of control at liftoff due to a loss of lift caused by a stall consecutive to an excessive accumulation of ice/frost on the critical surfaces despite the aircraft had been deiced/anti-iced prior to takeoff. The following findings were identified:\r\n- The aircraft was deiced in a two-step procedure - deicing with Type I then anti-icing with Type IV. The treatment was completed at 1618LT, 19 minutes prior to the accident,\r\n- At the time of the accident, there were moderate to strong snow falls at the airport, \r\n- The crew did not receive the full meteorological bulletin prior to departure and failed to determine the correct holdover time, \r\n- Referring to the actual weather conditions, the crew failed to proceed with a second deicing/anti-icing procedure, \r\n- Lack of adequate check by crew members and/or the airline representatives regarding the quality of the anti-icing treatment,\r\n- The crew failed to comply with AFM relating to the actual weather conditions, \r\n- The takeoff was started at a speed that was 12 knots below the reference speed, increasing the stall condition with leading edges that were slightly contaminated with frost/ice. "}