{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-wichita-4-killed", "date": "Oct 30, 2014 at 0948 LT", "type": "Beechcraft 200 Super King Air", "operator": "Gilleland Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Wichita – Mena", "msn": "BB-1686", "yom": 1999, "flight_number": null, "city": "Wichita-Dwight D. Eisenhower (Mid-Continent)", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 3, "total_fatalities": 4, "captain_hours": 3139, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6314, "circumstances": "The airline transport pilot was departing for a repositioning flight. During the initial climb, the pilot declared an emergency and stated that the airplane \"lost the left engine.\" The airplane climbed to about 120 ft above ground level, and witnesses reported seeing it in a left turn with the landing gear extended. The airplane continued turning left and descended into a building on the airfield. A postimpact fired ensued and consumed a majority of the airplane. Postaccident examinations of the airplane, engines, and propellers did not reveal any anomalies that would have precluded normal operation. Neither propeller was feathered before impact. Both engines exhibited multiple internal damage signatures consistent with engine operation at impact. Engine performance calculations using the preimpact propeller blade angles (derived from witness marks on the preload plates) and sound spectrum analysis revealed that the left engine was likely producing low to moderate power and that the right engine was likely producing moderate to high power when the airplane struck the building. A sudden, uncommanded engine power loss without flameout can result from a fuel control unit failure or a loose compressor discharge pressure (P3) line; thermal damage prevented a full assessment of the fuel control units and P3 lines. Although the left engine was producing some power at the time of the accident, the investigation could not rule out the possibility that a sudden left engine power loss, consistent with the pilot's report, occurred. A sideslip thrust and rudder study determined that, during the last second of the flight, the airplane had a nose-left sideslip angle of 29°. It is likely that the pilot applied substantial left rudder input at the end of the flight. Because the airplane's rudder boost system was destroyed, the investigation could not determine if the system was on or working properly during the accident flight. Based on the available evidence, it is likely that the pilot failed to maintain lateral control of the airplane after he reported a problem with the left engine. The evidence also indicates that the pilot did not follow the emergency procedures for an engine failure during takeoff, which included retracting the landing gear and feathering the propeller. Although the pilot had a history of anxiety and depression, which he was treating with medication that he had not reported to the Federal Aviation Administration, analysis of the pilot's autopsy and medical records found no evidence suggesting that either his medical conditions or the drugs he was taking to treat them contributed to his inability to safely control the airplane in an emergency situation.", "probable_cause": "The pilot's failure to maintain lateral control of the airplane after a reduction in left engine power and his application of inappropriate rudder input. Contributing to the accident was the pilot's failure to follow the emergency procedures for an engine failure during takeoff. Also contributing to the accident was the left engine power reduction for reasons that could not be determined because a postaccident examination did not reveal any anomalies that would have precluded normal operation and thermal damage precluded a complete examination."}