{"url": "https://www.baaa-acro.com/crash/crash-avro-652-anson-i-snowdonia-mountains-5-killed", "date": "Nov 8, 1943 at 2030 LT", "type": "Avro 652 Anson", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Mountains", "schedule": "Halfpenny Green - Halfpenny Green", "msn": null, "yom": null, "flight_number": null, "city": "Bangor", "zone": "Gwynedd", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": " The aircraft and crew were stationed at RAF Halfpenny Green to the south west of Wolverhampton. During the evening of the 8th November 1943 to crew of five took off for a night navigation exercise. The route was to have covered ~320 miles passing over of close to the following points Base - Rhyl - Conwy - Douglas - Maughold Head - Chetton - Base. A short way into the flight the crew received a QDM from RAF Tilstock of 0500 with the location of the aircraft being assumed to be in the area of 4 miles NW of Shawbury roughly on course for Rhyl. It was next plotted by the Royal Observer Corps on a route that appeared to be a direct track from Wrexham to Conwy. A direct track from the Wrexham area to Conwy would not normally have taken an aircraft into Snowdonia, but on the night there was a 15 mph wind blowing from west north west which the Court of Inquiry remarked on as \"if correction for drift was not taken the aircraft would drift south of the second turning point\". At around 20:30 the ROC observed a fire near Carnedd Dafydd, shortly before this the aircraft while flying in a north westerly direction had impacted the upper slopes of Pen yr Ole Wen. The aircraft's engines had been torn off and rolled almost 1000 feet down the mountain and the fuel tanks had ruptured with their contents igniting. The fuselage was destroyed but was not burnt by the fire.\r\nCrew (3rd AFU):\r\nSgt Ernest Andrew Hoagg, pilot,\r\nSgt John Hedgley Lewis, navigator, \r\nSgt William Gavin, bomb aimer,\r\nSgt Leslie John Hill, wireless operator and air gunner, \r\nSgt Douglas John Roberts, wireless operator and air gunner.\r\nSource: http://www.peakdistrictaircrashes.co.uk/pages/wales/walesn9855.htm", "probable_cause": null}