{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-dease-lake-5-killed", "date": "Sep 27, 1986 at 1735 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Taku%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Atlin - Dease Lake", "msn": "724", "yom": 1954, "flight_number": "2653", "city": "Dease Lake", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot and five passengers boarded the float-equipped Beaver aircraft in Atlin, BC, and departed on a visual flight rules (VFR) flight to Dease Lake at 1618 Pacific daylight time (PDT). The flight arrived over Dease Lake at 1735 and proceeded northward over the lake's east shore. Approximately one and one-half miles from the south end of the lake, the aircraft turned to the south to descend for a landing in the middle of the lake. The aircraft was in a fairly steep constant descent when it struck the water. It then nosed over and came to rest with only the bottom of the fuselage visible. The fuselage floated for about 10 minutes, then sank in 120 feet of water. The landing area was approximately one mile from the south end of the lake. The pilot escaped with serious injuries. The five passengers did not exit the aircraft and drowned. ", "probable_cause": "The cause of the accident is that the pilot did not recognize the glassy-water conditions and did not use the glassy-water landing technique. The following findings were reported:\r\n- Glassy-water conditions prevailed at the time of the landing. \r\n- The aircraft struck the water at a high rate of descent, in a nose-down attitude. \r\n- The passenger pre-flight briefing/card did not adequately prepare passengers to deal with emergency water evacuation. \r\n- The pilot was certified and qualified for the flight in accordance with existing regulations. \r\n- The aircraft was certified, equipped, and maintained in accordance with existing regulations and approved procedures. \r\n- There was no evidence found of any airframe failure or system malfunction prior to or during the flight. \r\n- The weight and centre of gravity were within the prescribed limits."}