{"url": "https://www.baaa-acro.com/crash/crash-cessna-340-westhampton-2-killed", "date": "Mar 3, 1994 at 1916 LT", "type": "Cessna 340", "operator": "James Flying Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Trenton – Westhampton", "msn": "340-0111", "yom": 1972, "flight_number": null, "city": "Westhampton-Francis S. Gabreski", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6828, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6857, "circumstances": "Air traffic control had cleared the airplane for the ILS approach to runway 24, circle to land on runway 06. The airplane broke off the approach to runway 24, and was observed by a witness at a low altitude, on a left downwind for runway 06, flying in and out of clouds. On the base leg, the airplane turned to the left, and a witness saw the left wing make contact with the ground. One witness said that before the crash, the engine sounded 'like they were at full rpm. Several pilots from the air national guard (ang) at the airport went to the crash site minutes after the crash, and observed ice on the airplane's wings and empennage. One of the ang pilot reported his observation of the ice on the aircraft: 'It appeared to be approximately 1/8 inch in thickness throughout the left and right wing surfaces and the rear empennage sections . . .' Another ang pilot described the weather at the time of the accident as, visibility less then one mile with 'freezing rain and sleet.' The examination of the airplane did not disclose evidence of mechanical malfunction. Both occupants were killed. ", "probable_cause": "The pilot's inadequate inflight decision which resulted in ice accretion on the aircraft, degradation of aircraft performance, an aerodynamic stall, loss of control and inflight collision with the ground. Factors were icing conditions. "}