{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-moomba", "date": "Dec 13, 2016 at 1251 LT", "type": "Beechcraft 200 Super King Air", "operator": "Royal%20Flying%20Doctor%20Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Innamincka – Moomba", "msn": "BB-1333", "yom": 1989, "flight_number": "FD209", "city": "Moomba", "zone": "South Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 13 December 2016, a Beech Aircraft Corporation B200, registered VH-MVL, conducted a medical services flight from Innamincka, South Australia (SA) to Moomba, SA. On board the aircraft were the pilot and two passengers. On arrival at Moomba at about 1250 Central Daylight-saving Time (CDT), the pilot configured the aircraft to join the circuit with flaps set to the approach setting and the propeller speed set at 1900 RPM. They positioned the aircraft at 150–160 kt airspeed to join the downwind leg of the circuit for runway 30, which is a right circuit. The pilot lowered the landing gear on the downwind circuit leg. They reduced power (set 600-700 foot-pounds torque on both engines) to start the final descent on late downwind abeam the runway 30 threshold, in accordance with their standard operating procedures. At about the turn point for the base leg of the circuit, the pilot observed the left engine fire warning activate. The pilot held the aircraft in the right base turn, but paused before conducting the engine fire checklist immediate actions in consideration of the fact that they were only a few minutes from landing and there were no secondary indications of an engine fire. After a momentary pause, the pilot decided to conduct the immediate actions. They retarded the left engine condition lever to the fuel shut-off position, paused again to consider if there was any other evidence of fire, then closed the firewall shutoff valve, activated the fire extinguisher and doubled the right engine power (about 1,400 foot-pounds torque). The pilot continued to fly the aircraft in a continuous turn for the base leg towards the final approach path, but noticed it was getting increasingly difficult to maintain the right turn. They checked the engine instruments and confirmed the left engine was shut down. They adjusted the aileron and rudder trim to assist controlling the aircraft in the right turn. The aircraft became more difficult to control as the right turn and descent continued and the pilot focused on maintaining bank angle, airspeed (fluctuating 100–115 kt) and rate of descent. Due to the pilot’s position in the left seat, they were initially unable to sight the runway when they started the right turn. The aircraft had flown through the extended runway centreline when the pilot sighted the runway to the right of the aircraft. The aircraft was low on the approach and the pilot realised that a sand dune between the aircraft and the runway was a potential obstacle. They increased the right engine power to climb power (2,230 foot-pounds torque) raised the landing gear and retracted the flap to reduce the rate of descent. The aircraft cleared the sand dune and the pilot lowered the landing gear and continued the approach to the runway from a position to the left of the runway centreline. The aircraft landed in the sand to the left of the runway threshold and after a short ground roll spun to the left and came to rest. There were no injuries and the aircraft was substantially damaged.", "probable_cause": "From the evidence available, the following findings are made with respect to the collision with terrain involving Beech Aircraft Corporation B200, registered VH-MVL that occurred at Moomba Airport, South Australia on 13 December 2016. These findings should not be read as apportioning blame or liability to any particular organisation or individual.\r\nContributing factors:\r\n- The operator did not modify the aircraft to include a more reliable engine fire detection system in accordance with the manufacturer’s service bulletin, and as subsequently recommended by the Civil Aviation Safety Authority’s airworthiness bulletin. The incorporation of the manufacturer’s modification would have reduced the risk of a false engine fire warning.\r\n- During the approach phase of flight, the pilot shutdown the left engine in response to observing a fire warning, but omitted to feather the propeller. The additional drag caused by the windmilling propeller, combined with the aircraft configuration set for landing while in a right turn, required more thrust than available for the approach.\n\r\nOther factors that increased risk:\r\n- The advice from the Civil Aviation Safety Authority to the operator, that differences training was acceptable, resulted in the pilot not receiving the operator’s published B200 syllabus of training. The omission of basic handling training on a new aircraft type could result in a pilot not developing the required skilled behaviour to handle the aircraft either near to or in a loss of control situation.\n\r\nOther findings:\r\n- The pilot met the standard required by the operator in their cyclic training and proficiency program and no knowledge deficiencies associated with handling engine fire warnings were identified."}