{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-near-wikieup-2-killed", "date": "Jul 10, 2021 at 1255 LT", "type": "Beechcraft 90 King Air", "operator": "Falcon%20Executive%20Aviation", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Mountains", "schedule": "Marana - Marana", "msn": "LJ-915", "yom": 1980, "flight_number": null, "city": "Wikieup", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On July 10, 2021, about 1255 mountain standard time, a Beech C-90, turbo prop airplane, N3688P, was destroyed when it was involved in an accident near Wikieup, Arizona. The pilot and Air Tactical Group supervisor were fatally injured. The airplane was operated as a public-use firefighting aircraft in support of the Bureau of Land Management conducting aerial reconnaissance and supervision. The airplane was on station for about 45 minutes over the area of the Cedar Basin fire. Preliminary radar data showed that the airplane had accomplished multiple orbits over the area of the fire about 2,500 ft above ground level (agl). The last radar data point showed the airplane’s airspeed about 151 knots, its altitude about 2,300 ft agl, and that it was in a descent, about 805 ft east southeast of the accident site. According to a witness, the airplane was observed in a steep dive towards the ground. Subsequently, the airplane impacted side of a ridgeline in mountainous desert terrain about 15 miles northeast of Wikieup. The wreckage was consumed by a post-crash fire. Debris was scattered over an area of several acres. The left wing was located about 0.79 miles northeast of the main wreckage and did not sustain thermal damage. No distress call from the airplane was overheard on the radio.\n", "probable_cause": null}