{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-321c-istres", "date": "Mar 31, 1992 at 0940 LT", "type": "Boeing 707", "operator": "Trans-Air Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Luxembourg - Kano", "msn": "18718", "yom": 1964, "flight_number": "ONK671", "city": "Istres-Le Tubé", "zone": "Bouches-du-Rhône", "country": "France", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 26000, "captain_hours_type": 7100, "copilot_hours": 1400, "copilot_hours_type": 4500, "aircraft_hours": 60895, "circumstances": "The aircraft, under an IFR (°) flight plan, was flying from Luxembourg to Kano (Nigeria), carrying freight. It took off from Luxembourg aerodrome at 07.14 hrs with the peak load of 150 tonnes (38 tonnes of freight, 116 000 pounds of fuel). The crew was composed of three men, the captain, the first officer, and the flight engineer. Two passengers were on board; a maintenance man, and a cargo supervisor. The aircraft, on a heading of 199°, when passing \"VILAR\" and the VOR of Martigues, over the Drôme province, was authorized by le Centre Régional de Navigation Aérienne sud-est : CRNA/SE (South-East Aircraft Navigation Regional Center), to leave flight level 290 and climb to flight level 330. This flight section was performed in IMC, in turbulent air. With the throttles at climb power and automatic pilot engaged, the aircraft was flying at an indicated air speed (IAS) of 280 kt passing the flight level 320. It flew over the far south-east of the Drôme area, 20 NM to the west of Sisteron. At this moment, the crew was experiencing severe turbulence and heard a \"double bang\". The aircraft suddenly rolled to the right. The captain disengaged the automatic pilot and struggled to keep control by \"countering\" with the control stick and the rudder pedals. The continuous fire warning system sounded. According to the visual warning, this corresponded to a fire on engine n°4. A short time later, a visual warning lit up to report a fire on engine n°3. The crew noted that the throttles of these engines had moved forwards on their own. The cockpit noise level was extremely significant dominated by the engine fire warning that the flight engineer could not switch off despite the fact he repeatedly pressed the cap on the panel. Another warning system sounded at the same time to indicate the cabin depressurization and continued for most of the flight and until the landing (intermittent warning horn). The cockpit voice recorder (CVR), as well as the crew members' additional information enabled identification of the essential actions respectively executed in this emergency situation by the captain, the first officer, the flight engineer and both passengers. It should be noted that these actions ended in the successful landing at a diversion field. The captain was worried about the origin of the \"fire\" warning. The first officer announced that engine n°4 (right outboard) \"had separated from the wing\" and immediately sent out the distress call \"MAYDAY MAYDAY\". A short time later, he specified that, in fact, both right engines \"had gone\". The flight engineer suggested lightening the aircraft by fuel dumping. The captain immediately agreed. While the first officer was in charge of radio communications and determining the nature of the aircraft's damage, the captain, who was struggling at the flight controls, asked for the meteorological conditions in Marseilles and ordered the gear extension. Then, a descent towards Marseilles was initiated. The flight engineer, helped by the maintenance man, extended the gear according to the emergency drill and continued with fuel dumping. The first officer checked that the emergency drill recommended in case of engine separation was in progress and, still being in charge of the ATC communications, attempted to obtain the meteorological conditions in Marseilles. At the captain's request, the first officer specified to air traffic control that they were capable of only limited manoeuvring. The first officer noticed \"an airfield ahead\", and asked for its identification. This airfield proved to be the Istres military field. Then, he asked about the length of the runway (4000 meters) and quickly got from Marseilles air traffic control the landing clearance. He asked for a left hand circuit so as to land on runway 15 (downwind runway 33). The Istres controller immediately agreed. By listening to the cockpit voice recorder, it was apparent how difficult it was for the captain to complete the last turn before alignment. The first officer encouraged him by repeating six times \"left turn\". During this last turn, the controller informed the crew that the aircraft was on fire. The landing took place slightly to the left of the centreline, the aircraft touching down on the runway at 190 kt. The first officer and the flight engineer helped the captain during this phase. The first officer held the left engines throttles. The captain specified that there were \"no hydraulic brakes!\", and thus resorted to the \"emergency brake system\". The left main gear tyres burst. The flight engineer selected maximum reverse power on engine n°2. The aircraft, after a 2,300-meter-ground roll, went out off the left side of the runway and stopped 250 meters further on, heading approximately 90° from the runway axis. The firemen extinguished the fire with their high-capacity fire vehicles (fire brigade: SSIS). The crew members evacuated the aircraft through the cockpit side window panels with the help of escape ropes. Both passengers went out through the left front door. The crew members only realized that the right wing was on fire when the aircraft landed and stopped. In particular, it appeared that the first officer had not heard the remark of the controller. The landing took place at 08.35 hrs, that is to say approximately 24 minutes after the loss of the two right engines.", "probable_cause": "The accident resulted from the fracture of the right inboard engine pylon fitting, in such conditions that this engine came to hit and tore away the outboard engine. The AD, imposing periodic monitoring of the midspar fittings, proved to be insufficiently efficient."}