{"url": "https://www.baaa-acro.com/crash/crash-boeing-c-135b-stratolifter-clark-afb-80-killed", "date": "May 11, 1964 at 1920 LT", "type": "Boeing C-135 Stratolifter", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Travis – Hickam – Clark", "msn": "18239", "yom": 1962, "flight_number": null, "city": "Clark AFB (Angeles City)", "zone": "Pampanga", "country": "Philippines", "region": "Asia", "crew_on_board": 10, "crew_fatalities": 5, "pax_on_board": 74, "pax_fatalities": 74, "other_fatalities": 1, "total_fatalities": 80, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was completing a flight from Travis AFB to Clark AFB with an intermediate stop at Hickam Field, Honolulu, carrying US soldiers and their family members. While descending to Clark AFB runway 02, the crew encountered poor weather conditions with low clouds, rain falls and a limited visibility to one mile. Five km from the runway threshold, the crew passed below the glide and the ATC in charge of the approach sent three warnings to the crew. Despite this, the pilot-in-command continued the approach and at three km from the runway threshold, the crew was instructed to go around. As the captain had the runway in sight, he neglected this order and decided to continue the approach, changed his frequency and contacted the tower when he was cleared to land. At a distance of 1,050 meters short of runway threshold, the nose gear struck a fence and the left wing struck the TACAN (Tactical Air navigation) antenna. The airplane stalled, hit the ground and slid for several yards, crossed a road where it struck a taxi and came to rest in flames 600 meters short of runway and 100 meters to the left of the extended centerline. Five crew members, among them both pilots, were injured, while all 74 passengers, five others crew members and the taxi driver were killed. Both taxi's passengers were injured as well. ", "probable_cause": "Wrong approach configuration on part of the flying crew who decided to continue the approach despite he was instructed by ATC to abandon the approach and to go around. Marginal weather conditions were considered as a contributing factor as well as the lack of ATC coordination as the ATC in charge of the approach instructed the crew to go around and the ATC by the Tower cleared the crew to land. "}