{"url": "https://www.baaa-acro.com/crash/crash-short-330-utt-umiujaq", "date": "Dec 1, 1993 at 1510 LT", "type": "Short 330", "operator": "Government of Quebec", "flight_phase": "Landing (descent or approach)", "flight_type": "Government", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kuujjuarapik - Umiujaq", "msn": "3124", "yom": 1988, "flight_number": null, "city": "Umiujaq", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 11, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10122, "captain_hours_type": 500, "copilot_hours": 10000, "copilot_hours_type": 10, "aircraft_hours": 1323, "circumstances": "The two pilots were transporting Hydro-Québec employees in the aircraft to allow them to check electrical facilities in several villages along the Hudson Bay coast. The aircraft departed\r\nKuujjuarapik, Quebec, at about 1444 eastern standard time (EST) on a flight to Umiujaq, Quebec, a distance of 86 nautical miles (nm) to the north. The pilot-in-command was flying the aircraft. After the take-off from Kuujjuarapik, the crew contacted the Kuujjuarapik Flight Service Station (FSS) to file a flight notification and request weather information. The crew received three weather reports for Umiujaq from that FSS. The flight was conducted at an altitude of 5,000 feet on an outbound track of 045 degrees from the Kuujjuarapik non-directional beacon (NDB). Thirty miles from Umiujaq, the crew commenced the descent. Seven miles from the village, the aircraft was at an altitude of 700 feet and the crew could see the ground. The crew used a global positioning system (GPS) waypoint to supplement visual navigation (before reaching a downwind position), and continued their step-down procedure to about 200 feet above ground level (agl) on a heading of 25 degrees magnetic (°M). At that altitude, the visibility was reported by the crew to be over one and one-half miles and the crew could recognize references on the ground and position the aircraft for landing. When turning onto the final approach to runway 21, the pilot-in-command initiated a turn with at least 35 degrees of bank angle, and the aircraft stalled. The pilot-in-command initiated a stall recovery and called for full power. The aircraft did not gain sufficient altitude to overfly the rising terrain, and it crashed. The two crew members and two of the passengers sustained minor injuries. They were given first aid treatment at the accident site by other passengers.", "probable_cause": "The stalling speed of the aircraft increased due to ice on the leading edge of the wings and because the pilot made a steep turn; the aircraft stalled at an altitude from which the pilot was unable to recover. A contributing factor was the crew's decision to continue the visual approach into Umiujaq despite the weather conditions reported."}