{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-200-halaveli", "date": "Jun 2, 2009 at 1009 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Maldivian%20Air%20Taxi", "flight_phase": "Landing (descent or approach)", "flight_type": "Aerial photography", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Male - Halaveli", "msn": "224", "yom": 1969, "flight_number": null, "city": "Halaveli (Alifu Alifu Atoll)", "zone": "North Central Province", "country": "Maldivian Islands", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3556, "captain_hours_type": 3240, "copilot_hours": 1974, "copilot_hours_type": 1688, "aircraft_hours": 33685, "circumstances": "The 8Q-MAG aircraft departed at 0945hrs, with 3 crew and 4 passengers on board, for a Photo Flight around the Lagoon of Halaveli (North Ari Atoll) from the floating platform ( fixed to jetty) of Halaveli (North Ari Atoll). The sky was clear with good visibility and wind, 8-10 knots, from westerly direction. The estimated flight time for the flight was 40 minutes. The aircraft took off westbound. After levelling the aircraft the co-pilot gave his seat to the cameraman, one of the passengers. The co-pilot remained at third row left seat from thereon until the aircraft met the accident. According to the crew and passengers the aircraft made few orbits (right bank) around the island at the initial levelled height and, then descended lower heights and made few more orbits around the lagoon for photography. The passenger seated at the cabin wearing the headset informed the PIC that they got all the shots they wanted and now he could land. PIC started a descending turn (right bank) while keeping the passenger at the co-pilot seat in order to give a different view to him. Before the PIC could complete the turn, the right wing and/or float hit the water. The accident resulted in both wings being broken at the root. Left float was detached and right float got stuck, between the engine and the fuselage, blocking the co-pilot exit. Empennage was twisted upside down. The depth of the lagoon at the site of wreckage was about 1 meter. All the passengers and crew were able to escape the aircraft without any fatalities. ", "probable_cause": "It was observed by the investigation team that; \r\n• The PIC was conducting flying activities (photographic activities) lower than that allowed in regulations and company operations manual and standard operating procedures. \r\n• At the time of accident a passenger was occupying the co-pilot seat. \r\n• PIC could not make a fair judgment of the aircraft altitude by looking outside since the aircraft was banking to the right for a turn and the co-pilot seat was occupied by a passenger. \r\n• The crew of the aircraft acted swiftly to save lives, after the aircraft came to a halt. \r\n• Investigation revealed that the right float forward and both wingtips were severely damaged. Since the aircraft was right banked at the impact it was evident that the right wing and/or float were the first to impact with the water. "}