{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-greensboro", "date": "Aug 8, 2000 at 1544 LT", "type": "Douglas DC-9", "operator": "AirTran%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Greensboro - Atlanta", "msn": "47442/524", "yom": 1970, "flight_number": "FL913", "city": "Greensboro", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 58, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 22000, "captain_hours_type": 15000, "copilot_hours": 8000, "copilot_hours_type": 2000, "aircraft_hours": null, "circumstances": "Examination of the area of the fire origin revealed that relay R2-53, the left heat exchanger cooling fan relay, was severely heat damaged, as were R2-54 and the other relays in this area. However, the R2-53 relay also exhibited loose terminal studs and several holes that had burned through the relay housing that the other relays did not exhibit. The wire bundles that run immediately below the left and right heat exchanger cooling fans and the ground service tie relays exhibited heat damage to the wire insulation, with the greatest damage located just below the R2-53 relay. The unique damage observed on the R2-53 relay and the wire damage directly below it indicates that fire initiation was caused by an internal failure of the R2-53 relay. Disassembly of the relay revealed that the R2-53 relay had been repaired but not to the manufacturer's standards. According to the manufacturer, the damage to the relay housing was consistent with a phase-to-phase arc between terminals A2 and B2 of the relay. During the on-scene portion of the investigation, three of the four circuit breakers in the left heat exchanger cooling fan were found in the tripped position. To determine why only three of the four circuit breakers tripped, all four were submitted to the Materials Integrity Branch at Wright-Patterson Air Force Base, Dayton, Ohio, for further examination. The circuit breakers were visually examined and were subjected to an insulation resistance measurement, a contact resistance test, a voltage drop test, and a calibration test (which measured minimum and maximum ultimate trip times). Testing and examination determined that the circuit breaker that did not trip exhibited no anomalies that would prevent normal operation, met all specifications required for the selected tests, and operated properly during the calibration test. Although this circuit breaker appeared to have functioned properly during testing, the lab report noted that, as a thermal device, the circuit breaker is designed to trip when a sustained current overload exists and that it is possible during the event that intermittent arcing or a resistive short occurred or that the circuit opened before the breaker reached a temperature sufficient to trip the device.", "probable_cause": "A phase-to-phase arc in the left heat exchanger cooling fan relay, which ignited the surrounding wire insulation and other combustible materials within the electrical power center panel. Contributing to the left heat exchanger fan relay malfunction was the unauthorized repair that was not to the manufacturer's standards and the circuit breakers' failure to recognize an arc-fault."}