{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-bloomington-2-killed", "date": "Jul 21, 2002 at 1026 LT", "type": "Beechcraft 90 King Air", "operator": "Image%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bloomington - Cable Union", "msn": "LW-41", "yom": 1973, "flight_number": null, "city": "Bloomington", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1740, "captain_hours_type": 942, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8643, "circumstances": "The airplane was destroyed by impact forces and post-impact fire when it impacted the terrain about 1/3 mile northeast of the departure end of runway 20 during takeoff. The airplane was cleared for a right turnout after takeoff, but witnesses observed the airplane climb to about 100 feet, veer left, enter a left bank, go inverted, and then impact the terrain in a nose low attitude. The airplane's left and right wings, fuselage, and cockpit were largely consumed by fire. Inspection of the airplane revealed the flaps and landing gear were retracted. There was aileron control continuity from the control yoke to the aileron bellcranks. There was elevator and rudder control cable continuity from the bellcranks at the forward bulkhead to the control surfaces. Inspections of the engines and propellers indicated the right engine and propeller was producing power in the middle to high power range at impact, and the left engine and propeller was producing power in the low to middle range of power at impact. The 60-year old pilot had flown 942 hours in the accident airplane, and was described as a very safety conscious, conservative pilot, who performed very thorough preflights and adhered to all checklists. The 22-year old pilot rated passenger had not received ground or flight instruction in the make and model of the accident airplane. The toxicology reports were negative for all substances tested. There were no remarkable findings in the autopsies. ", "probable_cause": "The cause of the accident is undetermined."}