{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-104a-near-chita-64-killed", "date": "Aug 15, 1958 at 2220 LT", "type": "Tupolev TU-104", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Khabarovsk – Irkutsk", "msn": "7 35 03 03", "yom": 28, "flight_number": "SU004", "city": "Chita", "zone": "Zabaykalsky Krai", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 58, "pax_fatalities": 58, "other_fatalities": 0, "total_fatalities": 64, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1041, "circumstances": "The aircraft departed Khabarovsk Airport with a delay of 3 hours and 35 minutes due to poor weather conditions. En route, while cruising at an assigned altitude of 11,000 meters, the crew encountered poor weather conditions and the captain decided to gain height to avoid the low pressure area. Shortly later, while at an altitude of 12,000 meters, the airplane went out of control and nosed down. It dove into the ground and crashed by an angle of 60° nose down in a field located near Chita. The airplane disintegrated on impact and all 64 occupants were killed. Debris were scattered on a distance of about 450 meters. ", "probable_cause": "The accident was the result of a loss of controllability due to atmospheric turbulences while cruising at an altitude of 12,000 meters which is in excess with the flying limitations and certification of the aircraft. Due to marginal weather conditions, the flight should be cancelled or postponed. The following factors contributed to the accident:\r\n- Poor flight preparation on part of the ground operations, flying crew and flight director,\r\n- The flight was delayed of 3 hours and 35 minutes, causing the aircraft to fly in worse weather conditions than predicted, \r\n- Inadequate weather forecast,\r\n- Poor weather conditions with atmospheric turbulences, \r\n- Lack of clear instructions concerning the aircraft operation limitations (ceiling altitude),\r\n- Violation of standard operating procedures."}