{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200c-super-king-air-mount-gambier-1-killed", "date": "Dec 10, 2001 at 2336 LT", "type": "Beechcraft 200 Super King Air", "operator": "Royal%20Flying%20Doctor%20Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Adelaide - Mount Gambier - Adelaide", "msn": "BL-47", "yom": 1982, "flight_number": null, "city": "Mount Gambier", "zone": "South Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 13730, "captain_hours_type": 372, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10907, "circumstances": "The Raytheon Beech 200C Super King Air, registered VH-FMN, departed Adelaide at 2240 hours Central Summer Time (CSuT) under the Instrument Flight Rules for Mount Gambier, South Australia. The ambulance aircraft was being positioned from Adelaide to Mount Gambier to transport a patient from Mount Gambier to Sydney for a medical procedure, for which time constraints applied. The pilot intended to refuel the aircraft at Mount Gambier. The planned flight time to Mount Gambier was 52 minutes. On board were the pilot and one medical crewmember. The medical crewmember was seated in a rear-facing seat behind the pilot. On departure from Adelaide, the pilot climbed the aircraft to an altitude of 21,000 ft above mean sea level for the flight to Mount Gambier. At approximately 2308, the pilot requested and received from Air Traffic Services (ATS) the latest weather report for Mount Gambier aerodrome, including the altimeter sub-scale pressure reading of 1012 millibars. At approximately 2312, the pilot commenced descent to Mount Gambier. At approximately 2324, the aircraft descended through about 8,200 ft and below ATS radar coverage. At approximately 2326, the pilot made a radio transmission on the Mount Gambier Mandatory Broadcast Zone (MBZ) frequency advising that the aircraft was 26 NM north, inbound, had left 5,000 ft on descent and was estimating the Mount Gambier circuit at 2335. At about 2327, the pilot started a series of radio transmissions to activate the Mount Gambier aerodrome pilot activated lighting (PAL).2 At approximately 2329, the pilot made a radio transmission advising that the aircraft was 19 NM north and maintaining 4,000 ft. About 3 minutes later, he made another series of transmissions to activate the Mount Gambier PAL. At approximately 2333, the pilot reported to ATS that he was in the circuit at Mount Gambier and would report after landing. Witnesses located in the vicinity of the aircraft’s flight path reported that the aircraft was flying lower than normal for aircraft arriving from the northwest. At approximately 2336 (56 minutes after departure), the aircraft impacted the ground at a position 3.1 NM from the threshold of runway (RWY) 18. The pilot sustained fatal injuries and the medical crewmember sustained serious injuries, but egressed unaided. ", "probable_cause": "The following factors were identified:\r\n- Dark night conditions existed in the area surrounding the approach path of the aircraft.\r\n- For reasons which could not be ascertained, the pilot did not comply with the requirements of the published instrument approach procedures.\r\n- The aircraft was flown at an altitude insufficient to ensure terrain clearance.\n"}