{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-65-b80-queen-air-cannington", "date": "Feb 12, 1996 at 1004 LT", "type": "Beechcraft 80 Queen Air", "operator": "Falcon Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cannington – Townsville", "msn": "LD-495", "yom": 1975, "flight_number": null, "city": "Cannington", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3758, "captain_hours_type": 1023, "copilot_hours": 634, "copilot_hours_type": 276, "aircraft_hours": null, "circumstances": "The aircraft was engaged on a charter flight for the BHP Cannington mine, and departed from Townsville at 0630 EST. The flight was uneventful and the aircraft landed at Cannington at 0840. The aircraft was refuelled and at about 0945 seven passengers and baggage were loaded. The aircraft was started and taxied for runway 36. During this time the necessary checks were completed. The takeoff was commenced, and after the aircraft became airborne and was accelerating with a positive rate of climb, the landing gear was selected up. While the gear was still in transit, there was a sudden power loss from the left engine. The pilot described a simultaneous height loss, roll, pitch, and yaw accompanied by a sound similar to a buzz saw from the left engine. The pilot immediately recognised that the left engine had failed and attempted to maintain speed and directional control. Power was reduced on the right engine to maintain directional control, and it was the pilot's intention to land the aircraft with gear retracted beyond the end of the runway. However, the left wingtip struck a steel fence post, and this spun the aircraft to the left. The aircraft struck a low earth bank while travelling sideways and rearwards. When the aircraft came to rest, all windows were obscured and the pilot believed the aircraft was on fire. The pilot tried unsuccessfully to open the main cabin door, and the passengers were then evacuated through the emergency exit.", "probable_cause": "The following findings were reported:\r\n- The retaining bolts for the propeller gearbox stationary gear assembly failed when the aircraft had just become airborne.\r\n- The pilot was unable to maintain directional control and landed the aircraft with landing gear retracted."}