{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61p-aerostar-ted-smith-601p-belle-glade", "date": "Feb 16, 2002 at 0800 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Trans Porter International Airlines", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Boca Raton – Marathon", "msn": "61-0216-024", "yom": 1975, "flight_number": null, "city": "Belle Glade", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1884, "captain_hours_type": 120, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1950, "circumstances": "The pilot was aware of thunderstorms along his route of flight. He paralleled a line of storms for about 20 minutes looking for a hole in the storms to penetrate, without any success. He turned, and climbed to an altitude of 13,500 feet. He noticed what seemed to be an opening to the south, and turned southbound, through the hole, for about 2 or 3 miles, and then the hole closed. He turned the airplane to the right to reverse course, when he inadvertently penetrated a cell. At this point he said he \"lost control of the airplane, and was turned upside down…...heading straight down towards the ground...…traveling at a high rate of speed..….the airspeed indicator was pegged.\" At an altitude of about 2,000 feet, he was able to level the wings, reduce power and raise the nose. He said he was then able to slow the airplane for a \"controlled crash landing,\" straight a head in a sugar cane field. According to the Sheriff's Report, he struck the field in which the aircraft was lying in immediately after slowing the airplane. The distance from the initial impact area to where the airplane came to rest was about 75 yards.", "probable_cause": "The pilot continued flight into known adverse weather resulting in a loss of control and subsequent impact with the ground."}