{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-20c-mt-chivilme-4-killed", "date": "Feb 7, 1997 at 2211 LT", "type": "Dassault Falcon 20", "operator": "Estornel Air Services", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Córdoba – San Miguel de Tucumán – Salta", "msn": "34", "yom": 1966, "flight_number": null, "city": "Mt Chivilme", "zone": "Salta", "country": "Argentina", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15118, "circumstances": "The aircraft was completing a cargo flight from Córdoba to Salta with an intermediate stop in San Miguel de Tucumán, carrying two passengers and two pilots. The crew departed San Miguel de Tucumán-Teniente Benjamin Matienzo Airport at 2145LT and was cleared to climb to FL180. At 2201LT, the crew reported over PONPI VOR located 55 nm from Salta. Two minutes later, the crew was cleared to descent on top of the clouds in VMC conditions. While cruising at an altitude of 6,970 feet, the aircraft struck the slope of Mt Chivilme located 36,4 km southwest of Salta Airport. The aircraft was destroyed by impact forces and all four occupants were killed.", "probable_cause": "Collision with a mountain during the descent prior to landing, while flying an instrument approach procedure other than the existing airport destination with errors in distances and heights. The following contributing factors were identified:\r\n- Use of GPS as the primary instrument of navigation, when it should be used as a supplementary tool or reference,\r\n- Lack of control over the instruments and procedures,\r\n- Poor crew resources management, \r\n- Placement of a fictitious point in the GPS with the name 'F-SAL' point which is easily confused with \"SALT\", the acronym of the Salta airport."}