{"url": "https://www.baaa-acro.com/crash/crash-convair-b-36b-1-cf-peacemaker-near-crowley-2-killed", "date": "Nov 22, 1950 at 0950 LT", "type": "Convair B-36 Peacemaker", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Carswell - Carswell", "msn": "76", "yom": 1946, "flight_number": null, "city": "Crowley", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 16, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Aircraft Commander 1st Lt. Oliver Hildebrandt, Pilot 1st Lt. Walter Ross, and Co-pilot Captain Wilbur Evans, and a crew of thirteen took off from Carswell AFB in B-36B, 44-92035 of the 26th Bomb Squadron of the 7th Bomb Wing at 5:05 A.M. on November 22,1950. The planned 30-hour training mission consisted of air-to-air gunnery, bombing, simulated radar bombing, and navigational training. Immediately after take-off, the #4 alternator would not stay in parallel with the other three alternators, so it was taken off-line and de-excited three minutes into the flight. About one minute after the #4 alternator was shut down, flames 8 to 12 feet long erupted from around the air plug of the number-one engine. The left scanner reported the flames to the pilot. Six minutes after take-off, the flight engineer shut down the number-one engine, feathered its propeller, and expended one of its Methyl bromide fire extinguishing bottles. The mission continued on the power of the remaining five engines. 44-92035 cruised to the gunnery range on Matagorda Island at an altitude of 5,000 feet. It arrived at 7:00 A.M. and the gunners began practicing. Radar Observer S/Sgt. Ray Earl manned the tail turret. The charger for the right gun burned out, so he expended just half of his ammunition. Then the APG-3 radar for the tail turret started acting up, so S/Sgt. Earl secured the set. Aircraft Commander 1st Lt. Oliver Hildebrandt noted that the vibration from firing the 20mm cannons increased significantly during the fourth gunnery pass. Immediately afterward, radar operator Captain James Yeingst notified Hildebrandt that the APQ-24 radar set blew up and was smoking. Vibration from the firing of the guns was causing shorting between the internal components of the radar. Then the liaison transmitter failed as well. The cannons in the left forward upper turret and the left rear upper turret stopped firing. The gunners attempted to retract the gun turrets, but the failed turrets would not retract. Gunner S/Sgt. Fred Boyd entered the turret bay, but other problems began to take precedence over the stuck turrets. Boyd was called out of the bay before he could manually crank the turret down. At 7:31 A.M. the number-three engine suffered an internal failure. The torque pressure fell to zero. The manifold pressure dropped to atmospheric pressure. The fuel flow dropped off, and the flight engineer could not stabilize the engine speed. The pilot shut down the number-three engine and feathered its propeller. The B-36B had only one operating engine on the left wing, so the pilot aborted the remainder of the training mission and set course for Kelly Air Force Base. Flight engineer Captain Samuel Baker retarded the spark, set the mixture controls to \"normal\", and set the engine RPMs to 2,500 to increase the power from the remaining engines. Unknown to Captain Baker, the vibration from the guns had disabled the electrical systems controlling the spark settings and fuel mixture. He immediately discovered that the turbo control knobs no longer affected the manifold pressure. The B-36B could not maintain its airspeed on the power of the four remaining engines. It descended about 1,000 feet and its airspeed bled off to 135 miles per hour. The pilot called for more power. The flight engineer attempted to increase engine speed to 2,650 RPM and enrich the fuel mixture, but got no response from the engines except for severe backfiring. The fuel mixture indicators for all of the engines indicated lean. The second flight engineer, M/Sgt. Edward Farcas, checked the electrical fuse panel. Although the fuses appeared to be intact, he replaced the master turbo fuse and all of the individual turbo fuses. He noticed that the turbo-amplifiers and mixture amplifiers were all cooler than normal. He climbed into the bomb bay to check the aircraft power panels and fuses, but could not find any problem there. Kelly Air Force Base had a cloud overcast at just 300 feet and the visibility was restricted to two miles. The weather at Bergstrom Air Force Base not as bad, with scattered clouds at 1,000 feet, broken clouds at 2,000 feet and 10 miles visibility. Carswell Air Force Base was clear with 10 miles visibility, but it was 155 miles farther away than Bergstrom. Air traffic control cleared all airspace below 4,000 feet aead of the crippled B-36B. Aircraft Commander Hildebrandt was flying on instruments in thick clouds. The poor weather at Kelly Air Force Base convinced Hildebrandt to change course from Kelly to Carswell Air Force Base, passing by Bergstrom Air Force Base on the way in case the airplane could not make it to Carswell. Bombardier Captain Robert Nelson made two attempts to salvo the 1,500 pounds of practice bombs in the rear bomb bay, but the bomb bay doors would not open by automatic or manual control, or emergency procedure. There was no way to dump fuel to reduce the weight of the B-36B. The flight engineers resorted to holding down the switches used to prime the fuel system in an attempt to increase fuel flow to the engines. M/Sgt. Edward Farcas held down the prime switches for the number-two and number-four engines while Captain Baker held down the prime switch for the number-five engine and operated the flight engineer's panel. The configuration of the switches did not allow them to prime the number-five engine and the number-six engine at the same time. The high power demand coupled with the lean fuel mixture made the cylinder head temperatures of the engines climb to 295 degrees C. Flight engineer Baker jockeyed the throttles, decreasing the throttle setting of the engine with the highest cylinder head temperature until another engine grew even hotter. The high temperature caused the gasoline/air mixture in the cylinders to detonate before the pistons reached top dead center, diminishing power and damaging the engines. Despite the critical situation with the engines, Aircraft Commander Hildebrandt decided to continue past Bergstrom Air Force Base to Carswell. Bergstrom was overcast and its runway was only 6,000 feet long. Carswell offered a much longer runway. By the time the B-36B reached Cleburne, the backfiring on all engines increased in violence. The number-2, number-5, and number-6 engines were running at 70% power and the number-4 engine was producing only 20% power. The airspeed had dropped off to 130 miles per hour. Aircraft Commander Hildebrandt attempted to restart the number-one engine, the one that had spouted flames on take-off, but fuel was not getting to its induction system. He tried to restart the number-three engine, but could not unfeather the propeller on that engine. As the bomber passed to the west of Cleburne, the right scanner reported dense white smoke, oil, and metal particles coming from the number-five engine. After a short while the number-five engine lost power, and Aircraft Commander Hildebrandt feathered the propeller on that engine while still twenty-one miles from Carswell Air Force Base. The B-36B could not stay airborne on the power of the three remaining failing engines. It was flying at just 125 miles per hour, seven miles per hour above the stall speed, losing both altitude and airspeed. Howard McCullough and W. Boeten were flying Civil Aeronautics Authority DC-3 N342 near Cleburne. They were notified by Meacham Tower to be on the lookout for 44-92035. They spotted it about five miles south of Cleburne. They observed that the number-one and number-three propellers were feathered and the number-five engine was on fire. They turned to follow the descending bomber.  Aircraft Commander Hildebrandt ordered the crew to bail out of the stricken bomber. Bombardier Captain Robert Nelson had bailed out of airplanes on two previous occasions. He had crash landed twice and ditched once. He was the first man to bail out from the forward crew compartment. He suffered contusions of his lower spine when he landed. Radar Operator Captain James Yeingst responded to stress with laughter and jokes. He was a bit giddy before the bailout. He was the second man to exit from the forward crew compartment. His parachute streamed after he pulled the rip cord. He passed Captain Nelson going down. Captain Yeingst's parachute mushroomed open just before he hit the ground, but he suffered fatal injuries. Co-pilot Captain Wilbur Evans was the third man to exit from the forward crew compartment. He had bailed out of airplanes twice before and crash landed several times during WW-II. This time he broke both bones in his lower right leg when he landed. Navigator Captain Horace Stewart had previously tried to get off flying status because he felt that the B-36 was too dangerous. It is reported that during the hour before bailout, he was tense, nervous, and chain-smoking. He was the fourth man to bail out from the forward crew compartment. He pulled his rip cord right as he exited the forward escape hatch on the left side of the fuselage. His parachute opened and pulled him toward the number three propeller. His head hit the downward pointing blade of the propeller, killing him instantly. Radio Operator Cpl. Paul Myers followed Captain Stewart out the escape hatch. Myers landed with minor injuries. Flight Engineer M/Sgt. Edward Farcas jumped head first through the exit hatch of the forward crew compartment right after Cpl. Myers. His parachute did not open when he pulled the rip cord. He pulled the parachute out of its pack with his hands and landed with only minor injuries. Radar Mechanic Robert Gianerakis and Flight Engineer Captain Samuel Baker were the next to escape from the forward compartment. Both landed with only minor injuries. Radio Operator Sgt. Armando Villareal bailed out after Captain Baker. Villareal did not trust his parachute to open, so he pulled the rip cord while he was still in the forward crew compartment. He held his parachute in his arms as he jumped feet first through the escape hatch. Despite his unorthodox method of escape, he landed with only minor injuries. Pilot 1st Lt. Walter Ross was the next to last to leave the forward compartment. He landed with only minor injuries. Gunner S/Sgt. Andrew Byrne and Radar Observer S/Sgt. Ray Earl were the first two crew members to bail out of the rear crew compartment. Both landed with only minor injuries. Gunner Cpl. Calvin Martin was the third man to exit the rear crew compartment. He was swinging under his parachute as he hit the ground. He broke his right ankle as he landed. He fell backward onto a rock, fracturing his third lumbar vertebra and compressing his tailbone. Gunner S/Sgt. Ronald Williams followed Cpl. Martin out the rear escape hatch. He landed with only minor injuries. Gunner S/Sgt. Fred Boyd was the last man to exit the rear crew compartment. He called to Aircraft Commander Hildebrandt over the intercom to let him know that everyone had escaped from the aft compartment. When he turned back to the exit hatch, it had fallen shut. He had to open the hatch again to make his escape. He broke the fibula of his left leg when he landed farther to the north than the other crew members. After S/Sgt. Boyd reported that all other crew members had bailed out of the rear compartment, Aircraft Commander Hildebrandt set the autopilot and jumped clear when the bomber was less than 1,000 feet above the ground. He and nine other crew members escaped from the B-36B with only minor injuries. When McCullough and Boeten in DC-3, N342 saw the parachutes of the escaping crew members, they announced the bail-out on the emergency frequency of 121.25 megacycles. Each Report of Emergency Parachute Jump indicates that the incident occurred 20 miles south southeast of Carswell Air Force Base. The descent of the B-36B was witnessed by Mr. Buck Bell and his wife, who lived about 5 to 7 miles southwest of Crowley, Texas. Mr. Bell saw the crew members parachuting from the bomber, but did not see it hit the ground about one mile north of his house. Mr. James Bandy and his wife were on the road to Cleburne about 4 miles from their house on Route 1 near Joshua when they spotted the B-36B trailing smoke, flying in a nose-high attitude. They saw it hit the ground in a level attitude, raising a cloud of dust. The B-36B descended straight ahead in a nose-high attitude for a mile after Aircraft Commander Hildebrandt bailed out. It stalled, pitched nose down, and impacted in a terraced field on Less Armstrong's Dairy, 14 miles south of Carswell Air Force Base, 2 miles west of the South leg FTW range, and six miles west of Crowley at 9:50 in the morning. The forward crew compartment separated and folded underneath the rest of the fuselage. The tail section broke off, and the rear crew compartment came away from the mid-fuselage as the wreckage slid 850 feet along the ground and twisted to the right. The rear sections of the airplane remained largely intact. The elevation at the crash site was approximately 700 feet. Mr. W. Doggett witnessed the bail-out and crash from his home on Route 1 near Joshua. The B-36B impacted about 2-1/2 miles north of his house. He drove to the crash site in his pickup truck and helped the surviving crew members to regroup. Four minute after the crash, McCullough and Boeten in DC-3, N342 reported that two Navy aircraft were circling the wreckage. The wreckage smoldered for about eight minutes before a fire broke out in the number-six engine. The 15,000 gallons of remaining fuel consumed the forward fuselage and wings. The civilians and crew members were driven away from the crash site by exploding ammunition and the knowledge of the presence of 1,500 pounds of bombs aboard the airplane. Three helicopters arrived at the scene within an hour and twenty minutes of the crash.\nSource : http://www.air-and-space.com/b-36 wrecks.htm#44-92035", "probable_cause": "It was felt that a conventional cable-driven, back-up mixture control system would have prevented this accident."}