{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-5-dk-skytrain-rosieres-en-haye-afb", "date": "May 9, 1945 at 0804 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "USAAF", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "14696/26141", "yom": 1944, "flight_number": null, "city": "Toul-Rosières AFB (ex ALG A-98 Rosière en Haye)", "zone": "Meurthe-et-Moselle", "country": "France", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": 126, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Chronic drainage problems had left the runway uneven. A steady rise in the first 2,500 feet led a drop extending over the next 1,000 feet, creating a hump at the transition. Over the crest of the rise the runway also slanted to the left. Though challenging, 12 other planes in the formation had taken off successfully. This plane (#13) made it’s takeoff run straying somewhat left of center. On passing over the rise it became airborne. But with airspeed of 87-90 mph they began gear retraction. At this time they encountered propwash. There was also a mild crosswind blowing it left. Control was lost and the left wing dipped into contact with the ground, spinning the plane 135 degrees. It came to rest in this attitude and immediately started to burn, 50 yards west of runway, approx. 630 feet past mid-runway. It was ferrying 700 gallons (6160 lbs) of gasoline in its fuselage. Four crew members exited via the top escape hatch. The radio operator exited through the compartment door. Only he escaped injury. The others had minor injuries. Since the copilot is known to have sustained burns to his hands during escape this is likely one injury common among the other four.\r\nCrew:\r\n2nd Lt Abraham R. Silver, pilot,\r\n2nd Lt Robert E. Smith, copilot,\r\nCpl Arthur H. Niehoff, radio operator,\r\nS/Sgt Chester R. Somber, crew chief,\r\n1st Lt Ruth Cannon, army nurse.\n", "probable_cause": "It is the opinion of the investigating committee that pilot error was the major cause of the accident. The plane did not follow a true course down the runway and did not have enough flying speed to remain airborne in propwash. The gear was in the process if being retracted. However, the runway has a definite hump at approximately the point that loaded C-47 type aircraft normally become airborne, the runway definitely slopes to the left and the pilot had a slight crosswind from the right. It is felt that these factors did contribute to the accident in a minor degree but all other planes of this squadron took off under the same conditions without mishap.\r\nContributing factors: \r\n- Faulty runways,\r\n- Propwash,\r\n- Unfavorable winds. "}