{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-red-lake-5-killed", "date": "Nov 10, 2013 at 1829 LT", "type": "Swearingen SA227 Metro III", "operator": "Bearskin%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sioux Lookout - Red Lake", "msn": "AC-785B", "yom": 1991, "flight_number": "BLS311", "city": "Red Lake", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 5150, "captain_hours_type": 3550, "copilot_hours": 2200, "copilot_hours_type": 1060, "aircraft_hours": 35474, "circumstances": "Flight from Sioux Lookout was uneventful till the final descent to Red Lake completed by night and in light snow with a ceiling at 2,000 feet and visibility 8 SM. On final approach to runway 26, crew reported south of the airport and declared an emergency. Shortly after this mayday message, aircraft hit power cables and crashed in flames in a dense wooded area located 800 meters south of the airport. Two passengers seating in the rear were seriously injured while all five other occupants including both pilots were killed.", "probable_cause": "A first-stage turbine wheel blade in the left engine failed due to a combination of metallurgical issues and stator vane burn-through. As a result of the blade failure, the left engine continued to operate but experienced a near-total loss of power at approximately 500 feet above ground level, on final approach to Runway 26 at the Red Lake Airport. The crew were unable to identify the nature of the engine malfunction, which prevented them from taking timely and appropriate action to control the aircraft. The nature of the engine malfunction resulted in the left propeller being at a very low blade angle, which, together with the landing configuration of the aircraft, resulted in the aircraft being in an increasingly high drag and asymmetric state. When the aircraft’s speed reduced below minimum control speed (VMC), the crew lost control at an altitude from which a recovery was not possible."}