{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-ontario", "date": "Jun 10, 2010 at 1627 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Theodore Joseph Poelking", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Santa Monica – Lake Havasu", "msn": "46-8508105", "yom": 1985, "flight_number": null, "city": "Ontario", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 850, "captain_hours_type": 1, "copilot_hours": 5735, "copilot_hours_type": 192, "aircraft_hours": 4803, "circumstances": "The pilot was conducting a cross-country flight with a certified flight instructor (CFI). During the climb-to-cruise phase of the flight, as the airplane was ascending through 16,000 feet mean sea level (msl), the pilot noticed a reduction in manifold pressure. He advanced the throttle and observed an increase of one or two inches of manifold pressure. Shortly thereafter, the pilot heard a loud bang originate from the engine followed by an immediate loss of engine power. The pilot and CFI attempted to troubleshoot the engine anomalies and noted that it seemed to respond with the low boost \"on\", however it began to run rough whenever the throttle was advanced more than half way. They diverted to a nearby airport and conducted an emergency descent. As the airplane approached the airport, the pilot descended through an overcast cloud layer and attempted to enter the airport traffic pattern. While on final approach to the airport, the pilot thought the airplane was high and extended the landing gear and applied flaps. Shortly thereafter, the airspeed and altitude decreased drastically and the pilot realized he was too low. The pilot applied throttle and noticed no change in engine performance. The airplane subsequently struck a fence and landed hard in an open field just short of the airport, which resulted in structural damage to the fuselage and wings. A postaccident examination of the engine revealed that the induction elbow for cylinders 1-3-5 (right side) was displaced from the throttle and metering assembly where the elbow couples with the throttle and metering assembly by an induction hose and clamp. The clamp was secure to the induction hose, however, the portion of the clamp that should have been installed\r\nbeyond the retention bead on the throttle and control assembly was observed on the inboard side of the bead on the induction elbow. Review of the aircraft maintenance logbooks revealed that cylinders 4 and 5 were recently replaced prior to the accident flight due to low compression. The replacement of these cylinders required removal of the induction system to allow for cylinder removal and installation. In addition, a manufacturer service bulletin stated that during the reinstallation of the induction system, one must slide the induction hose and clamp(s) onto one of the tubes to be joined and that the connection joint and both tube beads are to be positioned in the center of the induction hose. The clamps should be installed in a position centered between the tubing bead and end of the induction hose.", "probable_cause": "A loss of engine power due to the in-flight separation of the 1-3-5 cylinder induction tube elbow, which was caused by the improper installation of the induction tube elbow by maintenance personnel."}