{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-near-saint-george-1-killed", "date": "Jun 30, 2009 at 0708 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Logan Investments of Nevada", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "North Las Vegas – Cedar City", "msn": "46-36400", "yom": 2006, "flight_number": null, "city": "Saint George", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 782, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Radar data indicated that the airplane departed for a cross-country flight, climbed to a cruise altitude of 9,700 feet msl, and maintained a northeasterly course of 050 degrees magnetic direct to its destination. About 11 minutes after takeoff, the airplane entered a 1,000 foot-per-minute descent. The airplane continued to descend at this rate until it impacted terrain at an elevation of 4,734 feet. Examination of the accident site revealed that the airplane was still on its northeasterly course towards the destination at impact. Ground scars at the initial point of impact were consistent with the airplane being wings level in a slight nose-down pitch attitude. No mechanical anomalies with the airplane or engine were identified during the airplane wreckage examination. A postimpact fire destroyed all cockpit instrumentation, and no recorded or stored flight data could be recovered. Weather conditions at the time were clear, and light winds. The pilot had some moderate heart disease that was noted during the autopsy. He also had a history of stress and insomnia, which was documented in his FAA medical records. Toxicology findings noted the use of a sedating and impairing over-the-counter medication (chlorpheniramine) that was taken at some undetermined time prior to the accident. The investigation could not conclusively determine whether the pilot’s conditions or medication use were related to the accident. The reason for the airplane’s descent to ground impact could not be determined.", "probable_cause": "The pilot's failure to maintain terrain clearance during descent for undetermined reasons."}