{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-10-dc-skymaster-hugoton", "date": "Mar 26, 1952 at 1730 LT", "type": "Douglas C-54 Skymaster", "operator": "Braniff-International-Airways-1", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Denver – Colorado Springs – Oklahoma City – Dallas", "msn": "10336", "yom": 1944, "flight_number": "BN065", "city": "Hugoton", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 45, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10271, "captain_hours_type": 359, "copilot_hours": 2797, "copilot_hours_type": 95, "aircraft_hours": 11679, "circumstances": "Braniff Airways' Flight 65 departed Denver, Colorado, at 1535 on March 26, 1952, for Dallas, Texas, with intermediate stops scheduled at Colorado Springs, Colorado, and Oklahoma City, Oklahoma. The crew consisted of Captain J. W. Stanford, First Officer J. P. Beakley, and Hostesses Dorothy Currey and Betty Murphy. The flight arrived at Colorado Springs after a routine trip and departed there at 1620. On departure it was cleared IFR (Instrument Flight Rules) direct to LaJunta, Colorado, and then by Red Airway 35 to Garden City, Kansas, and Red Airway 59 to Oklahoma City; to cruise at 8,000 feet to LaJunta, and to descend and maintain 7,000 feet from LaJunta to Oklahoma City. According to company records, the gross weight of the aircraft was within approved limits and the load was properly distributed. At 1653 the flight reported over LaJunta at 8,000 feet, descending to 7,000. Four minutes later, at 1657, the flight canceled its IFR flight plan and advised that it was proceeding VFR (Visual Flight Rules) direct to Oklahoma City via Liberal, Kansas. When in the vicinity of Hugoton, Kansas, at approximately 6,000 feet MSL, (3000 feet above the ground), one of the hostesses advised the crew that the right wing was on fire. This was the first indication the crew had that anything was wrong, as the fire-warning signal devices had not functioned and all engines appeared to be operating in a normal manner. The captain immediately looked through the small window in the forward cargo loading door on the right and saw a brilliant red reflection on the inboard surface of the No. 4 engine nacelle. Because of the brilliance of the reflection and the fact that it covered the entire visible portion of this nacelle, he believed the fire was of considerable proportion. He immediately asked the copilot where the fire was and was advised that he thought it was No. 3. The captain then decided to land as quickly as possible on a small airport near Hugoton which he had seen only a few seconds before the hostess came to the cockpit. Accordingly, the hostess was told to advise the passengers that an emergency landing was to be made, and the \"Fasten seat belt\" and \"No smoking\" signs were turned on. The captain then disengaged the autopilot, closed the throttle of the No. 3 engine, put the mixture control at idle cutoff, closed the fuel selector valve, and set the propeller control at the full high pitch position. Following this, he dived the aircraft in an attempt to extinguish the fire and to lose altitude. At this time the copilot asked the captain if he wanted the No. 3 engine's propeller feathered, and the captain said, \"No.\" When an air speed of approximately 230 miles per hour was reached, power was reduced on the remaining three engines. During the dive the aircraft was heading in a southeasterly direction, and after a short time the dive was decreased and a steep left turn was made to a westerly heading. When the air speed decreased to approximately 200 miles per hour, the captain pulled the No. 3 fire extinguisher selector valve control handle (this also operates the fire wall shutoff valves), and then pulled the discharge handle of the left CO 2 bottle. When this bottle was discharged, the reflection on the No. 4 engine nacelle was observed to diminish appreciably. The captain said that at this time he thought he asked the copilot to discharge the right CO 2 bottle; however, this bottle was not discharged. The landing gear was lowered, and power was resumed on the three remaining engines. About this time the fire warning light in the cockpit came on, and the bell rang. These warning signals continued to operate intermittently. As soon as the gear was down, the descent was steepened and a series of steep slipping \"S\" turns were made toward the north while approaching the airport. At an altitude of approximately 200 to 300 feet above the ground, a pronounced buffeting (similar to that which accompanies a near stalling attitude) was experienced. This buffeting was so pronounced it was difficult to control the aircraft; however, it soon stopped and normal control was again resumed. When the buffeting occurred, the indicated air speed was approximately 150 mph. It is believed that the No. 3 engine fell from the aircraft at this time. The captain next called for full flaps. Although the copilot immediately executed this command, no apparent effect of the flaps being lowered was noticed by the crew, and a few seconds later, the aircraft touched down in the middle of the airport. The captain applied brake pressure immediately, but the aircraft did not decelerate. Approaching the north boundary of the field, the captain tried to turn left to avoid crossing a road which was adjacent to the airport, but the nose steering wheel was inoperative. Left rudder was immediately applied; however, the aircraft responded so quickly to this action that right rudder had to be applied at once to keep the aircraft from ground looping. After the aircraft was gain rolling straight, the captain pulled back on the wheel, causing the nose wheel to life from the ground, and the aircraft rolled beyond the airport boundary across a highway, through two fences and a ditch, and came to rest in a wheat field. All of the occupants were evacuated in an orderly manner, some through the forward compartment and main cabin doors by using descent ropes and a few by means of an emergency exit located on the left side of the aircraft.", "probable_cause": "The Board determines that the probable cause of this accident was an uncontrollable engine fire of unknown origin which necessitated an immediate landing. The following findings were pointed out:\r\n- A fire in the No. 3 engine nacelle, which necessitated an immediate landing, was observed when the aircraft was in the vicinity of Hugoton, Kansas,\r\n- When the aircraft was approximately 300 feet above the ground the No. 3 engine fell from the aircraft,\r\n- The fire-detection system did not function properly,\r\n- A safe landing was made on a small airport which was unsuitable for DC-4 aircraft."}