{"url": "https://www.baaa-acro.com/crash/crash-miles-m60-marathon-t11-calne-5-killed", "date": "Sep 30, 1954 at 1145 LT", "type": "Miles M.60 Marathon", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Thorney Island – Cosham – Bude – Trowbridge – Northampton – Spalding – Petersfield – Thorney Island", "msn": "124", "yom": 1950, "flight_number": null, "city": "Calne", "zone": "Wiltshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine airplane left RAF Thorney Island at 0944LT on a navigation exercice via Cosham, Bude, Trowbridge, Northampton, Spalding, Petersfield and back to Thorney Island at an assigned altitude of 6,000 - 7,000 feet. Enroute, the aircraft went out of control and entered a dive. Passing through the clouds, apparently at an altitude of 1,000 feet, both outer wings separated. At 300 feet, the aircraft made a last turn to the right before crashing in a near vertical position in a field. The aircraft was destroyed and all five crew occupants were killed. \r\nCrew:\r\nSgt Henry P. S. Fowler, pilot,\r\nP/O James Henry Hurlstone Green, staff navigator,\r\nF/O Eric Arthur Dench, student navigator,\r\nP/O Sumair Persad, student navigator.\r\nPassenger: \r\nSgt Gordon H. E. Davies, air gunner.\r\nSource & photos: http://f-86.tripod.com/xa271.htm", "probable_cause": "The accident was caused by a structural failure of the outer wings. From the sound of the break-up, heard by witnesses as one explosion, and the small area covered by the pieces of wing, the Court considers that both wings failed simultaneously as a result of over-stressing due to the application of positive “G”. The Court was unable to determine any reasons why the aircraft should have got into such a position that the pilot had to over-stress it in recovering. The following circumstances were considered:\r\n- The pilot obtained a bearing from Thorney Island at 1040Z (11.40 am local), five minutes before the aircraft was seen to break up. The Navigator had done 2 minutes work on his chart since 1040Z,\r\n- No emergency calls were received from the aircraft, nor was the VHF on an emergency frequency,\r\n- The height at which the wings broke up was about 1,000 feet. The aircraft could have been visible in the broken cloud to the 5th witness (Mr Comley) at that height, and the time taken for the noise of the explosion to reach the 7th witness (AC/2 Morgan), who was about a mile away [but actually more like 1½ miles], some 5 to 6 seconds, would also indicate that it broke up at this height,\r\n- Comparatively light stick forces at speed can lead to over-stressing the aircraft. This fact is contained in the Pilot’s Order Book at Thorney Island,\r\n- The crash occurred on the southern edge of Airway Green 1. The pilot had not cleared through this airway,\r\n- The cloud conditions at and around 5,000 feet were changeable. It appears from the evidence that in the Calne/Lyneham area both before and after the time Sgt Fowler was approaching, an aircraft would have been in the clear, but perhaps not VFR 500 feet above the cloud tops,\r\n- The measurements of the rudder and elevator trim tab actuators taken at the scene of the crash were set up on another Marathon aircraft and this showed that the rudder trim setting was neutral and the elevator trim setting normal,\r\n- The pilot was very conscientious and had no medical history of disease or injury,\r\n- The freezing level was at 9,000 feet,\r\n- Sgt Fowler’s injuries indicated that he was in the pilot’s seat at the time of impact with the ground.\n\r\nWith the above considerations in mind the court deliberated the following possibilities:\r\n- The pilot lost control during a sudden descent to get under Airway Green 1, and allowed the airspeed to build up to such a figure that only a light stick force on pulling out was necessary to break off the wings,\r\n- The pilot performed a violent maneuver to avoid another aircraft resulting in a steep dive in cloud. No military or civil aircraft were in Airway Green 1 below 9,000 feet at this time,\r\n- There was a failure or jamming of the elevator controls. The control wires will be examined by AIB when they get the wreckage to Croydon and can open up the telescoped portion,\r\n- Instrument failure, causing the pilot to lose control and exceed the limits of the aircraft,\r\n- One or more engines failed, resulting in subsequent loss of control. It is considered that if the aircraft had been under asymmetric power it would have crashed on its initial dive and it is unlikely that the rudder trim tab would have been neutral. The Court does not consider that the engine smoke reported by two of the witnesses has any significance and was most likely caused by the pilot using his throttles in an endeavour to maintain lateral control,\r\n- Unaccountable illness of the pilot. This is not borne out by his medical history or by the people who knew his habits."}