{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-c-guildford-1-killed", "date": "Aug 15, 1993 at 0805 LT", "type": "Piper PA-31-310 Navajo", "operator": "Stapleford Tawney Air Taxis", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Plain, Valley", "schedule": "Stapleford – Southampton – Cambridge – Berlin", "msn": "31-79", "yom": 1979, "flight_number": "STL819", "city": "Guildford", "zone": "Surrey", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1493, "captain_hours_type": 15, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot departed Stapleford on a positioning flight to Southampton. He was due to pick up passengers at Southampton and fly to Cambridge where more passengers were to be collected; from Cambridge he would fly to Berlin. Heathrow Approach frequency was fairly busy but by 0653LT, G-SEAS had been identified, and been cleared direct to Ockham not above 2,000 feet on QNH 1011 mb; this clearance was acknowledged by the pilot. The radar recording confirmed the track of STL819 to Ockham and from there the aircraft made a gentle turn onto a track of approximately 185°T; all three radars confirmed the aircraft speed as approximately 160 knots and at a level altitude of 1,500 feet amsl until a few seconds before 0705LT. At that point the aircraft started a high rate of descent with increasing speed but maintaining a fairly constant southerly track. Radar contact was lost 2.6 seconds after 0705LT. The last radar contact was within 250 metres of the crash site and at that point the aircraft was at 1,000 feet amsl, the crash site is approximately 400 feet amsl. ", "probable_cause": "Investigations were unable to determine the exact cause of the accident. Nevertheless, the assumption that the loss of control was the consequence of an autopilot failure was not ruled out. "}