{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-6c-h2-turbo-porter-near-port-alsworth-1-killed", "date": "Oct 28, 2016 at 1828 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "Highland Air", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Anchorage – Port Alsworth", "msn": "2068", "yom": 1975, "flight_number": null, "city": "Port Alsworth", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6400, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The commercial pilot was conducting a cross-country flight to a family residence in the turbinepowered, single-engine airplane. The pilot was familiar with the route, which traversed a mountain pass and remote terrain. Before departing on the flight, the pilot communicated with a family member at the residence via text messages and was aware the weather was windy but that the mountain tops were clear. There was no record of the pilot obtaining a preflight weather briefing from an official, accesscontrolled source, and the pilot indicated to a friend before departure that he had not accessed weather cameras. Weather forecast products that were available to the pilot revealed possible turbulence at low altitudes and icing at altitudes above 12,000 ft along the route of flight, and weather cameras along the planned route and near the destination would have indicated deteriorating visibility in snow showers and mountain obscuration starting about 1.5 hours before departure. The airplane departed and proceeded toward the destination; radar data correlated to the accident flight indicated that the airplane climbed from 4,600 ft to 14,700 ft before turning west over the mountains. Text messages that the pilot sent during the initial climb revealed that the mountain pass he planned to fly through was obscured, and he intended to climb over the mountains and descend through holes in the clouds as he neared the destination. Radar data also indicated that the airplane operated above 12,500 ft mean sea level (msl) for about 30 minutes, and above 14,000 msl for an additional 14 minutes before entering a gradual descent during the last approximate 20 minutes of flight. Review of weather information indicated that cloud layers over the accident area increased during the 30 minutes before the accident, and it is likely that the airplane was operating in icing conditions, although it was not certified for flight in such conditions, which may have resulted in structural or induction icing and an uncontrolled loss of altitude. The airplane wreckage came to rest on the steep face of a snow-covered mountain in a slight nose-down, level attitude. The empennage was intact, the right wing was completely separated, and the forward fuselage and cockpit were partially separated and displaced from the airframe with significant crush damage, indicative of impact with terrain during forward flight.  Page 2 of 10 ANC17FA004 There was no indication that the airplane was equipped with supplemental oxygen; pilots are required to use oxygen when operating at altitudes above 12,500 ft for more than 30 minutes, and anytime at altitudes above 14,000 ft. It could not be determined if, or to what extent, the pilot may have experienced symptoms of hypoxia that would have affected his decision-making. The airplane wreckage was not recovered or examined due to hazardous terrain and environmental conditions, and the reason for the impact with terrain could not be determined; however, it is likely that deteriorating enroute weather and icing conditions contributed to the outcome of the accident. ", "probable_cause": "The airplane's collision with mountainous terrain while operating in an area of reduced visibility and icing conditions. Contributing to the accident was the pilot's inadequate preflight planning, which would have identified deteriorating weather conditions along the planned route of flight. "}