{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-90-30-hualien", "date": "Aug 24, 1999 at 1236 LT", "type": "McDonnell Douglas MD-90", "operator": "Uni%20Air.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Taipei - Hualien", "msn": "53536", "yom": 1996, "flight_number": "UNI873", "city": "Hualien", "zone": "Hualien County (花蓮縣)", "country": "Taiwan", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 90, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6532, "captain_hours_type": 1205, "copilot_hours": 5167, "copilot_hours_type": 96, "aircraft_hours": 4929, "circumstances": "As the MD-90 touched down following a 25-minute flight from Taipei, there was a loud noise from the front of the cabin and thick black smoke poured from one of the overhead luggage compartments on the right hand side of the plane. Insulation and charred luggage littered the runway. Passengers were swiftly evacuated, but it took firefighters more than half an hour to control the fire. Twenty-eight people were injured. Preliminary investigation reports in 1999 indicated that the blast was caused by two bottles of household bleach. However, the Hualien District Court judges decided the bottles contained gasoline. According to the judges, Ku Chin-shui had put the gasoline into two plastic bleach bottles and gave them to his nephew. The gasoline leaked during the flight and exploded when it caused a short-circuit in a motorbike battery in a nearby overhead luggage compartment. In July 2003 Ku appealed a seven-and-a-half-year prison term. Considering the prosecutor's case against Ku to be full of holes, the Supreme Court ordered a retrial.", "probable_cause": "A flammable liquid (gasoline) inside bleach and softener bottles and sealed with silicone was carried on board the aircraft. A combustible vapor formed as the leaking gasoline filled the stowage bin, and the impact of the landing aircraft created a short in a battery. The short ignited the gasoline vapor and created the explosion. Contributing factors to the accident were: \r\n- The Civil Aeronautical Administration Organic Regulations and its operational bylaws fail to designate any entity as responsible for hazardous materials; \r\n- The Aviation Police fail to properly recruit and train personnel, to include preparing training materials and evaluating training performance. Some new recruits were found to have not received any formal security check training, but instead were following instructions from senior inspectors. Consequently, new inspectors cannot be relied upon to identify hazardous materials; \r\n- The detectors and inspectors failed to detect the hazardous materials. The detectors used by the Aviation Police did not detect the banned motorcycle batteries, nor did security inspectors detect the liquid bleach, a banned corrosive substance."}