{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-near-naches-10-killed", "date": "Oct 7, 2007 at 1959 LT", "type": "Cessna 208B Grand Caravan", "operator": "Kapowsin%20Air%20Sports", "flight_phase": "Flight", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "Mountains", "schedule": "Star - Shelton", "msn": "208B-0415", "yom": 1995, "flight_number": null, "city": "Naches", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 2054, "captain_hours_type": 296, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9604, "circumstances": "The pilot was returning a group of skydivers to their home base after a weekend of skydiving. He flew several jump flights, and then stopped early in the afternoon to prepare the airplane for the flight home. The flight was planned into an area of clouds, turbulence, and icing, which the pilot had researched. He delayed the departure until he decided that he could complete the planned flight under visual flight rules (VFR). The accident occurred at night with little illumination of the moon, and the airplane was in an area of layered clouds. A detailed analysis of the weather conditions revealed that the flight probably encountered broken to overcast layers both below and above its flight altitude. The satellite and sounding images suggested that it was possibly in an area of mountain wave conditions, which can enhance icing. The recorded radar data indicated that the pilot was likely maneuvering to go around, above, or below rain showers or clouds while attempting to maintain VFR. The airplane likely entered clouds during the last 3 minutes of flight, and possibly icing and turbulence. It was turning when it departed from controlled flight, and a performance study showed that the angle-of-attack at this point in the flight was increasing rapidly. The study determined that the\r\ndeparture from controlled flight was consistent with an aerodynamic stall. The unpressurized airplane was flying at over 14,000 feet mean sea level for more than 1 hour during the flight. It reached 15,000 feet just prior to the accident in sequential 360-degree turns while climbing and descending. Supplemental oxygen was not being used. At these altitudes, the pilot would be substantially impaired by hypoxia, but would have virtually no subjective symptoms, and would likely be unaware of his impairment. The pilot had logged over 2,000 hours of total flight time, with nearly 300 hours in this make and model of airplane. He was instrument rated, but had only logged a total of 2 hours of actual instrument flight time. Company policy was to fly under visual flight rules only, and they had not flight-checked the pilot for instrument flight.", "probable_cause": "The pilot's failure to maintain an adequate airspeed to avoid an aerodynamic stall while maneuvering. Contributing to the accident were the pilot's impaired physiological state due to  hypoxia, the pilot's inadequate preflight weather evaluation, and his attempted flight into areas of known adverse weather. Also contributing were the pilot's inadvertent flight into instrument meteorological conditions that included clouds, turbulence, and dark night conditions."}