{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-king-air-c90a-candido-mota-5-killed", "date": "Feb 3, 2013 at 2030 LT", "type": "Beechcraft 90 King Air", "operator": "Z. Air Investimentos e Participações", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Maringá – São Paulo", "msn": "LJ-1647", "yom": 2001, "flight_number": null, "city": "Cândido Mota", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": 441, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3137, "circumstances": "The twin engine aircraft departed Maringá Airport at 1837LT on a flight to São Paulo, carrying four passengers and one pilot. 35 minutes into the flight, about five minutes after he reached its assigned altitude of 21,000 feet, the aircraft stalled and entered an uncontrolled descent. The pilot was unable to regain control, the aircraft partially disintegrated in the air and eventually crashed in a flat attitude in a field. The aircraft was destroyed and all five occupants were killed. ", "probable_cause": "The following findings were identified:\r\n- The lack of a prompt identification of the aircraft stall by the captain may have deprived him of handling the controls in accordance with the prescriptions of the aircraft emergency procedures, contributing to the aircraft entry in an abnormal attitude.\r\n- The captain’s attention was focused on the passengers sitting in the rear seats, in detriment of the flight conditions under which the aircraft was flying. This had a direct influence on the maintenance of a poor situational awareness, which may have made it difficult for the captain to immediately identify that the aircraft was stalling.\r\n- There was complacency when the copilot functions were assumed by a person lacking due professional formation and qualification for such. Even under an adverse condition, the prescribed procedure was not performed, namely, the use of the aircraft checklist.\r\n- The fact that the aircraft was flying under icing conditions was confirmed by a statement of the female passenger in the cockpit (CVR). The FL210 (selected and maintained by the captain) gave rise to conditions favorable to severe icing on the aircraft structure. If the prevailing weather conditions are correlated with reduction of speed (attested by the radar rerun), the connection between loss of control in flight and degraded aircraft performance is duly established.\r\n- The rotation of the aircraft after stalling may have contributed to the loss of references of the captain’s balance organs (vestibular system), making it impossible for him to associate the side of the turn made by the aircraft with the necessary corrective actions.\r\n- The non-adherence to the aircraft checklists on the part of the captain, in addition to the deliberate adoption of non-prescribed procedures (disarmament of the starter and “seven killers”) raised doubts on the quality of the instruction delivered by the captain. \r\n- The captain made an inappropriate flight level selection for his flight destined for São Paulo. Even after a higher flight level was offered to him, he decided to maintain FL 210. Also, after being informed about icing on the aircraft, he did not activate the Ice Protection System, as is expressly determined by the flight manual.\r\n- The captain had the habit of making use of a checklist not prescribed for the aircraft, and this may have influenced his actions in response to the situation he was experiencing in flight.\r\n- His recently earned technical qualification in the aircraft type; his inattention and distraction in flight; his attitude of non-compliance with operations and procedures prescribed in manuals; all of this contributed to the captain’s poor situational awareness. \r\n- The flight plan was submitted via telephone. Therefore, it was not possible to determine the captain’s level of awareness of the real conditions along the route, since he did not report to the AIS office in SBMG. In any event, the selection of a freezing level for the flight, considering that the front was moving along the same proposed route, was indication of inappropriate planning.\r\n- The investigation could neither determine the whole experience of the aircraft captain, nor whether his IFR flight experience was sufficient for conducting the proposed flight, since he made decisions which went against the best practices, such as, for example, selecting a flight level with known icing.\r\n- With a compromised situational awareness, the pilot failed to correctly interpret the information available in the aircraft, as well as the information provided by the female passenger sitting in the cockpit, and he chose to maintain the flight level under inadequate weather conditions.\r\n- The lack of monitoring/supervision of the activities performed by the captain allowed that behaviors and attitudes contrary to flight safety could be adopted in flight, as can be observed in this occurrence.\r\n- Apparently, there was lack of an effective managerial supervision on the part of the aircraft operator, with regard to both the actions performed by the captain and the correction of the aircraft problems."}