{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-kibeni-3-killed", "date": "Nov 25, 2013 at 1340 LT", "type": "Cessna 208B Grand Caravan", "operator": "Tropicair", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Kamusi – Purari – Vailala – Port Moresby", "msn": "208B-1263", "yom": 2007, "flight_number": null, "city": "Kibeni", "zone": "Gulf", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2200, "captain_hours_type": 800, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 25 November 2013, a Cessna Aircraft Company C208B Grand Caravan, registered P2-SAH and operated by Tropicair, departed Kamusi, Western Province, for Purari River, Gulf Province, at 0312 UTC on a charter flight under the instrument flight rules (IFR). There were 10 persons on board; one pilot and nine passengers . Earlier in the day, the aircraft had departed Port Moresby for Kamusi from where it flew to Hivaro and back to Kamusi before the accident flight. SAH was due to continue from Purari River to Vailala and Port Moresby. The pilot reported that the takeoff and climb from Kamusi were normal and he levelled off at 9,000 ft and completed the top-of-climb checklist. Between Kamusi and Purari River the terrain is mostly flat and forest covered, with areas of swampland and slow-moving tidal rivers. Habitation is very sparse with occasional small villages along the rivers. The pilot recalled that the weather was generally good in the area with a cloud base of 3,000 ft and good visibility between build-ups. The pilot reported that approximately 2 minutes into the cruise there was a loud ‘pop’ sound followed by a complete loss of engine power. After configuring the aircraft for best glide speed at 95 kts, the pilot turned the aircraft right towards the coast and rivers to the south, and completed the Phase-1 memory recall items for engine failure in flight. He was assisted by the passenger in the right pilot seat who switched on the Emergency Locator Transmitter (ELT) and at 0332 broadcast MAYDAY due engine failure on the area frequency. Checking the database in the on-board Global Positioning System (GPS), the pilot found the airstrip at Kibeni on the eastern side of the Palbuna River. The pilot, assisted by the passenger next to him, tried unsuccessfully to restart the engine using the procedure in the aircraft’s Quick Reference Handbook (QRH). The passenger continued to give position reports and to communicate with other aircraft. At about 3,000 ft AMSL the pilot asked for radio silence on the area frequency so he could concentrate on the approach to Kibeni airstrip, flying a left hand circuit to land in a south westerly direction. He selected full flaps during the final stages of the approach, which arrested the aircraft’s rate of descent, but the higher than normal speed of the aircraft during the approach and landing flare caused it to float and touch down half way along the airstrip. The disused 430 metre long Kibeni airstrip was overgrown with grass and weeds. It was about 60 ft above the river and 120 ft above mean sea level, with trees and other vegetation on the slope down to the river. The aircraft bounced three times and, because the aircraft’s speed had not decayed sufficiently to stop in the available length, the pilot elected to pull back on the control column in order to clear the trees that were growing on the slope between the airstrip and the river. The aircraft became airborne, impacting the crown of a coconut palm (that was almost level with the airstrip) as it passed over the trees. The pilot banked the aircraft hard left in an attempt to land/ditch along the river and avoid trees on the opposite bank. He then pushed forward on the control column to avoid stalling the aircraft and levelled the wings before the aircraft impacted the water.  The aircraft came to rest inverted with the cockpit and forward cabin submerged and immediately filled with water. After a short delay while he gained his bearings under water, the pilot was able to undo his harness and open the left cockpit door. He swam to the rear of the aircraft, opened the right rear cabin door, and helped the surviving passengers to safety on the river bank. He made several attempts to reach those still inside the aircraft. When he had determined there was nothing further he could do to reach them, he administered first aid to the survivors with materials from the aircraft’s first aid kit. After approximately 20 minutes, villagers arrived in a canoe and transported the pilot and surviving passengers to Kibeni village across the river. About 90 minutes after the accident, rescuers airlifted the survivors by helicopter to Kopi, located 44 km north east of Kibeni.", "probable_cause": "The engine power loss was caused by the fracture of one CT blade in fatigue, which resulted in secondary damage to the remainder of the CT blades and downstream components. The fatigue originated from multiple origins on the pressure side of the blade trailing edge. The root cause for the fatigue initiation could not be determined with certainty. All other damages to the engine are considered secondary to the primary CT blades fracture."}