{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226ac-metro-ii-hartford-2-killed", "date": "Aug 17, 1993 at 0225 LT", "type": "Swearingen SA226 Metro II", "operator": "Aviation Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Farmingdale - Hartford", "msn": "AC-231", "yom": 1977, "flight_number": null, "city": "Hartford-Brainard", "zone": "Connecticut", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4200, "captain_hours_type": 600, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16710, "circumstances": "On an approach to land at the destination, the second-in-command (sic) was flying the airplane. The plane touched down with the landing gear retracted, and the propeller blades contacted the runway. The sic initiated a go-around (aborted landing). Witnesses saw the airplane in a steep left bank just before impact in a river next to the airport. Propeller strikes on the runway extended 380 feet, indicating a touchdown speed of 96 knots. The last propeller strikes on the right side indicated a speed of 86 knots. The last strikes on the left side indicated a slowing propeller. Published VMC for the airplane was 94 knots. The CVR tape revealed the crew completed a descent arrival check, performed an incomplete approach briefing, and did not perform a before landing check. The CVR revealed no sound of a gear warning horn. Company personnel stated that the circuit breaker for the warning horn had been found pulled at the completion of previous flights by other crew; this was to prevent a warning horn from sounding during a high rate of descent. Both pilots were killed. ", "probable_cause": "Failure of the copilot (second-in-command) to follow the checklist, assure the gear was extended for landing and attain or maintain adequate airspeed (VMC); and failure of the pilot-in-command (pic) to properly supervise the flight and take sufficient remedial action."}