{"url": "https://www.baaa-acro.com/crash/crash-raytheon-390-premier-i-north-las-vegas", "date": "May 27, 2004 at 1557 LT", "type": "Raytheon 390 Premier I", "operator": "Raytheon", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Palm Springs - North Las Vegas", "msn": "RB-10", "yom": 2002, "flight_number": null, "city": "North Las Vegas", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9200, "captain_hours_type": 62, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane overran the runway after landing on runway 7. The passenger stated that he felt that the approach was \"fast\" and that the pilot was \"behind the power curve\" because of high\r\nminimum en route altitudes in the area and that they had to \"hustle down\" during the descent. The passenger indicated that the flight crossed the runway threshold \"maybe a bit more\" that 10 knots above Vref and touched down about 10 knots above Vref. He said it was not a stabilized approach. Landing distance calculations and other evidence suggest that the lift dump panels did not extend after landing; however, the investigation did not determine the reason(s) for the lack of lift dump. No evidence was found of any failures affecting the lift dump or braking systems. Evidence and interview statements reveal that the pilot flew an unstabilized approach to the runway and landed well above target speed. The high landing speed was result of the pilot's excessive airspeed on the approach and a tailwind component of about 8 knots. Although the pilot landed the airplane within the touchdown area, the airplane's speed upon touchdown was about 17 knots above the prescribed speed. The flight's unstabilized approach and excessive speed should have prompted the pilot to initiate a missed approach. ", "probable_cause": "The flight's unstabilized approach and excessive speed. Contributing to the excessive touchdown speed was the presence of a tailwind at landing."}