{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-near-seymchan-5-killed", "date": "Aug 13, 1950 at 1050 LT", "type": "Lisunov LI-2", "operator": "MVD", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Pevek – Zyrianka", "msn": "5908", "yom": 30, "flight_number": null, "city": "Seymchan", "zone": "Magadan oblast", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 706, "circumstances": "The crew was performing a cargo flight from Pevek to Zyrianka, carrying a crankshaft and others spare parts for an LM-3 locomotive for a total weight of 1,000 kilos. The airplane left Pevek at 0410LT bound for Zyrianka but upon  arrival, the crew was informed by ground that the airport was closed to traffic and has to divert to Seymchan Airport. The pilot modified his route to Seymchan but did not receive any information about weather conditions at destination. After continuing at an altitude of 3,300 meters, the crew encountered poor weather upon arrival in Seymchan and was unable to locate the airport. After an unsuccessful attempt to land, the crew continued to the north and was eventually forced to make an emergency landing as the aircraft was short of fuel. The airplane crashed in a rocky canyon located 72 km northwest of Seymchan and was destroyed upon impact. All five crew members were killed.  ", "probable_cause": "The accident was caused by the combination of the following factors: \r\n- The visibility was less than 100 meters at the time of the accident due to snow falls, \r\n- The copilot was inexperienced, \r\n- Wrong decision in diverting the aircraft to Seymchan without knowing the weather conditions at destination (uncertain situation),\r\n- The total rest time of the crew was insufficient, \r\n- Lack of assistance by ground services upon arrival in Seymchan, \r\n- Wrong decision on part of the Zyrianka Airport Authorities which decided to close the airfield to all trafic because the runway was flooded. Investigations revealed that this was not the case and this decision was taken in rush. When the aircraft approached Zyrianka, the airfield was practicable with a 1,000 meters long runway."}