{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-323c-baku-2-killed", "date": "Nov 30, 1995 at 1910 LT", "type": "Boeing 707", "operator": "Azerbaijan-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ürümqi - Baku", "msn": "19584", "yom": 1967, "flight_number": null, "city": "Baku", "zone": "Absheron", "country": "Azerbaijan", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After takeoff from Ürümqi Airport, while on a cargo flight to Baku, the crew encountered technical problems with the left main gear that remained down. The crew decided to continue to Baku in such configuration. On approach to Baku-Bina Airport by night, the captain contacted ATC and was cleared to proceed to a low pass to check the undercarriage. Following the low pass, the crew initiated a turn to the left and followed a circuit for a second approach. While flying at a relative low altitude, all four engines suffered a loss of power. The aircraft lost height, collided with light poles on a bridge and crashed in a field located 9 km from the airport. Four crew members were seriously injured and two others were killed. ", "probable_cause": "It was determined that all four engines lost power due to low fuel. The following contributing factors were reported: \r\n- A malfunction of the landing gear retraction system, which led to fly with a landing gear extended and caused an excessive fuel consumption. The subsequent failure to lock the left landing gear in the extended position made it necessary to do a second approach with a limited amount of fuel.\r\n- The fuel gauge indicator readings were inaccurate and prevented the crew from having correct info about the amount of fuel available and applying the flight manual's recommendations for low-fuel flights.\r\n- The lack of an airline bulletin on the features of the fuel system prevented the crew in the emergency situation from selecting the optimum mode for flying with a limited amount of fuel.\r\n- Inadequate operational and maintenance organization on the part of the companies Baku Air and ALG Inc."}