{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-manila", "date": "Jan 9, 1998 at 1935 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "William Byars", "flight_phase": "Takeoff (climb)", "flight_type": "Delivery", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Manila - Saipan", "msn": "31-8352001", "yom": 1983, "flight_number": null, "city": "Manila-Ninoy Aquino", "zone": "Metro Manila", "country": "Philippines", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On January 9, 1998, at 1935 hours Philippines local time, a Piper PA-31, N4111M, reportedly experienced a loss of engine power and crashed at the Ninoy Aquino International Airport, Manila, Philippines. The aircraft was substantially damage the airline transport rated pilot and copilot were not injured. Visual meteorological conditions existed for the night ferry flight to Saipan in the Marianas, and an instrument flight rules (IFR) flight plan had been filed. The pilot stated that after completing a preflight they had been cleared to taxi to the active runway. The pilot requested a full length takeoff from runway 06. Approximately 75 feet after lifting off from the ground, the pilot requested that the copilot retract the landing gear. The pilot reported that shortly after the landing gear was raised the aircraft yawed sharply to the right. He lowered the nose to regain some of the airspeed that was lost due to the right yaw. He stated that they were losing airspeed and altitude quickly, and asked the copilot to extend the landing gear. The pilot reported that on landing he had the power on until they contacted the runway. The aircraft slid to the left and came to rest after striking a concrete ditch. A test flight of the accident aircraft had been conducted 2 days and on the day before the accident. The purpose of the test flights were to check the propellers that had been overhauled, and to obtain a ferry permit from the Federal Aviation Administration's Designated Airworthiness Representative (DAR). The DAR found the aircraft to be within required specifications. He made the appropriate entry into the aircraft's logbook and issued the ferry authorization.", "probable_cause": null}