{"url": "https://www.baaa-acro.com/crash/crash-avro-683-lancaster-mt-beinn-eighe-8-killed", "date": "Mar 14, 1951 at 0225 LT", "type": "Avro 683 Lancaster", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Mountains", "schedule": "Kinloss - Kinloss", "msn": null, "yom": null, "flight_number": null, "city": "Mt Beinn Eighe", "zone": "Ross and Cromarty", "country": "United Kingdom", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft left RAF Kinloss at 1800LT on March 13 for a night navigation training exercise. Some 6 1/2 hours after leaving Kinloss, the crew reported that they were approximately 60 miles to the North of Cape Wrath. After this point there was no further radio contact with aircraft, as by the following morning the aircraft had failed to return to base or land at another airfield a search was initiated. This was carried out by numerous aircraft from airfields in Scotland but there were no sightings. On the 17th March as report was received that a red flash had been seen in the Torridon area around the time the aircraft disappeared. An aerial search of the Torridon mountains was carried out and the burnt out wreckage of air aircraft was spotted high on the northern side of Beinn Eighe at the top of the cliffs of the Triple Buttress. Ground units set out to attempt to reach the site to confirm that is was the missing Lancaster but could not reach the site due to deep lying snow and further poor weather, together with a lack of suitable equipment. It was the end of March before members of the RAF Mountain Rescue Team from Kinloss were able to reach the wreck to begin the task of recovering the bodies of the crew. The recovery of the last missing airmen was not carried out until August 1951 when enough snow had melted to uncover his body.\r\nCrew (120th Squadron):\r\nFl/Lt Harry Smith Reid, pilot, \r\nSgt Ralph Clucas, copilot,\r\nSgt Robert Strong, navigator, \r\nSgt Peter Tennison, signaller, \r\nSgt James Naismith, signaller, \r\nSgt Wilfred D. Beck, signaller, \r\nSgt James W. Bell, signaller, \r\nSgt George Farquhar, signaller. \r\nSource and photo: \r\nhttp://www.peakdistrictaircrashes.co.uk/crash_sites/scotland/avro-lancaster-tx264-beinn-eighe/", "probable_cause": null}