{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-g200-moscow", "date": "Feb 26, 2019 at 1244 LT", "type": "Gulfstream G200", "operator": "Silk-Way-Business-Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Baku - Moscow", "msn": "189", "yom": 2008, "flight_number": "EWS88", "city": "Moscow-Sheremetyevo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7608, "captain_hours_type": 2356, "copilot_hours": 2554, "copilot_hours_type": 609, "aircraft_hours": 4174, "circumstances": "The airplane departed Baku-Bina Airport on a charter flight to Moscow, carrying three passengers and three crew members. Following an uneventful flight, the crew was cleared for an approach to Moscow-Sheremetyevo Airport runway 24C. The aircraft landed at a speed of 150 knots some 250 metres past the runway threshold. After touchdown, the crew started the braking procedure and activated the thrust reversers. After a course of several hundred metres, the aircraft deviated to the left, made an almost 180 turn and veered off runway to the left. While contacting soft ground, the right main gear was torn off and the aircraft came to rest in a snow covered area. All six occupants evacuated safely and the aircraft was damaged beyond repair. ", "probable_cause": "The reason for the accident with the Gulfstream G200 4K-AZ88 was the stowing of the right-engine reverser by the pilot KVS from maximum thrust reversal while maintaining maximum thrust reversal on the left engine, which led to the appearance of a significant turning moment to the left. The aircraft turning to the left in the presence of a cross wind to the right, as well as turbulence of the airflow near the rudder due to the open thrust reversal mechanism of the left engine and possible ice deposition on the outer surfaces of the aircraft, which led to the development of a significant swing moment on the rudder. The development of a significant articulated moment on the rudder, in the absence of power steering in the rudder control system, led to its deviation to the leftmost position despite significant (up to 82 kg or 180 pounds) forces exerted by the crew on the pedals. The deviation of the rudder (pedals) to the left also led to the deviation of the nose wheel to the left. The total moment from the running reverse of the left engine, from the right engine in direct draft mode, and from the rudder and nose wheel deflection to the left, led to the aircraft rolling out of the runway and its damage. Separate braking applied by the crew could not prevent the aircraft from rolling out.\n\r\nThe following contributing factors were identified: \r\n- The crew did not take into account the provisions of the AOM about the possible \"destabilizing\" effect of the thrust reverse when landing with a cross wind on the runway with a reduced braking coefficient;\r\n- Increased psycho-emotional tension of the crew members due to long dissatisfaction and emotional discussion of instructions and actions of ATC controllers. At the same time, the instructions and actions of the ATC service controllers were in line with established procedures."}