{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-portland-1-killed", "date": "Jan 26, 1981 at 1538 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "NorthWest Skyways", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Portland - Melbourne", "msn": "31-7952087", "yom": 1979, "flight_number": null, "city": "Portland", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 815, "captain_hours_type": 83, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The operator had undertaken to carry out a ship's crew exchange programme that consisted of transporting 16 persons and their baggage from Portland to Essendon and the same number back to Portland. Similar programmes had been carried out previously and it was known that the passengers usually carried considerable baggage. However, only two Piper PA-31-350 aircraft, VH-POC and VH-RNH, were assigned to the task. Prior to departure Essendon, both pilots attended the Briefing Office and prepared flight plans, intended to operate under the Instrument Flight Rules and the pilots calculated it would be necessary to load 208 minutes fuel for the first return flight to Portland. This included an additional 30 minutes fuel for holding, as was required because of forecast thunderstorm activity, with associated reduced visibility in rain, in the Essendon area. Both pilots elected to have their aircraft refuelled to capacity which, they indicated on their flight plans, would give them a total of 280 minutes endurance; 72 minutes more than required. The aircraft proceeded to Portland without known incident, arriving at about 14:00 hours. After a break for refreshments, the pilots returned to their aircraft at about 1500 hours and carried out pre-flight checks. The passengers arrived at the aerodrome in a number of vehicles. Initially the pilots began to weigh the baggage and record the weights on a manifest. The passengers were in a light-hearted mood, however, and with an atmosphere of some confusion, not all of the baggage was weighed, the manifest was not completed and no individual weights were marked on the bags.The baggage was then transported by trolleys to the aircraft and shared between them without consideration of weight. The baggage in the rear baggage area of the cabin of VH-POC was not restrained to prevent movement. The pilots decided that, by inspection, the average baggage weight per passenger was 20 kg. The accepted standard weight of 77 kg per adult passenger was also assumed. Each pilot then completed a load sheet for his aircraft, on the basis of carrying eight passengers. The sheet for VH-POC indicated that the aircraft fuel load was 290 kg. The total weight calculated for VH-POC was 3,080 kg. This was less than the maximum allowable all-up-weight of 3,178 kg. However, an incorrect aircraft operating weight had been used and an arithmetical error had occurred in the calculation. Correcting for these, the aircraft weight should have been recorded as 3,256 kg. When ready to embark, the passengers were only directed towards the two aircraft. No effort was made to split the party into two even groups and in the event, nine passengers boarded VH-POC. On boarding VH-POC, the pilot did not correct the passenger imbalance. He started both engines and proceeded to taxi for a take-off on Runway 22. Pre-take-off checks were carried out as the aircraft taxied. The weather conditions at the time were fine; visibility 15 km, temperature 22° Celsius, sea level barometric pressure 1007 millibars and surface wind from 210° to 220° magnetic, gusting from 25 to 35 knots. In such wind conditions, and because of the location near a coastal headland, there was significant turbulence present. The pilot of VH-POC had operated into Portland on numerous prior occasions and had experienced this common situation previously. The take-off run was commenced and the pilot reported that full power was obtained from both engines. He stated that at 95 kts the aircraft was rotated and, when a positive rate of climb had been established, the landing gear was retracted. Then, at a height of 60 to 70 feet, just after he had reduced power to the climb setting, the left engine suddenly lost power. Ground witnesses who observed the take-off reported that the aircraft appeared slow to accelerate. Once airborne, it maintained a low climb profile and, at one stage, slewed to the right. Irregular engine noise was heard but it was not identified to a particular engine. The pilot reported that he confirmed a left engine failure by closing the left throttle. On fully re-opening the throttle, however, he noted a slight power response and hence he elected not to shut down the engine and feather the left propeller. Several of the passengers were aware of an abnormal situation but none was aware of the nature of the problem nor could confirm which engine was malfunctioning. They reported that the landing gear audio warning was sounding throughout most of the flight, which indicated a throttle was at or near the closed position. The pilot reported that the aircraft began to lose height and, as a forced landing was imminent, he turned to the right to avoid the sea. Control had been difficult in the gusty conditions but he had managed to reduce speed, lower the landing gear and guide the aircraft to a landing in a reasonably suitable area. The aircraft touched down on undulating-, sandy scrub-covered terrain. The landing gear and engines were torn out and the aircraft came to rest after travelling only some 26 metres. The fuselage broke open near the rear door during the ground slide. Some passengers were able to evacuate the cabin without assistance and they rendered help to the pilot and other passengers. A small fire, which had ignited in the vicinity of the left engine as the aircraft came to rest, then suddenly spread and engulfed the fuselage before the final passenger could be extricated. Subsequent examination of the wreckage was hampered by the extensive fire damage. No pre-existing fault was found in those components that were recovered. An inspection of the left propeller found that it had been feathered at ground impact. It was not possible to establish precisely the aircraft's weight and centre of gravity at the time of the accident as the contents of the nose and engine nacelles baggage compartments were destroyed. The available evidence, however, indicated that the aircraft weighed at least 3400 kg and its centre of gravity was probably beyond the aft limit. Piper PA31-350 performance data indicated that, for a new aircraft, the maximum attainable single-engine rate of climb at the limit weight of 3,178 kg was 220 feet per minute. At a weight of 3,400 kg this would be reduced by about 40 percent to 134 feet per minute. At the higher weight, detracting factors such as aircraft age, turbulence and less than optimum airspeed would have precluded the aircraft from achieving a positive rate of climb. The pilot was briefly interviewed in hospital on 27.1.81. At that time he also submitted a written notification of the accident. Subsequently, he has declined, through industrial counsel, to either attend for an interview under procedures of the Air Safety Investigation Branch or to supply answers to written questions. Hence it has not been possible to fully resolve a number of safety aspects of the accident, such as aircraft loading, the nature of the power loss and subsequent aircraft handling considerations.", "probable_cause": "The probable cause of the accident was that the aircraft experienced a loss of power from one engine under conditions which precluded a safe continuation of flight. The two most significant conditions were aircraft overloading and turbulence. The nature and cause of the power loss have not been determined."}