{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2-irkutsk-oblast-3-killed", "date": "May 30, 1980 at 1800 LT", "type": "PZL-Mielec AN-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Irkutsk – Kachug – Nizhneangarsk", "msn": "1G96-37", "yom": 1968, "flight_number": null, "city": "Russia", "zone": "All Russia", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9745, "circumstances": "The single engine airplane departed Irkutsk Airport at 1530LT on a flight to Nizhneangarsk, Buryatia, with an intermediate stop in Kachug, carrying one passenger, two pilots and a load of 800 kilos of various goods on behalf of a geological expedition. Following a fuel stop in Kachug, the crew departed Kachug Airport at 1710LT in marginal weather conditions. At 1727LT, the crew requested and was cleared to descend from 2,700 meters to 2,300 meters for unknown reasons. Twelve minutes later, while cruising at an altitude of 2,300 meters, the crew informed ATC about his position in the region of the Touloun Lake and gave his ETA for the next point over Cape Sheremshan at 1815LT. As the crew failed to contact ATC and the aircraft did not arrive in Nizhneangarsk, SAR operations were initiated but eventually abandoned 17 days later as no trace of the aircraft nor the three occupants was found. It is believed that the airplane crashed in a mountainous region located  northwest of Baïkal Lake, near the border between Irkutsk oblast and the Republic of Buryatia. ", "probable_cause": "Due to lack of evidences as the wreckage was not found, the exact cause of the accident could not be determined. However, the following three hypothesis were not ruled out:\r\n- Loss of control due to severe icing, \r\n- Engine failure, \r\n- Controlled flight into terrain while cruising in clouds. "}