{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-297-kahului-1-killed", "date": "Apr 28, 1988 at 1346 LT", "type": "Boeing 737-200", "operator": "Aloha%20Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hilo - Honolulu", "msn": "20209", "yom": 1969, "flight_number": "AQ243", "city": "Kahului", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 1, "pax_on_board": 90, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 8500, "captain_hours_type": 6700, "copilot_hours": 8000, "copilot_hours_type": 3500, "aircraft_hours": 35496, "circumstances": "On April 28, 1988, an Aloha Airline Boeing 737, N73711, was scheduled for a series of interisland flights in Hawaii. The crew flew three uneventful roundtrip flights, one each from Honolulu to Hilo (ITO), Kahului Airport, HI (OGG) on the island of Maui, and Kauai Island Airport (LIH). At 11:00, a scheduled first officer change took place for the remainder of the day. The crew flew from Honolulu to Maui and then from Maui to Hilo. At 13:25, flight 243 departed Hilo Airport en route to Honolulu. The first officer conducted the takeoff and en route climb to FL240 in VMC. As the airplane leveled at 24,000 feet, both pilots heard a loud \"clap\" or \"whooshing\" sound followed by a wind noise behind them. The first officer's head was jerked backward, and she stated that debris, including pieces of gray insulation, was floating in the cockpit. The captain observed that the cockpit entry door was missing and that \"there was blue sky where the first-class ceiling had been.\" The captain immediately took over the controls of the airplane. He described the airplane attitude as rolling slightly left and right and that the flight controls felt \"loose.\" Because of the decompression, both pilots and the air traffic controller in the observer seat donned their oxygen masks. The captain began an emergency descent. He stated that he extended the speed brakes and descended at an indicated airspeed (IAS) of 280 to 290 knots. Because of ambient noise, the pilots initially used hand signals to communicate. The first officer stated that she observed a rate of descent of 4,100 feet per minute at some point during the emergency descent. The captain also stated that he actuated the passenger oxygen switch. The passenger oxygen manual tee handle was not actuated. When the decompression occurred, all the passengers were seated and the seat belt sign was illuminated. The No. 1 flight attendant reportedly was standing at seat row 5. According to passenger observations, the flight attendant was immediately swept out of the cabin through a hole in the left side of the fuselage. The No. 2 flight attendant, standing by row 15/16, was thrown to the floor and sustained minor bruises. She was subsequently able to crawl up and down the aisle to render assistance and calm the passengers. The No. 3 flight attendant, standing at row 2, was struck in the head by debris and thrown to the floor. She suffered serious injuries. The first officer tuned the transponder to emergency code 7700 and attempted to notify Honolulu Air Route Traffic Control Center (ARTCC) that the flight was diverting to Maui. Because of the cockpit noise level, she could not hear any radio transmissions, and she was not sure if the Honolulu ARTCC heard the communication. Although Honolulu ARTCC did not receive the first officer's initial communication, the controller working flight 243 observed an emergency code 7700 transponder return about 23 nautical miles south-southeast of the Kahalui Airport, Maui. Starting at 13:48:15, the controller attempted to communicate with the flight several times without success. When the airplane descended through 14,000 feet, the first officer switched the radio to the Maui Tower frequency. At 13:48:35, she informed the tower of the rapid decompression, declared an emergency, and stated the need for emergency equipment. The local controller instructed flight 243 to change to the Maui Sector transponder code to identify the flight and indicate to surrounding air traffic control (ATC) facilities that the flight was being handled by the Maui ATC facility. The first officer changed the transponder as requested. At 13:50:58, the local controller requested the flight to switch frequencies to approach control because the flight was outside radar coverage for the local controller. Although the request was acknowledged, Flight 243 continued to transmit on the local controller frequency. At 13:53:44, the first officer informed the local controller, \"We're going to need assistance. We cannot communicate with the flight attendants. We'll need assistance for the passengers when we land.\" An ambulance request was not initiated as a result of this radio call. The captain stated that he began slowing the airplane as the flight approached 10,000 feet msl. He retracted the speed brakes, removed his oxygen mask, and began a gradual turn toward Maui's runway 02. At 210 knots IAS, the flightcrew could communicate verbally. Initially flaps 1 were selected, then flaps 5. When attempting to extend beyond flaps 5, the airplane became less controllable, and the captain decided to return to flaps 5 for the landing. Because the captain found the airplane becoming less controllable below 170 knots IAS, he elected to use 170 knots IAS for the approach and landing. Using the public address (PA) system and on-board interphone, the first officer attempted to communicate with the flight attendants; however, there was no response. At the command of the captain, the first officer lowered the landing gear at the normal point in the approach pattern. The main gear indicated down and locked; however, the nose gear position indicator light did not illuminate. Manual nose gear extension was selected and still the green indicator light did not illuminate; however, the red landing gear unsafe indicator light was not illuminated. After another manual attempt, the handle was placed down to complete the manual gear extension procedure. The captain said no attempt was made to use the nose gear downlock viewer because the center jumpseat was occupied and the captain believed it was urgent to land the airplane immediately. At 13:55:05, the first officer advised the tower, \"We won't have a nose gear,\" and at 13:56:14, the crew advised the tower, \"We'll need all the equipment you've got.\" While advancing the power levers to maneuver for the approach, the captain sensed a yawing motion and determined that the No.1 (left) engine had failed. At 170 to 200 knots IAS, he placed the No. 1 engine start switch to the \"flight\" position in an attempt to start the engine; there was no response. A normal descent profile was established 4 miles out on the final approach. The captain said that the airplane was \"shaking a little, rocking slightly and felt springy.\" Flight 243 landed on runway 02 at Maui's Kahului Airport at 13:58:45. The captain said that he was able to make a normal touchdown and landing rollout. He used the No. 2 engine thrust reverser and brakes to stop the airplane. During the latter part of the rollout, the flaps were extended to 40° as required for an evacuation. An emergency evacuation was then accomplished on the runway.", "probable_cause": "The failure of the Aloha Airlines maintenance program to detect the presence of significant disbonding and fatigue damage, which ultimately led to failure of the lap joint at S-10L and the separation of the fuselage upper lobe. Contributing to the accident were the failure of Aloha Airlines management to supervise properly its maintenance force as well as the failure of the FAA to evaluate properly the Aloha Airlines maintenance program and to assess the airline's inspection and quality control deficiencies. Also contributing to the accident were the failure of the FAA to require Airworthiness Directive 87-21-08 inspection of all the lap joints proposed by Boeing Alert Service Bulletin SB 737-53A1039 and the lack of a complete terminating action (neither generated by Boeing nor required by the FAA) after the discovery of early production difficulties in the 737 cold bond lap joint, which resulted in low bond durability, corrosion and premature fatigue cracking."}