{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-san-jose-2-killed", "date": "Dec 23, 1995 at 0019 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Ameriflight2", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Mountains", "schedule": "Oakland - San Jose", "msn": "31-7952062", "yom": 1979, "flight_number": "AMF041", "city": "San Jose", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4659, "captain_hours_type": 914, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9840, "circumstances": "The aircraft impacted mountainous terrain in controlled flight during hours of darkness and marginal VFR conditions. The flight was being vectored for an instrument approach during the pilot's 14 CFR Part 135 instrument competency check flight. The flight was instructed by approach control to maintain VFR conditions, and was assigned a heading and altitude to fly which caused the aircraft to fly into another airspace sector below the minimum vectoring altitude (MVA). FAA Order 7110.65, Section 5-6-1, requires that if a VFR aircraft is assigned both a heading and altitude simultaneously, the altitude must be at or above the MVA. The controller did not issue a safety alert, and in an interview, said he was not concerned when the flight approached an area of higher minimum vectoring altitudes (MVA's) because the flight was VFR and 'pilots fly VFR below the MVA every day.' At the time of the accident, the controller was working six arrival sectors and experienced a surge of arriving aircraft. The approach control facility supervisor was monitoring the controller and did not detect and correct the vector below the MVA. ", "probable_cause": "The failure of the air traffic controller to comply with instructions contained in the Air Traffic Control Handbook, FAA Order 7110.65, which resulted in the flight being vectored at an altitude below the minimum vectoring altitude (MVA) and failure to issue a safety advisory. In addition, the controller's supervisor monitoring the controller's actions failed to detect and correct the vector below the MVA. A factor in the accident was the flightcrew's failure to maintain situational awareness of nearby terrain and failure to challenge the controller's instructions. "}