{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-232-hiroshima", "date": "Apr 14, 2015 at 2005 LT", "type": "Airbus A320", "operator": "Asiana%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Seoul – Hiroshima", "msn": "3244", "yom": 2007, "flight_number": "OZ162", "city": "Hiroshima", "zone": "Chūgoku", "country": "Japan", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 74, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8242, "captain_hours_type": 1318, "copilot_hours": 1588, "copilot_hours_type": 1298, "aircraft_hours": 23595, "circumstances": "The approach to Hiroshima Airport was completed in marginal weather conditions. The autopilot was disengaged at 2,100 feet MSL when the aircraft descended below the glide path and hit approach lights and the localiser antenna located 325 meters short of runway 28. The aircraft continued the descent, hit the soft ground short of runway. Then it rolled on runway for some 1,154 meters, veered to the left, went off runway and came to rest 130 meters to the left of the concrete runway, some 1,477 meters past the runway threshold. All 82 occupants were evacuated, among them 27 (25 passengers and 2 crew members) were injured. The aircraft was considered as written off due to severe damages on both engines, ailerons, wings and the bottom of the fuselage. At the time of the accident, weather conditions were difficult with visibility up to 4 km, RVR on runway 28 variable from 300 to 1,800 meters, light rain, partial fog, one octa cloud at 0 feet, 4 octas at 500 feet, 6 octas at 1,200 feet.", "probable_cause": "It is certain that when landing on RWY 28 at the Airport, the Aircraft undershot and the PIC commenced executing a go-around; however, it collided with the Aeronautical Radio Navigation Aids located in front of RWY 28 threshold, just before turning to climb. Regarding the fact that the Aircraft undershot, it is probable that there might be following aspects in causes: The PIC continued approaching without executing a go around while the position of the Aircraft could not be identified by visual references which should have been in view and identified continuously at or below the approach height threshold (Decision Altitude: DA); and as well, the FO, as pilot-monitoring who should have monitored meteorological conditions and flight operations, did not make a call-out of go-around immediately when he could not see the runway at DA. Regarding the fact that the PIC continued approaching without executing a go around while the position of the Aircraft could not be identified by visual references which should have been in view and identified continuously at or below DA, he did not comply with the regulations and SOP, and it is probable that there was a background factor that the education and trainings for compliance of rules in the Company was insufficient. In addition, regarding the fact that the FO did not make an assertion of go around, it is probable that the CRM did not function appropriately."}