{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b90-king-air-laguna-del-sauce-10-killed", "date": "Mar 19, 2015 at 2038 LT", "type": "Beechcraft 90 King Air", "operator": "Drogueria%20Meta", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Laguna del Sauce – San Fernando", "msn": "LJ-454", "yom": 1969, "flight_number": null, "city": "Laguna del Sauce", "zone": "Maldonado", "country": "Uruguay", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 9348, "captain_hours_type": null, "copilot_hours": 5095, "copilot_hours_type": null, "aircraft_hours": 10319, "circumstances": "The twin engine airplane departed Laguna del Sauce Airport on a charter flight to San Fernando Airport near Buenos Aires, carrying eight passengers and two pilots. Shortly after a night takeoff from Laguna del Sauce Airport runway 01, the aircraft entered a controlled descent and crashed in shallow water some 2 km northwest of the airport, bursting into flames. The aircraft was destroyed by a post crash fire and all 10 occupants were killed. ", "probable_cause": "The accident resulted from impact with the ground without loss of control due to the combination of the following factors: \r\n- The aircraft's climb profile did not meet the manufacturer's recommendations for speed and rate of climb,\r\n- The center of gravity was outside the flight envelope,\r\n- The total weight of the aircraft at the time of the accident was 124 kilos above the MTOW, \r\n- Both pilots were tired due to a lack of rest time and a shift of more than 18 hours,\r\n- The captain did not fly this type of aircraft since 1997 and was used to flying jets,\r\n- The copilot had no experience on this type of aircraft despite being in possession of a valid license,\r\n- The pilots' knowledge and understanding of the aircraft's systems and operation was inadequate,\r\n- The operational checklists found on board the aircraft were not up to date,\r\n- The pilots flew for the first time at night on this aircraft and for the second time together,\r\n- The aircraft was operated under commercial rules on behalf of a travel agency while it could only fly privately,\r\n- The instructor in charge of the training of both pilots and the person in charge of scheduling the flight refused to be questioned by the board of inquiry,\r\n- An excessive workload for the crew and a lack of rest contributed to the pilots' loss of situational awareness,\r\n- Both engines' compressors were running at low speed on impact,\r\n- Both engines' propellers were turning at a speed close to low pitch,\r\n- No mechanical anomalies were found on the engines and their components,\r\n- Insufficient qualifications of the crew to fly on this type of aircraft,\r\n- Pressure from the aircraft's owner to complete the flight,\r\n- Crew fatigue and stress,\r\n- Inadequate maintenance of the aircraft."}