{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-rubondo-island-5-killed", "date": "Mar 30, 1988 at 1115 LT", "type": "Cessna 402", "operator": "Tanzania%20Game%20Tracker%20Safaris", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Rubondo Island – Kigoma – Arusha", "msn": "402C-0268", "yom": 1979, "flight_number": null, "city": "Rubondo Island", "zone": "Geita Region", "country": "Tanzania", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 2800, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was operating a charter flight from Rubondo to Arusha via Kigoma. It was carrying a party of four passengers who had previously travelled to the Island for photography expedition. 5H-GTS left Arush at 0400 hours for Rubondo with the pilot as the sole occupant. The flight to Mwanza was uneventful and the aircraft landed at Mwanza at 0530 hours. At Mwanza, the aircraft was refulled to full tanks giving an endurance of 5 1/2 hours. His flight plan filed with the tower, indicated that he intended to fly three sectors: Mwanza-Rubondo (25 minutes), Rubondo-Kigoma (1 hour 15 minutes) and Kigoma-Arusha (2 hours and 15 minutes). The aircraft left Mwanza at 0657 hours and landed at Rubondo about 25 minutes later. Four passengers joined the flight to Arusha and takeoff was initiated from runway 06 at about 0915 hours. One observer who was at the airstrip said that the aircraft was seen to rise momentarily and then came down hitting trees as it did so. A change of engine sound was heard followed by a loud bang. There was a huge ball of fire in the forest ahead and a few explosions were heard. On eye witness said that the fire was so intense that no rescue efforts were possible. The fire was localised around the area of the accident. The aircraft was completely destroyed and all the five occupants were killed.  ", "probable_cause": "The accident was caused by the failure of the aircraft to accelerate shortly after lift off. The aircraft may have been rotated in a partially stalled condition when it came at the end of the runway."}