{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-north-myrtle-beach-6-killed", "date": "Feb 3, 2006 at 2045 LT", "type": "Beechcraft 200 Super King Air", "operator": "Weekend Air Charter Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Trenton - North Myrtle Beach", "msn": "BB-266", "yom": 1977, "flight_number": null, "city": "North Myrtle Beach", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 3400, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8154, "circumstances": " The multi-engine airplane rolled inverted and dove into the ground on a landing approach. According to witnesses, the airplane made two approaches to runway 23. During the first approach the airplane was observed, \"fish tailing\" while about 30' feet over the runway. The airplane appeared to regain control and continued flying over the runway until passing the air traffic control tower, at which time the airplane began a climbing left turn. The witnesses stated that they heard the pilot tell the air traffic controller that he was doing a go-around. The controller asked the pilot if he had problems with the sea fog. The pilot responded back to the controller \"no that his left engine kept power up a little too much and would not come back.\" The witnesses observed the airplane circle the airport to the left, and watched it line up on runway 23 for the second time. The witnesses stated that as the airplane descended to the runway and without any indication of trouble, the airplane \"climbed and rolled left, went inverted and nosed down into the grass to the left of the runway and burst into flames.\" Examination of the airplane, airplane systems, engines, and propellers found no abnormal preimpact conditions that would have interfered with the normal operation of the airplane. No recorded radar data for the flight was located that captured the airplane's two attempted landings. Information contained in the Super King Air 200 Pilot's Operating Handbook (POH) and FAA Approved Flight Manual (AFM) showed the stall speed with gear extended, 40-degrees flaps, and zero bank angle as 84 knots Indicated Air Speed.", "probable_cause": "The pilot's failure to maintain control during landing approach for undetermined reasons."}