{"url": "https://www.baaa-acro.com/crash/crash-cessna-525b-citation-cj3-sao-paulo", "date": "Nov 11, 2012 at 1721 LT", "type": "Cessna 525 CitationJet CJ3", "operator": "Tropic%20Air%20Taxi%20Aereo", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Florianópolis – São Paulo", "msn": "525B-0187", "yom": 2008, "flight_number": null, "city": "São Paulo-Congonhas", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4048, "captain_hours_type": 521, "copilot_hours": 648, "copilot_hours_type": 189, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Florianópolis, the crew started the approach to São Paulo-Congonhas Airport Runway 35R. After touchdown, the airplane was unable to stop within the remaining distance. It overran, went down an embankment and came to rest against a fence, broken in two. The passenger and the copilot were slightly injured and captain was seriously injured. The aircraft was destroyed. ", "probable_cause": "The following findings were identified:\r\n- The commander was overconfident in himself and the aircraft which led him to lose the critical capacity to discern the risks involved in the procedure that was adopting. Corroborating was the fact that the pilot judged he had much knowledge in this operation and knew exactly how the aircraft responded. It can be inferred there was complacency by the copilot on the actions of the commander, during the approach at high speed, because even feeling uncomfortable, he did not make an incisive interference because he believed in the idea that the commander had done this kind of approach, with high speed, and so knowing what he was doing.\r\n- The pilot failed to identify the location of touch down during landing and not knowing how much runway was remaining, he decided he should not rush, thus demonstrating low situational awareness and lack of awareness, impacting the proper reaction time for the situation (Rush), which was not performed , leading the occurrence in question.\r\n- The crew failed to properly assess the information available like speed and the runway length for the realization of a safe landing, which led to a poor judgment of the situation at hand, making the decision not to adopt the missed approach procedure.\r\n- The distance between the crew, caused unconsciously by the commander's position with excess knowledge in the operation and the aircraft, and the insecurity of the copilot in considering new and inexperienced, resulted in a lack of assertiveness of the copilot to inform, with little emphasis, the commander of his perception of excessive airspeed.\r\n- The crew did not adopt good crew resource management, failing to communicate with assertiveness and share critical information in time prior to landing, allowing the speeding remained present until the touchdown.\r\n- Despite having adequate experience and training, the commander did not use the resources available, such as speed brakes to reduce the aircraft approach speed.\r\n- The variable wind direction and predominantly tail intensity equal to or greater than 10 knots, allowed excessive speed during landing.\r\n- The crew did not adopt good crew resource management, allowing the high speed to remain present until the touchdown.\r\n- The commander thought he would be able to perform the approach and landing with the speed above the expected."}