{"url": "https://www.baaa-acro.com/crash/crash-canadair-cl-601-3a-challenger-bassett", "date": "Mar 20, 1994 at 0036 LT", "type": "Canadair CL-601 Challenger", "operator": "Crystal Air & Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lawrence – Burlington – Long Beach", "msn": "5072", "yom": 1990, "flight_number": null, "city": "Bassett", "zone": "Nebraska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7110, "captain_hours_type": 2570, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1109, "circumstances": "The pilots flew to Lawrence, MA to refuel for the return flight back to the west coast. They stated the fuel truck malfunctioned and stopped after it had pumped about 221 gallons into the airplane. They were warned about possible fuel contamination, but they reported sump samples did not reveal abnormal amounts of water. The pilots observed erroneous fuel totalizer indications during the low alt flight to Burlington, VT, where they topped off with fuel. The flight crew stated while in cruise flight at FL410, the left engine low fuel pressure light illuminated. Sometime later, the left engine lost power, followed by a loss of power in the right engine. Numerous restart attempts on both engines and the apu were unsuccessful. The pilots maneuvered towards the nearest airport, but were unable to visually identify the runway in time to land on it. The airplane touched down in a field, striking an irrigation structure and trees. Water-contaminated fuel was found in the fuel tanks, fuel filters, and throughout the fuel system.", "probable_cause": "The pilot in command's inadequate planning/decision making and inadequate preflight inspection after receiving a load of contaminated fuel. Related factors are the contaminated fuel, improper refueling by FBO personnel, and the dark night light conditions. "}