{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-pukekohe-1-killed", "date": "Mar 25, 1974 at 0802 LT", "type": "Fletcher FU-24", "operator": "TAT%20Company", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": null, "msn": "67", "yom": 1957, "flight_number": null, "city": "Pukekohe", "zone": "Auckland Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot had flown from the farm earlier in the morning before going away for about two hours and then returning. At about 08:00 the property owner saw the plane approaching and making a low run over the airstrip apparently in order to frighten away some cattle obstructing the landing area.. The owner, a pilot himself, had experienced a similar situation before and went move the stock out of the way. He had lost sight of the aircraft for a brief period when he heard a bang and then the plane came back into view, rolling to starboard until inverted, and diving vertically into a hillside and exploding. Ground evidence showed that the Fletcher had struck with its right wing tip a 400 pound ( 180 kg ) cattle beast, killing the animal and dislodging the metal wing tip fairing which was found nearby with its leading edge crushed. Starting a few metres further on a 46 metres long scrape mark was visible on the surface having been made by the exposed end of the outer wing. The aircraft then collided with the corner of a hangar, the outboard end of the right wing contacting the building about 2.5 metres above ground level and 1 metre below the top. This impact caused the separation of the right outer wing panel. The plane, now out of control, cleared the top of another hangar and adjacent tall trees before diving into a hillside, exploding in flames and breaking up as it tumbled down the slope. The aircraft was destroyed and the pilot was killed. ", "probable_cause": "The investigator found that control was lost with the separation of the outer wing wing panel on impact with the hangar. Aileron control had survived the collision with the animal. Factors that may have contributed to the accident were the altitude and azimuth of the morning sun which may have dazzled the pilot and the possibility that the aircraft was affected by its own wake turbulence created by the first low run down the airstrip. "}