{"url": "https://www.baaa-acro.com/crash/crash-airbus-a330-303-kathmandu", "date": "Mar 4, 2015 at 0744 LT", "type": "Airbus A330", "operator": "Turkish-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Istanbul – Kathmandu", "msn": "1522", "yom": 2014, "flight_number": "TK726", "city": "Kathmandu-Tribhuvan", "zone": "Bagmati", "country": "Nepal", "region": "Asia", "crew_on_board": 11, "crew_fatalities": 0, "pax_on_board": 224, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14942, "captain_hours_type": 1456, "copilot_hours": 7659, "copilot_hours_type": 1269, "aircraft_hours": 4139, "circumstances": "The aircraft departed Istanbul at 1818LT on March 3 on a scheduled flight to Tribhuvan International Airport (TIA), Kathmandu with 11 crew members and 224 passengers .The aircraft started contacting Kathmandu Control from 00:02 hrs to 00:11hrs while the aircraft was under control of Varanasi and descending to FL 250 but there was no response because Kathmandu Control was not yet in operation. The airport opened at its scheduled time of 00:15hrs. The aircraft established its first contact with Kathmandu Approach at 00:17 hrs and reported holding over Parsa at FL 270. Kathmandu Approach reported visibility 100 meters and airport status as closed. At 00:22 hrs the aircraft requested to proceed to Simara due to moderate turbulence. The Kathmandu Approach instructed the aircraft to descend to FL 210 and proceed to Simara and hold. At 01:05 hrs when Kathmandu Approach provided an updated visibility of 1000 meters and asked the flight crew of their intentions, the flight crew reported ready for RNAV (RNP) APCH for runway 02. The aircraft was given clearance to make an RNP AR APCH. At 01:23 hrs when the aircraft reported Dovan, Kathmandu Approach instructed the flight crew to contact Kathmandu Tower. Kathmandu Tower issued a landing clearance at 01:24 hrs and provided wind information of 100° at 03 knots. At 01:27 hrs the aircraft carried out a missed approach due to lack of visual reference. The aircraft was given clearance to proceed to RATAN hold via MANRI climbing to 10500 feet as per the missed approach procedure. During the missed approach the aircraft was instructed to contact Kathmandu Approach. At 01:43 hrs the aircraft requested the latest visibility to which Kathmandu Approach provided visibility 3000 m and Kathmandu Tower observation of 1000 meters towards the south east and few clouds at 1000 ft, SCT 2000 ft and BKN 10,000 feet. When the flight crew reported their intention to continue approach at 01:44 hrs, Kathmandu Approach cleared the aircraft for RNAV RNP APCH runway 02 and instructed to report RATAN. The aircraft reported crossing 6700 ft at 01:55 hrs to Kathmandu Tower. Kathmandu Tower cleared the aircraft to land and provided wind information of 160° at 04 kts. At 01:57 hrs Kathmandu Tower asked the aircraft if the runway was insight. The aircraft responded that they were not able to see the runway but were continuing the approach. The aircraft was at 880 ft AGL at that time. At 783 ft AGL the aircraft asked Kathmandu Tower if the approach lights were on. Kathmandu Tower informed the aircraft that the approach lights were on at full intensity. The auto-pilots remained coupled to the aircraft until 14 ft AGL, when it was disconnected, a flare was attempted. The maximum vertical acceleration recorded on the flight data recorder was approximately 2.7 G. The aircraft pitch at touchdown was 1.8 degree nose up up which is lower than a normal flare attitude for other landings. From physical evidence recorded on the runway and the GPS latitude and longitude coordinate data the aircraft touched down to the left of the runway centerline with the left hand main gear off the paved runway surface. The aircraft crossed taxiways E and D and came to a stop on the grass area between taxiway D and C with the heading of the aircraft on rest position being 345 degrees (North North West) and the position of the aircraft on rest position  was at N 27° 41' 46\", E 85° 21'29\" At 02:00 hrs Kathmandu Tower asked if the aircraft had landed. The aircraft requested medical and fire assistance reporting its position at the end of the runway. At 02:03 hrs the aircraft requested for bridge and stairs to open the door and vacate passengers instead of evacuation. The fire and rescue team opened the left cabin door and requested the cabin attendant as well as to pilot through Kathmandu Tower to deploy the evacuation slides. At 02:10 hrs evacuation signal was given to disembark the passengers. All passengers were evacuated safely and later, the aircraft was declared as damaged beyond repair. ", "probable_cause": "The probable cause of this accident is the decision of the flight crew to continue approach and landing below the minima with inadequate visual reference and not to perform a missed approach in accordance to the published approach procedure. Other contributing factors of the accident are probable fixation of the flight crew to land at Kathmandu, and the deterioration of weather conditions that resulted in fog over the airport reducing the visibility below the required minima. The following findings were reported:\r\n- On March 2, 2015 i.e. two days before the accident, the crews of the flight to Kathmandu reported through RNP AR MONITORING FORM that all the NAV. accuracy and deviation parameter were perfectly correct at MINIMUM but the real aircraft position was high (PAPI 4 whites) and left offset,\r\n- The airlines as well as crews were unaware of the fact that wrong threshold coordinates were uploaded on FMGS NAV data base of the aircraft,\r\n- The flight crew was unable to get ATIS information on the published frequency because ATIS was not operating. ATIS status was also not included in the Daily Facilities Status check list reporting form of TIA Kathmandu,\r\n- Turkish Airlines Safety Department advised to change the scheduled arrival time at Kathmandu Airport,\r\n- It was the first flight of the Captain to Kathmandu airport and third flight but first RNAV (RNP) approach of the Copilot,\r\n- Both approaches were flown with the auto-pilots coupled,\r\n- Crew comments on the CVR during approach could be an indication that they (crews) were tempted to continue to descend below the decision height despite lack of adequate visual reference condition contrary to State published Standard Instrument Arrival and company Standard Operating procedures with the expectation of getting visual contact with the ground,\r\n- The flight crew were not visual with the runway or approach light at MDA,\r\n- The MET Office did not disseminate SPECI representing deterioration in visibility according to Annex 3,\r\n- The Approach Control and the Kathmandu Tower did not update the aircraft with its observation representing a sudden deterioration in visibility condition due to moving fog,\r\n- The Air Traffic Control Officers are not provided with refresher training at regular interval,\r\n- CAAN did not take into account for the AIRAC cycle 04-2015 from 05 Feb 2015 to 04 March 2015 while cancelling AIP supplement,\r\n- The auto-pilots remained coupled to the aircraft until 14ft AGL when it was disconnected and a flare was attempted,\r\n- The crews were not fully following the standard procedure of KTM RNAV (RNP) Approach and company Standard Operating procedures."}