{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-76md-mirny-11-killed", "date": "Nov 1, 2009 at 0849 LT", "type": "Ilyushin II-76", "operator": "Russian Government", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Mirny – Irkutsk – Chita", "msn": "00934 95866", "yom": 1989, "flight_number": null, "city": "Mirny", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine aircraft departed Mirny on a positioning flight to Chita with an intermediate stop in Irkutsk, carrying four passengers and a crew of seven on behalf of the Russian Ministry of the Interior. Shortly after takeoff by night, the aircraft rolled to the right to an angle of 90° then crashed at a speed of 364 km/h some 1,893 metres past the runway end. The aircraft was totally destroyed and all 11 occupants were killed. The accident occurred 59 seconds after takeoff. ", "probable_cause": "The day before the accident, the aircraft arrived in Mirny following a cargo flight, delivering various goods. After landing, the crew activated the electrical locking system for the rudder and the ailerons, and the 'lock on' light came on in the cockpit panel. In the morning of the accident, prior to takeoff, the crew followed the pre-takeoff checklist and deactivated the electrical locking system, but the 'lock on' light remained illuminated. Considering this as a false alarm, the captain decided to take off and proceeded with a manuel control of the ailerons. The left aileron moved normally while the right aileron got locked because of the locking mechanism. During the takeoff roll, because the four engine were not in full power mode, there was no sound alarm about the aileron locked mechanism. The aircraft deviated to the right and after lift off, it rolled to the right to angle of 8°. The pilot-in-command elected to counteract the banking but this maneuver was limited due to the right aileron locked mechanism. The aircraft continued to roll to the right to an angle of 90° until control was lost. "}