{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-200-near-banihal-37-killed", "date": "Feb 7, 1966 at 1155 LT", "type": "Fokker F27 Friendship", "operator": "Indian%20Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Srinagar – Jammu – Amritsar – New Delhi", "msn": "10271", "yom": 1965, "flight_number": null, "city": "Banihal", "zone": "Jammu and Kashmir", "country": "India", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 33, "pax_fatalities": 33, "other_fatalities": 0, "total_fatalities": 37, "captain_hours": 17312, "captain_hours_type": null, "copilot_hours": 7729, "copilot_hours_type": null, "aircraft_hours": 1930, "circumstances": "A Fokker F-27, Series 200, aircraft, PH-SAB, owned by the Schreiner Airways of Holland, and operated by the Indian Airlines Corporation on a charter contract, met with an accident shortly before noon on 7 February 1966. The aircraft was on a scheduled flight from Srinagar to Delhi with intermediate stops at Jammu and Amritsar. It crashed on a hilltop in the Pir Panjal range at a spot 12 miles west of its proper course which lay over the Banihal Pass 33'30'' N, 75'14\" E (altitude 9 290 ft). All members of the crew and all the 33 passengers on board were killed and the aircraft was totally destroyed.", "probable_cause": "The cause of the accident was undoubtedly a navigational error. The Court was at first tempted to accept the hypothesis that the error was committed deliberately by Capt. Duggal because he wanted to take a short cut over the hill to Udampur, instead of going first to Banihal and then turning slightly right to the prescribed route to Udampur. Some support was lent to this hypothesis by the general assessment of Capt. Duggal's character as being hasty and casual and disinclined to pay heed to detail. But after giving greater consideration, it seems to the Court that this hypothesis cannot be accepted and that the navigational error was not intentional. The configuration of the hill at a spot 12 miles west of the Banihal Pass does not snow that the aircraft would have had a clear passage at an altitude of 12,000 feet because there are hills which are 14,000 feet high as shown by the contour lines on the map. Also Duggal did reply to the call 0610 hours GMT when he said that he would be crossing Banihal in two or three minted. It seems to the Court, therefore, that when flying through clouds at an altitude insufficient to ensure safety, Duggal found himself at a spot which resembled in its appearance the Banihal Pass. He must have steered an incorrect heading on leaving the airfield. Changes in cloud formation and decreasing visibility did not permit a full and clear view of the mountain range which lay across the route. So, when he was near the point where it crashed, he thought that he was going to cross Banihal and sent this message to the airport. In point of fact, he was 12 miles off his track and crashed at a point 12,364ft above sea level. A more careful and cautious pilot would, in the circumstances, have made sure of his direction and position by a reference to the Srinagar Airport where, in addition to the VOR, an Automatic Direction Finding facility is available."}