{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-4-caribou-port-alsworth", "date": "Aug 29, 2001 at 1900 LT", "type": "De Havilland DHC-4 Caribou", "operator": "Greatland%20Air%20Cargo", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Iliamna - Port Alsworth", "msn": "215", "yom": 1964, "flight_number": null, "city": "Port Alsworth", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6200, "captain_hours_type": 559, "copilot_hours": 10000, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The captain and the first officer were landing a short takeoff and landing (STOL) cargo airplane on a private, dirt and gravel surface runway. The airplane was configured for landing with 40 degrees of flaps. During the landing approach, variations in indicated airspeed and ground speed indicated windshear conditions. About 100 to 200 feet above the ground, the airplane encountered a downdraft and began to drift to the right of the runway centerline. The captain said she increased engine power and applied full left aileron and rudder, but could not gain directional or pitch control of the airplane. The right wing struck trees, short of the runway threshold, increasing the airplane's right yaw. The captain said that as the airplane neared the ground, she pulled the engine throttles off. The airplane struck the ground with the right main landing gear and right front portion of the fuselage. The airplane then pivoted to the right, 180 degrees from the approach heading. The owner of the airport reported that wind conditions from the east may produce downdrafts in the area of runway 05. He indicated that at the time of the accident, the wind was blowing from the east about 15 knots. The first officer reported the captain appeared to be attempting to maintain a stabilized approach angle by varying the pitch attitude of the airplane. A review of company training literature revealed that the airplane is especially sensitive to slight wind shear, and wind gusts as low as 5 knots when operating at low airspeeds. Pilots are cautioned that when flying the aircraft at low speeds, a large application of the aileron control may be required to maintain wings level. During gusty wind conditions, the threshold airspeed should be increased by one-half the gust factor, and any lateral displacement should be corrected rapidly. If a wing is allowed to drop beyond corrective action of full aileron, power should be increased immediately to regain level flight.", "probable_cause": "The captain's failure to maintain the proper glidepath, and improper short field landing procedures. Factors in the accident were a downdraft, and the captain's inadequate evaluation of the weather conditions."}