{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-65-queen-air-west-point-12-killed", "date": "Sep 10, 1995 at 1840 LT", "type": "Beechcraft 65 Queen Air", "operator": "Peninsula Sky Divers", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "City", "schedule": "West Point - West Point", "msn": "LC-217", "yom": 1968, "flight_number": null, "city": "West Point-Middle Peninsula", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 1, "total_fatalities": 12, "captain_hours": 2980, "captain_hours_type": 462, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1530, "circumstances": "The airplane was loaded with 10 sport parachutists and one pilot. Later, investigators calculated that the maximum gross weight was exceeded by 149.6 pounds, and the center of gravity was 2.87 inches aft of the aft limit. The cabin door had been removed for parachuting operations; however, an altered Flight Manual Supplement had been used as authority for the door removal. The airplane was not on the FAA-approved eligible list for such removal. The airplane needed to be refueled before flight, but the quantity of fuel in the airport's underground storage tank was below the electric cutoff level. Fuel was pumped manually from the storage tank into plastic jugs, which were used to refuel the airplane. Before takeoff, samples of fuel were reported to have been drained from the airplane's fuel tanks (sumps). According to witnesses, they heard an engine misfiring during takeoff. They observed the airplane level off during the initial climb and start a shallow right turn. The bank angle gradually increased from shallow to steep as the nose dropped and the airplane descended. Other witnesses observed the airplane in a steep dive just before it crashed in the rear of a residence. One person in the residence was killed. A postaccident fire destroyed the accessory sections of both engines. Examination of the airplane disclosed evidence that the right engine had been shut down and the right propeller had been feathered; however, no preimpact mechanical failure was found. A sample of excess fuel was obtained from the tank that was used to refuel the airplane, but no observable quantity of water or contamination was found. ", "probable_cause": "The pilot's inadequate preflight/preparation, his failure to ensure proper weight and balance of the airplane, and his failure to obtain/maintain minimum control speed, which resulted in a loss of aircraft control after loss of power in one engine. A factor relating to the accident was: loss of power in the right engine for undetermined reason(s). "}