{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-53a-kazan-50-killed", "date": "Nov 17, 2013 at 1924 LT", "type": "Boeing 737-500", "operator": "Tatarstan-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Kazan", "msn": "24785/1882", "yom": 1990, "flight_number": "TAK363", "city": "Kazan", "zone": "Republic of Tatarstan", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 44, "pax_fatalities": 44, "other_fatalities": 0, "total_fatalities": 50, "captain_hours": 2783, "captain_hours_type": 2509, "copilot_hours": 2093, "copilot_hours_type": 1943, "aircraft_hours": 51547, "circumstances": "On final approach to Kazan from Domodedovo in marginal weather conditions, crew was forced to make a go around as the aircraft was not correctly aligned with the runway centerline. While climbing to a height of 700 meters, the aircraft went out of control, nosed down and hit the ground. The aircraft disintegrated on impact and all 50 occupants were killed. MAK reported in a first statement that the crew did not follow the standard approach profile and the approach was unstable. TOGA mode was selected, autopilot deactivated and flaps raised from 30 to 15 degrees. As gear were retracted, the aircraft pitched up to about 25 degrees nose up and the indicated airspeed decreased from 150 to 125 knots. Crew countered the nose up by control inputs and the climb was stopped. Aircraft reached a maximum height of 2,300 feet and began to rapidly descend until it impacted the ground with a near vertical angle of 75 degrees at a speed of 242 knots, some 20 seconds after reaching the height of 2,300 feet. The crash was no survivable. ", "probable_cause": "Systemic weaknesses in identifying and controlling the levels of risk, non-functional safety management system in the airline and lack of control over the level of crew training by aviation authorities at all levels (Tatarstan Civil Aviation Authority, Russian Civil Aviation Authority), that resulted in an unqualified crew being assigned to the flight.\r\nDuring the go-around the crew did not recognize that the autopilot had disconnected resulting in the aircraft impacting ground in a complex spatial position (nose up upset). The captain, pilot flying, lacked the skills to recover the aircraft from the complex spatial upset (lack of Upset Recovery), that led to significant negative G-forces, loss of spatial orientation sending the aircraft into a steep drive (75 degrees nose down) until impact with ground.\r\nThe go around was required because the aircraft on its final approach arrived in a position from which landing was impossible as result of a map shift by about 4000 meters (aircraft systems determining the position of the aircraft in error), the inability of the crew in those circumstances to combine aircraft control and navigation with needed precision, and the lack of active support by air traffic control during prolonged observation of significant deviation from the approach procedure.\r\nThe following factors were considered as contributory:\r\nThe captain not having had primary flight training,\r\nThe flight crew members being allowed to upgrade to Boeing 737 without satisfying the required qualifications including the English language, \r\nMethodical shortcomings in retraining as well as verification of results and quality of training, \r\nInsufficient level of organisation of flight operations at the airline, which resulted in failure to detect and correct shortcomings in working with the navigation equipment, pilot technique and crew interaction, including missed approaches, \r\nSystematic violation of crew work and rest hours, a large debt of holidays, which could have resulted in accumulation of fatigue adversely affecting crew performance, Simulator training that lacked a missed approach with intermediate height and all engines operating, \r\nIncreased emotional stress to the flight crew before deciding to go around because they could not establish the position of their aircraft with the necessary precision to accomplish a successful landing, \r\nViolation of the principle \"Aviate, Navigate, Communicate\" by both flight crew and air traffic control, which resulted in the flight crew not following standard operating procedures at the time of initiating the go around because the pilot monitoring was diverted from his duties for a prolonged period and did not monitor the flight parameters,\r\nThe fact that the crew did not recognize the autopilot had disconnected and delayed intervention by the crew, that resulted in the aircraft entering a complex spatial position (nose up upset),\r\nImperfection of simulator training programs for Upset Recovery Procedures as well as lack of criteria for assessing the quality of training, which resulted in the crew being unable to recover the aircraft from the upset,\r\nThe possible impact of somatogravic illusions,\r\nThe non-addressing of prior accident investigation recommendations, geared towards elimination of risks and establishing risk level management, had prevented the prevention of this accident,\r\nLack of proper supervision of issuance of pilot certificates in accordance with achieving specified requirements and qualifications,\r\nFailure of safety management system (SMS) in the airline, lack of guidelines for SMS development and approval, lack of a formal approach to approve/agree on SMS and pilot training by the related authorities,\r\nDeficiencies in aviation training centers' performance and absence of verification of training quality,\r\nLack of requirements for flight crew to be proficient in English Language for retraining on foreign aircraft types and lack of formal approach to verify language proficiency,\r\nlack of formal approach to conduct periodic verification of flight crew qualification,\r\nsystematic violation of crew work and rest times,\r\nlack of training of flight crew on go around from intermediate heights in manual control potentially leading to complex spatial position (e.g. nose high upset),\r\nThe map shifts in aircraft without GPS without training of crew to operate in such conditions,\r\nLack of active assistance by air traffic control when the approach procedure was deviated from over a prolonged period of time,\r\nBreach of principle \"Aviate, Navigate, Communicate\".\r\nTranslation via www.avherald.com"}