{"url": "https://www.baaa-acro.com/crash/crash-casa-212-aviocar-200-detroit-9-killed", "date": "Mar 4, 1987 at 1434 LT", "type": "Casa 212 Aviocar", "operator": "Northwest%20Airlink", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cleveland - Detroit", "msn": "160", "yom": 1980, "flight_number": "NW2268", "city": "Detroit-Metropolitan-Wayne County", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 16, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 17953, "captain_hours_type": 3144, "copilot_hours": 1593, "copilot_hours_type": null, "aircraft_hours": 12918, "circumstances": "At 14:30 the flight was cleared for a runway 21R visual approach and was cleared to land one minute later, At a height of 60-70 feet the aircraft suddenly yawed violently to the left and banked left 80-90° in a descent. The aircraft then rolled right and struck the ramp area 1,010 feet inside and to the left of the runway 21R threshold. It then skidded 398 feet, struck three ground support vehicles in front of Gate F10 at Concourse F and caught fire. Both pilots and seven passengers were killed, 10 other occupants were injured. ", "probable_cause": "The captain's inability to control the airplane in an attempt to recover from an asymmetric power condition at low speed following his intentional use of the beta mode of propeller operation to descend and slow the airplane rapidly on final approach for landing. Factors that contributed to the accident were an unstabilized visual approach, the presence of a departing DC-9 on the runway, the desire to make a short field landing, and the higher-than-normal flight idle fuel flow settings of both engines. The lack of fire-blocking material in passenger seat cushions contributed to the severity of the injuries."}