{"url": "https://www.baaa-acro.com/crash/crash-vickers-290-wellington-i-raf-mildenhall", "date": "Aug 28, 1939", "type": "Vickers 290 Wellington I", "operator": "Royal-Air-Force-4", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "City", "schedule": "Mildenhall - Mildenhall", "msn": null, "yom": null, "flight_number": null, "city": "Mildenhall AFB", "zone": "Suffolk", "country": "United Kingdom", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 28AUG1939, the aircraft L4217 crashed at Beck Row on take off for practice Bombing and Gunnery Exercise Burned out. First take off attempt was aborted due to lack of power. On second attempt engines cut after point of no return, the aircraft cleared the boundary fence, then port wing struck a barn, then damaged another barn before demolishing the out houses of a pair of cottages and ended up sideways on to a stone wall alongside the main road to Mildenhall town with a wing blocking the road before the final impact Eric and Navigator P/O Hiller braced themselves against the main spar. As A/C stopped first reaction was to exit via astro hatch but this had jammed, training memories then led us to collect escape axe from fuselage mid section and use it to chop off the rear turret cupola. By this time the front of the aircraft was burning furiously & the smoke plus dust from the buildings made it difficult to see very much. When we did reach the tail the turret was already missing from contact with the wall so out we went. We found that and front gunner had escaped via damaged nose and rear gunner had been thrown out into a bed of nettles! The Captain was convinced that there was another crew man aboard looking in we saw what could be a person it turned out to be engine covers and we beat a hasty retreat via the rear end. It was quite a spectacle with petrol tanks and oxygen cylinders exploding plu the rattle of .303 ammunition exploding. We later found out that A/c Hedges a new arrival on squadron had missed the flight though n the detail. Aircraft Captain sustained a broken finger, Front gunner a Cut arm requiring stitches while we all sustained mild abrasions and were stiff for days the rear gunner also had nettle rash! The following day showed the engines lying in pools of now solidified metal. Nothing else remained of the aircraft forward of the centre section. On inspection we realized that navigator and I had climbed out over the back of rear gunners seat 3 times without thinking of lowering it! Cause of the engine problem was a petrol cock which should have been either fully up or fully down depending on whether using 100 octane or lower value fuel. Was not set for 100 octane required for take off thus engines were starved – this in turn caused a blow back which in turn caused the fire I lost my nerve for flying for some time after that.\n\r\nThanks to Peter Cannings for his testimony and full report. His cousin F/Lt Eric F. H. Cannings was on board. ", "probable_cause": null}