{"url": "https://www.baaa-acro.com/crash/crash-lockheed-18-lodestar-banana-river-nas", "date": "Oct 11, 1945 at 0234 LT", "type": "Lockheed 18 LodeStar", "operator": "National-Airlines-4", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York-La Guardia – Raleigh – Jacksonville – Miami", "msn": "2207", "yom": 1942, "flight_number": "NA023", "city": "Banana River NAS", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 14, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3059, "captain_hours_type": 2632, "copilot_hours": 1219, "copilot_hours_type": 363, "aircraft_hours": 11396, "circumstances": "Flight 23 departed La Guardia Field at 1842 October 10, 1945, for Miami, Florida, with scheduled stops at Raleigh, N. C., and Jacksonville, Florida. Until landing at Jacksonville, the flight had been of a routine nature. However, during the flight the captain paid particular attention to an oil leak from the right engine which could be seen across the top of the engine cowl. Although the leak appeared to be very slight and had not necessitated excessive refill at either New York or Raleigh, Captain S. E. Stoia reported it to the National Airlines maintenance department at Jacksonville, with instructions that the leak be investigated. The aircraft was removed to a repair hangar and returned to the line after approximately one hour delay during which time two new oil hoses had been replaced. At 0123, October 11, 1945, the flight departed Jacksonville, on an instrument clearance to cruise at 2,000 feet to Miami. In order to avoid a slight turbulence at that flight altitude, Captain Stoia requested change of clearance to 4,000 feet. Approval for change of altitude was obtained after a delay due to traffic, and shortly after passing Daytona Beach, the flight climbed to 4,000 feet. At approximately 0210, First Officer W, S. Blomeley, who was seated in the co-pilot position, called Captain Stoia’s attention to spark which were coming from the right engine. Upon inspecting the engine with a flashlight, it was observed that thick smoke was pouring from under the engine cowl and that a wide band of oil was streaming back over the top of the nacelle. Realizing the danger of an oil fire and being anxious to avoid damage to the engine in the event of complete loss of oil, Captain Stoia immediately shut the engine down and feathered the right propeller. He advised the company station at Jacksonville of his difficulty and elected to continue to Melbourne, Florida, about 15 miles away for an emergency landing. Upon reaching Melbourne, however, the flight was advised by Melbourne Tower that the runway lights were inoperative and that considerable delay would be necessary before the mobile flood light apparatus would be available. Captain Stoia decided, therefore, to proceed to Banana River, 11 miles north, and Banana River Operations was advised by the Melbourne Tower Operator of his intentions and requested to prepare for his arrival. Although the captain had tuned to the Banana River Tower frequency, the tower was not equipped to receive the company frequency and two-way conversation was, therefore, not possible. As the flight approached the Banana River Naval Air Station, the captain observed that runway No. 6 was lighted, and being unable to establish radio contact with the tower, he assumed that it was the direction of landing intended. However, shortly before the aircraft arrived over the field, the tower personnel changed the runway lights to No. 15 since that runway was the longest one available at Banana River. The aircraft passed over the field at an altitude of 1500 feet, but the traffic pattern established by the flight was too close to the landing area, and, when on the final approach, Captain Stoia realized he was too high for a landing. When over the edge of the field at 300 feet with full flaps and gear extended and the airspeed at 100 mph, the captain decided to go around for another approach. Forty inches of manifold pressure was applied with full low pitch, the gear was fully retracted, and the flaps were retracted to the 30% position. During the missed approach procedure the captain intentionally held a nose-low attitude in order to accelerate to a normal climb airspeed; however, in spite of the loss of altitude, no increase in airspeed indication was obtained, and the aircraft continued to lose altitude while maintaining a straight course. Approximately 1/2 mile south southeast of the field, the aircraft struck the ground in a fairly level attitude longitudinally. The right wing made the first impact, the aircraft subsequently turning approximately 270 degrees as it skidded to a stop.", "probable_cause": "On the basis of the foregoing the Board determines that the probable cause of this accident was an excessively hurried approach for an emergency single-engine landing and the faulty execution of a missed approach procedure. The came of engine malfunction was faulty installation of an cil hose and connecting clamp. A contributing factor to the accident was the failure of the company to maintain an adequate training program for pilot personnel and to provide the facilities required for such a program."}