{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-282-port-harcourt", "date": "Jul 14, 2008 at 1844 LT", "type": "Boeing 737-200", "operator": "Chanchangi%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lagos – Port Harcourt", "msn": "23044/973", "yom": 1983, "flight_number": "NCH138", "city": "Port Harcourt", "zone": "Rivers", "country": "Nigeria", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 41, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8688, "captain_hours_type": 452, "copilot_hours": 7500, "copilot_hours_type": 2500, "aircraft_hours": 55508, "circumstances": "On 14th July, 2008 at 16:49 h, a Boeing 737–282 aircraft with nationality and registration marks 5N-BIG, operated by Chanchangi Airlines Ltd, commenced a scheduled domestic flight from Murtala Muhammed International Airport, (DNMM) with call sign NCH138 for Port Harcourt International Airport (DNPO). Instrument Flight Rules (IFR) flight plan was filed for the flight. There were 47 persons on board (41 passengers, 2 flight crew and 4 flight attendants) and 3 hours fuel endurance. The Captain was the Pilot Flying (PF) and The First Officer (FO) was the Pilot Monitoring (PM). The FO stated that NCH138 was initially scheduled to depart at 15:30 h, but the flight was delayed due to loading of passenger baggage. The Captain stated that NCH138 was cleared to FL290 and the flight continued normally. According to the DNPO Air Traffic Control (ATC) watch supervisor on duty, NCH138 contacted DNPO Approach Control (APP) at 17:05 h with flight information estimating POT at 17:50 h. NCH138 was issued an inbound clearance to POT1 VOR2 with the following weather information for 17:00 h as: Wind calm, Visibility 10 km, Broken clouds 270 m, Scattered clouds 600 m, Cumulonimbus clouds scattered, temperature 25/24°C, Thunderstorms, Temporarily Variable 8 kt, gusting 18 kt, Visibility 3000 m, Thunderstorms and rain, and expect runway (RWY) 21 for landing. According to the First Officer NCH138 requested descent into POT at about 100 NM. The Captain added that due to ATC delay, the descent commenced at about 80 NM. The Control Tower Watch Supervisor stated that at 18:00 h, NCH138 requested to hold over POT at 3500 ft for weather improvement, because there was rain overhead the station with build-up closing in at the threshold of RWY 21. At about 15 NM, between radials 180° and 210°, NCH138 reported breaking out of weather. At 18:19 h, NCH138 requested weather information from the Tower. Tower advised the flight crew that RWY 03 was better for landing. At this time, NCH138 requested RWY 03 for approach and Approach Control cleared NCH138 for the approach to RWY 03. At 18:27 h, the flight crew reported established on approach to RWY 03, leaving 2000 ft. The Approach Control then transferred NCH138 to DNPO Tower for landing instructions. At 18:28 h, the Tower instructed NCH138 to report field in sight. The flight crew acknowledged and reported RWY 03 in sight. Tower cleared NCH138 to land on RWY 03 and NCH138 was cautioned that the runway was wet. At 18:34 h, NCH138 executed and reported a missed approach. NCH138 requested a climb to 3500 ft. NCH138 was cleared to climb and instructed to report overhead POT. At 18:39 h, NCH138 requested a descent and clearance for an approach to RWY 21. Approach Control cleared NCH138 to descend to 2000 ft and report to Tower when established on the approach and also to report leaving 2000 ft. At 18:42 h, NCH138 reported inbound maintaining 2000 ft. The Approach Control requested the distance from the runway and sought consent of NCH138 for Arik 514 at the holding point to take off. NCH138 declined, as they were about 10 miles to touchdown. At 18:45 h, NCH138 reported five miles to touchdown. Approach Control acknowledged and instructed NCH138 to report field in sight and thereafter handed over to Tower on 119.2 MHz. When contacting the Tower, NCH138 was cleared to land on RWY 21, wind 0100 /10 kt and was advised to exercise caution due to wet runway. NCH138 acknowledged the clearance. NCH138 landed hard and bounced three times on the runway. According to the ATC controller, after touch down the aircraft rolled in an s-pattern before it overran the runway. NCH138 made a 180° turn with the right engine hitting the ground. The aircraft came to a final stop on the left side and 10 m beyond the stopway. The accident occurred at night in Instrument Meteorological Conditions (IMC). The Aerodrome Rescue and Fire Fighting Service (ARFFS) arrived the scene and commenced rescue operations immediately. All occupants on board were evacuated; one passenger sustaining a minor injury.", "probable_cause": "The decision to land following an unstabilized approach (high rate of descent and high approach speed. A go-around was not initiated.\r\nContributory factors:\r\n1. The deteriorating weather conditions with a line squall prevented a diversion to the alternates.\r\n2. The runway was wet with significant patches of standing water. "}