{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130e-hercules-lajes", "date": "Apr 15, 1984", "type": "Lockheed C-130 Hercules", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lajes - Lajes", "msn": "4029", "yom": 1965, "flight_number": null, "city": "Lajes", "zone": "Azores Islands", "country": "Portugal", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Crash on landing in Lajes in the following circumstances, according to the following testimony:\r\nI was the Maintenance Job Controller on duty when the day this occurred. The incident aircraft had declared an inflight emergency (IFE) for (if I recall correctly) #3 engine shutdown. In any case it was right wing engine that was out of service. Fire trucks were standing by as this was SOP for IFEs. The aircraft came in from south to north. On landing roll the crew reversed all three operating engines instead of only the running symmetrical engines of each wing.  Having twice the reverse thrust action exerted on the left wing caused the aircraft to yaw left and depart the runway. After going through the perimeter fence off to the left of the runway, it rode up some rock walls and nearly impacted two dwellings on the other side before coming to rest. The left wing caught on fire. In pictures that are available you can see where one of the propellers that departed on impact sliced a hole in the fuselage just in front of the red prop plane of rotation line on the left hand side. Fortunately, because the fire trucks were already lined up on the runway, the fire was extinguished quickly. The only injury to the aircrew was a broken finger. Some side notes. The aircraft was carrying the produce flown in weekly for the commissary on base, No big deal in the scope of things but fruits and veggies were in short supply unless you went local. Also, in one of those oddities of life that made it all the more surreal, the Line Chief had said over the maintenance radio just before it landed, “I hope he remembers to reverse only one and four when he lands.” The next words I heard from him were, “We have a 130 in the dirt!” “We have a 130 on fire!”  You just can’t make that stuff up. It was almost prescient. The aircraft was eventually mated with the cockpit section of C-130 that was written off due to a hard landing in Germany. They flew that in on a C-5 with replacement wings etc. Robbins Depot Maintenance came in and bolted it all together. It eventually flew out on a onetime flight to the depot in Italy. \r\nThanks to Bill Hewett, maintenance controller on duty when it occurred.", "probable_cause": null}