{"url": "https://www.baaa-acro.com/crash/crash-bae-125-1a-731-seattle", "date": "Dec 16, 2002 at 1907 LT", "type": "BAe 125", "operator": "National Aircraft Leasing", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sacramento – Seattle", "msn": "25020", "yom": 1964, "flight_number": null, "city": "Seattle-Boeing Field", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13497, "captain_hours_type": 1713, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14162, "circumstances": "The Co-Pilot was the flying pilot with the Captain giving directions throughout the approach phase. The Captain stated that he extended the flaps and the landing gear. When the aircraft touched down, the landing gear was not extended. The Co-Pilot reported that she did look down at the landing gear lever and at \"three green lights\" on the approach. The CVR was read out which indicated that the Co-Pilot directed the Captain to call inbound. The Captain acknowledged this and stated \"fifteen flaps.\" The Co-Pilot then stated \"fifteen flaps, before landing.\" The Captain did not respond to the Co-Pilot but instead made a radio transmission. The Captain shortly thereafter, stated that he was extending the flaps to 25 degrees. The Captain made another radio transmission to the tower when the Co-Pilot stated \"final, sync, ignitions.\" The Captain responded \"ignitions on.\" Full flaps were then extended. The Captain gave the Co-Pilot continued directions while on the approach for heading, speed and altitude. At approximately 300 feet, the Captain stated, \"yaw damper's off, air valves are off, ready to land.\" The Captain reported that it was obvious that touchdown was on the flaps and keel. The Captain stated that he raised the flaps, shutdown the engines, and confirmed that the landing gear handle was down. During the gear swing test the landing gear cycled several times with no difficulties. All red and green lights illuminated at the proper positions. During the test, it was found that the gear not extended horn did not function with the gear retracted, the flaps fully extended and the power levers at idle. Later a bad set of contacts to the relay was found. When the relay was jumped, the horn sounded. Inspection of the damage to the aircraft revealed that the outer rims of both outer tires displayed scrape marks around the circumference of the rim. The outer surface of the gear door fairings were scraped and the flap hinge fairings was ground down.", "probable_cause": "The landing gear down and locked was not verified prior to landing. The checklist was not followed, and an inoperative landing gear warning horn were factors."}