{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3c-mayne-island-2-killed", "date": "Jan 13, 1999 at 0633 LT", "type": "Douglas DC-3", "operator": "Kelowna%20Flightcraft", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Vancouver - Victoria", "msn": "16215/32963", "yom": 1945, "flight_number": "KFA301", "city": "Mayne Island", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 18000, "captain_hours_type": 9500, "copilot_hours": 9000, "copilot_hours_type": 430, "aircraft_hours": 20123, "circumstances": "The accident aircraft, a Douglas DC-3C, C-GWUG, was owned and operated by Kelowna Flightcraft Air Charter Ltd. (Kelowna Flightcraft) and was under charter to Purolator Courier Ltd. (Purolator). Since April 1998, the aircraft had been dedicated to transporting cargo on a route between Vancouver and Nanaimo, British Columbia. On occasion, it was also used for flights to Victoria to meet Purolator=s scheduling or cargo-loading contingencies. On the day of the accident, the aircraft, operating as KFA300, was rerouted and tasked to fly from Vancouver to Victoria and then proceed to Nanaimo. This change was precipitated by the delayed arrival of Purolator=s Boeing 727 at Vancouver because of inclement weather in the Toronto/Hamilton, Ontario, area. Warning of this route change was passed to the crew members with their pre-flight planning package, which included filed instrument flight rules (IFR) flight plans for the Vancouver-to-Victoria and Victoria-to-Nanaimo legs of the trip. The captain of the occurrence flight cancelled his IFR flight plan and refiled visual flight rules (VFR) on first contact with air traffic control. Vancouver tower cleared KFA300 for take-off at 0622 Pacific standard time (PST) from runway 26L. After take-off, the aircraft turned left on a track toward Active Pass, as seen in Figure 1. During the departure climb, the captain requested an altitude of 1000 feet above sea level (asl); the tower controller approved this request. Recorded radar data indicate that the aircraft climbed to and levelled at 1000 feet asl and then accelerated to a steady en route ground speed of 130 knots. The aircraft left the Vancouver control zone at 0626 and entered Class E (controlled) airspace. There are no special requirements for VFR aircraft operating within this class of airspace, nor are any specific services required of the air traffic control system. As the aircraft approached the Gulf Islands, it descended slightly and remained level at 900 feet asl. It crossed about 0.25 nautical mile (nm) west of the Active Pass non-directional beacon (NDB) at 0632 while remaining steady at 130 knots (ground speed) and level at 900 feet asl. At 0633:04, the aircraft descended to 800 feet asl for about nine seconds. The last radar data show the aircraft at 900 feet asl and 130 knots. The last radar-depicted position of the aircraft is on a bearing of 189 degrees (true) and 21.8 nm from the Sea Island radar source, coincident with the crash location.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The accident flight was not conducted in accordance with the night obstacle clearance requirements of Canadian Aviation Regulation (CAR) 705.32.\r\n2. The Kelowna Flightcraft company operations manual did not reflect the restrictive conditions imposed on night visual flight rules (VFR) flight by CAR 705.32. Such information might have\r\nprevented the accident by ensuring the crew's awareness of those night obstacle clearance standards.\r\n3. As the aircraft approached Mayne Island, it encountered a low cloud ceiling that was based about 800 feet and that reduced visual reference with the surface.\r\n4. When the aircraft struck trees, it was being flown in controlled, level flight at an altitude below the surrounding terrain.\r\n5. The aircraft was not equipped with a ground proximity warning system or any other similar system that could warn the crew of an impending collision with terrain. Such systems were not required by regulation.\r\nFindings as to Risk:\r\n1. Kelowna Flightcraft flight operations personnel were not aware that most of the DC-3 flights were being conducted under VFR.\r\n2. First responders were not aware of the presence of the dangerous goods and were therefore at increased risk during their response activities on the site.\r\nOther Findings:\r\n1. Transport Canada officials responsible for monitoring this operation were not aware that most of the DC-3 flights were being conducted under VFR at night and below the required obstacle \r\nclearance altitudes."}