{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950ex-opotiki-1-killed", "date": "Nov 10, 2007 at 1320 LT", "type": "Fletcher FU-24", "operator": "Super%20Air", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Mountains", "schedule": null, "msn": "244", "yom": 1977, "flight_number": null, "city": "Opotiki", "zone": "Bay of Plenty Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5243, "captain_hours_type": 4889, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the afternoon of Friday 9 November 2007, the pilot of ZK-EGV, a specialised agricultural aeroplane powered by a turbine engine, began a task to sow 80 tonnes of superphosphate over a farm situated in low hills 5 km south of Opotiki township and 4 km from the Opotiki aerodrome. The pilot was familiar with the farm’s airstrip where he loaded the product, and with the farm. After 6 or 7 loads, the wind was too strong for top-dressing, so the pilot and loader-driver flew back to their base at the Whakatane aerodrome, about 40 km away. At Whakatane, the aeroplane’s fuel tanks were filled. Later that day, the pilot replaced the display for the aeroplane’s precision sowing guidance system, which had a software fault. The next morning, 10 November 2007, the pilot bicycled about 6 km from his house to the Whakatane aerodrome. The loader-driver said that the pilot looked “pretty tired” from the effort when he arrived at the aerodrome at about 0545. After the aeroplane had been started using its internal batteries, the pilot and loader-driver flew to complete a task at a farm west of Whakatane. The pilot’s notebook recorded that he began the task at 0610 and took 45 loads to spread the remaining 68 tonnes of product, an average load of 1511 kilograms (kg). The loader-driver said that the pilot had determined about 2 months earlier that the scales on the loader used at that airstrip were “weighing light” by about 200 kg, so the loader-driver allowed for that difference. After that task, the pilot and loader-driver flew back to the farm south of Opotiki where they had been the previous afternoon. A different loader at that airstrip had accurate scales, and the loader-driver said that he loaded 1500 kg each time, as requested by the pilot. The fertiliser that remained in the farm airstrip storage bin after the accident was found to be dry and free flowing. The sowing task at this farm began at 1010 and the pilot stopped after every hour to uplift 180 litres (L) of fuel, which weighed 144 kg. During the last refuel stop, between 1226 and 1245, he had a snack and a drink. Sowing recommenced at 1245 with about 3 minutes between each load, the last load being put on at about 1316. The loader-driver said the wind at the airstrip was light and the pilot did not report any problem with the aeroplane. After the last refuel, the top-dressing had been mostly out of sight of the loader-driver. When the aeroplane did not return when expected for the next load, the loader driver tried 3 or 4 times to call the cellphone installed in the aeroplane. This was unsuccessful, so at 1338 he followed the operator’s emergency procedure and called 111 to report that the aeroplane was overdue. Telephone records showed that on 10 November 2007 the aeroplane cellphone had been connected for a total of more than 90 minutes on 14 voice calls, and had been used to send or receive 10 text messages. Correlation of the call times with the job details recorded by the pilot suggested he sent most of his messages while the aeroplane was on the ground. Nearly all of the calls and messages involved a female work colleague who was a friend. The pilot initiated most calls by sending a message, but each time that the signal was lost during a call, the friend would stop the call and immediately re-dial the aeroplane phone; so, in some cases, consecutive connections were parts of one long conversation. The longest session exceeded 35 minutes. The nature of the calls could not be determined, but the friend claimed the content of the last phone call was not acrimonious or likely to have agitated the pilot. The friend advised that the pilot had said he often made the phone calls to help himself stay alert. At 1153, in a phone call to his home, the pilot indicated that the job was going well and he might be home by about 1400. In one call to the friend, the pilot said that he was a bit tired and that he hoped the wind would increase enough that afternoon to force him to cancel the next job. At 1308:45, the friend called the aeroplane phone and talked with the pilot until the call was disconnected at 1320:14. The friend said that while the pilot had been talking, the volume of his voice decreased slightly then there was a “static” sound. Apart from the reduced volume, the pilot’s voice had sounded normal and he had not suggested anything untoward regarding the job or the aeroplane. The friend immediately called back, but got the answerphone message from the aeroplane phone. Two further attempts to contact the pilot were unsuccessful, but the friend did not consider that anything untoward might have happened. An orchardist who was working approximately 3 km from the farm being top-dressed had heard an aeroplane flying nearby for some hours before he heard a loud sound that led him to fear that there had been an accident. He noted that the time was 1320 and immediately began to search the surrounding area. After the loader-driver’s emergency call, the Police organised an aerial search, which found the wreckage of the aeroplane at 1435 on the edge of a grove of native trees, approximately 600 metres (m) northwest of the area being top-dressed. The pilot had been killed. His body was not removed until 26 hours after the accident, because of a Police concern not to disturb the wreckage until aviation accident investigators were present. The CAA began an investigation that day into the accident and the Commission sent an investigator to help determine whether there were any similarities with another Fletcher accident that the Commission was then investigating. On 19 November 2007, because of potential issues that concerned regulatory oversight, the Commission started its own inquiry. ", "probable_cause": "Findings are listed in order of development and not in order of priority.\r\n- The reason for the aeroplane colliding with trees was not conclusively determined. However, the pilot was affected by a number of fatigue-inducing factors, none of which should have been significant on its own. The combination of these factors and the added distractions of a prolonged cell phone call and a minor equipment failure were considered likely to have diverted the pilot’s attention from his primary task of monitoring the aeroplane’s flight path.\r\n- Although pilot incapacitation could not be ruled out entirely, it was considered that the pilot’s state of health had not directly contributed to the accident.\r\n- The potential distraction of cellphones during critical phases of flight under VFR was not specifically addressed by CARs. \r\n- Apart from the probable failure of the GPS sowing guidance equipment, no evidence was found to suggest that the aeroplane was unserviceable at the time of the accident, but its airworthiness certificate was invalid because there was no record that the mandatory post-flight checks of the vertical tail fin had been completed in the previous 3 days.\r\n- The installation of a powerful turbine engine without an effective means of de-rating the power created the potential for excessive power demands and possible structural overload, but this was not considered to have contributed to the accident.\r\n- The pilot was an experienced agricultural pilot in current practice. Although he had met the operator’s continued competency requirements, the operator’s method of conducting his last 2 competency checks was likely to have made them invalid in terms of the CAR requirements.\r\n- Although the aeroplane was grossly overloaded and the hopper load exceeded the structural limit on the take-off prior to the accident, neither exceedance contributed to the accident, and the aeroplane was not overloaded at the time of the accident.\r\n- The emergency locator transmitter did not radiate a useful signal because of damage to the antenna socket on the unit. The installation was also not in accordance with the manufacturer’s instructions or the recommended practice. "}