{"url": "https://www.baaa-acro.com/crash/crash-atr72-202-palermo-16-killed", "date": "Aug 6, 2005 at 1539 LT", "type": "ATR72-200", "operator": "Tuninter.gif", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Bari – Djerba", "msn": "258", "yom": 1992, "flight_number": "TUI1153", "city": "Palermo", "zone": "Sicily", "country": "Italy", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 35, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": 7182, "captain_hours_type": 5582, "copilot_hours": 2431, "copilot_hours_type": 2130, "aircraft_hours": 29893, "circumstances": "The aircraft departed Bari at 1432LT on flight TUI1153 to Djerba with 39 people on board, 4 crew members, 35 passengers among which one airline engineer. While cruising, approximately 50 minutes after takeoff, at flight level 230, the right engine shut down and after approximately 100 seconds, also the left engine shut down. The flight crew decided to divert to the airport at Palermo, Punta Raisi, to make a precautionary landing. The crew referred to having tried to restart both engines, but without success. After gliding approximately 16 minutes, the aircraft ditched approximately 23 nautical miles northeast from Palermo's airport, Punta Raisi, within Italian territorial waters. On impact with the surface of the sea, the aircraft broke into three pieces; 14 passengers, the airliner engineer and a member of the crew (senior flight attendant) reported fatal injuries. The other occupants suffered serious to minor injuries. ", "probable_cause": "The accident under examination, as most aviation accidents, has been determined by a series of events linked one another, which caused the final ditching. The ditching was primarily due to the both engines flame out because of fuel exhaustion. The incorrect replacement of the fuel quantity indicator (FQI) was one of the contributing factors which led irremediably to the accident. The accident’s cause is therefore traceable firstly to the incorrect procedure used for replacing the FQI, by means of the operator’s maintenance personnel. This shall be considered the disruptive element, which caused the final ditching of the aircraft due to the lack of fuel that caused the shutdown of both engines. As said before the accident was determined by a series of events (contributing factors) linked one another. Hereafter are listed some considered of major importance.\r\n- Errors committed by ground mechanics when searching for and correctly identifying the fuel indicator.\r\n- Errors committed by the flight crew: non-respect of various operational procedures.\r\n- Inadequate checks by the competent office of the operator that flight crew were respecting operational procedures.\r\n- Inaccuracy of the information entered in the aircraft management and spares information system and the absence of an effective control of the system itself.\r\n- Inadequate training for aircraft management and spares information system use and absence of a responsible person appointed for managing the system itself.\r\n- Maintenance and organization standards of the operator unsatisfactory for an adequate aircraft management.\r\n- Lack of an adequate quality assurance system;\r\n- Inadequate surveillance of the operator by the competent Tunisian authority.\r\n- Installation characteristics of fuel quantity indicators (FQI) for ATR 42 and ATR 72 which made it possible to install an ATR 42 type FQI in an ATR 72, and vice versa.\r\nThe analysis of various factors that contributed to the event has been carried out according to the so called Reason’s \"Organizational accident\" model. Active failures, which had triggered the accident, are those committed both by ground mechanics/technicians the day before the event while searching for and replacing the fuel quantity indicator, and by the crew who did not verify and fully and accurately complete the aircraft’s documentation, through which it would have been possible to perceive an anomalous situation regarding the quantity of fuel onboard. Latent failures, however, remained concealed, latent in the operator’s organizational system until, some active errors (by mechanics and pilots) were made, overcoming the system’s defence barriers, causing the accident. Analysing latent and active failures (errors) traceable to various parties, involved in the event in several respects, it clearly emerges that they were operating in a potentially deceptive organizational system. When latent failures remain within a system without being identified and eliminated, the possibility of mutual interaction increases, making the system susceptible for active failures, or not allowing the system to prevent them, in case of errors. Active failures were inserted in a context characterised by organizational and maintenance deficiencies. The error that led to the accident was committed by mechanics who searched for and replaced the FQI, but this error occurred in an organizational setting in which, if everybody were operating correctly, probably the accident would not have occurred. Inaccuracy of information entered in the aircraft management and spares information system, particularly regarding the interchangeability of items and the absence of an effective control of the system itself, has been considered in fact one of the latent failures that contributed to the event. The maintenance and organization standards of the operator, at the time of event, were not considered satisfactory for an adequate management of the aircraft. The flight crew and maintenance mechanics/technicians involved in the event, when they made incorrect choices and took actions not complying with standard procedures, did not receive sufficiently effective aid from the system in order to avoid the error."}