{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-la-ronge", "date": "Sep 21, 2004 at 1410 LT", "type": "Swearingen SA227 Metro III", "operator": "Norcanair", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Stony Rapids - La Ronge", "msn": "AC-524", "yom": 1982, "flight_number": "KA1501", "city": "La Ronge", "zone": "Saskatchewan", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A Northern Dene Airways Ltd. Metro III (registration C-FIPW, serial number AC524), operating as Norcanair Flight KA1051, departed Stony Rapids, Saskatchewan, with two crew members and nine passengers on a day, visual flight rules flight to La Ronge, Saskatchewan. On arrival in La Ronge, at approximately 1410 central standard time, the crew completed the approach and landing checklists and confirmed the gear-down indication. The aircraft was landed in a crosswind on Runway 18 and touched down firmly, approximately 1000 feet from the threshold. On touchdown, the left wing dropped and the propeller made contact with the runway. The aircraft veered to the left side of the runway, despite full rudder and aileron deflection. The crew applied maximum right braking and shut down both engines. The aircraft departed the runway and travelled approximately 200 feet through the infield before the nose and right main gear were torn rearwards; the left gear collapsed into the wheel well. The aircraft slid on its belly before coming to rest approximately 300 feet off the side of the runway. Three of the passengers suffered minor injuries from the sudden stop associated with the final collapsing of the landing gear; the other passengers and the pilots were not injured.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. An incorrect roller of a smaller diameter and type was installed on the left main landing gear outboard bellcrank assembly, contrary to company and industry practice.\r\n2. The smaller diameter roller reduced the required rigging tolerances for the bellcrank-to-cam assembly in the down-and-locked position and allowed the roller to eventually move beyond the cam cutout position, resulting in the collapse of the left landing gear.\r\n3. A rigging check was not carried out after the replacement of the bellcrank roller. Such a check should have revealed that neither the inboard nor outboard bellcrank assembly met the minimum rigging requirements for proper engagement with the positioning cam."}