{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-barrow-8-killed", "date": "Nov 8, 1997 at 0808 LT", "type": "Cessna 208B Grand Caravan", "operator": "Hageland-Aviation-Services-2", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Barrow - Wainwright", "msn": "208B-0504", "yom": 1996, "flight_number": "HAG500", "city": "Barrow", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 3500, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1466, "circumstances": "The pilot, who was also the station manager, arrived at the airport earlier than other company employees to prepare for a scheduled commuter flight, transporting seven passengers and cargo to another village during hours of arctic, predawn darkness. Heavy frost was described on vehicles and airplanes the morning of the accident, and the lineman who serviced the airplane described a thin glaze of ice on the upper surface of the left wing. The pilot was not observed deicing the airplane prior to flight, and was described by the other employees as in a hurry to depart on time. The pilot directed the lineman to place fuel in the left wing only, which resulted in a fuel imbalance between 450 and 991 pounds (left wing heavy). The first turn after takeoff was into the heavy left wing. The airplane was observed climbing past the end of the runway, and descending vertically into the water. No preimpact mechanical anomalies were found with the airplane or powerplant. The aileron trim indicator was found in the full right wing down position. Postaccident flight tests with left wing heavy lateral fuel imbalances, disclosed that approximately one-half of right wing down aileron control deflection was used to maintain level flight, thus leaving only one-half right wing down aileron control efficacy. Research has shown that frost on airfoils can result in reduced stall angles of attack (often below that required to activate stall warning devices), increases in stall speeds between 20% and 40%, asymmetric stalls resulting in large rolling moments, and differing stall angles of attack for wings with upward and downward deflected ailerons (as when recovering from turns). ", "probable_cause": "The pilot's disregard for lateral fuel loading limits, his improper removal of frost prior to takeoff, and the resulting inadvertent stall/spin. Factors involved in this accident were the improper asymmetrical fuel loading which reduced lateral aircraft control, the self-induced pressure to takeoff on time by the pilot, and inadequate surveillance of the company operations by company management. "}