{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-greenwood-5-killed", "date": "Sep 11, 1992 at 1457 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Solar Sources", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Greenwood - Columbus", "msn": "770", "yom": 1980, "flight_number": null, "city": "Greenwood-Indy South", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 19473, "captain_hours_type": 9000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4098, "circumstances": "The PA-32, N82419, had been receiving atc radar services en route to the Greenwood Municipal Airport. Radar services were terminated 3 miles from the airport. The MU-2, N74FB, had just taken off from the airport, and had reported to ATC in anticipation of receiving his IFR clearance. The flight had not yet been identified on radar. The two airplanes collided approximately 2 miles from the airport at 2,100 feet msl. The collision took place just outside and to the east of the Indianapolis airport radar service area (arsa). The MU-2 track was 066°, and the PA-32 track was 174°. The pax/pilot on the PA-32 took control of the airplane and was able to make a controlled landing. Guidance for traffic pattern operations and recommended arrival and departure procedures is found in the airman's information manual. All five occupants on board the MU-2 were killed. ", "probable_cause": "The inherent limitations of the see-and-avoid concept of separation of aircraft operating under visual flight rules that precluded the pilots of the MU-2 and the PA-32 from recognizing a collision hazard and taking actions to avoid the midair collision. Contributing to the cause of the accident was the failure of the MU-2 pilot to use all the air traffic control services available by not activating his instrument flight rules flight plan before takeoff. Also contributing to the cause of the accident was the failure of both pilots to follow recommended traffic pattern procedures, as recommended in the airman's information manual, for airport arrivals and departures."}