{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2b-21-islander-devils-hole", "date": "Nov 3, 2013 at 1020 LT", "type": "Britten-Norman Islander", "operator": "CIAS", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Guernsey - Guernsey", "msn": "2162", "yom": 1982, "flight_number": null, "city": "Devils'Hole", "zone": "Channel Islands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 25200, "captain_hours_type": 60, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At approximately 1830 hrs on 3 November 2013 the operator’s duty pilot received a request that the aircraft should be dispatched to carry out a search. The volunteer crew-members were alerted and made their way to the airport. Weather conditions in the Channel Islands were poor, with a southerly wind gusting up to 41 kt, turbulence, rain, cloud below 1,000 ft aal, and visibility of 3 to 6 km. On arrival at the aircraft’s hangar, the crew was established, consisting of a pilot, search director, and three observers. They donned immersion suits and life jackets and prepared for flight. The search director obtained details of the search request, which was to search for two fishermen near Les Écréhous (a group of rocks in the English Channel approximately 5 nm north-east of the north-eastern corner of Jersey). Some evidence suggested the men were in a small dinghy; other information was that they were in the water. The men were reported to be alive and communicating by mobile telephone. One crew-member carried out pre-flight preparations, although he did not check the fuel quantities or carry out a water drain check. When interviewed, he recalled having reported to the pilot that he had not checked the fuel. The aircraft was then pulled out of its hangar and the search director explained the details of the search request to the pilot and other crew-members. Bearing in mind the weather, the fact that it was dark, and the fishermen’s predicament, the pilot recognized the need for “a lot of urgency” about the task. In the context of the operation, he regarded the task as being routine, but the weather not so. The pilot “walked round” the aircraft, though he did not carry out a formal pre-flight inspection; it was the organization’s custom to ensure that the aircraft was ready for flight at all times. The technical log showed that the aircraft was serviceable, with no deferred defects, and that the wing tanks contained 55 USG each side and the tip tanks, 18 USG each side. The search director recalled asking the pilot whether he was content to fly in the prevailing conditions, and that the pilot stated that he was willing to fly. The crew boarded the aircraft. The observer in the front right-hand seat had recently obtained a Private Pilot’s Licence and this influenced the decision for him to be placed next to the pilot. The pilot reported that he carried out a “fairly rapid” start, although the normal pre-departure sequence was interrupted while a problem with switch selections, affecting the functioning of the search equipment in the aircraft’s cabin, was resolved. The pilot obtained clearance  from ATC to taxi, enter the runway, and take off when ready. He described that he carried out engine power checks during a brief back-track, checking the magnetos and propeller controls at 2,100 rpm, before carrying out pre-takeoff checks. He did not refer to the written checklists  provided in the aircraft but executed a generic set of checks from memory. Following an unremarkable takeoff, in the strong crosswind , the pilot corrected for drift and established a climb towards a cruising altitude of 900 ft. When interviewed, he described the conditions as being “awful” and “ghastly”, with turbulence from the cliffs contributing to occasional activation of the stall warner, even though the speed was “probably 100 plus knots” . At 900 ft, the aircraft was “in the bottom” of the cloud, which was unhelpful for the observers, so the pilot descended the aircraft to cruise at 500 or 600 ft, flying by reference to the artificial horizon, and making constant control inputs to maintain straight and level flight. He stated that, although he would normally have begun checking fuel flow, mixture settings, etc, shortly after establishing in the cruise, he found that the conditions required him to devote his full attention to flying the aircraft. As the aircraft passed north abeam the western end of Jersey, the rain and low cloud continued and the turbulence worsened, The pilot gained sight of red obstacle lights on a television mast on the north side of the island but had few other visual references. The pilot noticed a change in an engine note. He immediately “reached down to put the hot air on” which made little difference; the observer recalled that the pilot checked that the mixtures were fully rich at this time. The right-hand engine rpm then began surging. The pilot made a quick check of the engine instruments, before applying full throttle on both engines, setting both propellers to maximum rpm and beginning a climb. The observer noticed that the fuel pressure gauge for the right-hand engine was “going up and down” but did not mention this to the pilot; the pilot did not see the gauge indication fluctuating. Around this time the pilot switched the electric fuel pumps on. The pilot turned the aircraft towards Jersey and made a MAYDAY call to ATC; the search director made a similar call on the appropriate maritime frequency. These calls were acknowledged, and a life boat, on its way to Les Écréhous, altered course towards the aircraft’s position. Although the pilot was “amazed” at how few lights he could see on the ground, he perceived what he thought was the runway at Jersey Airport, and flew towards it. The aircraft reached approximately 1,100 ft amsl. The right-hand engine then stopped. The pilot carried out the shut-down checks, feathering the propeller as he did so. The aircraft carried on tracking towards Jersey Airport, descending towards the north side of the island. Some moments later, the left-hand engine’s rpm began to fluctuate briefly before it also stopped. The pilot later recalled being “fairly certain” that he “was trying to change tanks” but acknowledged that he could not recall events with certainty. He trimmed the aircraft for a glide, still heading towards the airport at Jersey, but with very limited visual references outside the cockpit. The crew-members prepared the cabin for a ditching or off-airport landing; the observers in the rear-most seats considered how they might deploy the aircraft’s life raft (stored behind their seats) should a ditching occur. The pilot’s next recollection was that the automated decision height voice call-out activated (he had selected it to announce at 200 ft radio height). He switched the landing lights on and maintained a “reasonable speed” in anticipation of landing or ditching. One crew-member recalled the pilot calling “brace, brace, brace”, while another recalled being instructed to tighten seat belts and brace. No brace position had been set out in the operations manual, or rehearsed in training, and the responses of the crew-members to this instruction varied. The pilot glimpsed something green in front of the aircraft, and flared for landing. The aircraft touched down and decelerated, sliding downhill and passing through a hedge. With the aircraft now sliding somewhat sideways, it came to a halt when its nose lodged against a tree, with significant airframe damage. The pilot made various cockpit selections safe and all the occupants vacated the aircraft, with some difficulty. The search director became entangled in his headset lead as he egressed but freed himself. The front seat occupants experienced difficulty because their door could not be opened. They climbed over the search director’s desk and vacated the aircraft via the door adjacent to the search director’s position (the rear-row observers simultaneously opened the pilot’s door from the outside). The pilot and crew made their way to nearby habitation where they were subsequently assessed by an ambulance crew; none were injured. The search director returned to the aircraft with fire-fighters, to ensure that pyrotechnics and the self-inflating life raft on board the aircraft did not pose a hazard. In his very frank account of the flight, the pilot acknowledged that a decision to turn back soon after departure would have been justified by the weather conditions. He added that before the engine power changed, his workload was already very high, on account of the task and conditions.", "probable_cause": "The inspection of the aircraft at the accident site, combined with the crew accounts gathered early in the AAIB accident investigation, indicated that no mechanical or electrical defect had been a factor in the accident. The evidence indicated that the fuel supply to the right-hand engine, and then the left-hand engine, had become exhausted in flight and the engines ceased producing power approximately 15 minutes after the aircraft became airborne. The fuel selector was found in the 'tip tank' position. It appears that the tip tanks had been selected on a flight the previous day and the selection had not been changed. At the commencement of the accident flight, each tip tank contained approximately 5-6 USG."}