{"url": "https://www.baaa-acro.com/crash/crash-partenavia-p68b-victor-kolane", "date": "Oct 14, 1988 at 1845 LT", "type": "Partenavia P.68", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kolane - Taroom - Kolane", "msn": "95", "yom": 1977, "flight_number": null, "city": "Kolane", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Taroom aerodrome had recently been equipped with a pilot activated lighting (PAL) system which was due to be commissioned on the evening of 15 October 1988. The pilot, who is a local Council member had flown from his property \"Kolane\" to Taroom late in the afternoon, to check that the PAL system was functional. He had intended to fly to Taroom the following evening to activate the lights for the official opening celebration, which was planned to be held at the aerodrome. After checking that the system was working the pilot decided to take the opportunity to practice some night circuits and landings before returning to his property. Before departing Taroom he arranged to have two vehicles positioned at his property landing area to illuminate the strip which is 850 metres long, aligned 235/055 degrees magnetic, and 1000 feet above sea level. He apparently intended to check the suitability of the strip for a night landing on his return. The aircraft was observed to fly over the strip in a north-easterly direction and then make a left turn. The aircraft was then seen to descend and the sound of impact was heard by the occupant of a vehicle near the strip. The aircraft had impacted the ground whilst in a descending left turn at a ground speed of approximately 125 knots. Initial impact was in a clearing near trees. The aircraft slid 91 metres before the left wing struck a large tree and was torn off. The aircraft slid another 45 metres before coming to rest and catching fire. The pilot was thrown from the aircraft while still strapped to his seat and was able to move himself away from the immediate vicinity of the fire before help arrived. ", "probable_cause": "The pilot has no recollection of events immediately prior to the accident. There is no indication that the aircraft was not functioning normally at the time of the accident. The weather was fine, there was a light northerly breeze, and there was no moonlight. Indications are that the pilot may have become disorientated whilst attempting to carry out a visual circuit when there was no visual horizon. The landing area did not meet the requirements for night operations published in the Visual Flight Guide. \r\nThe following factor was considered relevant to the development of the accident:\r\nThe pilot was attempting to carry out a night visual circuit when there was no visual horizon. "}