{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226at-merlin-iva-tamworth-1-killed", "date": "Mar 9, 1994 at 1734 LT", "type": "Swearingen SA226AT Merlin IV", "operator": "Jetcraft-Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Inverell – Glen Innes – Armidale – Tamworth – Sydney ", "msn": "AT-033", "yom": 1975, "flight_number": null, "city": "Tamworth", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2782, "captain_hours_type": 335, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "VH-SWP was operating on a standard company flight plan for the route Bankstown-Tamworth-Armidale-Glen Innes-Inverell and return, and the flight plan indicated the flight would be conducted in accordance with IFR procedures. The classification of the flight was shown as non-scheduled commercial air transport although the aircraft was operating to a company schedule, and departure and flight times for each route segment were indicated on the flight plan. The aircraft departed Bankstown at about 0640 and proceeded as planned to Inverell where the pilot rested until his departure that afternoon for the return journey. The schedule required an Armidale departure at 1721. At 1723 the pilot reported to Sydney Flight Service that he was departing Armidale for Tamworth. The planned time for the flight was 17 minutes. Although the flight-planned altitude for this sector was 6,000 ft, the pilot was unable to climb immediately because a slower aircraft, which had departed Armidale for Tamworth two minutes earlier, was climbing to that altitude. In addition, there was opposite direction traffic at 7,000 ft. The next most suitable altitude was 8,000 ft, but separation from the other two aircraft, which were also IFR, had to be established by the pilot before further climb was possible. The published IFR lowest safe altitude for the route was 5,400 ft. The pilot subsequently elected to remain at 4,500 ft in visual meteorological conditions (VMC) and at 1727 requested an airways clearance from Tamworth Tower. A clearance was issued by ATC to the pilot to track direct to Tamworth at 4,500 ft visually. At about 1732 the pilot requested a descent clearance. He was cleared to make a visual approach with a clearance limit of 5 NM by distance measuring equipment (DME) from Tamworth, and was requested to report at 8 DME from Tamworth. The pilot acknowledged the instructions and reported leaving 4,500 ft on descent. Transmissions from ATC to the pilot less than two minutes later were not answered. The aircraft was not being monitored on radar by ATC, nor was this a requirement. At about 1740, reports were received by the police and ATC of an explosion and possible aircraft accident near the mountain range 8 NM north-east of Tamworth Airport. The aircraft wreckage was discovered at about 2115 by searchers on the mountain range.Soon after the aircraft was reported missing, a search aircraft pilot, who had extensive local flying experience, reported to ATC that the top of the range (where the accident occurred) was obscured by cloud, and that there was very low cloud in the valley nearby.", "probable_cause": "The following findings were reported:\r\n- The pilot was making a visual approach in weather conditions unsuitable for such an approach.\r\n- The pilot had not flown this route before.\r\n- The aircraft was flown below the lowest safe altitude in conditions of poor visibility."}