{"url": "https://www.baaa-acro.com/crash/crash-douglas-b-18a-bolo-mt-waternomee-2-killed", "date": "Jan 14, 1942 at 2000 LT", "type": "Douglas B-18 Bolo", "operator": "USAAF", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "Yes", "site": "Mountains", "schedule": "Westover - Westover", "msn": "2619", "yom": 1937, "flight_number": null, "city": "Mt Waternomee", "zone": "New Hampshire", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane departed Westover AFB at the end of the afternoon on a maritime patrol flight off the east US coast after a German submarine have been located in this area. Following an uneventful mission, the crew returned to base in the evening. Approaching the coast, the crew noted that weather conditions deteriorated and that the visibility was low due to clouds down to 4,000 feet. The captain decided to continue the flight under the cloud layer but failed to realize that the wind was strong. While cruising at night and in snow falls, the twin engine airplane hit tree tops and crashed in a wooded area located on Mt Waternomee, in the White Mountain National Forest. SAR teams arrived on the scene two hours later and were able to evacuate five injured crew while two others were killed.\r\nCrew:\r\n1st Lt Anthony Benvenutto, pilot, \r\n2nd Lt Woodrow A. Kantner, copilot, \r\n2nd Lt Fletcher Craig, navigator, \r\nPfc Richard G. Chubb, flight engineer, \r\nPfc Noah W. Phillips Jr., radio operator, †\r\nPfc Raymond F. Lawrence, bomb aimer, †\r\nRobert P. Picard, photographer. ", "probable_cause": "According to US military experts, it appears that the accident was caused by the fact that the crew was not conscious of his real position due to poor weather conditions. The crew thought they were approaching Westover AFB by the South while they were approaching from the North (the airplane strayed off course due to strong unfavorable winds). Due to poor weather conditions, all ground beacons and markers were out of service and the visibility was reduced due to the night associated to snow falls. In such conditions, the crew did not have any sufficient visual ground or sky heavenly references."}