{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-pompano-beach", "date": "Oct 21, 2004 at 1748 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Twin-Air", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Moss Town – Fort Lauderdale", "msn": "31-7552022", "yom": 1975, "flight_number": null, "city": "Pompano Beach", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 19269, "circumstances": "Before the start of the trip, the pilot was reportedly given $500.00 cash by the operator to purchase fuel. The pilot stated that the first leg of the flight from KFLL to MYEF departed with the main fuel tanks full and approximately 10 gallons in each of the auxiliary fuel tanks. There were no deviations en-route, and the uneventful flight lasted a reported 1 hour 40 minutes. After landing in Exuma International Airport, the main fuel tanks contained slightly more than 1/2 fuel capacity. Ten gallons of fuel were added to each of the two auxiliary fuel tanks at MYEF, no additional fuel was purchased. The flight departed for KFLL, and during the climb to 10,000 feet, he leaned the fuel/air mixture. During the cruise portion of the flight, the fuel in the auxiliary fuel tanks was consumed then he switched to the main fuel tanks to supply fuel to the engines. The flight crossed the DEKAL intersection at 4,000 feet, which is about 31 nautical miles southeast of KFLL, continued, and the right engine manifold pressure decreased, the cylinder head temperature reached red line indication, and the engine sputtered. He declared an emergency with air traffic control and the controller provided vectors to KFLL which he verbally acknowledged but did not comply with. While operating single engine, with the engine operating at full power, he reported no discrepancies with the left engine. He reported he could reach KFLL but was concerned about flying over a populated area at a low altitude, and was losing altitude. Contrary to the statement made by the pilot that he was not able to maintain altitude while flying single-engine, the airplane was capable of a rate of climb greater than 170 feet-per-minute if flown properly. He elected to ditch the airplane in the Atlantic Ocean; the airplane was not recovered. The operator was asked repeatedly by NTSB for historical fuel receipts and flight hours for N61518 but did not comply. NTSB review of fuel consumption calculations performed by the Federal Aviation Administration (FAA) Inspector-In-Charge revealed the aircraft would have experienced fuel exhaustion at the approximate location and time when the pilot declared an emergency with ATC following failure of the right engine. The NTSB did not receive the NTSB requested detailed, signed, dated statement from the pilot.", "probable_cause": "The pilot's inadequate in-flight planning/decision, which resulted in fuel exhaustion and the loss of engine power in one engine. Contributing factors were the pilot's inadequate handling of the aircraft following failure of the right engine for his failure to extract maximum single engine performance, and his failure to properly refuel the aircraft."}