{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-spokane-2-killed", "date": "May 7, 2015 at 1604 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Rocket-Engineering", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Spokane - Spokane", "msn": "46-36031", "yom": 1996, "flight_number": null, "city": "Spokane-Felts Field", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5800, "captain_hours_type": 950, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The commercial pilot was departing on a local post-maintenance test flight in the single-engine airplane; Four aileron cables had been replaced during the maintenance. Shortly after takeoff, the airplane began to roll right. As the climb progressed, the roll became more pronounced, and the airplane entered a spiraling dive. The pilot was able to maintain partial control after losing about 700 ft of altitude; he guided the airplane away from the airport and then gradually back for a landing approach. During this period, he reported to air traffic control personnel that the airplane had a \"heavy right aileron.\" As the airplane passed over the runway threshold, it rolled right and crashed into a river adjacent to the runway. The aircraft was destroyed and both occupants were killed. ", "probable_cause": "The mechanic's incorrect installation of two aileron cables and the subsequent inadequate functional checks of the aileron system before flight by both the mechanic and the pilot, which prevented proper roll control from the cockpit, resulting in the pilot's subsequent loss of control during flight. Contributing to the accident was the mechanic's and the pilot's self-induced pressure to complete the work that day.\n"}