{"url": "https://www.baaa-acro.com/crash/crash-learjet-25c-juiz-de-fora-2-killed", "date": "Apr 6, 1990 at 1503 LT", "type": "Learjet 25", "operator": "Transamérica Táxi Aéreo", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rio de Janeiro – Juiz de Fora – Belo Horizonte – Monte Carlos", "msn": "25-108", "yom": 1973, "flight_number": null, "city": "Juiz de Fora", "zone": "Minas Gerais", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": 9, "aircraft_hours": null, "circumstances": "The aircraft departed Rio de Janeiro-Santos Dumont Airport on a cargo flight to Monte Carlos with intermediate stops in Juiz de Fora and Belo Horizonte, carrying two passengers, two pilots and a load of bank notes. Because the crew failed to prepare the flight according to procedures, the aircraft left Rio de Janeiro with a total weight in excess of 711 kilos. Following a poor flight and approach planning, the crew failed to make the appropriate landing calculations and upon arrival, the total weight of the aircraft was 946 kilos above the max landing weight. The aircraft landed on a wet runway and after touchdown, the spoilers did not deployed. Unable to stop within the remaining distance, the aircraft overran, went down an embankment and came to rest in a plantation, bursting into flames. A pilot and a passenger were killed while both other occupants were injured. The aircraft was destroyed. ", "probable_cause": "It was determined that the accident was the consequence of the following factors: \r\n- Poor flight preparation, \r\n- Poor flight planning, \r\n- Poor approach planning,\r\n- The crew failed to calculate the landing distance and performances,\r\n- Poor crew coordination, \r\n- Poor judgement on part of the crew about the existing flight conditions, \r\n- Lack of supervision, \r\n- Lack of crew training, \r\n- Poor crew experience on such type of aircraft,\r\n- The crew failed to initiate a go-around procedure following a wrong landing configuration. "}