{"url": "https://www.baaa-acro.com/crash/crash-dornier-do328-110-bremen", "date": "Dec 2, 2001 at 1833 LT", "type": "Dornier DO328", "operator": "OLT", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Braunschweig - Bremen", "msn": "3009", "yom": 1994, "flight_number": null, "city": "Bremen-Neuenland", "zone": "Bremen", "country": "Germany", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6000, "captain_hours_type": 1500, "copilot_hours": 1900, "copilot_hours_type": 1000, "aircraft_hours": 10340, "circumstances": "Following an uneventful ferry flight from Braunschweig, the crew was cleared to land on runway 27 at Bremen-Neuenland Airport. After touchdown, the crew started the braking procedure and activated the reverse thrust systems on both engines. At a speed of 60 knots, the aircraft deviated to the right so the captain applied left rudder. The aircraft turn 15° to the left so the captain applied right rudder when the aircraft turned 135° to the right. This turn was so abrupt that it caused the left main gear to collapse. The aircraft rolled for about 1,150 metres before coming to rest. All three crew members evacuated uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "The accident is due to the fact that the speed display in the cockpit became unusable during the tailwind landing in reverse thrust operation. The following contributing factors were identified: \r\n- The crew failed to comply with published procedures as the reverse thrust systems were not deactivated when the speed of 60 knots was reached during the deceleration manoeuvre, \r\n- The aircraft became unstable while its speed was decreasing during reverse thrust operation,\r\n- The aircraft was oversteered,\r\n- No references either in the AFM or in the AOM on an influence on the speed display by the reverse thrust operation in connection with tail wind up to the permissible value were given,\r\n- In Chapter 05 of the AFM no references to a limited controllability in reverse thrust operation with tail wind was given,\r\n- The information given in Chapter 10 of the AOM for using the thrust reverser in chapter 05 of the AFM was not included."}