{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-26-islander-cark", "date": "Feb 5, 1994 at 1725 LT", "type": "Britten-Norman Islander", "operator": "North-West Parachute Center", "flight_phase": "Landing (descent or approach)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cark - Cark", "msn": "86", "yom": 1969, "flight_number": null, "city": "Cark", "zone": "Cumbria", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2159, "captain_hours_type": 777, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 1705 hrs, the aircraft took off from Cark Airfield with nine parachutists and the pilot on board. The parachutists left the aircraft at about 6,500 feet and the pilot started the descent to land. A low level, left-hand circuit to runway 24 was carried out, the surface wind was less than 5 knots from the south west. It was twilight, however, the sky to the west was still bright from the setting sun and the runway was visible; there was no runway lighting. The pilot had selected the red cockpit lighting to full intensity and both landing lights were on. At 50 feet on final approach the pilot had sufficient visual reference to continue the approach; the aircraft was aligned slightly to the right of the centerline, however, the pilot was able to correct this before touchdown. It was as the main wheels touched down that the pilot realized he no longer had adequate visual reference. Before he could take any corrective action the aircraft started to decelerate and contact was made with an obstruction on the left side. The nosewheel was still clear of the ground when the deceleration became rapid and the aircraft went through a fence, to the left of the runway, and came to rest against a pile of concrete rubble. The pilot who was wearing lap and diagonal upper torso restraint escaped without injury. Shortly afterwards, when he deemed it safe to do so, he returned to the aircraft to complete the shutdown drills. Two sheep were killed in the accident; the pilot recalled seeing a light area on the threshold, and initially thought that the aircraft may have struck the sheep as it touched down. In hindsight he considered that the aircraft probably struck the sheep after it left the runway, and that what he saw was a reflection from the landing light seen through a missed windscreen. He reported that the windscreen has misted up earlier on this flight and on previous flights; no demiser was fitted to the aircraft. He considered that this may have happened again and reduced the already marginal forward visibility. ", "probable_cause": null}