{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1049e-super-constellation-brampton", "date": "Dec 17, 1954 at 2132 LT", "type": "Lockheed L-1049 Super Constellation", "operator": "TCA", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Tampa-Toronto", "msn": "4564", "yom": 1954, "flight_number": "TCA407", "city": "Brampton", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 16, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 763, "circumstances": "Following an uneventful flight from Tampa, the captain started a night approach to Toronto-Malton Airport. During an ILS approach in poor weather conditions (300 feet ceiling), the four engine aircraft descended below the glide and hit the ground about 11 miles short of runway 10. It slid for 2,000 feet before coming to rest in flames. All 23 occupants were injured while the aircraft was destroyed. ", "probable_cause": "The Board of Inquiry found that the accident was caused by negligence on the part of the captain. The following findings were reported:\r\n- The first officer, despite his duties which involved \"In-Range\" and \"Pre-Landing\" checks during the approach pattern, displayed an alertness concerning the procedures carried out by the captain, and on three separate occasions indicated to the captain conditions which required correction,\r\n- The captain of the aircraft showed poor airmanship in the execution of his approach pattern, in that he made inadequate allowance for the strong prevailing wind and failed to utilize the ADF receiver to home on the outer marker,\r\n- The captain failed to carry out an approved ILS let-down and, in so far as the position and the altitude of the aircraft were concerned, he ignored the indications of the ADF needle tuned to the marker, the ILS glide path needle and the altimeter,\r\n- The captain ignored the warning from his first officer that he had descended below the regulation height,\r\n- The captain was under the impression that he was very much closer to the airport than he actually was,\r\n- The captain broke the regulations regarding the minimum altitude at which the glide path is to be intersected, the minimum altitude at which the outer marker is to be crossed, and the minimum altitude to which the aircraft may descend on the approach at Malton without becoming contact, and continued his descent until he flew into the ground. "}