{"url": "https://www.baaa-acro.com/crash/crash-atr72-212-yangon", "date": "Jul 24, 2015 at 1854 LT", "type": "ATR72-200", "operator": "Air%20Bagan", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Mandalay – Yangon", "msn": "469", "yom": 1995, "flight_number": "JAB424", "city": "Yangon-Mingaladon", "zone": "Yangon Region", "country": "Myanmar", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 49, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6603, "captain_hours_type": 513, "copilot_hours": 2650, "copilot_hours_type": 2650, "aircraft_hours": 40827, "circumstances": "The route of the aircraft on that day was MDL- MYT- PBU- MYT- MDL- RGN. From Mandalay (MDL) on the way back to Yangon International Airport, the plane took off at 17:20.On the way the weather was not significant. For weather reason, seat belt sign was turned on the way to Yangon International Airport only one time. From Mandalay Airport up to landing phase to Yangon International Airport, first officer took control of the aircraft. At 1730 visibility was 6Km as per ATC verbal information. About 4 Km to Mingaladon Tower, clearance was obtained \"Air Bagan 424 ,wind calm ,runway 21,clear to land, caution landing Runway wet, after landed vacate via Charlie\" At decision height (250ft), runway was insight, runway lightings were able to be seen so the aircraft continued though there was light rain. At about 50 ft, more rain was falling suddenly consequently visibility became poor. So the pilot took over control of the aircraft. A few seconds later the aircraft made hard landing and skidded and veered off the left side of the runway to the muddy strip, came to rest about 2800ft from the threshold and 75ft from the runway edge. ", "probable_cause": "Primary cause:\r\nDuring the final landing phase, the pilot was reluctant to perform a go-around while the plane was unstable and of bounce landing in low visibility condition.\r\nContributing factors:\r\na) The visibility was very low and the runway centerline lightings were not able to be seen intermittently.\r\nb) The runway was wet and it was raining heavily. \r\nc) The pilot in command took over the control of the plane from the copilot (14) seconds just before the first impact. "}