{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-sanikiluaq-1-killed", "date": "Dec 22, 2012 at 1806 LT", "type": "Swearingen SA227 Metro III", "operator": "Perimeter%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Winnipeg - Sanikiluaq", "msn": "AC-650B", "yom": 1986, "flight_number": "PAG993", "city": "Sanikiluaq", "zone": "Nunavut", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5700, "captain_hours_type": 2330, "copilot_hours": 1250, "copilot_hours_type": 950, "aircraft_hours": 32982, "circumstances": "On 22 December 2012, the Perimeter Aviation LP, Fairchild SA227-AC Metro III (registration C-GFWX, serial number AC650B), operating as Perimeter flight PAG993, departed Winnipeg/James Armstrong Richardson International Airport, Manitoba, at 1939 Coordinated Universal Time (1339 Central Standard Time) as a charter flight to Sanikiluaq, Nunavut. Following an attempted visual approach to Runway 09, a non precision non-directional beacon (NDB) Runway 27 approach was conducted. Visual contact with the runway environment was made and a circling for Runway 09 initiated. Visual contact with the Runway 09 environment was lost and a return to the Sanikiluaq NDB was executed. A second NDB Runway 27 approach was conducted with the intent to land on Runway 27. Visual contact with the runway environment was made after passing the missed approach point. Following a steep descent, a rejected landing was initiated at 20 to 50 feet above the runway; the aircraft struck the ground approximately 525 feet beyond the departure end of Runway 27. The 406 MHz emergency locator transmitter activated on impact. The 2 flight crew and 1 passenger sustained serious injuries, 5 passengers sustained minor injuries, and 1 infant was fatally injured. Occupants exited the aircraft via the forward right overwing exit and were immediately transported to the local health centre. The aircraft was destroyed. The occurrence took place during the hours of darkness at 2306 Coordinated Universal Time (1806 Eastern Standard Time).", "probable_cause": "Findings as to causes and contributing factors:\r\n1. The lack of required flight documents, such as instrument approach charts, compromised thoroughness and placed pressure on the captain to find a workaround solution during flight planning. It also negatively affected the crew’s situational awareness during the approaches at CYSK (Sanikiluaq).\r\n2. Weather conditions below published landing minima for the approach at the alternate airport CYGW (Kuujjuarapik) and insufficient fuel to make CYGL (La Grande Rivière) eliminated any favourable diversion options. The possibility of a successful landing at CYGW was considered unlikely and put pressure on the crew to land at CYSK (Sanikiluaq).\r\n3. Frustration, fatigue, and an increase in workload and stress during the instrument approaches resulted in crew attentional narrowing and a shift away from welllearned, highly practised procedures.\r\n4. Due to the lack of an instrument approach for the into-wind runway and the unsuccessful attempts at circling, the crew chose the option of landing with a tailwind, resulting in a steep, unstable approach.\r\n5. The final descent was initiated beyond the missed approach point and, combined with the 14-knot tailwind, resulted in the aircraft remaining above the desired 3- degree descent path.\r\n6. Neither pilot heard the ground proximity warning system warnings; both were focused on landing the aircraft to the exclusion of other indicators that warranted alternative action.\r\n7. During the final approach, the aircraft was unstable in several parameters. This instability contributed to the aircraft being half-way down the runway with excessive speed and altitude.\r\n8. The aircraft was not in a position to land and stop within the confines of the runway, and a go-around was initiated from a low-energy landing regime.\r\n9. The captain possibly eased off on the control column in the climb due to the low airspeed. This, in combination with the configuration change at a critical phase of flight, as called for in the company procedures, may have contributed to the aircraft’s poor climb performance.\r\n10. A rate of climb sufficient to ensure clearance from obstacles was not established, and the aircraft collided with terrain.\r\n11. The infant passenger was not restrained in a child restraint system, nor was one required by regulations. The infant was ejected from the mother’s arms during the impact sequence, and contact with the interior surfaces of the aircraft contributed to the fatal injuries.\r\nFindings as to risk:\r\n1. If instrument approaches are conducted without reference to an approach chart, there is a risk of weakened situational awareness and of error in following required procedures, possibly resulting in the loss of obstacle clearance and an accident.\r\n2. If additional contingency fuel is not accounted for in the aircraft weight, there is a risk that the aircraft may not be operated in accordance with its certificate of airworthiness or may not meet the certified performance criteria.\r\n3. If Transport Canada crew resource management (CRM) training requirements do not reflect advances in CRM training, such as threat and error management and assertiveness training, there is an increased risk that crews will not effectively employ CRM to assess conditions and make appropriate decisions in critical situations.\r\n4. If a person assisting another is seated next to an emergency exit, there is an increased risk that the use of the exit will be hindered during an evacuation.\r\n5. If a person holding an infant is seated in a row with no seatback in front of them, there is an increased risk of injury to the infant as no recommended brace position is available.\r\n6. If young children are not adequately restrained, there is a risk that injuries sustained will be more severe.\r\n7. If a lap-held infant is ejected from its guardian’s arms, there is an increased risk the infant may be injured, or cause injury or death to other occupants. \r\n8. If more complete data on the number of infants and children travelling by air are not available, there is a risk that their exposure to injury or death in the event of turbulence or a survivable accident will not be adequately assessed and mitigated.\r\n9. If temperature corrections are not applied to all altitudes on the approach chart, there is an increased risk of controlled flight into terrain due to a reduction of obstacle clearance.\r\n10. If the missed approach point on non-precision instrument approaches is located beyond the 3-degree descent path, there is an increased risk that a landing attempt will result in a steep, unstable descent, and possible approach-and-landing accident.\r\n11. If there is not sufficient guidance in the standard operating procedures, there is a risk that crews will not react and perform the required actions in the event that ground proximity warning system warnings are generated.\r\n12. If standard operating procedures, the Airplane Flight Manual and training are not aligned with respect to low-energy go-arounds, there is a risk that crews may perform inappropriate actions at a critical phase of flight.\r\n13. If non-compliant practices are not identified, reported, and dealt with by a company’s safety management system, there is a risk that they will not be addressed in a timely manner.\r\n14. If Transport Canada’s oversight is dependent on the effectiveness of a company’s safety management system’s reporting of safety issues, there is a risk that important issues will be missed.\r\nOther findings:\r\n1. The quick response of the people on the ground reduced the exposure of passengers and crew to the elements."}