{"url": "https://www.baaa-acro.com/crash/crash-airspeed-as5a-courier-sevenoaks-4-killed", "date": "Sep 29, 1934 at 1730 LT", "type": "Airspeed AS.5 Courier", "operator": "London-Scottish-Provincial-Airways", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Heston – Paris", "msn": "16", "yom": 1934, "flight_number": null, "city": "Sevenoaks", "zone": "Kent", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off at 1700LT on a scheduled international passenger flight to Paris-Le Bourget Airport. It flew into an isolated storm over north west Kent. An eyewitness reported seeing the aircraft emerge from the clouds in a vertical dive. The cloud base was at an altitude of 1,200 feet (370 m) and the hills around Shoreham reached an elevation of 600 feet (180 m). The aircraft crashed just north of Shoreham in Timberden Bottom, at the bottom of Cockerhurst Road. All four people on board were killed while two women walking in the vicinity of the accident were injured when they were struck by flying debris. some parts of the aircraft were found 66 feet (20 m) to the south west and 100 feet (30 m) west of the main wreckage. An eyewitness stated that he thought the pilot may have stalled trying to avoid high tension power lines. An inquest into the accident was held at Sevenoaks on 2 October. The victims were identified by documentation and personal belongings as they had received injuries which made visual identification \"extremely difficult, if not impossible\". Evidence was given that the aircraft was not operating anywhere near its maximum take-off weight of 4,000 pounds (1,800 kg) and that it had been airworthy on departure from Heston. The pilot was experienced. He was a former Royal Air Force pilot and had 1,500 hours flying time, of which 150 hours were on the Heston-Paris route.\r\nCrew:\r\nRonald Maxwell Smith, pilot.", "probable_cause": null}