{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-620-cheyenne-ii-forest-city-1-killed", "date": "Feb 12, 2010 at 1355 LT", "type": "Piper PA-31 Cheyenne", "operator": "Mayes Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Chesterfield – Forest City", "msn": "31-7820050", "yom": 1978, "flight_number": null, "city": "Forest City", "zone": "Iowa", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10352, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9048, "circumstances": "A witness reported that the multi-engine turboprop airplane was on final approach to land when it suddenly veered to the left and entered a rapid descent. The witness stated that he heard the \"whine of the engines\" before the airplane impacted terrain about 1/2 mile south of the runway threshold. In the days preceding the accident flight, the airplane had been at a maintenance facility to resolve a vibration in the rudder system while the autopilot system was engaged. There were no anomalies reported with the autopilot system during a test flight completed immediately before the accident flight. However, anomalies with the rate gyro were noted by a mechanic who recommended replacing it, but the pilot departed on the accident flight without the recommended repair having been completed. Further, examination of the autopilot annunciator panel indicated that the autopilot was likely not engaged at the time of impact, likely because the airplane was on a short final approach for landing. Accordingly, any existing autopilot faults would not have affected the flight as the autopilot system was likely not in use. There were no failures identified with the primary flight controls, engines, or propellers that would have prevented the pilot from maintaining control of the airplane manually. Toxicological testing revealed the presence of Zolpidem in the pilot's blood (Zolpidem, the trade name for Ambien, is used for short-term treatment of insomnia); however, the reported levels would likely not have resulted in any impairment.", "probable_cause": "The pilot's failure to maintain airplane control during final approach."}