{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-61f-guantanamo-bay-nas", "date": "Aug 18, 1993 at 1656 LT", "type": "Douglas DC-8", "operator": "Kalitta%20Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Norfolk – Guantánamo Bay", "msn": "46127", "yom": 1969, "flight_number": "CB808", "city": "Guantánamo Bay NAS", "zone": "Guantánamo", "country": "Cuba", "region": "Central America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 20727, "captain_hours_type": 1527, "copilot_hours": 15350, "copilot_hours_type": 492, "aircraft_hours": 43947, "circumstances": "Flight 808 took off from Norfolk at 14:13 for a cargo flight to Guantánamo Bay. The flight and arrival into the Guantánamo terminal area was uneventful. At 16:34, while the flight was descending from FL320, radio contact was established with the Guantánamo radar controller. The radar controller instructed flight 808 to maintain VFR 12 miles off the Cuban coast and report at East Point. The runway in use was runway 10. The flight crew then requested a runway 28 approach, but changed this back to a runway 10 approach a couple of minutes later. Clearance was given at 16:46 with wind reported at 200°/7 knots. The runway 10 threshold was located 0,75 mile East of Cuban airspace, designated by a strobe light, mounted on a Marine Corps guard tower, located at the corner of the Cuban border and the shoreline. On the day of the accident, the strobe light was not operational (both controller and flight crew were not aware of this). The aircraft was approached from the south and was making a right turn for runway 10 with an increasing angle of bank in order to align with the runway. At 200-300 feet agl the wings started to rock towards wings level and the nose pitched up. The right wing appeared to stall, the aircraft rolled to 90deg. angle of bank and the nose pitched down. The aircraft then struck level terrain 1400 feet west of the approach end of the runway and 200 feet north of the extended centreline.", "probable_cause": "The impaired judgement, decision-making, and flying abilities of the captain and flight crew due to the effects of fatigue; the captain's failure to properly assess the conditions for landing and maintaining vigilant situational awareness of the airplane while manoeuvring onto final approach; his failure to prevent the loss of airspeed and avoid a stall while in the steep bank turn; and his failure to execute immediate action to recover from a stall. Additional factors contributing to the cause were the inadequacy of the flight and duty time regulations applied to 14 CFR, Part 121, Supplemental Air Carrier, international operations, and the circumstances that resulted in the extended flight/duty hours and fatigue of the flight crew members. Also contributing were the inadequate crew resource management training and the inadequate training and guidance by American International Airways, Inc., to the flight crew for operations at special airports such as Guantanamo Bay; and the Navy's failure to provide a system that would assure that local tower controller was aware of the inoperative strobe light so as to provide the flight crew with such information."}