{"url": "https://www.baaa-acro.com/crash/crash-sikorsky-s-42-antilla-17-killed", "date": "Aug 8, 1944 at 1320 LT", "type": "Sikorsky S-42", "operator": "Pan%20Am.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "San Juan – Antilla – Miami", "msn": "4201", "yom": 1934, "flight_number": "PA218", "city": "Antilla", "zone": "Holguín", "country": "Cuba", "region": "Central America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 26, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 17, "captain_hours": 1523, "captain_hours_type": 1017, "copilot_hours": 380, "copilot_hours_type": 45, "aircraft_hours": 12389, "circumstances": "At about 1318LT, the pilot taxied to the take-off position. The weather was clear and the ceiling unlimited with a wind estimated to be 20 knots from approximately 100 degree. The water was choppy with no ground swells. With a gradual opening of the throttles to 33 1/2 inches of manifold pressure, the plane appeared to go on the step normally and was making approximately 75 knots. The captain then requested an increase in manifold pressure from 33 1/2 inches to 35 inches and upon attaining a speed estimated as between 78 and 80 knots, the plane left the surface of the water. Captain Williams stated that as the plane rose into the air to a height of 10 or 12 feet, he relaxed back pressure slightly, in order to gain speed, whereupon the plane seemed to want to go back on the water so he pulled back on the yoke. When it became obvious to him that the plane was going to go back on the water anyway, he dropped the nose quickly to \"flatten out.\" After striking, bow first, the plane left the water in a slightly nose-high attitude, rose higher than previously, then returned to the water at a much steeper angle. The third time, the plane rose out of control to a height of approximately 25 feet, and in a steeper angle of climb than previously. It then nosed down at a sharp angle and struck the water violently. The nose of the plane struck the water with such force as to cause the hull to fracture and completely separate at a point just aft of the pilot's compartment. The after portion of the plane, which included passenger compartments A, B, C, and D, pitched forward and came to rest in a nearly inverted position with the forward portion fully submerged. Seventeen passengers were killed while all 14 other occupants were rescued.", "probable_cause": "This investigation revealed nothing in the conduct of the flight from the time it left Miami until the time of the plane's leaving the water in the attempted take-off from Antilla, which would indicate a probable cause of the accident. It appears that a degree of laxity characterized this flight as was evidence by the crew's failure to comply with the proper cockpit check procedure and by the lack of an understanding between the crew members regarding the seating arrangement of the passengers. However, as previously stated, these items are not believed to have contributed to the cause of the accident. Considerable significance must be attached to Captain Williams' own description of his handling of the flight and engine controls is during the attempted take-off and subsequent maneuvers of the aircraft. Therefore, in summing up the findings of this investigation, it appears that the pilot failed to keep the airplane airborne after it had attained fixing speed and left the water and that a safe recovery might have been effected at the time the airplane first returned to the water had the pilot used proper technique. These errors in all probability were due largely to the pilot's limited experience in handling S42's. Based on the evidence produced through this investigation, loss of control during take-off was found to be the probable cause of the accident."}