{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-ozren-1-killed", "date": "Sep 24, 2015 at 1230 LT", "type": "Cessna 421B Golden Eagle II", "operator": "STS-Aviation", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Banja Luka – Tuzla", "msn": "421B-0248", "yom": 1972, "flight_number": null, "city": "Ozren", "zone": "Republika Srpska", "country": "Bosnia and Herzegovina", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft, operated by STS Avijacija (STS Aviation), departed Banja Luka on a charter flight to Tuzla, carrying two passengers and one pilot taking part to a foxes vaccination program. While cruising at low altitude, the airplane entered an area of clouds when it impacted trees and crashed on the slope of a mountain located near the Monastery of Ozren, southeast part of the Serbian Republic of Bosnia, bursting into flames. Both passengers were seriously injured and the pilot was killed. ", "probable_cause": "The root cause of the accident is the entry of the aircraft into the cloud at a low altitude, in conditions of increased cloudiness, which led to the impact of the aircraft in the ground. The accident is caused by inadequate preparation of the crew for the flight, deviation of the crew from the planned and approved route by location (diversion from the given route) and flight height (flight at a lower altitude than the approved one), as well as not taking timely procedures to return to the given route and flight height, as well as incorrect actions in case of encountering a deteriorated weather situation on the route under VFR flight conditions.\r\nThe accident was affected by:\r\na) The decision of the manager on the manner of execution of the flight,\r\nb) Ignoring information about the meteorological situation and weather forecast,\r\nc) Inadequate preparation of the crew for the execution of the flight at a low altitude and in conditions of fire of the meteorological situation,\r\nd) Non-compliance with VFR rules for minimum flight height and meteorological minimum for airspace class “F” and “G”,\r\ne) Loss of visual contact with the ground."}