{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-golden-grove-8-killed", "date": "Jul 13, 1972 at 0748 LT", "type": "Piper PA-31-310 Navajo", "operator": "Ansett General Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Adelaide - Moomba", "msn": "31-682", "yom": 1970, "flight_number": null, "city": "Golden Grove", "zone": "South Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 2697, "captain_hours_type": 987, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 857, "circumstances": "The aircraft departed Adelaide-Parafield Airport on a charter flight to Moomba, carrying seven passengers and a passenger on behalf of Santos Ltd. At the time of the accident, it as owned and operated by Ansett Transport Industries (Operations) Pty Ltd trading as Ansett General Aviation. During initial climb, while flying in clouds at an altitude of 700 feet heading 270°, the twin engine airplane went out of control, entered a left turn and subsequently stuck the ground at high speed in a shallow dive, some 13 miles northeast of Adelaide Airport. The airplane disintegrated on impact and all eight occupants were killed. The accident was not survivable. ", "probable_cause": "The cause of the accident was that control of the aircraft was lost and recovery was not effected before it struck the ground. The reason for the loss of control and the inability to take effective recovery action has not been determined. Although the aircraft was operating in cloud from a height of about 700 feet after takeoff until it emerged at a height of 300 to 500 feet above the terrain shortly before impact, there is no evidence of any meteorological condition which may have contributed directly to the accident. "}