{"url": "https://www.baaa-acro.com/crash/crash-volpar-turboliner-18-cleveland-1-killed", "date": "Dec 15, 1992 at 0912 LT", "type": "Volpar Turboliner 18", "operator": "Mohican Air Service", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cleveland - Syracuse", "msn": "12360", "yom": 1970, "flight_number": null, "city": "Cleveland-Hopkins", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4768, "captain_hours_type": 91, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16115, "circumstances": "After rotation, during the initial climb, the nose of the airplane pitched up to approximately 60° above the horizon. The airplane continued to climb until about 250 feet above the ground, then rolled right, pitched down and descended. The airplane impacted the ground, approximately 45° nose down, 650 feet to the right of the runway. Post accident investigation of the wreckage revealed the elevator jammed in the full up deflection. The upper end of the elevator control rod was found not connected to the elevator, but was found laying aft, wedged between the tail cone and the elevator faring, holding the elevator in the full up position. The control rod connecting bolt was found laying in the bottom of the tail cone undamaged. The washer, nut and cotter pin related to the control rod connecting bolt were not found. The elevator had been removed, recovered and then installed by company maintenance personnel 166 flight hours prior to the accident. The pilot, sole on board, was killed. ", "probable_cause": "The improper installation of the elevator by company maintenance personnel and the lack of proper inspections by a company certified mechanic/inspector and the faa certified mechanic with inspector authorization. A factor in this accident was an insufficiently defined maintenance procedures that allowed multiple maintenance tasks to be combined into a single line entry."}