{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-36-marquise-scottsdale", "date": "Jul 20, 1996 at 0857 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Med Arizona", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Scottsdale - Phoenix", "msn": "676", "yom": 1975, "flight_number": null, "city": "Scottsdale", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4559, "captain_hours_type": 81, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8878, "circumstances": "The right engine lost power after an uncontained engine failure during the initial takeoff climb. The airplane would not climb and the pilot was forced to land. The pilot selected a street for a forced landing area. The pilot landed gear up while maneuvering to avoid hitting street light poles and automobiles. After touchdown, the airplane slid into a block wall. A fire erupted as a result of a post impact fuel leak in the left wing. The airplane's engines were examined at the manufacturer's facilities. The right engine exhibited evidence of an uncontained separation of the second stage turbine rotor disk. Examination of the disk fragments revealed a low cycle fatigue fracture mode. The fatigue initiated from multiple areas at and adjacent to the inside diameter bore surface near the aft side of the disk. According to the engine manufacturer, the multiple indication areas were associated with uninspectable size porosity and the primary carbides in the cast material. There were no material or casting defects detected on any of the fractures through the wheel. ", "probable_cause": "Aan uncontained failure of the second stage turbine wheel due to fatigue. Factors were: obstructions in the forced landing area and the inability of the airplane to climb after the turbine wheel failure. "}