{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-12-amarillo-3-killed", "date": "Apr 28, 2017 at 2348 LT", "type": "Pilatus PC-12", "operator": "Rico-Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Amarillo – Clovis", "msn": "105", "yom": 1994, "flight_number": null, "city": "Amarillo-Rick Husband", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 5866, "captain_hours_type": 73, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4407, "circumstances": "The pilot and two medical crew members departed on an air ambulance flight in night instrument meteorological conditions to pick up a patient. After departure, the local air traffic controller observed the airplane's primary radar target with an incorrect transponder code in a right turn and climbing through 4,400 ft mean sea level (msl), which was 800 ft above ground level (agl). The controller instructed the pilot to reset the transponder to the correct code, and the airplane leveled off between 4,400 ft and 4,600 ft msl for about 30 seconds. The controller then confirmed that the airplane was being tracked on radar with the correct transponder code; the airplane resumed its climb at a rate of about 6,000 ft per minute (fpm) to 6,000 ft msl. The pilot changed frequencies as instructed, then contacted departure control and reported \"with you at 6,000 [ft msl]\" and the departure controller radar-identified the airplane. About 1 minute later, the departure controller advised the pilot that he was no longer receiving the airplane's transponder; the pilot did not respond, and there were no further recorded transmissions from the pilot. Radar data showed the airplane descending rapidly at a rate that reached 17,000 fpm. Surveillance video from a nearby truck stop recorded lights from the airplane descending at an angle of about 45° followed by an explosion. The airplane impacted a pasture about 1.5 nautical miles south of the airport, and a post impact fire ensued. All major components of the airplane were located within the debris field. Ground scars at the accident site and damage to the airplane indicated that the airplane was in a steep, nose-low and wings-level attitude at the time of impact. The airplane's steep descent and its impact attitude are consistent with a loss of control. An airplane performance study based on radar data and simulations determined that, during the climb to 6,000 ft and about 37 seconds before impact, the airplane achieved a peak pitch angle of about 23°, after which the pitch angle decreased steadily to an estimated -42° at impact. As the pitch angle decreased, the roll angle increased steadily to the left, reaching an estimated -76° at impact. The performance study revealed that the airplane could fly the accident flight trajectory without experiencing an aerodynamic stall. The apparent pitch and roll angles, which represent the attitude a pilot would \"feel\" the airplane to be in based on his vestibular and kinesthetic perception of the components of the load factor vector in his own body coordinate system, were calculated. The apparent pitch angle ranged from 0° to 15° as the real pitch angle steadily decreased to -42°, and the apparent roll angle ranged from 0° to -4° as the real roll angle increased to -78°. This suggests that even when the airplane was in a steeply banked descent, conditions were present that could have produced a somatogravic illusion of level flight and resulted in spatial disorientation of the pilot. Analysis of the performance study and the airplane's flight track revealed that the pilot executed several non-standard actions during the departure to include: excessive pitch and roll angles, rapid climb, unexpected level-offs, and non-standard ATC communications. In addition to the non-standard actions, the pilot's limited recent flight experience in night IFR conditions, and moderate turbulence would have been conducive to the onset of spatial disorientation. The pilot's failure to set the correct transponder code before departure, his non-standard departure maneuvering, and his apparent confusion regarding his altitude indicate a mental state not at peak acuity, further increasing the chances of spatial disorientation. A post accident examination of the flight control system did not reveal evidence of any preimpact anomalies that would have prevented normal operation. The engine exhibited rotational signatures indicative of engine operation during impact, and an examination did not reveal any preimpact anomalies that would have precluded normal engine operation. The damage to the propeller hub and blades indicated that the propeller was operating under high power in the normal range of operation at time of impact. Review of recorded data recovered from airplane's attitude and heading reference unit did not reveal any faults with the airplane's attitude and heading reference system (AHRS) during the accident flight, and there were no maintenance logbook entries indicating any previous electronic attitude director indicator (EADI) or AHRS malfunctions. Therefore, it is unlikely that erroneous attitude information was displayed on the EADI that could have misled the pilot concerning the actual attitude of the airplane. A light bulb filament analysis of the airplane's central advisory display unit (CADU) revealed that the \"autopilot disengage\" caution indicator was likely illuminated at impact, and the \"autopilot trim\" warning indicator was likely not illuminated. A filament analysis of the autopilot mode controller revealed that the \"autopilot,\" \"yaw damper,\" and \"altitude hold\" indicators were likely not illuminated at impact. The status of the \"trim\" warning indicator on the autopilot mode controller could not be determined because the filaments of the indicator's bulbs were missing. However, since the CADU's \"autopilot trim\" warning indicator was likely not illuminated, the mode controller's \"trim\" warning indicator was also likely not illuminated at impact. Exemplar airplane testing revealed that the \"autopilot disengage\" caution indicator would only illuminate if the autopilot had been engaged and then disconnected. It would not illuminate if the autopilot was off without being previously engaged nor would it illuminate if the pilot attempted and failed to engage the autopilot by pressing the \"autopilot\" push button on the mode controller. Since the \"autopilot disengage\" caution indicator would remain illuminated for 30 seconds after the autopilot was disengaged and was likely illuminated at impact, it is likely that the autopilot had been engaged at some point during the flight and disengaged within 30 seconds of the impact; the pilot was reporting to ATC at 6,000 ft about 30 seconds before impact and then the rapid descent began. The airplane was not equipped with a recording device that would have recorded the operational status of the autopilot, and the investigation could not determine the precise times at which autopilot engagement and disengagement occurred. However, these times can be estimated as follows: \r\n- The pilot likely engaged the autopilot after the airplane climbed through 1,000 ft agl about 46 seconds after takeoff, because this was the recommended minimum autopilot engagement altitude that he was taught.\r\n- According to the airplane performance study, the airplane's acceleration exceeded the autopilot's limit load factor of +1.6 g about 9 seconds before impact. If it was engaged at this time, the autopilot would have automatically disengaged. \r\n- The roll angle data from the performance study were consistent with engagement of the autopilot between two points: \r\n1) about 31 seconds before impact, during climb, when the bank angle, which had stabilized for a few seconds, started to increase again and \r\n2) about 9 seconds before impact, during descent, at which time the autopilot would have automatically disengaged. Since the autopilot would have reduced the bank angle as soon as it was engaged and there is no evidence of the bank angle reducing significantly between these two points, it is likely that the autopilot was engaged closer to the latter point than the former. Engagement of the autopilot shortly before the latter point would have left little time for the autopilot to reduce the bank angle before it would have disengaged automatically due to exceedance of the normal load factor limit. Therefore, it is likely that the pilot engaged the autopilot a few seconds before it automatically disconnected about 9 seconds before impact. The operator reported that the airplane had experienced repeated, unexpected, in-flight autopilot disconnects, and, two days before the accident, the chief pilot recorded a video of the autopilot disconnecting during a flight. Exemplar airplane testing and maintenance information revealed that, during the flight in which the video was recorded, the autopilot's pitch trim adapter likely experienced a momentary loss of power for undetermined reasons, which resulted in the sequence of events observed in the video. It is possible that the autopilot disconnected during the accident flight due to the pitch trim adapter experiencing a loss of power, which would have to have occurred between 30 and 9 seconds before impact. A post accident weather analysis revealed that the airplane was operating in an environment requiring instruments to navigate, but it could not be determined if the airplane was in cloud when the loss of control occurred. The sustained surface wind was from the north at 21 knots with gusts up to 28 knots, and moderate turbulence existed. The presence of the moderate turbulence could have contributed to the controllability of the airplane and the pilot's inability to recognize the airplane's attitude and the autopilot's operational status. ", "probable_cause": "The pilot's loss of airplane control due to spatial disorientation during the initial climb after takeoff in night instrument meteorological conditions and moderate turbulence. "}