{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-90-dl-near-homer-5-killed", "date": "Jan 20, 1949 at 2005 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Alaska%20Airlines-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Naknek – Homer – Kenai – Anchorage", "msn": "20208", "yom": 1944, "flight_number": "AS008", "city": "Homer", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 7129, "captain_hours_type": null, "copilot_hours": 2570, "copilot_hours_type": null, "aircraft_hours": 8051, "circumstances": "Flight 8 took off from Naknek, Alaska, 200 miles southwest of Homer at 1805 on January 20 with a crew consisting of Captain R. D. Land, Copilot Robert Nelson Stevens, and Stewardess Lucina Nims. An instrument flight plan had been filed with Air Traffic Control to proceed to Anchorage, Alaska, via Homer and Kenai. Though the weather was forecast over this route to be clear and unlimited, an instrument plan was filed since an instrument flight plan was required for all night flights by the carrier’s operating certificate. At 1921 the flight reported over the Anchor Point Intersection, 28 miles west of Homer, and also advised the Homer radio, “We will be VFR from Homer to Kenai to Elmendorf” (Anchorage). This information was immediately transmitted to Anchorage where it was delivered at 1925 to the Alaska Airlines’ dispatcher. Flight 8 landed at Homer at 1935 without incident. Takeoff was accomplished from Homer at 1950 with the same crew, three passengers, 2,270 pounds of cargo and 2,400 pounds of fuel. Total airplane weight was 21,430 pounds which was within the certificated limit, and the load was properly distributed. Just before takeoff the flight advised Homer Tower that it would proceed to Kenai in accordance with visual flight rules. This information was received by the Alaska Airlines’ dispatcher in Anchorage at 1954. At 1957 the flight was advised by Kenai radio that there were no passengers or cargo at Kenai, and for this reason Flight 8 replied: “Will not land at Kenai.” Approximately eight minutes after this communication at 2005, the flight struck the south side of Ptarmigan Head at an elevation of 2,800 feet, nine miles east of the center line of the airway to Kenai. Five of the six occupants were killed, and the aircraft was destroyed.", "probable_cause": "The Board determines that the probable cause of this accident was the action of the pilot in proceeding off the designated airway at an altitude insufficient to clear the terrain."}