{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh114-heron-2b-christiansted-8-killed", "date": "Jul 24, 1979 at 0922 LT", "type": "De Havilland DH.114 Heron", "operator": "Prinair", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Juan – Sint Marten – Christiansted – San Juan", "msn": "14125", "yom": 1957, "flight_number": "PQ610", "city": "Christiansted-Henry E. Rohlsen (ex Alexander Hamilton)", "zone": "All US Virgin Islands", "country": "US Virgin Islands", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 19, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 15710, "captain_hours_type": 11454, "copilot_hours": 5292, "copilot_hours_type": 3150, "aircraft_hours": 23045, "circumstances": "The airplane crashed on the airport while executing a takeoff from the Alexander Hamilton Airport, Christiansted, St. Croix, USVI. There were 19 passengers and 2 crew members on board. The first officer and 7 passengers were killed, and the captain and 12 passengers were injured seriously. The aircraft was destroyed. Witnesses saw the aircraft assume a nose-high attitude shortly after takeoff. The aircraft then began to roll to a left then to a right wing-down attitude, followed by a momentary pitchdown. The aircraft then pitched up and oscillated to a left wing-down and then a right wing down attitude while losing altitude. It struck the ground while in a right wing-down attitude. The gross weight of the aircraft at takeoff was found to be 1,060 lbs over its maximum allowable takeoff weight of 12,499 lbs and the center of gravity was about 8 inches beyond the maximum allowable rear limit.", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was the pilot's loss of control of the aircraft after takeoff because of the aircraft's grossly overweight and out-of-balance condition which resulted from misloading by the company's load control personnel. The misloading was due to the failure of the company to supervise and to enforce its loading procedures. The Safety Board also determines that inadequate surveillance and enforcement by the FAA were causal factors in this accident. \n"}