{"url": "https://www.baaa-acro.com/crash/crash-embraer-erj-190ar-bwabwata-national-park-33-killed", "date": "Nov 29, 2013 at 1230 LT", "type": "Embraer ERJ-190", "operator": "LAM%20Mocambique", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Maputo - Luanda", "msn": "190-00581", "yom": 2012, "flight_number": "LAM470", "city": "Divundu", "zone": "Kavango Region", "country": "Namibia", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 27, "pax_fatalities": 27, "other_fatalities": 0, "total_fatalities": 33, "captain_hours": 9052, "captain_hours_type": 2519, "copilot_hours": 1183, "copilot_hours_type": 101, "aircraft_hours": 2905, "circumstances": "Aircraft left Maputo Airport at 1126LT on flight LAM470 to Luanda, Angola. En route, while overflying Botswana and Namibia, aircraft encountered bad weather conditions with CB's at high altitude and turbulence. In unknown circumstances, aircraft went out of control and disappeared from radar screens at 1230LT, most probably after diving into the ground. As the aircraft did not arrive at Luanda, SAR commenced but were suspended by night due to low visibility and bad weather conditions (heavy rain falls). The day after, on 30NOV, Namibia Police forces announced they located the wreckage in the Bwabwata National Park, near Divundu. Aircraft was completely destroyed by impact forces and post impact fire. All 33 occupants were killed, among them 16 Mozambicans, 9 Angolans, 5 Portuguese, one French, one Brazilian and one Chinese. The aircraft crashed in a dense wooded and isolated area, sot SAR are difficult. No distress call was sent by the crew. ", "probable_cause": "A press conference provided by the Mozambican authorities on 21DEC2013 reported that CVR analysis revealed that the captain was alone in the cockpit which was locked. The copilot tried to enter without success and was knocking on the door several times, without answer or any reaction on part of the captain who engaged the aircraft in a descent rate of 6,000 feet per minute until impact with the ground. Several warning sounds and alarms were not responded to. On April 15, 2016, the Directorate of Aircraft Accident Investigations (DAAI) of Namibia confirmed in its final report that the accident was caused by the inputs to the auto flight systems by the person believed to be the Captain, who remained alone on the flight deck when the person believed to be the co-pilot requested to go to the lavatory, caused the aircraft to departure from cruise flight to a sustained controlled descent and subsequent collision with the terrain. Investigations revealed that the captain suffered personal events during the past year, such as a divorce, the death of his son in a car crash and one of his daughter that underwent heart surgery."}