{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-milaca-2-killed", "date": "Dec 30, 2010 at 0958 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "TeeMark", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Aitkin - Beaumont", "msn": "46-08021", "yom": 1986, "flight_number": null, "city": "Milaca", "zone": "Minnesota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2078, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2466, "circumstances": "About 20 minutes after departing on a cross-country flight, the pilot acknowledged the air traffic controller’s clearance to climb to 17,000 feet mean sea level (msl). Radar data indicated that the airplane reached a maximum altitude of 16,800 feet msl. The airplane then entered a right descending turn followed by a left descending turn. While in the left turn, the pilot informed the controller, “I lost my autopilot; I’m in an unusual attitude.” The pilot stated this same information two more times in response to transmissions by the controller. The pilot’s last transmission was that he was busy trying to recover the airplane. Witnesses heard the airplane flying overhead for several minutes, but they could not see it due to the low ceiling. A postaccident examination of the airplane did not reveal any pre accident mechanical malfunctions or failures with the engine that would have precluded normal operation. Examination of the autopilot system revealed a loose screw inside the pitch servo housing. The screw was one of two that secured the high wattage resistor to the solenoid housing. Observed corrosion within the screw threads was consistent with the threads not being engaged in a nut or other internally threaded feature. No mechanical damage or arcing was visible on the screw. The operational impact of the loose screw is unknown. The pilot’s instrument flying proficiency could not be determined. According to log records, the pilot last flew 4.5 months before the accident. The airplane was in instrument meteorological conditions when the pilot stated that he was trying to recover from the unusual attitude. The pilot did not follow prescribed procedures for an autopilot malfunction. Weather data indicates that the airplane most likely encountered turbulence and icing conditions during the flight; however, the airplane was equipped with an ice protection system. Although ethanol was found during the toxicology tests, the levels varied greatly among the tissue/fluid samples. The investigation was unable to determine if the presence of ethanol was from ingestion or from postmortem production or contamination. The detected level of diphenhydramine, an over-the-counter sedating antihistamine used to treat allergies, was above therapeutic levels and likely contributed to the pilot’s inability to recover from the unusual attitude. ", "probable_cause": "The pilot did not recover from an unusual attitude while operating in instrument meteorological conditions following a disconnect of the autopilot system for undetermined reasons. Contributing to the accident were the pilot’s lack of recent flight experience and impairment due to diphenhydramine.\n"}