{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-325-navajo-cr-near-two-harbors-1-killed", "date": "Jun 8, 2012 at 1427 LT", "type": "Piper PA-31-310 Navajo", "operator": "Family Celebrations", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "South Saint Paul - South Saint Paul", "msn": "31-7612038", "yom": 1976, "flight_number": null, "city": "Two Harbors", "zone": "Minnesota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On June 8, 2012, about 1307 central daylight time, a Piper PA-31-325, N174BH, departed from the South St Paul Municipal Airport-Richard E Fleming Field (SGS), South St Paul, Minnesota for a maintenance test flight. The airplane reportedly had one of its two engines replaced and the pilot was to fly for about 4 hours to break-in the engine. The airplane did not return from the flight and was reported overdue. The airplane is missing and is presumed to have crashed. The airline transport pilot has not been located. The airplane was registered to Family Celebrations LLC, and was operated as a 14 Code of Federal Regulations Part 91 personal flight. Visual meteorological conditions prevailed and no flight plan was filed. The flight departed SGS with the intention of returning to SGS at the conclusion of the flight. The airplane was reported missing and an alert notification issued about 2225. The last reported contact with the airplane and pilot was about 1300 when the fixed base operator at SGS towed the airplane to the fuel pumps. When he returned about 15 minutes later, the airplane was no longer there. Aircraft radar track data from various ground based sources indicated that the airplane departed SGS about 1307. The airplane maneuvered east of SGS before turning toward the north. The airplane's track continued north toward Duluth, Minnesota. Once the airplane reached Duluth, it followed the west shoreline of Lake Superior. Radar track data indicated that the airplane was at a pressure altitude of 2,800 feet when it reached the shoreline. The airplane continued along the west shoreline toward Two Harbors, Minnesota, flying over the water while maintaining a distance of about 0.5 miles from the shore. As the airplane approached Two Harbors, it descended. The airplane's last recorded position at 1427 was about 30 miles northeast of Duluth, Minnesota, at an uncorrected pressure altitude of 1,600 feet. The Air Force Rescue Coordination Center coordinated a search for the missing airplane. The Civil Air Patrol, United States Coast Guard, and other entities participated in the search efforts. Search efforts were suspended on July 4, 2012.", "probable_cause": "Undetermined because the airplane was not found"}