{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-200-sharjah", "date": "Nov 7, 2004 at 1635 LT", "type": "Boeing 747-200", "operator": "Air%20Atlanta.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hong Kong – Sharjah – Frankfurt", "msn": "23621", "yom": 1986, "flight_number": "DLH8457", "city": "Sharjah", "zone": "Sharjah (الشارقةّ)", "country": "United Arab Emirates", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 21430, "captain_hours_type": 430, "copilot_hours": 4230, "copilot_hours_type": 1547, "aircraft_hours": 79733, "circumstances": "The aircraft and crew were assigned to operate a cargo flight, DLH8457, from Sharjah, U.A.E. to Frankfurt, Germany. The crew did not notice anything unusual with the aircraft apart from a few known defects verbally reported by the crew that operated the previous sector from Bangkok. The aircraft was then prepared for the flight to Frankfurt and the crew completed pre-departure checks including an external inspection of the aircraft. After push back and engines start-up, at 1623:24 hr the crew was cleared by ATC to taxi the aircraft to runway 30. From the performance and speed reference cards the crew ascertained the decision speeds for a reduced engine thrust 10º flap takeoff as follows; V1 – 162 KIAS, Vr – 174 KIAS and V2 – 180 KIAS. The crew line-up the aircraft for a full length take-off and was cleared for take-off at 1631:42 hr. A surface wind check of 340º/08 kt was passed by the tower controller. The take-off roll commenced at 1633:32 hr. During the roll, the FO made the 80 KIAS call at 1633:57 hr followed by the V1 call 26 seconds later. At the same time of the V1 call, the tower controller transmitted to the crew “and Lufthansa there was a bang and you’ve got smoke coming on the right hand side”. The commander then aborted the take-off at 1634:26 hrs whilst maintaining the aircraft on the runway centreline. The speed of the aircraft when aborting actions were first initiated by the crew was 165 KIAS. The crew indicated that the power levers were brought to idle, full reverse thrust selected, speed brakes deployed and manual application of brakes were made. The aircraft acceleration however, continued to 171 KIAS before decelerating normally but was not able to come to a halt within the accelerate stop distance available. Just prior to reaching the end of the runway, the commander turned the aircraft to the left to avoid the elevated approach lights at the end of the runway and it came to a stop in an open sand area approximately 30 metres from the prepared surface of the runway in a nose low attitude. The commander then ordered an evacuation and the crew exited through the right upper deck door using ladders provided by personnel from the airport RFF services. ", "probable_cause": "The cause of this accident was the termination of the take-off at a speed above V1 with insufficient runway remaining to stop the aircraft safely as a result of the commander’s interpretation that there was smoke and ‘fire’.\r\nContributory Causes:\r\na) The failure of the No 9 wheel rim during the take-off roll which caused the bang and smoke.\r\nb) The probable use of watermist as a medium to cool hot brakes which may have subject the wheel rims to fail under normal operating loads.\r\nc) The continued usage of the inboard wheel half that should have been retired during year 2000. "}