{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-65-80-queen-air-manila-13-killed", "date": "Dec 10, 2011 at 1415 LT", "type": "Beechcraft 80 Queen Air", "operator": "Aviation Technology Innovators", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Manila - San Jose", "msn": "LD-21", "yom": 1962, "flight_number": null, "city": "Manila-Ninoy Aquino", "zone": "Metro Manila", "country": "Philippines", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 10, "total_fatalities": 13, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On December 10, 2011, BE-65-80QA (Queen Air) with Registry RP-C824 took off from RWY 13, Manila Domestic Airport on/or about 0610 UTC (1410H) southbound for San Jose, Mindoro. There were three (3) persons on board, the PIC and two (2) other persons; one was seated at the right-hand cockpit seat and the other one at the passenger seat. After airborne, the ATC gave instructions to the pilot o turn right and report five (5) miles out. After performing the right turn, the pilot requested for a reland which was duly acknowledged but the ATC with instructions to cross behind traffic on short final Rwy 06 (a perpendicular international runway) and to confirm if experiencing difficulty. However, there was no more response from the pilot. From a level flight southward at about 200 feet AGL, three (3) loud sputtering/burst sounds coming from the aircraft were heard (by people on the ground) then the aircraft was observed making a left turn that progressed into a steep bank and roll-over on a dive. After about one complete roll on a dive the aircraft hit ground at point of impact (Coordinates 14.48848 N 121.025811 E), a confined area beside a creek surrounded by shaties where several people were in a huddle. Upon impact, the aircraft exploded and fire immediately spread to surrounding shanties and a nearby elementary school building. The aircraft was almost burned into ashes and several shanties were severely burned by post-crash fire. A total of thirteen (13) persons were fatality injured composed of: the 3 aircraft occupants who died due to non survivable impact and charred by post-crash fire, and ten (10) other persons on the ground, all residents at vicinity of impact point, incurred non-fatal injuries and were rushed to a nearby hospital for medical treatment. About 20 houses near the impact point were completely burnt and the adjacent Elementary School building was severely affected by fire.", "probable_cause": "The Aircraft Accident Investigation and Inquiry Board determined that the probable cause of this accident was:\r\n- Immediate Cause:\r\n(1) Pilot’s Lack of event proficiency in emergency procedures for one (1) engine in-operative condition after-off. Pilot Error (Human Factor) \r\nWhile a one engine in-operative condition during take-off after V1 is a survivable emergency event during training, the pilot failed to effectively maintain aircraft control the aircraft due to inadequate event proficiency.\r\n- Contributing Cause:\r\n(1) Left engine failure during take-off after V1. (Material Factor) \r\nThe left engine failed due to oil starvation as indicated by the severely burnt item 7 crankshaft assembly and frozen connecting rods 5 & 6. This triggered the series of events that led to the failure of the pilot to manage a supposedly survivable emergency event.\r\n- Underlying Causes:\r\n(1) Inadequate Pilot Training for Emergency Procedure. Human Factor \r\nEmergency event such as this (one engine inoperative event – twin engine aircraft) was not actually or properly performed (discussed only) in actual training flights/check-ride and neither provided with corresponding psycho-motor training on a simulator. Hence, pilot’s motor skill/judgment recall was not effective (not free-flowing) during actual emergency event.\r\n(2) Inadequate engine overhaul capability of AMO. Human Factor\r\nThere was no document to prove that engine parts scheduled to be overhauled aboard were complied with or included in the overhaul activity. The presence unauthorized welding spot in the left-hand engine per teardown inspection report manifested substandard overhaul activity.\r\n(3) Inadequate regulatory oversight (airworthiness inspection) on the overhaul activity of the AMO (on engine overhaul). Human Factor\r\nThe airworthiness inspection on this major maintenance activity (engine overhaul) failed to ensure integrity and quality of replacement parts and work done (presence of welding spots).\r\n(4) Unnecessary Deviation by ATC from the AIP provision on Runway 13 Standard VFR Departure Southbound.\r\nThe initiative of the AY+TC for an early right turn southbound after airborne was not in accord with the standard departure in the AIP which provides the safest corridor for takeoff and the ample time to stabilize aircraft parameters in case of a one engine inoperative emergency event for a successful re-land or controlled emergency landing. "}