{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-1-dk-dakota-c3-mill-hill-28-killed", "date": "Oct 17, 1950 at 1545 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "BEA", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Northolt – Glasgow", "msn": "12186", "yom": 1943, "flight_number": null, "city": "Mill Hill", "zone": "London Metropolis", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 4, "pax_on_board": 24, "pax_fatalities": 24, "other_fatalities": 0, "total_fatalities": 28, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft left RAF Northolt at 1538LT on a regular service to Glasgow-Renfrew. Shortly after takeoff, while climbing to an altitude of 500 feet, the crew encountered technical problems with the right engine that was shot down and its propeller was feathered. The pilot contacted ground and obtained the authorization to return for an emergency landing. While descending to the runway 26 with the left engine operating only and the undercarriage down, the aircraft lost height, contacted trees and crashed in flames in Mill Hill, about nine miles northeast of the airbase. The aircraft was destroyed by impact forces and a post crash fire and a crew member was seriously injured while all 28 other occupants were killed. ", "probable_cause": "The first and preponderant cause among those which contributed to the accident was the failure of the master rod bearings of the starboard engine. This failure could not have been foreseen or guarded against by any greater exercise of vigilance that could reasonably have been required of the operators and their staff. The secondary causes are harder to assess and evaluate. Among them are or may be: \r\na) The failure of pilots to make an immediate visual landing upon realizing that they must stop the starboard engine; \r\nb) The failure of the pilots to make use of SBA although equipment was carried in the aircraft. SBA would not have been subject in this instance to the disadvantages of GCA (\"presence of a mass of permanent echoes which obscure on the visual display returns from aircraft within the irregularity bounded area of sky, covered by those echoes\"); \r\nc) The failure of the pilots, having elected to make use of GCA, to retract the undercarriage while flying away from the airport over the distance necessary to bring their aircraft under the effective control of GCA and thereafter; \r\nd) The glazing of the lead deposits on the sparking plugs of the port engine while under conditions of high power-output leading to ignition trouble and so to a lose of power sufficient to destroy the ability of the aircraft to maintain level flight; \r\ne) The necessity for taking drastic action with the controls to avoid the steeple of Harrow-on-the-Hill Church, and the high ground beyond, at a time when there was but a marginal reserve of power for maintaining level flight."}