{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-15-dc-skymaster-near-ghazni-3-killed", "date": "Dec 12, 1963 at 1445 LT", "type": "Douglas C-54 Skymaster", "operator": "TMA%20Cargo-2", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Beirut – Kuwait City – Kabul", "msn": "10424", "yom": 1944, "flight_number": null, "city": "Ghazni", "zone": "Ghazni", "country": "Afghanistan", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 9957, "captain_hours_type": 3193, "copilot_hours": 2842, "copilot_hours_type": 743, "aircraft_hours": null, "circumstances": "The aircraft was on a non-scheduled international cargo flight from Beirut, Lebanon to Kabul, Afghanistan via Kuwait, carrying a crew of three. The trip to Kuwait was uneventful, and it arrived there at 0036 hours GMT on 12 December. Departure from Kuwait for Kabul was at 0256 hours and the flight reported passing Kandahar at 0838 and Kalat at 0900 flying at flight level 110. While en route the aircraft was provided with the Kandahar and Kabul weather. At 0942 hours it reported passing Ghazni at 0940, flying at flight level 150 and estimated its arrival time at Kabul as 10 10 hours. However, at 0958 (i. e. 12 minutes before ETA) it reported overhead Kabul and requested the latest weather situation which was provided. As the aircraft could not land at Kabul because of the weather conditions it reported at 0959 hours that it was diverting to Lahore. Shortly thereafter it reported it was proceeding to Zahedan via Ghazni (ETA 1025), Kandahar (ETA 1130) Zahedan (ETA 13 15). It would maintain flight level 150 to Ghazni, 130 to Kandahar and 110 to Zahedan. At 1003 hours the Kabul tower passed the Kandahar weather to the flight and 5 minutes later the flight reported it was 25 miles out from Kabul, at flight level 150. The aircraft was then cleared by Kabul tower to route frequency and nothing further was heard from it. The wreckage of the aircraft was first sighted on 16 August 1964, after the snow had melted, at an elevation of 13 940 ft amsl in the Koh-i-Safid Mountains 50 NM west of Ghazni and 42 NM from the approved air route. The coordinates of the accident site were estimated to be 33° 37' N 67° 35' E. The time of the accident was some time after 1015 hours GMT on 12 December 1963. The wreckage was found by Afghan soldiers on 16 August 1964.", "probable_cause": "A wrong estimation of the wind speed and direction resulted in a navigation error which brought the aircraft 42 NM from the approved air route. Possible contributing factor s were: lack of weather forecast prior to take-off, personal worries, fatigue and lack of oxygen, inadequate charts and maps."}