{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-29a-70-bn-superfortress-suwon", "date": "Apr 12, 1951", "type": "Boeing B-29 Superfortress", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Bombing", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "11729", "yom": 1944, "flight_number": null, "city": "Suwon", "zone": "Gyeonggi (경기도)", "country": "South Korea", "region": "Asia", "crew_on_board": 13, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The B-29 was part of a three wing formation aimed at destroying railway bridges across the Yalu river at Sinuiju and Antung. This was a dangerous daylight mission that was so disastrous for the Air Force that on the following days the planes were painted black on the bottom and scheduled for safer night time raids. The aircraft was acting as the electronics countermeasure aircraft for that particular bombing mission. Its job was to confuse enemy ground radar through the use of electronic jamming equipment combined with the dropping of aluminum foil strips called chaff. It was in the slot (last) position of the 2nd group (of 3 groups) which put it in the middle of the 3 groups. There was some space between each group. This B-29 had some engine trouble (from age) causing it to slow down, so rather than force its own group to slow down it dropped from the last spot of the 2nd group back to become the lead plane of the next group (the 22nd Bomb Squadron). It was during this brief unfortunate window that the Russian piloted MiG-15's attacked, finding a lone B-29 all by itself between two groups. The aircraft was damaged by the MiG-15s. A fire erupted forcing seven crew members to bail out; they became PoWs. The remaining crew managed to extinguish the fire and nursed the aircraft back to Suwon AFB, South Korea. Badly damaged, the crew did not attempt to land but bailed out, leaving the aircraft to crash into a hill near Suwon, 10 miles S of Seoul.\nCrew:\n1st Lt Henry N. Anderson,\n1st Lt Charles N. Banchiera,\nCpl Edward F. Clements,\nCpt Jack W. Frost,\nSgt Floyd T. Hobbs,\nM/Sgt Owen M. King,\n1st Lt Paul D. Lehman,\n1st Lt Francis J. Liberatore,\n1st Lt Charles W. Matt,\n1st Lt Pierre E. Nys,\nS/Sgt John L. O'Flynn,\nCpt Stanley N. Prewdzik\nCpl Thomas H. Protiva Jr.,\nSgt John B. Tutt.\nSource: \nhttp://www.joebaugher.com/usaf_serials/1944_4.html", "probable_cause": "Shot down by fighter. "}