{"url": "https://www.baaa-acro.com/crash/crash-boeing-747sr-46-mt-osutaka-520-killed", "date": "Aug 12, 1985 at 1856 LT", "type": "Boeing 747-200", "operator": "Japan%20Airlines-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Tokyo - Osaka", "msn": "20783", "yom": 1974, "flight_number": "JL123", "city": "Mt Osutaka", "zone": "Kantō", "country": "Japan", "region": "Asia", "crew_on_board": 15, "crew_fatalities": 14, "pax_on_board": 509, "pax_fatalities": 506, "other_fatalities": 0, "total_fatalities": 520, "captain_hours": 12423, "captain_hours_type": 4842, "copilot_hours": 3963, "copilot_hours_type": 2665, "aircraft_hours": 25030, "circumstances": "JA8119 was a Japan Air Lines Boeing 747SR, a short range variant of the Boeing 747 Series 100. The was aircraft specifically configured for domestic flights with a high density seating arrangement. On June 2, 1978 the aircraft operated on a flight to Osaka (ITM). It floated after touchdown and on the second touchdown the tail struck the runway. The aircraft sustained substantial damage to the rear underside of the fuselage. The rear pressure bulkhead was cracked as well. The aircraft was repaired by Boeing. Engineers replaced the lower part of the rear fuselage and a portion of the lower half of the bulkhead. Seven years later, on August 12, 1985, JA8119 had completed four domestic flights when it landed at Tokyo-Haneda (HND) at 17:17. The next flight was to be flight 123 to Osaka (ITM). The aircraft took off from Tokyo-Haneda at 18:12. Twelve minutes later, while climbing through 23900 feet at a speed of 300 knots, an unusual vibration occurred. An impact force raised the nose of the aircraft and control problems were experienced. A decompression had occurred and the crew got indications of problems with the R5 door. In fact, the rear pressure bulkhead had ruptured, causing serious damage to the rear of the plane. A portion of its vertical fin, measuring 5 m together with the section of the tail cone containing the auxiliary power unit (APU) were ripped off the plane. Due to the damage, the hydraulic pressure dropped and ailerons, elevators and yaw damper became inoperative. Controlling the plane was very difficult as the airplane experienced dutch rolls and phugoid oscillations (unusual movement in which altitude and speed change significantly in a 20-100 seconds cycle without change of angle of attack). The aircraft started to descend to 6600 feet while the crew tried to control the aircraft by using engine thrust. Upon reaching 6600 feet the airspeed had dropped to 108 knots. The aircraft then climbed with a 39 degree pitch-up to a maximum of approx. 13400 feet and started to descend again. At 18:56 JAL123 finally brushed against a tree covered ridge, continued and struck the Osutaka Ridge, bursting into flames. A stewardess, one female passenger and two little girl survived while 520 other occupants were killed. ", "probable_cause": "It is estimated that this accident was caused by deterioration of flying quality and loss of primary flight control functions due to rupture of the aft pressure bulkhead of the aircraft, and the subsequent ruptures of a part of the fuselage tail, vertical fin and hydraulic flight control systems. The reason why the aft pressure bulkhead was ruptured in flight is estimated to be that the strength of the said bulkhead was reduced due to fatigue cracks propagating at the spliced portion of the bulkhead's webs to the extent that it became unable to endure the cabin pressure in flight at that time. The initiation and propagation of the fatigue cracks are attributable to the improper repairs of the said bulkhead conducted in 1978, and it is estimated that the fatigue cracks having not be found in the later maintenance inspection is contributive to their propagation leading to the rupture of the said bulkhead."}