{"url": "https://www.baaa-acro.com/crash/crash-airbus-a340-642-quito", "date": "Nov 9, 2007 at 1706 LT", "type": "Airbus A340-600", "operator": "Iberia-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Madrid - Quito", "msn": "731", "yom": 2006, "flight_number": "IB6463", "city": "Quito-Mariscal Sucre (City)", "zone": "Pichincha", "country": "Ecuador", "region": "South America", "crew_on_board": 14, "crew_fatalities": 0, "pax_on_board": 345, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14024, "captain_hours_type": 2375, "copilot_hours": 10095, "copilot_hours_type": 1742, "aircraft_hours": 8704, "circumstances": "Following an uneventful flight from Madrid, the crew contacted Quito Approach at 1650LT and received descent instructions in preparation for an instrument approach no. 4 (VOR QIT DME/ILS) for runway 35. During the descent the crew were notified that preceding flights had reported braking action medium to poor. The flight crew selected auto braking to 'High'. At 17:05, the crew reported the runway in sight, after which the controller stated that the wind was 170° at 4 knots, the runway was wet and reported braking action was poor. The flight was cleared to land. The pilot in command, following the procedures established by Iberia, decided to leave the ILS glide path and captured the path of the PAPI lights. The aircraft touched down 200 metres past the threshold at a 3.09g side load. The spoilers deployed automatically and main gear tyres 3 and 8 blew. The flap lever was moved involuntarily by the copilot, from the full position to position 2. The crew applied full manual braking and select reverse thrust. The Auto Brake function failed, after which the crew disconnected the antiskid braking system and continued to apply manual braking. The aircraft passed the end of runway 35, with a ground speed of 90 knots, hit the ILS localizer and stopped 232 meters further. Passengers and crew were evacuated using the slide at door 2R, thirty minutes after the aircraft stopped. All occupants escaped uninjured while the aircraft was considered as damaged beyond repair. ", "probable_cause": "Wrong approach configuration on part of the crew who decided to continue the approach to Quito Airport, knowing the poor runway conditions, poor weather conditions and the aircraft weight, and his failure to initiate a go-around procedure while forcing the aircraft to intercept the PAPI, causing the aircraft to be unstabilized.\r\nContributing factors:\r\n- On the date of the incident, the crew did not have specific regulations and operating procedures (the briefing of the operator for the airport in Quito was inappropriate to the existent conditions).\r\n- The fact that the crew still being experienced similar airports in Quito and had not experienced similar weather situations, circumstances that would have allowed a strategy of approximation consistent with the terms of this operation, in particular as regards:\r\n- Calculations in flight for landing runway length,\r\n- Minimum altitude to start the maneuver of changing the path of ILS to PAPI,\r\n- Carrying out a very detailed briefing that allowed unwanted deviations on approach,\r\n- The weather conditions existing at the time of landing (visibility, tail wind and moderate rain)."}