{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54-d-10-dc-skymaster-oakland-3-killed", "date": "Nov 17, 1951 at 1014 LT", "type": "Douglas C-54 Skymaster", "operator": "Overseas%20National%20Airways.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Oakland - Oakland", "msn": "10832", "yom": 1945, "flight_number": null, "city": "Oakland", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 7871, "captain_hours_type": 5028, "copilot_hours": 3590, "copilot_hours_type": 1900, "aircraft_hours": 5257, "circumstances": "Overseas National's DC-4 took off from the Oakland Airport at 0820. Captain Marion Harvey Click, company cheek pilot, was in command and aboard were Captains Hammond Garrard and Warren Cecil Gessner who were to receive their six months DC-4 instrument competency cheeks. There were no other persons aboard. The aircraft had been refueled with 1,229 gallons of gasoline and 11 gallons of oil; the total load was within the certificated gross weight and was properly distributed. At 0925, this flight received a clearance from the Oakland tower to make a practice range approach and to remain above 1,500 feet on the final approach to the airport. At 0935, the California Eastern DC-4 3 took off from the Oakland Airport for the purpose of a six-month instrument competency check. Captain Ralph A. Shope, company chief pilot, was in command and occupied the right scat. Captain Winfield B. Kinner, receiving the cheek, was in the left seat. Louis Goldberg, an upholsterer and company mechanic, occupied a cabin seat and was on board only to sew some arm rests. The aircraft had been refueled with 1600 gallons of gasoline, and the total load was within the certificated gross weight and was properly distributed. According to accepted practice, both flights conducted their training cheeks in the \"Bay area,\" with all maneuvers above 3,000 feet. Both aircraft were equipped with hoods, installed on the left side of each cockpit to prevent the pilots being checked from seeing outside. The cheek pilots in the right seats, also perform the duties of safety pilots, maintaining watch for other aircraft. There was also a third pilot on board Overseas who acted as an observer. Shortly before 1013, the approximate time of the accident, both aircraft approached the Oakland low frequency radio range station, which is 0.2 mile northeast from the approach end of Runway 15 of the Oakland Airport. Overseas was on a magnetic heading of approximately 124 degrees inbound on the NW leg of the range; and California was homing on the range on a heading of 75 degrees M 4 Both aircraft were at an altitude of 3,000 feet. Weather conditions were good in the San Francisco Bay area at the time. The U. S. Weather Bureau reported at 1016 (three minutes after the accident); ceiling 25,000 feet, thin broken clouds, visibility seven miles, wind south four mph at Oakland. The sun's bearing at 1015 was 153 degrees .JPG\">, and its altitude above the horizon was 28 degrees and 27 minutes. During a short period prior to 1013, both aircraft were observed to converge without any apparent change in direction or altitude. Neither attempted to avoid collision but remained in straight and level flight, and collided approximately over the range station at an altitude of about 3,000 feet. California was at a slightly lower altitude than Overseas, and contact was made between the leading edge of the vertical stabilizer of California and the right side of the fuselage of Overseas just forward of the horizontal stabilizer. Shortly after the collision, Overseas crashed out of control on Doolittle Drive, the highway paralleling the north side of Oakland Airport. Its three pilots were killed at the time of impact with the ground. A number of persons driving on the highway close to the impact site received burns of varying degrees, and several automobiles were destroyed by fire. The top portions of the vertical stabilizer and rudder of California were torn off in the collision. The aircraft was still controllable at an air speed of 160 miles an hour. Immediately following the collision, Captain Shope had Captain Kinner remove the hood. As California was then south of the Oakland Airport at 2,500 feet, Captain Shops requested permission to land on Runway 9R, the longest runway, and to have emergency equipment stand by. However, since all fire equipment was then at the crash scene of Overseas, the flight was directed to the San Francisco Airport, 12 miles away, where an emergency landing was made at 1021.", "probable_cause": "The Board determines that the probable cause of this accident was the failure of the Overseas safety pilot and/or his observer to observe and so avoid the other aircraft and the failure of California's safety pilot to carry a qualified observer aboard the aircraft to insure an adequate field of vision. The following findings were pointed out:\r\n- Both flights were for the purpose or giving six-month instrument competency cheeks, with hoods installed on the left side of both cockpits,\r\n- Overseas carried an observer, as required; California did not,\r\n- Both aircraft were making simulated (hooded) instrument approaches to the Oakland range station at the same altitude,\r\n- The aircraft converged at an angle of approximately 49 degrees,\r\n- Overseas was a few feet higher than California,\r\n- No evasive action was taken by either aircraft before collision,\r\n- The collision occurred at an altitude of 3,000 feet approximately over the Oakland range station."}