{"url": "https://www.baaa-acro.com/crash/crash-cessna-t303-crusader-deland", "date": "May 28, 1990 at 0803 LT", "type": "Cessna 303 Crusader", "operator": "Embry-Riddle Aeronautical University", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Daytona Beach - DeLand", "msn": "303-00285", "yom": 1984, "flight_number": null, "city": "DeLand", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1520, "captain_hours_type": 100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2542, "circumstances": "During an NDB approach in instrument conditions with the landing gear extended, the fire warning light for the right engine illuminated. The right engine was shut down and a missed approach was initiated; however, the landing gear would not retract and the aircraft would not maintain altitude. As it descended into the top of an overcast at an altitude of about 600 feet, the pilots tried to restart the engine, but to no avail. Subsequently, the aircraft descended below the clouds at an altitude of about 150 feet to 170 feet. As the instructor (cfi) landed the aircraft in an open field, the nose gear encountered soft dirt and the aircraft nosed over. An exam revealed that an electrical power jumper wire between 2 bus bars had become chafed and shorted. The left and right isolation circuit breakers and the bus tie circuit breaker were found in the tripped (open) position. This resulted in a false fire warning light and prevented the landing gear from being retracted. ", "probable_cause": "The chafed and shorted electrical wiring between bus bars, which caused a partial electrical failure, resulted in a false fire warning indication, and prevented the restart of the right engine."}