{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh104-dove-5-melbourne", "date": "Dec 3, 1993 at 2037 LT", "type": "De Havilland DH.104 Dove", "operator": "Rudge Air", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "City", "schedule": "Melbourne - Melbourne", "msn": "04104", "yom": 1948, "flight_number": null, "city": "Melbourne-Essendon", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 18154, "captain_hours_type": 1500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 21259, "circumstances": "The pilot had planned to conduct a night charter flight over Melbourne and Port Phillip Bay, starting from and returning to Essendon Airport. Dinner was to be served in flight. The pilot gave a safety briefing to the passengers before starting the engines. He completed engine runups and pre-takeoff checks, including selecting 20° of flap. At 2036 ESuT, in daylight, the pilot initiated takeoff on runway 17 using standard take-off power setting of 7.5 lb/in2 of boost and 3,000 RPM. Wind conditions were light and variable, visibility was about 10 km and the temperature was 19°C. The aircraft became airborne and, just as it achieved the take-off safety speed of 84 kts, at a height not above 50 ft, the right engine lost power. The aircraft yawed right. The pilot reported to the investigation team that he briefly noticed a reading of 3 lb of boost on the MAP gauge and assessed the problem as a possible partial right engine failure. He then selected the landing gear up but it did not retract. He cycled the landing gear selector once and the gear then retracted. By this time several seconds had elapsed and the airspeed had decayed to 76 kts. The pilot then assessed the airspeed as too low to retract the flaps and left them at 20°. The airspeed continued to decay until VMCA, 72 kts, was reached. When indicated airspeed had further decayed to 68 kts, the pilot reduced power on the left engine to avoid an uncontrollable roll to the right. He was able to maintain wings level and attempted to track the aircraft toward a street but was unable to maintain height. The aircraft collided with powerlines and then struck the roofs of several houses before coming to rest, on its left side, against the front wall of a house. About one minute had elapsed from initiation of takeoff until the accident. The pilot and all but one of the passengers remained conscious throughout the accident sequence. All occupants were evacuated, some without assistance and others with the assistance of the pilot, other passengers, emergency services personnel or bystanders.", "probable_cause": "The following factors were reported:\r\n- The right engine fuel control unit fuel pump failed causing the engine to fail at a critical phase of flight.\r\n- Maintenance inspections did not detect the abnormal wear on the thrust face of the right engine fuel control unit fuel pump.\r\n- The landing gear did not retract on the first attempt and aircraft performance decayed while the pilot resolved this problem. \r\n- The pilot was probably forced to abandon the emergency procedures to concentrate on maintaining control of the aircraft.\r\n- The aircraft was unable to maintain altitude and airspeed with the right propeller windmilling and 20° of flap.\r\n- The investigation identified organisational factors concerning deficiencies in the manuals and procedures available to, and used by, the operator for the operation and maintenance of the accident aircraft."}