{"url": "https://www.baaa-acro.com/crash/crash-consolidated-pby-5a-catalina-jacquinot-bay", "date": "Feb 7, 1944", "type": "Consolidated PBY Catalina", "operator": "Royal-Australian-Air-Force-3", "flight_phase": "Flight", "flight_type": "Bombing", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Cairns - Cairns", "msn": "1044", "yom": null, "flight_number": null, "city": "Jacquinot Bay", "zone": "East New Britain", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 10, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The seaplane took off from Cairns at 1040LT and proceeded to Milne Bay and landed to refuel then took off at 1600LT on a solo nuisance mission against Kavieng. At 2300LT, it reached the target area during a bright moonlite night at an altitude of 9,000 feet. Over Panapai Airfield but did not drop any bombs and received light anti-aircraft fire. During a second bomb run, it dropped two 250 lbs bombs and numerous incendiaries and photographs were taken, and heavy anti-aircraft fire was received but not accurate. Ships in Kavieng harbor opened fire with intense and accurate anti-aircraft fire aimed at this Catalina. Over Kavieng Airfield, made a third bomb run dropping two 500 lbs bombs and photographs were taken. The flying boat received intense and accurate anti-aircraft fire that required evasive maneuvers. At approximately 2350LT on an mission to attack Kavieng, a parachute flare inside this PBY ignited prematurely while its altitude setting ring was being adjusted. In order to prevent premature detonation of other ordnance or mid-air structural failure from fire, the Catalina ditched into Jacquinot Bay. The crew swam to shore in the vicinity of Malakua. The aircraft was lost.\n\nSource: http://www.pacificwrecks.com/", "probable_cause": null}