{"url": "https://www.baaa-acro.com/crash/crash-short-s23-empire-flying-boat-sydney-1-killed", "date": "Oct 11, 1944 at 0730 LT", "type": "Short S.23 Empire Flying Boat", "operator": "Qantas2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Sydney – Townsville", "msn": "S.877", "yom": 17, "flight_number": null, "city": "Sydney", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 22, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2886, "circumstances": "After take off from Rose Bay in Sydney, the crew encountered technical problems with the flaps that should be raised manually because the electric flap motor failed. Twenty minutes into the flight, the flight oil pressure on starboard inner engine fell below normal levels. The captain decided to return to Rose Bay to rectify faults and the landing approach was made into the north and without flaps. Finding that he had excess height, the captain introduced a left-hand side-slip during the approach. On straighening out from the side-slip, the captain proceeded with the intention of making a normal landing. On checking the glide at about 40 feet, he realized that the aircraft was flattening out too high. He stopped easing back on the controls expecting the boat to sink further towards the water. Without any further control movement the aircraft completely stalled some twelve feet above the water, dropped sharply and made contact with the water in a normal attitude but with considerable force. Impact caused a major failure of the hull which allowed extensive break-up of the fuselage. Considerable length of the rear end of the hull and tail unit separated from rest of aircraft and both sections sank within 15 minutes. Passengers and crew escaped the wreckage and were rescued but one passenger drowned.\r\nCrew:\r\nCpt K. C. Caldwell, pilot,\r\nCpt L. J. Brain, pilot.\r\nPassenger drowned: Mr. J. Mott.\r\nSource & photos: \r\nhttp://www.aussieairliners.org/shortfb/vh-abb/vhabb.html", "probable_cause": "The accident was attributed to an error of judgement on the part of the captain."}