{"url": "https://www.baaa-acro.com/crash/crash-lockheed-18-lodestar-lakeland-2-killed", "date": "Oct 5, 1945 at 0105 LT", "type": "Lockheed 18 LodeStar", "operator": "National-Airlines-4", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Miami – Fort Myers –   Sarasota – Saint Petersburg – Tampa – Lakeland", "msn": "2265", "yom": 1942, "flight_number": "NA016", "city": "Lakeland", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 12, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4800, "captain_hours_type": 851, "copilot_hours": 5247, "copilot_hours_type": 409, "aircraft_hours": 1798, "circumstances": "Flight 16 departed Miami at 2112 October 4, 1945, one hour and 15 minutes late due to rerouting of the aircraft from a previous schedule. The flight from Miami progressed uneventfully with routine stops being made at Fort Myers, Sarasota, St. Petersburg and Tampa. The aircraft was refueled at Tampa and under contact flight rules was cleared to Lakeland 33 Miles away. Departure was made at 0045 with a crew of three and twelve passengers. The flight climbed to an altitude of 1500 feet and continued towards Lakeland. At the time of departure the weather at Tampa was unlimited while Lakeland was reporting 9 miles visibility and scattered clouds at 500 feet. At 0058, when seven miles from the field, the first officer called Lakeland and made an “in-range” report to which the Lakeland tower replied, “In range, wind NE 7-8 mph, NE runway”. Although the pilots observed scattered stratus clouds over the lighted city of Lakeland, the airport was clearly visible. A descent was established for a straight-in approach to the NE runway and when at an altitude of about 900 feet and approximately three or four miles from the field the captain extended the gear, put the mixture in automatic rich and reduced the manifold pressure to 20 inches. At an altitude of 700 feet the propellers were placed in low pitch and the landing lights were turned on. When about 2 miles from the field at 600 feet the flaps wore extended fully. Shortly thereafter, according to the testimony of the pilot, the aircraft entered a cloud, however, ground witnesses at no time lost sight of the flight during its approach indicating that the cloudiness was not extensive. This cloud was above dark terrain and had not been seen by the pilots as were others above the lighted city. Because of the unexpected presence of a cloud during the approach, the captain remarked to the first officer that he was going around again and retracted the wheels. Some power was applied and, according to statements of the captain, the flaps were started up at that time. A number of witnesses on and near the airport observed the aircraft continue down the runway at a uniform altitude of 30 or 40 feet. As it passed beyond the runway, the captain stated that the throttles were opened to 45 inches of manifold pressure but that the plane settled rapidly into the lake. The plane struck the surface of the water approximately 1000 feet beyond the runway shedding some fuselage covering and apparently skipped an additional 1000 feet where it sank in 10 feet of water. The occupants of the aircraft, with the exception of two passengers, escaped from the wreckage and were rescued by local residents approximately thirty minutes later.", "probable_cause": "On the basis of the foregoing the Board determines that the probable cause of this accident was faulty execution of a missed approach procedure resulting in settling of the aircraft into a water area beyond the landing runway."}