{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-reno-2-killed", "date": "Jan 15, 1993 at 1343 LT", "type": "Cessna 414 Chancellor", "operator": "Plane Wrap", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Reno - Camarillo", "msn": "414-0928", "yom": 1976, "flight_number": null, "city": "Reno-Tahoe (ex Cannon)", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1935, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A Cessna 414 collided with a level ground while attempting to land during a snow shower. The pilot reported an emergency one minute after departing ifr and requested to return to the airport under visual rules. The pilot indicated to air traffic control that 'I can't get any speed.' The visibility was variable around the airport with the lowest report of 1/2 mile. Witnesses observed the airplane traveling fast at low altitude and indicated both engines were running. Investigation revealed during servicing before the flight, the pitot tube covers were not used. About 1.5 inches of snow had accumulated on the airplane during the refueling and was brushed off. The airplane was seen flying into a snow shower and reversing course. Witnesses reported the airplane's angle of bank to be 80 to 90° with a 20° pitch down attitude. The airplane descended into a snow covered pasture. Witnesses reported the airplane leveled its wing just before impact. Manufacturer's safety and warning supplements indicate inflight ice protection is not designed to remove snow on parked aircraft. The manufacturer recommends use of heated hangars or approved deicing solutions to insure the are no internal accumulations in pitot static system ports. Both occupants were killed. ", "probable_cause": "The failure of the pilot to use pitot static system covers during icing conditions which resulted in a blocked pitot tube and subsequent loss of airspeed indications. This led to pilot disorientation and an invertant stall. Factors to the accident were improper snow removal and adverse weather conditions."}