{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-bravo-reinhardtsdorf-schona-2-killed", "date": "Feb 14, 2010 at 2038 LT", "type": "Cessna 550 Citation Bravo", "operator": "Time-Air-2", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Mountains", "schedule": "Prague - Karlstad", "msn": "550-1111", "yom": 2005, "flight_number": "TIE039C", "city": "Reinhardtsdorf-Schöna", "zone": "Saxony", "country": "Germany", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1700, "captain_hours_type": null, "copilot_hours": 1600, "copilot_hours_type": null, "aircraft_hours": 1830, "circumstances": "During the early evening, at 1946 hrs, after a flight time of one hour and 50 minutes the airplane came back to Prague, Czech Republic, after a flight to France. For the Pilot in Command (PIC) it was the first flight of the day. The co-pilot left the airplane after the landing and was replaced by the copilot of the subsequent accident flight. The co-pilot had already flown two flights that day - around midday - with a total flight time of one hour and 40 minutes. There were no passengers on board. The aircraft departed Prague at 2008 hrs for a ferry flight to Karlskrona, Sweden. The flight was conducted in accordance with Instrument Flight Rules (IFR). The course of events is described based on the analysis of the recordings of the Flight Data Recorder (FDR), the Cockpit Voice Recorder (CVR), radar and radio communications. The appendix shows two different FDR recording diagrams. Diagram 1 shows the entire flight (time in UTC) and diagram 2 shows the flight from 1918:30 UTC on. Take-off took place on runway 31. The co-pilot was Pilot Flying (PF). The flight was conducted manually, neither of the two autopilots was engaged. From 2012 hrs on, after a right hand turn, the flight proceeded toward the north. The airplane was in climb attitude. At 2014:16 hrs, still in climb, the PIC said \"I didn't fly night time for long time\". The co-pilot asked: \"Have you already experienced a roll during night?\" She answered laughing: \"Yes, really.\" He: \"Better we won't.\" She laughing: \"Do you enjoy that thing?\" Co-pilot: \"You are the first one with whom I talked about it, don't tell it [...].\" PIC: \"Whom shall I not tell?\" [...] She again: \"I also do it always, but I persuade [...] to do that.\" Co-pilot: \"[...] Bravo does it better.\" At 2015:00 hrs, during this short conversation, the crew received the instruction from ATC Prague to climb to FL260 and to level off above reporting point DEKOV. The conversation in the cockpit continued. Co-pilot: \"Bravo does the roll faster with the ailerons but the spoilers are slower.\" At 2015:33 hrs ATC repeated the instruction. At 2015:40 hrs the PIC acknowledged the instruction. Between 2017:10 hrs and 2017:20 hrs the airplane rolled about its longitudinal axis; initially to the left up to a bank angle of 30°, and right afterwards to the right up to a bank angle of 20°, then back again to the horizontal. At 2017:20 hrs the PIC responded to it with the words: \"Let's go, we are already high enough, you nettle me - come on [...].\" At 2017:22rs ATC Prague instructed the crew to contact ATC Munich; at 2017:35 hrs the PIC confirmed the instruction. At 2017:42 hrs she said: \"Later but.\" The co-pilot replied: \"Let's do it at higher altitude.\" At 2018:29 hrs, the PIC contacted ATC Munich. At 2018:36 hrs the crew received the instruction from ATC Munich to climb to FL330. This was confirmed at 2018:44 hrs. Between 2018:51 hrs and 2019:00 hrs the following conversation took place:\r\n- 2018:51 hrs PIC: \"Sufficient, is it sufficient?\"\r\n- 2018:53 hrs Co-pilot: \"For what?\"\r\n- 2018:54 hrs PIC: \"Sufficient.\"\r\n- 2018:56 hrs PIC: \"The altitude.\"\r\n- 2018:58 hrs Co-pilot: \"For what?\"\r\n- 2018:58 hrs PIC: \"For that,\"\r\n- 2019:00 hrs Co-pilot: \"It is sufficient.\"\r\nAt 2019:00 hrs the airplane levelled off in FL270, at 2019:05 hrs the airplane nose moved upward until a pitch angle of about 14° was reached. At 2019:09 hrs the aircraft began to roll about its longitudinal axis to the right. Within 4 seconds the airplane reached the inverted flight attitude and in another 4 seconds it rolled another 90°. Simultaneously the heading changed right toward the east, then toward the south and finally toward the west. During the roll the pitch angle decreased to almost -85° which is almost a vertical nose dive. The computed airspeed increased\r\nsignificantly. The airplane crashed near Reinhardtsdorf-Schöna, Saxon Switzerland, about 500 m north of the border to the Czech Republic. ", "probable_cause": "The accident was due to:\r\n- The crew tried to conduct a flight manoeuvre (roll) which is not part of commercial air transport, \r\n- The crew suffered loss of spatial orientation and subsequently did no longer have the ability to recover the flight attitude. \r\nThe following factors contributed: \r\n- The pilots were not trained in aerobatics,\r\n- It was night and therefore there were no visual references,\r\n- The relationship between the two pilots resulted in the departure from professional behavior in regard to crew coordination,\r\n- The airplane was neither designed nor certified for aerobatics. \n"}