{"url": "https://www.baaa-acro.com/crash/crash-hawker-siddeley-hs125-1a-522-mt-otay-10-killed", "date": "Mar 16, 1991 at 0143 LT", "type": "BAe 125", "operator": "Duncan Aircraft Sales", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "San Diego – Amarillo – Evansville", "msn": "25095", "yom": 1966, "flight_number": null, "city": "Mt Otay", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 15000, "captain_hours_type": 150, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After flying personnel of entertainment group to Lindbergh Field, aircraft was positioned to nearby Brown Field, since late departure was planned after noise curfew was in effect at Lindbergh. Pilot talked with FSS specialist (splst) 3 times before takeoff. He reported he did not have instruction departure procedures from airport. Splst read departure procedures on phone. On last call to FSS, pilot said he planned to depart VFR toward northeast and obtain IFR clearance after airborne (this route was toward mountains.) During call, pilot expressed concern about remaining cleared of TCA and inquired about staying below 3,000 feet. Splst agreed with pilots concerns, but after accident, splst said he thought pilot was referring to 3,000 feet agl, rather than 3,000 feet msl. Pilot had filed to takeoff at midnight, but didn't get airborne until 0141 pst. Since flight was over 1.5 hours late, IFR flight plan had 'clocked out.' As controller was reentering flight plan in computer, aircraft hit rising terrain near top of mountain, about 8 miles northeast of airport at elevation of about 3,300 feet. No deficiencies were found with aircraft or its engines. Copilot had no type rating for this aircraft, tho he reportedly had made 3 takeoffs and landings in Hawker-Siddeley HS.125. All 10 occupants were killed, among them all members of the country music 'Reba McEntire Band'.\r\nPassengers:\r\nChris Austin, \r\nKirk Cappello, \r\nJoey Cigainero, \r\nPaul Kaye Evans, \r\nJim Hammond, \r\nTerry Jackson, \r\nAnthony Saputo,\r\nMichael Thomas. ", "probable_cause": "Improper planning/decision by the pilot, the pilot's failure to maintain proper altitude and clearance over mountainous terrain, and the copilot's failure to adequately monitor the progress of the flight. Factors related to the accident were: insufficient terrain information provided by the flight service specialist during  the preflight briefing after the pilot inquired about a low altitude departure, darkness, mountainous terrain, both pilot's lack of familiarity with the geographical area, and the copilot's lack of familiarity with the aircraft."}