{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-30-dl-carolina", "date": "Sep 15, 1952", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "South%20African%20Airways2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Livingstone – Johannesburg", "msn": "9630", "yom": 1943, "flight_number": null, "city": "Carolina", "zone": "Mpumalanga", "country": "South Africa", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 14, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Enroute from Livingston to Jo'burg-Palmietfontein Airport, the crew encountered poor weather conditions and the pilot-in-command lost his orientation. In low visibility, the captain decided to divert to Carolina Airport but on final, the aircraft was too low and hit a rock and crashed 2 km short of runway. All 19 occupants evacuated safely while the aircraft was damaged beyond repair.", "probable_cause": "The primary cause of the accident was a faulty navigation on part of the Captain of the airplane inasmuch as he set off on an incorrect course and thereafter his visual identification of towns en route was incorrect and based purely on assumptions. Had he checked his assumed ground speed between what he assumed to be Mahalapye and Warmbaths he would have found this to be approximately 318 mph which check would have alerted him. The secondary cause of the accident was the failure of those responsible to alert Pietersburg Aeradio Station and Beacon and the excessive degree of radio interference on the Rand on the evening of 15 September due to electrical storms. The tertiary cause was an attempted landing on a unidentified and unlighted aerodrome, of which the altitude was not known. Thereafter in a low approach the wheels of the airplane struck a rock outcrop approximately 1-1/4 miles from the airfield."}