{"url": "https://www.baaa-acro.com/crash/crash-vickers-802-viscount-craigie", "date": "Apr 28, 1958 at 2208 LT", "type": "Vickers Viscount", "operator": "BEA", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "London - Prestwick", "msn": "254", "yom": 1957, "flight_number": null, "city": "Craigie", "zone": "Ayrshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The accident occurred at 2208 hours during an unscheduled flight from London to Prestwick where the aircraft mas to pick up passengers for BOAC under a charter arrangement and fly them to London. The aircraft took off at 2042 hours GMT from London Airport, cruised on the Airways at 18 500 ft and then commenced the descent to Prestwick with an initial clearance to 8 500 ft. Within a few minutes the clearance was amended to cross the Prestwick radio beacon at 4 000 ft. The descent appeared to the pilots to be normal until the aircraft struck the ground close to the site of the beacon very shortly after the captain had reported passing 11 000 ft in the holding pattern. The aircraft slid along the ground for 400 yards, and fire broke out in the starboard wing, Of the five crew aboard the aircraft, three were seriously injured. The airplane was totally destroyed by fire. ", "probable_cause": "The captain flew the aircraft into the ground during the descent to Prestwick after misreading the altimeter by 10 000 ft. Whilst a somewhat ambiguous presentation of height on the pressure altimeter may have initiated this misreading. A lack of cooperation between the captain and first officer and a lack of alertness on the part of the first officer were the main contributory factors."}