{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-31-new-hope-72-killed", "date": "Apr 4, 1977 at 1619 LT", "type": "Douglas DC-9", "operator": "Southern%20Airways-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "City", "schedule": "Muscle Shoals - Huntsville - Atlanta", "msn": "47393", "yom": 1970, "flight_number": "SO242", "city": "New Hope", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 81, "pax_fatalities": 61, "other_fatalities": 9, "total_fatalities": 72, "captain_hours": 19380, "captain_hours_type": 3205, "copilot_hours": 3878, "copilot_hours_type": 235, "aircraft_hours": 15405, "circumstances": "Southern Airways Flight 242, a DC-9-31, operated as a scheduled passenger flight from Muscle Shoals, Alabama, to Atlanta, Georgia, with an intermediate stop at Huntsville, Alabama. Flight 242 departed Muscle Shoals at 15:21 and landed at Huntsville about 15:44. About 15:54, Flight 242 departed Huntsville on an instrument flight rules (IFR) flight plan for the Hartsfield-Atlanta International Airport; there were 81 passengers and 4 crew members aboard. The flight's route was direct to the Rome VOR and then a Rome runway 26 profile descent to Atlanta. Its estimated time en route was 25 min and its requested en route altitude was 17,000 ft. At 15:56, the controller told Flight 242 that his radarscope was showing heavy precipitation and that the echos were about 5 nmi ahead of the flight. At 15:57:36, the controller said, \"...you're in what appears to be about the heaviest part of it now, what are your flight conditions.\" Flight 242 replied, \"...we're getting a little light turbulence and...I'd say moderate rain.\" At 15:57:47, the controller acknowledged Flight 242's report and told the flight to contact Memphis Center. The Memphis Center controller advised the flight that a SIGMET was current for the area. He then told Flight 242 to contact Atlanta Center. At 16:03:20, Flight 242 switched to another sector of Atlanta Center, established communications on the new frequency and reported being level at FL170. As the aircraft entered an area of rain, the flight crew began discussing the weather depicted on their radar. Based on information from the airborne radar, the captain initially decided that the storms just west of the Rome VOR were too severe to penetrate. Shortly after his initial assessment of the storm system, the captain decided to penetrate the storm area near the Rome VOR. At 16:06:41 Atlanta Center cleared Flight 242 to descend to and maintain 14,000 ft. Shortly afterwards the aircraft entered an area of heavy hail or rain, which continued for at least one minute. The ingestion of intense rain and hail into the engines caused the rotational speed of both engines to decrease below the engine-driven electrical generator operating speeds, and resulted in normal electrical power interruption for 36 seconds. The flight crew likely advanced one or both thrust levers, restoring its generator to operation and provide normal electrical power. After establishing contact with Atlanta Center again, the flight was told to maintain 15,000 ft. At 16:09:15, Flight 242 reported to Atlanta Center, \"Okay...we just got our windshield busted and... we'll try to get it back up to 15, we're 14.\" After reported that the left engine had flamed out, the flight was cleared to descend to 13,000 ft. Meanwhile both engines' high-pressure compressors began to stall severely due to ingestion of massive quantities of water. The severe compressor stalls produced an overpressure surge which deflected the compressor blades forward in the sixth stage of the low-pressure compressors; these blades clashed against the fifth-stage stator vanes and broke pieces from the blades and vanes. Pieces of blades and stator vanes were then ingested into the high-pressure compressors and damaged them severely. Continued high thrust settings following the severe damage to the high-pressure compressors probably caused severe overheating in the turbine sections of both engines, and the engines ceased to function. Shortly before normal electrical power was again, the flight crew radioed that both engines had failed. Atlanta Center told the crew to contact approach control for vectors to Dobbins Air Force Base. Power was then lost for 2 min 4 sec until the APU-driven generator restored electrical power. After establishing contact with Atlanta Approach Control the flight was told they were 20 miles from Dobbins. As the flight was descending, the captain began to doubt their ability to reach Dobbins. Cartersville was closer at 15 miles, so the controller gave vectors for Cartersville. Unable to make it to Cartersville, the crew began looking for a clear field or highway for an emergency landing. At 16:18:02, Flight 242's last transmission to Approach Control was recorded: \"... we're putting it on the highway, we're down to nothing.\" The aircraft's outboard left wing section first contacted two trees near State Spur Highway 92 south-southwest of the community of New Hope. About 0.8 miles farther north-northeast, the left wing again contacted a tree alongside the highway within the community of New Hope. The left and right wings continued to strike trees and utility poles on both sides of the highway, and 570 ft after striking the first tree in New Hope, the aircraft's left main gear contacted the highway to the left of the centerline. Almost simultaneously, the outer structure of the left wing struck an embankment, and the aircraft veered to the left and off the highway. The aircraft traveled another 1,260 ft before it came to rest. As it traveled, the aircraft struck road signs, utility poles, fences, trees, shrubs, gasoline pumps at a gas station-store, five automobiles, and a truck. Of the 85 persons aboard Flight 242, 62 were killed, 21 were seriously injured, and 1 was slightly injured. Additionally, eight persons on the ground were killed. Within a month of the accident, one of the surviving passengers and one person on the ground both died of their injuries.", "probable_cause": "Total and unique loss of thrust from both engines while the aircraft was penetrating an area of severe thunderstorms. The loss of thrust was caused by the ingestion of massive amounts of water and hail which, in combination with thrust lever movement, induced severe stalling in and major damage to the engine compressors. Major contributing factors include the failure of the company's dispatching system to provide the flight crew with up-to-date severe weather information pertaining to the aircraft's intended route of flight, the captain's reliance on airborne weather radar for penetration of thunderstorm areas, and limitations in the FAA's ATC system which precluded the timely dissemination of real-time hazardous weather information to the flight crew."}