{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-27-islander-saint-peter", "date": "Sep 18, 1981 at 1842 LT", "type": "Britten-Norman Islander", "operator": "Jersey%20European%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jersey - Guernesey", "msn": "496", "yom": 1976, "flight_number": "JY245", "city": "Saint Peter-La Villiaze", "zone": "Channel Islands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5400, "captain_hours_type": 250, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2174, "circumstances": "Jersey European Airways Flight 245 departed from Jersey Airport (JER) at 17:29 hrs UTC. This was a delayed flight since the aircraft originally allocated to the service G-BESO, had developed an engine fault shortly after takeoff and had returned to Jersey. Britten-Norman Islander G-BDNP was then made available as a replacement aircraft. The prevailing weather was a westerly wind with a cloud base of around 1,500 feet, and Flight 245 was cleared on a Special VFR flight plan to Guernsey (GCI) at a height not above 1,000 feet. When about 8 miles from the Guernsey coast the aircraft, under Guernsey Approach Radar Control, was directed to turn north towards the island of Herm as a delaying manoeuvre to allow a Partenavia, G-BFSU, inbound from the north-east to approach first. Shortly after making the turn the starboard propeller of G-BDNP began to hunt - a condition where the propeller blade angle alters in order to maintain a constant propeller RPM as the engine power fluctuates. The engine did not fail completely, so the Commander decided not to feather the propeller but requested from Air Traffic Control (ATC) a more direct approach to Guernsey Airport. This was agreed by ATC who then requested the Partenavia to carry out a right hand orbit in order to allow the Islander to approach first. Following closely behind the Islander was a Twin Otter, call sign G-BIMW. This resulted in a new landing sequence of the Islander, the Otter and then the Partenavia. The Commander of the Islander meanwhile had been trying to rectify the erratic running of the starboard engine by adjusting the carburettor heat and mixture controls, and by switching 'On' the auxiliary fuel pumps, but this did not achieve any improvement. He was, however, able to maintain 600 feet until established on a long final approach to runway 27 when the port engine suddenly lost power. As the aircraft yawed to port due to the power loss the starboard engine suddenly regained power for about one second, further accentuating the yaw. Realising that he could not now continue his approach to the airport he chose a landing site in an area of fields. He then selected the engine fuel mixture controls to 'Off' in order to prevent a sudden burst of power upsetting the approach, lowered full flap and carried out an emergency landing. The pilot stated that after touching down in one field the aircraft cleared a 6 feet high stone wall and then landed in the next field. Ground marks showed that it then travelled about 190 feet before the port main plane struck and then rode over a stone wall. This broke off the port undercarriage and deflected the aircraft to the right. It then continued through a five-bar gate, crossed a road, and came to rest in the driveway of a guest house. There was no fire and the passengers and the Commander were able to leave the aircraft through the doors and emergency windows. The Commander sustained severe laceration of his legs, broken fingers, and a head injury, but was able to assist in the evacuation of the eight passengers who had received only minor injuries. One of the passengers went immediately to the guest house and made an emergency telephone call for fire and ambulance assistance.", "probable_cause": "The accident occurred because of the Commander's mismanagement of the aircraft's fuel system in that both engines failed through fuel starvation because the usable contents of the tip tanks, which were feeding the engines, became exhausted when there was ample fuel remaining in the aircraft's main tanks. Contributory factors were the Operator's procedures, inadequacies in the checklists, and the position of the fuel selector panel and switch levers in relation to the pilot's eyes."}