{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-25-dk-balearic-sea-39-killed", "date": "Sep 12, 1951 at 1228 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Société de Transports Aériens Alpes Provence - STAAP", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Toulouse – Perpignan – Oran", "msn": "15985/32733", "yom": 1945, "flight_number": null, "city": "Balearic Sea", "zone": "Balearic Islands", "country": "Spain", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 36, "pax_fatalities": 36, "other_fatalities": 0, "total_fatalities": 39, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot prepared an IFR flight plan for a direct flight from Perpignan to Oran, at an altitude of 8,000 feet, the duration to be 3 hours and 15 minutes. Algiers was listed as the alternate. At 1045LT the crew requested take-off instructions from Perpignan control tower and following engine run-up, a normal take-off was made at 1045LT.  After taking-off the aircraft was seen climbing away, somewhat off the SSE heading (this is the conventional procedure, consisting in flying round Cape Creus in order to avoid the Alberes mountains before heading for Oran. At 1056LT the aircraft made radiotelegraphy contact with Perpignan navigational D/F and reported true track: 202 degrees, good visibility, altitude: 8,000 feet and a magnetic bearing (QDR) was requested. At 1058LT the D/F station transmitted a QDR of 1620 and reported in its log strong interference caused by static. At 1131LT the aircraft contacted Aix area control centre and reported Barcelona abeam. At 1200LT the aircraft contacted Algiers area control centre and reported ETA at Oran 1415LT, altitude 8,000 feet, flying sometimes below and sometimes in clouds (QBH-QBF) and reported static interference and requested a true bearing from Algiers (QTE). Algiers replied at 1158LT QTE = 3320. At 1216LT the aircraft reported position at 1208LT hours was 40°N 25°E, ETA Oran 1410LT.  At 1226LT, the last message was received from the aircraft, bearing on Algiers 3170, altitude 8,000 feet, flying in cloud and requested clearance to descend to 6,000 feet. About two minutes later, the aircraft went out of control and crashed into sea, about 60 km north of Cap de la Nau and about 50 km northwest of the Ibiza Island. Few debris and dead bodies were found four days later. The aircraft was destroyed upon impact and sank, and all 39 occupants were killed. ", "probable_cause": "Meteorological conditions encountered on the day of the accident were in accordance with the forecast transmitted to the crew during the stopover in Perpignan. They were considered acceptable to a smart commander but were likely to be risky for a crew whose experience was considered to be low, which was the case at the present time. In the absence of evidence, investigations were unable to determine the exact cause of the accident. Nevertheless, it is believed that the accident was caused by the failure of the airframe following a loss of control in difficult weather conditions into which the pilot had flown the aircraft."}