{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-mt-seymour-2-killed", "date": "Apr 13, 2015 at 0708 LT", "type": "Swearingen SA226 Metro II", "operator": "Carson-Air1", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Vancouver – Prince George – Dawson Creek – Fort Saint John", "msn": "TC-235", "yom": 1977, "flight_number": "CA066", "city": "Mount Seymour", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2885, "captain_hours_type": 1890, "copilot_hours": 1430, "copilot_hours_type": 57, "aircraft_hours": 33244, "circumstances": "On 13 April 2015, Carson Air Ltd. flight 66 (CA66), a Swearingen SA226-TC Metro II (registration C-GSKC, serial number TC-235), departed Vancouver International Airport (CYVR), British Columbia, with 2 pilots on board for an instrument flight rules flight to Prince George, British Columbia. At 0709 Pacific Daylight Time (PDT), approximately 6 minutes after leaving Vancouver, the aircraft disappeared from air traffic control radar while climbing through an altitude of 8700 feet above sea level in instrument meteorological conditions, about 4 nautical miles north of the built-up area of North Vancouver. Deteriorating weather conditions with low cloud and heavy snowfall hampered an air search; however, aircraft wreckage was found on steep, mountainous, snow-covered terrain by ground searchers at approximately 1645 PDT. The aircraft had experienced a catastrophic in-flight breakup. Both pilots were fatally injured, and the aircraft was destroyed. Although the aircraft’s 406-megahertz emergency locator transmitter activated, the antenna was damaged and no signal was received by the Cospas-Sarsat (international satellite system for search and rescue). The accident occurred during daylight hours.", "probable_cause": "Findings as to causes and contributing factors:\r\n1. For unknown reasons, the aircraft descended in the direction of flight at high speed until it exceeded its structural limits, leading to an in-flight breakup.\r\n2. Based on the captain’s blood alcohol content, alcohol intoxication almost certainly played a role in the events leading up to the accident.\n\r\nFindings as to risk:\r\n1. If cockpit or data recordings are not available to an investigation, the identification and communication of safety deficiencies to advance transportation safety may be precluded.\r\n2. If Canadian Aviation Regulations Subpart 703 operators are not required to have a Transport Canada–approved safety management system, which is assessed on a regular basis, there is a risk that those companies will not have the necessary processes in place to manage safety effectively.\r\n3. If safety issues, such as concerns related to drug or alcohol abuse, are not reported formally through a company’s safety reporting system, there is a risk that hazards will not be managed effectively.\r\n4. Transport Canada’s Handbook for Civil Aviation Medical Examiners(TP 13312) does not address the complete range of conditions that may be affected by drug or alcohol dependence. As a result, there is an increased risk that undisclosed cases of drug or alcohol dependence in commercial aviation will go undetected, placing the travelling public at risk.\r\n5. If there is no regulated drug- and alcohol-testing requirement in place to reduce the risk of impairment of persons while engaged in safety-sensitive functions, employees may undertake these duties while impaired, posing a risk to public safety."}