{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-butler", "date": "Feb 12, 1996 at 1010 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "George R. Harrington", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Erie - Butler", "msn": "46-22033", "yom": 1989, "flight_number": null, "city": "Butler", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1550, "circumstances": "The pilot was conducting an approach to runway 8, during which the left wing contacted the ground approximately 75 feet from the approach end of the runway. The airplane came to rest about 160 feet down the runway, and off the right side. A pilot who landed on runway 26, about 30 minutes prior to the accident flight, stated that the winds were out of the northwest at 15 knots with gusts, and he experienced plus and minus 10 knots on the airspeed while on final approach. The winds 19 miles to the east, at 1045 eastern standard time, were reported from 310 degrees at 15 knots with gusts up to 20 knots. An AIRMET was issued at 0345, with an advisory for occasional moderate turbulence below 8,000 feet. The AIRMET was reissued at 0945, with the added advisory of, 'Low level wind shear potential over the Boston Area Forecast area east of an Erie-Bristol line due to gusty northwesterly surface winds. Conditions ending by 1600.' An FAA Inspector examined the wreckage and found no preimpact anomalies with the airplane. ", "probable_cause": "The pilot's inadequate compensation for wind conditions during the final approach, which resulted in the uncontrolled descent and subsequent collision with the ground. A contributing factor is windshear conditions. "}