{"url": "https://www.baaa-acro.com/crash/ground-accident-boeing-737-2t5-hoedspruit-afb", "date": "Jan 10, 2011 at 2050 LT", "type": "Boeing 737-200", "operator": "Africa-Charter-Airline", "flight_phase": "Taxiing", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hoedspruit - Johannesburg", "msn": "22396/730", "yom": 1981, "flight_number": null, "city": "Hoedspruit AFB", "zone": "Mpumalanga", "country": "South Africa", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 26512, "captain_hours_type": null, "copilot_hours": 1300, "copilot_hours_type": 1100, "aircraft_hours": 70094, "circumstances": "The aircraft was flown on a non-scheduled charter flight from O. R. Tambo International Airport to Hoedspruit military aerodrome, where it landed safely and all 97 passengers disembarked. The crew then prepared to return to O. R. Tambo International Airport with no passengers on board. Whilst taxiing to the cleared holding point for takeoff, the pilot switched off the landing lights to avoid blinding an approaching aircraft. As a result, he overshot the turning point in the darkness and found himself at the end of the taxiway with insufficient space to turn around. According to him, he decided to manoeuvre the aircraft out of the \"dead end\" by turning into the last taxiway, which led to military hangars, and then reversing the aircraft to carry out a 180° turn. This was to be done without external guidance. Whilst reversing the aircraft, the pilot failed to stop it in time, the main wheels rolled off the edge of the taxiway and the aircraft slipped down a steep embankment, coming to rest with the nose-wheel still on the taxiway. The aeroplane was substantially damaged, but no-one was injured. ", "probable_cause": "Inappropriate decision by the captain to reverse the aircraft at night without external guidance. \n"}