{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-230b-sakhaline-island-269-killed", "date": "Sep 1, 1983 at 0535 LT", "type": "Boeing 747-200", "operator": "Korean%20Air-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "New York - Anchorage - Seoul", "msn": "20559", "yom": 1972, "flight_number": "KE007", "city": "Sakhalinsk", "zone": "Sakhalin oblast", "country": "Russia", "region": "Asia", "crew_on_board": 23, "crew_fatalities": 23, "pax_on_board": 246, "pax_fatalities": 246, "other_fatalities": 0, "total_fatalities": 269, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 31 August 1983, a Korean Air Lines (KAL) Boeing 747, designated KE 007, departed John F. Kennedy International Airport, New York, United States, on a one-stop scheduled flight for Kimpo International Airport, Seoul, Republic of Korea. The en-route stop occurred at Anchorage International Airport, Alaska, United States. At Anchorage, the aircraft was refuelled and serviced for the remainder of the flight to Seoul and, in accordance with company practice, the flight and cabin crews were changed. The flight departed at the planned time of departure which, in keeping with Korean Air Lines' procedure, was calculated for each KE 007 flight. The departure from Anchorage was flexible to ensure arrival in Seoul at the scheduled arrival time of 21:00 hours* (06:00 hours local time). The actual departure time of 13:00 hours on 31 August would have resulted in an on-time arrival of KE 007 in Seoul, had the flight been completed in accordance with its flight plan. On departing Anchorage, the flight had 269 persons on board consisting of 240 passengers, 3 flight crew members, 20 cabin attendants, and 6 crew members of KAL being repositioned to Seoul. Soon after departure from Anchorage, KE 007 deviated to the right (north) of its direct track to Bethel. This deviation resulted in a progressively greater lateral displacement to the right of its planned route which, ultimately, resulted in its penetration of adjacent high seas airspace in flight information regions (FIR_s) operated by the Union of Soviet Socialist Republics (USSR), as well as of sovereign USSR airspace overlying Kamchatka Peninsula and Sakhalin Island and their surrounding territorial waters. No evidence was found during the investigation to indicate that the flight crew of KE 007 was, at any time, aware of the flight's deviation from its planned route in spite of the fact that it continued for over five hours. According to representatives of the United States, military radar installations in Alaska were not aware in real time that the aircraft was proceeding west with an increasing northerly deviation from the recognized airways system. The military radar installations of the Japanese Defence Agency were aware that an aircraft was tracking in USSR airspace over Sakhalin Island. According to representatives of Japan, they were not a\\vare that it was a civil aircraft off its intended track. Approximately between 16:40 and 17:08 hours military aircraft operated by the USSR attempted to intercept KE 007 over Kamchatka Peninsula. The interception attempts were unsuccessful. From about 18:00 hours when KE 007 was approaching Sakhalin Island, USSR, the flight was intercepted by USSR military aircraft. At 18:26:02 hours the aircraft was hit by at least one of t\\\\'o air-to-air missiles fired by the pilot of one of the USSR interceptor aircraft who had been directed, by his ground command and control units, to shoot down an aircraft which they assumed to be a United States RC-135. As a result of the attack, KE 007 collided with the sea and sank off the southwest coast of Sakhalin Island. There were no survivors. The flight recorders, fragmentary pieces of the aircraft and a small number of items of personal property were salvaged by divers from the USSR during a two month period following the accident. In addition, some flotsam from the aircraft was dispersed by tidal currents and recovered later. The cockpit voice recorder (CVR) and the digital flight data recorder (DFDR) tapes were recovered by the USSR in 1983 and were handed over to ICAO in January 1993 by the representatives of the Russian Federation. They also made available recordings and transcripts of the communications between the pilots of the intercepting fighter aircraft and their ground controllers as well as the communications between the command centres. The representatives of the United States made available certified copies and transcripts of the Anchorage ATC tapes, and the representatives of Japan made available the Tokyo ATC tape. In the course of the investigation, all practical steps were taken to confirm the authenticity of the communications tapes. A comprehensive assessment of the physical characteristics of the CVR and the DFDR tapes and the information recorded thereon was made to ensure that they contained authentic records. The material on the communications tapes and the CVR and DFDR tapes showed no evidence of contradiction with known information and correlated well with other sources of data. There was no evidence to suggest that the crew of flight KE 007 was aware that their aircraft was flying to the north of its planned route or that they knew of the presence of the intercepting fighter aircraft. The DFDR record established that flight KE 007 maintained a constant magnetic heading from soon after departure from Anchorage until the attack by the fighter aircraft. The maintenance of the constant magnetic heading was so accurate it could only have resulted from the autopilot controlling the aircraft. The CVR and the DFDR records also established that the aircraft did not sustain an extensive avionics or navigation systems failure or malfunction prior to the attack by the USSR fighter aircraft. The evidence obtained supported the first hypothesis of those listed in the 1983 ICAO report, Le. that the crew inadvertently flew virtually the entire flight on a constant magnetic heading. The maintenance of a constant magnetic heading and the resulting track deviation was due to the KE 007 crew's failure to note that the autopilot had either been left in heading mode or had been switched to INS when the aircraft was beyond the range (7.5 NM) for the INS to capture the desired track. \r\nConcerning the interception and associated identification, signalling and communications the investigation found the following: \n\r\n1) Interceptions of KE 007 were attempted by USSR military aircraft over Kamchatka Peninsula and made in the vicinity of Sakhalin Island.\n\r\n2) The USSR command centre personnel assumed that KE 007 was a United States RC-135 aircraft. KE 007's climb from FL 330 to FL350 during the time of the interception over Sakhalin Island was interpreted as being an evasive action, thus further contributing to the USSR presumption that it was an RC-135 aircraft.\n\r\n3) No attempt was made by the USSR to contact the crew of KE 007 by radio on the distress frequency 121.5 MHz or on any other VHF or HF frequency. However, the interceptor pilot was instructed by his ground control to attempt to attract the attention of the crew of the intruding aircraft by firing his aircraft's cannon and flashing its navigation lights. It was not possible to assess the distance of the interceptor aircraft from the intruder nor their relative positions when the interceptor's lights were flashed and the cannon fired.\n\r\n4) The USSR command centre personnel on Sakhalin Island were concerned with the position of the intruder aircraft in relation to USSR sovereign airspace as well as its identity. The time factor became paramount as the intruder aircraft was .about to coast out from Sakhalin Island. Therefore, exhaustive efforts to identify the intruder aircraft were not made, although apparently some doubt remained regarding its identity. .5) It was not possible to determine the position of KE 007 at the time of the missile attack in relation to USSR sovereign airspace.", "probable_cause": "1. The considerable lateral deviation of the B-747 aeroplane on Flight KAL-007 from the assigned airway R20 was a result of the crew using an air navigation method based on maintaining a constant magnetic heading immediately after take-off (three minutes after the aeroplane lifted oft) and throughout the whole of the subsequent flight. This basically contradicts the generally accepted standards and rules of air navigation, including the regulated documents of Korean Air Lines. Disregarding the need for multiple corrections of the magnetic heading, which were prescribed by the computer flight plan, as well as the resulting current information from the aeroplane's navigation systems when reaching the intermediate waypoints, cannot be explained by an insufficient professional level of crew training, inattention or even negligence, since in this case what one is talking about is the complete refusal of the crew to comply with all the rules and procedures for the performance of the flight prescribed by the airline's instructions, including those in the event of possible abnormalities in the operation of the equipment. A probable explanation for the situation which developed may be the intentional following of the route which was actually taken. The following facts attest to this:\r\n- in accordance with the ATS plan, the crew informed the Anchorage and Tokyo ATC units of their position with respect to the compulsory reporting points. However, the information did not correspond to the actual position of the aeroplane indicated by the airborne navigation systems;\n\r\n- when reporting with respect to NABIE and NEEVA, the crew did not ask the ATS units about the serviceability of the NDB and DME on St. Paul Island and that of the VOR and elements of the DME/TACAN .0n \"Shemya Island, despite the absence of signals from these radio navigation aids, since,possibly, they knew that they were out of coverage;\n\r\n- having determined their position with respect to NEEVA, the crew, according to the DFDR data, did not make any attempts to contact the Anchorage ARTCC on communications channel VHF-2,\n\r\n- the recording, of the radio exchanges (CVR) of the crew of Flight KAL-007 with the crew of Flight KAL-015, which was following it at an interval of approximately 4 minutes, indicates the complete lack of alertness on the part of the crew of KAL-007 with regard to the basic differences in wind force and direction according to the data of these two aeroplanes;\n\r\n- long before entering Japan's ATS radar area, the crew set on the SSR code selector the code 1300, which refers to the phase of exit from this area prior to entry into the Korean area TAEGU, instead of the prescribed code 2000. The flight path of Flight KAL-007, obtained on the basis of the results of modelling taking into account the data from the radar tracking stations of the United States, the USSR and Japan, essentially coincides over a considerable extent (Anchorage-abeam NIPPI) with a great circle flight path Anchorage - FIR Seoul (the deviations do not exceed ± 15 NM. This is determined by the accuracy of the calculations made). If one assumes that a route along the great circle VOR Anchorage - FIR Seoul was programmed on one of the three INS and that the flight was performed according to this programme, then in this case the crew's actions can be logically explained. However, the investigation materials do not 'contain exhaustive evidence confirming this assumption. Thus, the Commission could not determine the reasons which prompted the crew to decide to follow from Anchorage to Seoul the route which was actually taken and which was close to the great circle.\n\r\n2. The actions of the USSR Air Defence Forces on the territory of Kamchatka Peninsula and Sakhalin Island were based on the conviction that 'a military intruder aeroplane had entered USSR airspace. The absence of civil aircraft, according to the reports of the USSR ATC units, in the airspace monitored by them and the impossibility of visual recognition of the intruder aeroplane type as a civil aircraft under night flying conditions confirmed the certainty of its military affiliation. Given these circumstances, the rules of interception for civil aircraft, recommended by ICAO and established in the USSR AlP, were not applied by the USSR Air Defence Forces. The USSR Air Defence units were guided by the rules regulating the actions of the Air Defence Forces in the event of violation of the USSR State border by military aeroplanes. This led to the stopping of the flight at 1826 hours. As was shown by an analysis of the objective information on the actions of the Air Defence units in intercepting the intruder aeroplane, all available measures were taken to identify and determine the type and State affiliation of this aeroplane. Further evidence of this is the fact that the flight was stopped not when it flew over Kamchatka Peninsula and not when it again violated the USSR State border in the area of Sakhalin Island, but immediately before the intruder aeroplane exited USSR airspace."}