{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-i-mt-kahiltna-5-killed", "date": "Aug 4, 2018 at 1753 LT", "type": "De Havilland DHC-2 Beaver", "operator": "K2%20Aviation", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Talkeetna - Talkeetna", "msn": "1022", "yom": 1957, "flight_number": null, "city": "Mt Kahiltna", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 2550, "captain_hours_type": 346, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15495, "circumstances": "The commercial pilot was conducting a 1-hour commercial air tour flight over Denali National Park and Preserve with four passengers on board. About 48 minutes after departure, the Alaska Rescue Coordination Center received an alert from the airplane's emergency locator transmitter. About 7 minutes later, company personnel received a call from the pilot, who reported that the airplane had run \"into the side of a mountain.\" Although a search was initiated almost immediately, due to poor weather conditions in the area, the wreckage was not located until almost 36 hours later in a crevasse on a glacier about 10,920 ft mean sea level. Due to the unique challenges posed by the steepness of terrain, the crevasse, avalanche hazard, and the condition of the airplane, neither the occupants nor the wreckage were recovered from the accident site. A weather model sounding for the area of the accident site estimated broken cloud bases at 700 ft above ground level (agl) with overcast clouds at 1,000 ft agl and cloud tops to 21,000 ft agl and higher clouds above. The freezing level was at 9,866 ft and supported light-to-moderate rime type icing in  clouds and precipitation. The on-scene assessment indicated that the right wing impacted snow while the airplane was flying in a wings-level attitude; the right wing had separated from the remainder of the wreckage. Based upon available weather data and forecast models and the impact evidence, it is likely that the pilot entered an area of reduced visibility and was unable to see the terrain before the airplane's right wing impacted the snow. The company's organizational structure was such that one group of management personnel oversaw operations in both Anchorage and Talkeetna. Interviews with company management revealed that they were not always aware of the exact routing a pilot would take for a tour; the route was pilot's discretion based upon the weather at the time of the flight to provide the best tour experience. Regarding risk mitigation, the company did not utilize a formal risk assessment process, but rather relied on conversations between pilots and flight followers. This could lead to an oversight of actual risk associated with a particular flight route and weather conditions. About 8 months after the accident, an assessment flight conducted by the National Park Service determined that during the winter, the hazardous hanging glacier at the accident site calved, releasing an estimated 4,000 to 6,000 tons of ice and debris. There was no evidence of the airplane wreckage near the crash site, in the steep fall line, or on the glacier surface over 3,600 ft below. Although the known circumstances of the accident are consistent with a controlled flight into terrain event, the factual information available was limited because the wreckage was not recovered and no autopsy or toxicology of the pilot could be performed; therefore, whether other circumstances may have contributed to the accident could not be determined.", "probable_cause": "Impact with terrain for reasons that could not be determined because the airplane was not recovered due to the inaccessible nature of the accident site.\n"}