{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-82-madrid-154-killed", "date": "Aug 20, 2008 at 1424 LT", "type": "McDonnell Douglas MD-82", "operator": "Spanair.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Madrid - Las Palmas", "msn": "53148/2072", "yom": 1993, "flight_number": "JKK5022", "city": "Madrid-Barajas", "zone": "Madrid", "country": "Spain", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 166, "pax_fatalities": 148, "other_fatalities": 0, "total_fatalities": 154, "captain_hours": 8476, "captain_hours_type": 5776, "copilot_hours": 1276, "copilot_hours_type": 1054, "aircraft_hours": 31963, "circumstances": "An MD-82 passenger plane, registered EC-HFP, was destroyed when it crashed on takeoff at Madrid-Barajas Airport (MAD), Spain. Of the aircraft’s occupants, 154 were killed, including all six crew members. Eighteen passengers were seriously injured. The MD-82 aircraft operated Spanair flight JK5022 from Madrid-Barajas (MAD) to Gran Canaria (LPA). The estimated departure time was 13:00. The aircraft was authorized by control for engine start-up at 13:06:15. It then taxied to runway 36L from parking stand T21, which it occupied on the apron of terminal T2 at Barajas. The flaps were extended 11°. Once at the runway threshold, the aircraft was cleared for takeoff at 13:24:57. The crew informed the control tower at 13:26:27 that they had a problem and that they had to exit the runway. At 13:33:12, they communicated that they were returning to the stand. The crew had detected an overheating Ram Air Temperature (RAT) probe. The aircraft returned to the apron, parking on remote stand R11 of the terminal T2 parking area. The crew stopped the engines and requested assistance from maintenance technicians to solve the problem. The mechanic confirmed the malfunction described in the ATLB, checked the RAT probe heating section of the Minimum Equipment List (MEL) and opened the electrical circuit breaker that connected the heating element. Once complete, it was proposed and accepted that the aircraft be dispatched. The aircraft was topped off with 1080 liters of kerosene and at 14:08:01 it was cleared for engine start-up and to taxi to runway 36L for takeoff. The crew continued with the tasks to prepare the airplane for the flight. The conversations on the cockpit voice recorder revealed certain expressions corresponding to the before engine start checklists, the normal start list, the after start checklist and the taxi checklist. During the taxi run, the aircraft was in contact with the south sector ground control first and then with the central sector. On the final taxi segment the crew concluded its checks with the takeoff imminent checklist. At 14:23:14, with the aircraft situated at the head of runway 36L, it was cleared for takeoff. Along with the clearance, the control tower informed the aircraft that the wind was from 210° at 5 knots. At 14:23:19, the crew released the brakes for takeoff. Engine power had been increased a few seconds earlier and at 14:23:28 its value was 1.4 EPR. Power continued to increase to a maximum value of 1.95 EPR during the aircraft’s ground run. The CVR recording shows the crew calling out \"V1\" at 14:24:06, at which time the DFDR recorded a value of 147 knots for calibrated airspeed (CAS), and \"rotate\" at 14:24:08, at a recorded CAS of 154 knots. The DFDR recorded the signal change from ground mode to air mode from the nose gear strut ground sensor. The stall warning stick shaker was activated at 14:24:14 and on three occasions the stall horn and synthetic voice sounded in the cockpit: \"[horn] stall, [horn] stall, [horn] stall\". Impact with the ground took place at 14:24:23. During the entire takeoff run until the end of the CVR recording, no noises were recorded involving the takeoff warning system (TOWS) advising of an inadequate takeoff configuration. During the entire period from engine start-up while at parking stand R11 to the end of the DFDR recording, the values for the two flap position sensors situated on the wings were 0°. The length of the takeoff run was approximately 1950 m. Once airborne, the aircraft rose to an altitude of 40 feet above the ground before it descended and impacted the ground. During its trajectory in the air, the aircraft took on a slight left roll attitude, followed by a fast 20° roll to the right, another slight roll to the left and another abrupt roll to the right of 32°. The maximum pitch angle recorded during this process was 18°. The aircraft’s tail cone was the first part to impact the ground, almost simultaneously with the right wing tip and the right engine cowlings. The marks from these impacts were found on the right side of the runway strip as seen from the direction of the takeoff, at a distance of 60 m, measured perpendicular to the runway centerline, and 3207.5 m away from the threshold, measured in the direction of the runway. The aircraft then traveled across the ground an additional 448 m until it reached the side of the runway strip, tracing out an almost linear path at a 16° angle with the runway. It lost contact with the ground after reaching an embankment/drop-off beyond the strip, with the marks resuming 150 m away, on the airport perimeter road, whose elevation is 5.50 m lower than the runway strip. The aircraft continued moving along this irregular terrain until it reached the bed of the Vega stream, by which point the main structure was already in an advanced state of disintegration. It is here that it caught on fire. The distance from the initial impact site on the ground to the farthest point where the wreckage was found was 1093 m.", "probable_cause": "The crew lost control of the airplane as a consequence of entering a stall immediately after takeoff due to an improper airplane configuration involving the non-deployment of the slats/flaps following a series of mistakes and omissions, along with the absence of the improper takeoff configuration warning.\r\nThe crew did not identify the stall warnings and did not correct said situation after takeoff. They momentarily retarded the engine throttles, increased the pitch angle and did not correct the bank angle, leading to a deterioration of the stall condition.\r\nThe crew did not detect the configuration error because they did not properly use the checklists, which contain items to select and verify the position of the flaps/slats, when preparing the flight. Specifically:\r\n- They did not carry out the action to select the flaps/slats with the associated control lever (in the \"After Start\" checklist);\r\n- They did not cross check the position of the lever or the status of the flap and slat indicating lights when executing the\" After Start\" checklist;\r\n- They omitted the check of the flaps and slats during the \"Takeoff briefing\" item on the \"Taxi\" checklist;\r\n- The visual check done when executing the \"Final items\" on the \"Takeoff imminent\" checklist was not a real check of the position of the flaps and slats, as displayed on the instruments in the cockpit.\r\nThe CIAIAC has identified the following contributing factors:\r\n- The absence of an improper takeoff configuration warning resulting from the failure of the TOWS to operate, which thus did not warn the crew that the airplane's takeoff configuration was not appropriate. The reason for the failure of the TOWS to function could not be reliably established.\r\n- Improper crew resource management (CRM), which did not prevent the deviation from procedures in the presence of unscheduled interruptions to flight preparations."}