{"url": "https://www.baaa-acro.com/crash/crash-grumman-s-2e-tracker-hopland-1-killed", "date": "Aug 27, 2001 at 1840 LT", "type": "Grumman S-2 Tracker", "operator": "CDF%20Aviation-2_1", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Mountains", "schedule": "Ukiah - Ukiah", "msn": "421", "yom": 1954, "flight_number": "Tanker 87", "city": "Hopland", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4639, "captain_hours_type": 1294, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10354, "circumstances": "During an aerial fire suppression mission for the California Department of Forestry (CDF), two Grumman TS-2A airplanes, operating as Tanker 92 (N442DF) and Tanker 87 (N450DF), collided in flight while in a holding pattern awaiting a retardant drop assignment on the fire. All of the airplanes fighting the fire were TS-2A's, painted in identical paint schemes. The Air Tactical Group Supervisor (AirTac) was orbiting clockwise 1,000 feet above the tankers, who were in a counterclockwise orbit at 3,000 feet mean sea level (msl). The pilots of both aircraft involved in the collision had previously made several drops on the fire. Records from the Air Tac show that Tankers 86, 91, and 92 were in orbit, and investigation found that Tanker 87 was inbound to enter the orbit after reloading at a nearby airport base. AirTac would write down the tanker numbers as they made their 3-minutes-out call, and usually ordered their drops in the same order as their check-in. The AirTac's log recorded the sequence 86, 91, 21, and 92. The log did not contain an entry for Tanker 87. Other pilots on frequency did not recall hearing Tanker 87 check in. Based on clock codes with 12-o'clock being north, the tankers were in the following approximate positions of the orbit when the collision occurred. Tanker 92 was at the 2-o'clock position; Tanker 86 was turning in at the 5-o'clock position; and Tanker 91 was in the 7-o'clock position. The AirTac's log indicated that Tanker 92 was going to move up in sequence and follow Tanker 86 in order to drop immediately after him. Post accident examination determined that Tanker 92's flaps were down, indicating that the pilot had configured the airplane for a drop. Tanker 92 swung out of the orbit wide (in an area where ground witnesses had not seen tankers all day) to move behind Tanker 86, and the pilot would likely have been focusing on Tanker 86 out of his left side window. Tanker 87 was on line direct to the center of the fire on a path that witnesses had not observed tankers use that day. Reconstruction of the positions of the airplanes disclosed that Tankers 86 and 91 would have been directly in front of Tanker 87, and Tanker 92 would have been wide to his left. Ground witnesses said that Tanker 87 had cleared a ridgeline just prior to the collision, and this ridgeline could have masked both collision aircraft from the visual perspective of the respective pilots. The right propeller, engine, and cockpit of Tanker 92 contacted and separated the empennage of Tanker 87. The propeller chop was about 47 degrees counterclockwise to the longitudinal axis of Tanker 87 as viewed from the top. The collision appeared to have occurred about 2,500 feet, which was below orbit altitude. CDF had no standard operating manual, no  established reporting or entry point for the holding orbits, and a tanker could enter any point of the orbit from any direction. While no standardized procedures were encoded in an operating manual, a CDF training syllabus noted that a tanker was not to enter an orbit until establishing positive radio contact with the AirTac. The entering tanker would approach 1,000 feet below AirTac's altitude and stay in a left orbit that was similar to a salad bowl, high and wide enough to see and clear all other tankers until locating the tanker that it was to follow, then adjust speed and altitude to fall in behind the preceding airplane.", "probable_cause": "The failure of both pilots to maintain an adequate visual lookout. The failure of the pilot in Tanker 87 to comply with suggested procedures regarding positive radio contact and orbit entry was a factor."}