{"url": "https://www.baaa-acro.com/crash/crash-cessna-525-citationjet-cj1-aruana", "date": "Jun 13, 2014 at 0747 LT", "type": "Cessna 525 CitationJet CJ1", "operator": "Planalto", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Goiânia – Aruanã", "msn": "525-0548", "yom": 2005, "flight_number": null, "city": "Aruanã", "zone": "Goiás", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17000, "captain_hours_type": 38, "copilot_hours": 1078, "copilot_hours_type": 4, "aircraft_hours": 3517, "circumstances": "The aircraft departed Goiânia on a flight to Aruanã, carrying two pilots and five passengers who should take part to the funeral of former football player Fernandão who died in an helicopter crash.  Following an uneventful flight, the crew completed the landing on runway 24 which is 1,280 metres long. After touchdown, the aircraft was unable to stop within the remaining distance and overran. While contacting soft ground, the nose gear collapsed then the aircraft collided with a concrete fence and came to a halt 150 metres further against a second fence. All seven occupants were injured, the captain seriously. The aircraft was damaged beyond repair. ", "probable_cause": "The following findings were identified:\r\n- The copilot was not certified in the C525 type aircraft,\r\n- The aircraft was above the maximum landing weight limit, but within the balance limit,\r\n- On 13JUN2014, there was a NOTAM in force, informing the prohibition of jet aircraft operation in SWNH, \r\n- The pilot acted incorrectly on the handle of the auxiliary gear control, thinking that he was applying the emergency brake, making the braking of the aircraft impossible.\r\n- The activation of the incorrect lever for the emergency braking of the aircraft was due to insufficient training received by the pilot for the use of the system in question, thus compromising the proper management of the abnormal condition.\r\n- The emergency brake actuator handle of the aircraft was located outside the pilot's sight field, which, together with the lack of knowledge about the correct lever to be activated for emergency braking, favored the pilot's automatic response in triggering the lever that was most adjusted and visually available on the panel - the emergency landing gear drive lever.\r\n- The instruction that the pilot received to operate the Cessna aircraft, model 525 did not emphasize in the theoretical phase the proper use of the emergency brake, nor contemplated training for the use of this system.\r\n- Despite having a lot of experience in aviation, the pilot was little experienced in the aircraft and still did not know basic functionalities like the use of the emergency brake and the engine shutdown through the evacuation checklist procedure.\n"}