{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-228f-new-york", "date": "Aug 31, 1998 at 2235 LT", "type": "Boeing 727-200", "operator": "DHL", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York - Covington", "msn": "19861", "yom": 1969, "flight_number": "DHL1165", "city": "New York-JFK", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16000, "captain_hours_type": 5000, "copilot_hours": 6000, "copilot_hours_type": 1200, "aircraft_hours": 50861, "circumstances": "Shortly after takeoff, the No. 2 engine failed and shutdown procedures for the No. 2 engine were accomplished. The flight crew declared an emergency and requested to return to the airport. On approach, an engine out go-around was required as ATC had instructed the flight crew of a B-747 to \"position and hold\" on the end of the runway. The first officer was the pilot flying. Following an uneventful touchdown, as the airplane slowed to about 80 knots, the captain took control of the airplane. Shortly thereafter, the right main landing gear (MLG) collapsed and the airplane slid to a stop on the runway. Examination of the No. 2 engine revealed that 80 percent of the main fuel pump main drive shaft was worn to the spline root. The examination also revealed that the grease used to lubricate the main drive shaft output splines was not the authorized grease specified per OHM 73-11-1 or MIL-G-81322. Additionally, the magnetic seal compression O-ring that rides on the drive gear journal outer diameter was hardened and exhibited inner diameter axial cracks. The component manufacturer indicated that the failure of the magnetic seal was the first such reported incident in 30 years; however, it agreed to review operational data from airlines to reevaluate the mean time between overhaul intervals for the seal and to recommend an inspection interval, as necessary. Examination of the right MLG revealed a fracture failure of the trunnion bearing support fitting that was caused by fatigue cracking and stress corrosion cracking. ", "probable_cause": "The failure of the right main landing gear caused by fatigue cracking and stress corrosion cracking of the trunnion bearing support fitting."}