{"url": "https://www.baaa-acro.com/crash/crash-grumman-us-2c-tracker-reno-3-killed", "date": "Apr 17, 2000 at 1035 LT", "type": "Grumman S-2 Tracker", "operator": "DRI", "flight_phase": "Takeoff (climb)", "flight_type": "Meteorological / Weather", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Reno - Reno", "msn": "27", "yom": 1957, "flight_number": null, "city": "Reno-Stead", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 8170, "captain_hours_type": null, "copilot_hours": 3700, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During the takeoff climb, the airplane turned sharply right, went into a steep bank and collided with terrain. The airplane began a right turn immediately after departure and appeared to be going slow. A witness was able to distinguish the individual propeller blades on the right engine, while the left engine propeller blades were indistinguishable. The airplane stopped turning and flew for an estimated 1/4-mile at an altitude of 100 feet. The airplane then continued the right turn at a steep bank angle before disappearing from sight. Then the witness observed a plume of smoke. White and gray matter, along with two ferrous slivers, contaminated the chip detector on the right engine. The airplane had a rudder assist system installed. The rudder assist provided additional directional control in the event of a loss of power on either engine. The NATOPS manual specified that the rudder assist switch should be in the ON position for takeoff, landing, and in the event of single-engine operation. The rudder boost switch was in the off position, and the rudder boost actuator in the empennage was in the retracted (off) position. The owner had experienced a problem with the flight controls the previous year and did not fly with the rudder assist ON. The accident flight had the lowest acceleration rate, and attained the lowest maximum speed, compared to GPS data from the seven previous flights. It was traveling nearly 20 knots slower, about 100 knots, than the bulk of the other flights when it attempted to lift off. The airplane was between the 2,000- and 3,000-foot runway markers (less than halfway down the runway) when it lifted off and began the right turn. Due to the extensive disintegration of the airplane in the impact sequence, the seating positions for the three occupants could not be determined. One of the occupants was the aircraft owner, who held a private certificate with a single-engine land rating, was known to have previously flown the airplane on contract flights from both the left and right seats. A second pilot was the normal copilot for all previous contract flights; his certificates had been revoked by the FAA. The third occupant held an airline transport pilot certificate and had never flown in the airplane before. Prior to the accident flight, the owner had told an associate that the third occupant was going to fly the airplane on the accident flight.", "probable_cause": "The flying pilot's failure to maintain directional control following a loss of engine power. Also causal was the failure of the flight crew to follow the published checklist and use the rudder assist system, and the decision not to abort the takeoff."}