{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-reading-1-killed", "date": "Sep 5, 2001 at 1313 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Panda Air", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Reading – Montgomery", "msn": "31-8152141", "yom": 1981, "flight_number": null, "city": "Reading", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3230, "captain_hours_type": 20, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6204, "circumstances": "After takeoff, the pilot reported \"an engine problem,\" but did not elaborate. A witness on the ground saw that the left engine was trailing smoke, but the engine was still operating, and did not sound like it was \"missing\". When asked by the tower controller if he required assistance, the pilot answered \"no\". The controller cleared the pilot for left traffic to a landing, and provided the current weather. There were no further transmissions from the pilot. Smoothed radar tracking data revealed that the airplane turned toward a left downwind, and leveled off at 1,400 feet msl (about 1,050 feet agl) and 156 knots. During the next 14 seconds, the airplane descended to 1,100 feet and increased airspeed to 173 knots. Then radar contact was lost. Witnesses observed the airplane variously in a right snap roll and a left wingover, followed by a sharp dive to the ground. The airplane had just undergone maintenance. During maintenance, unused oil was found in the left engine cowling, which the pilot admitted he had previously spilled. Following maintenance, the pilot was observed adding 3 additional quarts of oil to the left engine. The engine oil dipsticks were calibrated on both sides, with each side pertaining to the oil level in a specific engine. The side for the right engine was calibrated to read 1 3/4 quarts lower than the left engine. The airplane's wreckage was fragmented. No evidence of mechanical defect was found, nor was there any evidence of an extreme out-of-trim condition. There was also no evidence of engine failure, detonation, or pre-impact failure. The pilot held an airline transport pilot certificate. He reported 3,210 hours of flight time to the operator, and had recently been cleared to fly the airplane on 14 CFR Part 91 flights. The flight to the maintenance facility was the pilot's first solo flight in the airplane. An autopsy of the pilot revealed the presence of a prostate adenocarcinoma; however, according to his physician, the pilot was unaware of it.", "probable_cause": "The pilot's loss of control for undetermined reasons, which resulted in a high speed dive to the ground."}