{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3d-paraparaumu-3-killed", "date": "May 22, 1954 at 0923 LT", "type": "Douglas DC-3", "operator": "NZNA", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Christchurch - Paraparaumu", "msn": "15948/32696", "yom": 1945, "flight_number": "NZA152", "city": "Paraparaumu-Kapiti Coast", "zone": "Greater Wellington Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 25, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12732, "circumstances": "On final approach to Paraparaumu Airport, both engines failed simultaneously. Then captain was able to restart the engine but the aircraft lost speed and height. While trying to climb, the aircraft banked right and hit a house, shearing off 12 feet of the right wing. The airplane passed between two houses and eventually crashed in a wooded area. The aircraft was destroyed, three children were killed and all other occupants were injured, some of them seriously. ", "probable_cause": "- Either throughout the flight or a substantial portion of it both engines were drawing fuel from the starboard main tank,\r\n- The selector valves or valve were moved after the engines cut out, and the valves, when found and checked later, indicated a final setting of each engine to its respective port and starboard main tank,\r\n- The total fuel usage recorded for sixty hours of service by the engines of this aircraft prior to this flight establish that the fuel was used normally by each engine from each tank and there was no malfunctioning of the selector equipment,\r\n- The failure of the engines of this aircraft was due to exhaustion of fuel in the starboard main tank, to which both engines had been selected,\r\n- Having regard to the position and condition of the aircraft at the time of engine failure the subsequent accident to the aircraft was inevitable. "}