{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-gods-lake-narrows", "date": "Nov 22, 2008 at 2140 LT", "type": "Beechcraft 100 King Air", "operator": "Skynorth%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Gods Lake Narrows – Thompson", "msn": "B-227", "yom": 1976, "flight_number": "SNA683", "city": "Gods Lake Narrows", "zone": "Manitoba", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3200, "captain_hours_type": 1850, "copilot_hours": 1000, "copilot_hours_type": 500, "aircraft_hours": null, "circumstances": "The Sky North Air Ltd. Beechcraft A100 (registration C-FSNA, serial number B-227) operating as SN683 departed Runway 32 at Gods Lake Narrows, Manitoba, for Thompson, Manitoba with two pilots, a flight nurse, and two patients on board. Shortly after takeoff, while in a climbing left turn, smoke and then fire emanated from the pedestal area in the cockpit. The crew continued the turn, intending to return to Runway 14 at Gods Lake Narrows. The aircraft contacted trees and came to rest in a wooded area about one-half nautical mile northwest of the airport. The accident occurred at 2140 central standard time. All five persons onboard evacuated the aircraft; two received minor injuries. At approximately 0250, the accident site was located and the occupants were evacuated. The aircraft was destroyed by impact forces and a post-crash fire. The emergency locator transmitter was consumed by the fire and whether or not it transmitted a signal is unknown.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. An electrical short circuit in the cockpit pedestal area produced flames and smoke, which induced the crew to take emergency action.\r\n2. The detrimental effects of aging on the wires involved may have been a factor in this electrical arc event.\r\n3. The crew elected to return to the airport at low level in an environment with inadequate visual references. As a result, control of the aircraft was lost at an altitude from which a recovery was not possible.\r\nFindings as to Risk:\r\n1. The actions specified in the standard operating procedures (SOP) do not include procedures for an electrical fire encountered at low altitude at night, which could lead to a loss of control.\r\n2. Visual inspection procedures in accordance with normal phase inspection requirements may be inadequate to detect defects progressing within wiring bundles, increasing the risk of electrical fires.\r\n3. In the event of an in-flight cockpit pedestal fire, the first officer does not have ready access to available fire extinguishers, reducing the likelihood of successfully fighting a fire of this nature.\r\n4. Sealed in plastic containers and stored behind each pilot seat, the oxygen masks and goggles are time consuming to access and cumbersome to apply and activate. This could increase the probability of injury or incapacitation through extended exposure to smoke or fumes, or could deter crews from using them, especially during periods of high cockpit workload.\r\nOther Finding:\r\n1. A failure of the hot-mic recording function of the cockpit voice recorder (CVR) had gone undetected and information that would have been helpful to the investigation was not available. "}