{"url": "https://www.baaa-acro.com/crash/crash-cessna-421a-golden-eagle-i-helena-3-killed", "date": "Feb 3, 1988 at 2000 LT", "type": "Cessna 421A Golden Eagle I", "operator": "Minuteman Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Missoula - Helena", "msn": "421A-0002", "yom": 1967, "flight_number": null, "city": "Helena", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4900, "captain_hours_type": 119, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4758, "circumstances": "This accident occurred during a night, ILS approach to runway 27 in IMC. The aircraft collided with a mountain 12 nm east-southeast of the airport while turning inbound to intercept the localizer course. Investigation revealed that one VOR receiver was set on the destination ILS frequency, the second VOR was set on an en route VOR 51 nm west of the destination airport, and the DME radio, a separate transceiver, was set on the destination DME transmitter. The frequencies of the en route VOR and the destination VOR were 117.1 and 117.7, respectively. The outbound course for the ILS approach procedure was 088° and the accident site was located on the 088 radial of the en route VOR. Investigation also revealed that the pic was occupying the right front seat and an experienced pilot who was not current in this aircraft was occupying the left seat. The second VOR receiver control head was located in the lower right portion of the instrument panel, in a location where the selected frequency was difficult to read. All three occupants were killed. ", "probable_cause": "Occurrence #1: in flight collision with terrain/water\r\nPhase of operation: approach - iaf to faf/outer marker (ifr)\r\nFindings\r\n1. Terrain condition - mountainous/hilly\r\n2. (f) light condition - dark night\r\n3. (c) ifr procedure - improper - pilot in command\r\n4. (c) navigation receiver - improper use of - pilot in command"}