{"url": "https://www.baaa-acro.com/crash/crash-rockwell-690b-turbo-commander-new-haven-4-killed", "date": "Aug 9, 2013 at 1121 LT", "type": "Rockwell Grand Commander 690", "operator": "Ellumax Leasing", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Teterboro - New Haven", "msn": "11469", "yom": 1978, "flight_number": null, "city": "New Haven", "zone": "Connecticut", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 2, "total_fatalities": 4, "captain_hours": 2067, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8827, "circumstances": "The pilot was attempting a circling approach with a strong gusty tailwind. Radar data and an air traffic controller confirmed that the airplane was circling at or below the minimum descent altitude of 720 feet (708 feet above ground level [agl]) while flying in and out of an overcast ceiling that was varying between 600 feet and 1,100 feet agl. The airplane was flying at 100 knots and was close to the runway threshold on the left downwind leg of the airport traffic pattern, which would have required a 180-degree turn with a 45-degree or greater bank to align with the runway. Assuming a consistent bank of 45 degrees, and a stall speed of 88 to 94 knots, the airplane would have been near stall during that bank. If the bank was increased due to the tailwind, the stall speed would have increased above 100 knots. Additionally, witnesses saw the airplane descend out of the clouds in a nose-down attitude. Thus, it was likely the pilot encountered an aerodynamic stall as he was banking sharply, while flying in and out of clouds, trying to align the airplane with the runway. Toxicological testing revealed the presence of zolpidem, which is a sleep aid marketed under the brand name Ambien; however, the levels were well below the therapeutic range and consistent with the pilot taking the medication the evening before the accident. Therefore, the pilot was not impaired due to the zolpidem. Examination of the wreckage did not reveal any preimpact mechanical malfunctions. ", "probable_cause": "The pilot's failure to maintain airspeed while banking aggressively in and out of clouds for landing in gusty tailwind conditions, which resulted in an aerodynamic stall and uncontrolled descent."}