{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-leo-creek-3-killed", "date": "Nov 26, 1979", "type": "De Havilland DHC-3 Otter", "operator": "Smithers Air Service", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Leo Creek - Smithers", "msn": "229", "yom": 1957, "flight_number": null, "city": "Leo Creek", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Otter had been chartered to carry three passengers and a stove to a remote hunting and fishing lodge. On the return flight to Smithers, the environment conscious passengers elected to take their empty beer bottles with them, all 250 to 300 cases. One passenger was in the cockpit, the other two occupied the first row of seats and the rest of the aircraft was filled with empty beer bottles. Immediately after liftoff, the aircraft pitched to a steep nose-high attitude which the pilot was unable to prevent or correct. It then stalled and fell to the ground. A severe fuel-fed fire erupted on impact and gutted the aircraft. The pilot was thrown clear but the three passengers died in the fire. The pilot of the Otter was Emil Mesich, who was the owner of Smithers Air Service. The crash caused the company to cease trading and go into receivership. Pilot Mesich was then employed by Central Mountain Air Services Ltd., also based at Smithers. He was the pilot of Otter C-FDJA (459) of Central Mountain Air Services when it crashed near Smithers on 18th September 1982 and was sadly killed in that crash.\r\nSource: Karl E. Hayes", "probable_cause": "It was determined that there were no less than 4,773 bottles on board. A weight and balance calculation on this discovery indicated that the gross weight of the Otter was 637 pounds over the maximum, with the CofG 11,5 inches aft of the rear limit. Calculations made by DHC showed that an Otter will run out of elevator control with the CofG four inches aft of the rear limit. The pilot had estimated that a dozen bottles weighed 3 to 4 pounds when the true weight was 7 pounds."}