{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-50a-do-near-michigan-city-2-killed", "date": "Dec 28, 1946 at 0919 LT", "type": "Douglas C-50 (DC-3)", "operator": "American-Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Buffalo – Detroit – Chicago", "msn": "4805", "yom": 1941, "flight_number": "AA2207", "city": "Michigan City", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 18, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3559, "captain_hours_type": 3550, "copilot_hours": 2000, "copilot_hours_type": 1000, "aircraft_hours": 11920, "circumstances": "This flight originated at Buffalo and proceeded uneventfully to a scheduled stop at Detroit, Michigan. Departure from Detroit was at 0748, about six minutes behind schedule, with eighteen passengers, 550 gallons of fuel and on an instrument flight plan to cruise at 2,500 feet sea level. Routine position reports were made at 0800, 0807 and 0822. At 0840 the flight was instructed by Air Route Traffic Control at Chicago to climb to 4,000 feet sea level which it did immediately. At 0859 Chicago Air Route Traffic Control cleared the flight from South Bend, Indiana, to the Chicago Tower to maintain 4,000 feet sea level until ten minutes after passing South Bend. At 0902 the flight reported passing South Bend. There were no further radio contacts with the flight until 0918 when it transmitted, \"Both engines going bad descending at 1,000 feet per minute looking for opening.\" This was followed almost immediately by, \"Altitude is at present 900 feet.\" Chicago immediately replied, \"Suggest proceed to South Bend immediately if able.\" This was not acknowledged. The plane crashed at or about that time in the northeastern part of Michigan City at a point approximately two miles from Lake Michigan. The direction of Initial impact was just south of east or about opposite the course from Detroit to Chicago.", "probable_cause": "The probable cause of this accident was the accumulation of carburetor ice following the loss of power in both engines as a result of fuel starvation. The reason for fuel starvation has not been determined."}