{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-680e-king-island", "date": "Jul 14, 1988 at 2017 LT", "type": "Rockwell Grand Commander 680", "operator": "Andrew Harris", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Melbourne – King Island", "msn": "680-0855-76", "yom": 1959, "flight_number": null, "city": "King Island-Currie", "zone": "Tasmania", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The King Island aerodrome weather was forecast to include temporary periods of moderate to heavy rain showers, six eighths of cloud cover base 800 feet and visibility reduced to 3000 metres. The forecast surface wind was 340 degrees at 20-30 knots. The pilot's qualifications required a minimum visibility of 5000 metres for operation at night in Visual Meteorological Conditions, (NGT VMC). It was planned that another pilot, qualified for Instrument Flight Rules (IFR) operations, would act as pilot in command, but he became unavailable. The flight plan submitted by the pilot indicated he would be operating under the IFR category and when queried on taxiing he confirmed that this was so. Shortly after DEPARTURE, the pilot requested a weather report from an IFR pilot who had just landed at King Island. This gave a cloud base of 2000 feet, heavy rain showers and visibility of 2000 metres. Flares had been laid to allow the other pilot to use Runway 35 because of the strong northerly wind. The pilot of VH-CAY activated the electric lighting for Runway 28. He reported that the weather was satisfactory enroute and he could see lights ahead on the island. On crossing the coast flight conditions became rough in moderate to severe turbulence. The pilot advised he arrived over the aerodrome at 1500 feet above mean sea level and observed the lighted wind sock was horizontal, with the direction fluctuating rapidly between north and west. He turned to the south and broadcast his intention to land on Runway 28. Neither the pilot nor the passenger had any further recall of the events leading to the accident. VH-CAY was heard passing over the aerodrome and the engine sound was very loud, suggesting to the listener that the aircraft was low. It had been raining continuously for more than an hour, sometimes very heavily, and it was still raining at the time. The aircraft was subsequently seen flying at a very low height some six kilometres south of the aerodrome, tracking approximately north. It was raining very heavily in that area and the wind was very strong. Soon afterwards there was a sound of impact and a flash of light. The aircraft had struck the tops of trees 30 feet high, then descended to the ground. After the aircraft came to rest it was destroyed by a fire. Both occupants were seriously injured. ", "probable_cause": "Examination of the wreckage was severely hampered by the extreme fire damage sustained, but no evidence was found of any defects that might have contributed to the accident. The aircraft had evidently been under control at the time it collided with the trees. A post analysis of the conditions by the Bureau of Meteorology indicated the possible presence of strong up and down drafts, horizontal wind shear, turbulence, and estimated visibility as 2-3000 metres in rain. The evidence suggested that the pilot may have been lower than he believed as the aircraft overflew the\r\naerodrome. Having passed overhead, there there would have been few external visual references under the existing conditions to alert him that the aircraft was inadvertently being descended into the ground.\r\nSignificant Factors:\r\nThe following factors were considered relevant to the development of the accident:\r\n1. The pilot attempted to conduct an operation for which he was not qualified.\r\n2. Severe weather conditions in the destination aerodrome area with strong winds, turbulence, heavy rain and poor visibility.\r\n3. The pilot continued flight into adverse weather conditions.\r\n4. The pilot may have misread his altimeter and been lower than intended.\r\n5. The pilot may have unintentionally descended the aircraft into the ground in conditions of poor visibility."}