{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-e9-ngerende-4-killed", "date": "Aug 22, 2012 at 1220 LT", "type": "Let L-410", "operator": "Mombasa%20Air%20Safari", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Amboseli – Ngerende – Mara North – Ukunda – Mombasa", "msn": "91 26 27", "yom": 1991, "flight_number": null, "city": "Ngerende", "zone": "Rift Valley", "country": "Kenya", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 11, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 7480, "captain_hours_type": 1150, "copilot_hours": 312, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "This was a commercial non scheduled flight which was being operated for air transport for local flights. The operator is based in Mombasa and mostly executes passenger flights to the Masai Mara and other game parks and reserves within the Republic of Kenya. On 22nd Aug 2012, the aircraft was scheduled to carry out a flight to the Masai Mara, do several sectors to pick and drop passengers and return to Moi international Airport via Ukunda Airport. The call sign was 5Y-UVP. The last point of departure was Ngerende Airstrip in the Masai Mara at 0917 with intention of onward flight to Mara North airstrip in the Masai Mara. The flight had earlier left Amboseli Airstrip with two crew, and 17 passengers for Ngerende Airstrip. 6 passengers had disembarked at Ngerende and the remaining 11 passengers were continuing to other destinations. No additional passengers or cargo was picked up from Ngerende airstrip. No refueling was done at the airstrip. The airfield is an unmanned airfield, with crew executing unmanned airfield communication procedures to execute approach and landings and also during takeoff. There is however a ground time keeper and a fueling bay at the airfield. Due to terrain and prevailing winds at the time of the flight, Runway 28 was in use. The crew was using unmanned airfield procedures and after the drop-off of 6 passengers, the aircraft lined up runway 28 and proceeded with the take off run. Ground staff at the airstrip reported a normal takeoff run and rotation. During the initial climb, the ground staff still had the aircraft in sight and reported to have seen the aircraft veer sharply to the left and then disappear behind terrain. Shortly afterwards, a loud sound was heard followed by dust in the air. Emergency SAR was initiated with the airport and hotel staff rushing to the accident site. The location of the accident was about 310 meters from the threshold of Runway 10, offset 30° to the left of the extended center line Runway 28. GPS coordinates (figure 1.2) 01.084189° S, 35.1781127° E, Ngerende airstrip. The accident occurred at 0917 UTC on 22nd Aug 2012, during daytime.", "probable_cause": "The following findings were identified:\r\n- The left engine was most probably not developing power at the time of impact,\r\n- The left engine propeller was most probably in feather at the time of impact,\r\n- Both CVR and FDR were unserviceable at the time of the accident,\r\n- AAID was unable to determine origin of contaminant found in the left engine Fuel Control Unit, \r\n- Sufficient oversight was not exercised over the Operator,\r\n- High turnover of the Operator’s staff."}