{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-demopolis-7-killed", "date": "Jul 9, 2011 at 1740 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Advanced Integrated Technology Solutions", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Creve Cœur – Destin", "msn": "421C-0616", "yom": 1979, "flight_number": null, "city": "Demopolis", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 1000, "captain_hours_type": 340, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7800, "circumstances": "The multi-engine airplane was in cruise flight at flight level 210 when the pilot declared an emergency due to a rough-running right engine and diverted to a non-towered airport about 10 miles from the airplane’s position. About 4 minutes later, the pilot reported that he had shut down the right engine. The pilot orbited around the diversion airport during the descent and reported to an air traffic controller that he did not believe he would require any assistance after landing. The airplane initially approached the airport while descending through about 17,000 feet mean sea level (msl) and circled above the airport before entering a left traffic pattern approach for runway 22. About 7,000 feet msl, the airplane was about 2.5 miles northeast of the airport. The airplane descended through 2,300 feet msl when it was abeam the runway threshold on the downwind leg of the traffic pattern. According to the airplane information manual, procedures for landing with an inoperative engine call for “excessive altitude;” however, the airplane's last radar return showed the airplane at an altitude of 700 feet msl (about 600 feet above ground level) and about 3 miles from the approach end of the runway.  The airplane was configured for a single-engine landing and was likely on or turning to the final approach course when it rolled and impacted trees. The airplane came to rest in a wooded area about 0.8 miles north of the runway threshold, inverted, in a flat attitude with no longitudinal deformation. A majority of the airplane, including the cockpit, main cabin, and left wing, were consumed by a postcrash fire. Search operations located the airplane about 6 hours after its expected arrival time. Due to the severity of the postcrash fire, occupant survivability after the impact could not be determined. Examination of the airframe, the left engine, and both propellers did not reveal any preaccident mechanical malfunctions or failures that would have precluded normal operation. The investigation revealed that the right engine failed when the camshaft stopped rotating after the camshaft gear experienced a fatigue fracture on one of its gear teeth. The remaining gear teeth were fractured in overstress and/or were crushed due to interference contact with the crankshaft gear. Spalling observed on an intact gear tooth suggested abnormal loading of the camshaft gear; however, the origin of the abnormal loading could not be determined.", "probable_cause": "The pilot's failure to maintain airplane control during a single-engine approach and his failure to fly an appropriate traffic pattern for a single-engine landing. Contributing to the accident was a total loss of engine power on the right engine due to a fatigue failure of the right engine cam gear.\n"}