{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-10-toronto", "date": "Jun 17, 2011 at 1506 LT", "type": "Dassault Falcon 10", "operator": "Skycharter", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Toronto-Lester Bowles Pearson - Toronto-Buttonville", "msn": "02", "yom": 1973, "flight_number": null, "city": "Toronto-Buttonville", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12000, "captain_hours_type": 4000, "copilot_hours": 7100, "copilot_hours_type": 475, "aircraft_hours": 12697, "circumstances": "Aircraft was on a flight from Toronto-Lester B. Pearson International Airport to Toronto-Buttonville Municipal Airport, Ontario, with 2 pilots on board. Air traffic control cleared the aircraft for a contact approach to Runway 33. During the left turn on to final, the aircraft overshot the runway centerline. The pilot then compensated with a tight turn to the right to line up with the runway heading and touched down just beyond the threshold markings. Immediately after touchdown, the aircraft exited the runway to the right, and continued through the infield and the adjacent taxiway Bravo, striking a runway/taxiway identification sign, but avoiding aircraft that were parked on the apron. The aircraft came to a stop on the infield before Runway 21/03. The aircraft remained upright, and the landing gear did not collapse. The aircraft sustained substantial damage. There was no fire, and the flight crew was not injured. The Toronto-Buttonville tower controller observed the event as it progressed and immediately called for emergency vehicles from the nearby municipality. The accident occurred at 1506 Eastern Daylight Time. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The crew flew an unstabilized approach with excessive airspeed. \r\n2. The lack of adherence to company standard operating procedures and crew resource management, as well as the non-completion of checklist items by the flight crew contributed to the occurrence.  \r\n3. The captain’s commitment to landing or lack of understanding of the degree of instability of the flight path likely influenced the decision not to follow the aural GPWS alerts and the missed approach call from the first officer.  \r\n4. The non-standard wording and the tone used by the first officer were insufficient to deter the captain from continuing the approach.  \r\n5. At touchdown, directional control was lost, and the aircraft veered off the runway with sufficient speed to prevent any attempts to regain control. \r\nFinding as to Risk \r\n1. Companies which do not have ground proximity warning system procedures in their standard operating procedures may place crews and passengers at risk in the event that a warning is received. \n"}