{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-231-mt-weather-92-killed", "date": "Dec 1, 1974 at 1110 LT", "type": "Boeing 727-200", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Indianapolis - Columbus - Washington DC", "msn": "20306/791", "yom": 1970, "flight_number": "TW514", "city": "Mt Weather", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 85, "pax_fatalities": 85, "other_fatalities": 0, "total_fatalities": 92, "captain_hours": 3765, "captain_hours_type": 2899, "copilot_hours": 6205, "copilot_hours_type": 1160, "aircraft_hours": 11997, "circumstances": "Trans World Airlines Flight TW514 was a regularly scheduled flight from Indianapolis, IN (IND), to Washington-National Airport, DC (DCA), with an intermediate stop at Columbus-Port Columbus International Airport, OH (CMH). Flight 514 departed Indianapolis at 08:53 EST and arrived in Columbus at 09:32. The Boeing 727 departed Columbus at 10:24, eleven minutes late. There were 85 passengers and 7 flight crew members aboard the aircraft when it departed Columbus. At 10:36, the Cleveland Air Route Traffic Control Center (ARTCC) informed the crew of Flight 514 that no landings were being made at Washington National Airport because of high crosswinds, and that flights destined for that airport were either being held or being diverted to Dulles International Airport (IAD). At 10:38, the captain of Flight 514 communicated with the dispatcher in New York and advised him of the information he had received. The dispatcher, with the captain's concurrence, subsequently amended Flight 514's release to allow the flight to proceed to Dulles. At 10:42, Cleveland ARTCC cleared Flight 514 to Dulles Airport via the Front Royal VOR, and to maintain FL290. One minute later, the controller cleared the flight to descend to FL230 and to cross a point 40 miles west of Front Royal at that altitude. Control of the flight was then transferred to the Washington ARTCC and communications were established with that facility at 10:48. In the meantime, the flightcrew discussed the instrument approach to runway 12, the navigational aids, and the runways at Dulles, and the captain turned the flight controls over to the first officer. When radio communications were established with Washington ARTCC, the controller affirmed that he knew the flight was proceeding to Dulles. Following this contact, the crew discussed the various routings they might receive to conduct a VOR/DME approach to runway 12 at Dulles. At 10:51, the Washington ARTCC controller requested the flight's heading. After being told that the flight was on a heading of 100 degrees, the controller cleared the crew to change to a heading of 090°, to intercept the 300° radial of the Armel VOR, to cross a point 25 miles northwest of Armel to maintain 8,000 feet, \"...and the 300° radial will be for a VOR approach to runway 12 at Dulles.\" He gave the crew an altimeter setting of 29.74 for Dulles. The crew acknowledged this clearance. The pilots again discussed the VOR/DME approach At 10:55, the landing preliminary checklist was read by the flight engineer and the other crewmembers responded to the calls. A reference speed of 127 kts was calculated and set on the airspeed indicator reference pointers. The altimeters were set at 29.74. The crew then again discussed items on the instrument approach chart including the Round Hill intersection, the final approach fix, the visual approach slope indicator and runway lights, and the airport diagram. At 10:59, the captain commented that the flight was descending from 11,000 feet to 8,000 feet. He then asked the controller if there were any weather obstructions between the flight and the airport. The controller replied that he did not see any significant weather along the route. The captain replied that the crew also did not see any weather on the aircraft weather radar. At 11:01, the controller cleared the flight to descend to and maintain 7,000 feet and to contact Dulles approach control. Twenty-six seconds later, the captain initiated a conversation with Dulles approach control and reported that the aircraft was descending from 10,000 feet to maintain 7,000 feet. He also reported having received the information \"Charlie\" transmitted on the ATIS broadcast. The controller replied with a clearance to proceed inbound to Armel and to expect a VOR/DME approach to runway 12. The controller then informed the crew that ATIS information Delta was current and read the data to them. The crew determined that the difference between information Charlie and Delta was the altimeter setting which was given in Delta as 29.70. There was no information on the CVR to indicate that the pilots reset their altimeters from 29.74. At 11:04, the flight reported it was level at 7,000 feet. Five seconds after receiving that report, the controller said, \"TWA 514, you're cleared for a VOR/DME approach to runway 12.\" This clearance was acknowledged by the captain. The CVR recorded the sound of the landing gear warning horn followed by a comment from the captain that \"Eighteen hundred is the bottom.\" The first officer then said, \"Start down.\" The flight engineer said, \"We're out here quite a ways. I better turn the heat down.\" At 11:05:06, the captain reviewed the field elevation, the minimum descent altitude, and the final approach fix and discussed the reason that no time to the missed approach point was published. At 11:06:15, the first officer commented that, \"I hate the altitude jumping around. Then he commented that the instrument panel was bouncing around. At 11:06:15, the captain said, \"We have a discrepancy in our VOR's, a little but not much.\" He continued, \"Fly yours, not mine.\" At 11:06:27, the captain discussed the last reported ceiling and minimum descent altitude. concluded, \"...should break out.\" At 11:06:42, the first officer said, \"Gives you a headache after a while, watching this jumping around like that.\" At 11:07:27, he said, \"...you can feel that wind down here now.\" A few seconds later, the captain said, \"You know, according to this dumb sheet it says thirtyfour hundred to Round Hill --- is our minimum altitude.\" The flight engineer then asked where the captain saw that and the captain replied, \"Well, here. Round Hill is eleven and a half DME.\" The first officer said, \"Well, but ---\" and the captain replied, \"When he clears you, that means you can go to your ---\" An unidentified voice said, \"Initial approach, and another unidentified voice said, \"Yeah!\" Then the captain said \"Initial approach altitude.\" The flight engineer then said, \"We're out a --- twenty-eight for eighteen.\" An unidentified voice said, \"Right, and someone said, \"One to go.\" At 11:08:14, the flight engineer said, \"Dark in here,\" and the first officer stated, \"And bumpy too.\" At 11:08:25, the sound of an altitude alert horn was recorded. The captain said, \"I had ground contact a minute ago,\" and the first officer replied, \"Yeah, I did too.\" At 11:08:29, the first officer said, \"...power on this.... \" The captain said \"Yeah --- you got a high sink rate.\" \"Yeah,\" the first officer replied. An unidentified voice said, \"We're going uphill, \" and the flight engineer replied, \"We're right there, we're on course.\" Two voices responded, \"Yeah!\" The captain then said, \"You ought to see ground outside in just a minute -- Hang in there boy.\" The flight engineer said, \"We're getting seasick.\" At 1108:57, the altitude alert sounded. Then the first officer said, \"Boy, it was --- wanted to go right down through there, man,\" to which an unidentified voice replied, \"Yeah!\" Then the first officer said, \"Must have had a # of a downdraft.\" At 1109:14, the radio altimeter warning horn sounded and stopped. The first officer said, \"Boy!\" At 11:09:20, the captain said, \"Get some power on.\" The radio altimeter warning horn sounded again and stopped. At 11:09:22, the sound of impact was recorded. After the aircraft left 7,000 feet, the descent was continuous with little rate variation until the indicated altitude was about 1,750 feet. increased about 150 feet over a 15-second period and then decreased about 200 feet during a 20-second period. The recorded altitude remained about 1,750 feet until the airplane impacted the west slope of Mount Weather, Virginia, about 25 nmi from Dulles, at an elevation of about 1,670 feet (509 m). The aircraft was totally destroyed by impact forces and a post crash fire and all 92 occupants were killed. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of the accident was the crew's decision to descend to 1,800 feet before the aircraft had reached the approach segment where that minimum altitude applied result of inadequacies and lack of clarity in the air traffic control procedures which led to a misunderstanding on the part of the pilots and of the controllers regarding each other's responsibilities during operations in terminal areas under instrument meteorological conditions. Nevertheless, the examination of the plan view of the approach chart should have disclosed to the captain that a minimum altitude of 1,800 feet was not a safe altitude.\r\nThe following contributing factors were reported:\r\n- The failure of the FAA to take timely action to resolve the confusion and misinterpretation of air traffic terminology although the Agency had been aware of the problem for several years,\r\n- The issuance of the approach clearance when the flight was 44 miles from the airport on an unpublished route without clearly defined minimum altitudes,\r\n- Inadequate depiction of altitude restrictions on the profile view of the approach chart for the VOR/DME approach to runway 12 at Dulles International Airport. "}