{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-islander-vieques-9-killed", "date": "Aug 2, 1984 at 0805 LT", "type": "Britten-Norman Islander", "operator": "Vieques%20Air%20Link", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Vieques - Christiansted", "msn": "38", "yom": 1968, "flight_number": null, "city": "Vieques", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 723, "captain_hours_type": 71, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Flight 901A departed the ramp in Vieques about 0755 with eight passengers aboard, all of whom had reserved seats and purchased tickets for Flight 901. The pilot of Flight 901A contacted the UNICOM as he taxied out to the takeoff end of runway 09. The UNICOM operator informed hym that there was no other traffic in the area. According to a mechanic at the airport, after takeoff, the airplane appeared to climb out normally; however, he said that as the airplane turned left in a crosswind departure pattern, it appeared to lose power when about 200 feet above the ocean. He stated that the airplane then gained about 50 feet, while in a nose-high attitude, and that he then heard the engines develop more power, before the plane descended into the ocean. The airplane had crashed into the ocean north of the departure end of runway 09 and about 1/2 mile off shore. The aircraft was destroyed and all nine occupants were killed. ", "probable_cause": "The failure of the pilot to execute the emergency engine-out procedure properly shortly after takeoff following a loss of power in the left engine because of water in the airplane's fuel system and the failure of the Puerto Rico Ports Authority to remove excess water known to be in the airport's in-ground fuel tank before conducting fueling operations. The pilot's failure to execute the engine-out procedure properly was due to his inexperience in multi-engine airplanes. Contributing to the accident were: \r\n- The air carrier's use of a pilot not certificated for the flight; \r\n- The air carrier's failure to train the pilot adequately; \r\n- The pilot's failure to follow proper practices to detect water in the airplane's fuel tanks; \r\n- The out of weight and balance condition of the airplane; \r\n- The Federal Aviation Administration's (FAA) incorrect application of 14 CFR Part 135 Rules to commuter air carriers; and (6) the FAA's generally inadequate surveillance of the air carrier."}