{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-193-near-juneau-111-killed", "date": "Sep 4, 1971 at 1215 LT", "type": "Boeing 727-100", "operator": "Alaska%20Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Anchorage – Cordova – Yakutat – Juneau – Sitka – Seattle", "msn": "19304/287", "yom": 1966, "flight_number": "AS1866", "city": "Juneau", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 104, "pax_fatalities": 104, "other_fatalities": 0, "total_fatalities": 111, "captain_hours": 13870, "captain_hours_type": 2688, "copilot_hours": 5000, "copilot_hours_type": 2100, "aircraft_hours": 11344, "circumstances": "Alaska Airlines, Flight 1866 (AS66) was a scheduled passenger flight from Anchorage (ANC), to Seattle (SEA), with intermediate stops at Cordova (CDV), Yakutat (YAK), Juneau (JNU), and Sitka (SIT). The IFR flight departed Anchorage at 09:13 and landed at Cordova at 09:42. AS66 departed Cordova at 10:34 after a delay, part of which was attributable to difficulty in securing a cargo compartment door. The flight landed at Yakutat at 11:07. While on the ground, AS66 received an air traffic control clearance to the Juneau Airport via Jet Route 507 to the Pleasant Intersection, direct to Juneau, to maintain 9,000 feet or below until 15 miles southeast of Yakutat on course, then to climb to and maintain FL230. The flight departed Yakutat at 11:35, with 104 passengers and seven crew members on board. At 11:46, AS66 contacted the Anchorage ARTCC and reported level at FL230, 65 miles east of Yakutat. The flight was then cleared to descend at the pilot's discretion to maintain 10,000 ft so as to cross the Pleasant Intersection at 10,000 feet and was issued a clearance limit to the Howard Intersection. The clearance was acknowledged correctly by the captain and the controller provided the Juneau altimeter setting of 29.46 inches and requested AS66 to report leaving 11,000 ft. At 11:51, AS66 reported leaving FL230. Following this report, the flight's clearance limit was changed to the Pleasant Intersection. At 11:54, the controller instructed AS66 to maintain 12,000 feet. Approximately 1 minute later, the flight reported level at 12,000 feet. The changes to the flight's original clearance to the Howard Intersection were explained to AS66 by the controller as follows: \"I've got an airplane that's not following his clearance, I've got to find out where he is.\" The controller was referring to N799Y, a Piper Apache which had departed Juneau at 11:44 on an IFR clearance, destination Whitehorse, Canada. On two separate occasions, AS66 acted as communications relay between the controller and N799Y. At 11:58, AS66 reported that they were at the Pleasant Intersection, entering the holding pattern, whereupon the controller recleared the flight to Howard Intersection via the Juneau localizer. In response to the controller's query as to whether the flight was \"on top\" at 12,000 feet, the captain stated that the flight was \"on instruments.\" At 12:00, the controller repeated the flight's clearance to hold at Howard Intersection and issued an expected approach time of 12:10. At 12:01, AS66 reported that they were at Howard, holding 12,000 feet. Six minutes later, AS66 was queried with respect to the flight's direction of holding and its position in the holding pattern. When the controller was advised that the flight had just completed its inbound turn and was on the localizer, inbound to Howard, he cleared AS66 for a straight-in LDA approach, to cross Howard at or below 9,000 feet inbound. The captain acknowledged the clearance and reported leaving 12,000 feet. At 12:08 the captain reported \"leaving five thousand five ... four thousand five hundred,\" whereupon the controller instructed AS66 to contact Juneau Tower. Contact with the tower was established shortly thereafter when the captain reported, \"Alaska sixty-six Barlow inbound.\" (Barlow Intersection is located about 10 nautical miles west of the Juneau Airport). The Juneau Tower Controller responded, \"Alaska 66, understand, ah, I didn't, ah, copy the intersection, landing runway 08, the wind 080° at 22 occasional gusts to 28, the altimeter now 29.47, time is 09 1/2, call us by Barlow\". No further communication was heard from the flight. The Boeing 727 impacted the easterly slope of a canyon in the Chilkat Range of the Tongass National Forest at the 2475-foot level. The aircraft disintegrated on impact. The accident was no survivable. ", "probable_cause": "A display of misleading navigational information concerning the flight's progress along the localizer course which resulted in a premature descent below obstacle clearance altitude. The origin or nature of the misleading navigational information could not be determined. The Board further concludes that the crew did not use all available navigational aids to check the flight's progress along the localizer nor were these aids required to be used. The crew also did not perform the required audio identification of the pertinent navigational facilities."}