{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-134b-3-nakhchivan-52-killed", "date": "Dec 5, 1995 at 1754 LT", "type": "Tupolev TU-134", "operator": "Azerbaijan-Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nakhchivan - Baku", "msn": "63383", "yom": 1980, "flight_number": "AHY056", "city": "Nakhchivan", "zone": "Nakhchivan", "country": "Azerbaijan", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 2, "pax_on_board": 76, "pax_fatalities": 50, "other_fatalities": 0, "total_fatalities": 52, "captain_hours": 9534, "captain_hours_type": 3641, "copilot_hours": 4557, "copilot_hours_type": 263, "aircraft_hours": 27500, "circumstances": "During initial climb, at a height of about 60 metres and at a speed of 317 km/h, the left engine failed. The copilot counteracted the left bank and five seconds later, the flight engineer informed the crew that the right engine also failed. The captain took over control and the aircraft climbed to the height of 197 metres when the speed dropped to 290 km/h. The captain elected to make an emergency landing but was forced to make a sharp turn to the right to avoid a building. The aircraft rolled to the right to an angle of 37° and adopted a rate of descent of 1,960 feet per minute before crashing in an open field located 3,850 metres from the airport. The aircraft disintegrated on impact. Thirty occupants were rescued while 52 others, among them two crew members, were killed. ", "probable_cause": "It was determined that the left engine failed during initial climb following the disintegration of the 2nd and 3rd stage of the compressor. Investigations revealed that the maintenance was non compliant and that 38 screws were missing on the main compressor, a violation that was not repaired during the last maintenance inspection conducted 30 flying hours prior to the accident. Following a lack of crew coordination but also a faulty ergonomy of the flight deck, the flight engineer mistakenly shut down the right engine that was running properly. "}