{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-7-peak-surveyor-12-killed", "date": "Sep 14, 1979 at 2047 LT", "type": "Douglas DC-7", "operator": "Butler%20Aircraft%20Company", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Mountains", "schedule": "Redmond - Klamath Falls - Medford", "msn": "44287/538", "yom": 1954, "flight_number": "Tanker 69", "city": "Surveyor Peak", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 8200, "captain_hours_type": 475, "copilot_hours": 3500, "copilot_hours_type": 250, "aircraft_hours": 21025, "circumstances": "Using the call sign Tanker 69, the aircraft was on a company business flight from Redmond to Medford with an en route stop at Klamath Falls. At Redmond, about 600 gallons of 100/130-grade fuel were added to the 1,000 gallons on board, 8 employees were enplaned, and the aircraft departed Redmond for Klamath Falls about 1945. The purpose of the flight was to transport Butler employees to an end-of-season barbecue in Medford that had started between 1930 and 2000. Tanker 69 landed at Klamath Falls at 2029. Two additional Butler employees were enplaned, and the aircraft departed runway 14 at 2040. The flightcrew did not file a flight plan and the weather was such that none was required. Witnesses saw the aircraft begin a steep right turn about one mile south of the runway and momentarily disappear from their view behind hangars and airport buildings; it then proceeded on a westerly course. A few minutes later, a pilot located 11 miles west-southwest of the airport saw the aircraft pass overheard an altitude he estimated to be 750 feet above ground level. He said that the aircraft lights were on and that engine sounds were normal. About 2047, witnesses located 25 miles west-northwest of the airport heard sounds, which they first thought to be from a car or truck with loud mufflers. Subsequently, they determined that the sounds were an approaching aircraft. They heard engine sounds become 'choppy', resembling the noise made by a helicopter blade, and saw a fireball on Surveyor Peak, about 3,5 miles south of their location. Weyerhauser Company and Oregon State Forestry Department personnel located about 12 miles from Surveyor Peak also saw the fireball on the peak. After notifying authorities, they took firefighting equipment to the scene. The aircraft crashed at night during hours of darkness at an elevation of about 6,400 feet. The aircraft was totally destroyed and all 12 occupants were killed. ", "probable_cause": "The flight crew’s decision to undertake a direct point-to-point high-cruise-speed flight at low altitude. The crew’s judgment in the selection of a low-altitude flight profile may have been influenced by their familiarity with the terrain."}