{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-del-rio-1-killed", "date": "Apr 26, 2001 at 0830 LT", "type": "Cessna 402", "operator": "Texas Air Charters", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "San Antonio – Del Rio", "msn": "402B-1384", "yom": 1978, "flight_number": null, "city": "Del Rio", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1140, "captain_hours_type": 70, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 19279, "circumstances": "Upon arrival at the destination airport, the commercial pilot of the Part 135 cargo flight reported to the tower that he was 7 miles to the east, intending to land on runway 13. Subsequently, the pilot reported that he would circle the airport a few times \"because he was having trouble with his autopilot.\" After circling, the pilot positioned the airplane on final approach to runway 13. The pilot of another airplane in the traffic pattern observed the accident airplane on a \"one to two mile final, in a normal flight attitude but possibly a little low.\" After looking at her instruments for several seconds, she made visual contact again and observed the airplane impact the ground with the \"tail of the aircraft falling forward on top of a fence.\" She further stated that all of the radio transmissions from the accident airplane were \"calm and completely un-alarmed prior to the accident.\" Another witness, who was located at a fixed base operator at the airport, observed the airplane turn onto final. He stated that the airplane \"suddenly stalled and slammed into the ground from about two hundred feet.\" The 1,140 hour pilot had accumulated a total of 70 hours in the Cessna 402. The airplane was found to be within its prescribed weight and balance limitations at the time of the accident. Ground impressions and airframe deformations indicated that the impact angle was approximately 25 degrees nose down on a magnetic heading of 155 degrees with the landing gear extended and the flaps partially extended. A post-impact fire destroyed the airplane. Flight control continuity was established from the aft section of the cockpit to the rudder and elevator flight control surfaces. The elevator trim tab (located on the right elevator) was measured with a protractor and found to be in the 28 degrees tab-up position (aircraft nose down). According to the airplane manufacturer's specifications, the maximum tab-up travel limit (when connected) is 5 degrees. The trim tab would not move freely by hand forces and appeared to be jammed. The elevator skin was cut open (top side) to observe the trim tab connecting hardware. It was observed that the clevis end of the trim tab actuator rod was wedged against the front spar of the elevator's internal structure. Additionally, the bolt which connected the clevis end of the tab actuator rod to the actuator screw, was missing. After further inspection, neither the bolt nor the nut were found in the cavity of the elevator structure or the surrounding area. The clevis end of the actuator rod and the actuator screw were not damaged, and no impact damage was apparent on the trim tab. The operator's maintenance records showed that the right elevator had been replaced 10 flight hours prior to the accident.", "probable_cause": "The loss of control due to a jammed trim tab, which resulted from the failure of maintenance personnel to properly secure the trim tab actuator rod when installing a replacement elevator."}