{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-didino-1-killed", "date": "Jan 15, 1960 at 1118 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Sverdlovsk – Kazan – Moscow", "msn": "184 194 05", "yom": 13, "flight_number": null, "city": "Didino", "zone": "Sverdlovsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2310, "circumstances": "The aircraft was recently transferred from the Soviet Air Force to Aeroflot and the crew was en route from Sverdlovsk to Moscow-Bykovo with an intermediate stop in Kazan. Technical modifications should be brought on the aircraft, all documentation should be modified and adapted with a new color scheme on the fuselage. En route, the right engine failed and the captain decided to return to Sverdlovsk but he was unable to maintain a safe altitude. The crew jettisoned some of the cargo but few boxes struck the door and one of them remained partially blocked, causing drag. Losing altitude, the airplane struck trees and eventually crashed in a wooded area located near Didino, about 65 km west of Sverdlovsk-Koltsovo Airport. The airplane was destroyed, three crew members were injured and the fourth occupant was killed. ", "probable_cause": "Failure of the right engine in flight due to fuel starvation. It was determined that the fuel selector was connected to the left rear tank which was empty. Only 200 liters were added in the tank prior to takeoff and the crew forgot to change the fuel selector in flight to another suitable tank. It is also reported that the crew failed to take the appropriate measures to maintain a safe control of the airplane with one engine inoperative and the captain maintained an insufficient speed of 150 km/h instead of 170 km/h, which contributed to the loss of altitude. "}