{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-george", "date": "Sep 10, 2004 at 0545 LT", "type": "Swearingen SA227 Metro III", "operator": "Ryan Blake Air Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bloemfontein – George", "msn": "AC-748B", "yom": 1989, "flight_number": null, "city": "George", "zone": "Western Cape", "country": "South Africa", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2465, "captain_hours_type": 657, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8760, "circumstances": "The aircraft was on a Domestic Charter flight (IFR) from Bloemfontein Aerodrome to George Aerodrome when the crew elected to execute an ILS approach for landing onto Runway 11. At 1,000 feet from the threshold of Runway 11 with the undercarriage selected down and at full flaps for landing at an IAS of 120kt when he advised the copilot that was the flying pilot at the time, to continue visually with the approach for Runway 11. Shortly thereafter they heard a loud impact sound and the right hand engine failed. The aircraft suddenly yawed and banked severely to the right and the flying pilot commented that they had experienced a bird strike on the right hand engine. The pilot-in-command immediately took over the controls and attempted to arrest the yaw to the right but the aircraft kept yawing to the right. He then made a blind transmission on frequency 118.9 MHz and called for a go-around. The co-pilot then selected full power on both engines retracted the undercarriage, whilst the pilot-in-command feathered the right-hand propeller. According to the pilot-in-command, the aircraft continued to yaw to the right and with the stall aural warning sounding with a loss of altitude, he pulled the left-hand engine stop and feather control and was committed to execute a forced landing on a cattle farm The pilot-in-command stated that aircraft was approximately just outside the boundary fence. Both wings collided with the gum poles of a telephone and wire fence causing extensive damage to the wings and fuselage under-surface. Both occupants sustained no injuries. ", "probable_cause": "The aircraft encountered a bird strike on the right-hand engine prior to landing at George Aerodrome. It appears that the cockpit crew did not apply the correct procedures for a go-around when the aircraft yawed Severely to the right. The aircraft failed to climb and a forced landing was executed on a cattle farm. "}