{"url": "https://www.baaa-acro.com/crash/crash-casa-c-295m-miroslawiec-20-killed", "date": "Jan 23, 2008 at 1907 LT", "type": "Casa C-295M", "operator": "Polish%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Warsaw– Powidz – Poznań-Krzesiny – Mirosławiec – Świdwin – Krakow", "msn": "S-043", "yom": 2007, "flight_number": null, "city": "Mirosławiec", "zone": "West Pomeranian Voivodeship (Zachodniopomorskie)", "country": "Poland", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 16, "pax_fatalities": 16, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 300, "circumstances": "The aircraft departed Warsaw at 1651LT on a flight to Krakow with intermediate stops in Powidz, Poznań-Krzesiny, Mirosławiec and Świdwin, carrying 36 passengers and a crew of four. They were returning to their base after intending the 50th Annual Aviation Safety Conference held in Warsaw. Nine passengers deplaned at Powidz and 11 others at Poznań-Krzesiny AFB. On approach to Mirosławiec by night, the crew encountered poor weather conditions with a ceiling at 300 feet, visibility 2 sm and mist. On short final, the aircraft was unstable. With a rate of descent of 6,000 feet per minute and at a speed of 148 knots, the aircraft impacted trees and crashed in a wooded area located 1,300 metres short of runway threshold, bursting into flames. The aircraft was totally destroyed and all 20 occupants were killed. \r\nCrew:\r\nMaj Jarosław Haładus,\r\nAdj Robert Kuźma,\r\nAdj Michał Smyczyński,\r\nSgt Janusz Adamczyk.\r\nPassengers:\r\nGen Brig Andrzej Andrzejewski,\r\nCol Dariusz Maciąg,\r\nCol Jerzy Piłat,\r\nLt Col Wojciech Maniewski,\r\nLt Col Zbigniew Książek,\r\nLt Col Dariusz Pawlak,\r\nLt Col Zdzisław Cieślik,\r\nMaj Robert Maj,\r\nMaj Mirosław Wilczyński,\r\nMaj Grzegorz Jułga,\r\nMaj Piotr Firlingier,\r\nMaj Krzysztof Smołucha,\r\nCpt Karol Szmigiel,\r\nCpt Paweł Zdunek,\r\nCpt Leszek Ziemski,\r\nCpt Grzegorz Stepaniuk,\n\n", "probable_cause": "Inadvertent loss of spatial and situational awareness by the aircraft crew during final stages of PAR approach, which, within 12 seconds period before crash, resulted in the aircraft’s bank increasing unmonitored and accompanying altitude loss, while the flight crew apparently was trying to establish visual contact with runway and approach lights.\n\r\nAmong the secondary causes the Board listed:\r\n- Improper flight crew selection for the flight:\r\n- The PIC did not have any previous experience on this version of CASA C-295 aircraft, which was additionally equipped with 2 IRS/GPS LN-100G units instead of 2 TOPSTAR 100-2 GPS receivers, and, ironically, with EGPWS Mk. V - unfortunately lack of cryptographic modules in GPS receivers, which made IRS/GPS LN-100G system almost useless (IRS alone with no GPS enhancement) caused flight crew to use handheld GPS receivers (Garmin GPSMAP 196),\r\n- The SIC was not rated in CASA C-295 aircraft for night/IMC operations,\r\n- Poor flight crew coordination and cooperation (poor MCC & CRM):\r\n- improper altimeter setting procedures,\r\n- probably both pilots were looking for visual cues and nobody was observing flight instruments in the very last seconds before they crash),\r\n- Poor weather conditions in vicinity of Miroslawiec AB; ceiling 300 feet, visibility 2 sm, in mist. Icing was excluded as a factor.\r\n- Spatial disorientation of the flight crew,\r\n- EGPWS Audio warning was inhibited (the flight crew missed EGPWS test before departure from Warsaw, even though it was a checklist item, and never corrected the problem - the PIC was not familiar with the system - he has never flown before CASA C-295M equipped with EGPWS) - in result no audio warning of excessive bank angle, high terrain closure rate and high sink rate was available to the flight crew, as well as no automatic height above ground callouts were given,\r\n- The flight crew failed to monitor radio-altimeter indication during both approaches,\r\n- Both pilots concentrated their attention outside of the cockpit during final seconds before crash and did not scan flight instruments.\r\n- The military PAR controller did a poor job during the approach, he let for the non-stabilized approach, he was not compensating properly for left crosswind of 20 kts and allowed the aircraft to stay high above glide slope during both PAR approaches, he also was not fully aware of altimeter setting (QNH or QFE) and altitude reports by flight crew– improper values QNH/QFE were used by the flight crew during first approach, additionally PIC has set his altimeter to QFE, while SIC to QNH. During the approach the controller’s instructions were hesitant and inconsistent, probably making the flight crew to believe their approach was going well.\r\n- The military PAR controller was giving improper suggestions to the flight crew - he was questioning them during final stage of approach whether they see approach or runway lights or not, instead of continuous talking them down to the runway threshold,\r\n- Altimeter indications were improperly interpreted by the flight crew,\r\n- Improperly performed search for visual contact by the flight crew during final stage of approach,\r\n- Improper, lacking weather situation analysis performed by the PIC before the flight,\r\n- The flight crew did not properly set DH/MDA (they did the same error on previous two legs before crash).\n\r\nContributing factors were:\r\n- The SIC was not rated in CASA C-295 aircraft for night/IMC operations (the SIC total flight time was 800 hours including 100 hours in CASA C-295M),\r\n- The PIC has no previous experience on the accident version of CASA C-295 aircraft, (although he logged 800+ hours in another version of CASA C-295M aircraft used by Polish AF and his total flight time was 2500 hours),\r\n- Because of lack of GPS enhancement to IRS, the flight crew used Garmin GPSMAP 196 handheld GPS receiver,\r\n- The PIC had no previous experience in PAR approaches in IMC, close to minimums, which in Miroslawiec AB were reported to be aprox. ceiling 270 feet and visibility of 3300 feet,\r\n- The military PAR controller had no previous experience in conducting PAR approaches of aircraft other than Sukhoi Su-22,\r\n- The aircraft was improperly vectored to final approach by military APP controller (the same person performing PAR controller duties) which resulted in rushed, non-stabilized first approach, because the aircraft started descent on final approach segment being twice as high as glide slope,\r\n- Lack of instrument approach procedures meeting ICAO standards at Polish military airports, including Miroslawiec AB, published in Aeronautical Information Publication (AIP),\r\n- Use of different units by pilots and controller (the aircraft’s altimeters were scaled in feet and hPa, while the controller was using meters and millimeters of Hg, there was also misunderstanding regarding use of QNH and QFE),\r\n- Even though the aircraft was equipped with ILS receiver, the ILS equipment at Miroslawiec AB was inoperative (it was installed in 2001, but since then has never worked properly, and therefore was not used, despite several repair attempts - now, 2 months after the crash, it is reported to work properly - the crew had available only military PAR (unable to meet ICAO standards), assisted with 2 military NDBs located 4 km and 1 km from the threshold of runway 30),\r\n- The information on minimum weather conditions and available navaids in Miroslawiec AB were improperly disseminated (dispatch personnel had no information the ILS in Miroslawiec AB was inoperative)."}