{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-pensacola-3-killed", "date": "Apr 10, 1989 at 1300 LT", "type": "Beechcraft 200 Super King Air", "operator": "Southern Company Services", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Pensacola - Atlanta", "msn": "BB-702", "yom": 1980, "flight_number": null, "city": "Pensacola", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 14200, "captain_hours_type": 3000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6351, "circumstances": "The aircraft was routinely flown to Pensacola to pickup a gulf power executive for a flight to Atlanta. The pax had 4 bags, 2 placed in the aft baggage area by the ground crew, the other 2 carried onboard by the pax. After takeoff the CVR recorded the pax stating that there was a fire. The fire in the aft cabin area was confirmed by the 1st officer. An emergency was declared to the personnel ATCT. Subsequently, the aircraft was seen descending out of the overcast streaming dark smoke behind it. The aircraft impacted an apartment complex and a post crash fire destroyed it. No evidence of a lightning strike, aircraft system malfunction, or incendiary device was found during the investigation. Forensic chemical tests showed traces of hydrochloric and sulphuric acid on pax articles but none on the cabin interior.  Metallurgical exam of broken fuel line showed overload failure and post heat distress. The interior of the cockpit windows were severely sooted. The flight crew did not don available oxygen masks.", "probable_cause": "An in flight cabin fire of undetermined origin, and smoke (toxic condition) in the crew compartment, which resulted in physical impairment of the flight crew."}