{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-e-guatemala-city-8-killed", "date": "Sep 18, 2001 at 0642 LT", "type": "Let L-410", "operator": "Atlantic%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Guatemala City – San Pedro Sula", "msn": "86 17 05", "yom": 1986, "flight_number": "ATL870", "city": "Guatemala City-La Aurora", "zone": "Guatemala", "country": "Guatemala", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 11, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2467, "circumstances": "After takeoff from runway 01 at Guatemala City-La Aurora Airport, while climbing to a height of 200 feet, the twin engine aircraft rolled left and right then stalled and crashed beside the runway, about 550 metres from its end. The copilot and four passengers were injured while eight other occupants including the captain were killed. The aircraft was totally destroyed. ", "probable_cause": "It was determined that the aircraft stalled during initial climb because the passengers seats were not properly allocated, causing the center of gravity to be outside the permissible limit. The following contributing factors were identified:\r\n- The Atlantic Airlines company, at the date of the accident, did not have sufficiently trained administrative and operational personnel for a safe operation.\r\n- The poor allocation of the passengers inside the cabin affected lift, causing the aircraft to stall. Due to its low height, it was impossible to expect a stall recovery. This shows that the aircraft collapsed completely without move on the ground and being destroyed by the weight of the engines and their wings that were full of fuel.\r\n- Lack of crew training, especially the copilot who was not rated on this type of aircraft. Thus, he was not able to assist the captain in an emergency situation but only reading the checklist.\r\n- The engines were operating normal at the time of impact and they were running in normal takeoff conditions.\r\n- No evidence of mechanical failure was found.\r\n- The accident shows that the aircraft was operating normally, but that due to aerodynamic circumstances, it entered a stall and crashed on the ground abruptly and uncontrollably."}