{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-20-islander-espiritu-santo-2-killed", "date": "Dec 19, 2008 at 1110 LT", "type": "Britten-Norman Islander", "operator": "Air%20Vanuatu.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Olpoi - Luganville", "msn": "172", "yom": 1970, "flight_number": "AVN261", "city": "Espiritu Santo", "zone": "All Vanuatu", "country": "Vanuatu", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 8395, "captain_hours_type": 1300, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15314, "circumstances": "On Friday 19 December 2008, YJ-RV2, a Britten-Norman Islander aeroplane, was scheduled to fly a routine commercial passenger service for Air Vanuatu (Domestic) Limited (the operator). The service was to start from Bauerfield International Airport, Port Vila and was to include 5 flights or legs, taking the aircraft north via an intermediate landing at Norsup and onto Pekoa International Airport (also known as Santo Airport) near Luganville on Espiritu Santo. At Santo Airport the aircraft was to be refuelled and after a stopover of about 2 hours the service was to continue north to Gaua and Mota Lava before returning to Santo where it was planned to terminate. The pilot arrived at the operator’s base at about 0700 and started his before-flight duties. The flight departed Bauerfield on schedule at 0730 and progressed normally to Santo. The operator’s agent at Santo had early Friday morning called the company operations office in Port Vila and asked if a flight from Santo to Lajmoli and return could be added to the service. The regular Thursday flight had been cancelled and 9 passengers had been left stranded at Lajmoli. The operations staff approved the request and the agent advised he would confirm with the pilot of YJ-RV2 when he arrived at Santo. At Santo the pilot was met by the agent and agreed to the request for the additional flight to Lajmoli. No interruption to the original schedule was envisaged as the flight should have returned to Santo well before the planned 1230 departure north to Gaua. The aircraft was checked and 246 litres of fuel were added. The aircraft departed Santo for Lajmoli at 1016 with the pilot and 4 passengers onboard. At Lajmoli, the local agent, aware that YJ-RV2 was inbound, weighed the passengers and their bags in preparation for the return flight. At 1043 YJ-RV2 landed at Lajmoli and the agent off-loaded the passengers and baggage while the pilot waited by the aircraft. The agent later reported that he informed the pilot of the planned load of 9 passengers and baggage, and that the aircraft would likely be at about maximum allowable weight. The pilot was reported to have advised the agent that he was happy to continue and instructed him to load the aircraft. The pilot remained near the aircraft while the agent loaded first the baggage then the passengers. The pilot instructed one of the passengers to enter the aircraft through the forward door and sit in the front-right seat next to the pilot. The agent added the weight of the passengers and baggage to the load sheet for the flight, but he wasn’t aware of the fuel weight so omitted this from the sheet. The load sheet, which included a passenger manifest, was returned to the pilot, who signed it. A copy was retained by the agent and later handed to the investigation team. At 1055 the pilot started the engines and taxied the aircraft for grass runway 14. YJ-RV2 took off at 1058 and at 1100 the pilot called Santo air traffic services on the high frequency (HF) radio,reporting airborne and climbing to 7000 feet. He gave an estimated time of arrival at Santo of 130. Witnesses, both on the ground at Lajmoli and passengers on board, later commented that the aircraft took longer to get airborne than normal and was slower to climb. The pilot followed the coastline south and approaching the village of Wunavae turned left inland. Passengers later commented that the aircraft flew in a direct line towards the rising hilly ground and, based on their previous flying experiences, crossed several ridges at a lower-than-normal height. The passengers also commented that the pilot increased power on the engines as they flew in an easterly direction. The passengers later spoken to (7) reported no significant turbulence and while there was perhaps some light cloud about, they were able to see the terrain ahead. The passengers recalled becoming increasingly concerned about the low height of the aircraft as it flew directly at a right-angle towards the last ridgeline before crossing over into Big Bay. Some of the passengers described the pilot closing the throttles and shutting down the engines as they approached the ridgeline. At about the same time they heard a loud buzzing sound, later identified as the aircraft’s stall warning. Shortly afterwards, the aircraft struck the trees and bush and quickly came to a halt. No communication was heard from the pilot during this time, although he was observed throughout making movements typical of someone who was awake. Within a couple of minutes of impacting into the bush, the passengers started vacating the aircraft. Fuel was smelled about the aircraft and seen dripping from the wing. The passengers were unable to rouse the pilot and front-seat passenger, who were trapped in the now-deformed front of the aircraft. A second passenger, who had suffered a severe head wound and suspected broken leg, was slower to vacate the aircraft and remained semi-conscious near its right side. The remaining 7 passengers assembled at the rear of the aircraft, near the rear left baggage door. Thinking that the pilot and front-seat passenger were dead, and fearing the aircraft might catch fire, they agreed to start walking downhill towards the coast and Wunavae village. The eighth passenger, now aware that the main group had departed downhill, attempted to follow but was unable to catch up owing to his injuries. At about 1115, Santo air traffic services called the pilot of YJ-RV2 to coordinate his arrival with those of several other aircraft also approaching Santo. The controller received no response, so requested other aircraft to call YJ-RV2 on various radio frequencies. Again there was no response. At 1130 the controller declared the aircraft overdue and informed the authorities and the operator. The crews of a company ATR 42 and a DH6 Twin Otter on scheduled local flights were asked to conduct an initial search for YJ-RV2, focusing on the direct track from Lajmoli to Santo. A third private aircraft also assisted in the search. At about 1245 the crew of the ATR 42 located the wreckage of YJ-RV2 at about 4000 feet (1200 m) in the mountainous area west of Big Bay. The crew was unable to fly close enough to confirm if there were any survivors. At 1500, a light helicopter based in Port Vila departed for Santo and the accident site. Inclement weather prevented the helicopter reaching the site that evening and rescue operations were halted until the next day. Additional support was also requested from New Caledonia, and a French military Super Puma helicopter and medical team arrived in Santo on Saturday morning. At about 0700 on Saturday 20 December, the first rescue personnel reached YJ-RV2 and confirmed that the pilot was dead and the front-seat passenger critically injured. There was no sign of the remaining 8 passengers. The critically injured passenger was initially evacuated to Luganville Hospital and was subsequently taken to Australia for further treatment. He died of his injuries on 1 January 2009. During Saturday morning a group of searchers from Wunavae village started walking towards the accident site looking for survivors. About mid-afternoon, the group of 7 passengers was located by the crew of the Super Puma some 3 to 4 km west of the accident site and airlifted to Santo for treatment. The last passenger was located by the villagers the following day and after a third night in the bush was airlifted to hospital. ", "probable_cause": "Findings:\r\nFindings are listed in order of development and not in order of priority.\r\n- The pilot was appropriately licensed to fly the aeroplane, but his route and aerodrome qualification had been allowed to lapse. However, this lapse was unlikely to have contributed to the accident.\r\n- There was no evidence that the pilot was not fit to conduct the flight, but he was observed by the local agent and passengers to be less communicative than usual, both before and during the flight.\r\n- The aeroplane had been maintained in accordance with approved standards and there was no evidence of mechanical failure that could have contributed to the accident.\r\n- The weather was suitable for the pilot to maintain appropriate terrain separation visually.\r\n- The aeroplane was overloaded by at least 7%, which affected its climb performance and made it unlikely that it would be able to cross the final ridge without deviating from the path flown by the\r\npilot.\r\n- The aeroplane did not have sufficient height margin to approach the lee of the ridge where downdraughts were foreseeable, and the pilot had not approached the ridge from a direction that\r\nwould have afforded him an escape route when he decided to abort the crossing.\r\n- The poor configuration of the seat belts in the aeroplane increased the risk of injury to the occupants, and may have contributed to the death of one passenger.\r\n- The chances of survival for those passengers who survived the impact were reduced by their decision to leave the accident site. "}