{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-yola", "date": "Oct 25, 2012 at 1830 LT", "type": "Cessna 208B Grand Caravan", "operator": "Taraba%20State%20Government", "flight_phase": "Landing (descent or approach)", "flight_type": "Government", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jalingo – Yola", "msn": "208B-2098", "yom": 2009, "flight_number": null, "city": "Yola", "zone": "Adamawa", "country": "Nigeria", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 999, "circumstances": "On the 25th of October, 2012 at 17: 48 h, a Cessna Caravan 208B, 5N-BMJ, departed Jalingo for Yola on a Visual Flight Rules (VFR) flight plan with four Persons-On-Board (one crew and three passengers). At 18:00 h, the Airport Manager stationed at Jalingo by Taraba State Government, called Yola Control Tower (CT) by phone to advise that the aircraft had departed Jalingo for Yola. At 18:25 h the pilot reported field in sight. CT then advised him to “continue approach and report final, wind calm” and the pilot acknowledged “will continue approach, to report final”. At 18:27 h CT had the aircraft in sight and advised the pilot to report “final, wind calm”, the pilot acknowledged. At 18:30 h, CT lost visual contact with 5N-BMJ and tried to raise her on radio but there was no response. At 18:37 h, information was received from witnesses, regarding a possible plane crash at Yola-Numan road close to Nigerian National Petroleum Corporation (NNPC) depot. This information was subsequently passed to the fire watch room. Rescue team and other security personnel were mobilized to the location of the crash. However, before the arrival of the rescue team from the airport, the locals had rescued the occupants from the wreckage. The occupants were subsequently taken to Federal Medical Centre (FMC), Yola for medical treatment. The accident occurred at dusk. The aircraft was destroyed.", "probable_cause": "The Bureau could not conclusively determine the cause of this accident; however, the investigation identified the following factors:\r\n- The pilot was not certified, qualified and not competent to fly the aircraft.\r\n- The decision of the pilot to operate a VFR flight after sunset.\r\n- Inadequate oversight by the Regulatory Authority."}