{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-petersburg", "date": "Dec 2, 2004 at 1310 LT", "type": "Cessna 414 Chancellor", "operator": "Devonshire Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Petersburg - Petersburg", "msn": "414-0373", "yom": 1972, "flight_number": null, "city": "Petersburg", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3000, "captain_hours_type": 130, "copilot_hours": 5600, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The purpose of the flight was to \"check out\" the airplane before delivering it to its new owner, and to provide the copilot with an indoctrination ride in the Cessna 414. During the approach, the pilot provided guidance and corrections to the copilot. The copilot flew the airplane to within 200 feet of the ground when the nose of the airplane yawed abruptly to the right. The pilot took control of the airplane, and pushed the engine and propeller controls to the full forward position. He placed the fuel pump switches to the \"high\" position, retracted the flaps, and attempted to retract the landing gear. With full left rudder and full left aileron applied, he could neither maintain directional control nor stop a roll to the right. The airplane struck the ground and continued into the parking area where it struck an airplane and a waste-oil tank. Examination of the airplane following the accident revealed that the landing gear was down and locked, and the propeller on the right engine was not feathered. The emergency procedure for an engine inoperative go-around required landing gear retraction and a feathered propeller on the inoperative engine. The pilot's handbook further stated, \"Climb or continued level flight is improbable with the landing gear extended and the propeller windmilling.\" After the accident, both pilots stated that they didn't notice a power loss on the right engine until the copilot surrendered the flight controls. The right engine was removed and placed in a test cell. The engine started immediately on the first attempt and ran continuously without interruption.", "probable_cause": "The partial loss of engine power for undetermined reasons, and the pilot's failure to maintain adequate airspeed (Vmc)."}