{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-stehekin-2-killed", "date": "May 17, 2008 at 1645 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Chelan%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Chelan - Stehekin", "msn": "1151", "yom": 1958, "flight_number": null, "city": "Stehekin", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5747, "captain_hours_type": 637, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12070, "circumstances": "The amphibious-float-equipped airplane departed from a paved runway for the 40-nautical mile flight to its destination, where a water landing on a lake was to be made. The pilot did not raise the landing gear after takeoff. During the flight, the air was bumpy and turbulent, and this resulted in the gear advisory system activating numerous times. The purpose of the system is to alert the pilot of the landing gear position--up for a water landing or down for a runway landing--when the airspeed decreased below a set threshold value. The pilot disabled the system by pulling its circuit breaker because the alerts were becoming a nuisance; he intended to reset the breaker during descent, but did not do so. Upon reaching the destination, the pilot set up a 150- to 200-feet-per-minute rate of descent for a glassy water landing on the lake. With the landing gear in the down position, the airplane contacted the water and abruptly nosed over. The airplane came to rest floating inverted, suspended by the floats. The pilot reported that the day of the accident was his nineteenth consecutive duty day, including office duty and flight duty. He stated that he feels the lack of days off during the previous 19 days was a contributing factor to this accident. When asked what would have prevented the accident, the pilot suggested consistency in using the checklist. On two flights earlier in the day he had used a written checklist; on the accident flight he did not.", "probable_cause": "The pilot's failure to retract the landing gear wheels prior to performing a water landing. Contributing to the accident were the pilot's disabling of the landing gear warning/advisory system and possible fatigue due to his work schedule."}