{"url": "https://www.baaa-acro.com/crash/crash-fokker-100-kupang", "date": "Dec 2, 2009 at 2215 LT", "type": "Fokker 100", "operator": "Merpati-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ujung Pandang - Kupang", "msn": "11474", "yom": 1993, "flight_number": "MZ5840", "city": "Kupang", "zone": "East Nusa Tenggara", "country": "Indonesia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 88, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 18776, "captain_hours_type": null, "copilot_hours": 7074, "copilot_hours_type": null, "aircraft_hours": 29637, "circumstances": "PK-MJD was on passenger schedule flight from Sultan Hasanuddin Airport, Makassar with destination El Tari Airport, Kupang, East Nusa Tenggara. The flight number was Merpati 5840 and carried 94 person on board consist of 88 passengers including four children and four infants, two pilot and four flight attendant. A maintenance engineer was on-board in this flight. Acting as pilot flying was the Second in Command (SIC) while the Pilot in Command acted as Pilot Monitoring. On approach, the pilot selected landing gear to down position. The left main landing gear indicator light was showed red, its means that the left main landing gear was not in down position and unsafe for landing. The pilot reported to the Air Traffic Controller (ATC) for a go-around and requested an area for holding to solve the problem. The ATC gave a clearance to hold over Kupang bay. The pilot tried to solve the problem by conducting the procedure according to the emergency checklist, including selected the landing gear by alternate selector. The pilot then requested to the ATC to fly at low altitude over the airport and asked to the ATC to observe the landing gear condition. The pilot also asked through the company radio for an engineer on-ground to observe visually the landing gear condition. The pilot then returned to the holding area, repeated the procedure but unsuccessful. Both pilots and engineer had a discussion and decided to attempt un-procedural method to make the landing gear down. Prior making these efforts the pilot announced to the passengers about the problem and their attempts that might be unpleasant to the passengers. After all attempts to lower the landing gear had failed, the pilot decided to land with the left main landing gear in up position. The pilot also asked the flight attendant to prepare for an abnormal landing. The ATC were prepared the airport fire fighting and ambulance, and also contacted the local police, armed forces, and hospitals and asking for additional ambulances. The ATC then informed the pilot that the ground support was ready. On short final the pilot instructed ‘brace for impact’ and the FA repeated that instruction to all passengers. The aircraft touched down at the touch down zone on runway 07. The pilot flying held the left wing as long as possible and kept the aircraft on the centre line, and the pilot monitoring shut down both engines. The aircraft stopped at about 1,200 meters from the beginning of runway 07, on the left shoulder of the runway and the FA instructed to the passengers to keep calm and to evacuate the aircraft. The pilot continued the procedures for emergency. The evacuation was performed through all door and window exits. No one was injured on this serious incident.", "probable_cause": "The debris trapped in the chamber between the orifice and the stopper of the restrictor check valve, it caused the orifice closed. This condition was resulted the hydraulic flow from the actuator blocked and caused the left main landing gear jammed at up position. \n"}