{"url": "https://www.baaa-acro.com/crash/crash-embraer-erj-190-100lr-yichun-44-killed", "date": "Aug 24, 2010 at 2138 LT", "type": "Embraer ERJ-190", "operator": "Henan%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Harbin - Yichun", "msn": "190-00223", "yom": 2008, "flight_number": "VD8387", "city": "Yichun", "zone": "Heilongjiang", "country": "China", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 91, "pax_fatalities": 44, "other_fatalities": 0, "total_fatalities": 44, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5109, "circumstances": "The crew started the approach in poor weather conditions with a visibility reduced at 2,800 metres. On short final, the aircraft was too low and the crew did not establish visual contact with the runway. The aircraft impacted ground 1,110 metres short of runway 30, slid and came to rest in flames 690 meters short of runway. 44 passengers were killed while the aircraft was destroyed by a post crash fire. First fatal accident involving an Embraer 190 and first accident at Yuchin Airport since it was open to traffic in 2009. ", "probable_cause": "- In violation of the airline's flight operation manual the captain attempted the approach to Yichun below required visibility. The airport reported 2800 meters of visibility while the manual required 3600 meters of visibility to begin the approach\r\n- In violation of regulations by the Civil Aviation Authority the crew descended below minimum descent altitude although the aircraft was operating in fog and visual contact with the runway had not been established\r\n- Despite the aural height announcements and despite not seeing the runway the crew continued the landing in the blind without initiating a go-around resulting in impact with terrain\r\nContributing factors were:\r\n- The airline's safety management is insufficient:\r\n* part of the flight crew arbitrarily implement the company's operations manual as the company does not follow up outstanding problems. Records suggest frequent deviations from approach profiles, i.e. deviation above or below glide slopes, excessive rates of descents and unstable approaches\r\n* crew rostering and crew cooperation: Each of the crew was flying into Yichun for the first time despite the known safety risks at the airport, the communication and cooperation within the crew was insufficient, the crew members did not monitor each other in order to reduce human errors\r\n* the airline's emergency training did not meet requirements, in particular the cabin crew training did not provide for hands on training on E190 cabin doors and overwing exits. Alternate means by the airline did prove ineffective and did not provide the quality China's Civil Aviation Authority requires thus leaving cabin crew unprepared to meet required cabin crew emergency response capabilities\r\n- Parent company's Shenzhen Airlines oversight insufficient\r\n* Shenzhen Airlines, after having taken over Henan Airlines in 2006, did not provide sufficient funding and technical support affecting the stability and safety of staff and quality management\r\n* Air China, holding stock into Shenzhen Airlines, installed a safety supervisor but failed to address the safety management issues with Shenzhen and Henan Airlines\r\n- No supervision by China's Civil Aviation Authority\r\n* the license to operate the flight from Harbin to Yichun was granted without route validation and without safety management in violation of regulations\r\n* to solve the lack of cabin crew flight attendants were certified although not meeting the relevant requirements for air transport operations\r\n* the regional office of the Civil Aviation Authority did not communicate to their superiors that they had approved the domestic operation of the route from Harbin to Yichun permitting non-standard procedures\r\n- China's Civil Aviation Authority safety management loopholes."}