{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-178-trammel-20-killed", "date": "Jul 28, 1943 at 2243 LT", "type": "Douglas DC-3", "operator": "American-Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Cleveland – Columbus – Dayton – Cincinnati – Louisville – Nashville – Memphis", "msn": "1552", "yom": 1936, "flight_number": "AA063", "city": "Trammel", "zone": "Kentucky", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 18, "pax_fatalities": 16, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": 4315, "captain_hours_type": 2700, "copilot_hours": 970, "copilot_hours_type": 238, "aircraft_hours": 17991, "circumstances": "Flight 63 originated at and left Cleveland about 5:42 p.m. EET cleared to Memphis on American's Route 22 with intermediate stops scheduled at Columbus, Dayton, Cincinnati, Louisville and Nashville. En route from Dayton to Cincinnati, the trip encountered adverse weather which, together with unreported Army traffic, made it seem advisable to return to Dayton. The situation at Cincinnati improved and after a delay of about 30 to 40 minutes the flight proceeded to Cincinnati end thence to Louisville, where it landed at 9:42 p.m. CWT2/. It was refueled and cleared to take off at 9:54 p.m. to fly at 4000 feet with estimated time of arrival at Nashville of 10:54 p.m. At 9:54 p.m., apparently just before take-off from Louisville, Captain Stiller requested Louisville to advise Nashville that he wanted to change his flight plan to proceed to Smiths Grove, Kentucky at 2500 feet. and continue to Nashville at 2000 feet. This change was subsequently approved by Nashville and relayed to the flight by Smiths Grove Airways Communications Station. (Smiths Grove is located on American Route 22, approximately 69 miles in a northeasterly direction from Nashville.) At approximately 10:22 p.m. when the flights about 15 miles northeast of Smiths Grove the following radio contact was made with the airways communication station at Smiths Grove: \"Route 22, trip 63 over Smiths Grove at 10 29 p.m. at 2500 feet.\" Although static interference made radio telephone communication impossible between the flight and American stations at Nashville or Louisville, this report as relayed to Nashville and Louisville via interphone by the Smiths Grove radio operator. At 10:28 p.m. the flight advised the Smiths Grove Station by radio of the presence of an aircraft approximately 3 miles south of Smiths Grove, flying at about 5000 feet. The station operator informed the flight that he -was aware of its presence and that it was an Army plane practicing on the Smiths Grove range. Acknowledgement of this information was the last message received from the flight. Shortly thereafter, when Flight 63 failed to report, there followed an intensive radio search by at least twenty radio communication stations. At about 1:00 a.m. July 29, the police at Trammel notified American at Nashville of the crash of Flight 63 at Trammel. (Trammel is on American Route 22, about 21 miles southeast of Smiths Grove.). Examination of the wreckage did not reveal any evidence whatsoever which would indicate any mechanical or structural failure of the aircraft in flight. Examination of both engines revealed that they were functioning normally at the time of impact. There was adequate fuel aboard. Inspection of the propellers disclosed settings of 23 1/2 degree on the left propeller and 24 degree on the right. It appears probable that these settings were indicative of the settings immediately prior to impact. The wreckage was found on the airway less than 2 miles from the \"on course\" signal of the Smiths Grove Radio Range. The rolling terrain of the locale varies from 695 to 720 feet above sea level. Examination of the wreckage and of marks and cuts on the ground and trees revealed that the aircraft, while level laterally and descending about 11 degree from horizontal, initially struck and cut a path through a small grove of trees, 35 feet in depth about 16 feet above the ground. It struck the ground approximately 85 feet beyond the point of first contact with the trees, continued on an almost straight course (221 degree) through another small clump of trees, then across an open field and stopped in an upright position among several larger trees, about 1000 feet beyond the point of first impact. Just prior to coming to rest, the right wing was sheared from the fuselage by impact with a large tree and it was found approximately 25 feet behind the fuselage.\r\nCrew: \r\nHarry A. Stiller, pilot,\r\nB. A. Carpenter, pilot,\r\nRobert M. McClure, copilot,\r\nJosephine Kane, stewardess.", "probable_cause": "Loss of control of the aircraft due to unusually severe turbulence and violent downdraft caused by a thunderstorm of unknown and unpredictable intensity.\n"}