{"url": "https://www.baaa-acro.com/crash/crash-iai-1124-westwind-near-el-devanador-7-killed", "date": "Feb 24, 2005 at 1537 LT", "type": "IAI 1124 Westwind", "operator": "Government%20of%20Colima", "flight_phase": "Flight", "flight_type": "Government", "survivors": "No", "site": "Mountains", "schedule": "Toluca - Colima", "msn": "279", "yom": 1979, "flight_number": null, "city": "El Devanador", "zone": "Michoacán", "country": "Mexico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 4350, "captain_hours_type": null, "copilot_hours": 6597, "copilot_hours_type": null, "aircraft_hours": 8523, "circumstances": "The aircraft departed Toluca Airport at 1516LT on a flight to Colima, carrying five members of the Colima Government and two pilots. Fifteen minutes into the flight, while cruising at an altitude of 16,000 feet, the crew informed ATC about control problems and was cleared to divert to Morelia Airport via radial 160. Shortly later, the aircraft entered an uncontrolled descent and crashed in a wooded and mountainous terrain located near El Devanador. The aircraft was totally destroyed and all seven occupants were killed. \r\nCrew:\r\nMario Torres, pilot,\r\nGermán Ascencio, copilot.\r\nPassengers:\r\nGustavo Vázquez Montes, Governor of the State of Colima, \r\nRoberto Preciado Cuevas, delegate secretary for Tourism, \r\nIgnacio Peralta, delegate secretary for Economy, \r\nLuis Barreda Cedillo, delegate secretary for Finances, \r\nGuillermo Díaz, Director of Tourism.", "probable_cause": "Sudden descent during cruise flight and loss of control of the aircraft due to flight control problems. The following findings were identified:\r\n- A possible failure of the horizontal stabilizer actuator,\r\n- A possible abrupt change in the attitude of the aircraft due to the position of the centre of gravity,\r\n- Possible improper crew actions to resolve the emergency,\r\n- A possible crew neglect of position and indication of flight controls."}