{"url": "https://www.baaa-acro.com/crash/crash-cessna-208-caravan-i-gransee-1-killed", "date": "Sep 11, 2019 at 1505 LT", "type": "Cessna 208A Caravan", "operator": "GoJump-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Gransee - Gransee", "msn": "208-0301", "yom": 1999, "flight_number": null, "city": "Gransee", "zone": "Brandenburg", "country": "Germany", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1553, "captain_hours_type": 288, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4066, "circumstances": "At 1448 hrs, the pilot took off from Gransee Special Airfield with the Cessna 208 Caravan to a commercial flight in accordance with visual flight rules. On board were the pilot and 15 skydivers, which were dropped at flight level 130. On this day, the pilot had already conducted three flights dropping skydivers with a total flight time of 48 min. After having dropped the skydivers during the fourth flight, the airplane was last captured by the radar at 1505:49 hrs, during approach to land at the airfield, close to the accident site at about 550 ft AMSL. At the time, ground speed was 168 kt and heading 330°. The Flugleiter  stated that he had observed the last phase of the approach. The airplane had been in a left-hand turn with a bank angle of up to 90° close to the ground. He assumed that the pilot might have “overshot” the extended centre line of runway 29 when he entered the final approach coming from the south. Then the airplane had vanished behind the trees. The pilot did not transmit an emergency call. The Flugleiter also stated that with the previous flight he had witnessed a similar manoeuvre. The radar recording of the third flight ended at 1417:54 hrs with a recorded altitude of about 1,400 ft AGL. At the time, ground speed was 168 kt and heading 355°. During both flights the skydivers had been dropped at flight level 130 at a heading of about 300° south of the airfield. After dropping the skydivers, at 1415:07 hrs and at 1502:52 hrs, respectively, the airplane entered a descent with a very high rate of descent and flew in a wide left-hand turn back to the airfield. During the third flight a right-left-hand turn with bank angles of about 50° to 60° occurred during descent. ", "probable_cause": "The air accident was due to a risky flight manoeuvre close to the ground which resulted in a controlled impact with the ground. The speed during the approach exceeded the operations limitations of the airplane. The approach was not stabilized.\r\nContributing Human Factors:\r\n- Recurrent acceptance of risky flight manoeuvres close to the ground by the pilot (routine violations),\r\n- Overconfidence and insufficient risk assessment of the pilot.\r\nContributing Operational Factors:\r\n- Unsuitable wording in the operations manual in regard to approaches after dropping skydivers."}