{"url": "https://www.baaa-acro.com/crash/crash-cessna-t207-skywagon-grand-canyon", "date": "Apr 13, 1990 at 1458 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Windrock Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Grand Canyon - Grand Canyon", "msn": "207-0062", "yom": 1969, "flight_number": null, "city": "Grand Canyon-National Park", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 555, "captain_hours_type": 9, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5325, "circumstances": "According to witnesses, the aircraft was about to touchdown from a normal approach to runway 21, when it encountered variable wind conditions and ballooned to about 70 feet agl. The pilot initiated a go-around. Shortly thereafter, witnesses observed a puff of smoke emanate from the aircraft, then the pilot transmitted that the flight was 'going down.' Subsequently, the aircraft collided with trees on wooded terrain about 1/2 mile from the departure end of the runway. An examination revealed a lack of power signatures on the propeller; evidence of sooting was found on the spark plugs (indicating a rich mixture). Testing of the turbo-controller revealed evidence that it had been adjusted to a low setting; the turbo would only produce a maximum air flow equal to high cruise power. The engine manufacturer reported that this situation could produce an over-rich mixture, particularly if the throttle and/or mixture controls were improperly manipulated. The pilot lacked experience in aircraft with turbocharged engines and he was not trained in accordance with the company training program. ", "probable_cause": "Improper adjustment of the turbocharger absolute pressure controller, and improper manipulation of the power plant controls by the pilot during the go-around. Factors related to the accident were: failure of company management to properly train the pilot in accordance with the approved company training program, and the pilot's lack of experience in turbocharged engine operations."}