{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-310-kudat-2-killed", "date": "Oct 10, 2013 at 1450 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "MASWings", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kota Kinabalu - Kudat", "msn": "804", "yom": 1983, "flight_number": "MWG3002", "city": "Kudat", "zone": "Sabah", "country": "Malaysia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 14, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4700, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 56828, "circumstances": "A de Havilland Canada DHC-6 Twin Otter 310, operated by MASwings, sustained substantial damage in an accident at Kudat Airport (KUD), Malaysia. The copilot and one passenger died, four others were injured. MASwings flight MH3002 operated on a domestic flight from Kota Kinabalu Airport (BKI) to Kudat. The captain was the pilot flying for this sector and the first officer was pilot monitoring. As the aircraft was approaching Kudat Airfield, Kudat Tower reported the weather conditions to be: wind at 270 degrees at 17 kts gusting 31 kts. The aircraft continued the approach on runway 04 and leveled off at 500 feet with flaps set at 10°. At this point the crew noticed that the approach for runway 04 had a strong tail wind. This was evident from the indicated airspeed observed by the crew which indicated 100 kts where the airspeed for flaps 10° should be 65kts. The windsock also indicated a tail wind. Noticing the approach for runway 04 was a tail wind condition, the crew decided to go around at a height of 500ft. Maintaining runway heading, the crew initiated a go around climbing to 1,000ft making a left tear drop and reposition for runway 22. On the approach for runway 22 the captain informed the first officer that if they could not land they would return to Kota Kinabalu. The aircraft was aligned with the centerline of runway 22 and 20° flaps was set. The aircraft continued to descend to 300ft. At this point the wind appeared to be calm as the aircraft did not experience any turbulence and the captain told the first officer that he was committed to land. Upon reaching 200ft the captain called for the flaps to be lowered to full down. As they were about to flare the aircraft to land, approximately 20ft above the runway, the aircraft was suddenly hit by a gust of wind which caused the aircraft to veer to the right with the right wing low and left wing high and the nose was pointing 45° to the right of runway 22. The crew decided to go around by applying maximum power; however the aircraft did not manage to climb successfully. The flaps were not raised and were still in the full flaps down position as the crew thought the aircraft was still low hence the flaps were not raised. The aircraft continued to veer to the right with right wing low and managed to only climb at a shallow rate. The aircraft failed to clear the approaching trees ahead and was unable to continue its climb because the airspeed was reducing. The presence of a full flaps configuration made it more difficult for the aircraft to climb. As the aircraft was on full power on both the engines, it continued to fly almost perpendicularly in relation to the runway and at a low height above the ground. The aircraft hit a tree top at the airfield perimeter fencing, disappeared behind the row of trees, hit another tree behind a house. It hit the right rear roof of the house, ploughed through the roof top of the kitchen, toilet and dining area, hit the solid concrete pillars of the car garage and finally hit the lamp post just outside the house fence. It swung back onto the direction of the runway and came to rest on the ground with its left engine still running. A woman and her 11-year old son who were in the living room at the time escaped unhurt.", "probable_cause": "Based on the information from the recorded statements of witnesses and Captain of the aircraft, it clearly indicates that the aircraft was attempting to land on Runway 04 with a tail-wind blowing at 270° 15kts gusting up to 25kts on the first approach, contrary to what was reported by the Captain to the investigators. The demonstrated cross wind landing on the DHC6-310 is 25kts and tailwind landing is 10kts. The aircraft was unsettled and unstable until it passed abeam the terminal building which was not the normal touch down point under normal landing condition. The flap setting on the first approach with the tail-wind condition was at 10°, which is not in accordance with company’s procedures. A tail wind landing condition that will satisfy the criteria for the DHC6-310 is not more than 10kts tail-wind and a flap setting of not more than 20°. One of the stabilized approach criterias for visual conditions (VMC) into Kudat is landing configuration must be completed by 500ft Above Ground Level (AGL) for the DHC6-310 where else if the above conditions could not be met, a go-around should be initiated. Hence, the Crew should have initiated a go-around earlier before the aircraft reached 500ft AGL on the first approach. The aircraft should be in the correct landing configuration at or below the stabilized approach altitude of 500ft AGL, since the aircraft was not stable due to the tail wind and gusting weather. The procedure carried out on the approach for Runway 04 was not consistent with MASwings’ Standard Operating Procedure (SOP) for a tailwind condition. Nonetheless, the first approach for Runway 04 though was uneventful. On the second approach from Runway 22, the wind condition was still not favorable for landing, and gusting. The aircraft was believed to be slightly low on the initial approach and was still unstable. The flap setting for the second approach for Runway 22 was at full flap (37°). As the wind was gusting, a flap setting to full-down should be avoided for the landing as stated in company’s DHC6-310 SOP. With the full-flap configuration, the aircraft had difficulty to settle down on the runway thus dragging the aircraft until abeam the tower which is way beyond the normal touch down zone. \r\nAt the point where the aircraft was approaching to land it was reported that the aircraft was hit by a sudden gust, several factors, including the following, have been looked into: \r\na) Why was the aircraft unable to climb after initiating the go-around?\r\nThe full flap setting would require a zero degree pitch attitude to ensure the aircraft speed is maintained. With go-around power set, the zero degree pitch would ensure a climb without speed loss. A pitch above zero degree can cause the aircraft speed to decrease and induce a stall condition resulting in the aircraft being unable to climb.\r\nb) Was the go-around technique executed correctly, taking into consideration that the wind was blowing from 270° and gusting?\r\nThe Captain had said that \"I applied maximum power and expected the aircraft to climb. At this point, the aircraft was still in left-wing high situation. I noticed the aircraft did make a climb but it was a shallow climb. I did not retract the flaps to 20°, as at that time, in my mind, the aircraft was still low.\"\r\nc) Under normal conditions, the rule of thumb for initiating a go-around procedure is to apply maximum power, set attitude to climb, confirm airspeed increasing and reduce the flap setting. This procedure was found not to be properly synchronized between MASwings Manuals and DHC6-310 Series 300 SOP.\r\nd) Were the pilots in control of the aircraft?\r\nBased on the Captain’s statement and other associated factors, the pilots were not in total control of the aircraft."}