{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-325-navajo-cr-dayton-1-killed", "date": "Jun 19, 1996 at 0810 LT", "type": "Piper PA-31-310 Navajo", "operator": "Hi Hat Leasing", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Berrien Springs - Dayton", "msn": "31-7612089", "yom": 1976, "flight_number": null, "city": "Dayton-Wright Brothers Memorial", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1198, "captain_hours_type": 701, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3252, "circumstances": "The parents of the pilot/owner stated that he arrived late in the afternoon prior to the accident. They stayed up with their son until approximately 0100 the morning of the accident. They stated that their son was a doctor and kept a busy schedule. The son told the parents that he had to fly back in order to have new fuel cells installed in the airplane and to work at his clinic. The pilot was airborne by 0700. The weather at his destination had low ceilings and fog restricting the visibility. The pilot was cleared by ATC to fly the localizer approach to the runway. The pilot called his position at the outer marker on the unicom frequency and no further transmissions were heard. Witnesses on the airport heard and saw the bottom of the airplane and stated that the airplane's engines sounded normal as it went overhead. Radar data showed that the airplane's altitude fluctuated and ground speed decreased significantly during the missed approach flight path. The airplane impacted the ground in approximately 40- degree nose-low, right wing down attitude. The toxicology report revealed 0.005 ug/ml Tetrahydrocannabinol (Marihuana) in the blood, and 0.013 ug/ml and 0.017 ug/ml Tetrahydrocannabinol Carboxylic Acid (Marihuana) in the blood and kidney fluid respectively. ", "probable_cause": "The pilot's impairment of judgment and performance due to drugs which led to spatial disorientation and a loss of aircraft control. The weather was a factor. "}