{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-31s-near-grammatiko-121-killed", "date": "Aug 14, 2005 at 1203 LT", "type": "Boeing 737-300", "operator": "Helios", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Larnaca – Athens – Prague", "msn": "29099", "yom": 1998, "flight_number": "ZU522", "city": "Grammatiko", "zone": "Attica / Αττική", "country": "Greece", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 115, "pax_fatalities": 115, "other_fatalities": 0, "total_fatalities": 121, "captain_hours": 16900, "captain_hours_type": 5500, "copilot_hours": 7549, "copilot_hours_type": 3991, "aircraft_hours": 17900, "circumstances": "On 14 August 2005, a Boeing 737-300 aircraft, registration number 5B-DBY, operated by Helios Airways, departed Larnaca, Cyprus at 06:07 h for Prague, Czech Republic, via Athens, Hellas. The aircraft was cleared to climb to FL340 and to proceed direct to RDS VOR. As the aircraft climbed through 16 000 ft, the Captain contacted the company Operations Centre and reported a Take-off Configuration Warning and an Equipment Cooling system problem. Several communications between the Captain and the Operations Centre took place in the next eight minutes concerning the above problems and ended as the aircraft climbed through 28 900 ft. Thereafter, there was no response to radio calls to the aircraft. During the climb, at an aircraft altitude of 18 200 ft, the passenger oxygen masks deployed in the cabin. The aircraft leveled off at FL340 and continued on its programmed route. At 07:21 h, the aircraft flew over the KEA VOR, then over the Athens International Airport, and subsequently entered the KEA VOR holding pattern at 07:38 h. At 08:24 h, during the sixth holding pattern, the Boeing 737 was intercepted by two F-16 aircraft of the Hellenic Air Force. One of the F-16 pilots observed the aircraft at close range and reported at 08:32 h that the Captain’s seat was vacant, the First Officer’s seat was occupied by someone who \r\n2 was slumped over the controls, the passenger oxygen masks were seen dangling and three motionless passengers were seen seated wearing oxygen masks in the cabin. No external damage or fire was noted and the aircraft was not responding to radio calls. At 08:49 h, he reported a person not wearing an oxygen mask entering the cockpit and occupying the Captain’s seat. The F-16 pilot tried to attract his attention without success. At 08:50 h, the left engine flamed out due to fuel depletion and the aircraft started descending. At 08:54 h, two MAYDAY messages were recorded on the CVR. At 09:00 h, the right engine also flamed out at an altitude of approximately 7 100 ft. The aircraft continued descending rapidly and impacted hilly terrain at 09:03 h in the vicinity of Grammatiko village, Hellas, approximately 33 km northwest of the Athens International Airport. The 115 passengers and 6 crew members on board were fatally injured. The aircraft\r\nwas destroyed.", "probable_cause": "Direct Causes:\r\n1. Non-recognition that the cabin pressurization mode selector was in the MAN (manual) position during the performance of the:\r\na) Preflight procedure;\r\nb) Before Start checklist; and\r\nc) After Takeoff checklist.\r\n2. Non-identification of the warnings and the reasons for the activation of the warnings (cabin altitude warning horn, passenger oxygen masks deployment indication, Master Caution), and continuation of the climb.\r\n3. Incapacitation of the flight crew due to hypoxia, resulting in continuation of the flight via the flight management computer and the autopilot, depletion of the fuel and engine flameout, and impact of the aircraft with the ground.\r\nLatent causes\r\n1. The Operator’s deficiencies in organization, quality management and safety culture, documented diachronically as findings in numerous audits.\r\n2. The Regulatory Authority’s diachronic inadequate execution of its oversight responsibilities to ensure the safety of operations of the airlines under its supervision and its inadequate responses to findings of deficiencies documented in numerous audits.\r\n3. Inadequate application of Crew Resource Management (CRM) principles by the flight crew.\r\n4. Ineffectiveness and inadequacy of measures taken by the manufacturer in response to previous pressurization incidents in the particular type of aircraft, both with regard to modifications to aircraft systems as well as to guidance to the crews.\r\nContributing Factors to the Accident:\r\n1. Omission of returning the pressurization mode selector to AUTO after unscheduled maintenance on the aircraft.\r\n2. Lack of specific procedures (on an international basis) for cabin crew procedures to address the situation of loss of pressurization, passenger oxygen masks deployment, and continuation of the aircraft ascent (climb). \r\n3. Ineffectiveness of international aviation authorities to enforce implementation of corrective action plans after relevant audits. "}