{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601b-lismore-1-killed", "date": "Mar 11, 1986 at 1659 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Coolangatta – Lismore", "msn": "61-0806-8062151", "yom": 1980, "flight_number": null, "city": "Lismore", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "When the aircraft arrived in the destination area, another aircraft was also in the circuit. The pilots were in communication with each other, and arranged that VH-CUO would land after the other aircraft. However, the pilot of VH-CUO apparently misjudged the relative speeds of the two aircraft. He initiated a go-around from a position on final approach to runway 15, when there was evidently insufficient separation with the preceding aircraft to allow a normal landing. The aircraft remained at a low height above the ground, and the pilot broadcast a message that he intended to land in the opposite direction, on runway 33. The wind at the time was from the south-east at about 10 knots. Witnesses observed the aircraft as it tracked along the western side of the runway. The turn onto base leg was made at an angle of bank of about 60 degrees, and about three-quarters of the way around the turn, the nose of the aircraft dropped rapidly. The aircraft then dived steeply to the ground, and was destroyed by the impact and subsequent fire.", "probable_cause": "The subsequent investigation did not reveal any defect or malfunction which might have affected the operation of the aircraft. The pilot was conducting an operation known as a \"bank run\", and there is pressure on pilots performing such runs to adhere to the prescribed schedules. The pilot's decision to perform a low level circuit and land downwind was considered to be related to his desire to arrive at the terminal as close as possible to the scheduled time. While conducting the circuit, the aircraft stalled during a turn at a height which was too low to allow the pilot to recover control before impact with the ground."}