{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-33a-manokwari", "date": "May 31, 2017 at 0851 LT", "type": "Boeing 737-300", "operator": "Sriwijaya-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ujung Pandang – Sorong – Manokwari", "msn": "24025/1556", "yom": 1988, "flight_number": "SJY570", "city": "Manokwari", "zone": "Special Region of West Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 146, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13371, "captain_hours_type": 3110, "copilot_hours": 5570, "copilot_hours_type": 2523, "aircraft_hours": 60996, "circumstances": "On 31 May 2017, a Boeing 737-300 aircraft registration PK-CJC was being operated by PT. Sriwijaya Air as a scheduled passenger flight from Hasanuddin Airport (WAHH), Makassar, South Sulawesi to Rendani Airport (WAUU), Manokwari, West Papua, with one transit stop at Domine Eduard Osok Airport (WASS) Sorong, West Papua. The flight was uneventful since the first departure from Makassar until commencing the approach at Manokwari. At 0815 LT (2315 UTC), the aircraft departed Sorong to Manokwari. On board in the flight were two pilots, four flight attendants and 146 passengers. On this flight, the Second in Command (SIC) acted as Pilot Flying (PF) and the Pilot in Command (PIC) acted as Pilot Monitoring (PM). At 2331 UTC, the pilot made first contact to Rendani Tower controller and informed that the aircraft was descending from FL 230 (altitude 23,000 feet) and requested the weather information. The Rendani Tower controller informed to the pilot that the wind was calm, ground visibility 6 km, cloud FEW CB 1,400 feet, temperature and dew point 26/25°C. At 2336 UTC, Rendani Tower controller instructed to the pilot to descend to 11,000 feet and to report when on Visual Meteorological Condition (VMC). At 2338 UTC, the pilot informed that they were on VMC condition and passed altitude 13,000 feet while position was 32 Nm from ZQ NDB (Non-Directional Beacon). Rendani Tower controller instructed to fly maintain on visual condition, fly via overhead, descend to circuit altitude, join right downwind runway 35, and to report when overhead Manokwari. At 2344 UTC, the pilot reported that the aircraft was over Manokwari and Rendani Tower controller informed to the pilot that the visibility changed to 5 km. Two minutes later Rendani Tower controller instructed to the pilot to continue approach and to report on right base runway 35. At 2349 UTC, at approximately 600 feet, the PIC as PM took over control by called “I have control” and the SIC replied “You have control”. A few seconds later the pilot reported that the aircraft was on final runway 35, and Rendani Tower controller instructed to the pilot to report when the runway 35 insight. The pilot immediately replied that the runway was in sight and acknowledged by Rendani Tower controller who then issued landing clearance with additional information that the wind was calm and the runway condition wet. At approximately 550 feet, the PIC instructed the SIC turn on the wiper and reconfirmed to SIC that the runway was in sight. Between altitude 500 feet to 200 feet, the EGPWS aural warnings “Sink Rate” and “Pull Up” sounded. At 2350 UTC, the aircraft touched down and rolled on runway 35. The spoiler deployed and the pilot activated the thrust reversers. The crew did not feel significant deceleration. The aircraft stopped at approximate 20 meters from the end of runway pavement. After the aircraft stopped, the PIC commanded “Evacuate” through the Passenger Address (PA) system. The Rendani Tower Controller saw that the aircraft was overrun and activated the crash bell then informed the Airport Rescue and Fire Fighting (ARFF) that there was an aircraft overrun after landing on runway 35. All the flight crew and passengers evacuated the aircraft and transported to the terminal building safely.", "probable_cause": "According to factual information during the investigation, the Komite Nasional Keselamatan Transportasi identified initial findings as follows:\r\n1. The aircraft was airworthy prior to the accident, there was no report or record of aircraft system abnormality during the flight. The aircraft had a valid Certificate of Airworthiness (C of A) and Certificate of Registration (C of R).\r\n2. The aircraft operator had a valid Air Operator Certificate (AOC) to conduct a scheduled passenger transport.\r\n3. The crew held valid licenses and medical certificates.\r\n4. The weather conditions during aircraft approach and landing was slight rain with cumulonimbus viewed nearby the airport, wind was calm and runway was wet.\r\n5. In this flight Second in Command (SIC) acted as Pilot Flying (PF) and the Pilot in Command (PIC) acted as Pilot Monitoring (PM). The PIC took over control from the SIC during approach at altitude approximately 600 feet.\r\n6. At approximate 550 feet, the PIC instructed the SIC to turn on the wiper and reconfirmed to SIC that the runway was in sight.\r\n7. Between altitude 500 feet to 200 feet, the EGPWS aural warnings “Sink Rate” and “Pull Up” sounded.\r\n8. The CCTV recorded water splash when aircraft on landing roll.\r\n9. Several area of the runway warp in approximate 2 - 5 meters square meters with standing waters on the runway of Rendani Airport.\r\n10. Several runway lights covered by grass with the height approximately of 30-40 cm.\r\n11. Rendani Aerodrome Manual (AM) as general guidelines in the airport operation had not been approved by the DGCA at the time of accident.\r\n12. Rendani Airport (WAUU), Fire fighting category III refer to AIP amended on April 2015."}