{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-ii-vieques-1-killed", "date": "Jul 8, 2000 at 0455 LT", "type": "Cessna 402", "operator": "M & N Aviation (1999)", "flight_phase": "Flight", "flight_type": "Postal (mail)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "San Juan - Christiansted", "msn": "402C-0221", "yom": 1979, "flight_number": null, "city": "Vieques", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2400, "captain_hours_type": 235, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13702, "circumstances": "After departure from San Juan, the pilot of N405MN contacted the FAA San Juan Approach Control, was identified on radar by the controller, and told to climb to 7,000 feet. About 1 minute later, the pilot is told to proceed direct to St. Croix. About 4 minutes later, the pilot requested radar vectors to St. Croix, and was told to fly heading 140 degrees. Radar data showed the flight leveled at the cruise altitude of 7,000 feet at about 0444. At about 0453:36, the pilot requested a lower altitude, and was cleared to 2,000 feet. The pilot acknowledged the clearance, and no further transmissions were received from the pilot. The flight began descent from 7,000 feet at about 0454. At 0454:29, the aircraft's transponder reports the flight is at 6,500 feet. At 0454:41, the transponder reports the flight is at 5,600 feet, and at 0454:49, at 4,000 feet. At 0454:53, the transponder reports the flight is at 1,100 feet. The flight is not observed on radar after this. No other aircraft or radar returns are observed near the flight as it began it's descent. One main landing gear tire, wheel, and brake assembly; the left wing lower skin from the area above the wing flap; the left wing baggage compartment door; the right nose baggage compartment door; the cabin floor cover; and some items from the U.S. mail cargo, were recovered floating in the ocean, at points north of the last observed radar contact with the airplane, on the day of the accident and in the days after the accident. The recovered components had damage from being separated from the airplane. None of the recovered components had any fire, heat, or soot damage. The remainder of the airplane was not located and recovered. The depth of the sea in the area of the accident site was reported by the Coast Guard to be about 6,000 feet. U.S. Post Office personnel reported the flight carried 1,517 pounds of U.S. mail. No hazardous materials were in the mail. A 75-pound pouch of mail was recovered from the ocean and identified as having been placed on N405MN. The weather at the time of the accident was reported to scattered clouds with visibility 10 miles.", "probable_cause": "The airplanes entry into an uncontrolled descent for undetermined reasons from which it crashed into the ocean."}