{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-la-fonda-ranch", "date": "Dec 15, 2006 at 2111 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Pescara Homes", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dallas-Fort Worth - La Fonda Ranch", "msn": "421B-0010", "yom": 1970, "flight_number": null, "city": "La Fonda Ranch", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7660, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The 7,660-hour airline transport rated pilot lost control of the twin-engine airplane while attempting to abort the landing. Dark night conditions prevailed for the attempted landing on runway 18. Runway 18 was reported to be 5,280-feet long, by 50 feet wide. The asphalt runway was reported to be dry and in good condition at the time of the accident. The pilot stated in the accident report (NTSB form 6120.1/2) that \"I saw the one row of lights on short final and my mind played a trick on me. I had the thought that I was off-course and that those lights were houses.\" The pilot delayed making the decision to execute a go-around and by the time he added power the airplane had touched down in the \"turnaround\" area to the right of the approach end of runway 18. During the inadvertent touchdown the airplane rolled to the left and the left propeller struck the ground, resulting in damage to the left engine. The pilot added that he elected to retard the right engine to avoid losing control of the airplane and the airplane impacted the ground to the left of the runway. The airplane came to rest in an area of small bushes and mesquite trees. The pilot was able to egress the airplane unassisted through the main cabin door, and was not injured. A post-impact fire developed and consumed the airplane. The pilot reported that he was familiar with the airport and had operated several airplanes in and out of that location. Weather reported at Del Rio International Airport, located approximately 11 miles north of the accident site, was clear skies, 3 miles visibility, with winds from 150 degrees at 5 knots, temperature of 70 degrees Fahrenheit, and an altimeter setting of 29.95 inches of Mercury. The pilot added that he was not aware that the first 5 or 6 runway lights on the left side of the runway (at the approach end) were out of service when he initiated the night landing approach.", "probable_cause": "The pilot's failure to maintain proper runway alignment on final approach and his delayed decision to execute a go-around. Factors were the dark night conditions and the inoperative runway edge lights."}