{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690a-near-mesa-6-killed", "date": "Nov 23, 2011 at 1831 LT", "type": "Rockwell Grand Commander 690", "operator": "Ponderosa%20Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Mesa - Safford", "msn": "690-11337", "yom": 1976, "flight_number": null, "city": "Mesa-Falcon Field", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 2500, "captain_hours_type": 951, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8188, "circumstances": "The aircraft was destroyed when it impacted terrain in the Superstition Mountains near Apache Junction, Arizona. The commercial pilot and the five passengers were fatally injured. The airplane was registered to Ponderosa Aviation, Inc. (PAI) and operated by PAI under the provisions of 14 Code of Federal Regulations (CFR) Part 91 as a personal flight. Night visual meteorological conditions (VMC) prevailed, and no flight plan was filed. The airplane had departed Falcon Field (FFZ), Mesa, Arizona, about 1825 and was destined for Safford Regional Airport (SAD), Safford, Arizona. PAI’s director of maintenance (DOM) and the director of operations (DO), who were co owners of PAI along with the president, conducted a personal flight from SAD to FFZ. The DO flew the leg from SAD to FFZ under visual flight rules (VFR) in night VMC. After arriving at FFZ and in preparation for the flight back to SAD, the DOM moved to the left front seat to act as the pilot flying. The airplane departed FFZ about 12 minutes after it arrived. According to a witness, engine start and taxi-out appeared normal. Review of the recorded communications between the pilot and the FFZ tower air traffic controllers revealed that when the pilot requested taxi clearance, he advised the ground controller that he was planning an \"eastbound departure.\" The flight was cleared for takeoff on runway 4R, and the pilot was instructed to maintain runway heading until advised, due to an inbound aircraft. About 90 seconds later, when the airplane was about 1.1 miles from the departure end of the runway, the tower local controller issued a \"right turn approved\" advisory to the flight, which the pilot acknowledged. Radar data revealed that the airplane flew the runway heading for about 1.5 miles then began a right turn toward SAD and climbed through an altitude of about 2,600 feet mean sea level (msl). About 1828, after it momentarily climbed to an altitude of 4,700 feet, the airplane descended to an altitude of 4,500 feet, where it remained and tracked in an essentially straight line until it impacted the mountain. The last radar return was received at 1830:56 and was approximately coincident with the impact location. The impact location was near the top of a steep mountain that projected to over 5,000 feet msl. Witnesses reported seeing a fireball, and law enforcement helicopters were dispatched. ", "probable_cause": "The pilot's failure to maintain a safe ground track and altitude combination for the moonless night visual flight rules flight, which resulted in controlled flight into terrain. Contributing to the accident were the pilot's complacency and lack of situational awareness and his failure to use air traffic control visual flight rules flight following or minimum safe altitude warning services. Also contributing to the accident was the airplane's lack of onboard terrain awareness and warning system equipment. "}