{"url": "https://www.baaa-acro.com/crash/crash-cessna-401b-salters-2-killed", "date": "Oct 4, 2017 at 1745 LT", "type": "Cessna 401", "operator": "Haddock Flying Service", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Salters - Salters", "msn": "401B-0004", "yom": 1969, "flight_number": null, "city": "Salters", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 15000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5557, "circumstances": "The commercial pilot and passenger departed on a local flight in the twin-engine airplane. According to a witness, the pilot took off from the private grass runway and departed the area for about 10 minutes. The airplane then returned to the airport, where the pilot performed a low pass over the runway and entered a steep climb followed by a roll. The airplane entered a nose-low descent, then briefly leveled off in an upright attitude before disappearing behind trees and subsequently impacting terrain. The pilot's toxicology testing was positive for ethanol with 0.185 gm/dl and 0.210 gm/dl in urine and cavity blood samples, respectively. The effects of ethanol are generally well understood; it significantly impairs pilot performance, even at very low levels. Federal Aviation Administration regulations prohibit any person from acting or attempting to act as a crewmember of a civil aircraft while having 0.040 gm/dl or more ethanol in the blood. While the identified ethanol may have come from sources other than ingestion, such as postmortem production, the possibility that the source of some of the ethanol was from ingestion and that pilot was impaired by the effects of ethanol during the accident flight could not be ruled out. Toxicology also identified a significant amount of diphenhydramine in cavity blood (0.122 µg/ml, which is within or above the therapeutic range of 0.0250 to 0.1120 µg/ml; diphenhydramine undergoes postmortem redistribution, and central postmortem levels may be about two to three times higher than peripheral or antemortem levels.). Diphenhydramine is a sedating antihistamine that causes more sedation than other antihistamines; this is the rationale for its use as a sleep aid. In a driving simulator study, a single dose of diphenhydramine impaired driving ability more than a blood alcohol concentration of 0.100%. The pilot had been diagnosed with memory loss about 8 months before the accident. It appears that he had some degree of mild cognitive impairment, but whether his cognitive impairment was severe enough to have contributed to the accident could not be determined from the available evidence. However, it is likely that the pilot's mild cognitive impairment combined with the psychoactive effects of diphenhydramine and possibly ethanol would have further decreased his cognitive functioning and contributed to his decision to attempt an aerobatic maneuver at low altitude in a non-aerobatic airplane.\n", "probable_cause": "The pilot's decision to attempt a low-altitude aerobatic maneuver in a non-aerobatic airplane, and his subsequent failure to maintain control of the airplane during the maneuver.\r\nContributing to the accident was the pilot's impairment by the effects of diphenhydramine use, and his underlying mild cognitive impairment."}