{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3t-turbo-otter-iliamna-3-killed", "date": "Sep 15, 2015 at 0606 LT", "type": "De Havilland DHC-3 Otter", "operator": "Rainbow-King-Lodge", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Iliamna - Swishak River", "msn": "61", "yom": 1954, "flight_number": null, "city": "Iliamna", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 11300, "captain_hours_type": 450, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15436, "circumstances": "On September 15, 2015, about 0606 Alaska daylight time, a single-engine, turbine-powered, float-equipped de Havilland DHC-3T (Otter) airplane, N928RK, impacted tundra-covered terrain just after takeoff from East Wind Lake, about 1 mile east of the Iliamna Airport, Iliamna, Alaska. Of the 10 people on board, three passengers died at the scene, the airline transport pilot and four passengers sustained serious injuries, and two passengers sustained minor injuries. The airplane sustained substantial damage. The airplane was registered to and operated by Rainbow King Lodge, Inc., Lemoore, California, as a visual flight rules other work use flight under the provisions of 14 Code of Federal Regulations (CFR) Part 91. Dark night, visual meteorological conditions existed at the departure point at the time of the accident, and no flight plan was filed for the flight. At the time of the accident, the airplane was en route to a remote fishing site on the Swishak River, about 75 miles northwest of Kodiak, Alaska. ", "probable_cause": "The pilot's decision to depart in dark night, visual meteorological conditions over water, which resulted in his subsequent spatial disorientation and loss of airplane control. Contributing to the accident was the pilot's failure to determine the airplane's actual preflight weight and balance and center of gravity (CG), which led to the airplane being loaded and operated outside of the weight and CG limits and to a subsequent aerodynamic stall.\n"}