{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-near-rostov-0", "date": "Jun 15, 2015 at 0754 LT", "type": "PZL-Mielec AN-2", "operator": "Vodoley", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "Yes", "site": "Plain, Valley", "schedule": null, "msn": "1G189-20", "yom": 1980, "flight_number": null, "city": "Rostov-on-Don", "zone": "Rostov oblast", "country": "Russia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10541, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9645, "circumstances": "The single engine aircraft was engaged in a crop spraying mission on behalf of the Mikhail Farm located in the Tatsinsky District of the Rostov Region. The aircraft was carrying 400 kilos of fuel, 1,200 liters of pesticides, one pilot and one boy aged 13, the son of the farmer. Few minutes after takeoff, while approaching the area to be treated at a height of about 20-25 metres and at a speed of 130 km/h, the engine failed. The aircraft lost height, collided with power cables and crashed in a field, bursting into flames. The wreckage was found 2 km from the Mikhail farmhouse. The pilot escaped unhurt while the boy was injured. The aircraft was totally destroyed by a post crash fire. ", "probable_cause": "The reason for the accident with An-2 RA-84553 was performing a flight in a known defective aircraft, leading to engine failure and the need for in-flight forced landing, during which there was a collision with power lines, followed by a rough landing that led to the structural failure and fire. Investigation to determine the cause of the engine failure was not possible due to the failure to ensure the safety of the aircraft after the accident and the absence of operational and technical documentation. The adoption of the decision by the pilot to reject takeoff after detecting a loss engine power on the takeoff could have prevented the accident. The aircraft did not have a valid Certificate of Airworthiness and the time between overhauls had been exceeded on 10 April 2015."}