{"url": "https://www.baaa-acro.com/crash/crash-vickers-701-viscount-liverpool-4-killed", "date": "Jul 20, 1965 at 1710 LT", "type": "Vickers Viscount", "operator": "Cambrian%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Douglas - Liverpool", "msn": "25", "yom": 1953, "flight_number": null, "city": "Liverpool-John Lennon (ex Speke)", "zone": "Merseyside", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 2, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 20694, "circumstances": "Viscount G-AMOL departed Ronaldsway at 16:49 for a flight to Liverpool. The flight was made at flight level 70 and at 17:08 hours the aircraft was identified by Liverpool radar over Wallasey and positioned for a PPI continuous descent radar approach to runway 26. Half a mile from touchdown the radar approach was completed and the aircraft was then seen (on radar) to be just discernibly to the right of the centreline. No radio messages were received from the aircraft after the start of the talk-down. At 550 metres from the threshold, it was estimated to be at a height between 30 and 60 metres and about 40 metres to the right of the centre line. At this point witnesses saw the aircraft bank and turn to the right. The fuselage was level and the aircraft was banked almost vertically for part of the turn. When heading in approximately the opposite direction to the runway it rolled on to its back and crashed into the roof of a factory about 365 metres to the right of the extended centre line of the runway and about 550 metres from the threshold. After penetrating the roof, the aircraft had struck a heavy steel girder which had caused it to tip \"tail-over-nose\". It had then come to rest the right way up on the floor of the workshop with the tail resting on the steel roof trusses. An intense fire broke out which consumed almost the whole structure of the fuselage. Both crew members and two employees of the factory were killed. ", "probable_cause": "The aircraft went out of control during the final stage of an approach to land but the reason for this has not been determined."}