{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-321c-manila-4-killed", "date": "Jul 25, 1971 at 1321 LT", "type": "Boeing 707", "operator": "Pan%20Am.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "San Francisco – Honolulu – Agana – Manille – Saigon", "msn": "19371/653", "yom": 1967, "flight_number": "PA6005", "city": "Manila", "zone": "Metro Manila", "country": "Philippines", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 17011, "captain_hours_type": 8248, "copilot_hours": 4577, "copilot_hours_type": 3277, "aircraft_hours": null, "circumstances": "Flight 6005 was a scheduled international cargo flight from San Francisco to Saigon with intermediate stops at Honolulu, Guam and Manila. The flight from San Francisco to Honolulu and Guam was uneventful. At 2125 hours GMT on 24 July 1971, the flight took off from Guam for Manila. Initial contact with the flight was established by Manila Control at 2400 hours and the controller provided the flight with the latest weather information for Manila. At 0013 hours the flight reported having passed Jamalig one minute before, being at 67 DME and out of FL 200. It was then handed over by Manila Control to Manila approach control. The approach controller cleared the flight to BA and provided the crew with the following weather information: wind 280°/20 kts, visibility 7 kms, light rain, cloud 3/8 at 4 000 ft and 8/8 at 9 000 ft. At 0018 hours the flight was cleared for a VOR/DME approach to Runway 24 from the Bangbang Intersection and one minute later the flight reported commencing the approach. At 0021 hours the flight reported 22 DME out of 5 000 ft for 4 000 ft and 20 seconds later reaching 4 200 ft. This was acknowledged by the controller who, thereafter was unable to establish contact with the flight. It was subsequently found that at approximately 0023 hours the aircraft collided with Mt Kamunay some 20 miles ENE of the Manila VOR, at an altitude of 2 525 ft. Witnesses residing near the scene of the accident testified that they had heard the sound of an aircraft which ceased in an explosion, followed by two other explosions, one immediately thereafter and the second one a little later. The aircraft was totally destroyed and all four crew members were killed. ", "probable_cause": "The Board determined that the probable cause of the accident was improper crew coordination which resulted in the premature descent of the aircraft. The aircraft was nearly 1 000 ft below the minimum required altitude of 7 000 ft at 23 DPB and apparently flew one segment ahead of the approved descent procedure. This was due to misinterpretation by the pilot-in-command of the equivocal statements of the co-pilot regarding the position of the aircraft and the flight profile to be followed. "}