{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-eagle", "date": "Jul 15, 2005 at 0930 LT", "type": "Learjet 35", "operator": "Aspen Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Aspen – Eagle", "msn": "35-207", "yom": 1979, "flight_number": null, "city": "Eagle County-FlyVail", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 29612, "captain_hours_type": 8967, "copilot_hours": 9433, "copilot_hours_type": 75, "aircraft_hours": 8234, "circumstances": "A witness saw the airplane approach from the east. She said that the airplane came in \"pretty fast\" and touched down \"approximately half way down the runway.\" The witness said, \"The nose was down. He hit the ground and within 3 seconds he was off the runway and gone. Then all you saw was smoke.\" The witness said when the airplane hit \"the front end shook. It wobbled like a kid on a tricycle. When it shook, it kind of looked like it [the airplane] bounced. Then it was gone.\" The control tower operator said he heard the captain say something over the radio, which caused him to look in the direction of the airplane. The tower operator saw the airplane off the runway, the main landing gear came off behind the airplane, and the airplane caught fire. The tower operator said he saw four people get out of the airplane. The airplane came to rest in a shallow ravine approximately 331 feet north of the runway. An examination of the airplane showed impact damage to the nose gear and nose gear wheel well. An examination of the airplane's systems revealed no anomalies.", "probable_cause": "The pilot's improper flare resulting in the hard landing and the fractured nose gear attachment, and the subsequent loss of control. Factors contributing to the accident were the high airspeed on approach, the pilot's improper in-flight planning/decision, and the pilot's inability to maintain directional control after the gear failure."}