{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-35-marquise-near-nome", "date": "Jan 5, 1993 at 2021 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Bering%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bethel - Nome", "msn": "584", "yom": 1973, "flight_number": null, "city": "Nome", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11150, "captain_hours_type": 512, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6725, "circumstances": "After making a refueling stop, the pilot took off at night and was cruising at FL200. After about 30 minutes of flight, the right engine fuel filter bypass warning light illuminated. About 2 minutes later, the same warning light for the left engine illuminated. Soon thereafter the right engine, then the left engine, lost power. The pilot made a forced landing on a moving ice pack in the Bering sea, which resulted in substantial damage. Ice was found in the engine and main fuel screens. Significant amounts of water and/or ice were found in 3 tanks, which had been refueled before takeoff. A higher than normal amount of water was also found in the fuel sample taken from the nozzle of the refueling tanker. The flight manual required that an approved ice inhibitor be added to the fuel, if not premixed. Fuel at the refueling stop was not premixed and the pilot had no icing inhibitor (prist) with him on this flight. He did not drain fuel from the tanks during preflight, since the temperature was so cold he feared the drain might freeze open.", "probable_cause": "Fuel starvation due to improper refueling procedures by the fbo personnel, inadequate preflight by the pilot, and resultant ice in the fuel, which blocked fuel flow to the engines. A factor was the lack of suitable terrain for a forced landing."}