{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-near-guabiruba-2-killed", "date": "Sep 25, 1995 at 1042 LT", "type": "Cessna 208B Grand Caravan", "operator": "TAM%20Brasil-2_0", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Florianópolis – Blumenau – Erexim", "msn": "208B-0414", "yom": 1994, "flight_number": null, "city": "Guabiruba", "zone": "Santa Catarina", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2631, "captain_hours_type": 271, "copilot_hours": 3105, "copilot_hours_type": 175, "aircraft_hours": null, "circumstances": "The single engine aircraft departed Florianópolis on a cargo flight to Erexim with an intermediate stop in Blumenau. En route, the crew was informed that weather conditions deteriorated in Blumenau so he decided to divert to Navegantes-Itajaí Airport. on ground, the crew was called by another company's crew that weather improved at Blumenau Airport. En route, while cruising at an altitude of 1,000 feet, the crew encountered poor visibility due to low stratus when the aircraft struck the slope of a mountain located near Guabiruba, about 30 km southeast of Blumenau Airport. Both pilots were killed. ", "probable_cause": "The following factors were reported:\r\n- The flight schedule to which the crew members were being subjected at the time they were operating in the company was contrary to Law 7.183 of 1984 and may have led them to chronic fatigue and stress conditions.\r\n- There are indications that psychological variables at the organizational level, with respect to flight scale, training, standardization and procedures of the company and the flight group contributed to the accident.\r\n- Throughout the operation, both crew members showed signs of anxiety, complacency, underestimation regarding the information received, motivation, change in perceptual synthesis, illusion and inattention.\r\n- The cloud base and visibility conditions made it difficult to navigate and identify the control points on the ground, as well as making it impossible to see the obstacles.\r\n- Insufficient planning has led to crew members failing to navigate and fly themselves.\r\n- The failure of the crew to judge in relation to continued flight in adverse weather conditions and below the limits set by the Rules of the Air (IMA 100-12) contributed to the accident.\r\n- There is evidence of the company's involvement in the investigation process, which did not give the crew the full technical conditions necessary for the flight to take place.\r\n- The failures committed on this flight indicate that at least one crew member failed to use the available navigation resources and the other failed to advise.\r\n- There was an influence of the visibility and ceiling conditions, as well as the physical environment, in relation to the similarity between the valleys of the Itajaí River and Itajaí Mirim. There is also evidence that conditions in the administrative-operational environment of the company and the group of pilots contributed to the difficulties the pilots faced.\r\n- The errors found imply failures of supervision in the flight schedule sector, with regard to compliance with the law, training and operations sector.\r\n- The crew had little experience as pilots in the company and on the route flown."}