{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-32-cerritos-79-killed", "date": "Aug 31, 1986 at 1152 LT", "type": "Douglas DC-9", "operator": "AeroMexico-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "City", "schedule": "Mexico City – Guadalajara – Loreto – Tijuana – Los Angeles", "msn": "47356", "yom": 1969, "flight_number": "AM498", "city": "Los Angeles", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 58, "pax_fatalities": 58, "other_fatalities": 15, "total_fatalities": 79, "captain_hours": 10641, "captain_hours_type": 4632, "copilot_hours": 1463, "copilot_hours_type": 1245, "aircraft_hours": null, "circumstances": "AeroMéxico flight AM498 was a scheduled passenger flight from Mexico City to Los Angeles with intermediate stops at Guadalajara, Loreto and Tijuana. The DC-9, named 'Hermosillo', departed Tijuana Airport at 11:20 and proceeded toward Los Angeles at FL100. At 11:44 Coast Approach Control cleared the flight to 7,000 feet. Just three minutes earlier Piper PA-28-181 Cherokee N4891F departed Torrance Airport, CA for a VFR flight to Big Bear, CA. On board were a pilot and two passengers. The Piper pilot turned to an easterly heading toward the Paradise VORTAC and entered the Terminal Control Area (TCA) without receiving clearance from ATC as required by FAR Part 91.90. At 11:47 the AeroMéxico pilot contacted LA Approach Control and reported level at 7,000 feet. The approach controller cleared flight 498 to depart Seal Beach on a heading of 320 degrees for the ILS runway \"two five left final approach course...\". At 11:51:04, the approach controller asked the flight to reduce its airspeed to 190 KIAS and cleared it to descend to 6,000 feet. At about 11:52:09, flight 498 and the Piper collided over Cerritos at an altitude of about 6,560 feet. The Piper struck the left hand side of the DC-9's horizontal and vertical stabilizer. The horizontal stabilizer sliced through the Piper's cabin following which it separated from the tailplane. Both planes tumbled down out of control. The wreckage and post impact fires destroyed five houses and damaged seven others. Fifteen persons on the ground were killed. The sky was clear, the reported visibility was 14 miles.", "probable_cause": "The limitations of the ATC system to provide collision protection, through both ATC procedures and automated redundancy. Factors contributing to the accident were:\r\n- The inadvertent and unauthorized entry of the PA-28 into the Los Angeles Terminal Control Area and\r\n- The limitations of the 'see and avoid' concept to ensure traffic separation under the conditions of the conflict."}