{"url": "https://www.baaa-acro.com/crash/crash-casa-212-aviocar-saskatoon-1-killed", "date": "Apr 1, 2011 at 1830 LT", "type": "Casa 212 Aviocar", "operator": "Fugro%20Airborne%20Surveys", "flight_phase": "Landing (descent or approach)", "flight_type": "Geographical / Geophysical / Scientific", "survivors": "Yes", "site": "City", "schedule": "Saskatoon - Saskatoon", "msn": "196", "yom": 1981, "flight_number": null, "city": "Saskatoon", "zone": "Saskatchewan", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7400, "captain_hours_type": 75, "copilot_hours": 7800, "copilot_hours_type": 1800, "aircraft_hours": 21292, "circumstances": "At 1503 Central Standard Time, the Construcciones Aeronauticas SA (CASA) C-212-CC40 (registration C-FDKM, serial number 196) operated by Fugro Aviation Canada Ltd., departed from Saskatoon/Diefenbaker International Airport, Saskatchewan, under visual flight rules for a geophysical survey flight to the east of Saskatoon. On board were 2 pilots and a survey equipment operator. At about 1814, the right engine lost power. The crew shut it down, carried out checklist procedures, and commenced an approach for Runway 27. When the flight was 3.5 nautical miles from the runway on final approach, the left engine lost power. The crew carried out a forced landing adjacent to Wanuskewin Road in Saskatoon. The aircraft impacted a concrete roadway noise abatement wall and was destroyed. The survey equipment operator sustained fatal injuries, the first officer sustained serious injuries, and the captain sustained minor injuries. No ELT signal was received. ", "probable_cause": "Conclusions \r\nFindings as to Causes and Contributing Factors:\r\n1. The right engine lost power when the intermediate spur gear on the torque sensor shaft failed. This resulted in loss of drive to the high-pressure engine-driven pump, fuel starvation, and immediate engine stoppage.  \r\n2. The ability of the left-hand No. 2 ejector pump to deliver fuel to the collector tank was compromised by foreign object debris (FOD) in the ejector pump nozzle. \r\n3. When the fuel level in the left collector tank decreased, the left fuel level warning light likely illuminated but was not noticed by the crew. \r\n4. The pilots did not execute the fuel level warning checklist because they did not perceive the illumination of the fuel level left tank warning light. Consequently, the fuel crossfeed valve remained closed and fuel from only the left wing was being supplied to the left engine. \r\n5. The left engine flamed out as a result of depletion of the collector tank and fuel starvation, and the crew had to make a forced landing resulting in an impact with a concrete noise abatement wall. \r\nFindings as to Risk:\r\n1. Depending on the combination of fuel level and bank angle in single-engine uncoordinated flight, the ejector pump system may not have the delivery capacity, when the No. 1 ejector inlet is exposed, to prevent eventual depletion of the collector tank when the engine is operated at full power. Depletion of the collector tank will result in engine power loss. \r\n2. The master caution annunciator does not flash; this leads to a risk that the the crew may not notice the illumination of an annunciator panel segment, in turn increasing the risk of them not taking action to correct the condition which activated the master caution. \r\n3. When cockpit voice and flight data recordings are not available to an investigation, this may preclude the identification and communication of safety deficiencies to advance transportation safety. \r\n4. Because the inlets of the ejector pumps are unscreened, there is a risk that FOD in the fuel tank may become lodged in an ejector nozzle and result in a decrease in the fuel delivery rate to the collector tank. \r\nOther Findings:\r\n1. The crew’s decision not to recover or jettison the birds immediately resulted in operation for an extended period with minimal climb performance. \r\n2. The composition and origin of the FOD, as well as how or when it had been introduced into the fuel tank, could not be determined. \r\n3. The SkyTrac system provided timely position information that would have assisted search and rescue personnel if position data had been required. \r\n4. Saskatoon police, firefighters, and paramedics responded rapidly to the accident and provided effective assistance to the survivors. "}