{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-whati-2-killed", "date": "Jan 30, 2019 at 0915 LT", "type": "Beechcraft 200 Super King Air", "operator": "Air%20Tindi", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Plain, Valley", "schedule": "Yellowknife – Whatì – Wekweèti – Ekati", "msn": "BB-268", "yom": 1977, "flight_number": "8T503", "city": "Whatì", "zone": "Northwest Territories", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2762, "captain_hours_type": 1712, "copilot_hours": 566, "copilot_hours_type": 330, "aircraft_hours": 20890, "circumstances": "At 0851 Mountain Standard Time on 30 January 2019, the Air Tindi Ltd. Beechcraft King Air 200 aircraft (registration C-GTUC, serial number BB-268) departed Yellowknife Airport (CYZF), Northwest Territories, as flight TIN503, on an instrument flight rules flight itinerary to Whatì Airport (CEM3), Northwest Territories, with 2 crew members on board. At 0912, as the aircraft began the approach to CEM3, it departed controlled flight during its initial descent from 12 000 feet above sea level, and impacted terrain approximately 21 nautical miles east-southeast of CEM3, at an elevation of 544 feet above sea level. The Canadian Mission Control Centre received a signal from the aircraft’s 406 MHz emergency locator transmitter and notified the Joint Rescue Coordination Centre in Trenton, Ontario. Search and rescue technicians arrived on site approximately 6 hours after the accident. The 2 flight crew members received fatal injuries on impact. The aircraft was destroyed.", "probable_cause": "Findings as to causes and contributing factors:\r\nThese are conditions, acts or safety deficiencies that were found to have caused or contributed to this occurrence.\r\n- For undetermined reasons, the left-side attitude indicator failed in flight.\r\n- Although just before take off the crew acknowledged that the right-side attitude indicator was not operative, they expected it to become operative at some point in the flight. As a result, they did not refer to the minimum equipment list, and departed into instrument meteorological conditions with an inoperative attitude indicator.\r\n- The crew’s threat and error management was not effective in mitigating the risk associated with the unserviceable right-side attitude indicator.\r\n- The crew’s crew resource management was not effective, resulting in a breakdown in verbal communication, a loss of situation awareness, and the aircraft entering an unsafe condition.\r\n- The captain did not have recent experience in flying partial panel. As a result, the remaining instruments were not used effectively and the aircraft departed controlled flight and entered a spiral dive.\r\n- The captain and first officer likely experienced spatial disorientation.\r\n- Once the aircraft emerged below the cloud layer at approximately 2000 feet above ground, the crew were unable to recover control of the aircraft in enough time and with enough altitude to avoid an impact with terrain.\n\r\nFindings as to risk:\r\nThese are conditions, unsafe acts or safety deficiencies that were found not to be a factor in this occurrence but could have adverse consequences in future occurrences.\r\n- If flight crews do not use the guidance material provided in the minimum equipment list when aircraft systems are unserviceable, there is a risk that the aircraft will be operated without systems that are critical to safe aircraft operation.\r\n- If flight crews do not use all available resources at their disposal, a loss in situation awareness can occur, which can increase the risk of an accident.\n\r\nOther findings:\r\nThese items could enhance safety, resolve an issue of controversy, or provide a data point for future safety studies.\r\n- A review of Air Tindi Ltd.'s pilot training program revealed that all regulatory requirements were being met or exceeded."}