{"url": "https://www.baaa-acro.com/crash/crash-vickers-804-viscount-jeuk-4-killed", "date": "Aug 20, 1965 at 1508 LT", "type": "Vickers Viscount", "operator": "LOT-2", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Plain, Valley", "schedule": "Lille – Wrocław", "msn": "249", "yom": 1957, "flight_number": null, "city": "Jeuk", "zone": "Limburg", "country": "Belgium", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 9816, "captain_hours_type": 1564, "copilot_hours": 11623, "copilot_hours_type": 1815, "aircraft_hours": 14087, "circumstances": "The flight was a non-scheduled international IFR flight from Lille, France to Wroclaw, Poland. The aircraft took off from Lille at 1240 hours GMT and was cleared to climb to FL 160 on a heading to \"Silly\". At 1242 hours the pilot contacted Brussels ACC and reported he was at 3 000 ft still climbing and estimating \"Silly\" at 1249 hours. At 1253 hours he reported over \"Silly\" at FL 120, and was cleared to climb and maintain FL 130. At 1254 hours the pilot called Brussels and reported he was at FL 130 and estimating \"Gatta\" at 1300 hours. Five minutes later he reported over \"Silly\" at FL 130 and estimating \"Olno\" at 1310 hours. As this was the second time the pilot mentioned \"Silly\" the radar controller checked his position and confirmed that the aircraft was in fact over \"Gatta\". At 1300 hours the radar controller directed his attention to Caravelle F-BJTQ which, after passing \"Gatta\" at 1256 hours on airway \"Green One\", was cleared to make a right turn on Luxembourg but requested permission to make a detour to avoid an area of intense storm activity. At 1311 hours Brussels ACC has no news of the Viscount which by then should have reported reaching \"Olno\". Attempts to make radio contact with the aircraft were unsuccessful, and no echo appeared on the radar scope in the vicinity of \"Olno\". No distress signal was recorded. While in cruising flight the aircraft had entered an area of bad weather, lost altitude and disintegrated in flight before crashing to the ground at 1308 hours GMT. All four crew members were killed. ", "probable_cause": "No evidence was found to explain why the aircraft left its cruising level. The overall atmospheric conditions in the vicinity of Jeuk and the circumstances of the accident were such that it was assumed that the pilot lost control of the aircraft when entering a cumulonimbus. It is possible - and even highly probable - that turbulence was a determining factor in the accident. "}