{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-carepa-5-killed", "date": "May 5, 2004 at 1300 LT", "type": "Swearingen SA227 Metro III", "operator": "Aerotransporte Petrolero", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bogotá – Carepa", "msn": "AC-676", "yom": 1987, "flight_number": null, "city": "Carepa", "zone": "Antioquia", "country": "Colombia", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 19335, "circumstances": "Following an uneventful flight from Bogotá-El Dorado Airport, the crew started the approach to Carepa-Los Cedros Airport, the copilot was the pilot-in-command. On final approach, the captain took over controls and continued the descent when the GPWS alarm sounded seven times. For unknown reasons, the captain failed to respond to this situation and did not proceed with any corrective actions. On short final, at a height of about 200 feet, one of the engine failed. The crew failed to follow the published procedures, causing the aircraft to stall and to crash about 100 metres short of runway 33. Two passengers were seriously injured while five other occupants were killed. ", "probable_cause": "The following findings were identified:\r\n- Poor judgement of distance, speed, altitude and the obstacle clearance during the final approach,\r\n- Attempting the operation beyond the experience and the high level of competence required by the crew,\r\n- Encountering unforeseen circumstances exceeded the capacity of the crew, \r\n- Diverting attention on the operation of the aircraft,\r\n- Lack of approved procedures, directives and instructions,\r\n- The absence of CRM procedures and low situational awareness,\r\n- The lack of evasive action when the ground proximity warning system's alarm sounded,\r\n- The sudden loss of power in one of the engines,\r\n- The wrong use of the world's major flight to maintain directional control,\r\n- The activation of the Stall Avoidance System (SAS) on the control column, moving it forward when the plane was at low altitude."}