{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-clearwater-2-killed", "date": "Aug 21, 2003 at 1648 LT", "type": "Piper PA-31-310 Navajo", "operator": "Clearwater Aircraft", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "City", "schedule": "Saint Augustine - Clearwater", "msn": "31-7712017", "yom": 1977, "flight_number": null, "city": "Clearwater Air Park", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 760, "captain_hours_type": null, "copilot_hours": 600, "copilot_hours_type": null, "aircraft_hours": 6019, "circumstances": "The airplane experienced an in-flight loss of control and crashed into a residential area. The flight departed VFR and when near the destination airport flew between areas with VIP Level 5 reflectivity. There was no record of a preflight weather briefing. The flight continued towards the destination airport and encountered lesser intensity reflectivity. An individual at the destination airport reported hearing an occupant of the airplane ask, \"...for an advisory for the field\", and \"...what the weather was like.\" The individual at the airport advised that the winds appeared to be in favor for runway 16, which was left hand traffic, the runway was wet, and the rain seemed to be letting up. There were no further communications from the accident aircraft. A pilot-rated witness located north of the destination airport, and nearly due west of the accident site reported seeing the airplane on what he thought was final approach to runway 16, but the airplane was \"very low.\" The witness reported the airplane made a, \"sudden, sharp turn to the left [flying eastbound].\" He then lost sight of the airplane and proceeded to the accident site. Another pilot-rated witness who was located in a vehicle approximately 1/4 mile west-northwest of the accident site reported observing an airplane flying from the northwest. The airplane banked to the left flying eastbound at a, \"...very slow airspeed and banking and yawing left and right.\" While flying eastbound it appeared to him that whomever was flying the airplane was executing a go-around as evidenced by the landing gear retracting, followed by the flaps. The airplane then appeared to climb which appeared very unstable, again yawing left and right. The airplane then banked to the right, stalled, and entered a spin impacting the ground. Still another witness who was located approximately 1/10th of a nautical mile east-southeast from the accident site reported he came out of his house after the rain ended and was facing west. He saw the accident airplane from the northwest and thought it had descended lower than normal. The airplane was flying above the tops of nearby trees and while flying in a southeasterly direction, pitched up, \"darn near got 90 degrees\", rolled to the left, and descended straight down. He reported that he did not hear the engines, and thought he should have been able to hear them if the pilot had \"revved them up.\" He estimated his view of the flight lasted approximately 10-15 seconds, and couldn't tell if the landing gear was extended. He did not see any smoke trailing the airplane, and after the impact he ran into his house, called 911, got into his car, and drove to the scene. He heard an explosion, and saw flames. He got to the airplane and helped rescue a passenger who was beating on the aircraft's door. The  airplane descended nearly vertical in a residential area and damaged trees approximately 30 feet above ground level. A post crash fire consumed the cockpit, cabin, portions of both wings, and portions of both engines. Examination of the flight controls, both engines, propellers, and propeller governors revealed no evidence of preimpact mechanical failure or malfunction. Accessories of both engines including the magnetos were destroyed by the post crash fire. Additionally, both servo fuel injectors were heat damaged which precluded bench testing. During disassembly of the right servo fuel injector, the hub stud was found separated from the hub at the fuel diaphragm. No determination was made whether this occurred during disassembly or occurred preimpact. No determination could be made as to who was operating the controls at the time of the accident.", "probable_cause": "The failure of the flightcrew to maintain airspeed (Vs) resulting in an inadvertent stall, uncontrolled descent, and in-flight collision with the ground."}