{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-12-denver-18-killed", "date": "Jul 11, 1961 at 1136 LT", "type": "Douglas DC-8", "operator": "United-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Philadelphia – Chicago – Omaha – Denver", "msn": "45307", "yom": 1961, "flight_number": "UA859", "city": "Denver-Stapleton", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 115, "pax_fatalities": 17, "other_fatalities": 1, "total_fatalities": 18, "captain_hours": 17631, "captain_hours_type": 168, "copilot_hours": 9839, "copilot_hours_type": null, "aircraft_hours": 124, "circumstances": "On July 11, 1961, at 1136 M.S.T., a United Air Lines DC-8 crashed during its landing roll at Stapleton Airfield, Denver, Colorado. None of the 122 occupants was severely injured as an immediate result of the impact; however, there were 16 passenger fatalities as a result of carbon monoxide poisoning when the aircraft burned. One other passenger, an elderly woman, broke both ankles during evacuation of the airplane and later succumbed to shock. In addition, the driver of a panel truck, which the aircraft struck after leaving the runway, also suffered fatal injuries. After experiencing hydraulic difficulties following takeoff from Omaha, Nebraska, the crew of N8040U continued the flight to Denver, using procedures set forth in the flight manual for abnormal hydraulic situations. When the flight arrived in the Denver area, preparations were made for landing. The ejectors were extended hydraulically, however, when an attempt was made to extend flaps to 25 degrees the hydraulic pressure dropped to zero. The hydraulic system selector was then placed in the No. 3 position (flap and gear downlock), and the approach was continued. After touchdown, the throttles were placed in the idle reverse thrust position and when power was applied, an uncontrollable deviation from the runway occurred.", "probable_cause": "The Board determines the probable cause of this accident was the asymmetric thrust which, during hydraulic emergency, resulted from the failure of the thrust reversers on engines Nos. 1 and 2 when reverse thrust was selected. A contributing factor was the failure of the first officer to monitor the thrust reverse indicator lights when applying reverse thrust."}