{"url": "https://www.baaa-acro.com/crash/crash-cessna-340-denver-4-killed", "date": "Mar 24, 2002 at 1631 LT", "type": "Cessna 340", "operator": "Lear 171", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Aspen – Gunnison – Denver", "msn": "340-0347", "yom": 1974, "flight_number": null, "city": "Denver-Centennial", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3563, "captain_hours_type": 560, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3977, "circumstances": "The pilot was flying a three leg IFR cross-country, and was on an ILS approach in IMC weather conditions for his final stop. Radar data indicated that the pilot had crossed the final approach fix inbound and was approximately 3 nm from the runway threshold when he transmitted that he had \"lost an engine.\" Radar data indicates that the airplane turned left approximately 180 degrees, and radar contact was lost. A witness said \"the airplane appeared to gain a slight amount of altitude before banking sharply to the left and nose diving into the ground just over the crest of the hill.\" Postimpact fuel consumption calculations suggest that there should have been 50 to 60 gallons of fuel onboard at the time of the accident. Displaced rubber O-ring seals on two Rulon seals in the left fuel valve and hydraulic pressure/deflection tests performed on an exemplar fuel valve suggest that the fuel selector valve was in the auxiliary position at the time of impact. The airplane's Owner's Manual states: \"The fuel selector valve handles should be turned to LEFT MAIN for the left engine and RIGHT MAIN for the right engine, during takeoff, landing, and all emergency operations.\" No preimpact engine or airframe anomalies, which might have affected the airplane's performance, were identified.", "probable_cause": "The pilot not following procedures/directives (flying a landing approach with the left fuel selector in the auxiliary position). Contributing factors were the loss of the left engine power due to fuel starvation, the pilot's failure to maintain aircraft control, and the subsequent inadvertent stall into terrain."}