{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-near-nyagan", "date": "Sep 18, 2013 at 1337 LT", "type": "PZL-Mielec AN-2", "operator": "Taks-Avia", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Surgut – Saranpaul – Arbyn – Surgut", "msn": "1G218-04", "yom": 1986, "flight_number": null, "city": "Nyagan", "zone": "Khantia-Mansia okrug", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5277, "circumstances": "The aircraft departed Surgut on September 12 on a special flight to Saranpaul and Arbyn, carrying two pilots and five employees of the Sosvapromgeologya Company. On September 18, the crew was supposed to fly back to Surgut but due to poor weather conditions, decided to fly to Nefteyugansk. About an hour and 10 minutes into the flight, while cruising at an altitude of 700 metres, the engine temperature increased to 305° C. and the oil temperature to 90° C. In the same time, the engine lost power. The crew decided to reduce his altitude and to attempt an emergency landing when the aircraft crash landed in a field located 48 km west of Nyagan. There was no fire. All seven occupants were injured and the aircraft was damaged beyond repair. ", "probable_cause": "Most probably the accident with An-2 RA-33017 aircraft was caused by usage of uncoordinated automative fuel not specified by valid aircraft maintenance engineering documentation with low octane grade, mechanical admixture (rusting) that resulted in cylinder-heads temperature increase beyond operating limits, engine power loss, unintentional flight altitude decrease and the need of an emergency landing on saturated terrain. \r\nThe contributing factors could be:\r\n- Unsatisfactory management of storage, refiling procedures and fuel quality inspection at Arbyn Airfield,\r\n- Incorrect PIC's decision to perform a flight after detection of deviation from standards in fuel quick drain (color, consistency, mechanical mixtures)."}