{"url": "https://www.baaa-acro.com/crash/crash-lockheed-pv-1-ventura-near-waynesboro-5-killed", "date": "Nov 20, 1954 at 1740 LT", "type": "Lockheed PV-1 Ventura", "operator": "Plymouth-Oil-Company", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Sinton – Baltimore", "msn": "5278", "yom": 1943, "flight_number": null, "city": "Waynesboro", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 7953, "captain_hours_type": 829, "copilot_hours": 400, "copilot_hours_type": 200, "aircraft_hours": 787, "circumstances": "N1505V departed Sinton, Texas, at 0845, on a VFR (Visual Flight Rules) non-stop flight to Baltimore, Maryland, with Pilot Arthur Hilton Soper, Copilot Joseph R. Kolodzie, and three passengers, all company executives. No flight plan was filed with CAA. Prior to departure, the pilot telephoned the forecaster at the nearest U. S. Weather Bureau Station, Corpus Christi, Texas, and was briefed on an route weather conditions. He was advised that the weather should remain suitable for VFR flight as far as Atlanta but beyond that point ceilings would probably lower. Pilot Soper said that if these conditions existed when he was near Atlanta he would land and refuel. A routine flight was made to Atlanta and the aircraft landed at 1313. The aircraft was on the ground approximately 2 hours and 25 minutes because ARTC (Air Route Traffic Control) could not clear the flight sooner due to traffic delays in the Washington area. During this period the pilot was briefed an en route weather and the aircraft was refueled with 208 gallons of 100 octane fuel. The aircraft departed Atlanta at 1535 for Baltimore on an IFR (Instrument Flight Rules) clearance. The clearance specified a cruising altitude of 11,000 feet over airways Green 6 and Red 77 to Lynchburg,, Virginia, Red 37 to Gordonsville, Virginia, and Red 33 and Red 17 to Baltimore. 2 At 1628, when in the vicinity of Spartanburg, South Carolina, the flight requested a change in altitude to at least 1,000 feet on top of clouds because icing conditions were being encountered. This necessitated a climb of approximately 5,000 feet which was immediately approved by ARTC. At 1708, Greensboro, North Carolina, radio received the following position report: \"N1505V on instrument flight rules 6 minutes northeast of Greensboro at 08 on top at 16,000 feet, request lower altitude, estimating Lynchburg at 22.\" Accordingly the aircraft was cleared to descend to and maintain 11,000 feet. At 1724 Lynchburg radio received a position report from N1505V, \"Over Lynchburg at 1722, at 11,000 feet, estimating Gordonsville at 38.\" The Lynchburg altimeter setting, 29.50 was given the flight and the flight's position report was relayed to Washington ARTC. A few ten later the following clearance was relayed to the flight, \"ARTC clears N1505V to cross Remington at 11,000, cross Arcola range station at 10,000, maintain 10,000.\" The 1628 Baltimore and Washington weather was then given as: Baltimore, scattered clouds 1,000 feet, estimated ceiling 7,000 feet, overcast; visibility 3 miles; light rain and haze, temperature 61; dewpoint 61. Washington, ceiling measured 8,500 feet, overcast; visibility 10 miles; light rain; temperature 60; dewpoint 57; wind east-northeast 16; pressure falling rapidly. The flight acknowledged this message at 1727 and cancelled its IFR flight plan, This was the last o contact with the aircraft. Approximately 13 minutes later it crashed on the mountainside and burned. All five occupants have been killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the pilot's failure to follow his original and approved course, and the letdown over mountainous terrain which resulted in the aircraft entering a cloud deck and striking the mountain during an attempt to regain a proper course. The following findings were reported:\r\n- There was no evidence indicating power or structural failure, malfunction. of controls or communication and navigation equipment prior to impact,\r\n- Had the flight continued on airways on an IFR flight plan at 11,000 feet to Gordonsville and then descended it would have established visual flight conditions and have been over low terrain,\r\n- The flight made a descent under instrument conditions to a low altitude after canceling the IFR clearance new Lynchburg."}