{"url": "https://www.baaa-acro.com/crash/crash-cessna-525-cj1-van-nuys-2-killed", "date": "Jan 12, 2007 at 1107 LT", "type": "Cessna 525 CitationJet CJ1", "operator": "Sun%20Quest%20Executive%20Air%20Charter", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "City", "schedule": "Van Nuys - Long Beach", "msn": "525-0149", "yom": 1996, "flight_number": null, "city": "Van Nuys", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 38000, "captain_hours_type": 800, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3001, "circumstances": "Line personnel reported that as the airplane was being fueled, the second pilot loaded more than one bag in the left front baggage compartment. With fueling complete, line personnel saw the second pilot pull the front left baggage door down, but not lock or latch it. Witnesses near midfield of the 8,001-foot long runway, reported that the airplane was airborne, and the front left baggage door was closed. Witnesses near the end of the runway, reported that the airplane was about 200 feet above ground level (agl) and they noted that the front left baggage door was open and standing straight up. All of the witnesses reported that the airplane turned slightly left, leveled off, and was slow. The airplane began to descend, and the wings were slightly rocking before it stalled, broke right, and collided with the terrain. Investigators found no anomalies with the airframe or engines that would have precluded normal operation. The forward baggage doors' design incorporates a key lock in the lower center of each door, and two latches in the left and right bottom section of the doors. There are two hinges in the upper left and right sections of the door. The handles latched the door to the door frame in the fuselage. The key would be in the horizontal position in an unlocked condition, and in the vertical position in a locked condition. The front left baggage door was found within the main wreckage debris field and had sustained mechanical and thermal damage. The key lock was in the horizontal position. Several instances of a baggage door opening in flight have been recorded in Cessna Citation airplanes. In some cases, the door separated, and in others it remained attached. The crews of these other airplanes returned to the airport and landed successfully.", "probable_cause": "The pilot's failure to maintain an adequate airspeed during the initial climb resulting in an inadvertent stall/spin. Contributing to the accident were the second pilots inadequate preflight, failure to properly secure the front baggage door, and the front left baggage door opening in flight, which likely distracted the first pilot."}