{"url": "https://www.baaa-acro.com/crash/crash-handley-page-hp81-hermes-iva-pithiviers", "date": "Jul 23, 1952 at 2325 LT", "type": "Handley Page H.P.81 Hermes", "operator": "Airworks-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Blackbushe – Luqa – Fāyid", "msn": "81/3", "yom": 1949, "flight_number": null, "city": "Pithiviers", "zone": "Loiret", "country": "France", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 68, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was performing a special flight from Blackbushe to Fāyid AFB in Egypt with an intermediate stop in Luqa, Malta, carrying 68 British soldiers and a crew of eight bound for Egypt to assist the troops after the coup done by General Nasser. For diplomatic reason, the aircraft was wearing the military WZ839 registration instead of the civil G-ALDB one. While flying south of Paris, the engine number four exploded. The propeller blades detached and hit the engine number three. In such conditions, the pilot-in-command reduced his altitude and attempted to divert to Pithiviers aerodrome for an emergency landing. Following a stable approach, the aircraft landed on a grassy runway and came to rest in flames. All 76 occupants were able to evacuate the cabin safely before the aircraft would be partially destroyed by fire. It is reported that some of the occupants were slightly injured. ", "probable_cause": "The exact cause of the explosion on the engine number four could not be determined with certainty. However, it was reported that several components (among them the reduction gear pinion bearing) of the engine number four failed in flight, causing the propeller to detach and the engine to partially disintegrate. "}