{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-kaminshak-bay-4-killed", "date": "Aug 21, 2010 at 1412 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Branch-River-Air-Service", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Swikshak Lagoon - King Salmon", "msn": "441", "yom": 1953, "flight_number": null, "city": "Kaminshak Bay", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 4112, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4946, "circumstances": "The commercial pilot departed a remote, oceanside lagoon in a float-equipped airplane with three passengers on an on-demand air taxi flight in reduced visibility and heavy rain. When the airplane did not reach its destination, the operator reported the airplane overdue. Extensive search-and-rescue efforts along the coast and inland failed to find the wreckage. After the search ended, small portions of the fragmented airplane washed ashore about 28 miles northeast of the departure lagoon. The remainder of wreckage has not been located despite sonar searches of the ocean near where the wreckage was found. A stowed tent and duffel bag, which were reported to be aboard the airplane, were also found ashore near the wreckage location. The tent and duffel bag exhibited evidence of exposure to a high temperature environment, such as a fire. However, there was no evidence indicating that the fire occurred in flight. The lack of soot on the undamaged areas of the items, as well as the very abrupt demarcation line between the damaged portion and the undamaged material, is consistent with these items floating in the water and being exposed to a fuel fire on the surface of the water, rather than having been exposed to a fire in the airplane’s cargo compartment. Due to the fragmentation of the recovered wreckage, it is likely that the airplane collided with ocean’s surface while in flight; however, because the engine and a majority of the wreckage have not been found, the sequence of events leading to the accident could not be determined. ", "probable_cause": "Undetermined. "}