{"url": "https://www.baaa-acro.com/crash/crash-handley-page-hp57-halifax-iii-ryhope-colliery-2-killed", "date": "Mar 31, 1944", "type": "Handley Page H.P.57 Halifax III", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Bombing", "survivors": "Yes", "site": "Plain, Valley", "schedule": null, "msn": null, "yom": null, "flight_number": null, "city": "Sunderland", "zone": "Tyne and Wear", "country": "United Kingdom", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 1, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Took off at 2214 from RAF Burn, to attack the city of Nuremburg. Part of a massive force of 795 aircraft - 572 Lancasters, 214 Halifaxes and 9 Mosquitoes. The most disastrous night of the war for Bomber Command, with the loss of 95 bombers. Halifax LK797 which the crew had named Excalibur was some 70 miles short of the target when attacked by a JU.88. The first burst of fire from the enemy made the intercommunication system useless. One engine was damaged when a Me410 joined in the fight. The bomber’s machine guns were out of action and the gunners were unable to return the fire. The fighters continued to attack the aircraft as it approached the target area and, in the confusion caused by the failure of the communications system at the height of the battle, a signal was misinterpreted and the navigator, air bomber and wireless operator baled out of the aircraft. F/O Barton faced a situation of dire peril. His aircraft was damaged, his navigational team had gone and he could not communicate with the remainder of the crew. If he continued his mission he would be at the mercy of hostile fighters when silhouetted against the fires in the target area and if he survived he would have to make a 4 1/2 hours journey home on three engines across heavily - defended territory. Determined to press home his attack at all costs, he flew on and, reaching the target, released the bombs himself. As F/O Barton turned for home the propeller of the damaged engine, which was vibrating badly, flew off. It was also discovered that two of the petrol tanks had suffered damage and were leaking. F/O Barton held to his course and, without navigational aids and in spite of strong head winds, successfully avoided the most dangerous defense areas on his route. Eventually he crossed the English coast only 90 miles north of his base. By this time the petrol supply was nearly exhausted. Before a suitable landing place could be found, the port engine stopped and the aircraft was now too low to be abandoned successfully. F/O. Barton therefore ordered the three remaining members of his crew to take up their crash positions, behind the main spar. Then, with only one engine working, he made a gallant attempt to land clear of the houses over which he was flying. On the decent despite strenuous efforts F/O Barton was unable to avoid an end of a row of cottages, one was demolished and the other slightly damaged. The Halifax crashed into the yard of Ryhope Colliery, on impact the rear fuselage broke off and landed in a deep railway cutting with the three crewmen inside. F/O. Barton died of his injuries, but as a result of his selfless actions, the three crewmen survived. Tragically a local miner Mr. George Heads, was killed on his way to work hit by flying debris.\nCrew (578th Squadron):\nF/O Cyril Joe Barton, pilot, †\nSgt Maurice E. Trousdale, flight engineer, \nSgt Leonard Lambert, navigator,\nP/O Jack Kay, wireless operator and air gunner, \nF/O G. G. Crate, air bomber,\nSgt H. C. H. D. Wood, air gunner\nSgt Fred Bryce, air gunner.\nCivilian: Mr. George Dodds Heads, aged 58, †.\nSource: www.aircrewremembered.com/barton-cyril.html", "probable_cause": "Shot down by fighter. "}