{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-233-tegucigalpa-5-killed", "date": "May 30, 2008 at 0940 LT", "type": "Airbus A320", "operator": "TACA-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Salvador – Tegucigalpa – Miami", "msn": "1374", "yom": 2000, "flight_number": "TA390", "city": "Tegucigalpa-Toncontin", "zone": "Francisco Morazán", "country": "Honduras", "region": "Central America", "crew_on_board": 6, "crew_fatalities": 1, "pax_on_board": 118, "pax_fatalities": 2, "other_fatalities": 2, "total_fatalities": 5, "captain_hours": 11899, "captain_hours_type": 8514, "copilot_hours": 1607, "copilot_hours_type": 250, "aircraft_hours": 21957, "circumstances": "A TACA Airlines Airbus A320, flight TA390, with Irish Registry EI-TAF, with 135 passengers and crew on board, overran at the end of the runway during landing at Tegucigalpa caused the deaths of three people on board and two on the ground. The government of Honduras delegated the conduct of investigation to the Salvadoran Civil Aviation Authorities, as provided for in Annex 13 to the Chicago Convention. In accordance with international agreements, France sent two investigators from the BEA (Bureau d'Enquêtes et d'Analyses), accompanied by five technical advisors from Airbus; United States sent two investigators from the NTSB (National Transportation Safety Board), accompanied by one advisor from FAA (Federal Aviation Administration) and one technical Advisor from IAE (International Aero Engine); and Ireland sent one investigator.  Both flight recorders (CVR and DFDR) were recovered and taken to the NTSB in order to perform the read out. The following data result from the analysis done by the BEA and Airbus of the accident recorders, which have been processed within the NTSB facilities under the leadership of the in-charge Authorities. It is confirmed that the aircraft was dispatched without any deferred MEL item. Prior to landing, the wind information given by the ATC to the crew was 190°/10kt and ATC also confirmed that the runway was wet. The Captain was the Pilot Flying (PF). Landing configuration was established with Slats/Flaps fully extended, gear down, ground spoilers armed, autobrake selected to MED. The aircraft landing weight was 63.5t (max landing weight 64.5t), Vapp 137kt. The aircraft was cleared to land on runway 02 and landed with Autopilot and Flight Directors OFF, and autothrust engaged in managed speed mode. At time of touch down, IAS was 139kt and Ground Speed (GS) was 159kt (estimated tailwind was 12kt from DFDR data analysis). The aircraft landed on runway 02 (Runway 02 is 3297 feet high and has a displaced threshold of 213m). The Landing Distance Available (LDA) for runway 02 is of 1649m. The touch down occurred at approximately 400m from the runway 02 displaced threshold. Immediately after touchdown, the crew selected MAX REV, and both engine reversers and the Ground Spoilers (G/S) deployed normally. The nosewheel touch down occurred 7s after the Main Landing Gear (MLG) following PF inputs. The crew applied manual braking 4s after MLG touch down and commanded maximum pedal braking in 10s (14s after MLG touch down). At 70 knots Indicated Airspeed Speed (IAS), upon Pilot Non Flying (PNF) call-out, the PF selected IDLE REV. The remaining distance to the runway end was approximately 190m. The aircraft overran the runway at 54kt and dropped down the 20 m embankment sustaining severe damage on impact with the ground. The landing performance analysis confirms that the landing performances are consistent with runway condition and crew actions. ", "probable_cause": "Contributing factors:\r\n- Wrong approach configuration, \r\n- Excessive speed upon landing, \r\n- The aircraft landed too far down the runway with a tailwind component,\r\n- On approach, the crew failed to recalculate the aircraft weight for landing and the landing distance,\r\n- The non precision approach was completed in poor weather conditions, which increased the cockpit crew workload,  \r\n- The absence of a stopping zone at the end of runway 02 contributed to the severity of the occurrence, \r\n- The runway surface was wet and not equipped with a water drainage system, which reduced the braking coefficient. "}