{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-18-bratislava-82-killed", "date": "Nov 24, 1966 at 1630 LT", "type": "Ilyushin II-18", "operator": "TABSO", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sofia - Budapest - Prague - Berlin", "msn": "184 0071 01", "yom": 1964, "flight_number": "LZ101", "city": "Bratislava-Ivanka-Milan Rastislav Štefánik", "zone": "Bratislava Region", "country": "Slovakia", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 74, "pax_fatalities": 74, "other_fatalities": 0, "total_fatalities": 82, "captain_hours": 11959, "captain_hours_type": 2002, "copilot_hours": 5979, "copilot_hours_type": 768, "aircraft_hours": null, "circumstances": "Flight LZ101 was a scheduled international air service from Sofia to Berlin with intermediate stops in Budapest and Prague. The four engine airplane departed Budapest-Ferihegy Airport at 1146LT bound for Prague, but en route, the crew was informed the airport of Prague-Ruzyne was closed to all traffic due to poor weather conditions. So the crew decided to divert to Bratislava-Ivanka Airport where he landed at 1258LT. About 1550 hours the pilot-in-command of the aircraft decided to resume his flight to Prague. He took off from Bratislava Airport at 1628:30. After take-off he made a turn to starboard according to the flight clearance with the instruction to perform a right turn on to the OKR Beacon, to climb only to 300 m and then to climb on to the NI beacon up to the flight level of 5 100 m. At 1630:20 hours the flight was requested to change to the ATC approach service frequency, 120.9 Mc/s. The crew confirmed reception of this message, but they did not carry out the retuning. Shortly afterwards the aircraft crashed into wooded ground in the mountains. The accident occurred 8 km away from the 31 runway threshold of Bratislava Airport at an altitude of 420 m above MSL, i.e. 288 m above the airport level. The aircraft was totally destroyed and none of the 82 occupants survived the crash. ", "probable_cause": "The Commission could not definitely establish the cause of accident. The Commission assumed that the most probable cause of the accident was insufficient evaluation of terrain relief and weather conditions in the Bratislava Airport control zone by the aircraft crew and lack of adaptation of the flight to these conditions. There are serious reasons to doubt whether the crew thoroughly evaluated the geographical and meteorological situation and drew from this evaluation the necessary conclusions in choosing the take-off runway, in accepting the flight clearance and in performing the takeoff and the departure by making a turn to the starboard on to the OKR beacon. The possibility must be admitted that the non-maintenance of the 15° bank and the 400 km/h speed (or the lowest possible limit of 360 km/h), which non-maintenance had a causal connexion with the accident, could be partly due also to errors in controlling and navigating the aircraft. "}