{"url": "https://www.baaa-acro.com/crash/crash-junkers-f13ge-meopham-6-killed", "date": "Jul 21, 1930 at 1435 LT", "type": "Junkers F.13", "operator": "Walcot Air Line", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Le Touquet – Croydon", "msn": "2052", "yom": 1930, "flight_number": null, "city": "Meopham", "zone": "Kent", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Le Touquet on a taxi flight to Croydon, carrying four passengers and a crew of two. While cruising above Kent, the single engine airplane entered an uncontrolled descent and crashed in a near vertical attitude in a private garden located in Meopham, some five miles south of Gravesend. The aircraft was destroyed and all six occupants were killed.\r\nCrew:\r\nGeorge Lochart Henderson, pilot\r\nCharles d'Urban Shearing, copilot.\r\nPassengers: \r\nMr. Frederick Temple Hamilton-Temple-Blackwood, 3rd Marquess of Dufferin and Ava,\r\nMrs. Rosemary Millicent Sutherland-Leveson-Gower, Viscountess Ednam,\r\nMr. Edward Simons Ward,\r\nMrs. Sigrid Loeffler. ", "probable_cause": "The Head of the Aeronautical Research Commission (ACR) Major Cooper believes that  the lost of the cover of the engine might well be the reason for the accident. An aeronautical research committee attributed the crash to buffeting, or irregular oscillation, of the horizontal stabilizer of G-AAZK. This condition itself apparently resulted from wake ‘eddies’ produced by air flowing over the relatively thick main wing of the Junkers. Ultimately, the oscillation led to the separation of the port stabilizer/elevator assembly, then the entire empennage, after which the port wing broke off and the nose/power plant section separated. The Germans on the other hand discounted this theory and seemed to imply that the crash may have been due to pilot error and/or the weather conditions."}