{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950-paiaka-1-killed", "date": "Dec 23, 2001 at 1430 LT", "type": "Fletcher FU-24", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Mountains", "schedule": "Paiaka - Paiaka", "msn": "236", "yom": 1977, "flight_number": null, "city": "Paiaka", "zone": "Northland Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1516, "captain_hours_type": 1262, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the morning of Sunday 23 December 2001, the pilot was engaged in spreading superphosphate on a property near Otonga. When this job was completed the operation moved to a property to the east of Whangarei where urea was sown on a maize crop. This job finished at about 1130 hours when the pilot and loader driver decided to have a cup of tea and determine which job they would do next. There were two options available; it was found that the wind was unsuitable for operations from one airstrip, so it was decided to complete the job at Paiaka, which involved spreading some 112 tonnes of lime. This particular job was to have commenced on 13 December 2001 but was delayed because of wind. The loader driver arrived at Paiaka at about 1300 hours to find that the pilot had already landed and was removing the cover from the fertiliser bin that held the lime. The loader driver noticed that water had come under the edges of the cover making the lime damp around the walls of the bin. The truck driver who had delivered lime earlier in the week had also noted the presence of moisture in the lime around the edges of the bin. The work commenced at about 1320 hours and the loader driver expected the pilot to stop for fuel between 1445 and 1500 hours. After approximately 13 loads the loader driver was using the lime that had been affected by moisture. As a result he took bucket loads from the sides of the bin and mixed it with the lime in the middle of the bin in an effort to make the lime flow more freely. At approximately 1425 the pilot gave the signal to the loader driver for a refuel on the next landing. As this was earlier than the expected refuel time the loader driver assumed this was also to check if any lime was building up around the bottom of the hopper. During the 10 weeks that they had been operating the aircraft they had to clean fertiliser away from the hopper door area. This had happened several times, especially if the fertiliser was damp, and on one occasion they had to clean out part of a previous fertiliser load that had “hung up” inside the hopper.  As the loader driver was preparing for the refuel he could hear the aeroplane operating under what sounded like full power, and saw the pilot manoeuvre the aircraft in an apparent attempt to dislodge the load. He saw a small “puff” of lime discharge from the aircraft as it was “bunted”. The aircraft then disappeared behind intervening terrain into a valley, some 1,500 metres from the sowing area. The loader driver did not see the aeroplane again, but heard a muffled explosion and saw smoke on the skyline. He then phoned for emergency assistance. The accident occurred in daylight, at approximately 1430 hours NZDT, at Paiaka, at an elevation of 720 feet. Grid reference 260-Q06-142267, latitude S 35° 33 2', longitude E 174° 08.3'. ", "probable_cause": "Conclusions:\r\n- The pilot was appropriately licensed, rated and fit for the flights undertaken.\r\n- The aircraft had a valid Airworthiness Certificate and had been maintained in accordance with current requirements.\r\n- The possibility of a pre-existing defect with the aircraft or engine that could have contributed to the accident was eliminated as far as practicable by the investigation.\r\n- The pilot was aware that water had affected the lime that he was using.\r\n- The pilot encountered a “hung load” of lime, probably resulting from the damp product bridging over the hopper doors, and despite bunting manoeuvres, he was unable to discharge the hopper contents.\r\n- The aircraft entered a valley system from which there was no means of escape, either by climbing or by carrying out a reversal turn. "}