{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-denver-1-killed", "date": "Mar 26, 2001 at 0719 LT", "type": "Socata TBM-700", "operator": "Technical Leasing", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Denver – Santa Monica", "msn": "82", "yom": 1993, "flight_number": null, "city": "Denver-Centennial", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1024, "captain_hours_type": 136, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5139, "circumstances": "The airplane was fueled to capacity and placed in a heated hangar about one hour before departure. The instrument rated pilot obtained a weather briefing, filed an IFR flight plan, and obtained an IFR clearance. Low ceiling, reduced visibility, and ice fog prevented control tower personnel from observing the takeoff. Radar (NTAP) and on-board GPS data indicated the airplane began drifting to the left of runway centerline almost immediately after takeoff. The airplane made a climbing left turn, achieving a maximum altitude of 7,072 feet and completing 217 degrees of turn, before beginning a descending left turn. The airplane impacted terrain on airport property. Autopsy/toxicology protocols were unremarkable. There was no evidence of preimpact failure/malfunction of the airframe, powerplant, propeller, or flight controls. The autopilot and servos, pitot-static system, and flight instruments were tested and all functioned satisfactorily. The pilot's shoulder harness was found attached to the seatbelt, but the male end of the seatbelt buckle was broken.", "probable_cause": "The pilot's spatial disorientation, which led to his failure to maintain aircraft control. A contributing factor was the pilot's decision to intentionally fly into known adverse weather that consisted of low ceilings, obscuration, and ice fog."}