{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-4-stanleyville-6-killed", "date": "Nov 29, 1964 at 1920 LT", "type": "Douglas DC-4", "operator": "Air%20Congo", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Stanleyville – Kamina", "msn": "18384", "yom": 1944, "flight_number": null, "city": "Kisangani", "zone": "Orientale", "country": "Democratic Republic of Congo", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 11, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 14000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 48113, "circumstances": "The aircraft,was chartered by Air Congo and was carrying out a non-scheduled domestic flight Kamina - Stanleyville (now Kisangani) - Kamina. Eleven passengers embarked at Stanleyville and the aircraft started its take-off run at 1920 hours local time. After approximately 900 m the pilot suddenly saw, in the darkness, an empty fuel drum on the runway. In an attempt to avoid it, he veered left by braking violently on the left wheels. In spite of this manoeuvre, the nose wheel hit the drum. The forward part of the aircraft was lifted off the ground, aided perhaps by the pilot's manoeuvre in attempting take-off. By that time, the aircraft had attained a speed at which take-off would have been possible under normal conditions. Unfortunately, following the shock the drum bounced, fell back on the runway, bounced again and the aircraft in a nose high attitude caught the drum with the right stabilizer. Part of the stabilizer was torn away and fell on to the runway while the drum was tossed on to the edge of the clearway. The aircraft continued further, now deflected to the right by the unbalanced right stabilizer, which was probably completely distorted. The crew immediately retracted the landing gear. After being airborne about 500 m, the aircraft, out of vertical control, dived into the clearway at an angle of about 300, bounced up, fell back 50 m farther, skidded on its belly and finally came to a stop after a swing of 900 to the right. During that swing, the passengers in the rear of the cabin were thrown out of the aircraft through the torn-off cargo door and through the open cabin door. Fire broke out immediately after the aircraft came to a stop. The accident occurred on the north clearway of runway 28, about 150 m from the runway end. All three crew members and three passengers were killed, eight other occupants were injured. The airplane was totally destroyed by fire. ", "probable_cause": "The accident was brought about by impact with a fuel drum which caused partial destruction of the.right elevator, thus rendering the aircraft uncontrollable in flight. "}