{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-620-cheyenne-ii-munich-9-killed", "date": "Aug 11, 1987 at 1528 LT", "type": "Piper PA-31 Cheyenne", "operator": "Lechmetall Landsberg", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "City", "schedule": "Landsberg - Munich", "msn": "31-8020009", "yom": 1980, "flight_number": null, "city": "Munich", "zone": "Bavaria", "country": "Germany", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 6, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Landsberg-Penzing Airport on a training flight to Munich, carrying one passenger (a secretary of the Southern Bavarian Air Office), one instructor and one pilot. On final approach to Munich-Riem Airport runway 07, at an altitude of 200 feet, the instructor decided to reduce the power on the right engine while the pilot was expecting to initiate a go-around procedure according to the training program. He elected to add power on the left engine but the aircraft lost height, struck the roof of a McDonald's restaurant located in the district of Trudering and eventually crashed in flames on a bus. The aircraft, the restaurant, the bus and several other vehicles were destroyed and seven people were killed, all three occupants in the aircraft and four passengers in the bus. Few days later, two other victims died from their injuries. 30 other people were injured, some of them seriously. ", "probable_cause": "It was determined that the instructor's decision to reduce power was taken at a critical stage of flight because the aircraft was approaching at a too low altitude of 200 feet and flying vertical to a populated area. Also, the pilot was expecting to initiate a go-around according to the training program. "}