{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-greenwood", "date": "Nov 17, 2012 at 1145 LT", "type": "Cessna 550 Citation II", "operator": "Stevens%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Greenwood - Greenwood", "msn": "550-0673", "yom": 1991, "flight_number": null, "city": "Greenwood", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11592, "captain_hours_type": 903, "copilot_hours": 4501, "copilot_hours_type": 13, "aircraft_hours": 8611, "circumstances": "The aircraft, registered to the United States Customs Service, and operated by Stevens Aviation, Inc., was substantially damaged during collision with a deer after landing on Runway 9 at Greenwood County Airport (GRD), Greenwood, South Carolina. The airplane was subsequently consumed by postcrash fire. The two certificated airline transport pilots were not injured. Visual meteorological conditions prevailed, and no flight plan was filed for the maintenance test flight, which was conducted under the provisions of Title 14 Code of Federal Regulations Part 91. According to the pilot, the purpose of the flight was to conduct a test of the autopilot and flight director systems on board the airplane, following a \"cockpit modernization\" their company had performed. The airplane completed the NDB/GPS RWY 27 instrument approach procedure and then circled to land on Runway 9. About 5 seconds into the landing rollout, a deer appeared from the wood line and ran into the path of the airplane. The deer struck the airplane at the leading edge of the left wing above the left main landing gear, and ruptured an adjacent fuel cell. The pilot was able to maintain directional control, and the airplane was stopped on the runway, spilling fuel and on fire. The crew performed an emergency shutdown of the airplane and egressed without injury.Greenwood County Airport did not have a fire station co-located on the airport facility. The fixed base operator called 911 at the time of the accident, and the fire trucks arrived approximately 10 minutes after notification.", "probable_cause": "Collision with a deer during the landing roll, which resulted in a compromised fuel tank and a postimpact fire. In a telephone interview, the manager of the Greenwood County Airport explained that Greenwood was not an FAR Part 139 Airport, and while there was no published Wildlife Management Program for the airport, she had been very proactive about eradicating wildlife that could pose a hazard to safety on the airport property, primarily deer and wild turkey. She contacted the United States Department of Agriculture (USDA) for guidance and advice and she attended a wildlife management course. Among the suggestions offered by the USDA, was to remove the deer habitat. The manager proposed adding the area between the runway and taxiway to an approach clearing project in order to reduce the habitat. The manager worked with a local charity and local hunters with depredation permits to take deer on the airport property, and their efforts averaged 50 deer a year. The hunts were conducted in stands away from runways and on property not aviation related. The nearest deer stand was 1 mile from the runway, and the hunters fired only shotguns. The hunts were conducted between the hours of 0700 and 1000. On the morning of the accident, the last shot was fired at 0930.When asked why the hunters were still on the property at the time of the accident, the manager said they had stayed to eat lunch, and repeated that the hunt was long over and that the last shot was fired hours before the accident. She offered that the deer struck by the airplane was probably flushed from the woods by another deer or a coyote, whose population has also grown in recent years.After the accident, the Federal Aviation Administration contacted the state and had the Greenwood County Airport added to a list of airports where funding for improvements had been allotted. A second 10-foot perimeter fence was added around the existing 6-foot fence, and since its construction only 4 deer have been taken inside the perimeter, and no wild turkeys have been sighted"}