{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-chittenden-2-killed", "date": "Jan 25, 2002 at 1710 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Timothy A. Patrick", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Johnstown – Rutland", "msn": "61-0404-141", "yom": 1977, "flight_number": null, "city": "Chittenden", "zone": "Vermont", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1000, "captain_hours_type": 250, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1780, "circumstances": "The airplane collided with mountainous terrain during approach to the destination airport. While approaching the airport, the pilot requested vectors for a localizer approach to runway 19. Due to traffic, air traffic control (ATC) issued the pilot a holding clearance. The airplane was approaching the holding fix about 8,000 feet, when the pilot advised ATC that the airplane was picking up a little ice. ATC initially offered an amended clearance of 9,000 feet, but the pilot declined. Subsequently, he accepted the clearance and climbed back to 9,000 feet. ATC then told the pilot that after one more airplane had landed, he would be issued an approach clearance. The airplane was about 9,200 feet when the pilot replied \"thank you.\" Review of radar data revealed that the accident airplane made one complete 360-degree turn, and one 270-degree turn on the non-holding side of the published holding pattern. During the two turns, the airplane descended to approximately 8,400 feet, climbed to 8,900 feet, then descended again to 8,300 feet. The two turns were tighter than the expected standard 2-minute turns in a holding pattern, with radii ranging from 0.3 to 0.4 nautical miles and 0.1 to 0.2 nautical miles respectively. Following the two holding turns, no more radio transmissions or radar returns were received by ATC. Examination of the wreckage did not reveal any preimpact mechanical malfunctions. Another pilot flying in the area reported moderate rime ice at 8,000 feet, but added that he climbed out of the ice and was between cloud layers at 9,000 to 10,000 feet.", "probable_cause": "The pilot's failure to maintain aircraft control while holding."}