{"url": "https://www.baaa-acro.com/crash/crash-saab-340-marsh-harbour", "date": "Jun 13, 2013 at 1345 LT", "type": "Saab 340", "operator": "Sky%20Bahamas", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Lauderdale – Marsh Harbour", "msn": "316", "yom": 1992, "flight_number": "SBM9561", "city": "Marsh Harbour", "zone": "Central Abaco", "country": "Bahamas", "region": "Central America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 21, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8500, "captain_hours_type": 4700, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 45680, "circumstances": "On Thursday June 13, 2013 at approximately 1750UTC (1:50pm local time), a fixed wing, twin turboprop regional airliner, was involved in an accident as a result of a runway excursion while landing during heavy rain showers at Marsh Harbor Int’l Airport, Marsh Harbor, Abaco, Bahamas. The aircraft, a SAAB 340B aircraft was operated by SkyBahamas Airlines and bore Bahamas registration C6-SBJ, serial number 316. C6-SBJ departed Fort Lauderdale Int’l Airport (KFLL), Fort Lauderdale, Florida in the USA as Tropical Sky 9561. The airline, SkyBahamas Airline is a Bahamas Air Operator Certificate Holder with approved scheduled operations to and from Fort Lauderdale International Airport, Florida USA (KFLL) and Marsh Harbor Int’l Airport, Marsh Harbor, Abaco in the Bahamas. The crew received weather information and IFR route clearance from KFLL Control Tower. This passenger carrying flight departed KFLL at 1706UTC (1:06pm local) on an instrument flight rules (IFR) flight plan. The point of intended landing was Marsh Harbor International Airport, Abaco, Bahamas (MYAM). The crew selected runway 09 at MYAM for landing. At 17:45:30, the aircraft leveled off at 1,500 feet ASL on a heading of 096 degrees magnetic, with airspeed of 236 knots indicated (KIAS). The flaps were extended to 15 degrees at 17:47:18 with the aircraft level at 1,300 feet ASL, approximately 4.2 nm on the approach. The autopilot was disconnected at 17:47:26 with the aircraft level at 1,300 feet ASL, approximately 3.8 nm on the approach. Heading was 097 degrees magnetic and airspeed was 166 KIAS. The Landing Gear was extended and in the down and locked position by 17:48:01 as the aircraft descended through 730 feet ASL. At 17:48:03, the flaps were extended to landing flap 20 degrees with the aircraft approximately 1.9 nm from the runway on the approach. At 17:48:47, as the aircraft approached the threshold, the power levers were retarded (from 52 degrees) and the engine torques decreased from approximately 20%. Approximately one second later, the aircraft crossed the threshold at a radio altitude of 50 feet AGL on a heading 098 degrees magnetic and airspeed of 171 KIAS. The crew encountered rain showers and a reduction in visibility. The aircraft initially touched down at 17:49:02 with a recorded vertical load factor of +2.16G, approximately 14 seconds after crossing the threshold. There were no indications on the runway to indicate where the initial touchdown had occurred. Upon initial landing however, the aircraft bounced and became airborne, reaching a calculated maximum height of approximately 15 feet AGL. The aircraft bounced a second time at 17:49:07 with a recorded vertical load factor of +3.19* G. During this second bounce, the pitch attitude was 1.8 degrees nose down, heading 102 degrees magnetic and airspeed 106 KIAS. The aircraft made consecutive contact with the runway approximately three times. The third and final bounce occurred at 17:49:14 with a recorded vertical load factor of +3.66G*. During the third bounce, the pitch attitude was 2.2 degrees nose down, heading 099 degrees magnetic and airspeed 98 KIAS. As a result of the hard touchdown, damage was sustained to the right wing and right hand engine/propeller. The right hand engine parameters recorded a rapid loss of power with decreasing engine speed and torque, and subsequent propeller stoppage. The aircraft veered off to the right at approximate time of 17:49:20 on a heading of 131 degrees magnetic at a point approximately 6,044 feet from the threshold of runway 09. The recorded airspeed was 44 KIAS with the left hand engine torque at 26 % and the right hand engine torque at 0%. The aircraft came to a full stop at approximate time 17:49:25 on a heading of 231 degrees magnetic. When the aircraft came to a stop, the flight and cabin crew and twenty-one (21) passengers evacuated the aircraft. The evacuation was uneventful using the main entrance door. Due to the damage sustained by the right wing and engine, evacuation on the right side was not considered. The evacuation occurred during heavy rainfall. No injuries were reported as a result of the accident or evacuation process. The airplane sustained substantial damage as a result of the impact sequence. The elevation of the accident site was reported as approximately 10 feet Mean Sea Level (MSL). Instrument Meteorological Conditions (IMC) prevailed at the time of the accident. The cockpit voice recorder (CVR) uncovered that this crew used no crew resource management or adherence to company standard operating procedures. During the final seconds of the flight, there was complete confusion on the flight deck as to who was in control of the aircraft. After failure of the windshield wiper on the left side of the aircraft, the captain continued to maneuver the aircraft despite having no visual contact of the field due to heavy rain. Sterile Cockpit procedures were not adhered to by this crew as they continued with non-essential conversation throughout the flight regime from engine start up in KFLL up until the “before landing checklist” was requested prior to landing.", "probable_cause": "Contributing factors: \r\n- Inexperienced and undisciplined crew,\r\n- Lack of crew resource management training,\r\n- Failure to follow company standard operating procedures,\r\n- Condition known as “get-home-itis” where attempt is made to continue a flight at any cost, even if it means putting aircraft and persons at risk in order to do so,\r\n- Failure to retrieve, observe and respect weather conditions,\r\n- Thunderstorms at the airfield."}