{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-70-dl-den-oever-32-killed", "date": "Sep 25, 1996 at 1637 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Dutch%20Dakota%20Association", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Texel - Amsterdam", "msn": "19109", "yom": 1943, "flight_number": null, "city": "Den Oever", "zone": "North Holland", "country": "Netherlands", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 26, "pax_fatalities": 26, "other_fatalities": 0, "total_fatalities": 32, "captain_hours": 19070, "captain_hours_type": 400, "copilot_hours": 20273, "copilot_hours_type": 280, "aircraft_hours": 38388, "circumstances": "The aircraft took off at 14.28 from Texel International Airport for the return flight to Amsterdam-Schiphol Airport. Before take-off the airport manager of Texel International Airport requested the crew of PH-DDA to squawk transponder-code 0060. The take-off was considered normal by several witnesses, including the Airport Manager, without deviations from what they had seen during previous take-offs from Texel. Several witnesses observed the aircraft passing outbound over the east coast of the island of Texel. One witness reported a short-lived orange colored fire streak emanating from the underside of the left engine, another mentioned a shrieking noise on one engine. The weather situation over the Waddenzee was : a visibility of about 1 .5 km in haze without a distinct horizon. The sun was obscured. There was a glassy smooth water surface without any references. At approximately 14.33, the crew reported to Texel Radio that they had problems with an engine. They were advised to switch over to De Kooy Approach. There is no radio telephony (RT) recording available of this phase of the flight. Naval Air Station (NAS) De Kooy is not equipped with primary radar. No primary radar recordings from other sources were available. The aircraft became visible on the secondary radar of NAS De Kooy at 14.34:33, squawking 0060 and flying at an altitude of 800 feet on a heading of 155°, which changed gradually to 175°. Most likely the transponder had been switched on at that time. Refer to the radar plot in Appendix 1. At 14.35:32 the flight crew reported to De Kooy Approach : \"Uh, PDA is uh..., at 600 feet and approaching uh..., De Kooy, we want to make an emergency landing on De Kooy\". The position of the aircraft at that moment was approximately 11 mn northeast of NAS De Kooy. Shortly thereafter the aircraft made a sudden left turn to a heading of 110°. The aircraft was then at an altitude of 700 feet. The flight crew reported that they had feathered the left engine. De Kooy Approach instructed to set Secondary Surveillance Radar (SSR) code 4321 instead of the then used VFR code 0060, gave QNH and reported that runway 22 was in use ; the pilot did not respond to this message. De Kooy Approach twice repeated the advise to squawk and advised to proceed inbound runway 22. During the transmission of this message the aircraft was turning to approximately the required heading of 225°, at an altitude of 500 feet. The aircraft maintained heading 225° at 500 feet and the airspeed decreased. After several inquiring calls concerning the correct squawk, at 14.36:52 the pilot confirmed squawking 4321 and asked for a heading. Some parts of the radio communication were hindered by a whistle tone. In response to the question, De Kooy Approach requested the position ; the pilot reported 11 nm out to the northeast. Seven seconds later De Kooy Approach confirmed radar contact and advised a heading of 240° . During this conversation the aircraft turned left to a heading of 180°. At that time the altitude was still 500 feet and the airspeed had further decreased. The crew confirmed the advised heading of 240°, but the aircraft did not turn to this direction. This was the last message from the aircraft. The radar recording showed that at 14.37:28 the aircraft started to turn to the left at an increasing rate. At 14.37:47 the last radar echo showed an altitude of 200 feet. The approach controller stated that the aircraft disappeared from the radar screen. There was no reply on repeated calls from De Kooy Approach, upon which the controller initiated an emergency status. The aircraft crashed onto a flooded sand bank in the Waddenzee, where at that time the water had a depth of about 1.2 meter. Forty seconds after the aircraft had disappeared from the radar, the controller contacted a KLM ERA helicopter, approaching NAS De Kooy, informed the pilot of the situation with the PHDDA and requested the pilot to have a look at the approximate position ; about seven minutes later the helicopter reported the wreckage in sight. That started an extensive rescue action; one severely injured passenger was taken to a hospital by a Naval helicopter, but died the same evening. The other 31 occupants to all probability died instantaneously in the crash. There was no fire.", "probable_cause": "The accident was initiated by a combined failure of the left engine and the left feathering system. The accident became inevitable when the flight crew allowed the speed to decrease below stall speed and lost control of the aircraft at an altitude from which recovery was not possible.\r\nThe following contributing factors were reported: \r\n- Serious degradation of controllability and performance.\r\n- A high work load imposed on the flight crew by the multiple failure, further increased by unfavourable flight conditions and a suboptimal cockpit lay-out.\r\n- The inadequate level of skill and experience of the flight crew on the DC-3 to be able to cope with this specific emergency situation.\n"}