{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-201b-near-vero-beach", "date": "Apr 3, 1941 at 0907 LT", "type": "Douglas DC-3", "operator": "Eastern-Airlines-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Miami – West Palm Beach – Daytona Beach – Jacksonville – Brunswick – Savannah – Charleston – Raleigh – Richmond – Washington DC – Baltimore – Philadelphia – New York", "msn": "2143", "yom": 1939, "flight_number": "EA014", "city": "Vero Beach", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 13, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3557, "captain_hours_type": 2486, "copilot_hours": 4100, "copilot_hours_type": 469, "aircraft_hours": null, "circumstances": "On the leg from West Palm Beach to Daytona Beach, while cruising along the east coast of Florida, the crew encountered poor weather conditions with storm activity and turbulence. The aircraft lost height and crashed in a flat attitude in a swampy area near Vero Beach. All 16 occupants were injured and the aircraft was wrecked.\r\nCrew:\r\nGerald O'Brien, pilot, \r\nByron M. Crabtree, copilot,\r\nAlbert Marin, steward.", "probable_cause": "Upon the basis of the foregoing findings and of the entire record available, investigators  find that the probable cause of the accident  was loss of control of the airplane while being operated on instruments and while encountering severe turbulence in a line squall, the existence of which the carrier's ground personnel had failed to make known to the captain.\r\nThe following contributing factors were identified:\r\n1. Failure of carrier to provide an adequate dispatching system with a number of trained dispatchers on Route 6 to keep in constant contact with flights in order to provide them with current and accurate flight information.\r\n2. Failure of carrier's West Palm Beach ground station to transmit to Trip 14 the full text of the message received from Trip 10 at 8:32 A.M.\r\n3. Failure of carrier's meteorologist to make a more thorough analysis of weather conditions and issue a supplementary forecast to that originally issued for the operation of trip 14.\r\n4. Although as we have previously stated it is impossible to reach a definite conclusion as to the degree of severity of the problem presented to the pilot it appears very possible that the handicap of the captain's limited experience in flying transport aircraft under conditions of severe turbulence was a factor contributing to the occurrence of the accident."}