{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-51-new-orleans-19-killed", "date": "Mar 30, 1967 at 0050 LT", "type": "Douglas DC-8", "operator": "Delta-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "City", "schedule": "New Orleans - New Orleans", "msn": "45409/19", "yom": 1959, "flight_number": "DL9877", "city": "New Orleans-Louis Armstrong (Moisant)", "zone": "Louisiana", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 13, "total_fatalities": 19, "captain_hours": 19008, "captain_hours_type": 475, "copilot_hours": 16929, "copilot_hours_type": 15, "aircraft_hours": 23391, "circumstances": "Delta Air Lines DC-8-51 N802E was scheduled as Flight 9877, to provide crew training for a captain-trainee and a flight engineer-trainee. In addition the flight engineer-instructor was being given a routine proficiency check. At 23:14 a weather briefing was given to the instructor pilot, indicating, \"... the only significant weather was a restriction in visibility which was expected to reduce to about two miles in fog and smoke near 0600...\". The flight departed the ramp at 00:40 with the captain-trainee in the left seat and the check captain in the right seat. At 00:43 the crew advised the tower they were ready for takeoff and would \"...like to circle and land on one (runway 1).\" The tower controller then cleared them as requested. The aircraft was observed to make what appeared to be a normal takeoff and departure. At 00:47 the crew reported on base leg for runway 01, and the controller cleared the flight to land. A subsequent discussion revealed that they would execute a simulated two-engine out approach, execute a full stop landing and then takeoff on runway 19. The tower controller observed Flight 9877 in a shallow left turn on what appeared to be a normal final approach. The degree of bank increased to approximately 60° or greater when the aircraft hit the power lines approximately 2,300 feet short and 1,100 feet west of the runway threshold. The DC-8 crashed into a residential area, destroying several homes and the Hilton complex. All six crew members were killed as well as 13 people on the ground, clients and employees at Hilton Hotel. 18 other people were injured, some of them seriously. The aircraft was totally destroyed by impact forces and a post crash fire. ", "probable_cause": "Improper supervision by the instructor, and the improper use of flight and power controls by both instructor and the Captain-trainee during a simulated two-engine out landing approach, which resulted in a loss of control."}