{"url": "https://www.baaa-acro.com/crash/crash-volpar-turboliner-18-memphis-1-killed", "date": "Oct 9, 1987 at 2215 LT", "type": "Volpar Turboliner 18", "operator": "Kalitta", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Memphis - Cincinnati", "msn": "3829", "yom": 1971, "flight_number": null, "city": "Memphis", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1913, "captain_hours_type": 64, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 18702, "circumstances": "After takeoff pic was told by tower that tail stand, used to prevent aircraft from tipping on tail when loaded, was still attached to aircraft. Pic requested teardrop turn back to departure runway. Approach controller stated he saw mode C indication of 700 feet. Airport elevation is 332 feet. Aircraft was returning to runway 36R when it stalled, recovery was attempted, and aircraft impacted ground prior to completion of level off. Aircraft was 379 lbs over max takeoff weight and cg was at least 3 inches forward of the limit. No record of load manifest was found. Pic had low pic experience and received 2.7 documented flight hours with the operator's instructor pilot including his 135 competency check ride of 1.1 hours. Operator's initial training certification of pic showed 5 hours of flight training. Aircraft was a modified Beechcraft TC-45J initially built in 1943 and rebuilt by Hamilton in 1971. The pilot, sole on board, was killed. ", "probable_cause": "Occurrence #1: loss of control - in flight\r\nPhase of operation: maneuvering - turn to reverse direction\r\nFindings\r\n1. (f) aircraft preflight - inadequate - pilot in command\r\n2. (f) aircraft weight and balance - not performed - pilot in command\r\n3. (f) lack of total experience in type of aircraft - pilot in command\r\n4. Light condition - bright night\r\n5. (f) inadequate initial training - company/operator management\r\n6. (f) diverted attention - pilot in command\r\n7. (c) airspeed (vs) - not maintained - pilot in command\r\n8. (c) stall - inadvertent - pilot in command\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled"}