{"url": "https://www.baaa-acro.com/crash/crash-cessna-404-titan-ii-near-pena-pobre-1-killed", "date": "May 13, 2001 at 1933 LT", "type": "Cessna 404 Titan", "operator": "City Wings", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Christiansted – San Juan", "msn": "404-0237", "yom": 1978, "flight_number": null, "city": "Pena Pobre", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1000, "captain_hours_type": 103, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12000, "circumstances": "The flight was being handled as a VFR aircraft by air traffic control, was given a discreet transponder code, and was radar contact at an altitude of 4,500 feet. The pilot requested a VFR descent from 4,500 feet, and was cleared to \"…descend unrestricted west bound.\" Radar and radio contact were lost at an altitude of 2,700 feet. The controller tried to re-establish radio contact with the airplane's pilot 10 times before initiating search and rescue efforts. A U.S. Coast Guard helicopter found the wreckage, using the aircraft's emergency locator transmitter. The next day a ground search for the aircraft was halted because of hazardous terrain. Search and rescue personnel had to be airlifted into the crash site to remove the victim. A police helicopter was vectored to the crash site by ATC about an 1 1/2 hours after contact was lost with the flight, and the pilot reported that he could not fly near the crash site because of fog. He reported the ceiling about 2,400 feet. The aircraft impacted in heavily wooded, mountainous terrain at the 2,700-foot level of a 3,524-foot mountain. Toxicology test showed that venlafaxine and desmethylvenlafaxine drugs were found in the pilot's blood, and the levels found were consistent with the recent ingestion of more than 10 times a normal dose of venlafaxine.", "probable_cause": "Failure of the pilot-in-command to maintain altitude/clearance, resulting in an in-flight collision with rising terrain."}