{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-penticton-3-killed", "date": "Aug 29, 2003 at 1427 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Harris Air Freight", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Nanaimo - Penticton - Calgary", "msn": "1408", "yom": 1959, "flight_number": null, "city": "Penticton", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 915, "captain_hours_type": 615, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9029, "circumstances": "The aircraft left Nanaimo, British Columbia, and landed at Penticton Airport at 1232 Pacific daylight time (PDT). The aircraft was fueled with 184 litres of fuel, filling all three belly tanks. At this time, the rear portion of the aircraft cabin was observed to be loaded with luggage and cargo. The pilot/aircraft owner was planning his flight to Calgary (Springbank), Alberta, and spent at least an hour flight planning and talking with the Kamloops Flight Information Centre by telephone. He had some difficulty determining a route to fly to Springbank, because of airspace restrictions due to forest fires, but decided on a routing of Penticton, Kelowna, Vernon, Revelstoke, and Springbank. The aircraft took off from Penticton Airport at 1420 PDT, with the pilot and two passengers on board and crashed approximately seven  minutes later in a ravine of Penticton Creek, 11 nautical miles northeast of Penticton Airport. A post-impact fire broke out and consumed most of the fuselage area. The fire caused a small forest fire, seen by a firefighting aircraft crew. There were no radio calls from the occurrence aircraft, and the three occupants were fatally injured.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. As the aircraft approached high terrain in a climb, the pilot, for undetermined reasons, did not turn away from the terrain; the aircraft struck tree tops and crashed.\r\n2. The aircraft’s climb performance was adversely affected by density altitude and the relatively high aircraft weight, so that the aircraft was unable to clear the high terrain ahead.\r\nFindings as to Risk:\r\n1. The licensed passenger had not informed the TC medical examiner who conducted her last medical that she had been diagnosed with coronary artery disease, posing the risk that she could pilot an aircraft while not medically fit to do so. \r\n2. The aircraft was being operated at a higher weight than was justified by the STC, under which it was converted to an amphibian. Some of the structural modifications called for by the STC for the higher weight had not been carried out.\r\nOther Findings:\r\n1. It could not be determined who was piloting the aircraft on the occurrence flight."}