{"url": "https://www.baaa-acro.com/crash/crash-martin-202-minneapolis-15-killed", "date": "Mar 7, 1950 at 2059 LT", "type": "Martin 202", "operator": "Northwest%20Airlines2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Washington-Detroit-Madison-Rochester-Minneapolis-Winnipeg", "msn": "9134", "yom": 1948, "flight_number": "NW307", "city": "Minneapolis", "zone": "Minnesota", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": 7619, "captain_hours_type": 988, "copilot_hours": 2432, "copilot_hours_type": 585, "aircraft_hours": null, "circumstances": "The aircraft departed Washington DC at 1230LT destined for Winnipeg, Manitoba, Canada, with intermediate stops in Detroit, Rochester, Madison and Minneapolis. With the exception of an hour and 23 minute delay at Detroit, required for the replacement of a ring seal in the hydraulic system, the flight proceeded in air routine manner to Madison, Wisconsin After arrival at Madison the aircraft was serviced with 1,010 gallons of fuel and 38 gallons of oil. Also on board were 10 passengers and 1,799 pounds of cargo which resulted in an aircraft weight of 36,842 pounds. This weight was well within the allowable limit of 39,100 pounds, and so far as is known, the aircraft was properly loaded. Weather information available to the flight prior to its departure from Madison showed that Rochester, 75 miles south southeast of Minneapolis, was reporting a ceiling of 700 feet with visibility of five miles, and that Minneapolis was reporting a ceiling of 900 feet with visibility of 1/2 mile 3. In addition, there was fog and blowing snow at these stations. Turbulence was expected in the clouds, and icing above the freezing level of 8,000 feet. The trip was planned to Minneapolis at an altitude of 4 000 feet, the schedule stop at Rochester being made contingent upon weather conditions at the time of the flight’s arrival. Madison, Wis., and Jamestown, N. Dak where weather conditions were well above landing minimums, were designated as alternate airports. Flight 307 arrived over Rochester at 2023, and because there was light freezing rain, did not land. Twelve minutes later the flight made a routine report to company radio that it was over Stanton which is a radio beacon 30 miles south of the Twin Cities Airport at Minneapolis, and at 2041 contacted Minneapolis Approach Control for landing clearance. The tower advised Flight 307 of existing, weather conditions. There was a precipitation ceiling of 900 feet, visibility was variable 1/2 to 3/4 of a mile, and the wind was from the north 27 miles per hour with gusts up to 40 miles per hour. The tower informed the flight that there had been two electric power failures at the field, and that if no further communication were received from the tower, it would be in all probability the result of another power failure The flight was also told that the ILS was serviceable, but that it had not been flight checked. As Flight 307 approached, another NWA flight, a Boeing 377, was standing at the approach end of the instrument runway, Runway 35, checking engines prior to flight Takeoff clearance was given to the Boeing 377. When it had proceeded half-way down the runway, Flight 307 reported that it was over the outer marker, which was 4.7 miles south of the approach end of the runway. The high intensity runway lights were increased in intensity, their coning device was set to 1/2 mile, the prevailing visibility at the time, and Flight 307 was cleared to land. Flight 307 was not seen from the tower during its approach, but it was heard to pass overhead at which time the controllers received the call, “I have got to get in Clearance was again given to land, following which the flight advised that it would climb to 2,400 feet on the northwest course of the Minneapolis radio range. After a pause, the flight transmitted. “We are going in-we are going in.” After the aircraft had flown over the field, it was observed flying straight and level 3.8 miles northwest of the airport. A wing was seen to fall. Then, the aircraft was observed to dive almost vertically from an altitude of about 300 feet, and crash into a residence in the city of Minneapolis Fire which started immediately after the crash consumed the house and much of the aircraft wreckage. All of the 13 occupants of the aircraft and two of the occupants of the house were killed.", "probable_cause": "The Board determines that the probable cause of this accident was the attempt to complete a landing approach by visual means during which time visual reference to the ground was lost.\r\nThe following findings were noted:\r\n- Weather conditions were precipitation ceiling, 900 feet, visibility 1/2 mile variable reduced by blowing snow wind from the north at 27 miles an hour with gusts to 40 miles per hour air, cold and dry, and, turbulence over the lending approach flight path,\r\n- During the period preceding and following the accident slant visibility was relatively good, which permitted other flights to complete their landing approaches by visual reference to the runway,\r\n- Flight 307 was flown 128 feet below the ILS glide path and 650 feet to the left of the localizer at a point 4,180 feet south from the approach end of Runway 35 where the aircraft struck a flagpole well marked by red neon obstruction lights."}