{"url": "https://www.baaa-acro.com/crash/crash-blackburn-b-26-botha-i-blackpool-17-killed", "date": "Aug 27, 1941 at 1505 LT", "type": "Blackburn B-26 Botha", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "City", "schedule": "Squires Gate - Squires Gate", "msn": null, "yom": null, "flight_number": null, "city": "Blackpool", "zone": "Lancashire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 14, "total_fatalities": 17, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the afternoon of Wednesday 27 August 1941 four 256 Squadron Defiants took off from Squires Gate to practice formation flying. Their flight commander (whose name is unrecorded) was recalled back to the aerodrome, and so he handed his flight over to his No. 2, a Sergeant Leonard (RAF). Just after 3.00 p.m. the three Defiants were flying over the sea, a little West of Blackpool Tower, at an altitude of about 2,000 feet and on a North Easterly heading. Some 500 feet below them, flying in a North Westerly direction, was one of 3 SGR's Bothas, L6509. Eyewitnesses on the ground saw the Defiants break formation and, one by one, dive towards the Botha as if making a mock attack and then level out afterwards. Two of the fighters completed the manoeuvre successfully, but as the third Defiant began its dive the Botha suddenly banked to the right and the pilot of the diving fighter, Defiant N1745, JT-P, struck the Botha amidships, cutting it in two and itself losing a wing. The now tail-less Botha stalled and immediately went into a spiral dive, its descent being watched by hundreds-possibly thousands-of shocked civilians and servicemen on Blackpool's seafront. Seconds later it crashed through the roof of the entrance hall of the Central Station, showering aviation fuel over the platforms below, which erupted into a massive conflagration. A huge cloud of thick black smoke quickly rose to a height of several hundred feet over the center of Blackpool. All three occupants of the Botha and both pilots on board the Defiant were killed. At the station, 8 people on the ground were killed while 6 others died the following days. \r\nBotha's crew (3rd SGR):\r\nP/O A. A. Horne, pilot,\r\nP/O K. J. A. Sale, pilot.\r\nPassenger: \r\nMr. Frank Longson.\r\nSource & photos: http://laituk.org/Botha-Defiant.htm", "probable_cause": "In-flight collision with an RAF Defiant following an error on part of the Defiant's crew. "}