{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-41-trondheim", "date": "Feb 23, 1987", "type": "Douglas DC-9", "operator": "SAS.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bodø - Trondheim", "msn": "47625", "yom": 1974, "flight_number": "SK355", "city": "Trondheim", "zone": "Sør-Trøndelag", "country": "Norway", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 103, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "DC-9 \"Gissur Viking\" was approaching Trondheim runway 27 with the co-pilot at the controls. Descending through 2500 feet the ATC controller asked the crew to contact SAS Station in Trondheim over company frequency. The captain was working through the checklist but contacted SAS, contrary to company regulations (it's not allowed use company frequency while on final approach). The captain then forgot to arm the spoilers because he had not completed the checklist. He co-pilot noticed that the spoilers had not been armed and, while descending through 100 feet, called \"Spoilers\". The pilot instinctively extended the spoilers and, realizing his mistake, immediately retracted them. The aircraft entered a high sink rate and touched down heavily. A go-around was executed and after landing severe structural damage was found to the undercarriage, engines (30° respectively 15° tilted down), and tail cone (the APU was pushed halfway up the tail). All 107 occupants escaped uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "Wrong approach configuration on part of the flying crew. Lack of crew coordination and approach checklist not completed were considered as contributing factors. "}