{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-goulburn-4-killed", "date": "May 16, 1984 at 2304 LT", "type": "Cessna 340", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Sydney - Goulburn", "msn": "340A-0411", "yom": 1978, "flight_number": null, "city": "Goulburn", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 1, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Prior to departure the pilot had received a weather forecast which indicated that fog could be expected at the destination. Adequate fuel was carried in the aircraft tanks to allow for a considerable period of holding and/or a diversion to another aerodrome if required. After an apparently normal flight of 35 minutes the aircraft arrived in the Goulburn area and the pilot reported his intention to carry out a standard instrument approach. The manoeuvres associated with this procedure do not involve flight over the city of Goulburn, however witnesses observed the aircraft as it circled over the city several times at a relatively low height. It was then seen to roll and descend steeply before striking two houses. A fierce fire broke out which engulfed the aircraft and both residences. The three persons on board the aircraft and a person in one of the houses received fatal injuries. A detailed inspection of the wreckage revealed that the camshaft of the left engine had failed in flight and the pilot had apparently feathered the propeller. The engine was not operating at the time of impact. No other defect or malfunction was discovered which might have contributed to the development of the accident. It was determined that the particular camshaft had failed from fatigue cracking, resulting from defective manufacture. It was considered likely that when the aircraft arrived over Goulburn, shallow fog obscured all or part of the aerodrome. The lights of the city would have been clearly visible and the pilot probably decided to use the city, rather than the nearby radio navigation aid, as a convenient holding point while waiting for conditions at the aerodrome to improve. During a series of left hand orbits, and after advising his intention to conduct an instrument approach, the pilot experienced a complete failure of the left engine. In order to realise the available single-engine performance of the aircraft the pilot had to perform a series of checks and actions which would result in the applicable propeller being feathered; any unnecessary aerodynamic drag being reduced; and an appropriate airspeed being established. It was determined that although the propeller had probably been feathered, the landing gear, which had evidently been lowered previously, had not been raised to reduce drag. In addition, an analysis of radar returns from the aircraft, recorded at Canberra, indicated that the airspeed at which the aircraft was flying shortly before radar contact was lost, was less than the optimum figure. The final manoeuvre described by witnesses was consistent with that which follows a loss of control in twin engine aircraft when power is being supplied by only one engine and the speed is below the minimum required for full control. The reason the pilot did not raise the landing gear and maintain the required minimum control speed could not be established.", "probable_cause": "Failure of the left engine in flight due to defective manufacture of camshaft. The following contributing factors were reported:\r\n- Fatigue failure of camshaft,\r\n- Complete loss of power from left engine,\r\n- Aircraft not reconfigured for optimum single engine performance,\r\n- Airspeed fell below minimum for effective control,\r\n- Insufficient height for recovery."}