{"url": "https://www.baaa-acro.com/crash/crash-bae-nimrod-mr2-raf-lossiemouth", "date": "May 16, 1995", "type": "BAe Nimrod", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Kinloss - Kinloss", "msn": "8041", "yom": 1970, "flight_number": null, "city": "Lossiemouth AFB", "zone": "Moray (Elginshire)", "country": "United Kingdom", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was one of three Nimrod reconnaissance variants and had just undergone a major servicing at the Nimrod Major Servicing Unit (NMSU), RAF Kinloss by RAF maintenance personnel. Nimrod XW666 departed on a routine post-servicing airtest. After approximately 35 minutes of flight, following a test of the aircraft's anti-icing system, the No 4 engine fire warning illuminated. Whilst the crew were carrying out the fire drill, the No 3 engine fire warning also illuminated. A rear crew member confirmed that the aircraft was on fire and advised the captain that panels were falling away from the starboard wing. After two explosions, the captain feared for the structural integrity of the aircraft and decided to ditch before he lost control authority. Without the aid of flaps, which failed to operate because of a fire/associated hydraulic failure, he completed a controlled ditching into the Moray Firth. The aircraft bounced twice onto the sea before settling. The fuselage broke into two and the aircraft subsequently sank. Parts were salvaged and the cockpit section is now on display at AeroVenture South Yorkshire Aircraft Museum in Doncaster.", "probable_cause": "With the assistance of the Department of Transport's Air Accident Investigation Branch, the Inquiry established that despite the correct application of maintenance procedures, the DC electrical loom attached to No 4 engine had sustained mechanical damage, although it could not be positively determined how or when. Arcing occurred when the engine anti-icing system was switched on and this led to initiation of the air starter system. With the No 4 engine already running at idle as part of the overall airtest there was no load on the starter turbine, which quickly ran up to high speed. The nut holding the turbine disk in place failed, allowing the disk to move back on its shaft and out of its protective housing. It then struck the engine bypass casing and the No 2 fuel tank, puncturing both. The resultant fuel leak was ignited either by electrical arcing within the faulty DC loom or by the heat of the engine. The fire spread rapidly to the wing area and forward to the engine intake area. The Inquiry concluded that a sequence of technical difficulties led to the uncontained fire."}