{"url": "https://www.baaa-acro.com/crash/crash-yakovlev-yak-40-berdyansk-8-killed", "date": "Jun 19, 1987 at 1122 LT", "type": "Yakovlev Yak-40", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Odessa - Berdyansk", "msn": "9 24 18 24", "yom": 1972, "flight_number": "SU528N", "city": "Berdyansk", "zone": "Zaporizhia Oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 2, "pax_on_board": 24, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Odessa, the crew started the approach and was cleared to descend to 1,200 meters. On final, weather conditions deteriorated with thunderstorm activity and heavy rain falls. Despite a limited visibility and the actual conditions, ATC cleared the aircraft to continue the approach and to land. The three engine aircraft passed over the threshold at a height of 40-50 meters and at an excessive speed of about 250 km/h. The aircraft landed too far down the runway and after touchdown on a wet surface, the crew started the braking maneuver but the aircraft was unable to stop within the remaining distance. It overran, rolled about 450 meters then struck two trees, crossed a road and came to rest in a field, bursting into flames. Two crew members and six passengers were killed while 21 other occupants were injured. The aircraft was destroyed by a post crash fire. At the time of the accident, weather conditions were below Airport minimums. ", "probable_cause": "It was determined that the accident was the consequence of the combination of the following factors: \r\n- The crew decided to continue the approach in below minimum weather conditions at an excessive speed and above the glide, causing the aircraft to land too far down the runway,\r\n- The crew failed to initiate a go-around procedure, \r\n- ATC cleared the crew to land and failed to close the airport and to divert the flight to another suitable airport, \r\n- Poor organization by Meteo services. "}