{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-6b2-h4-turbo-porter-near-namur-11-killed", "date": "Oct 19, 2013 at 1535 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "Paraclub-Namur", "flight_phase": "Flight", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Namur - Namur", "msn": "710", "yom": 1969, "flight_number": null, "city": "Namur", "zone": "Namur", "country": "Belgium", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 2919, "captain_hours_type": 332, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16159, "circumstances": "On 19 October 2013, the Pilatus Porter was being used for parachute drops. The day started normally with the first take-off at 07:21. Each flight transported 9 or 10 passengers. Except for the first two, all the flights of that day were conducted by the same pilot. The aircraft’s last landing in EBNM was at 13:20 to board the next group of 10 parachutists. After the take-off, the aircraft appeared again on the radar at 13:28 at an altitude of 1200 ft. At 13:28:52, the EBCI Air Traffic Control Officer (ATCO) instructed the aircraft to remain at 2000 ft AMSL to allow for crossing traffic, a B737 landing at EBCI, and to proceed further to the east. After the crossing, the Pilatus was authorized to climb to 5000 ft. At 13:33:32, when the aeroplane was flying at 4400 ft, the pilot was authorized to turn back to the drop zone and turned towards its target, the EBNM airfield. Shortly after, a witness observed the aeroplane making a wide turn to the left. This witness monitored the aeroplane for about 40 seconds. He indicated the engine was making an abnormal noise which he compared with the explosions made by the exhaust of a rally car when decelerating. Finally, the witness heard a loud explosion ending by the dive of the aeroplane. He believed that the sound of an explosion was caused by the “engine turbine disintegration”. Another witness driving on the E42 highway saw the aeroplane performing what he perceived as being some aerobatic manoeuvers. The aeroplane was diving and was spinning. A moment later, he saw the wing break-up, including the separation and falling of smaller parts. A sailplane pilot was standing in his garden not far from the crash site. He first heard the sound of the Pilatus which he described as being typical, smooth and constant. He looked at the aeroplane and noticed it was flying at a lower altitude than usual. He stopped observing after a few seconds. 30 to 40 seconds later, he heard an abnormal noise change which he thought was a propeller pitch change or an engine power change. He looked for the aeroplane in the sky and saw the aeroplane diving with an angle of more than 45° immediately followed by a sharp pull-out angle of over 70°, followed by the upwards breaking of a wing. The aeroplane went down “as in a stall”. The witness still heard “the sound of propeller angle moving” after the wing separation. Another witness standing approximately at an horizontal distance of 600 m from the aeroplane described having heard a sound change. He looked at the aeroplane and saw the aeroplane flying horizontally, making several significant left and right roll movements of the wings before it disappearing from his view. The aeroplane crashed on a field in the territory of Gelbressée, killing all occupants. The aeroplane caught fire shortly after the impact. A big part of the left wing, elements thereof and the right sliding door of the cabin were found at 2 km from the main wreckage. Of the aircraft’s occupants, 4 parachutists were ejected from the aircraft just prior to impact. ", "probable_cause": "The cause of the accident is a structural failure of the left wing due to a significant negative g aerodynamic overload, leading to an uncontrollable aeroplane and subsequent crash. The most probable cause of the wing failure is the result of a manoeuvre intended by the pilot, not properly conducted and ending with an involuntary negative g manoeuvre, exceeding the operating limitations of the aeroplane.\r\nContributing safety factors:\r\n• The weakness of the monitoring of the aeroplane operations by the operator.\r\n• The lack of organizational structure between the operator and the parachute club [safety issue].\r\nOther safety factors identified during the investigation:\r\n• The performance of aerobatics manoeuvre with an aircraft not certified to perform such manoeuvres.\r\n• The performance of aerobatics manoeuvre by a pilot not adequately qualified and/or trained to perform such manoeuvres.\r\n• Transportation of unrestrained passengers, not sitting on seat during dangerous phase of the flight.\r\n• The weakness of the legal framework and guidance for aerial work [safety issue].\r\n• The lack of effective oversight of aerial work operations by the BCAA [safety issue].\r\n• The lack of mandatory requirement to install devices recording flight data on board aeroplane used for parachuting [safety issue].\r\n• Insufficient back protection for the pilot [safety issue].\r\n• No easy determination of the weight and balance of the aeroplane due to the passengers not sitting in predetermined positions [safety issue].\r\n• The issuing by BCAA of two distinct authorizations to the aeroplane operator and the parachute club incorporating some overlaps, which does not encourage the awareness of responsibility of the stakeholders involved [safety issue].\r\n• Possible erroneous interpretation of the maintenance manual [safety issue].\r\n• Violations and/or safety occurrences not reported as required by the Circular GDF-04, preventing the BCAA from taking appropriate action.\r\n• Peer pressure of parachutists sometimes encouraging pilots to perform manoeuvres not approved for normal category aeroplanes. \r\n• Flying at high altitude without oxygen breathing system although required by regulation. "}