{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3a-197b-mt-holston-10-killed", "date": "Jan 8, 1959 at 2032 LT", "type": "Douglas DC-3", "operator": "Southeast%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Nashville – Knoxville – Bristol", "msn": "2007", "yom": 1938, "flight_number": "SE308", "city": "Mt Holston", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 7214, "captain_hours_type": 2674, "copilot_hours": 2367, "copilot_hours_type": 432, "aircraft_hours": 5675, "circumstances": "During a night approach to Bristol-Tr-Cities Airport, the airplane was too low and struck the slope of Mt Holston located 15 miles from runway 27 threshold. The airplane was destroyed by impact forces and a post crash fire and all ten occupants were killed. The evidence indicates Flight 308 departed Nashville, Tennessee, with an inoperative radio compass. Although the flight was cleared by way of low frequency airway Green 5, it does not appear that the facilities defining this airway were used. Upon arriving in the Tri-Cities area the aircraft was east of its intended track and erroneously identified the reporting point from which an ILS approach procedure was to be initiated. During the instrument approach, which was conducted in snow showers, the flight missed the outer marker. The approach was continued under instrument conditions without utilizing the VOR facility which would have been of assistance in confirming the flight's position. Without having clearly established his position, the pilot flew 15 miles beyond the outer marker and descended to an altitude too low to clear high terrain in this area.", "probable_cause": "The Board determines the probable cause of this accident was the failure of the pilot to identify Gray intersection properly and his decision to continue an ILS approach contrary to company and regulatory procedures."}