{"url": "https://www.baaa-acro.com/crash/crash-hawker-siddeley-hs125-1a-522-houston-2-killed", "date": "Jun 29, 1983 at 1447 LT", "type": "BAe 125", "operator": "Erasmus", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Houston - Beaumont", "msn": "25110", "yom": 1966, "flight_number": null, "city": "Houston-William P. Hobby", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 2, "total_fatalities": 2, "captain_hours": 9500, "captain_hours_type": 5000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5283, "circumstances": "The Grumman American AA-5A, N9844U, had just landed. While taxing, the aircrew stopped short of runway 13R as Beechcraft. Hawker BH-125, N125E, was taking off. The rated student in N125E, who was on a training flight, was at the controls and began the takeoff. The power-up and takeoff roll were normal. Rotation was described as normal and the left throttle was retarded to idle at 110 knots, as pre-briefed, to simulate an engine failure. The instructor pilot (IP) stated that the lift off appeared normal and directional control was good up to an alt of 10 to 20 feet. The left wing then started to drop and the student applied right aileron, but did not stop the roll. The IP began advancing the left throttle, but did not get on the flight controls. The left wing hit the runway and the aircraft veered left and settled to the ground. At impact, both main gear mounts failed, a fuel tank  ruptured and a fire started. N125E then slid into N9844U and both aircraft burned. BH-125 flight man recommends IP follow thru, max bank 5° and cautions negative wxvaning in crosswind. BH-125 rudder bias engaged. AA-5A crew thrown out, seatbelts unlatched.", "probable_cause": "Occurrence #1: loss of control - in flight\r\nPhase of operation: takeoff - initial climb\r\nFindings\r\n1. (c) supervision - inadequate - pilot in command (CFI)\r\n2. (f) weather condition - crosswind\r\n3. (c) directional control - not maintained - dual student\r\n4. (f) lack of total experience in type operation - dual student\r\n5. (c) remedial action - inadequate - pilot in command (CFI)\r\n6. (f) overconfidence in aircraft's ability - pilot in command (CFI)\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: takeoff\r\nFindings\r\n7. Clearance - not maintained\r\n----------\r\nOccurrence #3: on ground/water collision with object\r\nPhase of operation: other\r\nFindings\r\n8. (f) object - aircraft parked/standing"}