{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-52g-110-bw-stratofortress-griffiss-afb", "date": "May 8, 1972", "type": "Boeing B-52 Stratofortress", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Griffiss - Griffiss", "msn": "464337", "yom": 1959, "flight_number": null, "city": "Griffiss AFB (Rome)", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While in a low level rout one of the engines on the left side of the aircraft malfunctioned and became uncontrollable and was shut down. Hours later on final approach to Griffiss, in a driving rainstorm at night, the copilot, following the checklist turned on the starter switches for all the engines including the one that had been shut down. The shutdown engine that was now wind milling somewhere in the descent reignited and started to increase to max power. The pilots were unaware of this. As the aircraft flared out over the runway with the engine heading toward max power and the landing gear barely touching the ground the aircraft was unable to slow down to engage the brakes. The drag shut was released but failed to deploy. Unable to stop the pilot elected to go-around and increased power…but then made the decision there was not enough runways remaining and cut back the power and announced to the crew that they were going of off the end of the runway. The impact resulted in the aircraft breaking in half just behind the crew compartment and skidding down the embankment with the outboard run-away engine still running as the gear, and AGM 28 Missiles were sheared off. The Boeing reprehensive stated that most likely the only reason the aircraft did not explode on impact was due to the mud caused by the heavy rain. All crew members survived.\r\nSource: ASN", "probable_cause": "The official cause of the accident was listed as hydroplaning."}