{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-gass-peak-1-killed", "date": "Oct 14, 1999 at 1946 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Ameriflight2", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "North Las Vegas – Sacramento", "msn": "31-7652107", "yom": 1976, "flight_number": "AMF121", "city": "Gass Peak", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2103, "captain_hours_type": 250, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14048, "circumstances": "The airplane collided with mountainous terrain during climb to cruise on a night departure. The pilot of the on-demand cargo flight was brought in off reserve to replace the scheduled pilot who was ill. The flight was behind schedule because the cargo was late. When the instrument flight release created further delay, the pilot opted to depart into the clear, dark night under visual flight rules (VFR) with the intention of picking up his instrument clearance when airborne. When clearing the flight for takeoff, the tower controller issued a suggested heading of 340 degrees, which headed the aircraft toward mountainous terrain 11 miles north of the airport. The purpose of the suggested heading was never stated to the pilot as required by FAA Order 7110.65L. After a frequency change to radar departure control, the controller asked the pilot 'are you direct [the initial (route) fix] at this time?' and the pilot replied, 'we can go ahead and we'll go direct [the initial fix].' A turn toward the initial fix would have headed the aircraft away from high terrain. The controller then diverted his attention to servicing another VFR aircraft and the accident aircraft continued to fly heading 340 degrees until impacting the mountain. ATC personnel said the 340-degree heading was routinely issued to departing aircraft to avoid them entering Class B airspace 3 miles from the airport. The approach control supervisor said this flight departs daily, often VFR, and routinely turns toward the initial fix, avoiding mountainous terrain. When the pilot said that he would go to the initial fix, the controller expected him to turn away from the terrain. Minimum Safe Altitude Warning (MSAW) was not enabled for the flight because the original, instrument flight plan did not route the aircraft through this approach control's airspace and the controller had not had time to manually enter the flight data. High terrain was not displayed on the controller's radar display and no safety alert was issued. ", "probable_cause": "The failure of the pilot-in-command to maintain separation from terrain while operating under visual flight rules. Contributing factors were the improper issuance of a suggested heading by air traffic control personnel, inadequate flight progress monitoring by radar departure control personnel, and failure of the radar controller to identify a hazardous condition and issue a safety alert. "}