{"url": "https://www.baaa-acro.com/crash/crash-aviation-traders-atl-98-carvair-rotterdam-1-killed", "date": "Dec 28, 1962 at 1055 LT", "type": "Aviation Traders ATL-98 Carvair", "operator": "Channel%20Air%20Bridge", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Southend – Rotterdam", "msn": "3/18339", "yom": 1962, "flight_number": null, "city": "Rotterdam", "zone": "South Holland", "country": "Netherlands", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 1, "pax_on_board": 14, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6534, "captain_hours_type": 450, "copilot_hours": 6014, "copilot_hours_type": 201, "aircraft_hours": null, "circumstances": "The crew was completing a visual approach to Rotterdam-Zestienhoven Airport in conditions of snow (visibility 1460 m). During the final approach the landing gear struck a 6 feet high dyke located 800 feet short of the runway threshold. The plane bounced and struck the ground heavily 200 feet further on. The right was sheared off and the aircraft crashed upside down in a snow covered field. The captain was killed and the copilot was seriously injured. Two other crew members were injured while all 14 passengers were unhurt. ", "probable_cause": "The accident was due to the fact that the commander carried out the final stage of approach below the normal glide path with insufficient engine power, as a result of which the speed of descent was too high in relation to the horizontal distance still to be covered to the beginning of the runway. Consequently, the aircraft, at a high vertical speed, hit a dyke, after facing the direction of approach. The Board was of the opinion that even if there had been no dyke, and it was not an obstruction of any significant height, the aircraft would still have hit the ground a considerable distance short of the runway threshold, although possibly with less fatal consequences than in the present instance."}