{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-120rt-brasilia-brunswick-23-killed", "date": "Apr 5, 1991 at 1451 LT", "type": "Embraer EMB-120 Brasília", "operator": "Atlantic%20Southeast%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Atlanta - Brunswick", "msn": "120-218", "yom": 1990, "flight_number": "EV2311", "city": "Brunswick-Malcolm McKinnon", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 20, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 23, "captain_hours": 11724, "captain_hours_type": 5720, "copilot_hours": 3925, "copilot_hours_type": 2795, "aircraft_hours": 816, "circumstances": "Witnesses reported that the airplane suddenly turned or rolled left until the wings were perpendicular to the ground. The airplane then fell in a nose-down attitude. Examination of the left propeller components indicated a blade angle of about 3°, while the left propeller control unit (pcu) ballscrew position was consistent with a commanded blade angle of 79.2°. Extreme wear on the pcu quill spline teeth, which normally engaged the titanium-nitrided splines of the propeller transfer tube, was found. The titanium-nitrided surface was much harder and rougher than the nitrided surface of the quill. Therefore, the transfer tube splines acted like a file and caused abnormal wear of the gear teeth on the quill. Wear of the quill was not considered during the certification of the propeller system. The aircraft was totally destroyed upon impact and all 23 occupants were killed, among them John Goodwin Tower, Senator of Texas and the astronaut Manley Sonny Carter. ", "probable_cause": "The loss of control in flight as a result of a malfunction of the left engine propeller control unit which allowed the propeller blade angles to go below the flight idle position. Contributing to the accident was the deficient design of the propeller control unit by hamilton standard and the approval of the design by the federal aviation administration. The design did not correctly evaluate the failure mode that occurred during this flight, which resulted in an uncommanded and uncorrectable movement of the blades of the airplane's left propeller below the flight idle position. "}