{"url": "https://www.baaa-acro.com/crash/crash-comp-air-ca-8-jamijarvi-8-killed", "date": "Apr 20, 2014 at 1540 LT", "type": "Comp Air CA-8", "operator": "Suomen Urheiluilmailijat", "flight_phase": "Flight", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jämijärvi - Jämijärvi", "msn": "01", "yom": 2008, "flight_number": null, "city": "Jämijärvi", "zone": "Satakunta", "country": "Finland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 1029, "captain_hours_type": 43, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 809, "circumstances": "The Tampere Skydiving Club (TamLK) organized the skydiving event “Easter Boogie” at Jämijärvi aerodrome, in the Satakunta region, on Sunday 20 Apr 2014. The event started on Maundy Thursday, 17 Apr 2014 and was planned to end on Easter Monday, 21 Apr 2014. The aircraft reserved for the event were Finland’s Sport Aviators’ Comp Air 8 airplane (CA8, OH-XDZ), which was intended to be used to take skydivers up to 4 000 m, and the Tampere Skydiving Club’s own Cessna U206F (OH-CMT), to be used for jumps from lower altitudes. On Sunday morning the cloud base hampered skydiving operations, which is why the activity started with student jumps from the Cessna. The pilot of the accident flight flew two flights on the Cessna. Once the weather improved he began to fly on the OH-XDZ. He flew two flights on it before he took a lunch break. Another pilot flew four flights on the airplane, following which it was topped up with 240 l of fuel. After refuelling the pilots changed duties again and the pilot of the accident flight flew yet another skydiving flight, landing at 15:25. Ten skydivers boarded the airplane for the accident flight. Takeoff occurred at 15:28 from northern runway 27 of Jämijärvi aerodrome. The airplane climbed to 4 230 m AGL by making a wide, left turn. The pilot steered the aircraft to the jump run, which was over the southern runway. Some of the skydivers sitting at the rear rose to their knees, and two of them cracked the jump door open so as to check the jump run. The skydivers then gave instructions to the pilot as regards correcting the jump run. The pilot adjusted the heading following which he reduced engine power to idle, reducing airspeed to approximately 70-75 kt. Nonetheless, the skydivers noted that they had overshot the jump line and requested that the pilot take them to a new run. The skydivers closed the door. The pilot increased engine power and, according to his account, simultaneously began to turn to the left at a 20-30 degree bank angle. He did not order the skydivers to return to their seats as he was homing in on the new jump run. At the end of the turn the occupants of the aircraft felt a downward acceleration which the skydivers experienced as a force pushing them towards the cabin ceiling. Approximately three seconds later the situation returned to normal. According to the pilot the airspeed was approximately 100 kt when they encountered the vertical acceleration. A moment later the pilot noticed that the airplane was in a descent and that the airspeed had suddenly risen to over 180 kt IAS. According to the pilot the airspeed peaked at 185 kt. He attempted to end the descent by pulling on the control stick. The aircraft levelled out or went into a shallow climb. He reduced engine power to idle to decrease the airspeed. The pilot said that the pitch control stick forces were relatively high. The aircraft returned to level flight, or to a gentle climb. The longitudinal control force suddenly decreased and the airplane suddenly flipped forward past the vertical axis. One of the surviving skydivers said that he heard a crushing sound roughly at the same time; how-ever, he was unsure of the precise point in time of the sound. The aircraft became uncontrollable and began to rotate around its vertical axis, akin to an inverted spin. According to eyewitness videos the aircraft was turning to the left. The videos show that the right wing was buckled against the fuselage and that a vapour trail of fuel was streaming from the damaged wing. While the aircraft was spinning its left wing, which was intact, was pointing upwards and the airplane was falling with its right side forward.  Shouts of “open the jump door, bail out immediately” were heard inside the airplane. The pilot concluded that the aircraft was so badly damaged that it was no longer possible to recover from the dive. He unbuckled his seat belts and opened the pilot’s door on his left at approximately 2 000 m. The pilot jumped out at approximately 1 800 m and opened his emergency parachute. Even though twists had developed in the parachute’s lines, the pilot managed to untangle them. The skydiver sitting at the rear of the seat positioned next to the pilot (skydiver 3) noted that it would be impossible for him to make it to the jump door. Therefore, he chose the pilot’s door as a point of exit. It was extremely difficult to get to the door because the airplane was spinning. The skydiver sitting at the front of the seat positioned next to the pilot (skydiver 2) followed skydiver 3 on his way to the cockpit door and pushed skydiver 3 out of the door. Following egress, skydiver 3 immediately hit his head on airplane structures. The blow momentarily blurred his field of vision but he remained conscious. The Automatic Activation Device (AAD) opened the reserve parachute almost immediately after egress, at approximately 250 m. While skydiver 2 was still behind skydiver 3 he grabbed the control stick, intending to reduce the g-forces caused by the spinning and make it easier to bail out of the airplane. He soon realized that the airplane did not respond to stick movements and exited through the pilot’s door immediately behind skydiver 3. The skydiver who had occupied the furthest forward position (skydiver 1) assisted skydiver 2 in exiting through the door. The AAD of skydiver 2 opened his reserve parachute at approximately 200 m. After skydiver 2 had bailed out neither skydiver 1, situated closest to the pilot’s door, nor the remaining seven skydivers in the rear of the cabin managed to bail out. The airplane collided with the ground at 15:40 and caught fire immediately. The pilot landed approximately 300 m downwind from the wreckage. Skydiver 3 landed on a dirt road, some 60 m from the wreckage and skydiver 2 in the woods, approximately 40 m from the wreckage.", "probable_cause": "The cause of the accident was that the stress resistance of the right wing’s wing strut was exceeded as a result of the force which was generated by a negative g-force. The force which resulted in the buckling of the wing strut was the direct result of a negative (nose-down) change in pitching moment, in conjunction with an engine power reduction intended to decrease the high airspeed. The buckling was followed by the right wing folding against the fuselage and the jump door. The aircraft entered into a flight condition resembling an inverted spin, which was unrecoverable. It was impossible to exit through the jump door. \r\nThe contributing factors were the following:\r\n1. There was a fatigue crack on the wing strut. Because of the damage to the aircraft it was not possible to investigate the mechanism of the fatigue crack formation. It is possible that, in addition to the stress caused to the aircraft by short flights and high takeoff weights, the temperature changes caused by the exhaust gas stream as well as vibration contributed to the fatigue cracking.\r\n2. The nature of skydiving operations generated many takeoffs and landings in relation to flight hours. A significant part of the operations was flown close to the maximum takeoff weight. These factors increased the structural stress.\r\n3. The pilot’s limited flight experience on a powerful turboprop aircraft, his inadequate training as regards aircraft loading and its effects on the centre of gravity and airplane behavior, the high weight of the aircraft and the aft position of the CG in the beginning of a new jump line and, possibly, the pilot’s incorrect observation of the actual visual horizon contributed to the onset of the occurrence. During the turn to a new jump run the aircraft began to descend and very rapidly accelerated close to its maximum permissible airspeed. The pilot did not immediately realize this.\r\n4. The structural modifications on the wing increased the loads on the aircraft and the wing struts. Their effects had not been established beforehand. The kit manufacturer was aware of the modifications. No changes to the Permit to build were applied for in writing regarding the modifications. Neither the build supervisor nor the aircraft inspectors were aware of the origin or the effects of the modifications."}