{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-springfield", "date": "Jan 6, 2011 at 1100 LT", "type": "Learjet 35", "operator": "Priester-Aviation-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago - Springfield", "msn": "35A-158", "yom": 1978, "flight_number": "PWA800", "city": "Springfield-Abraham Lincoln", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5932, "captain_hours_type": 827, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16506, "circumstances": "The flight encountered light rime icing during an instrument approach to the destination airport. The copilot was the pilot flying at the time of the accident. He reported that the airframe anti-icing system was turned off upon intercepting the instrument approach glide slope, which was shortly before the airplane descended below the cloud layer. He recalled observing light frost on the outboard wing and tip tank during the approach. The stick shaker activated on short final, and the airplane impacted left of the runway centerline before it ultimately departed the right side of the runway pavement and crossed a slight rise before coming to rest in the grass. The cockpit voice recorder transcript indicated that the pilots were operating in icing conditions without the wing anti- ice system activated for about 4 1/2 minutes prior to activation of the stick shaker. A postaccident examination of the airplane did not reveal any anomalies consistent with a preimpact failure of the flight control system or a loss of anti-ice system functionality. A performance study determined that the airplane’s airspeed during the final 30 seconds of the flight was about 114 knots and that the angle of attack ultimately met the stick shaker threshold. The expected stall speed for the airplane was about 93 knots. The airplane flight manual stated that anti-ice systems should be turned on prior to operation in icing conditions during normal operations. The manual warned that even small accumulations of ice on the wing leading edge can cause an aerodynamic stall prior to activation of the stick shaker and/or stick pusher.\n", "probable_cause": "The pilot’s decision to conduct an instrument approach in icing conditions without the anti-ice system activated, contrary to the airplane flight manual guidance, which resulted in an inadvertent aerodynamic stall due to an in-flight accumulation of airframe icing.\n"}