{"url": "https://www.baaa-acro.com/crash/crash-tupolev-ant-9-kazan", "date": "Aug 18, 1933 at 1821 LT", "type": "Tupolev ANT-9 (PS-9)", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kazan - Kazan", "msn": "151", "yom": 1933, "flight_number": null, "city": "Kazan", "zone": "Republic of Tatarstan", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": null, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The three engine airplane departed Kazan on a local test flight, carrying nine passengers and two crew members, one pilot and one mechanic. After a local flight of about 13 minutes, the crew decided to return to the airport. On short final, at a height of about 30-35 metres, the airplane collided with a Polikarpov U-2 registered CCCP-S227. Operated by Osoaviakhima (Kazan Aero Club), the airplane was completing a local flight with two pilots on board. It appears that on final, the Polikarpov was flying above the ANT-9 and cut his track before the collision occurred. The Polikarpov dove into the ground and was destroyed. Both pilots were seriously injured and died two hours later. The Tupolev continued for few seconds before it crashed near the runway, coming to rest broken in two. All 11 occupants were slightly injured. ", "probable_cause": "It was determined that the collision was the consequence of a poor organization between the crew and the Kazan Airport Authorities as no proper procedures were in place at the time of the accident for such test flight. The pilot of the Polikarpov failed to bring attention to potential traffic and did not realize the presence of the second aircraft. On his side, the pilot of the ANT-9 was unable to see the Polikarpov flying above him due to the upper wings position. "}