{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-trislander-iii-1-great-barrier-island", "date": "Jul 5, 2009 at 1305 LT", "type": "Britten-Norman Trislander", "operator": "Great%20Barrier%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Great Barrier Island - Auckland", "msn": "322", "yom": 1972, "flight_number": null, "city": "Great Barrier Island", "zone": "Auckland Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 868, "captain_hours_type": 28, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At about 1300 on Sunday 5 July 2009, ZK-LOU, a 3-engined Britten Norman BN2A Mk III Trislander operated by Great Barrier Airlines (the company), took off from Great Barrier Aerodrome at Claris on Great Barrier Island on a regular service to Auckland International Airport. On board were 10 passengers and a pilot, all of whom were wearing their seat belts. That morning the pilot had flown a different Trislander from Auckland International Airport to Claris and swapped it for ZK-LOU for the return flight because it was needed for pilot training back in Auckland. Another company pilot had that morning flown ZK-LOU to Claris from North Shore Aerodrome. He had completed a full engine run-up for the first departure of the day, as was usual, and said he noticed nothing unusual with the aeroplane during the approximate 30-minute flight. For the return flight the pilot said he completed the normal after-start checks in ZK-LOU and noticed nothing abnormal. He did not do another full engine run-up because it was not required. He taxied the aeroplane to the start of sealed runway 28, applied full power while holding the aeroplane on brakes and rechecked that the engine gauges were indicating normally before starting the take-off roll. The aeroplane took off without incident, but the pilot said when it was climbing through about 500 feet he heard an unusual “pattering” sound. He also heard the propellers going out of synchronisation, so he attempted to resynchronise them with the propeller controls. He checked the engine’s gauges and noticed that the right engine manifold pressure and engine rotation speed had dropped, so he adjusted the engine and propeller controls to increase engine power. At that time there was a loud bang and he heard a passenger scream. Looking back to his right the pilot saw that the entire propeller assembly for the right engine was missing and that there was a lot of oil spray around the engine cowling. The pilot turned the aeroplane left and completed the engine failure and shutdown checks. He transmitted a distress call on the local area frequency and asked the other company pilot, who was airborne behind him, to alert the local company office that he was returning to Claris. The company office manager and other company pilot noticed nothing unusual with ZK-LOU as it taxied and took off. The other pilot was not concerned until he saw what looked like white smoke and debris emanate from the aeroplane as though it had struck a flock of birds. Despite the failure, ZK-LOU continued to climb, so the pilot said he levelled at about 800 feet and reduced power on the 2 serviceable engines, completed a left turn and crossed over the aerodrome and positioned right downwind for runway 28. There was quite a strong headwind for the landing, so the pilot elected to do a flapless landing and keep the power and speed up a little because of the possibility of some wind shear. The pilot and other personnel said that the cloud was scattered at about 2500 feet, that there were a few showers in the area and that the wind was about 15 to 20 knots along runway 28. The visibility was reported as good. After landing, the pilot stopped the aeroplane on the runway and checked on the passengers before taxiing to the apron. At the apron he shut down the other engines and helped the passengers to the terminal, where they were offered drinks. The company chief executive, who lived locally, and a local doctor attended to the passengers. Three of the passengers received some minor abrasions and scrapes from shattered Perspex and broken interior lining when the propeller struck the side of the fuselage.", "probable_cause": "Findings are listed in order of development and not in order of priority.\r\n- The engine propeller assembly separated from the right engine of ZK-LOU in flight and struck the fuselage when the crankshaft failed at the flange that connected it to the propeller hub.\r\n- High-cycle fatigue cracking on the flange that had developed during normal operations from undetected corrosion had reached a critical stage and allowed the flange to fail in overload.\r\n- The crankshaft had inadvertently passed its overhaul service life by around 11% when the failure occurred, but the company had not realized this because of an anomaly in the recorded overseas service hours prior to importation of the engine to New Zealand. Ordinarily, the crankshaft would have been retired before a failure was likely.\r\n- The crankshaft was an older design that has since been progressively superseded by those with flanges less prone to cracking.\r\n- There was no requirement for a specific periodic crack check of the older-design crankshaft flanges, but this has been addressed by the CAA issuing a Continuing Airworthiness Notice on the issue.\r\n- The CAA audit of the company had examined whether its engine overhaul periods were correct, but the audit could not have been expected to discover the anomaly in the overseas-recorded engine hours.\r\n- This failure highlighted the need by potential purchasers of overseas components to follow the guidelines outlined in CAA Advisory Circular 00-1 to scrutinize overseas component records to ensure that the reported in-service hours are accurate."}