{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-11f-shanghai-8-killed", "date": "Apr 15, 1999 at 1604 LT", "type": "McDonnell Douglas MD-11", "operator": "Korean%20Air%20Cargo2", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Shanghai - Seoul", "msn": "48409", "yom": 1992, "flight_number": "KE6316", "city": "Shanghai-Hongqiao", "zone": "Shanghai", "country": "China", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 5, "total_fatalities": 8, "captain_hours": 12898, "captain_hours_type": 4856, "copilot_hours": 1826, "copilot_hours_type": 1152, "aircraft_hours": 28347, "circumstances": "On April 15, 1999, Korean Air cargo flight KE6316, a McDonnell Douglas MD-11F, Korean registration HL7373, departed from runway 18 at Shanghai-Hongqiao International Airport, for Seoul, Korea with 2 pilots and 1 flight technician on board at 16:01:35 Beijing local time (08:01:35 UTC time). The autopilot was off 1 minute 7 seconds (at 16:02:42) after takeoff. The airplane maneuvered first to the right, and then kept level flight at approximately 200° track for more than 30 seconds, and maneuvered back to the left. The crew was subsequently cleared to climb to 1,500 meters (4,900 feet) during which the airplane turned to NHW** at 900 meters (3,000 feet). The airplane passed 1,310 meters at 16:04:15, the airplane suddenly executed a very rapid descent after reaching 1,370 meters (4,500 feet) at 16:04:19 and then the airplane disappeared from the airport SSR screen. The airplane crashed into the ground at 16:04:35 according to Shanghai Seismic Bureau's measurement. The distance from the accident site to the airport runway is 11.6 kilometers, the site azimuth is 165° from the center of the runway centerline. The aircraft was totally destroyed and all three crew members were killed as well as five people on the ground. Thirty-six other people were injured, four seriously. ", "probable_cause": "The joint investigative team determines that the probable cause of the Korean Air flight KE 6316 accident was the flight crew's loss of altitude situational awareness resulting from altitude clearance wrongly relayed by the first officer and the crew's overreaction with abrupt flight control inputs."}