{"url": "https://www.baaa-acro.com/crash/crash-antonov-12bp-chelyabinsk-9-killed", "date": "May 26, 2008 at 2011 LT", "type": "Antonov AN-12", "operator": "Moskovia%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "No", "site": "Plain, Valley", "schedule": "Chelyabinsk - Perm", "msn": "8 3 455 08", "yom": 1968, "flight_number": "GIA9675", "city": "Chelyabinsk", "zone": "Chelyabinsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 42817, "circumstances": "Following an uneventful cargo flight from Moscow to Chelyabinsk where a load of 9 tons of various goods was deplaned, the aircraft was ferried to Perm. One minute after takeoff from Chelyabinsk Airport runway 09, while climbing in marginal weather conditions, the crew declared an emergency and reported smoke in the cockpit. After being cleared to return, the crew completed a circuit. During a third turn to the left, while in a left bank of 15° and at a speed of 335 km/h, both left engines failed and their propellers autofeathered. About 40 seconds later, the aircraft entered a right turn then descended to the ground and crashed in an open field located 11 km from Chelyabinsk Airport, bursting into flames. The accident occurred 8 minutes after takeoff. The aircraft was totally destroyed and all 9 occupants were killed. ", "probable_cause": "The accident was the result of a loss of controllability due to the destruction of the aileron control cables while carrying out an emergency approach to Chelyabinsk Airport after smoke spread in the cabin and the cockpit. The destruction of aileron wiring occurred, presumably, in the area of the 23-25 web frames of the cargo hold. The reason for the destruction of the wiring installation has most likely been a significant heating of a control rod located in this zone, made of alloy D16-T, and its subsequent break under tension-load operation. Heating of the control rod could be a consequence of fire of the aircraft's electricity network, in immediate proximity of the control rod. This led smoke to spread in the cargo hold, unexpected triggering of alarm systems, aircraft equipment failures, and the auto-shutdown of two engines. Electrical bunch-conductors, distributors, blocks and aggregates of the aeronautical equipment, located in the 15-25 frames zone (ceiling of the cargo compartment) came under intense attack by fire, resulting in a collision collision with the ground, as a result of which it was impossible to accurately determine the primary origin and reason of the fire."}