{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-grand-central", "date": "Nov 25, 2012 at 1027 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Devenco Trading", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Grand Central – Tzaneen", "msn": "31-7405496", "yom": 1974, "flight_number": null, "city": "Grand Central (Midrand)", "zone": "Gauteng", "country": "South Africa", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1699, "captain_hours_type": 1, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8029, "circumstances": "On the morning of 25 November 2012 at 0902Z the pilot, sole occupant on board the aircraft, took off from FAGC to FATZ. He filed an IFR flight plan to cruise at F110 in controlled airspace. The take-off roll and initial climb from RWY 17 was uneventful and passing FL075 FAGC Tower Controller transferred the aircraft to Johannesburg Approach Control (Approach) on 124.5 MHz. On contact with Approach the pilot was cleared to climb to FL110. On the climb approaching FL090 the aircraft lost power on the left engine, oil pressure dropped and the cylinder head temperature increased. He then advised Approach of the problem and requested to level out at FL090 to attempt to identify the problem. He requested radar vectors from Approach to route direct to FAGC and proceeded to shut down the left engine. The pilot continued routing FAGC using the right engine but was unable to maintain height. He noticed the oil pressure and manifold pressure on the right engine dropping. The pilot also reported seeing fire through the cooling vents of the right engine cowling. The pilot requested distance to FAGC from Approach and was told it is 2.5nm (nautical miles) and the aircraft continued loosing height. An update from Approach seconds later indicated that the aircraft was 1nm from FAGC. The pilot decided to do a wheels up forced landing on an open field when he realized that the aircraft was too low. He landed wheels up in a wings level attitude. The aircraft impacted and skidded across an uneven field and came to a stop 5m from Donovan Street. The pilot disembarked the aircraft and attempted to put out the fire which had started inflight on the right engine but without success. Eventually the right wing and the fuselage were engulfed by fire. Minutes later the FAGC fire department using two vehicles extinguished the fire. The pilot escaped with no injuries and the aircraft was destroyed by the ensuing fire. ", "probable_cause": "An inspection the left wings outboard tank was full and the main tank was empty. Both fuel selectors were also found on main tanks (left and right) position. Unsuccessful forced landing due to fuel starvation and the cause of the fire was undetermined. The left engine failed because of fuel exhaustion and the cause of fire could not be determined. "}