{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-26-islander-derby", "date": "May 22, 1989 at 1350 LT", "type": "Britten-Norman Islander", "operator": "Cockatoo Island Airways", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Cockatoo Island - Derby", "msn": "3005", "yom": 1982, "flight_number": null, "city": "Derby", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot had planned the direct track for the flight from Cockatoo Island to Derby at 5,500 feet above sea level. When the pilot gave his DEPARTURE call he amended his cruising level to below 5,000 feet. No further calls were received from the aircraft. The Cockatoo Island workboat was 56 kilometres north-north-west of Derby, and approximately 20 kilometres west of the direct track between Cockatoo Island and Derby. The crew of the boat observed an aircraft approaching at very low level. The aircraft passed over the boat approximately 5-7 metres above the deck, and entered a right hand turn. During the turn the right wing tip struck the water causing the aircraft to cartwheel and crash about 400 metres from the boat. The fuselage broke open on impact and the occupants were subsequently rescued by the crew of the boat. ", "probable_cause": "The pilot declined to provide any information which might have clarified the circumstances of the accident, however, available information indicates that he carried out an unauthorized low pass over the boat. During the turn following the low pass, he misjudged the aircraft's height and the right wing tip struck the water. \r\nThe following factors were considered relevant to the development of the accident:\r\n- The pilot was neither trained nor authorized to conduct operations at low level,\r\n- The pilot exercised poor judgement by operating at an unnecessarily low height,\r\n- The pilot misjudged his height above the water."}