{"url": "https://www.baaa-acro.com/crash/crash-morane-saulnier-ms760-paris-ii-santa-ana-3-killed", "date": "Nov 30, 1996 at 1307 LT", "type": "Morane-Saulnier M.S.760 Paris", "operator": "Robert E. J. Morris", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "5", "yom": 1958, "flight_number": null, "city": "Santa Ana-John Wayne", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2169, "captain_hours_type": 201, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3334, "circumstances": "Shortly after takeoff, the pilot radioed the air traffic control tower declaring an emergency and stating his intent to return for landing. He stated that he had taken off with an external boarding ladder attached to the aircraft. Several witnesses reported that the aircraft's downwind leg was too close to the airport causing the aircraft to overshoot the turn to the final approach course, and that the pilot increased the aircraft's bank angle as he tried to align the aircraft with the landing runway. As the aircraft was intercepting the final approach course, it abruptly rolled inverted, the nose dropped, and the aircraft spiraled onto the roof of an industrial building. A Boeing 757 aircraft, landing on the same runway, had passed over the accident site 2 minutes and 17 seconds earlier. The B-757 was cleared to land before the accident aircraft received a takeoff clearance and was on the runway when the pilot declared the emergency and turned downwind. The local controller did not issue a wake turbulence advisory. Experienced MS760 pilots reported that the aircraft will exhibit no adverse performance or safety affects with the boarding ladder attached. ", "probable_cause": "The pilot's failure to maintain an adequate airspeed margin while maneuvering in a steep banked turn to the landing runway, which resulted in an inadvertent stall/spin. Factors in the accident were: the pilot's inadequate preflight inspection of the aircraft in that he departed with the boarding ladder attached to the aircraft's exterior; the pilot's inadequate in-flight planning in that he flew a traffic pattern so close to the runway that it required excessive bank angles to align the aircraft with the landing runway; and the aircraft's probable encounter with the periphery of a weakened B-757 wake turbulence, which increased the wing's angle of attack beyond the stall point at a critical point during a steep banked turn."}