{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-3b5c-andaman-sea-115-killed", "date": "Nov 29, 1987 at 1152 LT", "type": "Boeing 707", "operator": "Korean%20Air-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Baghdad - Abu Dhabi - Bangkok - Seoul", "msn": "20522", "yom": 1971, "flight_number": "KE858", "city": "Andaman Sea", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 11, "crew_fatalities": 11, "pax_on_board": 104, "pax_fatalities": 104, "other_fatalities": 0, "total_fatalities": 115, "captain_hours": 11161, "captain_hours_type": 5416, "copilot_hours": 3882, "copilot_hours_type": 134, "aircraft_hours": 36047, "circumstances": "A Boeing 707-300 passenger plane, registered HL7406, was destroyed in an accident in the Indian Ocean, some 100 km off the coast of Myanmar. All 104 passengers and eleven crew members were killed. Korean Air flight 858 departed Baghdad, Iraq on a scheduled service to Seoul, South Korea. En route stops were planned at Abu Dhabi, UAE and Bangkok, Thailand. At 00:01 UTC Flight 858 departed Abu Dhabi, climbing to a cruising altitude of FL370. Last radio contact was at 05:01 UTC when the crew reported that they estimated reaching the TAVOY waypoint over the Andaman Sea at 05:22. Flight 858 was declared missing when it failed to arrive at the destination. On December 13, 1987 a local schooner found pieces of wreckage floating northwest off Tavoy, Myanmar. Korean Authorities, suspecting sabotage after the aircraft became missing, started checking on passengers who disembarked at Abu Dhabi and traced the suspects Mr.Hachiya Shinichi and Miss Hachiya Mayumi to Bahrain where they were apprehended while going through exit formalities at the airport. It was reported that they were found to be holding false Japanese Passports. While being held for interrogation, both committed suicide by taking poison capsules hidden in the cigarettes and Mr.Hachiya Shinichi died. Miss Hachiya Mayumi who survived the attempt was extradited to South Korea. It was reported that the passengers were found to be named Mr. Kim Sung-il and Miss Kim Hyon-hui of North Korean origin. For her role in the bombing Kim Hyun Hui was sentenced to death in March 1989. However, South Korean president Roh Tae-woo pardoned her in 1998.", "probable_cause": "In flight explosion of time bomb planted in the aircraft by the two saboteurs disguised as passengers. Investigation revealed that the bomb consisted of a composition C4 type explosive hidden in a battery operated portable transistor radio which was used as a timing device. The timer was activated while they were awaiting embarkation at Baghdad Airport and set to go off 9 hours later. Together with the transistor radio, a liquor bottle containing liquid explosive (type PLX) was taken on board and placed in the overhead baggage rack above seat row n°7 in the forward cabin section of the economy class compartment where they were seated. These timed explosives were left in that place when they disembarked at Abu Dhabi."}