{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-south-bimini-1-killed", "date": "Apr 16, 2021 at 2142 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Goyo Air", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "South Bimini – Miami-Opa Locka", "msn": "31-7652094", "yom": 1976, "flight_number": null, "city": "South Bimini", "zone": "Bimini", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2085, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7102, "circumstances": "The airplane crashed moments after takeoff from the South Bimini Int’l Airport (MYBS), Bimini, Bahamas. The private flight departed MYBS with intended final destination of Opa Locka Airport (KOPF), Opa Locka, Florida, USA. The pilot sustained serious injuries and after being seen by medical personnel in South Bimini, was flown to Nassau, Bahamas for further medical attention. The passenger who occupied the right seat of the aircraft, succumbed to injuries he sustained as a result of the initial impact and subsequent crash sequence and subsequent submersion in the waters at the end of the runway environment. The pilot was a US certified commercial pilot with ratings for airplane land, single and multi-engine as well as an instrument airplane rating. The pilot’s medical certificate was valid at the time of the accident. The passenger (pilot’s son) also held a valid US certified private pilot – single engine land – airplane certificate. It is unknown what role (if any) the passenger (son) played during the takeoff to crash sequence. The weather conditions at the time of the accident was night (instrument meteorological conditions). A weak high pressure ridging was forecasted to continue to dominate the weather over the Bahamas throughout the night. However, no significant weather was anticipated.", "probable_cause": "The AAIA has determined the probable cause of this accident to be loss of control inflight (LOC-I), resulting in uncontrolled flight into terrain (ocean). The cause of this loss of control could not be determined."}