{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-palwaukee-3-killed", "date": "Nov 28, 2011 at 2250 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Trans North Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jesup - Chicago", "msn": "31-7652044", "yom": 1976, "flight_number": null, "city": "Chicago-Executive (Palwaukee)", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 6607, "captain_hours_type": 120, "copilot_hours": 314, "copilot_hours_type": null, "aircraft_hours": 17630, "circumstances": "The airplane was dispatched on an emergency medical services flight. While being vectored for an instrument approach, the pilot declared an emergency and reported that the airplane was out of fuel. He said the airplane lost engine power and that he was heading toward the destination airport. The airplane descended through clouds and impacted trees and terrain short of its destination. No preimpact anomalies were found during a postaccident examination. The postaccident examination revealed about 1.5 ounces of a liquid consistent with avgas within the airplane fuel system. Based on the three previous flight legs and refueling receipts, postaccident calculations indicated that the airplane was consuming fuel at a higher rate than referenced in the airplane flight manual. Based on this consumption rate, the airplane did not have enough fuel to reach the destination airport; however, a 20-knot tailwind was predicted, so it is likely that the pilot was relying on this to help the airplane reach the airport. Regardless, he would have been flying with less than the 45-minute fuel reserve that is required for an instrument flight rules flight. The pilot failed to recognize and compensate for the airplane’s high fuel consumption rate during the accident flight. It is likely that had the pilot monitored the gauges and the consumption rate for the flight he would have determined that he did not have adequate fuel to complete the flight. Toxicology tests showed the pilot had tetrahydrocannabinol and tetrahydrocannabinol carboxylic acid (marijuana) in his system; however, the level of impairment could not be determined based on the information available. However, marijuana use can impair the ability to concentrate and maintain vigilance and can distort the perception of time and distance. As a professional pilot, the use of marijuana prior to the flight raises questions about the pilot’s decision-making. The investigation also identified several issues that were not causal to the accident but nevertheless raised concerns about the company’s operational control of the flight. The operator had instituted a fuel log, but it was not regularly monitored. The recovered load manifest showed the pilot had been on duty for more than 15 hours, which exceeded the maximum of 14 hours for a regularly assigned duty period per 14 Code of Federal Regulations Part 135. The operator stated that it was aware of the pilot’s two driving while under the influence of alcohol convictions, but the operator did not request a background report on the pilot before he was hired. Further, the operator did not list the pilot-rated passenger as a member of the flight crew, yet he had flown previous positioning legs on the dispatched EMS mission as the pilot-in-command. ", "probable_cause": "The pilot's inadequate preflight planning and in-flight decision-making, which resulted in a loss of engine power due to fuel exhaustion during approach. Contributing to the accident was the pilot's decision to operate an airplane after using illicit drugs.\n"}