{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46f-1-cu-commando-puerto-lobos-1-killed", "date": "Aug 18, 1966 at 1830 LT", "type": "Curtiss C-46 Commando", "operator": "Aerovias Halcón", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Rio Grande – Rio Gallegos – Buenos Aires", "msn": "22534", "yom": 1945, "flight_number": null, "city": "Puerto Lobos", "zone": "Chubut", "country": "Argentina", "region": "South America", "crew_on_board": 4, "crew_fatalities": 1, "pax_on_board": 12, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 8000, "captain_hours_type": 1200, "copilot_hours": 4000, "copilot_hours_type": 900, "aircraft_hours": 24589, "circumstances": "The aircraft was on a cargo flight from Rio Grande (Tierra del Fuego) to Ezeiza Airport, with an intermediate stop at Rio Gallegos (Santa Cruz). An IFR flight plan was filed for an off-airway overwater flight directly from Rio Gallegos to Ezeiza. The pilot-in-command stated that at 1700 hours and shortly after passing abeam of Comodoro Rivadavia he noticed that the No. 1 engine oil was low, the indicator reading approximately 23 US gallons. It should be pointed out that, although the pilot testified to being already beyond Comodoro Rivadavia at 1700 hours, he in fact reported abeam of that position to control tower of Comodoro Rivadavia Airport at 1720 hours. Thinking that the instrument might not be functioning correctly, he checked it while the mechanic looked out of the window but saw no signs of leakage. The check revealed that the engine was consuming a gallon of oil every 15 minutes. Temperature and pressure were normal. Under the circumstances, he decided to land at Trelew for an engine check and oil refill, his calculations having indicated that he would lose four gallons in the process and still have 17 remaining on landing. Meanwhile, the mechanic, who was still watching the engine, noticed oil flames which confirmed the leakage of oil. The pilot believed that he would sight Trelew before nightfall, but that he would have to make a night landing. After a few minutes the low oil pressure warning light for No. 2 engine came on, simultaneously the temperature rose and the pressure indicator oscillated, so he gave orders to stop the engine and feather the propeller. It was then 1735 hours and he was flying visually, having passed through the cloud layer over the area. The sun was no longer visible. He decided that there was no other alternative but to continue towards Trelew and then to find a landing strip, and at 2 700 m started to descend in order to cool No. 1 engine which had heated to 1100 on account of the greater power combined with slower speed. He descended gradually to 1 200 m to cool the engine as much as possible. He then gave orders to restart No. 2 engine, which was done, but it seized. He again had it stopped and the propeller feathered, and at this juncture considered the situation extremely serious since owing to height and speed loss he would reach Trelew after 1835 hours. At 450 m after calculating the cargo and fuel weight, the pilot ordered the greatest possible amount of cargo to be jettisoned and some 1 200 kg were thrown out. At 300 m he decided to make for the coast and try to ditch in the sea with only the port engine operating. The night was very dark and the shore, which lay to the north, could not be seen distinctly. Visibility was better towards 'the south. After heading out over the sea and making a 2700 turn to the left, he decided, as the aircraft descended, to come down parallel to the coast as close to it as possible taking care not to approach too close to avoid hitting any rocks. The passengers were briefed for the emergency and a door was left open, since at the moment of impact both the co-pilot and engineer would be occupied in cutting the battery, generators, magnetos, fuel cocks and operating the landing gear. With the lights extended and turned on, the pilot was able to see the water but not judge his height. When the altimeter registered zero, he started to draw back the control column and cut out the one operating engine until he realized the aircraft had hit the water. It travelled forward some 200 m, veered round to the right and came to a stop. It hit some rocks in the process losing the port engine, and other serious damage was caused by the uneven rocky bottom. The time was about 1830 hours and, according to the relevant tables, it had been completely dark since 1811 hours. The aircraft's position was 650 18' W, 43O 52' S. After ascertaining that no one had been injured, the 5-seat life raft was inflated. Owing to the lack of adequate life-saving equipment for everyone, the occupants of the aircraft reached the shore with the greatest difficulty, some in the life raft, others clinging to the sides. The engineer took an oxygen flask, jumped into the sea and disappeared from sight dragged down by the current, and in the darkness he could not be found. The cabin attendant and one passenger, who had decided to remain on top of the aircraft, left it when the tide fell enough for them to walk to shore. One crew member disappeared while trying to swim to shore. Damage to the aircraft and powerplant was estimated at 90% resulting from impact and subsequent immersion. The aircraft's cargo of hides and wool was a total loss.", "probable_cause": "Decision to continue a flight with both engines impaired until ditching at night became inevitable, instead of making an emergency daytime landing on any of the various runways in the area at a time when the situation made it clear that this operation was inevitable. The pilot's action in planning the flight and in continuing it in the above- described circumstances was deficient and imprudent. He was carrying passengers in a cargo aircraft in defiance of existing regulations and in spite of the notification of such prohibition by the airline. This breach of regulations was further aggravated by the fact that a person without proper licence had been permitted to act as mechanic on board. For this latter infraction, the airline owning the aircraft should also be held responsible."}