{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90a-king-air-mount-airy-6-killed", "date": "Feb 1, 2008 at 1128 LT", "type": "Beechcraft 90 King Air", "operator": "Blue Sky Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cedartown - Mount Airy", "msn": "LJ-1678", "yom": 2003, "flight_number": null, "city": "Mount Airy", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 780, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 800, "circumstances": "While flying a non precision approach, the pilot deliberately descended below the minimum descent altitude (MDA) and attempted to execute a circle to land below the published circling minimums instead of executing the published missed approach procedure. During the circle to land, visual contact with the airport environment was lost and engine power was never increased after the airplane had leveled off. The airplane decelerated and entered an aerodynamic stall, followed by an uncontrolled descent which continued until ground impact. Weather at the time consisted of rain, with ceilings ranging from 300 to 600 feet, and visibility remaining relatively constant at 2.5 miles in fog. Review of the cockpit voice recorder (CVR) audio revealed that the pilot had displayed some non professional behavior prior to initiating the approach. Also contained on the CVR were comments by the pilot indicating he planned to descend below the MDA prior to acquiring the airport visually, and would have to execute a circling approach. Moments after stating a circling approach would be needed, the pilot received a sink rate aural warning from the enhanced ground proximity warning system (EGPWS). After several seconds, a series of stall warnings was recorded prior to the airplane impacting terrain. EGPWS data revealed, the airplane had decelerated approximately 75 knots in the last 20 seconds of the flight. Examination of the wreckage did not reveal any preimpact failures or malfunctions with the airplane or any of its systems. Toxicology testing detected sertraline in the pilot’s kidney and liver. Sertraline is a prescription antidepressant medication used for anxiety, obsessive-compulsive disorder, panic disorder, posttraumatic stress disorder, and social phobia. The pilot’s personal medical records indicated that he had been treated previously with two other antidepressant medications for “anxiety and depression” and a history of “impatience” and “compulsiveness.” The records also documented a diagnosis of diabetes without any indication of medications for the condition, and further noted three episodes of kidney stones, most recently experiencing “severe and profound discomfort” from a kidney stone while flying in 2005. None of these conditions or medications had been noted by the pilot on prior applications for an airman medical certificate. It is not clear whether any of the pilot’s medical conditions could account for his behavior or may have contributed to the accident.", "probable_cause": "The pilot's failure to maintain control of the airplane in instrument meteorological conditions. Contributing to the accident were the pilot's improper decision to descend below the minimum descent altitude, and failure to follow the published missed approach procedure."}