{"url": "https://www.baaa-acro.com/crash/crash-cessna-208a-caravan-i-anavilhanas-archipelago-1-killed", "date": "Oct 17, 2017 at 1240 LT", "type": "Cessna 208A Caravan", "operator": "Greenpeace", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Manaus - Anavilhanas Archipelago", "msn": "208A-0510", "yom": 2009, "flight_number": null, "city": "Anavilhanas Archipelago", "zone": "Amazonas", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 8535, "captain_hours_type": 660, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The single engine aircraft departed Manaus-Eduardo Gomes Airport at 1220LT on a flight to the Anavilhanas Archipelago, carrying cargo, four passengers and one pilot. Upon landing on the Rio Negro, the airplane struck the water surface and crashed upside down before coming to rest partially submerged. The pilot and three passengers were rescued while a fourth passenger was killed.", "probable_cause": "The aircraft landed on the water with the landing gear in the down position. \r\nContributing factors:\r\n- Attitude – a contributor\r\nFailure to comply with the checklist during the pre-flight inspection and the flight itself favored the landing with inadequate configuration. This attitude may have been triggered by the pilot's confidence in his operational capability, because of his long experience in aviation.\r\n- Flight indiscipline – a contributor\r\nFailure to comply with the checklist indicated, in addition to the low level of situational awareness, a low level of concern for the safe conduction of the flight by failing to follow basic procedures set forth in the manufacturer's manuals and current regulations.\r\n- Piloting judgement – a contributor\r\nThe pilot's choice not to use the checklist during the flight phases revealed an inadequate evaluation of parameters related to the operation of the aircraft. Improper compliance with the items in the Pre-Flight Inspection Sheet prevented the AMPHIB PUMP 1 and 2 circuit breakers from being rearmed.\r\n- Aircraft maintenance – a contributor\r\nAfter performing the test of landing gear extension and retraction by the emergency system, the AMPHIB PUMP 1 and 2 circuit breakers were not rearmed, being the aircraft delivered to fly in this condition. The setting recorded on the AIRSPEED switch of the landing gear position warning system computer demonstrated that the scheduled speed of 74kt was not in accordance with the recommended in the 9600-1A installation manual of Wipaire Inc. in its revision G.\r\n- Memory – undetermined\r\nThe AMPHIB PUMP 1 and 2 circuit breakers were found disarmed after the occurrence, indicating that, after the completion of the maintenance service, the executor of the tasks probably forgot to comply with the procedures for reconfiguring the aircraft. In addition, it is possible that the pilot's automatism in relation to his way of carrying out the air operations, without the use of the checklist, has prevented the correct perception of the circuit breakers condition and the erroneous positioning of the landing gear.\r\n- Perception – a contributor\r\nThe accomplishment of the landing on the water with the aircraft in inadequate configuration for the situation denotes a decrease in the level of situational awareness of the pilot, considering that the necessary factors and conditions for the safety of the operation were not observed.\n"}