{"url": "https://www.baaa-acro.com/crash/crash-antonov-2-kikhshik-1-killed", "date": "Mar 20, 1962 at 1545 LT", "type": "Antonov AN-2", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Petropavlovsk-Kamshatsky – Ust-Bolsheretsk – Kikhshik – Petropavlovsk-Kamshatsky", "msn": "1 33 473 20", "yom": 26, "flight_number": null, "city": "Kikhshik", "zone": "Kamchatka Krai", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4544, "circumstances": "The aircraft departed Ust-Bolsheretsk Airfield at 1520LT bound for Kikhshik, carrying five passengers, a crew of two, 117 kilos of mail, 176 kilos of various goods, among them 58 bottles of alcool and 300 kilos of luggage. After takeoff, the crew was instructed to return to Ust-Bolsheretsk in case they encounter snow en route. Few minutes into the flight, weather conditions deteriorated with snow falls and clouds down to 300 meters when the captain decided to continue the flight to Kikhshik at an insufficient altitude of 100 meters (minimum safe altitude fixed at 250 meters on this route). Approaching Kikhshik Airfield, the pilot-in-command attempted to land and made a steep turn to the right when control was lost. The airplane struck the ground 570 meters on the left of the airfield, bounced and came to rest 70 meters farther. All seven occupants were injured and the aircraft was destroyed. Two days later, one of the passenger died from his injuries. The captain was seriously injured. ", "probable_cause": "The crew neglected the ATC instructions and decided to continue the flight under VFR mode in IMC conditions. The approach to Kikhshik was completed below minima with an insufficient visibility of 1,000 meters and the pilot made a turn to the right at an excessive angle of 30° and at a too low altitude to expect recovery. Poor weather conditions at destination was considered as a contributing factor. "}