{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-82-phuket-90-killed", "date": "Sep 16, 2007 at 1540 LT", "type": "McDonnell Douglas MD-82", "operator": "One-Two-Go%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bangkok - Phuket", "msn": "49183/1129", "yom": 1983, "flight_number": "OG269", "city": "Phuket", "zone": "Phuket (ภูเก็ต)", "country": "Thailand", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 5, "pax_on_board": 123, "pax_fatalities": 85, "other_fatalities": 0, "total_fatalities": 90, "captain_hours": 16752, "captain_hours_type": 4330, "copilot_hours": 1465, "copilot_hours_type": 1240, "aircraft_hours": 65965, "circumstances": "On 16 September 2007 at approximately 14:30 hours, One Two Go Airlines' McDonnell-Douglas MD-82 airplane with nationality and registration mark HS-OMG, departed on a scheduled passenger flight number OG269 from Don Mueang International Airport for Phuket International Airport with 123 passengers and 7 crew members on board. The Pilot-in-Command (PlC) seated on the left was a Pilot not Flying (PNF) / Pilot Monitoring and the Co-pilot seated on the right was a Pilot Flying (PF). The flight was en route on airways G458 at Flight Level (FL) 320 (32,000 feet) and the estimated time of arrival at Phuket International Airport was 15:50 hours. At 15:36:21, during the time that flight OG269 was approaching the Phuket International Airport, the Orient Thai Airlines flight OX2071, while vacating from Runway 27 after landed at the Phuket International Airport, reported the Air Traffic Controller (ATC) of the weather condition prior to landing that Cumulonimbus (CB) was over the airport area and there was windshear at 5 nautical miles before reaching the Instrument Landing System (ILS) station, resulted in airspeed gain and loss of 15 knots. The ATC asked flight OG269 whether they acknowledged the weather conditions reported by flight OX2071, because both flights were on the same aerodrome radio frequency (118.1 MHz). The PlC of flight OG269 acknowledged the information and extended the landing gears for landing. At 15:37:31, the ATC informed flight OG269 of surface winds from 240 degrees at 15 knots and gave clearance to land on Runway 27 with-wet runway precaution. At 15:38:27, the ATC informed flight OG269 of surface winds from 240 degrees at 30 knots and asked the flight OG269 to state its intention of landing. The flight OG269 affirmed. At 15:39:00, the flight OG269 requested for information of surface wind condition. The ATC informed a surface wind condition of 240 degrees at 40 knots and the flight OG269 acknowledged. At that instant, the Radio Altitude Aural Call-Out system automatically called out '500 feet' and the PlC called out that the airspeed was at 136 knots. At 15:39:23, the PlC ordered for more engine power and reminded the copilot that the airplane was descending below the ILS glide path. The copilot affirmed the correction. The PIC then ordered to increase engine power three more times. During that time, the airplane was at the altitude of 100 feet. At 15:39:45, the Radio Altitude Aural Call-Out system automatically called out '40 feet' and the Enhanced Ground Proximity Warning System (EGPWS) called out 'sink rate - sink rate' . At 15:39:49, the copilot called out for a go-around and the PIC said 'Okay, Go Around'. At 15.39.50, the copilot called for 'flaps 15' and transferred the airplane control to the PIC. Then, the PIC told the copilot to set the autopilot airplane heading and to retract the landing gear. At 15 :40: 11, the airplane veered off and hit an embankment located in the North of Runway 27 and broke up in flames. 40 people were rescued while 90 others were killed, among them five crew members. ", "probable_cause": "After thorough investigation, the AAIC determined that the probable causes of accident are as follows:\r\n1. the flight crew did not follow the Standard Operating Procedure (SOP) of Stabilized Approach, Call Out, Go Around, and Emergency Situation as specified in the Airlines’ Flight Operation Manual (FOM).\r\n2. the Take Off/ Go Around (TO/GA) switch was not pressed, resulting in the failure of increasing in airspeed and altitude during the go around. Also, there was no monitoring of the change in engine power and movement of throttle levers, especially during the emergency situation.\r\n3. the flight crew coordination was insufficient and the flight crew had heavy workloads.\r\n4. the weather condition changed suddenly over the airport vicinity.\r\n5. the flight crew had accumulated stress, insufficient rest, and fatigue.\r\n6. the transfer of aircraft control took place at a critical moment, during the go around."}