{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3c-near-levy-18-killed", "date": "Jan 7, 1948 at 0745 LT", "type": "Douglas DC-3", "operator": "Coastal Air Lines", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Newark – Philadelphia – Raleigh – Miami", "msn": "12968", "yom": 1944, "flight_number": null, "city": "Levy", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 25, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 18, "captain_hours": 2250, "captain_hours_type": 1072, "copilot_hours": 4348, "copilot_hours_type": 454, "aircraft_hours": 2409, "circumstances": "After refueling to 600 gallons of gasoline, the flight departed at 0553 on an instrument flight plan to Miami, via Airway Amber 7, at an altitude of 2,000 feet. The crew reported over the Florence, South Carolina, range station at 0643 at an altitude of 2,000 feet. At 0716 they reported over Charleston, South Carolina, at an altitude of 2,000 feet, and estimated their arrival over Savannah at 0744. This was the last communication received from the flight. Between Charleston and Savannah, Co-pilot Eick left the cockpit to obtain navigational charts, during which time he heard one or both of the engines run roughly. By the time he returned to his seat, however, both engines were again operating normally. A few minutes later both engines stopped, and the fuel pressure gauges were observed to be at zero. The wobble pump was used, different positions of the fuel tank selector valves were tried, the cross-feed valves were turned to the “on” position, but no fuel pressure could be obtained. When it became apparent that the engines could not be restarted, Captain Antonioli informed the co-pilot that it would be necessary to make a forced landing in a nearby marsh, and instructed him to see that the passengers were secured by safety belts. Co-pilot Eick proceeded immediately to the cabin where he buckled the safety belts of 4 or 5 passengers. Then he felt the airplane turning steeply, and he attempted to return to the cockpit. By the time he reached the radio compartment passageway between the passenger cabin and the cockpit he was forced to the floor by centrifugal force. The aircraft shuddered as though in a stall, and crashed. Witnesses on a nearby barge saw the aircraft approaching from a north-westerly direction at an altitude estimated to be 1,000 feet, descending without audible engine noise. It was observed to enter a gliding turn to the left which was continued for about one and one-half revolutions, until the airplane crashed into a marsh and burst into flames. A pilot and 17 passengers were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the lack of fuel management which caused engine failure and resulted in a forced landing during which control was lost of the aircraft."}