{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-goteborg", "date": "Dec 23, 1967 at 0901 LT", "type": "Douglas DC-6", "operator": "Sterling-Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Stockholm – Göteborg", "msn": "43275/192", "yom": 1951, "flight_number": "NB821", "city": "Göteborg-Torslanda", "zone": "Västergötland", "country": "Sweden", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 49, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5602, "captain_hours_type": null, "copilot_hours": 5459, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight NB821, a non-scheduled air transport operation from Stockholm-Arlanda Airport to Gothenburg-Torslanda Airport, took off from Arlanda on 23 December 1967 at 0637 hours GMT. The aircraft was flown in accordance with an approved flight plan. The first approach was discontinued at critical height due to insufficient visual references. During the second approach the pilot-in-command took over the aircraft at a low altitude and landed. A heavy touchdown was made on runway 22 approximately 3,000 feet after the threshold at 0801 hours GMT. The aircraft sustained substantial damage and all 55 occupants were evacuated safely. ", "probable_cause": "The Board determines the cause of the accident was non-regulative use of reverse before firm ground contact. The following contributing factors were reported:\r\n- The pilot-in-command took over the controls and continued the approach just after the co-pilot had started to level off at minimum altitude,\r\n- The approach was high,\r\n- The touchdown was made 3 000 ft after the threshold,\r\n- The pilot-in-command applied reverse power before ground contact,\r\n- The pilot-in-command's action was most probably affected by the high approach and the short runway."}