{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-hattiesburg-4-killed", "date": "May 4, 2021 at 2305 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Northshore%20Group", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Shepard AFB - Destin", "msn": "760", "yom": 1980, "flight_number": null, "city": "Hattiesburg-Bobby L. Chain", "zone": "Mississippi", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 1, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On May 4, 2021, about 2305 central daylight time, a Mitsubishi MU-2B-60 airplane, N322TA, was destroyed when it was involved in an accident near Hattiesburg, Mississippi. The pilot and two passengers were fatally injured. The airplane collided with a private residence; one occupant was fatally injured, and two other occupants sustained minor injuries. The airplane was operated under the provisions of Title 14 Code of Federal Regulations Part 91 as a personal flight. According to Automatic Dependent Surveillance-Broadcast (ADS-B) data provided by the Federal Aviation Administration (FAA), the flight departed Wichita Falls Municipal Airport (SPS), Wichita Falls, Texas, about 2057 and was en route to the Bobby L Chain Municipal Airport (HBG), Hattiesburg, Mississippi. The pilot had filed and activated an instrument flight rules (IFR) flight plan. The pilot requested and received clearance to fly the RNAV 13 approach to HBG. The airplane flew to the initial approach fix, performed the procedure turn, and flew a portion of the final approach course. The last ADS-B point was recorded at 2300 about 1.6 miles northwest from the accident site, at an altitude of 1,475 ft mean sea level (msl). An Alert Notification (ALNOT) was issued by air traffic control when the pilot did not provide a cancellation radio call as required after the instrument approach to a non-towered airport. At 2320, law enforcement received a 911 call reporting the accident. There were no radio distress calls recorded from the pilot. The airplane impacted the front section of an occupied residence about 2.2 miles from the approach end of runway 13. A post impact fire ensued and consumed a majority of the airplane and the residential structure. Cockpit instrumentation was mostly consumed by the post-impact fire. The flaps were found at 20° down, and landing gear was extended at the time of impact. According to FAA records, the pilot held a private pilot certificate with ratings for airplane single engine land, multiengine land, and instrument airplane. Documents provided by his MU-2 training facility revealed the pilot completed a flight review in the accident airplane on November 13, 2020, and completed Advisory Circular 91-89 approved MU-2 recurrent training on November 14, 2020. The pilot had purchased the airplane in February 2012. An associate of the pilot reported that the pilot owned a MU-2F model before he acquired the B model. On June 24, 2020, the pilot was issued a second-class medical certificate. On the medical certificate application, the pilot reported having accrued 7,834 total hours. The airplane was not equipped, and was not required to be equipped, with any type of crashresistant recorder device.", "probable_cause": null}