{"url": "https://www.baaa-acro.com/crash/crash-cessna-411-corona-2-killed", "date": "Nov 25, 2004 at 1434 LT", "type": "Cessna 411", "operator": "M3 Services", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Corona - Corona", "msn": "411-0050", "yom": 1965, "flight_number": null, "city": "Corona", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 650, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The multiengine airplane impacted terrain shortly after departing from the airport. The airplane began the initial climb after liftoff and initially maintained a track along the extended runway centerline. Witnesses indicated that about 1 mile into the initial climb, the aircraft began to make erratic yawing maneuvers and the engines began to emit smoke. The airplane rolled to the left and dove toward the ground, erupting into fire upon impact. Prior to the accident, the pilot had reportedly been having mechanical problems with the fuel tank bladder installations and had attempted to install new ones. He was performing his own maintenance on the airplane in an attempt to rectify the problem. The day before the accident, the pilot told his hangar mate that he took the airplane on a test flight and experienced mechanical problems with an engine. Neither the nature of the engine problems nor the actions to resolve the discrepancies could be determined. On site examination of the thermally destroyed wreckage disclosed evidence consistent with the right engine producing significantly more power than the left engine at ground impact. The extent of the thermal destruction precluded any determination regarding the fuel selector positions, the positions for the boost pump switches, or the fuel tanks/lines.", "probable_cause": "A loss of engine(s) power for undetermined reasons. Also causal was the pilot's failure to maintain the airplane's minimum controllable airspeed (Vmc) during the initial climb following a loss of power in one engine, which resulted in a loss of aircraft control and subsequent impact with terrain."}