{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-101-douglas-2-killed", "date": "Apr 4, 2003 at 1830 LT", "type": "Fletcher FU-24", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Plain, Valley", "schedule": "Stratford - Stratford", "msn": "200", "yom": 1973, "flight_number": null, "city": "Douglas", "zone": "Taranaki Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1438, "captain_hours_type": 340, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5332, "circumstances": "The pilot had arranged to topdress properties for three clients, one of whom had three separate blocks to be treated. He departed from Stratford Aerodrome at 0653 hours in ZK-LTF for the first airstrip, located some 7 km to the north-east. After an initial reconnaissance flight, he began topdressing at 0722, and finished this block at 1034 hours. Via brief landings at Stratford and another airstrip 11 km to the north, he positioned the aircraft to a strip near Huiroa. The remainder of the day’s work was carried out from this strip. Four blocks were treated from this location: the first was 8 km to the north-west of the strip, the second immediately to the north, the third some 3 km west and the last 4.5 km to the south, adjacent to the Strathmore Saddle. A  reconnaissance of the fourth block was flown at 1518, but actual spreading on this property was not commenced until 1755 hours. Two loads of urea were spread on the fourth block between 1755 and 1812 hours, with a 12-minute pause until the final take-off at 1824. During this break, the last of the urea was loaded, the fertiliser bins secured and the loading vehicle parked. It is not known if the aircraft was refuelled at this time. The loader driver boarded the aircraft after completing his duties, the apparent intention being to accompany the pilot back to Stratford on completion of the last drop. On arrival over the property at 1825, the pilot performed one run towards the south, made a left reversal turn, spread another swath on a northerly heading, and pulled up to commence another reversal turn to the left. At some time after this pull-up, the aeroplane struck the ground heavily on a south-westerly heading, killing both occupants on impact. Later in the evening, the pilot’s wife reported the aircraft and its occupants overdue, and a ground search was commenced, initially by friends and associates. The wreckage and the bodies of the crew were found about half an hour after midnight.  The accident occurred during evening civil twilight, at approximately 1830 hours NZST, adjacent to the Strathmore Saddle, at an elevation of about 530 feet.", "probable_cause": "Conclusions:\r\n- The pilot was licensed, rated and fit for the flights being undertaken.\r\n- The aeroplane had a current Airworthiness Certificate and had been maintained in accordance with current requirements.\r\n- No pre-accident aircraft defect was found.\r\n- The impact was consistent with partial recovery from a dive with insufficient height to do so.\r\n- No conclusive reason could be found for the aircraft to have been in such a situation.\r\n- Light conditions were probably conducive to difficult height judgement.\r\n- The pilot’s judgement may have further been eroded by fatigue and a degree of carbon monoxide absorption.\r\n- The accident was not survivable. "}