{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90gti-king-air-oranjestad", "date": "Apr 3, 2012 at 0920 LT", "type": "Beechcraft 90 King Air", "operator": "Lider", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Wichita - Fort Lauderdale - Willemstad - Belo Horizonte", "msn": "LJ-2042", "yom": 2011, "flight_number": null, "city": "Oranjestad", "zone": "Dutch Antilles", "country": "Dutch Antilles", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11700, "captain_hours_type": 2600, "copilot_hours": 3649, "copilot_hours_type": 33, "aircraft_hours": 14, "circumstances": "On April 3, 2012, about 0920 atlantic standard time (ast), a Hawker Beechcraft C90GTx, N8116L, operated by Lider Taxi Aereo, was substantially damaged after ditching in the waters of the Caribbean Sea, 17 miles north of Aruba, following a dual loss of engine power during cruise. The flight departed Fort Lauderdale Executive Airport (FXE), Fort Lauderdale, Florida, and was destined for Hato International Airport (TNCC), Willemstad, Curacao. The airline transport pilot and the pilot rated passenger were uninjured. Visual meteorological conditions prevailed, and an instrument flight plan was filed for the delivery flight conducted under 14 Code of Federal Regulations Part 91. The Amsterdam arrived at the ditching location at 1120. The airplane was partially submerged. The crew of the Amsterdam attempted to prevent the airplane from sinking by placing a cable around it and hoisting it onboard. However during the attempted recovery, the fuselage broke in half and the airplane sank. \n", "probable_cause": "Review of the fuel ticket revealed that the misspelled words; \"Top Neclles\" was handwritten on it. It was also signed by the pilot. Further review revealed that only 25 gallons had been uploaded to the airplane, and this number had been entered in the box labeled \"TOTAL GALLONS DELIVERED\". Review of the start reading and end reading from the truck meter also concurred with this amount. Furthermore, It was discovered that the \"134 gallons\" that the pilot believed had been uploaded to the airplane was in fact the employee number of the fueler that had topped off the nacelle tanks and had entered his employee number on the \"FUEL DEL BY:\" line. Utilizing the information contained on the fuel ticket, it was determined that the airplane had departed with only 261 gallons of fuel on-board. Review of performance data in the POH/AFM revealed that in order to complete the flight the airplane would have needed to depart with 328 gallons on-board.\n"}