{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-envira", "date": "Jan 31, 2000 at 1030 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Amazonas", "flight_phase": "Landing (descent or approach)", "flight_type": "Government", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tefé - Eirunepé", "msn": "110-498", "yom": 1990, "flight_number": null, "city": "Envira", "zone": "Amazonas", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 17, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4800, "captain_hours_type": 4000, "copilot_hours": 2000, "copilot_hours_type": 1600, "aircraft_hours": null, "circumstances": "En route from Tefé to Eirunépé, weather conditions deteriorated and the crew decided to divert to the non controlled Envira Airport. Following a visual approach in heavy rain falls, the aircraft landed 500 metres past the runway threshold. After touchdown, the crew started the braking procedure but the aircraft encountered aquaplaning conditions and was unable to stop within the remaining distance. It overran and came to rest 100 metres further in a ravine. The captain was seriously injured, the copilot suffered minor injuries and all 16 passengers escaped uninjured. ", "probable_cause": "The aircraft suffered aquaplaning after landing and was unable to stop within the remaining distance. The following contributing factors were identified:\r\n- The operator authorized the crew to divert to an unapproved airport with an aircraft weighing more than the limits specified in the operations manual without performing adequate supervision in the execution of the flight;\r\n- Deviations on part of the crew; \r\n- Lack of Crew Resources Management; \r\n- Lack of crew coordination and communication;\r\n- Lack of crew instruction and training on part of the operator;\r\n- Poor weather conditions with heavy rain falls;\r\n- The runway surface was wet and the aircraft suffered aquaplaning;\r\n- The aircraft was overloaded;\r\n- The landing was completed with a tailwind component;\r\n- The crew failed to perform the approach briefing according to published procedures."}