{"url": "https://www.baaa-acro.com/crash/crash-bristol-170-freighter-31m-near-blenheim-5-killed", "date": "May 27, 1953 at 0859 LT", "type": "Bristol 170 Freighter", "operator": "Royal-New-Zealand-Air-Force-3", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "No", "site": "Mountains", "schedule": "Woodbourne - Whenuapai", "msn": "13061", "yom": 1952, "flight_number": null, "city": "Blenheim", "zone": "Marlborough District Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after takeoff from runway 06 at Woodbourne AFB in Blenheim, while climbing, the pilot-in-command made a turn to right when the aircraft entered clouds. Six minutes later, the twin engine airplane hit the slope of a mountain located near Taylor Pass, about 12 km southeast of the airfield. The aircraft was destroyed and all five crew members were killed. \r\nCrew:\r\nCpt Richard Webb, \r\nF/Lt James Brookes, \r\nF/Sgt Phillip Diebert, \r\nSgt John Collins,\r\nSgt Thomas Dean.", "probable_cause": "It was determined that Captain Richard Webb who was the commanding officer at Whenuapai boarded the flight at Woodbourne. He was not a qualified pilot on the Bristol 170 but was at controls when the accident occurred. It was established that he was seating in the left hand seat while the captain on this flight occupied the right hand seat as pilot in second. The departure was completed under IFR from runway 06 and the airplane entered clouds during the initial climb. Instead of continuing strait ahead over the Cook Strait, the airplane turned to the right over a mountainous area. Navigation instruments were not tuned to the correct beacon (Blenheim NDB), which was considered as a contributory factor."}