{"url": "https://www.baaa-acro.com/crash/crash-learjet-24f-near-guadalajara-2-killed", "date": "Jan 9, 2007 at 2323 LT", "type": "Learjet 24", "operator": "Ameristar%20Jet%20Charter2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Laredo – Guadalajara", "msn": "24-348", "yom": 1977, "flight_number": "AJI878", "city": "Guadalajara", "zone": "Jalisco", "country": "Mexico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On January 9, 2007, at 2323 central standard time, a Gates Learjet model 24F airplane, N444TW, serial number 348, was destroyed upon impact with terrain, about 18.8 nautical miles east of Guadalajara, State of Jalisco, in the Republic of Mexico. The airline transport-rated pilot and the commercial pilot functioning as first officer were fatally injured. The airplane was registered to the Sierra American Corporation of Wilmington, Delaware, and was being operated by Ameristar Jet Charter, Inc., of Addison, Texas, as Ameristar flight 878, a Title 14 Code of Federal Regulations Part 135 on-demand cargo flight. Night visual meteorological conditions prevailed and an instrument flight rules (IFR) flight plan was filed for the flight from Laredo, Texas. The cargo flight had originated in Laredo, Texas, at about 2210, with the Don Miguel Hidalgo International Airport (MMGL) near Guadalajara, Mexico, as its intended destination. Mexican Air Traffic Control personnel reported that the flight had approached MMGL from the north. At 2313, Guadalajara Approach Control cleared the flight to descend to 12,000 feet, provided an altimeter setting of 30.28, and told the flight to expect radar vectors for the ILS runway 28 approach to MMGL. After being provided a vector of 190 to intercept the localizer for the ILS runway 28 approach, there were communications between the flight and the controller to clarify which runway was active, and at 2318:00, the flight was given a right turn to a heading of 200 degrees. At 2318:56 the flight was cleared to descend to 10,000 feet, and at 2320:38, the flight was cleared to descend to 9,000 feet. The airplane was last observed on radar descending through 9,200 feet, while crossing the GDL VOR 085 degree radial.", "probable_cause": "Controlled flight into terrain. "}