{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-richland-2-killed", "date": "Jul 27, 1996 at 0855 LT", "type": "Cessna 340", "operator": "FBN Inc.", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Richland - Richland", "msn": "340A-1268", "yom": 1981, "flight_number": null, "city": "Richland", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4239, "captain_hours_type": 1240, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot-under-instruction (PUI) who possessed an expired medical, and the pilot-in-command (PIC), an ATP pilot with 1240 hours in the Cessna 340, departed on the third training flight for the PUI in the aircraft. The second training flight, flown the previous Saturday, had included single-engine work. The aircraft was observed in the vicinity of the Richland airport by witnesses, several of whom reported the left propeller turning slowly. All witnesses reported seeing the aircraft descending rapidly to the ground in a nose down attitude and several witnesses described the descent as a spin. The aircraft impacted the ground in a near vertical, nose low attitude and was destroyed by fire. Postcrash examination of the aircraft revealed the left propeller in the feathered position and power signatures on the blades of the right propeller. Disassembly of both engines revealed no pre-impact mechanical malfunction. The gear and flaps were up and the rudder trim tab showed about 5 degrees of left tab trim. The information manual for the Cessna 340 indicates that the air minimum control speed (single engine), Vmca is 82 KIAS. The manual also indicates that a more suitable airspeed for one engine inoperative training events is 91 KIAS.", "probable_cause": "The pilot-in-command's allowing the aircraft's airspeed to decrease below the single-engine minimum control speed (Vmc) resulting in a stall/spin condition. Factors contributing to the accident were the pilot-in-command's allowing the left engine to be shut down as well as his allowing the aircraft's airspeed to decelerate below the manufacturer's recommended intentional one-engine inoperative airspeed. A third factor was the aircraft's low altitude at the stall/spin entry which precluded a successful recovery. "}