{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-566-tunis-14-killed", "date": "May 7, 2002 at 1518 LT", "type": "Boeing 737-500", "operator": "Egyptair", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cairo - Tunis", "msn": "25307", "yom": 1991, "flight_number": "MS843", "city": "Tunis-Carthage", "zone": "Tunis Governorate (ولاية تونس‎)", "country": "Tunisia", "region": "Africa", "crew_on_board": 8, "crew_fatalities": 3, "pax_on_board": 55, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 4509, "captain_hours_type": 1549, "copilot_hours": 880, "copilot_hours_type": 639, "aircraft_hours": 26082, "circumstances": "The aircraft departed Cairo-Intl Airport at 1140LT on a regular schedule flight to Tunis-Carthage Airport with 56 passengers and six crew members on board. It entered the Tunis FIR at 1450LT, under control of the Tunis Regional CCR. After being transferred to the approach control at 1500LT, the crew was cleared for a VOR/DME approach to runway 11. On approach at 3,000 feet, the crew was informed he was number one for landing. The crew informed ATC that he departed 3,000 feet for 2,100 feet at 12 NM and wa later cleared to land. Wind was from 130 at 30 knots. At 1516LT, on final, the crew was transferred from the approach control to the tower and received a second clearance to land. In limited visibility, the aircraft struck a fence located on the top of a mountain and crashed in hilly terrain 6,6 km from the runway 11 threshold. Three crew members and 11 passengers were killed while 48 other people were injured. On board were 33 Egyptians including the six crew members, 16 Tunisians, three Algerians, three Jordans, two Chinese, two British, one Libyan, one Saudi and one Palestinian. ", "probable_cause": "The accident was due to the crew's failure to perform and control the final approach. This was materialized by the failure to respect the approach fix associated with the decision to start the final approach prematurely.\r\nThe following contributing factors were identified:\r\n- The poor weather conditions that prevailed at the time of the accident, particularly the limited visibility,\r\n- The shortcomings noted in the training of both pilots, particularly those relating to conventional VOR/DME approaches,\r\n- The relative weakness of the flight experience of both crew members on the type of aircraft operated."}