{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-21a-goose-marathon", "date": "Jan 29, 2008 at 1723 LT", "type": "Grumman G-21A Goose", "operator": "Wave Runner Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Marathon - Marathon", "msn": "B129", "yom": 1946, "flight_number": null, "city": "Marathon", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16000, "captain_hours_type": 100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 24456, "circumstances": "On January 29, 2008, about 1723 eastern standard time, a Grumman G-21A, amphibian airplane N21A, impacted the ocean during landing near Marathon, Florida. The certificated airline transport pilot and passenger received serious injuries and the airplane sustained substantial damage. The flight was operated as a personal flight under the provisions of 14 Code of Federal Regulations (CFR) Part 91, and no flight plan was filed. Visual meteorological conditions prevailed at the time of the accident. The flight departed from the Florida Keys Marathon Airport (MTH) in Marathon, Florida, on January 29, 2008, about 1615. According to the pilot he departed MTH and after take off and the checklist accomplished he proceeded in a westerly direction to inspect a water-work area. The pilot stated that other then that, he had no further recollection of the flight. According to the Federal Aviation Administration (FAA) the passenger stated that the pilot was practicing takeoffs and landings. During a water landing, the left wing contacted the water and the airplane water looped. A Good Samaritan rescued them from the water in his boat and brought them ashore where rescue personal were waiting. Examination of the airplane by the FAA revealed no mechanical malfunctions or failures of the airplane or engine, and none were reported by the pilot or passenger.", "probable_cause": "The pilot’s failure to maintain control of the airplane during a water landing."}