{"url": "https://www.baaa-acro.com/crash/crash-noorduyn-norseman-near-san-antonio-de-los-cobres-1-killed", "date": "Oct 23, 1955 at 1400 LT", "type": "Noorduyn Norseman", "operator": "LATN", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "No", "site": "Mountains", "schedule": "Mexico City – Antofagasta – Salta – Asunción", "msn": null, "yom": null, "flight_number": null, "city": "San Antonio de los Cobres", "zone": "Salta", "country": "Argentina", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a delivery flight from Mexico City to Asunción, Paraguay, with intermediate stops at Antofagasta, Chile and Salta, Argentina. At 1245LT the aircraft took off from Antofagasta for Salta. It was to be a VFR flight via Chosque, Chile and San Antonio de los Cobres, Salta Province. The aircraft was seen at 1400 hours flying in a straight line at very low altitude in the direction of San Antonio de los Cobres 40 km east of Olapacato. One witness, believing that the aircraft intended to land, followed it in a jeep only to find its burned wreckage some 20 km away. It had crashed into the side of a hill rising north of Rio Tocomar, approximately 70 metres above the river bed. The height above sea level at this point is approximately 4,500 metres. One eye witness stated that the aircraft crashed in rectilinear horizontal flight into the northern slope of the hill and that the pilot had not taken any avoiding action. The pilot, the sole occupant, was killed, and the aircraft was destroyed by the crash and the fire which followed.", "probable_cause": "The accident was attributed to a loss of control over the aircraft due to a possible state of anoxia on the part of the pilot. A contributing factor was inadequate flight preparation, as no account was taken of the need for oxygen- breathing equipment for high altitude flying. "}