{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-near-leninabad-4-killed", "date": "Nov 18, 1948 at 0708 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Mountains", "schedule": "Stalinabad – Leninabad – Tashkent", "msn": "184 229 09", "yom": 27, "flight_number": null, "city": "Leninabad", "zone": "Sughd Province", "country": "Tajikistan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2948, "circumstances": "The crew was completing a cargo flight from Stalinabad to Tashkent with an intermediate stop in Leninabad, carrying a load of tires, construction goods, ropes and tuns. After the aircraft overflew Jizzhak, the captain started the descent through thick clouds. At this moment, the crew was unaware that the aircraft was off course due to strong winds when, at an altitude of 700 meters, the aircraft hit the west slope of a mountain located in the Mogol-Tau Mountain Range, about 31 km from Leninabad. Rescuers arrived on site a day later and were able to evacuate a wounded crew member while four other occupants were killed. ", "probable_cause": "It was determined that the accident was caused by the combination of the following factors:\r\n- Rough indiscipline of the captain who violated several rules and requirements,\r\n- Poor organization of aircraft flight planning and mismanagement of aircraft traffic,\r\n- Wrong decision taken regarding the weather forecast, \r\n- Lack of assistance and guidance during the flight, regarding the deterioration of the weather along the route,\r\n- Poor control of flight operations,\r\n- Lack of professionalism on part of the Stalinabad AMSC that transmitted to the crew undue weather, wrong weather forecasting with conditions worse than predicted, \r\n- Poor organization and operational control to ensure safety,\r\n- Failure to provide the appropriate Leninabad radio equipment for the aircraft, \r\n- Lack of leadership on part of the RDS in Stalinabad and Tashkent, \r\n- Lack of accurate instructions on part of the ADS in Leninabad."}