{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-412-taipei-83-killed", "date": "Oct 31, 2000 at 2318 LT", "type": "Boeing 747-400", "operator": "Singapore-Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Singapore – Taipei – Los Angeles", "msn": "28023/1099", "yom": 1997, "flight_number": "SQ006", "city": "Taipei-Taoyuan (ex Chiang Kai-shek)", "zone": "Taipei City (臺北市)", "country": "Taiwan", "region": "Asia", "crew_on_board": 20, "crew_fatalities": 4, "pax_on_board": 159, "pax_fatalities": 79, "other_fatalities": 0, "total_fatalities": 83, "captain_hours": 11235, "captain_hours_type": 2017, "copilot_hours": 2442, "copilot_hours_type": 552, "aircraft_hours": 18459, "circumstances": "Singapore Airlines Flight 006 departed Singapore for a flight to Los Angeles via Taipei. Scheduled departure time at Taipei was 22:55. The flight left gate B-5 and taxied to taxiway NP, which ran parallel to runway 05L and 05R. The crew had been cleared for a runway 05L departure because runway 05R was closed because of construction work. CAA Taiwan had issued a NOTAM on Aug 31, 2000 indicating that part of runway 05R between Taxiway N4 and N5 was closed for construction between Sept. 13 to Nov. 22, 2000. Runway 05R was to have been converted and re-designated as Taxiway NC effective Nov. 1, 2000. After reaching the end of taxiway NP, SQ006 turned right into Taxiway N1 and immediately made a 180-degree turn to runway 05R. After approximately 6 second hold, SQ006 started its takeoff roll at 23:15:45. Weather conditions were very poor because of typhoon 'Xiang Sane' in the area. METAR at 23:20 included Wind 020 degrees at 36 knots gusting 56 knots, visibility - 600 meters, and heavy rainfall. On takeoff, 3.5 seconds after V1, the aircraft hit concrete barriers, excavators and other equipment on the runway. The plane crashed back onto the runway, breaking up and bursting into flames while sliding down the runway and crashing into other objects related to work being done on runway 05R. The aircraft wreckage was distributed along runway 05R beginning at about 4,080 feet from the runway threshold. The airplane broke into two main sections at about fuselage station 1560 and came to rest about 6,480 feet from the runway threshold.", "probable_cause": "Findings related to probable causes:\r\n- At the time of the accident, heavy rain and strong winds from typhoon \"Xangsane\" prevailed. At 2312:02 Taipei local time, the flight crewmembers of SQ006 received Runway Visual Range (RVR) 450 meters on Runway 05L from Automatic Terminal Information Service (ATIS) \"Uniform\". At 2315:22 Taipei local time, they received wind direction 020 degrees with a magnitude of 28 knots, gusting to 50 knots, together with the takeoff clearance issued by the local controller.\r\n- On August 31, 2000, CAA of ROC issued a Notice to Airmen (NOTAM) A0606 indicating that a portion of the Runway 05R between Taxiway N4 and N5 was closed due to work in progress from September 13 to November 22, 2000. The flight crew of SQ006 was aware of the fact that a portion of Runway 05R was closed, and that Runway 05R was only available for taxi.\r\n- The aircraft did not completely pass the Runway 05R threshold marking area and continue to taxi towards Runway 05L for the scheduled takeoff. Instead, it entered Runway 05R and CM-1 commenced the takeoff roll. CM-2 and CM-3 did not question CM-1's decision to take off.\r\n- The flight crew did not review the taxi route in a manner sufficient to ensure they all understood that the route to Runway 05L included the need for the aircraft to pass Runway 05R, before taxiing onto Runway 05L.\r\n- The flight crew had CKS Airport charts available when taxing from the parking bay to the departure runway; however, when the aircraft was turning from Taxiway NP to Taxiway NI and continued turning onto Runway 05R, none of the flight crewmembers verified the taxi route. As shown on the Jeppesen \"20-9\" CKS Airport chart, the taxi route to Runway 05L required that the aircraft make a 90-degree right turn from Taxiway NP and then taxi straight ahead on Taxiway NI, rather than making a continuous 180-degree turn onto Runway 05R. Further, none of the flight crewmembers confirmed orally which runway they had entered.\r\n- CM-1's expectation that he was approaching the departure runway coupled with the saliency of the lights leading onto Runway 05R resulted in CM?1 allocating most of his attention to these centerline lights. He followed the green taxiway centerline lights and taxied onto Runway 05R.\r\n- The moderate time pressure to take off before the inbound typhoon closed in around CKS Airport, and the condition of taking off in a strong crosswind, low visibility, and slippery runway subtly influenced the flight crew's decision?making ability and the ability to maintain situational awareness.\r\n- On the night of the accident, the information available to the flight crew regarding the orientation of the aircraft on the airport was:\r\n- CKS Airport navigation chart\r\n- Aircraft heading references\r\n- Runway and Taxiway signage and marking\r\n- Taxiway NI centerline lights leading to Runway 05L\r\n- Color of the centerline lights (green) on Runway 05R\r\n- Runway 05R edge lights most likely not on\r\n- Width difference between Runway 05L and Runway 05R\r\n- Lighting configuration differences between Runway 05L and Runway 05R\r\n- Para-Visual Display (PVD) showing aircraft not properly aligned with the Runway 05L localizer\r\n- Primary Flight Display (PFD) information\r\nThe flight crew lost situational awareness and commenced takeoff from the wrong runway.\r\nThe Singapore Ministry of Transport (MOT) did not agree with the findings and released their own report. They conclude that the systems, procedures and facilities at the CKS Airport were seriously inadequate and that the accident could have been avoided if internationally-accepted precautionary measures had been in place at the Airport."}