{"url": "https://www.baaa-acro.com/crash/crash-noorduyn-norseman-near-port-alice-4-killed", "date": "Feb 4, 1944 at 1355 LT", "type": "Noorduyn Norseman", "operator": "Royal-Canadian-Air-Force-31", "flight_phase": "Flight", "flight_type": "Military", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Port Alice - Coal Harbour", "msn": "2", "yom": 1936, "flight_number": null, "city": "Port Alice", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The single engine aircraft departed Port Alice at approximately 1350LT. The winds were out of the southeast and the aircraft took off into the wind in the direction of the head of Neroutsos Inlet. Once airborne the aircraft banked to the left, straightening out on a northwest heading in the direction of Coal Harbour. Now flying with the wind, somewhere over the mill site the aircraft experienced a sudden downdraft, possibly due to the warmer air over the mill area. The aircraft lost lift and entered a stall. In order to regain from the stall the nose of the aircraft was pushed down and power applied but as the Norseman aircraft were under powered a recovery was not possible. The aircraft was heading directly into a rooming house and homes along the main street of the town site. The only place not inhabited was the ball field, just over top of the general store to the right. The aircraft banked right from its flight path, stalled completely, and crashed into the unoccupied ball field near the fuel storage tanks. Sgt Powell, Major Moore and L/Br Scrivenor were killed instantly. W/O Eccles, severely injured was trapped in the wreckage as fuel leaking from the aircraft wreckage ignited and the aircraft caught fire. Sgt. Barker had been thrown clear of the crash on impact. Injured and dazed, Sgt Barker regained his thoughts and made numerous desperate attempts to enter the burning wreckage fighting off the flames and finally succeeded in rescuing W/O Eccles from burning to death. Despite the heroic efforts of Sgt Barker, W/O Eccles later died in the Port Alice Hospital as a result of his injuries.\r\nPilot:\r\nWOII J. J. Eccles. †\r\nPassengers:\r\nSgt H. R. Barker, \r\nMajor J. J. Moore, paymaster, †\r\nSgt L. A. Powell, accounts, †\r\nL/Br E. G. Scrivenor, security. †\r\nSource & photos: http://www.101nisquadron.org/?page_id=690", "probable_cause": "Sgt Barker stated in his interview at the RCAF crash investigation that the aircraft had been flying at an altitude of approximately 600 feet and at speed when the aircraft was hit by a sudden down draft just prior to the crash. This make sense as the hot emissions from the mills boilers, machine room and other mill equipment would be venting in the direction of the aircraft’s flight path. The dense air in the winter months generate lift while warm air is less dense and creates less lift, However the RCAF investigation boards findings were different and placed blame solely on the pilot."}