{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-437-mumbai", "date": "Jan 23, 1971 at 1157 LT", "type": "Boeing 707", "operator": "Air-India", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bombay - Bombay", "msn": "17722/94", "yom": 1960, "flight_number": null, "city": "Mumbai-Chhatrapati Shivaji (Santa Cruz)", "zone": "Maharashtra", "country": "India", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The five crew members were engaged in a local training mission at Bombay-Santa Cruz Airport. During the takeoff roll on three engine, the pilot-in-command lost control of the airplane that deviated to the right and departed the asphalt. The right wing struck a mound of 9 feet high located 188 feet to the right of the runway, causing both right engines n°3 and 4 to be torn off. The aircraft caught fire and came to rest in flames. All five crew members were slightly injured and the aircraft was destroyed. ", "probable_cause": "During a three-engine practice takeoff the check pilot applied full takeoff thrust on n°2 and 3 engines. The aircraft accelerated on two engines and when the speed of 85 kt was attained, the pilot experienced little difficulty in keeping directional control of the aircraft. Thereafter, the pilot applied thrust on engine n°1. The aircraft then went off the runway to the right, n°3 and 4 engines struck a mound 9 feet high located 188 feet from the edge of the runway and were torn off. The wing structure broke off progressively inward and an intense fire broke out. The check pilot admitted that he did not follow the normal procedure specified by Boeing for a 3 engine takeoff and that due to an incorrect reading of the airspeed, he tried to get airborne before reaching VR . Since the nose had been lifted prematurely, nose wheel steering could not be used and control of the aircraft using rudder alone could not be maintained when power on n°1 engine was applied. It was concluded that the accident was caused by the combination of the following factors:\r\n- A loss of control during an attempted three engine takeoff,\r\n- The loss of control was the consequence of the pilot not following the published procedures as mentioned in the aircraft flight manual."}