{"url": "https://www.baaa-acro.com/crash/crash-learjet-45-milan-2-killed", "date": "Jun 1, 2003 at 1526 LT", "type": "Learjet 45", "operator": "Eurojet%20Italia", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Milan - Genoa - Amsterdam", "msn": "45-093", "yom": 2000, "flight_number": "ERJ1570", "city": "Milan-Linate", "zone": "Lombardy", "country": "Italy", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1031, "captain_hours_type": 544, "copilot_hours": 500, "copilot_hours_type": 14, "aircraft_hours": 931, "circumstances": "The aircraft departed Milan-Linate Airport on a positioning flight to Genoa to pick up passengers for Amsterdam. Shortly after takeoff from runway 36R, while in initial climb, the aircraft collided with a flock of pigeons that struck both engines. The crew declared an emergency and reported technical problems without giving any other details. He was cleared for an immediate return and initiated a turn to the east. One minute and 25 seconds after takeoff, the aircraft entered an uncontrolled descent and crashed on a factory located 750 metres southeast from the runway 36R threshold. The aircraft was totally destroyed by impact forces and a post crash fire and both pilots were killed. ", "probable_cause": "The event, triggered by a multiple impact with birds during take-off, was caused by the loss of control in flight of the aircraft, due to an aerodynamic stall during the return to the departure airport, which could not be recovered due to the reduced altitude available.\r\nThe following factors contributed to the event:\r\n- The non-implementation of the procedure provided for in the Flight Manual for engine failure after V1, with particular reference to configuration control (undercarriage and flaps), thrust lever management, definition and achievement of safety altitude, maintenance of expected speeds,\r\n- The lack of CRM, already detectable in the ground procedures phase, but significantly worsened as a result of the emergency,\r\n- The lack of experience of FO, on its first flight of line training on the type of aircraft,\r\n- The inadequacy of the measures and of the bird control activity in the manoeuvring area."}