{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90b-king-air-kiev-5-killed", "date": "Dec 9, 2007 at 1759 LT", "type": "Beechcraft 90 King Air", "operator": "Minib_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Hradec Králové – Kiev", "msn": "LJ-1307", "yom": 1992, "flight_number": null, "city": "Kiev-Zhuliany-Igor Sikorsky", "zone": "Kiev oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 18200, "captain_hours_type": 900, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3257, "circumstances": "The twin engine aircraft departed Hradec Králové on an exec flight to Kiev with four passengers and one pilot on board. On final approach to Kiev-Zhuliany Airport, the pilot encountered poor visibility (below minimums) and descended too fast and too low. On short final, at a speed of 220 knots, the aircraft impacted ground and crashed in a wasteland located 2,590 metres short of runway 08 and 48 metres to the right of its extended centerline. The aircraft was destroyed upon impact and all five occupants were killed, among them the CEO of the Czech company Minib that bought the aircraft last 28 November. According to Czech Authorities, the aircraft was to be transferred to the Czech Republic Registry within January 2008. At the time of the accident, the horizontal visibility was 900 metres and the vertical visibility was 100 feet due to low clouds. ", "probable_cause": "It was determined that the aircraft impacted ground after the pilot continued the approach in below minima weather conditions. \r\nThe following findings were identified:\r\n- The pilot continued the descent below MDA until the aircraft impacted ground, \r\n- Few seconds prior to the accident, ATC instructed twice the pilot to initiate a go-around procedure, but this was too late, \r\n- The pilot was approaching the airport at an excessive speed and below the glide, \r\n- Poor visibility due to low clouds (below minimums)."}