{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1049h-01-06-162-super-constellation-atlantic-ocean-99-killed", "date": "Aug 14, 1958 at 0345 LT", "type": "Lockheed L-1049 Super Constellation", "operator": "KLM-21", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Amsterdam – Shannon – Gander – New York", "msn": "4841", "yom": 1958, "flight_number": "KL607E", "city": "Atlantic Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 91, "pax_fatalities": 91, "other_fatalities": 0, "total_fatalities": 99, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 886, "circumstances": "While cruising at an altitude of 4,000 meters by night, the crew contacted ATC to report his position and all was ok on board. About ten minutes later, the airplane disappeared from radar screens and crashed into the Atlantic Ocean about 180 km northwest of the Irish coast. SAR operations were dispatched on the scene and several debris and bodies were found in the early morning. All operations were suspended after few days and all 99 occupants were considered as deceased. ", "probable_cause": "On the basis of the evidence available and the investigation of possible serious threats to safety, the Board cannot establish the cause of the accident with certainty. Moreover, investigation of the possibility that the cause of the accident may have been a bomb explosion has yielded no conclusive facts to support such a hypothesis. The statements in the press to this effect have either been based on misunderstandings or else were tendentious. On the other hand, the Board attributes a high degree of probability to hypothesis that the cause of the accident is related to 'overspeeding' of one of the outboard propellers resulting from oil pollution after a gear had been damaged when the supercharger of the corresponding engine was accelerated (shifted). This probably took place close to the time of the accident. The overspeeding of the propeller, owing to the obstruction of metal particles in the regulator valves may have been such as to cause the propeller pitch to decrease and the propeller could not be feathered. The condition might provoke a flight disturbance which could be corrected only by prompt and powerful handling of aileron and rudder controls. in view of the rapidity with which this defect develops and taking into account that recognition of the nature of this malfunction requires a certain time, it is not always possible for the crew to intervene early enough to restore conditions of controlled flight. With respect to the presumed cause of the accident the Board has no grounds to suppose that the occurrence of the presumed malfunction might be attributable to neglect on the part of maintenance personnel or to incorrect measures taken by the crew or that the crew had been at fault in piloting the aircraft after the malfunction had occurred."}