{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3a-269-moorhead-14-killed", "date": "Oct 30, 1941 at 0204 LT", "type": "Douglas DC-3", "operator": "Northwest%20Airlines2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago – Minneapolis – Fargo – Billings – Butte – Spokane – Seattle", "msn": "2124", "yom": 1939, "flight_number": "NW005", "city": "Moorhead", "zone": "Minnesota", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 7000, "captain_hours_type": 2275, "copilot_hours": 1300, "copilot_hours_type": 367, "aircraft_hours": null, "circumstances": "The airplane departed Minneapolis-Wold Chamberlain on a flight to Seattle with several intermediate stops. Approaching Fargo-Hector Field at night, the crew encountered icing conditions. The airplane became unstable and pitched up and down. The captain increased engine power when the airplane stalled and crashed in a prairie located in Moorhead, bursting into flames. The airplane was destroyed by a post crash fire. A pilot survived while 14 other occupants were killed.", "probable_cause": "Upon the basis of the foregoing findings and of the entire record available at this time, investigation team found that the probable cause of the accident was the failure of the aircraft, when the inboard portions of the wings were stalled, to respond to the application of full power in the manner reasonably to be expected in the light of the aeronautical knowledge then available.\r\nContributing factors:\r\n- Accumulation of ice on the wings and other surfaces of the airplane, increasing the stalling speed and the drag of the airplane on the power required to maintain flight.\r\n- Failure of the captain, due to his having lost confidence in the air-speed mete to realize his close approach to a stalled condition.\r\n- Action of the captain in descending to attempt a landing at Fargo with known icing conditions and critical ceiling conditions, instead of proceeding to an available alternate.\r\n- Failure of the dispatcher to recognize the seriousness of weather conditions in the vicinity of Fargo and to direct the pilot to proceed to his alternate."}