{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3d-moisville-5-killed", "date": "Aug 11, 1951 at 0925 LT", "type": "Douglas DC-3", "operator": "Air-France-31", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Paris - Paris", "msn": "42971", "yom": 1946, "flight_number": null, "city": "Moisville", "zone": "Eure", "country": "France", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 5302, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5750, "circumstances": "The aircraft took off from Paris-Le Bourget Airport at 0750LT on a flight to test a new type of air scoop. The new scoop was fitted to one engine only to allow comparison tests to be made. Five minutes later, the aircraft reached the altitude of 4,300 feet and four minutes later, at 0759LT, the starboard engine was stopped and the test commenced with a climb on the port engine with cooling gills open. At 0811LT, at an altitude of 6,980 feet, the crew commenced the second phase of the test with the port engine cooling gills in the trail position. Level off was completed at 0822LT at an altitude of 7,900 feet with the cooling gills closed. About an hour later, while flying at a relative low speed, the airplane went out of control and entered a spin, lost its empennage and eventually crashed in a field located in Moisville. The aircraft was destroyed and all five crew members were killed. \r\nCrew:\r\nRené Gallichet, pilot,\r\nLouis Pichard, flight engineer, \r\nJacques Légalité, radio navigator, \r\nLucien Goulay, engineer, \r\nPaul Martin, engineer. ", "probable_cause": "Study of the flight conditions and circumstances of the accident to the aircraft revealed no mechanical defect which might have been the initial cause of the accident. The cause would appear to have been an abnormal flight maneuver made when the crew experienced difficulty in resuming normal flight on two engines. Overspeed, reduction of pitch or difficulty in re-starting the engine may have created a dangerous situation and caused the aircraft to stall in dissymmetrical flight, thus subjecting the airframe to stresses accompanied by buffeting which was either alternating or exceeded the design limits of the structure and caused the tail-plane to break off. "}