{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-18v-bratislava-76-killed", "date": "Jul 28, 1976 at 0937 LT", "type": "Ilyushin II-18", "operator": "CSA-Czech-Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Prague - Bratislava", "msn": "189 0016 05", "yom": 1959, "flight_number": "OK001", "city": "Bratislava-Ivanka-Milan Rastislav Štefánik", "zone": "Bratislava Region", "country": "Slovakia", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 73, "pax_fatalities": 70, "other_fatalities": 0, "total_fatalities": 76, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While descending to runway 22 at Bratislava-Ivanka-Milan Rastislav Štefánik Airport, the crew adopted a wrong approach configuration and descended with a rate of descent of 22 m/s instead of 10 m/s. This caused the airplane to be unstable while its speed varied from 435 to 225 km/h. Flaps were directly selected from zero to full down position, which caused the airplane's speed to decrease. Reverse thrust were activated on both engines n°2 and 3 below the altitude of 1,000 metres. At this time, the engine n°3 failed and in a certain confusion, the crew inadvertently feathered the propeller on engine n°4. During the last segment, about 50 metres above the runway threshold, the captain considered a missed approach and decided to initiate a go-around manoeuvre. The airplane climbed to an altitude of 40 metres and turn to the right when the engine n°4 was restarted. The airplane rolled to the right then stalled and crashed in the Zlaté piersky Lake located one km short of runway 13 threshold, northwest of the airport. Four passengers were rescued while 75 other occupants were killed. Few hours later, one of the survivor died from his injuries.", "probable_cause": "Wrong approach configuration on part of the flying crew who failed to follow the approved procedures. The following contributing factors were reported:\r\n- Poor approach planning, \r\n- Poor crew coordination, \r\n- Unstable approach,\r\n- Failure of the n°3 engine,  \r\n- Reverse thrust activated on engines n°2 and 3 at an unsafe altitude, \r\n- Propeller on engine n°4 inadvertently feathered on approach,\r\n- Inappropriate decisions on part of the captain,\r\n- Poor flight supervision."}