{"url": "https://www.baaa-acro.com/crash/crash-boeing-rb-50g-elint-superfortress-askold-island-16-killed", "date": "Jul 29, 1953 at 0617 LT", "type": "Boeing B-50 Superfortress", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Yokota - Yokota", "msn": "15829", "yom": 1947, "flight_number": null, "city": "Askold Island", "zone": "Primorsky Krai", "country": "Russia", "region": "Asia", "crew_on_board": 17, "crew_fatalities": 16, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 06:15 local time, the RB-50G 'Little Red Ass', temporarily attached to the 91st SRS, was intercepted by two MiG-15 of the 88 GvIAP in 42°38'3\"N, 132°20'9\"E at 20,000 feet over the Sea of Japan after it had violated the Soviet air space near Cape Gamov. What happened next is disputed, according to Soviet reports the fighter pilots instructed the aircraft to land but the gunners opened fire and hit the MiG flown by 1st Lt. Aleksandr D. Rybakov, who subsequently attacked the RB-50 together with his wingman 1st Lt. Yuri M. Yablonskiy and shot it down with cannon fire. US reports claim that the interceptors opened fire first, disabling the #1 engine and the gunners then only returned fire in self-defense, but could not prevent another attack that set #4 engine on fire. The RB-50 went in a sharp dive, but parts of the damaged right wing and tail assembly tore off and the aircraft disintegrated and crashed into the sea about two minutes after being fired upon. At least seven crew members succeeded in bailing out, but only the copilot was rescued after 22 hours by the US destroyer USS Picking (DD 685) from a liferaft that had been dropped for him by a SB-29 about 12 hours after the crash. The destroyer also recovered the body of the pilot who had died of injuries and exposure and the body of a flight engineer was later located on the coast of Japan, while the remaining 13 were reported missing in action. It was suspected that at least some of them were taken prisoner by Soviet PT boats observed to be operating in the area, but it is not known if this was actually the case. \nCrew:\nCpt Stanley Keith O'Kelley, pilot,\nCpt John Ernst Roche, copilot, \nCpt John Cyrus Ward,\nMaj Francisco Joseph Tejeda,\n1st Lt Frank Ernest Beyer,\n1st Lt Edmund Joseph, navigator, \n1st Lt James Gordon Keith, navigator, \n1st Lt Lloyd Clayton Wiggins, navigator, \n1st Lt Warren John Sanderson,\n1st Lt Robert Elbon Stalnaker,\nM/Sgt Francis Luther Brown, flight engineer, \nS/Sgt Donald Wayne Gabree,\nS/Sgt Donald George Hill,\nA1c Roland Edgar Goulet, \nA2c Earl Wilbur Radelin Jr.,\nA2c Charles Joseph Russall,\nA2c James Edwin Woods, tail gunner.\nSource:\nhttp://documents.blackvault.com/documents/dod/readingroom/11/384.pdf", "probable_cause": "Shot down by two Soviet MiG-15 fighters. "}