{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-santa-monica", "date": "Sep 23, 1999 at 0703 LT", "type": "Cessna 421C Golden Eagle III", "operator": "River Transportation", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Long Beach – Santa Monica", "msn": "421C-0832", "yom": 1980, "flight_number": null, "city": "Santa Monica", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4050, "captain_hours_type": 2150, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3915, "circumstances": "During the final approach, while executing a VOR-A instrument approach, the airplane landed hard, collided with the runway VASI display, and caught fire. The airplane had received radar vectors for the approach and was turned to a 20-degree intercept for the final approach course when 2.5 miles from the initial approach fix. Radar track data showed the airplane continued inbound to the field slightly left of course with a ground speed varying between 135 and 125 knots and a descent rate of approximately 700 feet per minute. The pilot said he descended through the clouds about 850 feet above ground level and saw the airport approximately 1 to 2 miles ahead. He noticed that he was left of the runway centerline and corrected to the right. He realized that he had overcorrected and turned back to the left. The pilot reported that he felt that the approach was stabilized although the descent rate was greater than usual. The airplane impacted the ground about 1,000 feet from the approach end of the runway abeam the air traffic control tower on an approximate heading of 185 degrees. The impact collapsed the landing gear and the airplane slid forward another 1,000 feet down the runway and came to rest approximately midfield on the runway. The pilot stated that he had not experienced any mechanical problems with the aircraft or the navigation equipment prior to the accident. A Special Weather Observation taken at the time of the accident contained the following: sky condition overcast at 500 feet; winds from 230 degrees at 3 knots; visibility 2 miles. ", "probable_cause": "The failure of the pilot to establish and maintain a stabilized approach, which resulted in a hard landing and on-ground collision with the airport VASI display. "}