{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-049-constellation-los-angeles", "date": "Nov 25, 1948 at 0552 LT", "type": "Lockheed L-049 Constellation", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Washington DC – Kansas City – Albuquerque – Phoenix – Los Angeles", "msn": "2086", "yom": 1947, "flight_number": "TW211", "city": "Los Angeles", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 18, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15425, "captain_hours_type": 1410, "copilot_hours": 3700, "copilot_hours_type": 490, "aircraft_hours": 4343, "circumstances": "As Flight 211 approached Los Angeles, clearance was given to pass over the Los Angeles Municipal Airport, and the tower there relayed to the crew information received from a previous flight to the effect that ground fog conditions in the area were general Shortly after 0540 the tower transmitted a special weather observation as, \"Roger 211, special, at 0540 clear, visibility one mile ground fog\". Accompanying remarks contained in the Weather Bureau report, \"Ground visibility one-half mile, variable from one quarter to three-quarters mile, estimated 10 to 50 feet deep, were omitted. A shallow left turn was made over the airport, after which the prelanding cheek list was accomplished. A procedure turn was then executed east of the field and a landing approach was made to Runway 25L. According to the pilot the runway approach lights remained clearly visible, though small puffs of clouds were encountered during the approach. Flaps were fully extended when the airplane passed over the boundary of the field. Before touching down on the runway, a thick formation of ground fog was encountered. Visibility was reduced to practically zero. Contact with the runway, 2,300 feet from the approach end, was made with sufficient impact force to deform the wing structure and deflect the No. 4 engine nacelle downward to the extent that the No. 4 propeller struck the runway. Following the landing fire was observed in the area of the No. 4 engine nacelle. Brakes were vigorously applied. The aircraft rolled forward in a slight left turn, coming to rest 1,500 feet from the point of landing, and 197 feet from the left edge of Runway 25L. Flames rapidly engulfed the right wing and fuselage but all passengers were deplaned without serious injury. The airplane had been observed by the tower on the landing approach, though fog obstructed it from view just before it passed over the airport boundary. The tower also observed it over the runway, at which time it appeared to be flaring out for a normal landing. After that the airplane could not be observed because of fog. Several calls were made by the tower to Flight 211 but no acknowledgements were received. Noticing a reddish glow on top of the fog approximately where the flight had disappeared, the tower called Pan American Operations, located near Runway 25L, and was informed that something was burning on the runway. At 0558, six minutes after the aircraft landed, the tower called the Los Angeles Fire Department and asked them to investigate. Equipment on the airport was promptly dispatched and it arrived at the scene of the accident about two minutes later. By the time fire equipment arrived, however, the aircraft was practically destroyed. All 23 occupants were rescued. ", "probable_cause": "The Board determines that the probable cause of this accident was the pilot's inability to see the runway after entering a ground fog during a final approach and landing.\r\nThe following factors were considered as contributory:\r\n- Weather information received prior to the flight's departure from Phoenix, Arizona, in addition to reports obtained en route, indicated that at the time of arrival over Los Angeles, California, ground fog conditions would prevail at the Los Angeles Municipal Airport.\r\n- A weather report, given to the flight when it arrived over the vicinity of the airport, stated that visibility on the field was one mile, and the remarks accompanying the weather observation \"ground visibility one-half mile, variable one-fourth to three-fourths mile, ground fog estimated 10 to 50 feet deep\" were omitted.\r\n- The flight made its approach for a landing on Runway 25L at the Los Angeles Municipal Airport and encountered ground fog before making contact with the runway.\r\n- As a result of losing visual reference to the runway and the ground, control of the aircraft was lost before the landing was completed.\r\n- Contact with the runway was made 2,300 feet from the approach end and was sufficiently hard to cause structural failure and fire."}