{"url": "https://www.baaa-acro.com/crash/crash-vickers-416-wellington-ic-near-pennal-6-killed", "date": "Aug 17, 1941 at 2100 LT", "type": "Vickers 416 Wellington IC", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Mountains", "schedule": "Moreton-in-Marsh - Moreton-in-Marsh", "msn": null, "yom": null, "flight_number": null, "city": "Pennal", "zone": "Gwynedd", "country": "United Kingdom", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew departed RAF Moreton-in-Marsh on a cross country navigation exercise and their route was out over mid Wales to the Irish Sea and back to RAF Moreton-in-Marsh, a fairly straight forward flight. During the briefings all crews were instructed NOT to drop through cloud without first confirmation of their location and the terrain below! Being told by using black humor of how over Wales, the clouds have hard centre. Unfortunately unknown to the crew, due to cloud and an unexpected shift in wind direction and speed, they veered off course, then at the allotted time en route they saw a wide water feature about three miles off to port, which they mistook the River Dovey for the coast. No sooner had they glimpsed the water and before realizing it wasn’t the sea, they entered cloud. But sadly, confident the water they saw, along with the timing the Wellington flew on gradually losing height to the pre-arranged height over water of 1000ft, ahead lay the high mountain of Ffridd Rhosfach at around 1,448 feet. The airplane was destroyed and all six crew members were killed. \r\nCrew:\r\nSgt James Francis Paul Stuart, pilot, \r\nSgt Herbert George Mole, pilot, \r\nP/O George Joyce Matthews, observer, \r\nSgt Allan Jackets, wireless operator, \r\nSgt John Francis Moore, wireless operator, \r\nSgt George Hewison, air gunner.", "probable_cause": "Controlled flight into terrain. "}