{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-canton-1-killed", "date": "Apr 10, 2003 at 1700 LT", "type": "Cessna 414 Chancellor", "operator": "Trace Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Rome – Canton", "msn": "414-0813", "yom": 1975, "flight_number": null, "city": "Canton-Cherokee County", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4500, "captain_hours_type": 245, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5078, "circumstances": "The VFR repositioning flight departed Rome, Georgia en route to Canton, Georgia but never arrived. Late on the evening of April 10, 2003, the pilot's spouse contacted the local authorities when her husband did not arrive at home or call. The spouse stated that her husband flew out of Rome early Thursday morning headed to Augusta, Georgia to pick up an unknown number of passengers and fly them back to Rome, Georgia. The authorities confirmed that the passengers had arrived at their destination. The Civil Air patrol began a search and located the airplane on the side of \"Bear Mountain\" in Canton, Georgia, on April 11, 2003. The wreckage site was located 11.3 nautical miles west of Cherokee County Airport, Canton, Georgia, and 26 nautical miles east of Rome, Georgia on the west side of Bear Mountain. The mountains ridgeline runs northeast and southwest, near the town of Waleska, Georgia. The field elevation at the crash site was 1,750 feet above mean sea level (msl) and the peak of Bear Mountain was 2,268 feet msl. The upslope of the terrain at the site was estimated at 30-40 degrees. Examination of the airframe, flight controls, engine assembly and accessories revealed no anomalies. ", "probable_cause": "The pilot's failure to maintain clearance from terrain."}