{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200c-super-king-air-noumea", "date": "Sep 9, 2014 at 1150 LT", "type": "Beechcraft 200 Super King Air", "operator": "Air%20Loyaut%C3%A9", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lifou – Nouméa", "msn": "BL-11", "yom": 1980, "flight_number": null, "city": "Nouméa-La Tontouta", "zone": "New Caledonia", "country": "New Caledonia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine airplane departed Lifou Airport on an ambulance flight to Nouméa-Magenta Airport, carrying two passengers and two pilots. On approach to Magenta Airport, the crew followed the checklist and lower the landing gears. As all three green light failed to came on the cockpit panel, the crew elected to lower the gears manually without success. The crew completed two low passes in front of the control tower and it was confirmed that the left main gear seems to be down but not locked. After a 45-minute flight to burn fuel, the crew completed the landing. Upon touchdown, both main landing gear collapsed while the nose gear remained extended. The aircraft slid for few dozen metres before coming to rest. All four occupants evacuated safely and the aircraft was damaged beyond repair. ", "probable_cause": "The rupture of two teeth of the sprocket of the control cylinder of the left main landing gear caused the cylinder to be locked and thus caused the mechanical system to extend the landing gear. This blockage prevented the complete extension and locking of the landing gear. This rupture and other damage to the two main landing gear actuators was probably the result of improper installation of the toothed gear and / or improper adjustment of the assembly."}