{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-99-airliner-richland-17-killed", "date": "Feb 10, 1978 at 1650 LT", "type": "Beechcraft 99 Airliner", "operator": "Columbia%20Pacific%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Richland - Seattle", "msn": "U-037", "yom": 1968, "flight_number": "EV023", "city": "Richland", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 15, "pax_fatalities": 15, "other_fatalities": 0, "total_fatalities": 17, "captain_hours": 3250, "captain_hours_type": 300, "copilot_hours": 1061, "copilot_hours_type": 199, "aircraft_hours": 13701, "circumstances": "Columbia Pacific Airlines Flight 23, a Beech 99 (N199EA), was operated under the provisions of 14 CFR 135 as a regularly scheduled passenger flight from Richland to Seattle, Washington. The crew arrived at Richland at 1525 P.s.t. on Flight 18 from Seattle. When they arrived, N199EA was being inspected to fulfill the requirements of an Airworthiness Directive. The aircraft was not available to the crew for preflight inspection until 1630; Flight 23 was scheduled to depart at 1640. At 1628, the captain was briefed on weather by the Walla Walla, Washington, Flight Service Station (FSS), and he filed a dispatch release which contained aircraft weight and balance, route of flight, and weather information. About 1630, the aircraft was fueled and 600 lbs of baggage was loaded. About 1635, the first officer left the terminal building and connected the auxiliary power unit to the aircraft. He then inspected the aircraft and boarded; the captain boarded shortly thereafter. When the passenger boarding call was made, the captain left the aircraft to obtain magazines for the passengers. He was seen getting into his seat when the first passenger boarded. At 1646, the first officer contacted the Pasco Airport Traffic Control Tower, using Flight No. 29, and advised that they were taxiing and would request an instrument flight rules clearance to Seattle via Yakima, Washington, when airborne. The Pasco Control Tower received no further calls from Flight 23. The first officer informed operations on company frequency that they would be departing shortly and would relay their estimated time of arrival in Seattle when airborne. There were no further radio communications with the crew. The aircraft daily flight log for February 10 showed that the aircraft left the ramp at 1645 and took off at 1648. In general, witnesses described the aircraft's attitude at liftoff as normal and estimated the point of liftoff between 1,173 and 1,486 ft; however, immediately thereafter the aircraft began a steep climb at an angle of 20' to 45\" to an altitude of 300 to 400 ft above the runway and then appeared to decelerate. The wings rocked or wobbled at the top of the climb, and the aircraft turned or yawed to the left.\r\nThe nose dropped and the aircraft descended to the ground at a flightpath angle estimated to have been 45°. Fuel from ruptured fuel tanks caught fire after the aircraft hit the ground. Fire consumed the aircraft within 7 minutes. All 17 occupants were killed. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of the accident was the failure or inability of the flightcrew to prevent a rapid pitchup and stall by exerting sufficient push force on the control wheel. The pitchup was induced by the combination of a mistrimmed horizontal stabilizer and a center of gravity near the aircraft's aft limit. The mistrimed condition resulted from discrepancies in the aircraft's trim system and the flightcrew's probable preoccupation with making a timely departure. Additionally, a malfunctioning stabilizer trim actuator detracted from the flightcrew's efforts to prevent the stall. Contributing to the accident were inadequate flightcrew training, inadequate trim warning system check procedures, inadequate maintenance procedures, and ineffective FAA surveillance. "}