{"url": "https://www.baaa-acro.com/crash/crash-cessna-425-conquest-i-perkasie", "date": "Aug 17, 1997 at 1820 LT", "type": "Cessna 425 Conquest", "operator": "Inductotherm", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Niagara Falls – Rancocas", "msn": "425-0211", "yom": 1984, "flight_number": null, "city": "Perkasie-Pennridge", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3013, "captain_hours_type": 373, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3836, "circumstances": "During preflight, the pilot noticed a discrepancy between his requested fuel load and what the fuel gauges indicated. He decided the right fuel quantity gauge was accurate and the left fuel quantity gauge was inaccurate, and started a multiple leg flight. Based on the right fuel gauge indication at an away airport, the pilot elected to not refuel prior to starting his return flight. About 50 miles from the destination, the left and right low fuel quantity lights illuminated, and the right fuel gauge indicated 390 pounds of fuel onboard. The pilot elected to continue to his destination. A few minutes later, both engines lost power. A forced landing was made in an open school field. Before coming to rest, the left wing struck a football training device, and the outboard 4 feet of the wing was separated from the airplane. Post accident investigation revealed, both fuel tanks, collector tanks, fuel lines, and filters were empty. When electric power was applied, the left fuel gauge indicated '0' and the right fuel gauge indicated 290 pounds of fuel remaining. The pilot reported that he should have monitored his fuel supply closer and landed at the first sign of any inconsistencies in fuel quantity readings. ", "probable_cause": "The pilot's inadequate preflight, by failing to verify the fuel supply, which led to subsequent fuel exhaustion and loss of engine power. A related factor was: the inaccurate fuel quantity gauge. "}