{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-dk-nagpur-13-killed", "date": "Dec 12, 1953 at 0325 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Indian%20Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nagpur – Madras", "msn": "11810", "yom": 1943, "flight_number": null, "city": "Nagpur", "zone": "Maharashtra", "country": "India", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft started its take-off run and became airborne in the normal manner somewhere near the intersection of runways 27 and 33. The captain of another aircraft who had moved to the beginning of runway 27 for his turn for take off, watched the take-off of the aircraft and noticed that it became airborne normally but swung to the left when at a height of about 10 or 15 feet. It then climbed steeply on a straight course until it had well passed the end of the runway, and reached a height of about 100 to 150 feet. Thereafter it turned sharply to the left, lost height and crashed in a field located 4,000 feet from the runway. All 10 passengers and three crew members were killed. The captain Desmond Arthur James Cartner was the only survivor. ", "probable_cause": "Loss of critical height during a steep left hand turn, with the undercarriage down, executed by the pilot at an unsafe altitude in an attempt to return to the aerodrome, after experiencing a temporary loss of power of the left engine soon after getting airborne. A false right engine fire warning precipitated the attempt at a forced landing. The following findings were reported by the Calcutta High Court:\r\n- The port engine of the plane lost power after getting air-borne causing a swing and that it was due to defective supervision and check up,\r\n- The swing corrected itself when the port engine revived again,\r\n- In spite of failure of the port engine and/or correction thereof, the Captain and/or Pilots in charge did not follow the ordinary and usual procedure under such circumstances, namely, did not throttle back the engine and land straight ahead though there was sufficient length of runway available in front, to land and pull up even with the wheels down and certainly with the wheels up,\r\n- Even though the engine revived, the fact that the gear was down was overlooked by both the pilots,\r\n- A false starboard engine fire warning precipitated the attempt at forced landing obviously on account of defective supervision and check up,\r\n- The lack of sufficient intensive checks for emergency procedures during the past twelve months preceding the accident which it is alleged, if carried out, might have given the pilot confidence, apart from practice enabling him to deal coolly with an emergency of this nature."}