{"url": "https://www.baaa-acro.com/crash/crash-learjet-55c-longhorn-rio-de-janeiro", "date": "Aug 12, 2010 at 0926 LT", "type": "Learjet 55 Longhorn", "operator": "OceanAir%20Taxi%20Aereo", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Rio de Janeiro - Rio de Janeiro", "msn": "55C-135", "yom": 1988, "flight_number": null, "city": "Rio de Janeiro-Santos Dumont", "zone": "Rio de Janeiro", "country": "Brazil", "region": "South America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17000, "captain_hours_type": 500, "copilot_hours": 2800, "copilot_hours_type": 49, "aircraft_hours": null, "circumstances": "The aircraft departed Rio de Janeiro-Santos Dumont Airport on a positioning flight to Rio de Janeiro-Galeão-Antonio Carlos Jobim Airport with three crew members on board. Two minutes after takeoff, while in initial climb, the electrical system of the aircraft suffered a voltage power loss. Several instruments lost their functionality such as TCAS, altimeters and airspeed indicator. In good weather conditions, the captain decided to return to Santos Dumont Airport but did not declare any emergency. After being cleared to descend to 3,000 feet, the crew lost all radio communications. On final approach to runway 02R, most of the instruments failed but the crew continued the approach. The aircraft passed over the runway threshold with an excessive speed of 25 knots and after touchdown, the crew started the braking procedure but the spoilers and the reversers could not be activated. Unable to stop within the remaining distance, the aircraft overran and came to rest in the Guanabara Bay. All three crew members escaped uninjured while the aircraft was damaged repair. ", "probable_cause": "An error in the assembly was detected in the left generator, which interfered with the D+ terminal signal sent to the voltage regulator. Due to a voltage drop, some of the instruments lost their functionality. The following contributing factors were identified: \r\n- The crew did not follow the emergency procedures; \r\n- The crew decided to return to land at Santos Dumont Airport without considering that the runway length was less than the length required for an emergency landing;\r\n- The speed of the aircraft while passing over the runway threshold was 25 knots above the reference speed;\r\n- The pilots were unable to engage the spoilers or the thrust reversers;\r\n- Wrong attitude from the captain;\r\n- Overconfidence of the crew; \r\n- Emotional load due to an emergency situation; \r\n- Poor assessment of the situation due to high stress associated with decreased situational awareness; \r\n- Poor crew coordination;\r\n- Lack of crew resource management;\r\n- Poor judgment;\r\n- Lack of procedures on the part of the operator."}