{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-990-30a-5-stockholm-5-killed", "date": "Jan 5, 1970 at 2225 LT", "type": "Convair CV-990", "operator": "Spantax-2", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Stockholm - Zurich", "msn": "30-10-32", "yom": 1962, "flight_number": null, "city": "Stockholm-Arlanda", "zone": "Uppland", "country": "Sweden", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 10019, "captain_hours_type": 2218, "copilot_hours": 5861, "copilot_hours_type": 758, "aircraft_hours": 16940, "circumstances": "The aircraft was originally planned to fly a non-scheduled international flight from Stockholm-Arlanda to Palma de Mallorca. During the take-off run No. 4 engine did not function properly; the take-off was aborted and the aircraft was taxiied back to the apron. Inspection of the engine revealed damage to the compressor. After consultation with the Spantax Operations Department in Madrid, it was decided to ferry the aircraft on three engines to Zurich, where No. 4 engine would be changed. The technical preparation of the aircraft for the ferry flight was supervised by a ground engineer from Spantax. Meanwhile, the flight crew planned the flight. As the ATS briefing office at Arlanda was closed after 2100 hours, the co-pilot phoned the ATS flight plan to Stockholm Control Centre (ACC) . Neither when phoning the flight plan nor at the weather briefing did the crew advise that the flight was a 3-engine ferry flight. However, the Air Traffic Controller (Tower) in some other way had been informed about the nature of the flight. At 2208 hours the crew received a taxi clearance to Runway 08, but as they considered that this runway was too short for a 3-engine take-off , they requested permission to use Runway 19 and this was granted. Another advantage of using Runway 19 was that it made it possible to join the outbound track with minor heading changes. During taxiing the aircraft and the engine anti-icing system were checked according to the checklist. (After checking the engine anti-icing was switched OFF.) At 2221 hours the flight was cleared to take-off, and at 2224 hours the crew reported \"Rolling\". According to the pilot-in-command,maximum EPR take-off power was set on engines Nos. 1, 2 and 3 with brakes on, then, after having checked the instruments, No. 1 engine was throttled back to 85 per cent and the brakes were released. When the aircraft had rolled for 5-10 seconds the nose wheel skidded to the right and to regain heading he had to retard throttle No. 1 to 80-60 per cent. When back on the centre line he slowly opened the throttle again. Maximum EPR take-off power was set when the aircraft reached a speed of 100 kt. He rotated the aircraft at the calculated speed Vr - 134 kt (27° of flaps) and it became airborne. He retracted the gear when positive climb was indicated. Just after lift off he was blinded by the aircraft landing lights illuminating unexpectedly low clouds over the runway. Initially he kept the speed at V2 (145 kt) and noticed a rate- of-climb of 800 ft/min. He had to apply extremely hard left rudder to centre the turn indicator (ball). He did not observe any bank or turn tendency, but noted that the indicated airspeed (IAS) was not increasing normally and shortly thereafter that the rate-of-climb and speed decreased. The pilot-in-command felt they urgently needed more power, but all happened very quickly and shortly after he had noticed the speed drop the aircraft collided with the terrain. From the time take-off power had been set on the runway the throttle positions were not changed. The co-pilot stated that they had to taxi down the runway to avoid ice patches on the first part of the runway. He could not say how far they taxiied and it was not possible to determine it in any other way. During preparation for take-off he asked the pilot-in-command if they should use 10° flaps, but the decision of the pilot- in-command to uae 27° was not changed. He completed the pre-take-off instrument check and did not notice any abnormal readings. The three gyro horizons indicated no differences. When rolling he kept the control column forward, to increase the friction on the nose wheel, and gave full left aileron. Gradually he decreased the pressure on the column and reduced left aileron deflection. At V1 the pilot-in-command took mr the controls. The co-pilot kept his left hand on the throttles and verified that no changes were made on throttles Nos. 2 and 3 after takeoff power was set, but he noticed that the pilot-in-command had to vary the No. 1 throttle setting several times during the roll. After lift-off when the gear was retracted the co-pilot received a message from the tower giving the take-off time and instruction to change over to STOCKHOLM RADAR on 124.1 MHz. He never acknowledged the message but when leaning forward to select the new frequency he noticed on his horizon a banking to the right of 4 to 60. He also observed the gyro horizon of the pilot-in-command indicating o bank to the right. Zhe speed had dropped to 10 kt belau V2 and he called: \"The speed, the speed\". Ifc felt no buffeting in the aircraft aud noted no tendency to Dutch roll. Be also stated that he observed a power drop of about 2 per cent below EPR take-off power. Shortly after the first contact with the treetops the banking to the right had increased to 10-lSO and the co-pilot retarded the throttles. The flight and the ground engineers sitting in the cockpit observed nothing abnormal until the crash. None of them observed any indications of power changes on the instruments. No buffeting was felt in the aircraft, neither were any warning signals heard. Whilst in a right bank of 4-6° the aircraft collided with tree-tops approximately 26 m above and 1 060 m from the far end of Runway 19, or about 1 800 m from the point of lift-off, having turned through about 25 degrees from the runway heading. The aircraft came to a final stop approximately 500 m after first contact with the trees on a heading of 240°. The aircraft was destroyed and five occupants were killed while five others were injured. ", "probable_cause": "During a 3-engine take-off the aircraft entered an uncontrollable attitude with increased drag and decreased indicated airspeed wing to the following combined circumstances : unexpected, early loss of external visual references after lift off. During transition from visual to instrument flying the pilot lost directional control, this again resulting in increased drag due to yaw. The presence of a temperature inversion reducing thrust and indicated airspeed. The presence of wind shear causing further decrease of indicated airspeed, which resulted in large drag increase. The following findings were reported:\r\n- Patches of ice on the runway reduced the friction and thereby the capability of the nose wheel to take up side forces. During acceleration to 100 kt, the average thrust used on engine No. 1 was probably 50 per cent. Full power on all three engines was, however, set well below V1,\r\n- There was a marked temperature inversion in the air close to the ground,\r\n- There was a windshear. The wind was reported calm at surface but was blowing from the NNW at 5-10 kt at 30-50 ft producing a tail wind component for aircraft taking off on Runway 19,\r\n- The crew was not informed about the temperature inversion and windshear,\r\n- Neither the actual weather reports nor the forecast for Arlanda contained any information about the possibility that the existing low clouds of stratus would be as low as 30-50 ft above the far end of Runway 19 and in the climb out area,\r\n- These clouds were illuminated by the landing lights and possibly by the approach lights to Runway 01, which blinded the pilot forcing him to change to instrument flying earlier than could have been expected,\r\n- During the climb-out, the co-pilot was requested by the Tower to change radio frequency. This preoccupation diverted his attention from his primary duty of watching the instrument panel. "}