{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601p-teutonic-bore-1-killed", "date": "May 28, 1980 at 1137 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Teutonic Bore – Leonora – Perth", "msn": null, "yom": null, "flight_number": null, "city": "Teutonic Bore", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2810, "captain_hours_type": 149, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was engaged on the return segment of a flight from Perth to Teutonic Bore, with an intended refuelling stop at Leonora. After embarking the two passengers and their baggage, the pilot started the engines and taxied for a take-off into the north, on the 1350 metre long main strip. The weather conditions were fine with a northerly surface wind of about 7 knots. The initial part of the take-off run was apparently normal but, after travelling some 400 metres and at about the point of rotation, one of the passengers noted an engine power surge. The take-off was continued, the aircraft became airborne and shortly afterwards the landing gear was retracted. After the aircraft had slowly climbed straight ahead to an altitude of about 200-300 feet above ground level, the passenger heard a marked change in the engine noise and felt the aircraft decelerating. The extent of the power loss and the absence of any yawing force indicated both engines had lost power simultaneously. Level flight straight ahead was reportedly maintained for an estimated 10 seconds and then the aircraft entered a descending left turn. At about this time the pilot, in response to a query from the passenger, advised that he intended to return to the airstrip but then stated \"we're going down\", or words to that effect. The terrain in the area was generally firm and flat. It was lightly covered with scrub and there was occasional small trees but a safe landing with only minimal damage was possible. When VH-KXY struck the ground the gear and flaps were retracted and the rate of descent was high. The aircraft was in a level attitude but yawed approximately 45 degrees to the right. After the initial impact, the aircraft slid across the ground on a track of 220 degrees magnetic for 67 metres before coming to rest. There was no post-impact fire. One passenger was able to exit via the cabin door by his own efforts. The other occupants were trapped in the wreckage and were rescued some 30 minutes later by persons who attended the accident. The pilot died shortly after being removed from the aircraft.\n", "probable_cause": "The probable cause of the accident was that, following a substantial loss of power by both engines, the pilot did not carry out the procedures necessary for a safe forced landing. The cause of the loss of power by both engines has not been determined."}