{"url": "https://www.baaa-acro.com/crash/crash-cessna-404-titan-lockhart-river-5-killed", "date": "Mar 11, 2020 at 0919 LT", "type": "Cessna 404 Titan", "operator": "Air Connect Australia", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cairns – Lockhart River", "msn": "404-0653", "yom": 1980, "flight_number": null, "city": "Lockhart River", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 3220, "captain_hours_type": 399, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 11 March 2020, a Cessna 404 aircraft, registered VH-OZO, was being operated by Air Connect Australia to conduct a passenger charter flight from Cairns to Lockhart River, Queensland. On board were the pilot and 4 passengers, and the flight was being conducted under the instrument flight rules (IFR). Consistent with the forecast, there were areas of cloud and rain that significantly reduced visibility at Lockhart River Airport. On descent, the pilot obtained the latest weather information from the airport’s automated weather information system (AWIS) and soon after commenced an area navigation (RNAV) global satellite system (GNSS) instrument approach to runway 30. The pilot conducted the first approach consistent with the recommended (3°) constant descent profile, and the aircraft kept descending through the minimum descent altitude (MDA) of 730 ft and passed the missed approach point (MAPt). At about 400 ft, the pilot commenced a missed approach. After conducting the missed approach, the pilot immediately commenced a second RNAV GNSS approach to runway 30. During this approach, the pilot commenced descent from 3,500 ft about 2.7 NM prior to the intermediate fix (or 12.7 NM prior to the MAPt). The descent was flown at about a normal 3° flight path, although about 1,000 ft below the recommended descent profile. While continuing on this descent profile, the aircraft descended below the MDA. It then kept descending until it collided with terrain 6.4 km (3.5 NM) short of the runway. The pilot and 4 passengers were fatally injured, and the aircraft was destroyed.", "probable_cause": "The accident was the consequence of a controlled flight into terrain. \r\nThe following contributing factors were identified:\r\n• While the pilot was operating in the vicinity of Lockhart River Airport, there were areas of cloud and rain that significantly reduced visibility and increased the risk of controlled flight into terrain.\r\nIn particular, the aircraft probably entered areas of significantly reduced visibility during the second approach.\r\n• After an area navigation (RNAV) global satellite system (GNSS) approach to runway 30 and missed approach, the pilot immediately conducted another approach to the same runway that was on a similar gradient to the recommended descent profile but displaced about 1,000 ft below that profile. While continuing on this descent profile, the aircraft descended below a segment minimum safe altitude and the minimum descent altitude, then kept descending until the collision with terrain about 6 km before the runway threshold.\r\n• Although the exact reasons for the aircraft being significantly below the recommended descent profile and the continued descent below the minimum descent altitude could not be determined, it was evident that the pilot did not effectively monitor the aircraft’s altitude and descent rate for an extended period.\r\n• When passing the final approach fix (FAF), the aircraft’s lateral position was at about full-scale deflection on the course deviation indicator (CDI), and it then exceeded full-scale deflection for\r\nan extended period. In accordance with the operator’s stabilized approach procedures, a missed approach should have been conducted if the aircraft exceeded half full-scale deflection at the FAF, however a missed approach was not conducted.\r\n• The pilot was probably experiencing a very high workload during periods of the second approach. In addition to the normal high workload associated with a single pilot hand flying an approach in instrument meteorological conditions, the pilot’s workload was elevated due to conducting an immediate entry into the second approach, conducting the approach in a different manner to their normal method, the need to correct lateral tracking deviations throughout the approach, and higher than appropriate speeds in the final approach segment.\r\n• The aircraft was not fitted with a terrain avoidance and warning system (TAWS). Such a system would have provided visual and aural alerts to the pilot of the approaching terrain for an extended period, reducing the risk of controlled flight into terrain.\r\n• Although the aircraft was fitted with a GPS/navigational system suitable for an area navigation (RNAV) global satellite system (GNSS) approach and other non-precision approaches, it was not fitted with a system that provided vertical guidance information, which would have explicitly indicated that the aircraft was well below the recommended descent profile.  Although the operator had specified a flight profile for a straight-in approaches and stabilized approach criteria in its operations manual, and encouraged the use of stabilized approaches, there were limitations with the design of these procedures. In addition, there were limitations with other risk controls for minimizing the risk of controlled flight into terrain (CFIT), including no procedures or guidance for the use of the terrain awareness function on the aircraft’s GNS 430W GPS/navigational units and limited monitoring of the conduct of line operations.\n\r\nOther factors that increased risk:\r\n• Although an applicable height of 1,000 ft for stabilized approach criteria in instrument meteorological conditions has been widely recommended by organizations such as the International Civil Aviation Organization for over 20 years, the Civil Aviation Safety Authority had not provided formal guidance information to Australian operators regarding the content of stabilized approach criteria. (Safety issue) \r\n• The Australian requirements for installing a terrain avoidance and warning system (TAWS) were less than those of other comparable countries for some types of small aeroplanes conducting air transport operations, and the requirements were not consistent with International Civil Aviation Organization (ICAO) standards and recommended practices. More specifically, although there was a TAWS requirement in Australia for turbine-engine aeroplanes carrying 10 or more passengers under the instrument flight rules:\r\n- There was no requirement for piston-engine aeroplanes to be fitted with a TAWS, even though this was an ICAO standard for such aeroplanes authorized to carry 10 or more passengers, and this standard had been adopted as a requirement in many comparable countries.\r\n- There was no requirement for turbine-engine aeroplanes authorized to carry 6–9 passengers to be fitted with a TAWS, even though this had been an ICAO recommended practice since 2007, and this recommended practice had been adopted as a requirement in many comparable countries. (Safety Issue)\n\r\nOther findings:\r\n• The forecast weather at Lockhart River for the time of the aircraft’s arrival required the pilot to plan for 60 minutes holding or diversion to an alternate aerodrome. The aircraft had sufficient fuel for that purpose; and the aircraft had sufficient fuel to conduct the flight from Cairns to Lockhart River and return, with additional fuel for holding on both sectors if required.\r\n• There was no evidence of any organizational or commercial pressure to conduct the flight to Lockhart River or to complete the flight once to commenced.\r\n• Based on the available evidence, it is very unlikely that the pilot was incapacitated or impaired during the flight.\r\n• There was no evidence of any aircraft system or mechanical anomalies that would have directly influenced the accident. However, as a consequence of extensive aircraft damage, it was not possible to be conclusive about the aircraft’s serviceability.\r\n• The aircraft was fitted with Garmin GNS 430W GPS/navigational units that could be configured to provide visual (but not aural) terrain alerts. However, it could not be determined whether the\r\nterrain awareness function was selected on during the accident flight. "}