{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-kumamoto-2-killed", "date": "Jan 3, 2011 at 1714 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Prive20", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Kumamoto – Kitakyūshū", "msn": "46-36188", "yom": 1999, "flight_number": null, "city": "Kumamoto", "zone": "Kyūshū", "country": "Japan", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1537, "captain_hours_type": 119, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1497, "circumstances": "The single engine aircraft departed Kumamoto Airport runway 07 at 1711LT on a private flight to Kitakyūshū, with two persons on board: a PIC in the left seat and a passenger in the right seat. At 17:12:11, the radar of the Kumamoto aerodrome station C captured the aircraft. The pilot made a position report at 6 nm north of the airport at 2,300 feet. While climbing to the altitude of 6,500 feet, the pilot was instructed to change the frequency. About three minutes after takeoff, the aircraft collided with trees and crashed in a wooded area located on the southeast slope of Mt Yago, about 14 km northeast of Kumamoto Airport. The wreckage was found in the afternoon of the following day at an altitude of 850 metres. The aircraft was destroyed and both occupants were killed, Mr. & Mrs. Hiroshi and Hiromi Kanda. ", "probable_cause": "It is highly probable that the aircraft collided with the mountain slope during its in-cloud post-takeoff climb with low climb rate on its VFR flight to Kitakyushu Airport from Kumamoto Airport, resulting in the aircraft destruction and fatal injuries of two persons on board–the PIC and the passenger. It is somewhat likely that the contributing factor to in-cloud flight toward mountain slope with low climb rate is the PIC’s lack of familiarization with terrain features near Kumamoto Airport; however, the JTSB was unable to clarify the reason. "}