{"url": "https://www.baaa-acro.com/crash/crash-noorduyn-norseman-iv-kenora", "date": "Jul 25, 1958 at 1020 LT", "type": "Noorduyn Norseman", "operator": "Parson's Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Malachi – Kenora", "msn": "5", "yom": 1936, "flight_number": null, "city": "Kenora", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7865, "captain_hours_type": 4500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 1005LT, the Norseman IV registered CF-BZM took off from Malachi, Ontario, bound for Kenora on a non-scheduled flight with a pilot and 3 passengers on board. At about 1020LT the aircraft arrived over Keewatin approximately 2 miles west of Kenora, at an altitude of 1,500 feet, heading downwind, and started a routine left-hand circuit, descending on the downwind leg to 1,000 feet. The aircraft turned at 800 feet into the wind which was WNW and descended at a rate of 500 to 700 feet per minute. At about 20 feet above the water, the pilot saw a red and yellow flash on his right wing tip and then heard a loud noise. The aircraft went out of control, rolled to the left then right and crashed into the lake In a slightly nose-down attitude, swung 200 degrees and came to a stop in a southerly direction about 60 ft from the other aircraft. On the same day, a second Norseman VI registered CF-IRH took off from Bell Lake, Ontario, on a non-scheduled flight with the pilot and 7 passengers on board. At about 1020LT, the aircraft arrived in the vicinity of Kenora and turned onto the final leg of the approach to land, about 1,5 mile from the selected landing area. A straight power-an approach for approximately one mile was made and when about 20 feet above the water, the pilot looked out of the left window, saw the streamlined portion of a wing tip of another aircraft and heard the noise of the impact. The aircraft went out of control, struck the water, bounced about 25 feet, dived into the water and turned over. CF-BZM was destroyed while CF-IRH was substantially damaged. No fatalities occurred but one of the passengers on CF-IRH was seriously injured.", "probable_cause": "Both pilots failed to maintain an adequate look-out during the initial and final stages of the approach for landing. The two aircraft were flown on converging courses and a collision ensued at a height of approximately 20 feet above the surface of the water."}