{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-53b-martinsburg-1-killed", "date": "Jun 4, 1958 at 1358 LT", "type": "Douglas C-53 Skytrooper (DC-3)", "operator": "Capital-Airlines3", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Washington DC – Martinsburg", "msn": "4820", "yom": 1941, "flight_number": "CA003", "city": "Martinsburg-Eastern West Virginia-Shepherd Field", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5625, "captain_hours_type": 1600, "copilot_hours": 3333, "copilot_hours_type": 787, "aircraft_hours": 32396, "circumstances": "A Capital Airlines DC-3 crashed and burned near Martinsburg Airport, Martinsburg, West Virginia, at 1358 on June 4, 1958, injuring the three occupants-an instructor and two pilot-trainees. One trainee, who was flying the aircraft at the time of the accident, died the following day of severe burns. The aircraft was on a training flight from Washington National Airport and was practising takeoffs and landings at Martinsburg Airport. During the pilot's attempt to climb out after abandoning a single-engine approach to runway 8, the aircraft stalled and crashed in a wooded area. A crew member was killed while two other occupants were injured. ", "probable_cause": "The Board determines that the probable cause of this accident was that, following the trainee-pilot's failure to maintain minimum-control speed during an attempted go-arounds the instructor-pilot failed to take control of the aircraft in sufficient time to prevent a critical loss of altitude. A contributing factor was the malfunction of the landing gear latch which delayed retraction of the landing gear and caused the distraction of the instructor-pilot for several seconds during a critical period of the go-around."}