{"url": "https://www.baaa-acro.com/crash/crash-casa-212-aviocar-200-mayaguez-5-killed", "date": "Jun 7, 1992 at 1434 LT", "type": "Casa 212 Aviocar", "operator": "American-Eagle-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "San Juan - Mayaguez", "msn": "234", "yom": 1982, "flight_number": "AA5456", "city": "Mayaguez-Eugenio Maria de Hostos", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 6634, "captain_hours_type": 2634, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14135, "circumstances": "The airplane crashed on approach 3/4 mile southwest of the airport. A witness heard sound he associated with props going into reverse, then observed airplane emerge from clouds in a nose-low attitude. CVR tape revealed sound of an abrupt change in frequency and amplitude 10 seconds prior to impact. Exam of the left engine beta indicator lamp revealed heavy oxide deposit and stretched coils indicative of the lamp being illuminated at impact; right engine beta lamp was destroyed. Power levers and (beta mode) trigger locks operated normally; trigger return springs intact. Flight idle stops showed no evidence of excessive wear or deformation. The power lever (beta) blocking device lockout solenoid was tested electrically and functioned normally. The rigging of the beta lockout device could not be checked due to impact damage. The operator conducted a funct test of the electrical or backup beta blocking devices on the remaining 8 Casa 212 airplanes; 3 were found to be inoperative. Neither the manufacturing nor operator had an inspection or funct test requirement for the blocking devices. All five occupants were killed. ", "probable_cause": "The failure of the beta blocking device for undetermined reason(s), and the second-pilot's inadvertent activation of the power lever, or levers, aft of the flight idle position and into the beta range, resulting in a loss of airplane control."}