{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-d18s-london-5-killed", "date": "Mar 31, 1949 at 1030 LT", "type": "Beechcraft D18", "operator": "Dow%20Chemical%20Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Midland - Boston", "msn": "A-376", "yom": 1947, "flight_number": null, "city": "London", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Midland Airport, Michigan, at 0910LT bound for Boston, carrying four passengers and two pilots. A little more than an hour into the flight, after passing over London, Ontario, the crew encountered difficulties and contacted London Airport and declared an emergency situation. The crew decided to divert to London Airport and reduced his altitude. While flying in poor weather conditions, the airplane passed just over a house (12 feet high) then crashed in flames in an open field. A passenger was able to evacuate the cabin and was slightly injured while five other occupants were killed. The aircraft was destroyed. The main passenger, Willard Dow, President of the Dow Chemical Company, was enroute to Boston to take part to a conference given by Winston Churchill. It appears that the regular crew refused to perform the flight due to extreme poor weather conditions (stormy weather approaching from the east). Thus, Mr. Dow asked a second crew to complete the flight. \r\nCrew:\r\nA. J. Bowie, pilot, †\r\nFred Clements, copilot. †\r\nPassengers: \r\nWillard Dow, †\r\nMartha Dow, †\r\nCalvin Campbell,\r\nMrs. Campbell. †", "probable_cause": "It was determined that the loss of control was the consequence of an excessive accumulation of ice on the wings and the fuselage. "}