{"url": "https://www.baaa-acro.com/crash/crash-blackburn-b-20-isle-bute-3-killed", "date": "Apr 7, 1940", "type": "Blackburn B-20", "operator": "Blackburn2", "flight_phase": "Flight", "flight_type": "Test", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Dumbarton - Dumbarton", "msn": "01", "yom": 1940, "flight_number": null, "city": "Isle of Bute", "zone": "Argyll", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The float plane took to the air from Dumbarton for its first attempt at a high speed run. The flight that day was over the Forth of Clyde and Sound of Bute on Scotland west coast. A high speed run took place at which a speed of 345 mph was reached, but shortly afterwards severe vibration set in. Reducing speed did not help and Flt Lt Bailey ordered the crew to take to their parachutes. Up in the cockpit Fred Weeks was able to get out of one of the escape hatches in the roof, but Ivan Waller deployed his chute too early and it got caught in the radio mast with him only half way out of the escape hatch. Then the vibration stopped and Ivan was able to climb along the top of the fuselage, untangle his parachute and drop free. Flt Lt Bailey stayed with the aircraft until the last possible moment to give the other two crew members a chance to escape, his parachute did not open fully and he was drowned. The aircraft crashed into the sea off Gourock Head, Isle of Bute. No trace was ever found of Duncan Roberts and Sam McMillan. The two surviving crew members were rescued by the improbable sounding HMS Transylvania (a merchant ship converted in an auxiliary cruiser). The crew of the Transylvania reported seeing a large rectangular unit come down out of the thick cloud cover, probably an aileron. The most likely explanation for the crash is that the initial vibration was aileron flutter, this ceased when the aileron broke free (giving Ivan Waller his chance to free his parachute). But with the loss of an aileron the aircraft would have been uncontrollable, leading to its crash. With the loss of the one and only example of the B20 the project ended.\r\nCrew:\r\nLt Harry Bailey, pilot,\r\nIvan Waller, Rolls-Royce flight test engineer, \r\nFred Weeks, Blackburn flight test engineer, \r\nDuncan Roberts, Blackburn aircraft rigger,\r\nSam McMillan, Blackburn aircraft rigger.", "probable_cause": null}