{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-500rf-sligo", "date": "Nov 2, 2002 at 1702 LT", "type": "Fokker F27 Friendship", "operator": "Euro%20Celtic%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dublin - Sligo", "msn": "10672", "yom": 1984, "flight_number": "ECY406", "city": "Sligo", "zone": "Connacht", "country": "Ireland", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 36, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5710, "captain_hours_type": 1176, "copilot_hours": 20117, "copilot_hours_type": 787, "aircraft_hours": 27452, "circumstances": "The aircraft, a Fokker F27-500, registration G-ECAT, departed Dublin at 16.05 hrs (local time) for the 4th leg of a Public Service Obligation (PSO) rotation between Sligo in the North West of Ireland and Dublin. The aircraft had earlier departed Sligo for Dublin at 10.00 hrs, returned to Sligo at 12.30 hrs and departed once again for Dublin on time at 14.30 hrs. The Operator held the PSO contract to provide regular air service between Sligo and Dublin and also between Donegal (EIDL) and Dublin. The accident flight was delayed for 10 minutes as the flight to Donegal had been cancelled due to strong crosswinds at Donegal and arrangements had been made to fly these passengers to Sligo and bus them onwards to Donegal. The en-route segment of this flight was uneventful. At 16.22 hrs G-ECAT called Sligo on Tower frequency 122.10 Mhz and requested the latest weather conditions for Sligo. The Tower Controller transmitted the 16.30 hrs actual for Sligo, as presented at Section 1.7 Meteorological Information. At 16.50 hrs, the aircraft was handed over from Shannon Control to Sligo Tower, descending to 3,500 ft to the SLG beacon for NDB/DME approach to RWY 11. Sligo Tower then transmitted the Donegal weather, as presented at Section 1.7 Meteorological Information. At 16.53 hrs, the aircraft called overhead the SLG beacon and was cleared by Sligo Tower for the approach. At 17.00 hrs, G-ECAT reported at the Final Approach Fix (FAF) and was cleared to land by the Tower, giving a wind of 120 degrees 15 kt, gusting 29 kt. At 17.01 hrs, just prior to landing, G-ECAT was given a wind check of 120 degrees 15 kt, gusting 31 kt. At 17.02 hrs the aircraft made an initial touchdown at approximately the mid-point of the runway and appeared to a number of witnesses not to immediately decelerate. The aircraft continued down the runway until it departed the paved surface at the right hand side of the threshold of RWY 29. On seeing the aircraft pass the apron taxiway/runway intersection at an abnormally high speed, the Tower Controller immediately sounded the crash alarm. The aircraft continued on through a prepared run-off area at the end of the runway, for a further 50 metres, before coming to rest (17.02:30 hrs) with the main wheels embedded in boulders that formed part of an embankment leading down to the sea. The main wheels were approximately one metre short of where the boulders fall away into the sea. The nose wheel, cockpit and forward section of the fuselage cleared the top of the boulder embankment and the aircraft tilted approximately 15-20 degrees nose down onto the outgoing tide. Full tide was due at 04.00 hrs the following day at a depth of 3.9 meters. The Tower Controller immediately contacted the Shannon ATC Station Manager advising of the runway excursion and called 999 to request Gardaí, Fire Brigade and Ambulance assistance. ", "probable_cause": "The probable cause of this accident was a fast, low approach, leading to the aircraft landing late, beyond the normal touch down point, thereby making it impossible to stop the aircraft on the remaining runway available.\r\nContributory cause:\r\n1. The lack of an adequate overrun area before an aircraft, failing to stop on the runway, enters the sea.\r\n2. The lack of experience of the Operator in scheduled air operations.\r\n3. The changing operational management structure and uncertain nature of the direction of the company with regard to aircraft type and network development. "}