{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-milwaukee-2-killed", "date": "Jul 29, 2015 at 1810 LT", "type": "Socata TBM-700", "operator": "Trustey Management Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Beverly - Milwaukee", "msn": "518", "yom": 2009, "flight_number": null, "city": "Milwaukee-Lawrence J. Timmerman", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1875, "captain_hours_type": 721, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 656, "circumstances": "The airline transport pilot was landing at the destination airport after a cross-country flight in visual meteorological conditions. The tower controller stated that the airplane's landing gear appeared to be extended during final approach and that the airplane landed within the runway's touchdown zone. The tower controller stated that, although the airplane made a normal landing, he heard a squealing noise that continued longer than what he believed was typical. The pilot subsequently transmitted \"go-around.\" The tower controller acknowledged the go-around and cleared the pilot to enter a left traffic pattern. The tower controller stated that he heard the engine speed accelerate while the airplane maintained a level attitude over the runway until it passed midfield. He then saw the airplane pitch up and enter a climbing left turn. The tower controller stated that the airplane appeared to enter an aerodynamic stall before it descended into terrain in a left-wing-down attitude. Another witness reported that he saw the airplane, with its landing gear extended, in a steep left turn before it descended rapidly into terrain. A postaccident examination did not reveal any evidence of flight control, landing gear, or engine malfunction. An examination of the runway revealed numerous propeller slash marks that began about 215 ft past the runway's touchdown zone; however, there was no evidence that any portion of the airframe had impacted the runway during the landing. Additionally, measurement of the landing gear actuators confirmed that all three landing gear were fully extended at the accident site. Therefore, the pilot likely did not adequately control the airplane's pitch during the landing, which allowed the propeller to contact the runway. Due to the propeller strikes, the propeller was likely damaged and unable to provide adequate thrust during the go-around. Further, based on the witness accounts, the pilot likely did not maintain adequate airspeed during the climbing left turn, which resulted in the airplane exceeding its critical angle of attack and experiencing an aerodynamic stall at a low altitude.", "probable_cause": "The pilot's improper pitch control during the landing, which resulted in the propeller striking the runway, and his failure to maintain adequate airspeed during the subsequent go-around, which resulted in the airplane exceeding its critical angle of attack and experiencing an aerodynamic stall at a low altitude.\n"}