{"url": "https://www.baaa-acro.com/crash/crash-vickers-802-viscount-mt-ben-more-4-killed", "date": "Jan 19, 1973 at 1431 LT", "type": "Vickers Viscount", "operator": "BEA", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Mountains", "schedule": "Glasgow - Glasgow", "msn": "158", "yom": 1957, "flight_number": null, "city": "Mt Ben More", "zone": "Perth and Kinross", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 8346, "captain_hours_type": 1835, "copilot_hours": 4340, "copilot_hours_type": 606, "aircraft_hours": 32677, "circumstances": "The crew departed Glasgow Airport at 1422LT on a local post-maintenance test flight with two engineers and two pilots on board. The airplane flew north at an altitude of 4,000 feet under VFR mode for approximately 7 minutes and a half when the captain asked for clearance back into the Glasgow Control Zone. Less than two minutes later, while cruising in poor weather conditions (snow showers), the airplane struck the slope of Mt Ben More (3,852 feet high). The aircraft disintegrated on impact and all four occupants were killed. \r\nCrew:\r\nWalter Duward, pilot, \r\nStan Kemp, copilot.\r\nPassengers:\r\nPaddy Quinn, engineer,\r\nJimmy Moore, engineer. ", "probable_cause": "The aircraft struck a mountain peak whilst flying over snow covered high terrain in marginal visual meteorological conditions. Failure to maintain a safe altitude and insufficient attention to navigational procedures were contributory factors. The following factors were reported:\r\n- Although the Captain obtained some weather information during his visit to the meteorological office he did not seek a briefing from the Duty Forecaster. This may have deprived him of information about the strong winds at his proposed flight level, \r\n- The minimum sector altitude for the area was 4,400 feet and BEA's minimum safe altitude was 5,000 feet; nevertheless the decision to fly at FL 40 (3,800 feet amsl) was permissible for a VFR flight, \r\n- The decision to operate under VFR in the prevailing weather conditions was questionable but probably explicable in the light of the nature of the flight, \r\n- Map reading over snow covered terrain in the prevailing weather conditions would have presented obvious difficulties. The possibility of error may have been increased by temporary distractions resulting from preoccupation with the flight engineering test programme,\r\n- The exact circumstances of the accident are not known, but it probably occurred whilst the aircraft was flying in 'whiteout' conditions associated with a snow shower. "}