{"url": "https://www.baaa-acro.com/crash/crash-learjet-24a-vail-3-killed", "date": "Mar 27, 1987 at 2045 LT", "type": "Learjet 24", "operator": "Kalitta%20Charters", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Denver - Vail", "msn": "24-118", "yom": 1966, "flight_number": null, "city": "Vail", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 19275, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8432, "circumstances": "After refueling in Denver, the medical evacuation flight was diverted from Aspen to Eagle to enplane the patient. IFR flight to Eagle was uneventful and radar service was terminated after the controller cleared the flight for the lDA-A approach to the Eagle Airport which shows a 239° inbound course. The last radio contact occurred when the crew replied 'we're 8 to 10 out and it's clear ahead' to Eagle radio in answer to a request for a base report. The flight collided with an 8,022 foot msl mountaintop bearing 298°, 3.88 miles from the airport while in the approach configuration. The safety board believes the flight was circling to land on runway 07, and the dark night prevented required visual lookout to avoid terrain obstructions. The Jeppesen approach charts used by the flightcrew did not accurately depict terrain obstructions within the 5-mile radius of the airport as stipulated in their legend. The safety board believes this could have mislead the flightcrew. All three occupants were killed. ", "probable_cause": "Occurrence #1: in flight collision with terrain/water\r\nPhase of operation: approach - vfr pattern - base leg/base to final\r\nFindings\r\n1. (f) terrain condition - mountainous/hilly\r\n2. (f) preflight planning/preparation - inadequate - pilot in command\r\n3. (f) lack of familiarity with geographic area - pilot in command\r\n4. (f) light condition - dark night\r\n5. Visual lookout - not possible - pilot in command\r\n6. (f) approach charts - inaccurate\r\n7. (c) planned approach - improper - pilot in command\r\n8. (c) proper altitude - not maintained - pilot in command\r\n9. (f) minimum descent altitude - disregarded - pilot in command"}