{"url": "https://www.baaa-acro.com/crash/crash-boeing-757-225-puerto-plata-189-killed", "date": "Feb 6, 1996 at 2347 LT", "type": "Boeing 757-200", "operator": "Birgenair", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Puerto Plata - Gander - Berlin - Frankfurt", "msn": "22206", "yom": 1983, "flight_number": "KT301", "city": "Puerto Plata", "zone": "Puerto Plata", "country": "Dominican Republic", "region": "Central America", "crew_on_board": 13, "crew_fatalities": 13, "pax_on_board": 176, "pax_fatalities": 176, "other_fatalities": 0, "total_fatalities": 189, "captain_hours": 24750, "captain_hours_type": 1875, "copilot_hours": 3500, "copilot_hours_type": 71, "aircraft_hours": 29269, "circumstances": "On behalf of Alas Nacionales, the aircraft was completing a charter flight from Puerto Plata to Frankfurt with intermediate stops in Gander and Berlin, carrying 176 Germans and 13 Turkish crew members. During the takeoff roll, at a speed of 80 knots, the captain noted that his air speed indicator (ASI) seemed to be incorrect while the copilot's ASI seemed to be correct. During initial climb, at an altitude of about 4,700 feet, the captain's ASI read 350 knots while the real speed was 220 knots. This resulted in an autopilot/autothrottle reaction to increase the pitch-up attitude and a power reduction in order to lower the airspeed. At that time the crew got 'Rudder ratio' and 'Mach airspeed' advisory warnings. Both pilots got confused when the copilot stated that his ASI read 200 knots decreasing while getting an excessive speed warning, followed by a stick shaker warning. This led the pilots to believe that both ASIs were unreliable. Finally realizing that they were losing speed and altitude they disconnected the autopilot. The autopilot, fed by the captain's faulty ASI, had reduced the speed close to the stall speed. Full thrust was then applied. At 23:47:17 an aural GPWS warning sounded and eight seconds later, the aircraft crashed in the ocean. All 189 occupants were killed.", "probable_cause": "The crew's failure to recognize the activation of the stick shaker as a warning of an imminent stall, and the failure of the crew to execute the procedures for recovery from the onset of loss of control. Before the stick shaker warning activated, there was a confusion by the flight crew due to erroneous indications of relative speed increase and an overspeed warning. It is believed that the incorrect ASI readings was the consequence of an obstructed Pitot tube, maybe by mud and/or debris from a small insect that was introduced in the Pitot tube during the time the aircraft was on the ground. The aircraft was not flown for 20 days before the crash and was returned for service without a verification of the Pitot static system as recommended by Boeing."}