{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-san-diego-5-killed", "date": "Oct 24, 2004 at 0025 LT", "type": "Learjet 35", "operator": "Med%20Flight%20Air%20Ambulance", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "San Diego – Albuquerque", "msn": "35-345", "yom": 1980, "flight_number": null, "city": "San Diego-Brown Field", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 13000, "captain_hours_type": 600, "copilot_hours": 3000, "copilot_hours_type": 375, "aircraft_hours": 10047, "circumstances": "On October 24, 2004, about 0025 Pacific daylight time, a Learjet 35A twin-turbofan airplane, N30DK, registered to and operated by Med Flight Air Ambulance, Inc. (MFAA), collided into mountainous terrain shortly after takeoff from Brown Field Municipal Airport (SDM), near San Diego, California. The captain, the copilot, and the three medical crewmembers received fatal injuries, and the airplane was destroyed. The repositioning flight was operated under the provisions of 14 Code of Federal Regulations (CFR) Part 91 with an instrument flight rules (IFR) flight plan filed. Night visual meteorological conditions prevailed. The flight, which was the fourth and final leg of a trip that originated the previous day, departed SDM at 0023.", "probable_cause": "The failure of the flight crew to maintain terrain clearance during a VFR departure, which resulted in controlled flight into terrain, and the air traffic controller's issuance of a clearance that transferred the responsibility for terrain clearance from the flight crew to the controller, failure to provide terrain clearance instructions to the flight crew, and failure to advise the flight crew of the MSAW alerts. Contributing to the accident was the pilots' fatigue, which likely contributed to their degraded decision-making."}