{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-truckee-4-killed", "date": "Feb 10, 1993 at 0815 LT", "type": "Cessna 414 Chancellor", "operator": "Gary L. Means", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Truckee - Farmington", "msn": "414-0630", "yom": 1975, "flight_number": null, "city": "Truckee", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 387, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A Cessna 414 collided with a tree in a mountainous residential area about 1 mile from the airport. Instrument meteorological conditions with 1/8 mile visibility prevailed and an instrument flight rules (IFR) flight plan was filed, but was not opened. The airplane departed under visual flight rules. The elevation of the collision was about 100 feet higher than the airport. The standard instrument departure procedures for the airport prescribe takeoff minimums of 3,500 foot ceiling and 3 miles visibility. The procedure requires a minimum climb rate of 425 feet per nautical mile, a right turn after takeoff to intercept a 002° radial off a VOR, and a climb to a specified altitude. The airman's information manual recommends that pilots climb to 400 feet agl before turning when executing standard instrument departure under IFR. The airplane was also determined to be about 400 pounds over maximum gross weight at the time of the takeoff. The wreckage examination disclosed no evidence of any pre existing aircraft or engine malfunctions or failures. All four occupants were killed. ", "probable_cause": "The decision of the pilot not to follow instrument flight rule procedures during instrument meteorological conditions and poor preflight planning which resulted in operation of the airplane over the maximum gross weight and reduced performance. Factors in the accident were the foggy weather conditions, and high terrain."}