{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-beechjet-400a-sao-jose-dos-campos", "date": "Jul 15, 2008 at 1130 LT", "type": "Beechcraft Beechjet 400", "operator": "Lider", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "São Paulo - São José dos Campos", "msn": "RK-82", "yom": 1994, "flight_number": null, "city": "São José dos Campos", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4300, "captain_hours_type": 2811, "copilot_hours": 540, "copilot_hours_type": 35, "aircraft_hours": null, "circumstances": "The crew departed São Paulo-Congonhas Airport on a positioning flight to São José dos Campos. While descending to São José dos Campos, the captain led the controls to the copilot who was still under instruction. On final, the aircraft was too high on the glide. The captain took over controls but his reaction was excessive. The aircraft suddenly rolled to the right, causing the right wing to struck the ground few dozen metres short of runway 15 threshold. The aircraft landed and came to rest on the main runway. Both pilots evacuated safely while the aircraft was damaged beyond repair. ", "probable_cause": "The captain did not conduct a preflight briefing and then improvised during the descent by deciding to leave the controls to the copilot while he was still under instruction. \r\nThe following contributing factors were identified:\r\n- The copilot who was pilot-in-command on final was in his initial training process,\r\n- The captain authorized the copilot to be the PIC while he was still under initial training,\r\n- The captain was not qualified to operate as an instructor, \r\n- The captain did not make any simulator training for more than two years,\r\n- The copilot had never completed any simulator training since the beginning of his training,\r\n- Lack of crew coordination,\r\n- Poor judgment on part of the captain."}