{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-200-louisburg", "date": "Sep 6, 2015 at 1540 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Rampart-Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Washington - Louisburg", "msn": "181", "yom": 1968, "flight_number": null, "city": "Louisburg-North Raleigh", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7337, "captain_hours_type": 1058, "copilot_hours": 3187, "copilot_hours_type": 1180, "aircraft_hours": 26915, "circumstances": "The airline transport pilot was conducting a cross-country aerial observation flight in the multiengine airplane. The pilot reported that the airplane was on the final leg of the traffic pattern when he reduced the power levers for landing and noticed that the right engine sounded like the propeller was moving toward the beta position. The pilot increased the engine power, and the sound stopped. As the airplane got closer to the runway, he decreased the engine power, and the sound returned. In addition, the airplane began to yaw right. The pilot applied left aileron and rudder inputs to remain above the runway centerline without success. While over the runway, the pilot reduced the engine power to idle, and the airplane continued to yaw right. The pilot applied full power in an attempt to perform a go-around; however, the airplane yawed about 30 degrees off the runway centerline, touched down in the grass, and impacted trees before coming to rest. The right wing, right engine, and right propeller assembly were impact-separated. The right engine propeller came to rest about 50 ft forward of the main wreckage, and it was found in the feathered position. A review of maintenance records revealed that the right propeller had been overhauled and reinstalled on the airplane 2 days before the accident and had operated 9 hours since that time. Subsequent testing of the right propeller governor revealed that it functioned without anomaly; however, the speed settings were improperly configured. Further, the testing revealed that the beta valve travel from the neutral position was out of tolerance. Although this could have let oil pressure port to one side of the spool or the other and, thus, changed the propeller blade angle, it could not be determined whether this occurred during the accident landing. Impact damage precluded examination of the right propeller governor control linkage; therefore, it could not be determined if it was inadequately installed or rigged, which could have resulted in the propeller moving into the beta position. The investigation could not determine why the right propeller moved toward the beta position as engine power was reduced, as reported the pilot.", "probable_cause": "The propeller’s movement to the beta position during landing for reasons that could not be determined during postaccident examination and testing, which resulted in an attempted goaround and subsequent loss of airplane control.\n"}