{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-10-dk-beirut", "date": "Jan 24, 1954 at 0856 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Autrex-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Delivery", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris – Brindisi – Nicosia – Basra – Hanoi", "msn": "12416", "yom": 1944, "flight_number": null, "city": "Beirut", "zone": "Beirut Governorate", "country": "Lebanon", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft, belonging to the Compagnie Autrex-Lopez-Loreta-Lebreton, was on a delivery flight from Paris to Hanoi. It departed from Paris on 22 January 1954 at 0650Z and arrived at Brindisi the same day at 1305Z. The following day the aircraft left Brindisi at 0720Z and landed at Nicosia at 1330Z. From Nicosia the aircraft intended to fly to Basra, but a failure in the HF radio equipment caused a change in the schedule, and it was decided to fly to Beirut where specialists and the spare parts necessary for the repair were available. On final approach by night, the aircraft was too low when, at a speed of 105 knots, it struck a mound of earth located 85 feet short of runway 36, damaging the right mains gear. The aircraft subsequently landed on the runway when the undercarriage collapsed. There were no injuries but the airplane was damaged beyond repair. ", "probable_cause": "The accident was attributed to a pilot error due to lack of knowledge of the terrain. The existence of the mound was only an aggravating circumstance. The failure of the right landing gear may be explained by the excessive landing weight of the aircraft. The main cause of the accident was probably an unduly short landing which, in view of the length of the runway and the perfect condition of the aircraft, was unwarranted and must, therefore, be ascribed mainly to error on the part of the pilot, due largely to his lack of familiarity with the terrain. The pilot had never landed at the Beirut International Airport. The faulty altimeter setting was possibly an additional reason for the defective approach. Also, restricted visibility prevented the pilot from seeing the mound and taking appropriate action to avoid a crash. The presence of the mound at 26.60 meters from the runway entrance was a contributing factor. Since this mound was 78 cm high, the variation in level was 3%."}