{"url": "https://www.baaa-acro.com/crash/ground-accident-bae-125-400b-lanseria", "date": "Feb 12, 2002 at 0800 LT", "type": "BAe 125", "operator": "J & D Aviation", "flight_phase": "Parking", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lanseria – Blantyre", "msn": "25259", "yom": 1971, "flight_number": null, "city": "Lanseria", "zone": "Gauteng", "country": "South Africa", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7881, "captain_hours_type": 64, "copilot_hours": 13500, "copilot_hours_type": 18, "aircraft_hours": null, "circumstances": "The aircraft was parked on the international departures apron at FALA, ready for a flight from FALA to Blantyre. The pilot assumed that the engineer had pressurised the hydraulic accumulator and therefore did not inspect it himself. When the passengers arrived, the pilot got in the aircraft and began the internal pre-start checks. The co-pilot removed the chocks after boarding the passengers, closed the door and then started to brief the passengers. At that moment the pilot noticed that the aircraft was rolling forward. Attempts to stop the aircraft were unsuccessful, the aircraft rolled forward, narrowly missed a hangar and a parked Bell Long-ranger helicopter next to the hangar, crossed the taxiway and finally stopped when entering a ditch between the taxiway and the runway. The pilot was the holder of a valid transport pilot’s licence and had the type endorsed in his licence. The operation of the hydraulic system was found to be satisfactory. The hand pump was used to pressurise the system after which the brakes could be applied successfully.", "probable_cause": "The hydraulic system was not pressurised during the pre-flight inspection of the aircraft. The chocks were therefore removed without adequate hydraulic system pressure available."}