{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1049g-55-super-constellation-tenerife-30-killed", "date": "May 5, 1965 at 2117 LT", "type": "Lockheed L-1049 Super Constellation", "operator": "Iberia-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Madrid – Tenerife", "msn": "4550", "yom": 1954, "flight_number": "IB401", "city": "Tenerife-Norte-Los Rodeos", "zone": "Canary Islands", "country": "Spain", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 6, "pax_on_board": 40, "pax_fatalities": 24, "other_fatalities": 0, "total_fatalities": 30, "captain_hours": 12947, "captain_hours_type": 4110, "copilot_hours": 7802, "copilot_hours_type": 350, "aircraft_hours": null, "circumstances": "Flight 401 was a scheduled domestic flight between Madrid, Spain and Santa Cruz de Tenerife, Canary Islands. At 2053 hours the aircraft was cleared for approach to runway 30 at the Santa Cruz de Tenerife/Los Rodeos Airport. At this time it was informed by the approach controller that the airport was below meteorological minima and that the following weather conditions prevailed: \r\nWind : 330/variable 10 to 12 kt, gust to 14 kt \r\nVisibility: 100 to 500 m, reduced to zero over the runway by a bar of stratus \r\nPresent weather: distant fog, intermittent fog banks \r\nClouds: 6/8 stratus from 0 to 30 m \r\nQNH: 30.03 in of Hg \r\nQFE: 942.9 mb \r\nTemperature: 14° \r\nDew-point : 14°. \r\nThis was acknowledged by the flight. The pilot, who saw the beginning of runway 30 clearly but not the rest of it, decided to make a very low run after which he re-applied power for a go-around at 2106 hours. He circled the aerodrome, apparently intending to land, and at 2115 hours reported on final. At 2117 hours he reported to the tower: \"401 pulling up to go around\", and this was the last communication received from the aircraft. It was subsequently found that, when starting its go-around, the aircraft struck a scraper and tractor located 50 m from the runway edge, with one leg of the undercarriage and the lower aft part of the fuselage. It left various debris scattered about and finally crashed on the western edge of the diversion canal of the Rodeo gorge. From there, it slid about 100 m across private farmland and finally burst into flames. The accident occurred at 2117 hours.", "probable_cause": "The pilot-in-command should have proceeded in view of the adverse weather conditions prevailing at the airport, which he should have appreciated during his first fly-past. His partial view of the airport and the glow of lights must have induced him to make a new attempt with the consequences described above."}