{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-point-lenana-14-killed", "date": "Jul 19, 2003 at 1800 LT", "type": "Swearingen SA226 Metro II", "operator": "Ryan Blake Air Charter", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Nairobi – Samburu", "msn": "TC-349", "yom": 1980, "flight_number": null, "city": "Mt Kenya", "zone": "Central", "country": "Kenya", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Nairobi-Wilson Airport at 1558LT on a charter flight to Samburu, carrying 12 passengers (all US citizens) and two pilots. En route, the crew decided to make a tour over the Mt Kenya before continuing to Samburu. While cruising at an altitude of 16,500 feet in clouds, the aircraft struck the eastern slope of Mt Point Lenana (third highest peak of Mt Kenya). The wreckage was found 450 feet below the summit and all 14 occupants were killed. ", "probable_cause": "Controlled flight into terrain after the crew failed to maintain horizontal and vertical situational awareness of the aircraft’s proximity to the surrounding terrain.\r\nThe following contributing factors were identified:\r\n- Unfamiliarity with the airspace and the route in particular and the existence of high ground on the planned flight route,\r\n- Inadequate flight planning by the pilots and distraction of their attention when they were instructed to contact Nanyuki,\r\n- Poor pilot briefing by the Wilson ATC briefing office,\r\n- Poor communication between the air traffic control units,\r\n- Failure of the radar controller to advise the pilot of termination of radar service,\r\n- Lack of a radar system minimum safe altitude warning to the radar controller,\r\n- Poor civil military coordination during transit through the military airspace."}