{"url": "https://www.baaa-acro.com/crash/crash-raytheon-390-premier-i-blackpool", "date": "Mar 12, 2015 at 1148 LT", "type": "Raytheon 390 Premier I", "operator": "Pool-Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Avignon – Blackpool", "msn": "RB-146", "yom": 2005, "flight_number": null, "city": "Blackpool", "zone": "Lancashire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3455, "captain_hours_type": 408, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft planned to fly from Avignon Airport, France to Blackpool Airport, with two flight crew and two passengers. The co-pilot performed the external checks; this included checking the fluid level in the hydraulic reservoir, as stated in the ‘Pilot Checklist’. The aircraft was refuelled to 3,000 lb and, after the passengers boarded, it departed for Blackpool. The commander was the pilot flying (PF). The takeoff and cruise to Blackpool were uneventful. Prior to the descent the crew noted ATIS Information ‘Lima’, which stated: Runway 10, wind from 150° at 18 kt, visibility 9 km, FEW clouds at 2,000 ft aal, temperature 11°C, dew point 8°C, QNH 1021 hPa, runway damp over its whole length. The commander planned and briefed for the NDB approach to Runway 10, which was to be flown with the autopilot engaged. Whilst descending through FL120, the left, followed by the right, hydraulic low pressure cautions illuminated. Upon checking the hydraulic pressure gauge, situated to the left of the commander’s control column, the pressure was noted to be ‘cycling up and down’, but for the majority of the time it indicated about 2,800 psi (in the green arc). During this time the hydraulic low pressure cautions went on and off irregularly, with the left caution being on more often than the right. The co-pilot then actioned the ‘HYDRAULIC SYSTEM - HYDRAULIC PUMP FAILURE’ checklist. It stated that if the hydraulic pressure was a minimum of 2,800 psi, the flight could be continued. Just before the aircraft reached the Blackpool NDB, the commander commented “it’s dropping”, but he could not recall what he was referring to. This was followed by the roll fail and speed brk [brake] fail caution messages illuminating. The co-pilot then actioned the applicable checklists. These stated that the Landing Distances Required (LDR) would increase by approximately 65% and 21%, respectively. As the roll fail LDR increase was greater than that of the speed brk fail, the crew used an LDR increase of 65% which the co-pilot equated to 5,950 ft. Runway 10 at Blackpool has an LDA of 6,131 ft, therefore they elected to continue to Blackpool. The roll fail checklist stated that a ‘FLAPS UP’ landing was required. The co-pilot then calculated the VREF of 132 kt, including a 20 kt increment, as stipulated by the ‘FLAPS UP, 10, OR 20 APPROACH AND LANDING’ checklist. The commander then continued with the approach. At about 4 nm on final approach the co-pilot lowered the landing gear, in response to the commander’s request. About 8 seconds later the commander said “just lost it all”; referring to the general state of the aircraft. This was followed almost immediately by the landing gear unsafe aural warning, as the main landing gear was not indicating down and locked. Whilst descending through 1,000 ft, at just over 3 nm from the threshold, the commander asked the co-pilot to action the ‘ALTERNATE GEAR EXTENSION’ checklist. The commander then discontinued the approach by selecting ALT HOLD, increased engine thrust and selected a 500 ft/min rate of climb on the autopilot. However, a few seconds later, before the co-pilot could action the checklist, the main gear indicated down and locked. The commander disconnected the autopilot and continued the approach. The crew did not consider reviewing the ‘HYDRAULIC SYSTEM - HYDRAULIC PUMP FAILURE’ checklist as they had not recognised the symptoms of loss of hydraulic pressure. When ATC issued the aircraft its landing clearance the wind was from 140° at 17 kt. This equated to a headwind component of about 10 kt and a crosswind of about 12 kt. As the aircraft descended through 500 ft (the Minimum Descent Altitude (MDA) for the approach) at 1.5 nm from the threshold, the commander instructed the co-pilot to advise ATC that they had a hydraulic problem and to request the RFFS to be put on standby. There was a slight delay in transmitting this request, due to another aircraft on frequency, but the request was acknowledged by ATC. The aircraft touched down about 1,500 ft from the start of the paved surface at an airspeed of 132 kt and a groundspeed of 124 kt. When the commander applied the toe (power) brakes he felt no significant retardation. During the landing roll no attempt was made to apply the emergency brakes, as required in the event of a power brake failure. The co-pilot asked if he should try to operate the lift dump, but it failed to function, due to the lack of hydraulic pressure. At some point, while the aircraft was on the runway, the co-pilot transmitted a MAYDAY call to ATC. When an overrun appeared likely, the commander shut down the engines. The aircraft subsequently overran the end of the runway at a groundspeed of about 80 kt. The commander later commented that he was in a “state of panic” during the landing roll and was unsure whether or not he had applied the emergency brake. As the aircraft left the paved surface the commander steered the aircraft slightly right to avoid a shallow downslope to the left of runway’s extended centreline. The aircraft continued across the rough, uneven ground, during which the nose gear collapsed and the wing to fuselage attachments were severely damaged (Figure 1). Once it had come to a stop, he shut down the remaining aircraft systems. The passengers and crew, who were uninjured, vacated the aircraft via the entry/exit door and moved upwind to a safe distance. The RRFS arrived shortly thereafter. ", "probable_cause": "The crew carried out the reservoir level check procedure in accordance with the checklist prior to the flight and found it to be correct, as indicated by the test light not illuminating. This meant that there was at least 1.2 gals (4.5 litres) of fluid within the reservoir. Evidence of hydraulic leakage was only visible within the left engine nacelle. The crew reported fluctuating hydraulic pressure in the latter stages of the flight and intermittent l hyd press lo then r hyd press lo captions on the annunciator panel, the left more than the right. After they had selected the landing gear down the hydraulic pressure dropped completely. The pressure fluctuations suggest that the left pump in particular was struggling to maintain pressure due to cavitation and leakage. As the fluid in the system was gradually depleting, later shown by the fluid accumulation in the engine bay, the right hydraulic pump was also suffering cavitation, as indicated by the r hyd press lo indications. When the MLG was lowered the fluid taken in by the retraction jacks, which is estimated to be at least 4 pints (2.27 litres), further reduced the volume of hydraulic fluid. This resulted in more severe pump cavitation such that the pumps were not able to produce or maintain useable hydraulic pressure. It is likely that the fluid quantity became unviable as the landing gear reached the full extent of its travel, manifesting itself in a delay in getting the gear down and locked indication and the inboard doors not being able to complete their sequence and remaining open. The parking/emergency brake was not affected by the hydraulic system loss. Had a demand been made on the emergency brakes system during the landing it would have worked normally, albeit without anti-skid and a reduced retardation capability. Pump port cap failure The multiple-origin cracking found in the port cap by the laboratory testing had propagated from a thread root in the bore to the outer surface of the cap. It is not known how long the crack had been propagating for, but it is likely that the crack broke the surface of the cap relatively recently, allowing the leakage of fluid outwards under pressure from within the pump. The excessive pitting at the root of the thread is likely to have initiated the fatigue crack, with the thread root radius as a contributory factor. The load imparted into the thread by the compensator plug fitting places the thread under a constant tensile stress when the pump is operating, leading to the eventual fatigue failure."}