{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-corcelles-les-monts-4-killed", "date": "Oct 9, 2004 at 1418 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Huktra International", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Ostend - La Chassagne", "msn": "46-8408062", "yom": 1984, "flight_number": null, "city": "Corcelles-les-Monts", "zone": "Côte-d'Or", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 2958, "captain_hours_type": 300, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The single engine aircraft departed Ostend Airport, Belgium, on a flight to the private airstrip of Château La Chassagne located about 21 km west of the Dijon-Longvic Airport. The flight from Ostend to Dijon was completed under IFR rules and was uneventful. After being cleared to continue under VFR to La Chassagne, the pilot cancelled the IFR flight plan and was cleared for a descent to runway 36. Visibility was 10 km, rain, ceiling at 800 feet and minimum safe altitude at 3,300 feet. The pilot informed ATC he was descending to runway 18 and left the frequency. Shortly later, at an altitude of 1,700 feet, the aircraft struck the southeast slope of Mt Afrique located in Corcelle-les-Monts. The wreckage was found in a wooded area and all four occupants were killed. ", "probable_cause": "The accident was the result of a controlled flight into terrain following the obstinacy of the pilot to continue the descent in adverse weather conditions. It was also reported that the medical certificate, related to the pilot's license issued by the United States in 2002, was obtained on the basis of a false declaration, omitting the elements that had previously justified unfitness in Belgium."}