{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-27-islander-petreasa-2-killed", "date": "Jan 20, 2014 at 1547 LT", "type": "Britten-Norman Islander", "operator": "SSAVC", "flight_phase": "Flight", "flight_type": "Ambulance", "survivors": "Yes", "site": "Mountains", "schedule": "Bucharest - Oradea", "msn": "822", "yom": 1977, "flight_number": "111", "city": "Petreasa", "zone": "Alba", "country": "Romania", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 15261, "captain_hours_type": 42, "copilot_hours": 886, "copilot_hours_type": 21, "aircraft_hours": 3335, "circumstances": "The twin engine aircraft departed Bucharest-Baneasa Airport on an ambulance flight to Oradea, carrying a medical team, one patient and two pilots. Doctors should go to Oradea to obtain transplant organs from a patient who just passed away. While cruising at an altitude of 6,300 feet vertical to the Apuseni Mountain Range, the crew encountered marginal weather conditions with icing conditions but continued when both engines lost power and failed. The crew attempted an emergency landing when the aircraft collided with trees and crashed in a snowy and wooded hillside at an altitude of 1,400 metres. A pilot and a passenger were killed while five other occupants were injured. The aircraft was destroyed. ", "probable_cause": "Double engine failure in flight due to carburetor icing. The following contributing factors were identified:\r\n- Erroneous assessment of the risk factors specific to the conduct of this flight,\r\n- Lack of crew experience on this type of aircraft,\r\n- Erroneous decision of the captain to continue the flight in meteorological conditions that caused the carburetor icing, \r\n- Erroneous decision of the captain to continue to fly for a long period of time in icing conditions, \r\n- Erroneous decision of the captain to continue the mission under the AMA, under conditions of BMI flight according to IFR flight rules,\r\n- Erroneous decision of the crew to initiate the flight while the total weight of the aircraft was above MTOW and the CofG was outside the prescribed limits. "}