{"url": "https://www.baaa-acro.com/crash/crash-cessna-421a-golden-eagle-i-shobdon-3-killed", "date": "Aug 3, 1997 at 1521 LT", "type": "Cessna 421A Golden Eagle I", "operator": "Launchapart", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Elstree - Shobdon", "msn": "421A-0097", "yom": 1968, "flight_number": null, "city": "Shobdon", "zone": "Herefordshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2386, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a private flight from Elstree to Shobdon in Herefordshire. The meteorological forecast indicated that a warm front was approaching Southern England from the south-west and conditions were generally deteriorating. The visibility on departure from Elstree at 1437 hrs was greater than 10 km with a broken cloud base at 2,500 feet. When the aircraft arrived at Shobdon the visibility was estimated to be 3 to 4 km in light drizzle with a cloud base at approximately 1,200 feet, and the surface wind was 090_/5 kt. The first radio contact between the aircraft and Shobdon was made at about 1502 hrs when the pilot called to say that he was inbound from Elstree. In response to this call he was passed the airfield details. The pilot later called when approaching Leominster and subsequently called downwind for Runway 09 which has a right-hand circuit. The  operator of the ground to air radio facility at Shobdon saw the aircraft on the downwind leg abeam the tower at what appeared to be a normal circuit height. He did not observe the aircraft downwind but shortly afterward she heard a brief and indecipherable radio transmission which sounded like a scream. This same transmission was heard by an aircraft enthusiast who was monitoring the radio transmissions on his 'airband' radio. The radio operator repeatedly attempted to make contact with the aircraft but to no avail and so he instructed an aircraft refueller to inform the emergency services that an aircraft had crashed. Analysis of recorded radar data from the radar head at Clee Hill,Shropshire, indicates that the aircraft joined the downwind leg from the east at a height of 1,100 feet. This radar data shows that the aircraft then followed a normal ground track until towards the end of the downwind leg when there was an alteration of track to the left of about 20_ before the aircraft entered a right turn onto the base leg. At the same time as the aircraft altered track to the left it began a slow descent, at about 350 ft/min, from 1,100 feet to 600 feet, at which stage it disappeared below radar coverage. The average ground speed on the downwind leg was 112kt and this reduced to 100 kt as the aircraft descended. Two witnesses saw the aircraft in a position that equates to the base leg. The witness to the east of the aircraft track first heard the sound of an aircraft engine that was unusually loud and then saw the aircraft at an estimated height of 150 to 200 feet, it was descending slowly with the wings level. A loud \"cough\"from one of the engines was heard \"as if it had backfired\"followed by a puff of white smoke and then the sound of an engine increasing in RPM. The wings were then seen to rock from side to side as the aircraft went out of sight. The second witness,to the west of the aircraft track, described the aircraft flying very low, between 50 and 100 feet, and slowly descending. He saw that the wings were \"wavering\", the left wing then suddenly dropped until it achieved a bank angle of about 90_ at which stage the nose dropped and the aircraft disappeared behind some low trees and was heard to hit the ground. Some local farmers immediately went to the crash site. Initially there was no fire or smoke, but a small fire soon developed in the area of the right wing and this was quickly extinguished by the farmers.", "probable_cause": "Examination of the engines showed that they had both been mechanically and electrically capable of running, however, at impact the left engine was stationary. It was also likely that there was very little fuel onboard the aircraft at the time of the accident. It is therefore probable that mismanagement of the fuel system caused the left engine to stop. The eye witness accounts are consistent with the behaviour of a twin engine aircraft that has suffered a failure of one engine and is flown below its minimum control speed for flight on one engine. With a low power setting on the right (live) engine the speed was allowed to reduce further until the left wing stalled. There was then insufficient height available to regain control of the aircraft"}