{"url": "https://www.baaa-acro.com/crash/crash-ateco-westwind-ii-peoria-16-killed", "date": "Oct 21, 1971 at 1220 LT", "type": "Beechcraft E18", "operator": "Chicago-Southern-Airlines1", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago - Peoria", "msn": "BA-211", "yom": 1956, "flight_number": "SC804", "city": "Peoria", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 14, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": 16119, "captain_hours_type": 133, "copilot_hours": 4690, "copilot_hours_type": 43, "aircraft_hours": 7751, "circumstances": "Chicago & Southern Airlines, Inc., Flight 804, crashed at approximately 1220 central daylight time while it was executing an instrument approach to the Greater Peoria Airport, Peoria, Illinois. The 16 persons on board received fatal injuries. The aircraft made initial contact with powerlines which cross the VOR Runway 12 final of Runway 12 of the Greater Peoria Airport approach course, approximately 2 miles west. Near the point of contact there are two towers, each of which supports four sets of cables. The easterly tower is 681 feet mean sea level. The elevation of the ground at the base of the most contact was made with the lower cables which were 65 feet above ground level. The aircraft thereafter contacted the ground, bounced and slid into the base of a large hedgewood tree 152 feet from the point of initial wire contact, along a wreckage path of 050° magnetic. The major portion of the aircraft structure remained at the base of the tree. An intense fire ensued which almost completely destroyed the cockpit and cabin area of the fuselage. All 16 occupants were killed. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was that the pilot knowingly descended below the Minimum Descent Altitude in an attempt to complete the approach by means of visual reference to ground objects. Because of minimal visibility and low clouds in the approach zone, the aircraft was operated at an altitude too low to provide clearance over the powerlines. "}