{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950-near-taupo", "date": "May 8, 1995 at 0720 LT", "type": "Fletcher FU-24", "operator": "Farmers%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "Yes", "site": "Plain, Valley", "schedule": null, "msn": "252", "yom": 1978, "flight_number": null, "city": "Taupo", "zone": "Waikato Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 332, "captain_hours_type": 44, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Sole on board, the pilot was engaged in a crop spraying mission in the region of Taupo. Shortly after takeoff, while climbing at low height, the pilot initiated a right turn when the aircraft lost height and crashed in a pasture about 11 km northeast of Taupo. The aircraft was destroyed and the pilot was seriously injured. ", "probable_cause": "The following findings were reported:\r\n- During a turning manoeuvre at a low height, the aircraft stalled and squashed onto the ground in a wing level attitude, at a high rate of descent, \r\n- The height of the aircraft above the ground at the time afforded the pilot little opportunity for recovery, \r\n- The pilot probably reverted to an unsafe flying practice he had adopted during his earlier training, \r\n- The unsafe practice had been recognised by a previous instructor who, when not successful in correcting it, had discontinued the pilot's training, \r\n- The final instructor had no reason to be concerned about the pilot's flying as he had exhibited no dangerous trends and flew as instructed, \r\n- Had the final instructor been aware of a previous trait of the pilot to perform unsafe manoeuvres he might have been able to correct it, \r\n- The causal factors in this accident were a lack of continuity in training records, pressure the pilot believed he was under to achieve maximum productivity in his flying with a minimum of delay, the pilot's apparent refusal to accept cautions in relation to his ability, and the Fletcher aircraft's performance during the execution of a limit manoeuvre too close to terrain. "}