{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47-dl-near-milluni-17-killed", "date": "Dec 8, 1964 at 1000 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Aerolineas%20Abaroa", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Caranavi – Tipuani – La Paz", "msn": "7375", "yom": 1943, "flight_number": null, "city": "Milluni", "zone": "La Paz", "country": "Bolivia", "region": "South America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 13, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 17, "captain_hours": 5161, "captain_hours_type": null, "copilot_hours": 720, "copilot_hours_type": 625, "aircraft_hours": 17007, "circumstances": "The aircraft was on a scheduled domestic flight from Caranavi Airport to La Paz via Tipuani. It arrived at Tipuani at 0913 hours Bolivian time, carrying a crew of three, a supernumerary crew member and a passenger for La Paz. At Tipuani, eleven adult passengers and a baby boarded the aircraft. Departure from Tipuani was at 0934:36 hours and the estimated time of arrival at La Paz was 1010 hours. The last communication with Tipuani control was made at 1002 hours when it requested permission to change to the frequency of the La Paz aerodrome control zone. When the aircraft did not enter the control zone within the normal five-minute time, an emergency was declared at 1022 hours, and at 1048 hours it was learnt from the Milluni broadcasting station that the aircraft had been seen exploding in the air and falling to earth near the cemetery of that mining area. At 1121 hours the disaster was confirmed by another aircraft, CP-621, which was flying over the area. The site of the accident was 16° 21' 00\" S and 68° 10' 00\" W, at an elevation estimated between 14,000 and 14,500 ft. The aircraft was totally destroyed and all 17 occupants were killed. ", "probable_cause": "A violent explosion of criminal origin inside and at the rear of the aircraft during flight, which caused the tail unit to be torn off. It was later determined that one of the passenger signed three life-insurance with three different companies in case of plane crash only. "}