{"url": "https://www.baaa-acro.com/crash/crash-raytheon-premier-udaipur", "date": "Mar 19, 2008 at 1507 LT", "type": "Raytheon 390 Premier I", "operator": "Ran Air Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jodhpur - Udaipur", "msn": "RB-23", "yom": 2001, "flight_number": null, "city": "Udaipur", "zone": "Rajasthan", "country": "India", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2900, "captain_hours_type": 40, "copilot_hours": 896, "copilot_hours_type": 58, "aircraft_hours": 989, "circumstances": "The aircraft, after necessary met and ATC briefing took off at 0940 UTC from Jodhpur on direct route W58 at cruise FL 100 and sector EET 20 minutes as per Flight Plan. No abnormality was reported / recorded by the pilot during take off from Jodhpur. The crewmember of the aircraft while operating Jodhpur–Udaipur were the same who operated flight Delhi-Jodhpur on 18.3.2008. There were five passengers also on board the aircraft. The aircraft climbed to the assigned level where the pilot was experiencing continuous turbulence at FL100. The pilot communicated the same to the ATC Jodhpur and requested for higher level which was not granted and advised to continue at same level and contact ATC Udaipur for level change. It came in contact with Udaipur at 0944 UTC, approx 50 NM from Udaipur. At 0948 the weather passed by ATC was winds 180/07 kts. Vis 6 km. Temp 34, QNH 1006 Hpa and advised for ILS approach on runway 26. Consequently the pilot requested to make right base Rwy 26 visual approach, which was approved by the ATC. Aircraft did not report any defect/snag. Pilot further stated that during approach to land at Udaipur when flap 10 degree was selected, the flap didn’t respond and ‘Flaps-Fail’ message flashed. Thereafter he carried out the check list for flapless landing. At 1004 UTC when the aircraft reported on final the ATC cleared the aircraft to land on runway 26 with prevailing wind 230/10 Kts. The same was acknowledged by the crew and initiated landing. At about 20 to 30 feet above ground the pilot stated to have experienced sudden down-draft thereby the aircraft touched down heavily on the runway. The touch-down was on the centerline, at just before the touchdown Zone (TDZ), on the paved runway, after the threshold point. Consequent to the heavy impact both the main wheel tyre got burst; first to burst was right tyre. The aircraft rolled on the runway centerline for a length of about 1,000 feet in the same condition. Thereafter it gradually veered to the right of the runway 26 at distance of approx 2,200 feet runway length from the threshold of the runway. The aircraft left the runway shoulder and after rolling almost straight for another 90 ft it stopped after impact with the airport boundary wall.", "probable_cause": "The approach speed for flapless landing was about 149 knots against the calculated speed 130-135 knots approx. Incident occurred as the aircraft impacted runway with higher speed while carrying out flapless approach and landing."}