{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1649a-starliner-bogota-17-killed", "date": "Dec 18, 1966 at 0255 LT", "type": "Lockheed L-1649 Starliner", "operator": "Aerocondor%20Colombia", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Miami - Bogotá", "msn": "1002", "yom": 1957, "flight_number": null, "city": "Bogotá-El Dorado", "zone": "Bogotá Capital District", "country": "Colombia", "region": "South America", "crew_on_board": 7, "crew_fatalities": 4, "pax_on_board": 52, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 17, "captain_hours": 22000, "captain_hours_type": 600, "copilot_hours": 18000, "copilot_hours_type": 350, "aircraft_hours": 11068, "circumstances": "The aircraft, which was on wet lease from Passaat Ltd., Miami, U.S.A., to Aerocondor de Colombia, was on a non-scheduled international flight from Miami International Airport, U.S.A., to Bogotá-El Dorado Airport, Colombia. The flight took off from Miami at 2040 hours local time on 17 December and proceeded normally. At 0240 hours local time, on 18 December, it reported over the Bogotá VOR at 12,000 feet and requested from the Air Route Traffic Control Centre authorization to change over to frequency 118.1 mcs and to contact El Dorado Control Tower. This was granted and communications were established with the Control Tower. The flight was given a QNH of 30.14 in. Hg. and was cleared for landing on Runway 12; however, it requested permission to land on Runway 30. It was then instructed to proceed directly to the inner marker for Runway 12, at 8,895 feet (elevation of the airport was 8,364 feet) and if visual to make a circling approach to Runway 30. There were fog patches on and in the vicinity of the aerodrome. The tower communications tape recording revealed that the flight reported proceeding inbound to Runway 12 and that it was instructed to continue its approach to Runway 12 as the fog appeared to be thinning out in that direction. Shortly thereafter the tower asked \"how is visibility in the direction of 12\" and the flight replied \"It is a little better, I think we can make it in a second\". At 0753 hours GMT the flight requested permission to land and the tower replied 'I... correct, cleared to land if you can do so, lights are at maximum intensity, let us know if it is necessary to reduce them'. The flight advised the lights were OK and reported on final approach. It was cleared to land and was advised again that the wind was calm and the QNH was 30.14 in. Hg. It acknowledged the message by \"Thanks\". Some 10 to 20 sec. later an explosion was heard and the control tower called the flight several times in vain. The fire crews were immediately alerted and directed to the threshold of Runway 12. They reported that the wreckage of the aircraft was some 10 to 20 m before the threshold of Runway 12. Four crew members and 13 passengers were killed while 42 other occupants were injured. The aircraft was destroyed. ", "probable_cause": "The accident was attributed to pilot error. The pilot-in-command misjudged the distance between the aeroplane and the ground and undershot the landing area. He also exercised poor judgement in taking the decision to land in variable weather conditions which perhaps precluded proper visibility of the VASI lights and identification of the exact location of the threshold of Runway 12, and in failing to follow the missed approach procedure specified on the Eldorado International Airport chart. The following findings were reported:\r\n- The crew of the aircraft held valid licences with appropriate type rating at the time of the accident; however, the pilot-in-command held a \"second class\" medical certificate which, according to the U.S. FAA regulations did not entitle him to act as pilot-in-command of an airline commercial transport aircraft carrying passengers,\r\n- The copilot and flight engineer held valid medical certificates,\r\n- The aircraft had a valid Certificate of Airworthiness in accordance with the FAA regulations and had been inspected on 2 September 1966. Maintenance was carried out at an FLU approved base,\r\n- There were variable fog patches at Eldorado Airport at the time of the final approach to land; however, the pilot considered that the weather conditions were satisfactory,\r\n- The landing weight of the aircraft at Eldorado Airport was 5 800 lb above the limit specified by the manufacturer,\r\n- The investigations carried out at the scene of the accident indicated that the aircraft, its controls and the powerplants were operating properly. Furthermore, no technical deficiencies had been reported by the crew,\r\n- It was concluded that the accident was due to an error of the pilot who misjudged the distance between the aircraft and the ground, and who exercised poor judgement in taking the decision to land in variable weather conditions which possibly reduced the visibility of the VASI lights and precluded proper identification of the threshold of the runway,\r\n- The recording of the communications between the aircraft and the control tower revealed the presence of a fourth person in the cockpit during the final approach. All communications from the aircraft were made in Spanish. The official report of the FAA's operations inspector stated that the pilot-in-command spoke a little Spanish but not fluently. It was concluded that the Manager of Aerocondor was the person in direct contact with the control tower and that his presence in the cockpit may have disturbed the execution of the landing operation by the pilot-in-command and caused him to exceed his abilities. "}