{"url": "https://www.baaa-acro.com/crash/crash-cessna-441-conquest-ii-rossville-3-killed", "date": "Feb 22, 2018 at 1939 LT", "type": "Cessna 441 Conquest", "operator": "Ponderosa%20Aviation", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Eagle Creek Airpark - Green Bay", "msn": "441-0065", "yom": 1978, "flight_number": null, "city": "Rossville", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2248, "captain_hours_type": 454, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6907, "circumstances": "The airline transport pilot and two passengers departed in the twin-engine, pressurized airplane on a business flight in night instrument meteorological conditions. Shortly after takeoff, the airplane began to deviate from its assigned altitude and course. The controller queried the pilot, who responded that the airplane was \"… a little out of control.\" After regaining control of the airplane, the pilot reported that he had experienced a \"trim issue.\" The airplane continued on course and, about 13 minutes later, the pilot again reported a trim malfunction and said that he was having difficulty controlling the airplane. The flight's heading and altitude began to deviate from the course for the last 8 minutes of radar data and became more erratic for the last 2 minutes of radar data; radar and radio communication were subsequently lost at an altitude of about 18,300 ft in the vicinity of the accident site. Several witnesses reported hearing the airplane flying overhead. They all described the airplane as being very loud and that the engine sound was continuous up until they heard the impact. The airplane impacted a field in a relatively level attitude at high speed. The wreckage was significantly fragmented and the wreckage path extended about 1/4 mile over several fields. Examination of the available airframe and engine components revealed no anomalies that would have precluded normal operation of the airplane. The accident airplane was equipped with elevator, rudder, and aileron trim systems; however, not all components of the trim system and avionics were located or in a condition allowing examination. Although the airplane was equipped with an electric elevator trim and autopilot that could both be turned off in an emergency, the investigation could not determine which trim system the pilot was reportedly experiencing difficulties with. It is likely that the pilot was unable to maintain control of the airplane as he attempted to address the trim issues that he reported to air traffic control. ", "probable_cause": "An in-flight loss of control for reasons that could not be determined based on the available evidence."}