{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-600-donegal-springs-1-killed", "date": "Sep 4, 1998 at 2040 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "David C. Blessing", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Donegal Springs – Philadelphie", "msn": "60-0001", "yom": 1967, "flight_number": null, "city": "Donegal Springs", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1185, "captain_hours_type": 398, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane departed at night after maintenance was performed on the left engine. The pilot attempted to return to the airport and while on base leg struck the ground inverted and nose down. The left engine propeller was found feathered. On the left engine, the # 5 cylinder was off the engine and the # 5 piston with the connecting rod still attached were found nearby. Interviews revealed that during maintenance, the # 1,3,5,and 6 cylinders had been removed and reinstalled; however, the # 5 cylinder had not been tightened. Several people had worked on the airplane at various stages of the work. The maintenance facility did not have a system to pass down what had been accomplished, and the FAA did not require the tracking of work accomplished in other than 14 CFR Part 121, or 14 CFR Part 145 facilities. ", "probable_cause": "The failure of the pilot to maintain airspeed during a precautionary landing which resulted in a loss of control while operating with one engine shutdown. An additional cause was the improper maintenance procedures that resulted in the #5 cylinder not being tightened down. A factor was the night conditions. "}