{"url": "https://www.baaa-acro.com/crash/crash-curtiss-t-18-condor-i-troy-1-killed", "date": "Oct 21, 1935 at 1100 LT", "type": "Curtiss T-18 Condor I", "operator": "Chamberlin Flying Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Troy – Teterboro", "msn": "G-2", "yom": 1930, "flight_number": null, "city": "Troy", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after takeoff, while in initial climb, the left engine failed. The crew decided to return to Troy Airport but during the last turn, just passing over a small hill, the aircraft lost altitude, impacted a tree and swung into another before dropping to the ground, bursting into flames. All six occupants were seriously injured and the aircraft was destroyed by impact forces and a post crash fire. The captain died few hours later resulting from his injuries. It appears that the aircraft was carrying two couples and was originally planned as a sky wedding flight over New York City. The captain killed in the accident was Harry Hublitz, aged 42. The famous ace feminine pilot Ruth Nichols was among the passengers and was seriously injured.  ", "probable_cause": "There was no structural or mechanical-failure of the aircraft or controls. The cause of the left engine failing could not be determined due to damage sustained by fire. Whether or not the right engine was delivering full power could not be determined. It is evident, however, that the airplane could not maintain its altitude after the left engine failed. It is possible also that a downdraft was encountered while crossing the hill on the return flight to the airport, which caused the airplane to lose further altitude. Turning toward the disabled engine for the return flight necessitated considerably more loss of altitude than would a turn in the direction of the functioning engine. It is the opinion of the Bureau of Air Commerce that the probable cause of this accident was poor judgment on the part of the pilot in his handling of the airplane following an engine failure."}