{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-hammonton", "date": "Apr 5, 2013 at 1150 LT", "type": "Cessna 414 Chancellor", "operator": "Luis A. Terry", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Gaithersburg - Hammonton", "msn": "414-0958", "yom": 1977, "flight_number": null, "city": "Hammonton", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 587, "captain_hours_type": 120, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9376, "circumstances": "Aircraft was substantially damaged when it veered off the runway while landing at Hammonton Municipal Airport (N81), Hammonton, New Jersey. The private pilot was not injured and the commercial pilot-rated passenger received minor injuries. Visual meteorological conditions prevailed, and an instrument flight rules flight plan was filed for the flight. The flight originated from Montgomery County Airpark (GAI), Gaithersburg, Maryland about 1105 and was destined for N81. The personal flight was conducted under the provisions of Title 14 Code of Federal Regulations Part 91. The airplane was being repositioned to N81 in order for the owner's insurance adjuster and a local mechanic to physically inspect previous claim work for damage done during ground handling following Hurricane Sandy. The pilot reported lowering the landing gear during the approach to runway 03, and confirmed that they were extended by observing the landing gear position indicator lights. Immediately after touchdown, the airplane veered to the left. The pilot applied full right rudder, but the airplane continued to veer to the left. After departing the left side of the runway, the airplane struck several trees and was subsequently engulfed in a post-crash fire. According to FAA records, the pilot held a private certificate, with ratings for airplane single- and multiengine land. His most recent FAA third class medical certificate was issued on January 2, 2013. As of April 5, 2013, the pilot reported a total of 587 total hours of flight experience, of which 120 hours were in the same make and model as the accident airplane. The seven-seat, twin-engine, low-wing, retractable tricycle-gear airplane was manufactured in 1977 and was equipped with two Continental Motors TSIO-520, 520-hp engines. Review of the airplane's maintenance logbooks revealed that its most recent annual inspection was completed on October 26, 2012. At the time of inspection, the airplane had accumulated 9,335 total hours in service. The number one and two engines accumulated approximately 735 and 157 total hours of operation since overhaul, respectively. The airplane had flown about three hours since the most recent annual inspection. The 1154 recorded weather observation at Atlantic City International Airport (ACY), Atlantic City, New Jersey, located about 15 miles southeast of the accident site, included wind from 330 degrees at 13 knots, 10 miles visibility, few clouds at 1,600 feet, temperature 11 degrees C, dew point 4 degrees C, and a barometric altimeter setting of 29.83 inches of mercury. N81 was a non-tower-controlled airport equipped with one asphalt runway, oriented in a 03/21 configuration. The runway was 3,601 feet in length and 75 feet wide. The field elevation for the airport was 65 feet mean sea level.", "probable_cause": "Examination of the accident site and surrounding area by a Federal Aviation Administration (FAA) inspector revealed the left wing impacted several 4 to 6 inch-diameter trees prior to separating from the aircraft. The airplane then spun to the left, with fuel from the severed wing splashing on the nose section of the airplane and onto the hot left engine. The fuel ignited and caused substantial damage to the left engine and forward left section of the fuselage. Post-accident examination also revealed that the nose landing gear (NLG) had separated from its mount at the nose trunnion. Further investigation revealed that the left NLG trunnion lug had sheared from the trunnion assembly. The fractured lug was sent to the manufacturer for fractographic examination. The examination revealed a pre-existing crack at the surface of the NLG trunnion lug. The crack was approximately 0.015 inch deep at the time of final fracture. Subsequent investigation revealed that the fractured component was taken from a Cessna 310 airplane, and had accumulated approximately 20,000 service hours. According to maintenance records, on March 12, 2013, the nose gear attached tunnel and forward bulkhead were repaired as part of the filed insurance claim, and the nose gear trunnion assembly was replaced at this time. Cessna Multi-engine Service Bulletin MEB88-5 (Revision 2), Nose Gear Trunnion/Replacement, stated the preferred inspection method for the side lug area was a surface eddy current inspection. An alternate fluorescent penetrant inspection may be used for those facilities without eddy current inspection capabilities. However, MEB88-5 was not a federally mandated requirement for all owner/operators to accomplish. Subsequently, the subject trunnion assembly installed on the accident airplane had received only a visual examination prior to installation."}