{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-lake-harney-3-killed", "date": "Dec 8, 2017 at 1115 LT", "type": "Beechcraft 90 King Air", "operator": "L3-Airline-Academy", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Sanford - Sanford", "msn": "LJ-991", "yom": 1981, "flight_number": "CONN900", "city": "Lake Harney", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 243, "captain_hours_type": 0, "copilot_hours": 4800, "copilot_hours_type": 357, "aircraft_hours": 10571, "circumstances": "The flight instructor, commercial pilot receiving instruction, and commercial pilot-rated passenger were conducting an instructional flight in the multi-engine airplane during instrument meteorological conditions. After performing a practice instrument approach, the flight was cleared for a second approach; however, the landing runway changed, and the controller vectored the airplane for an approach to the new runway. The pilot was instructed to turn to a southwesterly heading  and maintain 1,600 ft until established on the localizer. Radar information revealed that the airplane turned to a southwesterly heading on a course to intercept the localizer and remained at 1,600 ft for about 1 minute 39 seconds before beginning a descending right turn to 1,400 ft. The descent continued to 1,100 ft; at which time the air traffic control controller issued a low altitude alert. Over the following 10 seconds, the airplane continued to descend at a rate in excess of 4,800 ft per minute (fpm). The controller issued a second low altitude alert to the crew with instructions to climb to 1,600 ft immediately. The pilot responded about 5 seconds later, \"yeah I am sir, I am, I am.\" The airplane then climbed 1,400 ft over 13 seconds, resulting in a climb rate in excess of 6,700 fpm, followed by a descent to 1,400 ft over 5 seconds, resulting in a 1,500-fpm descent before radar contact was lost in the vicinity of the accident site. Radar data following the initial instrument approach indicated that the airplane was flying a relatively smooth and consistent flightpath with altitude and heading changes that were indicative of autopilot use until the final turn to intercept the localizer course. Maneuvering the airplane in restricted visibility placed the pilot in conditions conducive to the development of spatial disorientation. The accident circumstances, including altitude and course deviations and the subsequent high-energy impact, are consistent with the known effects of spatial disorientation. Additionally, examination of the airframe, engines, and propellers revealed no evidence of any preexisting anomalies that would have precludednormal operation. Therefore, it is likely that the pilot receiving instruction was experiencing the effects of spatial disorientation when the accident occurred. Toxicology testing of the flight instructor identified significant amounts of oxycodone as well as its active metabolite, oxymorphone, in liver tissue; oxycodone was also found in muscle.  Oxycodone is an opioid pain medication available by prescription that may impair mental and/or physical ability required for the performance of potentially hazardous tasks. The flight instructor's tissue levels of oxycodone suggest that his blood level at the time of the accident was high enough to have had psychoactive effects, and his failure to recognize and mitigate the pilot's spatial disorientation and impending loss of control further suggest that the flight instructor was impaired by the effects of oxycodone. Toxicology testing of all three pilots identified ethanol in body tissues; however, given the varying amounts and distribution, it is likely that the identified ethanol was from postmortem production rather than ingestion.", "probable_cause": "The pilot's loss of airplane control due to spatial disorientation during an instrument approach in instrument meteorological conditions, and the flight instructor's delayed remedial action. Contributing to the accident was the flight instructor's impairment from the use of prescription pain medication."}