{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-old-bethpage", "date": "Jan 10, 2021 at 1302 LT", "type": "Cessna 421B Golden Eagle II", "operator": "850 Atlantic Collision", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Farmingdale – Bridgeport", "msn": "421B-0353", "yom": 1973, "flight_number": null, "city": "Old Bethpage", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1893, "captain_hours_type": 12, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5331, "circumstances": "The pilot reported that, during the initial climbout, about 1,000 ft above ground level, one of the engines stopped producing power. He confirmed that all engine controls were full forward and the main fuel tanks were selected. Immediately thereafter, the remaining engine began to surge, then stopped producing power. He established best glide speed and looked for an area to perform a forced landing. The airplane crashed into a solid waste disposal facility, about 2.3 nautical miles northwest of the departure airport. First responders arrived immediately after the accident and found only a trace amount of fuel within the confines of the accident site or in the fuel tanks. The only postaccident fire was centered on a small, localized area near the right engine turbocharger. Both main fuel tanks were empty, and the auxiliary bladder tanks were ruptured by impact forces. Examination of both engines revealed no evidence of a pre accident malfunction or anomaly. A surveillance video showed no evidence of smoke or mist training the airplane seconds prior to impact. The pilot reported that he departed the airport with 112 gallons of fuel on board. The pilot did not provide evidence of the latest refueling when requested by investigators. The available evidence is consistent with a total loss of engine power to both engines due to fuel exhaustion.", "probable_cause": "The pilot’s inadequate preflight fuel planning, which resulted in a total loss of engine power due to fuel exhaustion and a forced landing. "}