{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-236-manchester-55-killed", "date": "Aug 22, 1985 at 0713 LT", "type": "Boeing 737-200", "operator": "British%20Airtours", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Manchester - Kerkyra", "msn": "22033", "yom": 1981, "flight_number": "KT328M", "city": "Manchester-Ringway", "zone": "Great Manchester", "country": "United Kingdom", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 2, "pax_on_board": 131, "pax_fatalities": 53, "other_fatalities": 0, "total_fatalities": 55, "captain_hours": 8441, "captain_hours_type": 1276, "copilot_hours": 12277, "copilot_hours_type": 345, "aircraft_hours": 12977, "circumstances": "British Airtours Flight 328 (also known as flight 28M) was a charter flight from Manchester to Corfu. At 06:08 in the morning the crew were cleared to taxi to runway 24 for departure. At 06:12 the aircraft had lined up on the runway and was cleared for takeoff. The takeoff was to be performed by the co-pilot. During the takeoff run the captain made the routine 'eighty knots' call and 12 seconds later a 'thump' or 'thud' was heard. The captain immediately ordered 'stop', closed the throttles an selected reverse thrust. The maximum speed achieved was 126 knots IAS. At first the captain thought they had suffered a tyre burst or a bird strike. The co-pilot had applied maximum wheel braking, however, because of the possible tyre burst, the captain said 'Don't hammer the brakes, don't hammer the brakes'. At 45 seconds after the start of the takeoff run, 9 seconds after the 'thud', as the aircraft decelerated trough 85 knots the captain radioed ATC that they were abandoning takeoff. The fire bell rang simultaneously and he added as he cancelled reverse thrust, 'it looks as though we've got a fire on number 1'. ATC confirmed this: 'right there's a lot of fire, they're on their way now.'. At 25 seconds past the 'thud' (and 20 seconds before the aircraft stopped) the crew decided to evacuate via the starboard side. The 737 was decelerating through 36 knots then and the captain warned the cabin crew about the evacuation six seconds later. After the aircraft stopped a no. 1 engine fire drill was carried out, the no. 2 engine was shut down and the passenger evacuation drill carried out. Before completion of this drill the captain saw fuel and fire spreading forward on the left side of the aircraft. Both flight crew members escaped through the sliding window in the right hand side. Immediately after the 'thud' an intense fire developed on the left-hand side of the plane, causing some cracking and melting of windows with some associated smoke in the aft cabin. This caused some passengers to stand up in alarm and move into the aisle. Immediately after coming to a halt the purser tried to open the right front door (R1) but the escape slide container jammed on the doorframe, preventing further movement of the door. He then crossed to the L1 door and opened it (25 seconds had passed since the aircraft had stopped). The purser then returned to the R1 door and managed to clear the obstruction and was able to open the door 85 seconds after the aircraft had stopped. Meanwhile passengers had managed to open the right hand overwing exit. The R2 (right rear) door had also been opened but no one escaped through this exit. In total 17 surviving passengers escaped through the L1 door, 34 through R1 and 27 through the overwing exit.", "probable_cause": "The cause of the accident was an uncontained failure of the left engine, initiated by a failure of the No 9 combustor can which had been the subject of a repair. A section of the combustor can, which was ejected forcibly from the engine, struck and fractured an underwing fuel tank access panel. The fire which resulted developed catastrophically, primarily because of adverse orientation of the parked aircraft relative to the wind, even though the wind was light. Major contributory factors were the vulnerability of the wing tank access panels to impact, a lack of any effective provision for fighting major fires inside the aircraft cabin, the vulnerability of the aircraft hull to external fire and the extremely toxic nature of the emissions from the burning interior materials. The major cause of the fatalities was rapid incapacitation due to the inhalation of the dense toxic/irritant smoke atmosphere within the cabin, aggravated by evacuation delays caused by a forward right door malfunction and restricted access to the exits."}