{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-65-a90-king-air-dillingham-11-killed", "date": "Jun 21, 2019 at 1822 LT", "type": "Beechcraft 90 King Air", "operator": "Oahu%20Parachute%20Center", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dillingham - Dillingham", "msn": "LJ-256", "yom": 1967, "flight_number": null, "city": "Dillingham (O'ahu Island)", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 1086, "captain_hours_type": 214, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15104, "circumstances": "On June 21, 2019, about 1822 Hawaii-Aleutian standard time, a Beech King Air 65-A90 airplane, N256TA, impacted terrain after takeoff from Dillingham Airfield (HDH), Mokuleia, Hawaii. The pilot and 10 passengers were fatally injured, and the airplane was destroyed. The airplane was owned by N80896 LLC and was operated by Oahu Parachute Center (OPC) LLC under the provisions of Title 14 Code of Federal Regulations (CFR) Part 91 as a local parachute jump (skydiving) flight. Visual meteorological conditions prevailed at the time of the accident. OPC had scheduled five parachute jump flights on the day of the accident and referred to the third through fifth flights of the day as “sunset” flights because they occurred during the late afternoon and early evening. The accident occurred during the fourth flight. The accident pilot was the pilot-in-command (PIC) for each of the OPC flights that departed on the day of the accident. The pilot and 8 of the 10 passengers initially boarded the airplane. These eight passengers comprised three OPC tandem parachute instructors, three passenger parachutists, and two OPC parachutists performing camera operator functions. The pilot began to taxi the airplane from OPC’s location on the airport. According to a witness (an OPC tandem instructor who was not aboard the accident flight), the two other passengers—solo parachutists who had been on the previous skydiving flight and were late additions to the accident flight—“ran out to the airplane and were loaded up at the last minute.” The pilot taxied the airplane to runway 8 about 1820, and the airplane departed about 1822. According to multiple witnesses, after the airplane lifted off, it banked to the left, rolled inverted, and descended to the ground. One witness stated that, before impact, the airplane appeared to be intact and that there were no unusual noises or smoke coming from the airplane. A security camera video showed that the airplane was inverted in a 45° nose-down attitude at the time of impact. The airplane impacted a grass and dirt area about 630 ft northeast of the departure end of the runway, and a postcrash fire ensued. The airplane was not equipped, and was not required to be equipped, with a cockpit voice recorder or a flight data recorder. The accident flight was not detected by radar at the Federal Aviation Administration’s (FAA) Hawaii Control Facility, which was the air traffic control (ATC) facility with jurisdiction of the airspace over HDH. The FAA found no audio communications between the accident airplane and ATC on the day of the accident. \n", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was the pilot’s aggressive takeoff maneuver, which resulted in an accelerated stall and subsequent loss of control at an altitude that was too low for recovery.\r\nContributing to the accident were \r\n1) the operation of the airplane near its aft center of gravity limit and the pilot’s lack of training and experience with the handling qualities of the airplane in this flight regime; \r\n2) the failure of Oahu Parachute Center and its contract mechanic to maintain the airplane in an airworthy condition and to detect and repair the airplane’s twisted left wing, which reduced the airplane’s stall margin; and \r\n3) the Federal Aviation Administration’s (FAA) insufficient regulatory framework for overseeing parachute jump operations. Contributing to the pilot’s training deficiencies was the FAA’s lack of awareness that the pilot’s flight instructor was providing substandard training."}