{"url": "https://www.baaa-acro.com/crash/crash-atr72-212-guasimal-68-killed", "date": "Nov 4, 2010 at 1751 LT", "type": "ATR72-200", "operator": "Aerocaribbean", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Port-au-Prince - Santiago de Cuba - Havana", "msn": "459", "yom": 1995, "flight_number": "CRN883", "city": "Guasimal", "zone": "Sancti Spíritus", "country": "Cuba", "region": "Central America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 61, "pax_fatalities": 61, "other_fatalities": 0, "total_fatalities": 68, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 25000, "circumstances": "The twin engine aircraft departed Port-au-Prince on a schedule service to Havana with an intermediate stop in Santiago de Cuba, carrying 61 passengers and 7 crew members. The airplane departed Santiago de Cuba-Antonio Maceo Airport at 1644LT and the crew was cleared to climb to his assigned altitude of 18,000 feet. At 1736LT, the crew was cleared to climb to 20,000 feet. During the climb, the Total Air Temperature (TAT) dropped from +3°C to -1°C and the aircraft' speed dropped from 196 knots to 176 knots. At 17:44, at FL200, the ICING caution light illuminated on the instrument panel with an associated chime. This was followed by the illumination of the AOA light several seconds later. At 17:46 the crew toggled the anti-icing switches on the overhead panel and contacted Havana Control to request permission to descent to FL160 due to icing. However, the controller reported conflicting traffic 30 miles ahead. The crew then requested vectors to enable them to descend. Clearance was given to change course from 295° to 330°. At 17:49, with an airspeed of 156 kts, the airplane commenced a right bank. Then suddenly the airplane banked left and right before banking 90° to the left again with a steep nose down attitude. The crew struggled to control the plane, which was banking turning and losing altitude. Out of control, the aircraft crashed in a wooded an hilly terrain. All 68 occupants were killed. ", "probable_cause": "Flight was proceeding normally until it found itself in extreme meteorological conditions that caused the airplane to ice up severely at an altitude of 20,000ft (6,100m). This, in conjunction with errors by the crew in managing the situation, caused the accident."}