{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-6b2-h2-turbo-porter-deland", "date": "Oct 3, 2005 at 1505 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "Skydive%20DeLand", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "DeLand - DeLand", "msn": "767", "yom": 1976, "flight_number": null, "city": "DeLand", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5233, "captain_hours_type": 43, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6517, "circumstances": "The airline transport certificated pilot with 10 skydiving passengers began a takeoff in a tailwheel-equipped and turboprop powered airplane on a CFR Part 91 skydiving flight. As the airplane started its climb, the pitch angle of the nose of the airplane increased until the airplane appeared to stall about 50 to 100 feet agl. It descended and impacted the runway in a left wing, nose low attitude. Several FAA inspectors responded to the accident site and documented the accident scene and the airplane systems. The inspectors reported that flight control continuity was established, and they noted that the stabilizer appeared to be in a nose up trim position. Measurement of the stabilizer trim position equated to a 56.5 percent nose up trim condition. The airplane's horizontal stabilizer trim system is electrical. An electric trim indicator, and a trim warning light were installed in the upper left portion of the instrument panel. The light will illuminate if \"full-up\" trim is set, and the engine is producing over 80 percent power. A placard stating, \"Set Correct Trim for Takeoff,\" was installed on the lower instrument panel in front of the pilot position. The airplane's flight manual contains a \"Before Takeoff\" warning, which states, in part: \"Warning - An extreme out-of-trim stabilizer can, in combination with loading, flaps position and power influence, result in an uncontrollable aircraft after the aircraft leaves the ground.\" In addition, a caution states, in part: \"Caution - Failure to set correct trim settings will result in large control forces and/or unrequested pitching/yawing.\" Pilot actions listed in the \"Before Takeoff\" checklist include stabilizer trim settings. The airplane contained seat belts for all passengers, but the pilot's shoulder harness was not used, as it was folded and tie-wrapped near its upper attach point.", "probable_cause": "The pilot's incorrect setting of the stabilizer trim and his failure to maintain adequate airspeed during takeoff initial climb, which resulted in a stall. A factor contributing to the accident was an inadvertent stall. A factor contributing to the severity of the pilot's injuries was his failure to utilize his shoulder harness."}