{"url": "https://www.baaa-acro.com/crash/crash-antonov-32-semenivka-9-killed", "date": "Sep 28, 1989 at 2008 LT", "type": "Antonov AN-32", "operator": "Minaviaprom", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Mukachevo - Moscow", "msn": "1705", "yom": 1988, "flight_number": null, "city": "Semenivka", "zone": "Chernihiv Oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 382, "circumstances": "The aircraft departed Mukachevo Airbase on a cargo flight to Moscow, carrying nine crew members and a load of air-air missiles that must be transferred for maintenance purposes. About 35 minutes into the flight, while cruising by night, the autopilot system failed and an alarm sounded. The crew was able to identify the problem so the autopilot was reconnected and the crew continued the flight. One hour and 43 minutes into the flight, while cruising at an altitude of 7,500 meters, the autopilot system failed again but this time, no alarm sounded so the crew was unable to identify the problem. Forty seconds later, the aircraft entered a dive and crashed in a swampy area located near Semenivka. The aircraft disintegrated on impact and all nine occupants were killed. ", "probable_cause": "The exact reason why the autopilot system disconnected by himself could not be determined with certainty. However, investigators did not ruled out the two following assumptions: a crew member may inadvertently disconnected the autopilot while touching the button with his body; the possible failure of a switch connected to the autopilot system command circuit. Nevertheless, the crew was considered as partly responsible as he failed to pay sufficient attention to the conduct of flight and various instruments, which would prevent him from identifying the problem and intervening in a timely manner to correct the situation. "}