{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3a-kansas-city-3-killed", "date": "Jan 20, 1954 at 0708 LT", "type": "Douglas DC-3", "operator": "Zantop.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Jackson – Kansas City – Atlanta", "msn": "4940", "yom": 1942, "flight_number": "VK040", "city": "Kansas City", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 5333, "captain_hours_type": 2091, "copilot_hours": 5337, "copilot_hours_type": 1120, "aircraft_hours": 24786, "circumstances": "The airplane departed Jackson, Michigan, for Atlanta, Georgia, with a planned intermediate stop to discharge cargo at Fairfax Airport, Kansas City, Kansas. This was a cargo flight designated as Trip 40-2011; the crew consisted of Captain William D. Speaks, Pilot in command, Captain Edward F. Kaselak and First officer Byron R. Williams. Prior to departing Jackson, the crew went to the CAA communications Station on the airport and reviewed the weather sequence reports and en route forecast and Captain Speaks also telephoned the U.S. Weather Bureau office at Detroit, Michigan, to obtain more detailed information. Following the review of the weather data, an IFR (instrument Flight Rules) flight plan to Kansas City, Kansas, was filed which indicated a cruising altitude of 10,000 feet, estimated elapsed time of four hour plus 20 minutes with seven hours of fuel on board and Springfield, Missouri, as the alternate airport, According to company records, the weight of the aircraft at takeoff was under the allowable gross weight of 26,900 pounds and the load was distributed so that the center of gravity of the aircraft was within approved limits. Routine position reports were made and when over Burlington, Iowa, at 0536, the flight was cleared to the Liberty Non-Directional Beacon, 16 miles northeast of Kansas City, to descend to and maintain 2,500 feet. At 0627, ARTC (Air Route Traffic Control) cleared the flight to the Kansas City, Missouri ILS (Instrument Landing System) outer marker to maintain 2,500 feet and to contact approach control when over Liberty. Twenty-nine minutes later, at 0656, the flight reported being over Liberty and approach control gave it the 0635 Kansas City, Missouri weather as follows: ceiling measured 600 feet, overcast, visibility 1-1/2 miles, light freezing drizzle, fog, and altimeter setting 29, 89. At this time approach control also verified that the aircraft was to land at the Fairfax Airport, Kansas City, Kansas, and immediately gave it the 0655 Fairfax Airport weather report: ceiling measured 600 feet, overcast, visibility 2 miles, light freezing drizzle, light snow fog and wind northwest 30 m.p.h. This airport is one and one-half miles northwest of the Kansas City Municipal Airport and across the Missouri River. The flight was then cleared to make an ADF approach to Fairfax for a landing on Runway 31 and was requested to report leaving the outer marker. N 49551 reported leaving the outer marker inbound at 0705 and was advised to contact the Fairfax Tower, The flight complied and requested the wind direction and runway in use. The tower replied that the runway was 31, the wind was from the north-northwest 20-30 m.p.h. and gusty, and the altimeter setting was 29.88. A few seconds later the tower also advised that the high intensity approach lights at the Kansas City Municipal Airport were on and if too bright, would be turned down. The flight's acknowledgement was negative and there was no further radio contact. At approximately 0775 the wreckage was located by the Kansas City Municipal Airport Patrol 400 feet north and 156 feet west of the approach and of Runway 17 of that airport.", "probable_cause": "The Board determines that the probable cause of this accident was the loss of control of the aircraft at an altitude too low to effect recovery, which loss of control resulted from an accumulation of ice and the use of deicer boots at low air speeds. The following findings were reported:\r\n- The ceiling at the Fairfax Airport during the approach was 100 feet lower than CAA prescribed minimums,\r\n- While attempting a circling approach to Runway 31 the flight encountered conditions of restricted visibility,\r\n- The aircraft had accumulated ice during the approach and descent in sufficient quantity to adversely affect control,\r\n- Deicer boots were operating during the approach thereby increasing the stalling speed."}