{"url": "https://www.baaa-acro.com/crash/crash-atr42-320-jersey", "date": "Jun 16, 2012 at 0823 LT", "type": "ATR42-300", "operator": "Blue-Islands", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Guernsey - Jersey", "msn": "007", "yom": 1986, "flight_number": "BCI308", "city": "Jersey", "zone": "Channel Islands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 40, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6106, "captain_hours_type": 1255, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew, comprising a commander, co-pilot and cabin crewmember, reported for duty at 0620 hrs at Guernsey Airport. The commander was conducting line training of the co-pilot, a first officer who had recently joined the companyThe first sector was to be from Guernsey to Jersey. No problems were identified during the pre-flight preparation and the aircraft departed on time at 0705 hrs, with the commander acting as handling pilot. The short flight was without incident and the weather for landing was reported as good, with the wind from 210° at 16 kt, FEW cloud at 2,000 ft and visibility in excess of 10 km. The commander elected to carry out a visual approach to Runway 27 at Jersey, using a planned approach speed of 107 kt and flap 30 selected for landing. During the approach, the gear was selected down and the flight crew confirmed the three green ‘gear safe’ indication lights were illuminated, indicating that the gear was locked in the down position. The commander reported that both the approach and touchdown seemed normal, with the crosswind from the left resulting in the left main gear touching first. Just after touchdown both pilots heard a noise and the commander stated the aircraft appeared to settle slightly differently from usual. This made him believe that a tyre had burst. The cabin crew member also heard a noise after touchdown which she too thought was from a tyre bursting. The commander selected ground idle and partial reverse pitch and, as the aircraft decelerated through 70 kt, the co-pilot took over control of the ailerons, as per standard procedures, to allow the commander to take control of the steering tiller. The co-pilot reported that despite applying corrective inputs the aircraft continued rolling to the left. A member of ground operations staff, situated at Holding Point E, reported to the tower controller that the left landing gear leg of the aircraft did not appear to be down properly as it passed him. The aircraft continued to quickly roll to the left until the left wingtip and propeller contacted the runway. The aircraft remained on the runway, rapidly coming to a halt to the left of the centreline, approximately abeam Holding Point D. Both propellers continued to rotate and the commander selected the condition levers to the fuel shutoff position and pulled the fire handles to shut both engines down. The tower controller, seeing the incident, pressed the crash alarm and airfield emergency services were quickly in attendance.", "probable_cause": "The recorded data indicates that the rate of descent during the final approach phase was not excessive and remained low through the period of the touchdown. Although the registered vertical acceleration at ground contact was high, this is not consistent with the recorded descent rate and is believed to have been the effect of the close physical proximity of the accelerometer to the location of the fractured side brace. It is reasonable to assume that the release of strain energy during the fracturing process produced an instant shock load recorded as a 3 g spike.The general nature of the failure mechanism precipitating the collapse of the landing gear is clear. A fatigue crack propagated through most of the cross-section of one side of an attachment lug of the left main landing gear side brace upper arm. This continued as a final region of ductile cracking until complete failure occurred. The increased loading, during normal operation, on other elements of the twin lugs, once the initial crack was large or had passed completely through the section, led to overloading in the other section of the forward lug and both sections of the aft lug. This caused rapid onset of three small areas of fatigue damage followed by ductile overload failure of both lugs. The failure rendered the side brace ineffective and the unrestrained main trunnion continued to translate outboard leading to the collapse of the gear. The aluminium was found to be within the specifications to which it was made. The initial fatigue crack emanated from a feature which was inter-granular and high in titanium content, which was probably a TiB2  particle introduced during grain refining. This was surrounded by an area consistent with static loading before propagating a crack in fatigue. Given that there was not a measurable effect on the fatigue life of the material with the feature, and that an area of static overload was evident immediately surrounding the TiB2 particle, it is therefore concluded that at some time during the life of the side brace component it probably suffered a single loading event sufficient to exploit the presence of the origin, initiating a crack that remained undetectable until failure."}