{"url": "https://www.baaa-acro.com/crash/crash-cessna-f406-caravan-ii-near-inverness-1-killed", "date": "Oct 22, 2004 at 1133 LT", "type": "Cessna 406 Caravan", "operator": "Highland-Airways-2", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Stornoway – Inverness", "msn": "406-0014", "yom": 1987, "flight_number": null, "city": "Inverness", "zone": "Inverness-shire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2735, "captain_hours_type": 510, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft and its commander were concluding the fifth sector of the day when, shortly after starting a descent for Inverness, the aircraft’s rate of descent became unsteady and it started to turn left. The available evidence indicated that the aircraft struck the ground in a steep, left, spiral dive. The extreme fragmentation of the wreckage suggested a high impact speed, probably in the region of 350 kt. Major airframe and powerplant failures were discounted but otherwise, there was insufficient evidence to draw firm conclusions about the reasons for the sudden deviation from controlled flight and secondly, the absence of any evidence consistent with an attempt to recover from the dive. Two safety recommendations made recently to the EASA concerning flight recorders were re-iterated.", "probable_cause": "During a gentle descent from FL95 to FL75 in instrument meteorological conditions G-TWIG rapidly entered a dramatic and sustained manoeuvre from what initially appeared to be controlled flight at normal descent speed. Despite a determined and thorough investigation, because there was insufficient evidence from which to draw a firm conclusion, the cause or causal factors for this rapid deviation from controlled flight could not be identified. "}