{"url": "https://www.baaa-acro.com/crash/crash-canadair-cl-604-2b16-challenger-almaty-1-killed", "date": "Dec 26, 2007 at 0302 LT", "type": "Canadair CL-604 Challenger", "operator": "Jet%20Connection", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hanovre – Almaty – Macao", "msn": "5454", "yom": 2000, "flight_number": "JCX826", "city": "Almaty", "zone": "Almaty Province", "country": "Kazakhstan", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7200, "captain_hours_type": 1258, "copilot_hours": 2650, "copilot_hours_type": 60, "aircraft_hours": 7882, "circumstances": "On December 25, 2007 a crew of JetConnection Businessflight AG airline including the PIC, the co-pilot and a flight attendant was conducting a charter flight JCX826 routed Hannover (Germany), Astana (Republic of Kazakhstan) – Macao (China) on a CL-604 aircraft (registration D-ARWE). Apart from the crew there was one passenger on board. At 12:10 (hereinafter UTC time is used) on December 25, 2007 the crew took off at Hannover Airport. During the flight the crew was informed that there was no fuel available for refueling the aircraft at Astana Airport. Due to this the crew decided to change the flight route and refuel the aircraft at Almaty International Airport (Republic of Kazakhstan). The flight from Hannover to Almaty in accordance with the PIC explanations was normal. No faults in the operation of the aircraft systems or equipment were detected. At 18:46 the crew landed at Almaty Airport. The ground handling service at Almaty Airport was provided by Bercut Air Services KZ based at the airport. The departure from Almaty to Macao according to the schedule was planned for 20:50 on December 25, 2007. The ground handling and servicing was provided by Bercut Air Services KZ Company. In accordance with the work order the Almaty ground services conducted refueling and anti-icing. The Pre-Flight Check was conducted by the PIC. He also monitored the refueling and stabilizer and wing anti-icing. According to the PIC interrogation there were no faults detected in the operation of aircraft systems and equipment. 8460 liters (6827 kg) of TC-1 condition fuel was refueled. According to the estimations, total fuel on board was 7605 kg. The refueled fuel was distributed in the fuel tanks in accordance with the AFM of the CL-604 aircraft. In accordance with the estimations the aircraft weight was 20659 kg, CG 33,1%, which was within the CL-604 AFM limitations. During the pre-flight preparation for the flight to Macao the crew of the CL-604 D-ARWE did not receive the meteorological consultation or documentation at the Almaty Meteorological Center. According to BFU information the crew of the JCX826 flight had received the integrated meteorological consultation for the flight to Macao before the takeoff from Hannover. In Almaty PIC has received updated data through the Internet from the website of the German Meteorological Service (DWD) and also from the PPS provider of the JetConnection Businessflight AG (Billund, Denmark). According to the ATC tape recorder data containing the communication of the СL-604 D-ARWE crew with the ATC offices of Almaty airport, at 20:17:55 the crew informed the Ground Control that they were ready to startup and taxi right after the completion of the anti-icing procedure. At 20:18:24 the Ground Control instructed the crew: “JCX826, expect start up in 5 minutes.” At 20:20:48 in reply to the Controller’s request if they were ready for start-up the crew reported: “We are expecting anti-icing which is about to start now”. While waiting for the anti-icing the crew received the ATC clearance for departure. In accordance with the DE-ICING\\ANTI-ICING REQUEST from the 25.12.2007, signed by the PIC and the Bercut Air Servises KZ manager the processing with using Type 1 and Type 2 fluids was conducted in two steps. On the first stage Type 1 deicing fluid (Killfrost DF Plus) was applied to remove the icing with the estimated fluid to water ratio of 70/30%. According to the enquiry of the de-icing operator the temperature of the Type 1 fluid in the tank of the SIMON GLOBAL 2110 machine used for the fluid application was about + 80˚ С, and at the outlet of the sprayer it was not less than +60˚ С. Note: The check of the SIMON GLOBAL 2110 machine conducted by the investigation team after the accident revealed that the temperature of the Type 1 fluid at the outlet of the sprayer is +66˚ С, which complies with the СL-604 OM (Part 1, page 06-12-17). On the second stage of the anti-icing procedure the Type 2 anti-icing fluid was used (Killfrost ABC 2000) with the estimated fluid to water ratio of 100/0%. Note: In the fluid Type 1 and Type 2 delivery receipt No.4002014 by mistake was shown unreal concentration 70/00 for the Type 2 fluid instead of its real concentration 100/00. The OM of the CL-604 does not suggest preliminary heating and heating monitoring of Type 2 fluid. According to the record in the aircraft fuelling receipt the amount of the applied Type 2 fluid was 250 liters. According to the requirements of Annex A, page XXI of the AEA, Training Recommendation and background Information for de-icing/anti-icing of aircraft on the ground, Edition 2, September 2005 the recommended anti-icing fluid minimum for the wing and stabilizer of a CL-604 type aircraft was 100 liters. Thus enough Type 2 fluid was applied for the anti-icing of CL-604 D-ARWE. The inspection of the fluid samples used for the de-icing/anti-icing of the CL-604 D-ARWE aircraft conducted at Almaty airport laboratory revealed that the Type 1 fluid had an actual fluid to water ratio of 67/33% while the Type 2 fluid 99/1%. Provided the OAT at Almaty airport at the time of the fluid application was minus 13˚ С, the mentioned ratios were within the requirements of the CL-604 OM (Part 1, Section VI, Cold Weather Operations). The actual weather at Almaty airport according to the request of the Approach Control for 20:49 was as follows: surface wind 360˚ 2 m/sec, RVR 2900 m, light snow, mist, clouds 8 oktas, nimbostratus, fractonimbus, cloudbase 150 m, QFE 718 mm mercury, OAT minus 12,9˚ С, dewpoint minus 13,7˚, moisture content 93%, QFE 718 mm mercury. In accordance with the de-icing/anti-icing operator the de-/anti-icing procedure was conducted in compliance with the CL-604 OM recommendations in the following order: stabilizer, left wing, right wing. Every surface was applied first with Type 1 and then Type 2 fluid. The time between the completion of the Type 1 application and the beginning of the Type 2 application in accordance with the operator’s explanations did not exceed 1.5-2 minutes which is suggested in Section VI of the CL0604 OM. According to the estimations conducted by the investigation team the application of the Type 2 fluid was started at 20:37. Note: In accordance with the CL-604 OM (Part 1, page 06-12-13), the holdover time of the Type 2 fluid with the fluid to water ration of 100/0 in the OAT range of -3…-20˚ С, with precipitation in the form of snow and snow grain is 15…30 minutes. According to the information recorded by the FDR, during the de-/anti-icing the aircraft flaps were retracted while the stabilizer deflection was minus 4,7˚. By 20:43 the de-/anti-icing procedure was completed. On leaving the aircraft the PIC made a visual and tactile (by touching the wing surface) inspection of the anti-icing quality, admitted that it was satisfactory by signing in the de-/anti-icing receipt. After that the PIC returned to the aircraft and the crew began the engine start-up. In accordance with the FDR information, by 20:46 the crew had started up first the right engine and then the left engine. The N2 of the right and left engine in the idle mode was 61,5 % and 62,0 % respectively. In 10 seconds after the left engine start-up the Cowl Anti-Ice was engaged. In accordance with the CVR information, a check at a stage After Engine Start was performed by the flight crew in a volume which stipulated by the JetConnection Businessflight AG “ABBRIVIATED CHECKLIST”. However a comparison of this checklist with the CL-604 D-ARWE AFM checklist (Chapter 4 “Normal Procedures” Section “Consolidated Checklists” Item L “After Engine Start Check”) shows the absences of WAI and CAI systems checks. Note: For a number of other preflight preparation stages the JetConnection Businessflight AG “ABBRIVIATED CHECKLIST” also doesn’t cover all procedures stipulated by the CL-604 AFM. At 20:47:42 the crew reported the Ground Control that they were ready for taxiing. At 20:48:25 the Ground Control cleared the crew for the holding point following the leader van. Within 20:51:17 – 20:51:45, the crew checked the rudder, the ailerons and elevators and extended the flaps to the takeoff position (Flaps 20). The stabilizer position (-4,7˚) did not change. At 20:51:55 the crew was instructed by the Ground Control to expect further instructions at the holding point and contact the Tower Control. At 20:52:17 after contacting the Tower Control the crew was instructed to wait on the holding point as there was an MD-83 aircraft making Flight UKM 109 on final at a distance of 14 km. At 20:57:15, after the MD-83 landed the Tower Control cleared the CL-604 D-ARWE to line up at RWY 05 and at 21:01:30 they were cleared for takeoff. During the takeoff an increasing right bank started developing. As the aircraft was banking to the right it touched the right runway edge with its right wing tip. Then the aircraft, leaning on the right wing, moved to the graded airfield to the right of the runway and hit its surface with the right main landing gear and nose landing gear. During the further movement the aircraft hit the reinforced fence of the airdrome and shifting on the ground 190 m beyond the airdrome finally stopped. At the final stage of movement a fire occurred which was extinguished by the airport fire brigades. The actual weather at Almaty airport checked after the accident alert at 21:04 was as follows: wind 350° 4 m/sec, visibility 1200 m (RVR 2500 m), snow, mist, clouds 8 oktas, nimbostratus, fractonimbus, cloudbase 120 m, OAT minus 14° С, dewpoint minus 15° С, moisture content 92%, pressure 718 mm mercury. Runway 05 condition – dry snow up to 10 mm, friction factor 0.32. The accident occurred on December 25, 2007 at 21:02 UTC (26.12.2007 at 03:02 local time).", "probable_cause": "The accident involving a CL-604 aircraft registered D-ARWE was caused by the asymmetric lift loss at takeoff which led to aircraft stall right after the liftoff, collision with the ground and obstacles, aircraft destruction and ground fire. The lift loss was most probably caused by the contamination of the wing leading edge with precipitation in the form of snow after the anti-icing which occurred as the crew did not engage the Wing Anti-Ice before the takeoff which is a mandatory requirement of the CL-604 AFM in the actual weather conditions (moderate snow, OAT minus 14° С, moisture content 92 %, dewpoint minus 15° С, dry snow on the runway, 10 mm thick). Significant violation of the CL-604 AFM/OM limitations concerning the rate of rotation (pitch rate) when taking off with contaminated wing provided it was impossible to monitor this parameter instrumentally could have contributed to the situation. The inefficiency of the availably stall protection system at takeoff due to the hypersensitive wing as to contamination of its leading edge cannot completely guarantee prevention of similar accidents in the future."}