{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-1247-lake-wales-6-killed", "date": "Jun 7, 2012 at 1235 LT", "type": "Pilatus PC-12", "operator": "Roadside Ventures", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Fort Pierce - Junction City", "msn": "730", "yom": 2006, "flight_number": null, "city": "Lake Wales", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 755, "captain_hours_type": 38, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1263, "circumstances": "The airplane, registered to and operated by Roadside Ventures, LLC, departed controlled flight followed by subsequent inflight breakup near Lake Wales, Florida. Instrument meteorological conditions prevailed at the altitude and location of the departure from controlled flight and an instrument flight rules (IFR) flight plan was filed for the 14 Code of Federal Regulations (CFR) Part 91 personal flight from St Lucie County International Airport (FPR), Fort Pierce, Florida, to Freeman Field Airport (3JC), Junction City, Kansas. The airplane was substantially damaged and the private pilot and five passengers were fatally injured. The flight originated from FPR about 1205. After departure while proceeding in a west-northwesterly direction and climbing, air traffic control communications were transferred to Miami Air Route Traffic Control Center (Miami ARTCC). The pilot remained in contact with various sectors of that facility from 1206:41, to the last communication at 1233:16. About 6 minutes after takeoff the pilot was advised by the Miami ARTCC Stoop Sector radar controller of an area of moderate to heavy precipitation twelve to two o'clock 15 miles ahead of the airplane's position; the returns were reported to be 30 miles in diameter. The pilot asked the controller if he needed to circumnavigate the weather, to which the controller replied that deviations north of course were approved and when able to proceed direct LAL, which he acknowledged. A trainee controller and a controller providing oversight discussed off frequency that deviation to the south would be better. The controller then questioned the pilot about his route, to which he replied, and the controller then advised the pilot that deviations south of course were approved, which he acknowledged. The flight continued in generally a west-northwesterly direction, or about 290 degrees, and at 1230:11, while at flight level (FL) 235, the controller cleared the flight to FL260, which the pilot acknowledged. At 1232:26, the aircraft's central advisory and warning system (CAWS) recorded that the pusher system went into \"ice mode\" indicating the pilot had selected the propeller heat on and inertial separator open. At that time the aircraft's engine information system (EIS) recorded the airplane at 24,668 feet pressure altitude, 110 knots indicated airspeed (KIAS), and an outside air temperature of minus 11 degrees Celsius. At 1232:36, the Miami ARTCC Avon Sector radar controller advised the pilot of a large area of precipitation northwest of Lakeland, with moderate, heavy and extreme echoes in the northwest, and asked him to look at it and to advise what direction he needed to deviate, then suggested deviation right of course until north of the adverse weather. The pilot responded that he agreed, and the controller asked the pilot what heading from his position would keep the airplane clear, to which he responded at 1233:04 with, 320 degrees. At 1233:08, the Miami ARTCC Avon Sector radar controller cleared the pilot to fly heading 320 degrees or to deviate right of course when necessary, and when able proceed direct to Seminole, which he acknowledged at 1233:16. There was no further recorded communication from the pilot with the Miami ARTCC. Radar data showed that between 1233:08, and 1233:26, the airplane flew on a heading of approximately 290 degrees, and climbed from FL250 to FL251, while the EIS recorded for the same time the airplane was at either 109 or 110 KIAS and the outside air temperature was minus 12 degrees Celsius. The radar data indicated that between 1233:26 and 1233:31, the airplane climbed to FL252 (highest recorded altitude from secondary radar returns). At 1233:30, while at slightly less than 25 degrees of right bank based on the NTSB Radar Performance Study based on the radar returns, 109 KIAS, 25,188 feet and total air temperature of minus 12 degrees Celsius based on the data downloaded from the CAWS, autopilot disengagement occurred. This was recorded on the CAWS 3 seconds later. The NTSB Performance Study also indicates that based on radar returns between 1233:30, and 1233:40, the bank angle increased from less than approximately 25 degrees to 50 degrees, while the radar data for the approximate same time period indicates the airplane descended to FL249. The NTSB Performance Study indicates that based on radar returns between 1233:40 and 1234:00, the bank angle increased from 50 degrees to approximately 100 degrees, while the radar data indicates that for the approximate same time frames, the airplane descended from FL249 to FL226. The right descending turn continued and between 1233:59, and 1234:12, the airplane descended from 22,600 to 16,700, and a change to a southerly heading was noted. The NTSB Performance Study indicates that the maximum positive load factor of 4.6 occurred at 1234:08, while the NTSB Electronic Device Factual Report indicates that the maximum recorded airspeed value of 338 knots recorded by the EIS occurred at 1234:14. The next recoded airspeed value 1 second later was noted to be zero. Simultaneous to the zero airspeed a near level altitude of 15,292 feet was noted. Between 1234:22, and 1234:40, the radar data indicated a change in direction to a northeast occurred and the airplane descended from 13,300 to 9,900 feet. The airplane continued generally in a northeasterly direction and between 1234:40 and 1235:40 (last secondary radar return), the airplane descended from 9,900 to 800 feet. The last secondary radar return was located at 27 degrees 49.35 minutes North latitude and 081 degrees 28.6332 minutes West longitude. Plots of the radar targets of the accident site including the final radar targets are depicted in the NTSB Radar Study which is contained in the NTSB public docket. At 1235:27, the controller asked the pilot to report his altitude but there was no reply. The controller enlisted the aid of the flight crew of another airplane to attempt to establish contact with the pilot on the current frequency and also 121.5 MHz. The flight crew attempted on both frequencies but there was no reply. At 1236:30, the pilot of a nearby airplane advised the controller that he was picking up an emergency locator transmitter (ELT) signal. The pilot of that airplane advised the controller at 1237:19, that, \"right before we heard that ELT we heard a mayday mayday.\" The controller inquired whether the pilot had heard the mayday on the current frequency or 121.5 MHz, to which he replied that he was not sure because he was monitoring both frequencies. The controller inquired with the flight crews of other airplanes if they heard the mayday call on the frequency and the response was negative, though they did report hearing the ELT on 121.5 MHz. The controller verified with the flight crew's that were monitoring 121.5 MHz whether they heard the mayday call on that frequency and they advised they did not. A witness who was located about 1.5 nautical miles south-southwest from the crash site reported that on the date and time of the accident, he was inside his house and first heard a sound he attributed to a propeller feathering or later described as flutter of a flight control surface. The sound lasted 3 to 4 cycles of a whooshing high to low sound, followed by a sound he described as an energy release. He was clear the sound he heard was not an explosion, but more like mechanical fracture of parts. He ran outside, and first saw the airplane below the clouds (ceiling was estimated to be 10,000 feet). He noted by silhouette that parts of the  airplane were missing, but he did not see any parts separate from the airplane during the time he saw it. At that time it was not raining at his location. He went inside his house, and got a digital camera, then ran back outside to his pool deck, and videotaped the descent. He reported the airplane was in a spin but could not recall the direction. The engine sound was consistent the whole time; there was no revving; he reported there was no forward movement. He called 911 and reported the accident. Another witness who was located about .4 nautical mile east-southeast of from the crash site reported hearing a boom sound that he attributed to a lawn mower which he thought odd because it had just been raining, though it was not raining at the time of the accident. He saw black smoke trailing the airplane which was spinning in what he described as a clockwise direction and flat. He ran to the side of their house, and noted the airplane was still spinning; the smoke he observed continued until he lost sight. His brother came by their back door, heard a thud, and both ran direct to the location of where they thought the airplane had crashed. When they arrived at the wreckage, they saw fire in front of the airplane which one individual attempted to extinguish by throwing sand on it, but he was unable. The other individual reported the left forward door was hard to open, but he pushed it up and then was able to open it. Both attempted to render assistance, and one individual called 911 to report the accident. One individual then guided local first responders to the accident site. The airplane crashed in an open field during daylight conditions. The location of the main wreckage was determined to be within approximately 100 feet from the last secondary radar return. Law Enforcement personnel responded to the site and accounted for five occupants. A search for the sixth occupant was immediately initiated by numerous personnel from several state agencies; he was located the following day about 1420. During that search, parts from the airplane located away from the main wreckage were documented and secured in-situ.", "probable_cause": "The failure of the pilot to maintain control of the airplane while climbing to cruise altitude in instrument meteorological conditions (IMC) following disconnect of the autopilot. The reason for the autopilot disconnect could not be determined during postaccident testing. Contributing to the accident was the pilot's lack of experience in high-performance, turbo-propeller airplanes and in IMC."}