{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-dean-funes", "date": "Apr 27, 2014 at 1915 LT", "type": "Piper PA-31-310 Navajo", "operator": "Prive2", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Termas de Río Hondo – Río Cuarto", "msn": "31-213", "yom": 1968, "flight_number": null, "city": "Deán Funes", "zone": "Córdoba", "country": "Argentina", "region": "South America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 462, "captain_hours_type": 8, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5245, "circumstances": "The twin engine aircraft departed Termas de Río Hondo Airport on a flight to Río Cuarto, carrying six passengers and one pilot who took part to a motorcycle GP in Termas de Río Hondo. About 45 minutes into the flight, while cruising at an altitude of 6,500 feet, the left engine failed. The pilot contacted ATC and was cleared to divert to Deán Funes Airfield. On approach, he realized he could not make it and attempted an emergency landing on the National Road 60 at km 835. After touchdown, the aircraft veered off the street, lost its nose gear and came to rest in bushes. One passenger and the pilot were injured while five other occupants escaped unhurt. The aircraft was damaged beyond repair.", "probable_cause": "The following findings were identified:\r\n- Failure of the left engine in cruising flight due to the failure of the fuel injection system connected to the cylinder n°3,\r\n- Inadequate maintenance of the aircraft and engine and non application of the bulletins related to the maintenance of the injection system, \r\n- Impossibility for the pilot to increase engine power due to the high temperature of the cylinder, \r\n- The aircraft's performances were degraded, \r\n- Late decision of the pilot to attempt an emergency landing at dusk,\r\n- Insufficient information regarding the procedure to feather the propeller. "}