{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-188a-electra-agana-46-killed", "date": "Jun 5, 1976 at 0047 LT", "type": "Lockheed L-188 Electra", "operator": "Air%20Manila", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Wake - Agana - Manila", "msn": "1007", "yom": 1958, "flight_number": "UM702", "city": "Agana-Antonio Borja Won Pat", "zone": "All Guam Island", "country": "Guam Island", "region": "Asia", "crew_on_board": 12, "crew_fatalities": 12, "pax_on_board": 33, "pax_fatalities": 33, "other_fatalities": 1, "total_fatalities": 46, "captain_hours": 10016, "captain_hours_type": 2422, "copilot_hours": 8906, "copilot_hours_type": 2037, "aircraft_hours": 22895, "circumstances": "The aircraft lifted off the 10,015-foot runway about 7,500 feet down the runway. During or just after liftoff the n°3 propeller was feathered. The aircraft climbed to 100 feet while yawing to the right. The crew retracted the landing gear and flaps before the aircraft reached the apex of the climb. It then rotated to a nose-high attitude, appeared to become laterally unstable, and struck the rising terrain in a tail-low attitude. Impact was about 4,300 feet beyond the end of the runway. The aft portion of the aircraft fuselage dragged along the ground for 220 feet in a right wing down attitude, after which the aircraft slid off the brow of a 13-foot embankment, crashed through the chain link perimeter fence at Agana NAS, crossed a highway, and burst into flames. The aircraft came to rest in an open area between residential areas, about 4,900 feet beyond the end of runway 06L. As the aircraft slid across the highway, it struck an automobile on the highway; the driver of the car was killed. A woman and her son, who were standing outside their residence just south of the impact site, were seriously burned by the heat of the burning fuel and were seriously injured by flying debris. All 45 occupants on board the Electra were killed. ", "probable_cause": "he loss of climb capability after the crew retracted the flaps at too low an altitude to clear the rising terrain. The flaps were retracted after the no.3 propeller feathered as the aircraft lifted off the runway. Contributing to the accident was the captain's decision to continue the take-off after an engine failed before reaching the rotation speed."}