{"url": "https://www.baaa-acro.com/crash/crash-short-s25-sunderland-braemore-14-killed", "date": "Aug 25, 1942 at 1342 LT", "type": "Short S.25 Sunderland", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Military", "survivors": "Yes", "site": "Mountains", "schedule": "Oban – Invergordon – Keflavik", "msn": null, "yom": null, "flight_number": null, "city": "Braemore", "zone": "Caithness", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 11, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Few minutes after take off from RAF Invergordon, while cruising in poor visibility due to bad weather conditions, the seaplane hit the Eagle's Rock hill located near Breamore, about 55 km northwest of Inverness. A passenger was seriously injured while all 14 other occupants were killed, among them Prince George, Duke of Kent. With three officers of his staff, he was en route to Iceland on an official visit in Reykjavik. \r\nCrew (228th Squadron):\r\nF/Lt Frank McKenzie Goyen, pilot,\r\nW/Cdr Thomas L. Moseley, copilot,\r\nF/O Sydney Wood Smith, copilot,\r\nP/O George Richard Saunders, navigator,\r\nF/Sgt William Royston Jones, flight engineer, \r\nF/Sgt Charles Norman Lewis, airframe fitter, \r\nF/Sgt Edward James Hewerdine, wireless operator and air gunner, \r\nSgt Edward F. Blacklock, wireless operator and air gunner,\r\nSgt Arthur Rowland Catt, wireless operator and air gunner, \r\nSgt Leonard Sweett, flight engineer and fitter,  \r\nSgt Andrew S. W. Jack, wireless operator and air gunner.\r\nPassengers:\r\nAir Commodore HRH Prince George, The Duke of Kent, \r\nLt John Crowther, private secretary,\r\nP/O Michael Strutt,\r\nLAC John Walter Holes.", "probable_cause": "The aircraft was equipped with a new gyro-compass few days prior to the accident and the crew was not familiar with it. According to the Board of investigations, it appears that the accident occurred as a result of navigational error. The crew  failed to make sufficient allowance for a strong on-shore wind and allowed the aircraft to drift over high ground before it gained sufficient altitude to clear the hilly terrain. According to the Hansard Report of October 7th 1942, blame was apportioned to the captain of the aircraft, \"Who changed flight plan for reasons unknown and descended through cloud without making sure he was over water, and crashed.\" Poor visibility due to bad weather conditions was considered as a contributory factor."}