{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-300-otter-jomsom", "date": "May 16, 2013 at 0833 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Nepal-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pokhara - Jomsom", "msn": "638", "yom": 1979, "flight_number": "RNA555", "city": "Jomsom", "zone": "Dhawalagiri", "country": "Nepal", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 18, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8451, "captain_hours_type": 8131, "copilot_hours": 1396, "copilot_hours_type": 1202, "aircraft_hours": 32291, "circumstances": "The Twin Otter (DHC6/300) aircraft with registration number 9N-ABO, owned and operated by Nepal Airlines Corporation (NAC), departed Kathmandu to Pokhara for night stop on 15 May 2013 in order to accomplish up to 5 (five) Pokhara-Jomsom-Pokhara charter flights planned for the subsequent day on 16 May 2013. As per the programme, the aircraft completed first charter flight from Pokhara to Jomsom sector on 16 May 2013 morning after one and half hour waiting on ground due weather. For this second flight, the aircraft departed at 0225 UTC (08:10LT) from Pokhara to Jomsom in the command of Capt. Dipendra Pradhan and Mr. Suresh K.C. as co-pilot. There were 19 passengers including one infant and 3 crew members on board. The aircraft was operating under Visual Flight Rules (VFR). As per the CVR readout there was no reported difficulties and all the pre and post departure procedure and en-route portion of the flight were completed in normal manner. There was no indication of lacking of information and advice from Jomsom Tower. At first contact the co-pilot called Jomsom Tower and reported its position at PLATO (a compulsory reporting point) at 9 miles from Jomsom airport at 12500ft. AMSL. The Jomsom Tower advised runway 24 wind south westerly 08-12 KTS, QNH 1020, Temp 13 degree and advised to report downwind for runway 24.The co-pilot accepted by replying to join downwind for runway 24. There was no briefing and discussion between the two pilots regarding the tail wind at the airport. The PIC, then, took over the communication function from co-pilot and called Jomsom Tower, requesting to use runway 06 instead of runway 24, despite the advice of tower to use runway 24 to avoid tail wind effect in runway 06. Jomsom Tower repeated the wind speed to be 08-12 KTS for the runway 06, to which the PIC read back the wind and answered to have ”no problem”. As per the PIC request the Jomsom Tower designated runway 06 for landing and advised to report on final runway 06. The PIC did read back the same. The pre landing checklist was used, flaps with full fine in propeller rpm were taken and full flaps was also taken before touchdown. In the briefing of “missed approach” the PIC had answered to be “standard”. The aircraft touched down runway of Jomsom airport at 0245 UTC (08:30LT) at a distance of approximately 776 ft, far from the threshold of runway 06. After rolling 194 ft. in the runway, the aircraft left runway and entered grass area in the right side. The aircraft rolled around 705 ft in the grass area and entered the runway again. The maximum deviation from the runway edge was 19 ft. The Commission has observed that when aircraft touched down the runway, it was not heading in parallel to the runway centreline. After touchdown the aircraft rolled around 194ft on the runway, left the paved area and started rolling in the grass area in the right side. During the landing roll, when the aircraft was decelerating, the co-pilot had raised the flaps as per the existing practice of carrying out “after the landing “checks\". As per the observation of passenger seated just behind the cockpit, after touchdown of the aircraft there was no communication between pilot and co-pilot. It seemed that pilot was busy in cockpit and facing problem. It was obvious that PIC was in dilemma in controlling aircraft. He added power to bring aircraft into the runway with an intention to lift up the aircraft. He did not brief anything to copilot about his intention and action. He started adding power with the intention of lifting up, but the aircraft was already losing its speed, due to extension of flaps by co-pilot without briefing to PIC and use of brakes (light or heavy, knowingly and unknowingly) simultaneously by the PIC. The accelerating aircraft with insufficient speed and lift to take off ran out of the runway 24 end, continued towards the river, hit the barbed fence and gabion wall with an initial impact and finally fell down into the edge of river. The left wing was rested in the mid of the river preventing the aircraft submerged into the river.", "probable_cause": "The Accident Investigation Commission has determined the most probable cause of the accident as the inappropriate conduct of STOL procedure and landing technique carried out by the PIC, during landing phase and an endeavor to carry out take off again with no sufficient airspeed, no required lifting force and non availability of required runway length to roll. Contributory factors to the occurrence is the absence of proper CRM in terms of communication, coordination and briefing in between crew members on intention and action being taken by PIC, during pre and post landing phase."}