{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-chicago-2-killed", "date": "Jan 5, 2010 at 1327 LT", "type": "Learjet 35", "operator": "Royal%20Air%20Freight", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Pontiac - Chicago", "msn": "156", "yom": 1977, "flight_number": "RAX988", "city": "Chicago-Executive (Palwaukee)", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7000, "captain_hours_type": 3500, "copilot_hours": 6500, "copilot_hours_type": 2400, "aircraft_hours": 15734, "circumstances": "The flight was scheduled to pick up cargo at the destination airport and then deliver it to another location. During the descent and 14 minutes before the accident, the airplane encountered a layer of moderate rime ice. The captain, who was the pilot flying, and the first officer, who was the monitoring pilot, made multiple statements which were consistent with their awareness and presence of airframe icing. After obtaining visual flight rules conditions, the flight crew canceled the instrument flight rules clearance and continued with a right, circling approach to the runway. While turning into the base leg of the traffic pattern, and 45 seconds prior to the accident, the captain called for full flaps and the engine power levers were adjusted several times between 50 and 95 percent. In addition, the captain inquired about the autopilot and fuel balance. In response, the first officer stated that he did not think that the spoilerons were working. Shortly thereafter, the first officer gave the command to add full engine power and the airplane impacted terrain. There was no evidence of flight crew impairment or fatigue in the final 30 minutes of the flight. The cockpit voice recorder showed multiple instances during the flight in which the airplane was below 10,000 feet mean sea level that the crew was engaged in discussions that were not consistent with a sterile cockpit environment, for example a lengthy discussion about Class B airspeeds, which may have led to a relaxed and casual cockpit atmosphere. In addition, the flight crew appears to have conducted checklists in a generally informal manner. As the flight was conducted by a Part 135 operator, it would be expected that both pilots were versed with the importance of sterile cockpit rules and the importance of adhering to procedures, including demonstrating checklist discipline. For approximately the last 24 seconds of flight, both pilots were likely focusing their attention on activities to identify and understand the reason for the airplane's roll handling difficulties, as noted by the captain's comment related to the fuel balance. These events, culminating in the first officer's urgent command to add full power, suggested that neither pilot detected the airplane's decaying energy state before it reached a critical level for the conditions it encountered. Light bulb filament examination revealed that aileron augmentation system and stall warning lights illuminated in the cockpit. No mechanical anomalies were found to substantiate a failure in the aileron augmentation system. No additional mechanical or system anomalies were noted with the airplane. A performance study, limited by available data, could not confirm the airplane's movements relative to an aileron augmentation system or spoileron problem. The level of airframe icing and its possible effect on the airplane at the time of the accident could not be determined.", "probable_cause": "A loss of control for undetermined reasons.\n"}