{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-23f-leticia-6-killed", "date": "Nov 18, 2006 at 2107 LT", "type": "Boeing 727-100", "operator": "Aerosucre", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bogotá – Leticia", "msn": "19430", "yom": 1966, "flight_number": null, "city": "Leticia-Alfredo Vásquez Cobo", "zone": "Amazonas", "country": "Colombia", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 8036, "captain_hours_type": null, "copilot_hours": 6617, "copilot_hours_type": null, "aircraft_hours": 66192, "circumstances": "The Boeing 727 departed Bogotá-El Dorado Airport on a night cargo flight to Leticia, carrying 3 passengers, 3 crew members and a load of 13,166 kilos of fish. While descending to Leticia-Alfredo Vásquez Cobo Airport, the crew was informed about the weather conditions at destination with a visibility down to 4 km with local patches of fog. On approach, the crew asked ATC to improve the runway lights intensity as the runway 21 is not equipped with approach lights. On short final, at a height of about 150 feet, the aircraft collided with a television antenna and crashed in a wooded area located 3,7 km short of runway 21, bursting into flames. The aircraft was totally destroyed and all six occupants were killed.", "probable_cause": "Following a flight under IFR mode, the crew decided to continue the approach by night and limited visibility under VFR mode, without meeting the minimum requirements for this type of operation. This decision led the aircraft descending at an unsafe altitude until it collided with a television antenna and crashed. The following contributing factors were identified:\r\n- Poor approach planning, \r\n- Poor judgment, \r\n- Violation of IFR procedures,\r\n- The crew's inability to circumvent the obstacle on the ground by encountering unforeseen circumstances beyond their capacity."}