{"url": "https://www.baaa-acro.com/crash/crash-let-l-410m-sukhumi-11-killed", "date": "Aug 14, 1982 at 1809 LT", "type": "Let L-410", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sukhumi - Kutaisi", "msn": "78 11 20", "yom": 1978, "flight_number": "SU73G", "city": "Sukhumi-Babushara", "zone": "Abkhazia", "country": "Georgia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2738, "circumstances": "The Let L-410 departed the terminal and was approaching the runway to depart for a schedule service to Kutaisi, carrying nine passengers and a crew of two. At 1808LT, the crew of an Aeroflot Tupolev TU-134 registered CCCP-65836 was cleared for takeoff from runway 02. En route to Moscow-Vnukovo, the Tupolev was carrying 76 passengers and a crew of six. During the takeoff run, 26 seconds after it started to roll, at a speed of 195 km/h, the crew of the TU-134 sighted a Let L-410M entering the runway. The captain of the Tupolev decided to abandon the takeoff maneuver and initiated an emergency braking procedure. Spoilers were deployed and revers systems were activated. He elected to turn to the left to reach an exit taxiway. In the same time, the crew of the Let saw the Tupolev coming from their right and increased engine power to move forward. Seven seconds after the crew of the Tupolev rejected takeoff, at a speed of 216 km/h, the right wing of the Tupolev struck the Let that was destroyed upon impact. The Tupolev rolled for about 514 meters then veered off runway to the left and came to rest 48 meters to the left of its centerline. All 82 people on board the TU-134 escaped uninjured while all 11 people on board the Let were killed.", "probable_cause": "It was determined that the collision was the consequence of a series of errors made by the crew of the Let L-410 who failed to follow ATC and ground controllers instructions regarding taxiing procedures prior to takeoff, which led them to enter the runway when he was not authorized to do so. A poor management in flights organization at Sukhumi Airport remains a contributing factor as well as few procedures violation on the part of ATC and ground controllers, among others concerning the use of a non-standard phraseology which may create confusion to the crew."}