{"url": "https://www.baaa-acro.com/crash/crash-boeing-767-35der-warsaw", "date": "Nov 1, 2011 at 1439 LT", "type": "Boeing 767-300", "operator": "LOT-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Newark - Warsaw", "msn": "28656/659", "yom": 1997, "flight_number": "LOT016", "city": "Warsaw-Okęcie-Frederic Chopin", "zone": "Masovian Voivodeship (Mazowieckie)", "country": "Poland", "region": "Europe", "crew_on_board": 10, "crew_fatalities": 0, "pax_on_board": 221, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15980, "captain_hours_type": 13307, "copilot_hours": 9431, "copilot_hours_type": 1981, "aircraft_hours": 85429, "circumstances": "On November 1, 2011 a passenger LO 16 flight of B767-300ER airplane, registration marks SP-LPC, was scheduled from KEWR to EPWA. The Pre-Departure Check of the airplane was carried out by a ground engineer from a contracted service organization in accordance with Operator’s requirements. The ground engineer was responsible for conducting PRE-DEPARTURE CHECK and ETOPS CHECK. The above procedures did not include cockpit check. The ground engineer did not find any failures or irregularities and did not notice anything unusual. The flight crew arrived at Newark Liberty Airport at a time specified by Operator and in accordance with its operating procedures. When commencing the flight duty period the crew members were rested, refreshed, in a good psychophysical condition. They did not report overload by air operations. Upon arrival at the aircraft stand each flight crew member performed his duties as provided for in the operating procedures of the airline. CPT conducted Exterior Walk Around while FO conducted cockpit check. FO checked on-board equipment and the cockpit preparation for the flight. According to the flight crew statement no failures or irregularities were found. The crew deemed the airplane fully operational for the flight to Warsaw. The ground engineer from the contracted maintenance organization was not present in the cockpit during the flight crew preparation. During the flight CPT was PF and FO was PM. At 03:58:11 hrs the crew started the engines. The take-off took place at 04:19:08 hrs. After the take-off, during the retraction of landing gear and flaps the hydraulic fluid from the center hydraulic system (C system) flew out, which consequently led to pressure drop in this system. The pressure drop in the C system was signaled on the hydraulic panel – SYS PRESS and on EICAS - C HYD SYS PRESS and recorded by on-board flight data recorders. After completion HYDRAULIC SYSTEM PRESSURE (C only) procedure contained in QRH and consultation with the Operator's MCC, the flight crew decided to continue the flight to Warsaw. The flight proceeded without significant distortions. Landing in Warsaw was to be carried out with the alternate landing gear extension system. This situation was well known to pilots due to numerous exercises carried out in a flight simulator. Taking advantage of the available time, the CPT and FO developed a plan for landing in accordance with the procedure contained in QRH and discussed an anticipated sequence of events. At 12:17 hrs, during approach to landing on EPWA aerodrome the flight crew performed the procedure of the lading gear extension using the alternate landing gear extension system. However, after the anticipated time the landing gear was not extended. The crew checked the correctness of execution of the procedure against QRH and again attempted to extend the landing gear. After failure of the second attempt to extend the landing gear with the alternate system the approach to landing was abandoned. At 12:22 hrs the crew reported to ATC inability to extend the landing gear and requested the Operator’s MCC assistance. Around 12:25 hrs the flight crew declared EMERGENCY. The airplane was directed to a holding zone. The Operator’s Operations Centre enabled the crew to communicate with experts. FO executed expert recommendations and checked the alternate landing gear extension switch and circuit breakers on P-11 and P6-1 panels. After that FO reported to Operations Centre and to CPT that the circuit breakers had been checked. FO also cycled (pulled and reset) the ALT EXT MOTOR circuit breaker as indicated by an expert. However, the landing gear was not extended. In the meantime pilots of two F-16s of the Polish Air Force inspected SP-LPC from the air and informed the crew that the landing gear was still in the retracted position but the tail skid was extended. After that information the crew attempted to extend the landing gear in a gravitational way, but it also ended in failure. After a series of unsuccessful attempts to extend the landing gear and due to low fuel quantity, the crew decided to carry out an emergency gear up landing. CC1 was instructed by Captain to prepare the cabin and passengers for emergency landing. During the preparation the passengers were calm, they carried out the crew instructions, there was no panic. Prior to the landing firefighters distributed foam over RWY 33 at a distance of about 3000 m. External services arrived at the airport (PSP and emergency ambulances). The plane touched down on RWY 33 of EPWA aerodrome (Figure 7) at 13:39 hrs. At the time of touchdown about 1600 kg of fuel (1939 liters at a density of 0.825 kg/l) was in its tanks, the engines were running and their recorded speeds were N1ACTL = 57%, N1ACTR = 38%. The plane was moving on RWY 33 along its centre line and stopped 42 m after the intersection with RWY 29. When the aircraft was moving, sparks were coming out of the right engine, and they were suppressed by the applied foam; then the engine caught fire. When the airplane came to rest, the crew evacuated the passengers and LSP extinguished the fire. During the evacuation none of the passengers or crew suffered any injuries. During the landing the aircraft sustained substantial damage, which caused its withdrawal from service.", "probable_cause": "Causes of the accident:\r\n1. Failure of the hydraulic hose connecting the hydraulic system on the right leg of the main landing gear with the center hydraulic system, which initiated the occurrence.\r\n2. Open C829 BAT BUS DISTR circuit breaker in the power supply circuit of the alternate landing gear extension system in the situation when the center hydraulic system was inoperative.\r\n3. The crew’s failure to detect the open C829 circuit breaker during approach to landing, after detecting that the landing gear could not be extended with the alternate system.\r\nFactors contributing to the occurrence were as follow:\r\n1. Lack of guards protecting the circuit breakers on P6-1 panel against inadvertent mechanical opening; from 863 production line the guards have been mounted in the manufacturing process (SP-LPC was 659 production line).\r\n2. C829 location on panel P6-1 (extremely low position), impeding observation of its setting and favoring its inadvertent mechanical opening.\r\n3. Lack of effective procedures at the Operator’s Operations Centre, which impeded specialist support for the crew.\r\n4. Operator’s failure to incorporate Service Bulletin 767-32-0162."}