{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-82-little-rock-11-killed", "date": "Jun 1, 1999 at 2350 LT", "type": "McDonnell Douglas MD-82", "operator": "American-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dallas – Little Rock", "msn": "49163", "yom": 1983, "flight_number": "AA1420", "city": "Little Rock-Bill & Hillary Clinton", "zone": "Arkansas", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 1, "pax_on_board": 139, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 10234, "captain_hours_type": 5518, "copilot_hours": 4292, "copilot_hours_type": 182, "aircraft_hours": 49136, "circumstances": "On June 1, 1999, at 2350:44 central daylight time, American Airlines flight 1420, a McDonnell Douglas DC-9-82 (MD-82), N215AA, crashed after it overran the end of runway 4R during landing at Little Rock National Airport in Little Rock, Arkansas. Flight 1420 departed from Dallas/Fort Worth International Airport, Texas, about 2240 with 2 flight crewmembers, 4 flight attendants, and 139 passengers aboard and touched down in Little Rock at 2350:20. After departing the end of the runway, the airplane struck several tubes extending outward from the left edge of the instrument landing system localizer array, located 411 feet beyond the end of the runway; passed through a chain link security fence and over a rock embankment to a flood plain, located approximately 15 feet below the runway elevation; and collided with the structure supporting the runway 22L approach lighting system. The captain and 10 passengers were killed; the first officer, the flight attendants, and 105 passengers received serious or minor injuries; and 24 passengers were not injured. The airplane was destroyed by impact forces and a post crash fire. Flight 1420 was operating under the provisions of 14 Code of Federal Regulations Part 121 on an instrument flight rules flight plan.", "probable_cause": "The flight crew's failure to discontinue the approach when severe thunderstorms and their associated hazards to flight operations had moved into the airport area and the flight crew's failure to ensure that the spoilers had extended after touchdown. Contributing to the accident were the flight crew's:\r\n(1) impaired performance resulting from fatigue and the situational stress associated with the intent to land under the circumstances, \r\n(2) continuation of the approach to a landing when the company's maximum crosswind component was exceeded, and \r\n(3) use of reverse thrust greater than 1.3 engine pressure ratio after landing."}