{"url": "https://www.baaa-acro.com/crash/crash-md-83-near-gossi-116-killed", "date": "Jul 24, 2014 at 0147 LT", "type": "McDonnell Douglas MD-83", "operator": "Swiftair", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Desert", "schedule": "Ouagadougou - Algiers", "msn": "53190/2148", "yom": 1996, "flight_number": "AH5017", "city": "Gossi", "zone": "Tombouctou", "country": "Mali", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 110, "pax_fatalities": 110, "other_fatalities": 0, "total_fatalities": 116, "captain_hours": 12988, "captain_hours_type": 10007, "copilot_hours": 7016, "copilot_hours_type": 6180, "aircraft_hours": 38362, "circumstances": "The Swiftair MD-83 was performing flight AH5017 on behalf of Air Algérie (this regular schedule is performed four times a week). The aircraft left Ouagadougou at 0117Z and was attempting to land in Algiers at 0510LT but failed to arrive.  116 people (110 passengers and a crew of 6) were on board. The last position of the MD-83 was west of Gao, Mali. In the evening of July 24 (some 16 hours after the aircraft disappearance), the wreckage was eventually located and spotted some 50 km west of the city of Gossi, south Mali. The aircraft disintegrated on impact and no survivors was found among the 116 occupants. At the time of the accident, bad weather conditions with storm activity, winds, turbulence and icing was confirmed over the region of Gao, until an altitude of 40,000 feet. At the time of the accident, the aircraft was flying west of this marginal weather area and referring to the French BEA graphic, the aircraft did not properly get around this turbulent area. It was confirmed the aircraft started a left turn from the altitude of 31,000 feet and then spiraled to the ground in less than three minutes (140° bank left and 80° nose down until impact). The last position recorded by the FDR at 0147LT and 15 seconds was at the altitude of 1,600 feet (490 meters) and at a speed of 380 KIAS (740 km/h) with a very high rate of descent. ", "probable_cause": "About two minutes after leveling off at an altitude of 31,000 ft, calculations performed by the manufacturer and validated by the investigation team indicate that the recorded EPR, the main parameter for engine power management, became erroneous on the right engine and then about 55 seconds later on the left engine. This was likely due to icing of the pressure sensors located on the engine nose cones. If the engine anti-ice protection system is activated, these pressure sensors are heated by hot air. Analysis of the available data indicates that the crew likely did not activate the system during climb and cruise. As a result of the icing of the pressure sensors, the erroneous information transmitted to the auto throttle meant that the latter limited the thrust delivered by the engines. Under these conditions, the thrust was insufficient to maintain cruise speed and the aeroplane slowed down. The autopilot then commanded an increase in the airplane's pitch attitude in order to maintain the altitude in spite of this loss of speed. This explains how, from the beginning of the error in measuring the EPR values, the airplane’s speed dropped from 290 kt to 200 kt in about 5 minutes and 35 seconds and the angle of attack increased until the aeroplane stalled. About 20 seconds after the beginning of the aeroplane stall, the autopilot was disengaged. The aeroplane rolled suddenly to the left until it reached a bank angle of 140°, and a nose-down pitch of 80°. The recorded parameters indicate that there were no stall recovery maneuvers by the crew. However, in the moments following the aeroplane stall, the flight control surfaces remained deflected nose-up and in a right roll. It was concluded that the accident was caused by the combination of several factors, among them the fact that the engine anti-icing systems were not activated by the crew. The final report is not available in English yet."}