{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3dst-144-gulf-mexico-32-killed", "date": "Dec 28, 1948 at 0415 LT", "type": "Douglas DC-3", "operator": "Airborne Transport", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "San Juan – Miami", "msn": "1496", "yom": 1936, "flight_number": null, "city": "Gulf of Mexico", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 29, "pax_fatalities": 29, "other_fatalities": 0, "total_fatalities": 32, "captain_hours": 3265, "captain_hours_type": null, "copilot_hours": 197, "copilot_hours_type": null, "aircraft_hours": 28237, "circumstances": "At 2203, 1 December 27, 1948, NC16002 departed from Isla Grande Airport, San Juan, Puerto Rico, for Miami, Florida. According to the company passenger manifest filed with the Customs Department al San Juan, there were 29 passengers aboard. The crew consisted of Captain Robert E. Linquist, Copilot E. E. Hill, and Stewardess Mary Burke. Captain Linquist had filed an instrument flight plan with the CAA Air Route Traffic Control Center and the Puerto Rican Transportation Authority; however, this flight plan was cancelled after a delay due t0 battery difficulties on the airplane. Subsequently the pilot was authorized a VFR takeoff with the understanding that the flight was to remain in the vicinity of San Juan, and attempt to establish radio contact with the tower. Once contact was established, an IFR flight plan would be filed enabling the aircraft to proceed to Miami. If this was impossible, the aircraft was to return to San Juan. Eleven minutes after takeoff the flight called the airport control tower. The control tower did not receive the call but it was intercepted by CM Communications at San Juan, to which the flight reported that it was proceeding to Miami, Florida, according to an IFR plan. CAA Communications at San Juan was unable to contact the flight again, although numerous attempts were made. At 2323, the Overseas Foreign Air Route Traffic Control Center at Miami, Florida, received a radio communication from NC16002 stating it was flying at 8.500 feet in accordance with instrument flight rules and that it estimated its time of arrival over South Caicos at 0033, and Miami at 0405, December 28, 1948. The New Orleans Overseas Foreign Air Route Traffic Control Center intercepted a position report from NC16002 at 0413, which stated it was 50 miles south of Miami. This was the last known contact with the aircraft. Unsuccessful attempts were made to contact the flight by CAA Communications from San Juan, Miami, and New Orleans. The Civil Aeronautics Board at Miami, Florida, was notified by CAA Communications on December 28, 1948, at 0830, that NC16002 was considerably overdue on a flight from San Juan, Puerto Rico, to Miami. Florida. When it was definitely determined that the aircraft was missing, the United States Coast Guard was alerted and an extensive search was immediately started. Among those participating in the search were the U. S. Coast Guard, the U. S. Navy, the Fifth Rescue Squadron of the U. S. Air Forces and numerous civil aircraft. Also actively engaged in the search were agencies of the Government of Nassau, the Dominican Republic and the Cuban Government. The search covered an area from San Juan, Puerto Rico, to Cape San Blas in Florida, the peninsula of Florida and the southern coastal area of the United States to Cape Romain, which is located approximately 45 miles north of Charleston, South Carolina. The Gulf of Mexico adjacent to the coast of Florida, the island of Cuba, the north coast of Hispaniola and the Bahama Islands were also searched. 2 Over 1,300 plane hours were flown during the six days of search, from December 28, 1948, to January 3, 1940 in conjunction with the air search, a detachment from the Fifth Rescue Squadron, U. S. Air Forces, conducted a through investigation and ground search of portions of the north coast of Cuba. The terrain was both mountainous and jungle, making the search difficult.", "probable_cause": "The Board lacks sufficient information in this case to determine the probable cause."}