{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-pleasanton-1-killed", "date": "Jan 9, 1989 at 1124 LT", "type": "Cessna 414 Chancellor", "operator": "VIP Properties", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Santa Ana - Oakland", "msn": "414-0465", "yom": 1974, "flight_number": null, "city": "Pleasanton", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 471, "captain_hours_type": 149, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During arrival, the pilot was cleared for an ILS runway 27R approach to the metro Oakland Intl Airport. As she began the approach, the ATC controller noted the aircraft had descended thru 2,900 feet msl. He provided a low altitude alert to the pilot and warned her the aircraft should be at 3,300 feet. The pilot acknowledged by saying 'thank you.' The ATC controller suggested the pilot climb to 3,300 feet immediately, then he canceled the clearance and told the pilot to climb immediately to 3,300 feet. Subsequently, the aircraft crashed approximately 15 miles east of the airport. Impact occurred with a 1,500 feet ridge at about the 1,000 feet level. No preimpact part failure or malfunction of the aircraft was found. The pilot, sole on board, was killed. ", "probable_cause": "Failure of the pilot to properly follow the IFR (instrument flight rules) procedures by not maintaining the minimum descent altitude for that segment of the approach. The weather conditions and mountainous terrain were considered to be related factors. \r\nOccurrence #1: in flight collision with terrain/water\r\nPhase of operation: approach - iaf to faf/outer marker (ifr)\r\nFindings\r\n1. (c) ifr procedure - improper - pilot in command\r\n2. (f) weather condition - low ceiling\r\n3. (f) weather condition - fog\r\n4. (f) terrain condition - mountainous/hilly\r\n5. (c) minimum descent altitude - not maintained - pilot in command"}