{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-mc-12w-204-km-ne-kandahar-4-killed", "date": "Apr 27, 2013 at 1243 LT", "type": "Beechcraft MC-12W Liberty", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Mountains", "schedule": "Kandahar - Kandahar", "msn": "FL-676", "yom": 2008, "flight_number": "Independence 08", "city": "Kandahar", "zone": "Kandahar", "country": "Afghanistan", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1749, "captain_hours_type": 242, "copilot_hours": 2434, "copilot_hours_type": 38, "aircraft_hours": null, "circumstances": "On 27 April 2013, at approximately 1243 local time (L) in Afghanistan, an MC-12W, tail number 09-0676 impacted terrain 110 nautical miles northeast of Kandahar Airfield (KAF) while on a combat intelligence, surveillance, and reconnaissance (ISR) mission. The four crewmembers on board were the Mishap Mission Commander (MMC), Mishap Pilot (MP), Mishap Sensor Operator (MSO), and Mishap Tactical Systems Operator (MTSO). The four airmen were killed instantly on impact and the Mishap Aircraft (MA), valued at $19.8 million, was destroyed. The crew and MA were deployed to the 361st expeditionary Reconnaissance Squadron, 451st Air Expeditionary Wing, KAF, Afghanistan. The MA, callsign Independence 08, departed KAF at 1157L and entered orbit at 1229L. The MA encountered deteriorating weather in the orbit and was climbing from 20,000 to 23,000 feet mean sea level (MSL) at 1241L to fly above the weather when the mishap occurred. In addition, the crew had found an enemy combatant and was in the process of adjusting their orbit to enhance mission success. ", "probable_cause": "Accident Investigation Board was conducted by USAF Brigadier General Donald J. BACON. His conclusion were as follow: \r\nI find by clear and convincing evidence the cause of the mishap was a stall due to insufficient airspeed, while in a climbing left turn, which developed into a left spin followed quickly by a high-speed spiral, from which the crew was unable to recover. Additionally, I find, by a preponderance of evidence, each of the following three factors substantially contributed to the mishap: \r\norbit weather that impeded visibility and masked the horizon;\r\npilot inexperience in the MC-12W;\r\nknown MC-12W program risks associated with sustaining required combat capability in theater."}