{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-pointe-pitre-113-killed", "date": "Jun 22, 1962 at 0403 LT", "type": "Boeing 707", "operator": "Air-France-31", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Paris – Lisbon – Santa Maria – Pointe-à-Pitre – Caracas – Bogotá – Lima – Santiago de Chile", "msn": "18247", "yom": 1962, "flight_number": "AF117", "city": "Pointe-à-Pitre", "zone": "Guadeloupe", "country": "Guadeloupe", "region": "Central America", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 103, "pax_fatalities": 103, "other_fatalities": 0, "total_fatalities": 113, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 963, "circumstances": "While descending to Pointe-à-Pitre on a flight from Paris to Santiago de Chile, the crew encountered poor weather conditions at destination, worse than forecast. On approach by night, the four engine aircraft struck the slope of a hill (427 m) located 25 km northwest of Le Raizet Airport. The aircraft crashed in flames in a dense wooded area and was totally destroyed by impact forces and a post crash fire. All 113 occupants were killed. At the time of the accident, the VOR was unserviceable and the approach was possible via an NDB only. Weather conditions were poor with low visibility due to thunderstorm activity in the area. Also, the aircraft was off course by 15 km due to interference on the ADF systems caused by the thunderstorm activity. \r\nCrew:\r\nMr. Lesieur, pilot,\r\nMr. Farret, copilot,\r\nMr. Hurlimann, navigator,\r\nMr. Pruvost, mechanic, \r\nMrs. Micoud, stewaradess,\r\nMrs. D’Horne, stewardess,\r\nMrs. Page, stewardess,\r\nMr. Epper, steward,\r\nMr. Gassler, steward,\r\nMr. Cage, steward.", "probable_cause": "The accident was the consequence of the combination of the following factors:\r\n- Poor weather conditions at destination, worse than forecast,\r\n- Lack of visibility due to weather combined with the night, \r\n- The VOR of Pointe-à-Pitre was unserviceable at the time of the accident,\r\n- The approach was possible via an NDB only, \r\n- The ADF indications were incorrect due to thunderstorm activity (atmospheric effects), causing the aircraft to be off course by 15 km.\n"}