{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-victoria-1-killed", "date": "Dec 9, 2019 at 2017 LT", "type": "Cessna 208B Grand Caravan", "operator": "Martinaire-2", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Victoria – Houston", "msn": "208B-0140", "yom": 1988, "flight_number": "MRA679", "city": "Victoria", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 12680, "captain_hours_type": 1310, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17284, "circumstances": "The airline transport pilot departed on a night cargo flight into conditions that included an overcast cloud ceiling and “hazy” visibility, as reported by another pilot. About one minute after takeoff, the pilot made a series of course changes and large altitude and airspeed deviations. Following several queries from the air traffic controller concerning the airplane’s erratic flight path, the pilot responded that he had “some instrument problems.” The pilot attempted to return to land at the departure airport, but the airplane impacted terrain after entering a near-vertical dive. The airplane was one of two in the operator’s fleet equipped with an inverter system that electrically powered the pilot’s (left side) flight instruments. Examination of the annunciator panel lighting filaments revealed that the inverter system was not powered when the airplane impacted the ground. Without electrical power from an inverter, the pilot’s side attitude indicator and horizontal situation indicator (HSI) would have been inoperative and warning flags would have been displayed over the respective instruments. The pilot had a history of poor procedural knowledge and weak flying skills. It is possible that he either failed to turn on an inverter during ground operations and did not respond to the accompanying warning flags, or he did not switch to the other inverter in the event that an inverter failed inflight. Due to impact damage, the operational status of the two inverters installed in the airplane could not be confirmed. However, the vacuum-powered flight instruments on the copilot’s (right side) were operational, and the pilot could have referenced  these instruments to maintain orientation. Based on the available information, the pilot likely lost control of the airplane after experiencing spatial disorientation. The night marginal visual flight rules conditions and instrumentation problems would have been conducive to the development of spatial disorientation, and the airplane’s extensive fragmentation indicative of a high-energy impact was consistent with the known effects of spatial disorientation. Ethanol identified during toxicology testing may have come from postmortem production and based on the low levels recorded, was unlikely to have contributed to this accident. Morphine identified in the pilot’s liver could not be used to extrapolate to antemortem blood levels; therefore, whether or to what extent the pilot’s use of morphine contributed to the accident could not be determined.", "probable_cause": "The pilot’s loss of control due to spatial disorientation. Contributing to the accident were the inoperative attitude indicator and horizontal situation indicator on the pilot’s side of the cockpit, and the pilot’s failure to reference the flight instruments that were operative."}