{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-21a-goose-fort-lauderdale-1-killed", "date": "Mar 25, 1999 at 1139 LT", "type": "Grumman G-21A Goose", "operator": "Tropic Bird Landing", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Watson Island - Fort Lauderdale", "msn": "1150", "yom": 1942, "flight_number": null, "city": "Fort Lauderdale-Hollywood", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10000, "captain_hours_type": 520, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13136, "circumstances": "The pilot was receiving a competency flight in the seaplane from an FAA inspector. The pilot was returning to their initial departure airport, descended to 1,000 feet, contacted the control tower for landing instructions, and was instructed to enter on a right base. Before he could acknowledge the landing instructions the engines started to make loud, rough, and unusual noises. The pilot informed the control tower that he was 2 miles south , declared an emergency, and stated he had a bad engine on the left side. The FAA inspector stated the pilot started the emergency procedure, the manifold pressure and rpm was fluctuating. The inspector could not determine the dead engine by the dead foot, dead engine method, because her rudder pedals were stowed. She pointed out a pasture and the pilot stated they were going to the water. She did not recall the pilot shutting down the engine or feathering the propeller. She could not recall the final seconds of the flight. The airplane collided with a tree, canal bank, and came to rest inverted in the canal. Examination of the airframe and flight control systems revealed no evidence of a precrash mechanical failure or malfunction. Examination of the left propeller revealed it was not feathered. The No. 6 front forward spark plug ignition lead was disconnected from the spark plug. The ignition lead shroud threaded coupling on the No. 4 front forward spark plug was unscrewed and the carbon wire was exposed. The left and right engines were removed from the airplane and transported to an authorized FAA approved repair station. The left engine was placed in an engine test cell. The engine was started, developed rated power, and achieved takeoff power. The spark plug lead was removed from the No.6 forward cylinder. The left magneto had a 125 rpm drop during the magneto check. The right magneto had a 75 rpm drop. The magneto drop exceeded the allowable drop indicated by the engine overhaul manual. The right engine was placed in a engine test cell. The engine was started, developed rated power, and achieved takeoff power. Review of the FAA inspectors FAA Form 4040.6 revealed she was not Event Based Current (EBC) for the 4th quarter of the Flight Standards EBC program, and she did not meet the EBC quarterly events required by the end of the 14-day grace period. FAA Order 4040.9 states for an FAA inspector to be eligible / assigned to perform flight certification job function they must be EBC current., and inspectors should not accept assignments without being in compliance with the FAA Order. Managers and supervisors should not assign inspectors who are not current. The FAA inspector's supervisor was aware that the inspector was not current. He contacted the FAA Safety Regulation Branch, FAA Southern Region Headquarters, and stated that FAA Southern Region indicated that the inspector could administer the checkride. FAA Southern Region stated at no time did they approve or agree to an operation outside the parameters of the FAR's, Inspector Handbook or FAA Order. ", "probable_cause": "The pilots failure to correctly identify an in-flight emergency (fluctuating manifold pressure and rpm due to a disconnected spark plug lead / unscrewed ignition lead shroud) and failure to complete the engine shutdown procedure once it was initiated (propeller not feathered). This resulted in a forced landing and subsequent in-flight collision with a tree, dirt bank and canal. Contributing to the accident was the FAA inspectors improper supervision of the pilot, and the improper supervision of the inspector by her supervisor, in his failure to follow written procedures / directives in assigning a non-current inspector to conduct a competency flight. "}