{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-oeiras", "date": "Mar 18, 2016 at 1630 LT", "type": "Beechcraft 90 King Air", "operator": "Ciro Nogueira Comercio de Motocicletas", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Teresina - Oeiras", "msn": "LJ-861", "yom": 1979, "flight_number": null, "city": "Oeiras", "zone": "Piauí", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine airplane departed Teresina on a business flight to Floriano, carrying seven passengers and one pilot, among them Ciro Nogueira, Senator of the State of Piauí and Margarete Coelho, Vice-Governor of the State of Piauí. En route to Floriano, the pilot was informed about the deterioration of the weather conditions at destination and decided to divert to Oeiras Airfield. After touchdown on runway 11 that was wet due to recent rain falls, the aircraft started to skid. Control was lost and the aircraft veered off runway to the left and came to rest in a wooded area, some 10 metres from the runway. All eight occupants were rescued, among them one passenger was slightly injured. The aircraft was damaged beyond repair.", "probable_cause": "Contributing factors:\r\n- Application of commands - undetermined\r\nIt is possible that the pilot has not acted properly in the controls after touchdown to avoid a runway excursion.\r\n- Flight indiscipline - contributed\r\nHaving landed on a non-approved runway, without justifiable reason, the crew member did not comply with the provisions of civil aviation regulations.\r\n- Influence of the environment - undetermined\r\nThe wet and puddled runway may have affected directional control and aircraft braking performances during the landing roll.\r\n- Pilot judgment - contributed\r\nThe crew member had not correctly assessed the risks involved in the operation in an unapproved runway, without justifiable reason. In addition, the pilot had no considering that the wet and puddle conditions of the runway could affect the directional control and braking performances of the aircraft.\r\n- Decision-making process - contributed\r\nThe decision to land at an unapproved aerodrome, as well as having used a wet runway and the presence of puddles denoted an inadequate assessment of the risks present in the context. Failures related to decisions assumed by the pilot contributed to the occurrence insofar as they resulted in the entry of the aircraft into a critical condition, affecting its control."}