{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-325-near-purisima-de-la-concepcion", "date": "Apr 9, 2017 at 1241 LT", "type": "Piper PA-31-310 Navajo", "operator": "GAME S.A.", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Tolú - Montería", "msn": "31-7612020", "yom": 1976, "flight_number": null, "city": "Purísima de la Concepción", "zone": "Córdoba", "country": "Colombia", "region": "South America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14791, "captain_hours_type": 700, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6840, "circumstances": "The twin engine aircraft departed Cali-Alfonso Bonilla Aragón Airport in the morning on a flight to Tolú, carrying seven passengers and one pilot. After takeoff from Tolú, the pilot decided to position to Montería-Los Garzones Airport. Shortly after takeoff, the pilot encountered engine problems and elected to make an emergency landing in a pasture. Upon landing, the right wing collided with obstacles then the nose gear collapsed and the aircraft came to rest near Purísima de la Concepción, about 10 km east of Tolú. The pilot was uninjured and the aircraft was damaged beyond repair. ", "probable_cause": "Inadequate fuel management and incomplete execution of procedures by the Pilot, by not activating in time the fuel supply from the external tanks (OUTBD) to the internal tanks (INBD) for the feeding of both the engines, causing the fuel in the internal tanks to run out and causing both engines to stop due to fuel starvation.\r\nContributing Factors:\r\n- Poor flight planning on part of the pilot by not considering the amount of minimum fuel needed and not complying with the minimum fuel amount required for domestic flights.\r\n- Loss of situational awareness by the pilot by not following the standard operation procedures. "}