{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1049h-super-constellation-san-francisco-3-killed", "date": "Dec 24, 1964 at 0031 LT", "type": "Lockheed L-1049 Super Constellation", "operator": "Flying%20Tiger%20Line", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "San Francisco – New York", "msn": "4812", "yom": 1957, "flight_number": "FT282", "city": "San Francisco", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 14911, "captain_hours_type": 3942, "copilot_hours": 4113, "copilot_hours_type": 3811, "aircraft_hours": null, "circumstances": "Flight 282 was a scheduled domestic cargo flight from San Francisco International Airport, California, to John F. Kennedy International Airport, New York. It was originally scheduled to depart at 2100 hours, Pacific Standard Time, on 23 December, but the flight was delayed because of the non-availability of a flight engineer. An engineer obtained from Los Angeles arrived in San Francisco at 2315 hours and the flight departed at 0028 hours on 24 December. At 0015 hours, while taxiing to runway 28L, the flight advised Ground Control that because of a heavy load, they would like to proceed out past the GAP Radio Beacon to the Golden Gate Intersection, and thence via Victor 150 to Sacramento instead of direct to Sacramento as originally filed. The request was coordinated with Oakland Air Route Traffic Control Centre and approval obtained. The crew was then advised that for take-off on runway 28L there would be a 'heavy' left crosswind from 210° at 18 to 25 knots which they acknowledged. After having switched to clearance delivery frequency, the flight was cleared to Kennedy Airport via Victor one fifty Sacramento, Victor six north, and requested to climb out on the San Francisco two eight seven radial for a vector to Golden Gate Intersection to intercept Victor one fifty. This was acknowledged. The Clearance Delivery Controller then stated: \" You can disregard the vector, climb outbound San Francisco 287° radial to Golden Gate Intersection, then Victor 150, and, depending on your altitude, they probably will give you a vector to intercept (Victor) 150 before you get to Golden Gate\". This was also acknowledged. The Local Controller, who was also Tower Supervisor, noted the time of 0030 on his clock as the aircraft became airborne and passed the tower. An eyewitness observed the landing lights retracting as the aircraft crossed the end of the runway. However, several witnesses along the flight path, including some located at points just prior to the crash, saw both landing lights on. Landing lights of the L-1049H may be retracted flush with the lower wing surface and remain on until switched off. After take-off, witnesses stated the aircraft made a slight turn to the right, then a steeper turn to the left, and then was observed returning to a wings-level attitude as it entered the clouds. At 0030:22, the flight was advised to contact Departure Control and did so immediately. The Departure Controller advised the flight at 0030:57 that he had radar contact with it and requested it to report leaving thousand-foot altitudes. At 0031:05, the crew asked how they were tracking toward the GAP. The Departure Controller switched his radar scope from the 30 to the 10-mile setting and requested the flight's altitude. The crew!replied they were at 900 ft. At 0031:20, the Departure Controller advised that they were left of the San Francisco 287° radial. As he received no acknowledgement he repeated his message. The Departure Controller stated that within seconds after the second transmission, the target stopped, bloomed, and disappeared from the radar scope. Repeated attempts to communicate with the flight after its disappearance from the scope were unsuccessful. At this time, 0032:30, the controller placed a time hack on the communications tape. Ground impact was computed to have occurred at approximately 0031:30. Main impact occurred 860 ft above sea level on Sweeney's Ridge, at approximately 4.3 miles on the 257° radial of the SFO TVOR. The coordinates of the impact area were 122° 28' 00\" W longitude and 37° 38' 28\" N latitude. The aircraft disintegrated on impact and all three crew members were killed. ", "probable_cause": "The pilot, for undetermined reasons, deviated from departure course into an area of rising terrain where downdraught activity and turbulence affected the climb capability of the aircraft sufficiently to prevent terrain clearance."}