{"url": "https://www.baaa-acro.com/crash/crash-canadair-cl-44-6-miami-6-killed", "date": "Sep 27, 1975 at 0600 LT", "type": "Canadair CL-44", "operator": "Aerotransportes%20Entre%20Rios", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Miami – Panama City – Lima – Santa Cruz – Asunción – Buenos Aires", "msn": "05", "yom": 1961, "flight_number": "RS501/90", "city": "Miami-Intl", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 4, "pax_on_board": 4, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 11601, "captain_hours_type": 2352, "copilot_hours": 1876, "copilot_hours_type": 486, "aircraft_hours": 20108, "circumstances": "At 0600LT, Aerotransportes Entre Rios Cargo Flight 501/90, crashed while attempting a night VMC takeoff from runway 27L at the Miami International Airport, Miami, Florida. The aircraft did not become airborne, and the pilot attempted unsuccessfully to reject the takeoff. The aircraft ran off the departure end of the runway and crashed on the west bank of a canal, about 960 feet from the departure end of the runway. Six of the ten persons aboard were killed. Two crewmembers and two passengers survived the accident. The aircraft was destroyed by impact and fire. The aircraft struck and destroyed an automobile; one occupant of the car was injured. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of the accident was an attempt to take off with an external makeshift flight control lock on the right elevator. The following findings were reported:\r\n- An external elevator lock was carried on the aircraft. The use of this lock was not part of the certification of the aircraft.\r\n- The external elevator control lock was installed on the right elevator after the aircraft landed at Miami and was still in place after the aircraft was loaded and taxied from the ramp for takeoff.\r\n- The pilots could have detected the presence of this lock by referring to the flight control surface position indicators. \r\n- The pilot was unable to rotate the aircraft to the takeoff attitude.\r\n- By the time the pilot determined that he could not rotate the aircraft and initiated procedures to reject the takeoff, the aircraft had accelerated to a speed which prevented him from stopping on the runway.\r\n- The aircraft struck a number of obstacles off the paved area of the airport; these impacts resulted in the destruction of the aircraft and fire. "}