{"url": "https://www.baaa-acro.com/crash/crash-cessna-501-citation-isp-smyrna-7-killed", "date": "May 29, 2021 at 1055 LT", "type": "Cessna 501 Citation I", "operator": "JL & GL Productions LP", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": null, "msn": "501-0254", "yom": 1982, "flight_number": null, "city": "Smyrna-Rutherford County", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On May 29, 2021, about 1055 central daylight time, a Cessna 501 Citation, N66BK, was destroyed when it was involved in an accident shortly after takeoff from the Smyrna Airport (MQY), Smyrna, Tennessee. The pilot and six passengers were fatally injured. The airplane was operated as a Title 14 Code of Federal Regulations Part 91 personal flight. The pilot filed an instrument flight rules flight plan with a destination of Palm Beach International (PBI) Airport, West Palm Beach, Florida. He purchased 414 gallons of Jet A fuel prior to the flight, which topped-off the fuel tanks (574 gallons total). The pilot then taxied to runway 32. Preliminary review of air traffic control (ATC) communications and radar data revealed the pilot was cleared for takeoff and instructed to turn to a heading of 090°, and to climb and maintain 3,000 ft mean sea level (msl). The pilot initially read back the clearance as “at or above 3,000 ft”, and the controller corrected him. The airplane departed at 1053:06 and made a climbing right turn to the east and the pilot was instructed to contact Nashville departure control. At 1054:27, when the airplane was about 3 miles north of the airport, a departure controller contacted the airplane and asked if they were “on frequency.” The pilot responded with, “N66BK with you.” The controller then instructed the pilot to turn right to a heading 130°; however, the pilot did not acknowledge. At 1054:46, the controller asked the pilot if he “copied” the heading instruction. The pilot responded about 4 seconds later and said, “130…Bravo Kilo.” At 1055:11, the controller instructed the pilot to climb and maintain 15,000 ft msl, but there was no response. The controller then made multiple attempts to re-establish  communications with the airplane; however, there were no further communications. A review of radar data revealed that after the pilot established contact with departure control the airplane made a series of heading changes along with several climbs and descents before it entered a steep, descending left turn. The last radar return, at 1055:05, indicated the airplane was at an altitude of about 700 ft msl, descending about 31,000 ft-per-minute, on a heading of 090°. A witness was fishing about 150 ft west of the Fate Sanders Recreation Area boat ramp located on Lake Percy Priest, about 2.7 miles northeast of MQY. He described the weather as a very low ceiling in mist. The witness heard what he thought was a low flying military jet before he saw the airplane impact the lake in a “straight down” nose first attitude. He did not see any evidence of fire or an explosion. Examination of the accident site revealed that the airplane impacted a shallow section of the lake that was about 2 to 8-ft-deep. First responders and recovery personnel used underwater side sonar to identify larger pieces of wreckage, along with underwater rescue divers. The divers reported that the visibility in the water was poor due to the deep mud and silt that made up the lakebed. About two-thirds of the airplane were recovered from the lake, which included both engines, the main cabin door, portions of the main cabin windows, the left nose baggage door, all threelanding gear, most of the tail section, and sections of both wings, including portions of the flaps and ailerons. Several fractured seat frames and pieces of the interior were also recovered. There was no evidence of an in-flight fire observed on any of the recovered sections of airframe or engines. The airplane was not equipped; nor was it required to be equipped with a flight data recorder (FDR) or a cockpit voice recorder (CVR). No other sources of non-volatile recorded data were identified as being installed on the airplane. The airplane wreckage was retained for further examination. The pilot held a commercial pilot certificate with ratings for airplane single-engine land, multiengine land, and instrument airplane. He also held a private pilot certificate with a rating for rotorcraft-helicopter. The pilot held a type rating for the airplane with no restrictions. His most recent Federal Aviation Administration (FAA) second-class medical certificate was issued on November 12, 2019, with the limitation that he “must wear corrective lenses.” Initial review of the plot’s logbook revealed he had accumulated about 1,680 total flight hours; of which 83 hours were in the accident airplane. ", "probable_cause": null}