{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-thompson", "date": "Sep 15, 2015 at 1821 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Keystone%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Thompson – Winnipeg", "msn": "31-8052022", "yom": 1980, "flight_number": "KEE208", "city": "Thompson", "zone": "Manitoba", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2000, "captain_hours_type": 1000, "copilot_hours": 446, "copilot_hours_type": 120, "aircraft_hours": null, "circumstances": "At 1817 Central Daylight Time, the Keystone Air Service Ltd. Piper PA-31-350 (registration C-FXLO, serial number 31-8052022) departed Runway 06 at Thompson Airport, Manitoba, on an instrument flight rules flight to Winnipeg/James Armstrong Richardson International Airport, Manitoba, with 2 pilots and 6 passengers on board. Shortly after rotation, both engines began to lose power. The crew attempted to return to the airport, but the aircraft was unable to maintain altitude. The landing gear was extended in preparation for a forced landing on a highway southwest of the airport. Due to oncoming traffic, the forced landing was conducted in a forested area adjacent to the highway, approximately 700 metres south of the threshold of Runway 06. The occupants sustained varying serious injuries but were able to assist each other and exit the aircraft. The emergency locator transmitter activated, and there was no fire. Emergency services were activated by a 911 call and by the Thompson flight service station. Initial assistance was provided by sheriffs of the Manitoba Department of Justice after a crew member flagged down their vehicle on the highway.", "probable_cause": "Findings as to causes and contributing factors:\r\n1. Delivery of the incorrect type of aircraft fuel caused loss of power from both engines, necessitating a forced landing.\r\n2. The fueling operation was not adequately supervised by the flight crew.\r\n3. A reduced-diameter spout was installed that enabled the delivery of Jet-A1 fuel into the AVGAS fuel filler openings.\r\n4. The fuel slip indicating that Jet-A1 fuel had been delivered was not available for scrutiny by the crew.\n\r\nFindings as to risk:\r\n1. If administrative and physical defences against errors in aviation fuel operations are circumvented or disabled, there is a risk that the incorrect type of fuel will be delivered.\r\n2. If a reduced-diameter spout is available to accommodate non-standard fuel filler openings, there is an increased risk that Jet-A1 fuel can be dispensed into an aircraft that requires AVGAS.\n\r\nOther findings:\r\n1. Aircraft that were manufactured prior to the current airworthiness standards, or that have been modified by the installation of turbine engines, may have fuel filler openings that do not meet the dimension requirements.\r\n2. The airworthiness standards for rotorcraft do not specify the size of fuel filler openings.\r\n3. The use of all of the available restraint systems in the aircraft contributed to the survival of the occupants.\r\n4. There was no post-crash fire, likely due to the separation of the battery from the aircraft and to the rain-saturated crash site.\r\n5. The absence of a post-impact fire contributed to the survival of all of the aircraft's occupants."}