{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-580-la-ronge-1-killed", "date": "May 14, 2006 at 1245 LT", "type": "Convair CV-580", "operator": "Saskatchewan Government Northern Air Operations", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "La Ronge - La Ronge", "msn": "202", "yom": 1954, "flight_number": "TKR472", "city": "La Ronge", "zone": "Saskatchewan", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 9500, "captain_hours_type": 750, "copilot_hours": 13000, "copilot_hours_type": 25, "aircraft_hours": null, "circumstances": "The aircraft was conducting stop-and-go landings on Runway 36 at the airport in La Ronge, Saskatchewan. On short final approach for the third landing, the aircraft developed a high sink rate, nearly striking the ground short of the runway. As the crew applied power to arrest the descent, the autofeather system feathered the left propeller and shut down the left engine. On touchdown, the aircraft bounced, the landing was rejected, and a go-around was attempted, but the aircraft did not attain the airspeed required to climb or maintain directional control. The aircraft subsequently entered a descending left-hand turn and crashed into a wooded area approximately one mile northwest of the airport. The first officer was killed and two other crew members sustained serious injuries. The aircraft sustained substantial damage. The accident occurred during daylight hours at 1245 central standard time. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The flight crew attempted a low-energy go-around after briefly touching down on the runway. The aircraft’s low-energy state contributed to its inability to accelerate to the airspeed required to accomplish a successful go-around procedure.\r\n2. The rapid power lever advancement caused an inadvertent shutdown of the left engine, which exacerbated the aircraft’s low-energy status and contributed to the eventual loss of control.\r\n3. The inadvertent activation of the autofeather system contributed to the crew’s loss of situational awareness, which adversely influenced the decision to go around, at a time when it may have been possible for the aircraft to safely stop and remain on the runway.\r\n4. The shortage and ambiguity of information available on rejected landings contributed to confusion between the pilots, which resulted in a delayed retraction of the flaps. This departure from procedure prevented the aircraft from accelerating adequately. \r\n5. Retarding the power levers after the first officer had exceeded maximum power setting resulted in an inadequate power setting on the right engine and contributed to a breakdown of crew coordination. This prevented the crew from effectively identifying and responding to the emergencies they encountered.\r\nFindings as to Risk:\r\n1. The design of the autofeather system is such that, when armed, the risk of an inadvertent engine shutdown is increased.\r\n2. Rapid power movement may increase the risk of inadvertent activation of the negative torque sensing system during critical flight regimes. \r\nOther Findings:\r\n1. There were inconsistencies between sections of the Conair aircraft operating manual (AOM), the standard operating procedures (SOPs), and the copied AOM that the operator possessed. These inconsistencies likely created confusion between the training captain and the operator’s pilots.\r\n2. The operator’s CV-580A checklists do not contain a specified section for circuit training. The lack of such checklist information likely increased pilot workload. "}