{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-188a-electra-new-york-65-killed", "date": "Feb 3, 1959 at 2356 LT", "type": "Lockheed L-188 Electra", "operator": "American-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Chicago – New York", "msn": "1015", "yom": 1958, "flight_number": "AA320", "city": "New York-LaGuardia", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 3, "pax_on_board": 68, "pax_fatalities": 62, "other_fatalities": 0, "total_fatalities": 65, "captain_hours": 28135, "captain_hours_type": 48, "copilot_hours": 10192, "copilot_hours_type": 36, "aircraft_hours": 302, "circumstances": "At approximately 2356LT, the aircraft crashed into the East River while attempting an instrument approach to runway 22 at LaGuardia Airport. There were 73 persons on board, including one infant. The captain and one stewardess were killed; the first officer, flight engineer, and the remaining stewardess survived. Of the 68 passengers, 5 survived. The Board believes that a premature descent below landing minimums was the result of preoccupation of the crew on particular aspects of the aircraft and its environment to the neglect of essential flight instrument references for attitude and height above the approach surface. Contributing factors were found to be: limited experience of the crew with the aircraft type, fealty approach technique in which the autopilot was used in the heading mode to or almost to the surface, erroneous setting of the captain's altimeter, marginal weather in the approach area, possible misinterpretation of altimeter and rate of descent indicator, and sensory illusion with respect to height and attitude resulting from visual reference to the few lights existing in the approach area.", "probable_cause": "The Board determines the probable cause of this accident was premature descent below landing minimums which was the result of preoccupation of the crew on particular aspects of the aircraft and its environment to the neglect of essential flight instrument references for attitude and height above the approach surface. Contributing factors were:\r\n- Limited experience of the crew with the aircraft type,\r\n- Faulty approach technique in which the autopilot was used in the heading mode to or almost to the surface,\r\n- Erroneous setting of the captain's altimeter,\r\n- Marginal weather in the approach area,\r\n- Possible misinterpretation of altimeter and rate of descent indicator,\r\n- Sensory illusion with respect to height and attitude resulting from visual reference to the few lights existing in the approach area."}