{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-500tp-malibu-meridian-lubbock-1-killed", "date": "Feb 4, 2015 at 1930 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Daedalus Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Carlsbad – Lubbock", "msn": "46-97043", "yom": 2001, "flight_number": null, "city": "Lubbock", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1073, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1378, "circumstances": "The instrument-rated private pilot was conducting a personal cross-country flight in the airplane. A review of the air traffic control transcripts and radar data revealed that the pilot was executing the RNAV GPS Y instrument approach to the runway. The air traffic controller then canceled the pilot's approach clearance and issued a heading change off of the approach course to provide spacing between a preceding aircraft. The pilot acknowledged the heading assignment. Radar data indicated that, after the controller cancelled the approach, the airplane began a left climbing turn from 5,600 to 5,800 ft, continued the left turn through the assigned 270 heading, and then descended rapidly. At that point, the airplane was no longer visible on the controller's radar display, and contact with the pilot was lost. The final recorded radar return showed the airplane at 5,100 ft. The airplane impacted a television tower guy wire, several power lines, and terrain, and then came to rest in an open field about 800 ft from the tower. A postaccident examination of the airplane and engine revealed no anomalies that would have precluded normal operation. A postaccident examination of the engine revealed rotational signatures on the first stage compressor blades and light rotational signatures in the compressor and power turbines, and debris was found in the engine's gas path, all of which are consistent with engine rotation at impact. A witness in the parking lot next to the television tower stated that he heard the accident airplane overhead, saw a large flash of light that filled his field of view, and then observed the television tower collapse on top of itself. Surveillance videos located 1.5 miles north-northeast and 0.3 mile north-northwest of the accident site showed the airplane in a left descending turn near the television tower. After it passed the television tower, multiple bright flashes of light were observed, which were consistent with the airplane impacting the television tower guy wire and then the power lines. Further, the radar track and accident wreckage were consistent with a rapid, descending left turn to impact. Weather conditions were conducive to the accumulation of ice at the destination airport about the time that the pilot initiated the left turn. It is likely that the airplane accumulated at least light structural icing during the descent and that this affected the airplane's controllability. Also, the airplane likely encountered wind gusting up to 31 knots as it was turning; this also could have affected the airplane's controllability. The night, instrument meteorological conditions at the time of the accident were conducive to the development of spatial disorientation, and the airplane's rapid, descending left turn to impact is consistent with the pilot's loss of airplane control due to spatial disorientation. Therefore, based on the available evidence, it is likely that, while initiating the climbing left turn, the pilot became spatially disoriented, which resulted in his loss of airplane control and his failure to see and avoid the tower guy wire, and that light ice accumulation on the airplane and the gusting wind negatively affected the airplane's controllability.", "probable_cause": "The pilot's loss of airplane control due to spatial disorientation and light ice accumulation while operating in night, instrument meteorological conditions with gusting wind."}