{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-300-diamond-anderson", "date": "Mar 25, 2002 at 0901 LT", "type": "Mitsubishi MU-300 Diamond", "operator": "Corporate Flight Management", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Memphis – Anderson", "msn": "067", "yom": 1983, "flight_number": null, "city": "Anderson-Darlington Field", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10500, "captain_hours_type": 1000, "copilot_hours": 1575, "copilot_hours_type": 275, "aircraft_hours": 4078, "circumstances": "The MU-300 on-demand passenger charter flight sustained substantial damage during a landing overrun on a snow/ice contaminated runway. The captain, who was also the company chief pilot and check airman, was the flying pilot, and the first officer was the non flying pilot. Instrument meteorological conditions prevailed at the time of the accident. Area weather reporting stations reported the presence of freezing rain and snow for a time period beginning several hours before the accident. The captain did not obtain the destination airport weather observation until the flight was approximately 30 nautical miles from the airport. The flight received radar vectors for a instrument landing system approach to runway 30 (5,401 feet by 100 feet, grooved asphalt). The company's training manual states the MU-300's intermediate and final approach speeds as 140 knots indicated airspeed (KIAS) and Vref, respectively. Vref was reported by the flight crew as 106 KIAS. During the approach, the tower controller (LC) gave the option for the flight to circle to land or continue straight in to runway 30. LC advised that the winds were from 050-070 degrees at 10 knots gusting to 20 knots, and runway braking action was reported as fair to poor by a snow plow. Radar data indicates that the airplane had a ground speed in excess of 200 knots between the final approach fix and runway threshold and a full-scale localizer deviation 5.5 nm from the localizer antenna. The company did not have stabilized approach criteria establishing when a missed approach or go-around is to be executed. The captain stated that he was unaware that there was 0.7 percent downslope on runway 30. The company provided a page from their airport directory which did not indicate a slope present for runway 30. The publisher of the airport directory provided a page valid at the time of the accident showing a 0.7 percent runway slope. Runway slope is used in the determination of runway performance for transport category aircraft such as the MU-300. The airplane operating manual states that MU-300 landing performance on ice or snow covered runways has not been determined. The airplane was equipped with a cockpit voice recorder with a remote cockpit erasure control. Readout of the cockpit voice recorder indicated a repetitive thumping noise consistent with manual erasure. No notices to airman pertaining to runway conditions were issued by the airport prior to the accident.", "probable_cause": "Missed approach not executed and flight to a destination alternate not performed by the flight crew. The tail wind and snow/ice covered runway were contributing factors."}