{"url": "https://www.baaa-acro.com/crash/crash-cessna-411-fort-lauderdale", "date": "Sep 10, 1983 at 0759 LT", "type": "Cessna 411", "operator": "Bertram E. Weech", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Lauderdale - Atlantic", "msn": "411-0242", "yom": 1967, "flight_number": null, "city": "Fort Lauderdale-Executive", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7200, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2439, "circumstances": "The aircraft crashed while maneuvering at low airspeed and altitude right after takeoff. The pilot said the left engine started losing power intermittently at 90 knots. The pilot had rotated the aircraft and tried to continue the takeoff. He was cleared to land on any runway and in attempting a turn with landing gear and partial flaps extended control was lost and a crash occurred. The aircraft flight manual states that if an engine fails below 105 mph the takeoff should be aborted. An on scene examination revealed no evidence to suggest a pre-impact failure or malfunction. Both propellers showed evidence of torsional overload damage. When the engines were further examined the left engine fuel strainer was partially clogged with dirt. During a run-up test the left engine would not develop more than 23 inches hg. At 2,750 rpm and magneto rpm drop was erratic. The engine would not run with the aux fuel boost pump off. The reason for the low power output was a disconnected pressure line for the turbocharger which appeared to have been disconnected for some time. All five occupants were injured, two of them seriously. ", "probable_cause": "Occurrence #1: loss of engine power (partial) - mech failure/malf\r\nPhase of operation: takeoff - initial climb\r\nFindings\r\n1. (c) fuel system, strainer - blocked (partial)\r\n2. (c) exhaust system, turbocharger - disconnected\r\n----------\r\nOccurrence #2: loss of control - in flight\r\nPhase of operation: takeoff - initial climb\r\nFindings\r\n3. (c) flight controls - improper use of - pilot in command\r\n4. (c) throttle/power control - improper use of - pilot in command\r\n5. (c) abort - not performed - pilot in command\r\n----------\r\nOccurrence #3: in flight collision with terrain/water\r\nPhase of operation: maneuvering"}