{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54d-10-dc-skymaster-panama-city-7-killed", "date": "Aug 4, 1965 at 2334 LT", "type": "Douglas C-54 Skymaster", "operator": "Rutas Internacionales Peruanas", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Iquitos – Cali – Panama City – Miami", "msn": "10826", "yom": 1945, "flight_number": null, "city": "Panama City", "zone": "Panamá", "country": "Panama", "region": "Central America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 4563, "captain_hours_type": null, "copilot_hours": 5012, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight was a non-scheduled international cargo flight carrying wild animals from Iquitos, Peru, to Miami, U.S.A., with intermediate stops at Cali, Colombia, and Panama City, Panama. It departed Iquitos at 1325 hours GMT and reached Cali, Colombia at 1725 hours. There it was refuelled and repairs were carried out on Nos. 2 and 3 engines. It then took off for Panama City at 2120 hours, arriving there for refuelling at 2320 hours. At 2333 hours local time, the aircraft took off normally from runway 03 for Miami. One minute later, the tower controller looked towards the aircraft before authorizing a change of frequency and saw large flames at a heading of approximately 040° but was unable to say if the aircraft was still airborne or had just crashed. He immediately gave the alarm and enquired whether the air traffic cont;roller still had radar contact with the air- craft, On receiving a negative reply, he notified the airport authority that the aircraft had crashed. It was subsequently found that the aircraft had struck a mahogany tree at a height of about 70 ft above the ground and then several others before corning to rest on uneven ground. The accident occurred 2.5 miles north-east from the end of runway 03 at Tocumen Airport. The airplane was destroyed and all seven occupants were killed. ", "probable_cause": "The Commission of Inquiry decided that this accident was probably caused by faulty maintenance. Some malfunction of No. 2 engine apparently occurred during the first phase of take-off and caused an intense in-flight fire. The destruction by the fire of some of the control surfaces resulted in a loss of control and the aircraft struck several trees and crashed."}