{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47-b-35-dk-mtwara", "date": "Aug 27, 1975 at 0922 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "East-African-Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dar es-Salaam – Mtwara – Nachingmea", "msn": "16577/33325", "yom": 1945, "flight_number": "EC087", "city": "Mtwara", "zone": "Mtwara Region", "country": "Tanzania", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 16, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2884, "captain_hours_type": null, "copilot_hours": 411, "copilot_hours_type": null, "aircraft_hours": 37365, "circumstances": "The aircraft departed Dar es Salaam with three crew and 16 passengers. Flight EC087 was scheduled to call at Lindi and Nachingwea with the service terminating at Nachingwea. Due to the non availability of fuel at Dar es Salaam, the aircraft made an unscheduled stop at Mtwara to refuel with sufficient fuel for the return service EC088 to Dar es Salaam. The weather at Mtwara was reported fine with the wind light and variable. At the time of the landing, the wind direction was given as 030 and 8 knots. The aircraft made the approach and landing using standard procedures and touched down at a point some 1,000 feet from the threshold of runway 19. After a ground roll of 150 feet, the aircraft commenced a swing to the left side of the runway, it then rolled another 350 feet and swung to the right continued on this course, leaving the runway and skidding for approximately 180 feet before it came to rest having turned 135° from the direction of the landing. Both landing gear assys collapsed due to excessive side loads applied to the structure, substantial damage was caused to the centre section structure and nacelles. The port propeller was damaged. The passengers and crew were able to evacuate the aircraft with the aid of tile ground rescue services. Two passengers were taken to hospital and treated for shock. ", "probable_cause": "The most probable cause of the accident was the failure of the pilot to initiate corrective action to prevent the aircraft from turning off the runway."}