{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh104-dove-2a-shoreham-sea-1-killed", "date": "Jul 9, 1983 at 1005 LT", "type": "De Havilland DH.104 Dove", "operator": "Keith David Wickenden", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Shoreham-by-Sea - Shoreham-by-Sea", "msn": "04421", "yom": 1953, "flight_number": null, "city": "Shoreham-by-Sea", "zone": "West Sussex", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 602, "captain_hours_type": 13, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot, also owner of the aircraft, elected to make a post-engine change test flight himself. After takeoff from Shoreham-by-Sea Airport runway 07 in good weather, eye-witnesses considered that the take-off and initial climb were normal except that intermittent puffs of dark smoke were seen coming from the right engine. At about 600 feet above ground level the aircraft was seen to roll to the right then turn on to its back and spin to the ground. After a short pause the aircraft burst into flames and was largely consumed by an intense fire. The pilot, sole on board, was killed. ", "probable_cause": "Examination of the wreckage revealed that the aircraft impacted with the sloping side of the west flood bank of the River Adur. At impact the aircraft was 60° nose down, rolled to the right, and was yawing to the right. Both engines were rotating, with the left engine developing more power than the right. Detailed wreckage examination at the AIB engineering facility at Farnborough showed that the rudder was approximately fully left and the elevator fully up. Engine strip examination yielded no evidence of any pre-crash  defect in the left engine, but severe corrosion was found in the fuel control boost capsule (Part n° CH 90274) of the right engine. Tests were carried out on an engine test bed to examine the effects of boost capsule perforation. It was found that such a fault would induce power fluctuations, and that the engine could experience a rich cut when the throttle was retarded. Research into previous incidents on the same type of aircraft revealed two occasions during which fluctuating boost and rpm had been experienced after take-off and later attributed to boost capsule perforation. "}