{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-8as-beyrouth-90-killed", "date": "Jan 25, 2010 at 0241 LT", "type": "Boeing 737-800", "operator": "Ethiopian%20Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Beirut - Addis Ababa", "msn": "29935/1061", "yom": 2002, "flight_number": "ET409", "city": "Beirut", "zone": "Beirut Governorate", "country": "Lebanon", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 82, "pax_fatalities": 82, "other_fatalities": 0, "total_fatalities": 90, "captain_hours": 10233, "captain_hours_type": 188, "copilot_hours": 673, "copilot_hours_type": 350, "aircraft_hours": 26459, "circumstances": "On 25 January 2010, at 00:41:30 UTC, Ethiopian Airlines flight ET 409, a Boeing 737-800 registered ET-ANB, crashed into the Mediterranean Sea about 5 NM South West of Beirut Rafic Hariri International Airport (BRHIA), Beirut, Lebanon. ET 409 was being operated under the provisions of the Ethiopian Civil Aviation Regulations (ECAR) and as a scheduled international flight between BRHIA and Addis Ababa Bole International Airport (ADD) - Ethiopia. It departed Beirut with 90 persons on board: 2 flight crew (a Captain and a First Officer), 5 cabin crew, an IFSO and 82 regular passengers. The flight departed at night on an instrument flight plan. Low clouds, isolated cumulonimbus (CB) and thunderstorms were reported in the area. The flight was initially cleared by ATC on a LATEB 1 D departure then the clearance was changed before take-off to an “immediate right turn direct Chekka”. After take-off ATC (Tower) instructed ET 409 to turn right on a heading of 315°. ET 409 acknowledged and heading 315° was selected on the Mode Control Panel (MCP). As the aircraft was on a right turn, Control suggested to ET 409 to follow heading 270° “due to weather”. However, ET 409 continued right turn beyond the selected heading of 315° and Control immediately instructed them to “turn left now heading 270°”. ET 409 acknowledged, the crew selected 270° on the MCP and initiated a left turn. ET 409 continued the left turn beyond the instructed/selected heading of 270° despite several calls from ATC to turn right heading 270° and acknowledgment from the crew. ET 409 reached a southerly track before sharply turning left until it disappeared from the radar screen and crashed into the sea 4‟ 59” after the initiation of the take-off roll (4‟17” in the air). The aircraft impacted the water surface around 5 NM South West of BRHIA and all occupants were fatally injured. Search and Rescue (S&R) operations were immediately initiated. The DFDR and CVR were retrieved from the sea bed and were read, as per the Lebanese Government decision, at the BEA facility at Le Bourget, France. The recorders data revealed that ET 409 encountered during flight two stick shakers for a period of 27” and 26”. They also recorded 11 “Bank Angle” aural warnings at different times during the flight and an over-speed clacker towards the end of the flight. The maximum recorded AOA was 32°, maximum recorded bank angle was 118° left, maximum recorded speed was 407.5 knots, maximum recorded G load was 4.76 and maximum recorded nose down pitch value 63.1°. The DFDR recording stopped at 00:41:28 with the aircraft at 1291‟. The last radar screen recording was at 00:41:28 with the aircraft at 1300‟. The last CVR recording was a loud noise just prior to 00:41:30.", "probable_cause": "Probable Causes: \r\n1- The flight crew's mismanagement of the aircraft's speed, altitude, headings and attitude through inconsistent flight control inputs resulting in a loss of control.  \r\n2- The flight crew failure to abide by CRM principles of mutual support and calling deviations hindered any timely intervention and correction. \r\nContributing Factors: \r\n1- The manipulation of the flight controls by the flight crew in an ineffective manner resulted in the aircraft undesired behavior and increased the level of stress of the pilots. \r\n2- The aircraft being out of trim for most of the flight directly increased the workload on the pilot and made his control of the aircraft more demanding. \r\n3- The prevailing weather conditions at night most probably resulted in spatial disorientation to the flight crew and lead to loss of situational awareness. \r\n4- The relative inexperience of the Flight Crew on type combined with their unfamiliarity with the airport contributed, most likely, to increase the Flight Crew workload and stress. \r\n5- The consecutive flying (188 hours in 51 days) on a new type with the absolute minimum rest could have likely resulted in a chronic fatigue affecting the captain's performance. \r\n6- The heavy meal discussed by the crew prior to take-off has affected their quality of sleep prior to that flight. \r\n7- The aircraft 11 bank angle aural warnings, 2 stalls and final spiral dive contributed in the increase of the crew workload and stress level. \r\n8- Symptoms similar to those of a subtle incapacitation have been identified and could have resulted from and/or explain most of the causes mentioned above. However, there is no factual evidence to confirm without any doubt such a cause.\r\n9- The F/O reluctance to intervene did not help in confirming a case of captain's subtle incapacitation and/or to take over control of the aircraft as stipulated in the operator's SOP."}