{"url": "https://www.baaa-acro.com/crash/crash-vickers-832-viscount-near-winton-24-killed", "date": "Sep 22, 1966 at 1303 LT", "type": "Vickers Viscount", "operator": "Ansett-ANA%20-1957-1968", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Mount Isa – Longreach – Brisbane", "msn": "416", "yom": 1959, "flight_number": "AN149", "city": "Winton", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 20, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": 14288, "captain_hours_type": 10003, "copilot_hours": 2803, "copilot_hours_type": 249, "aircraft_hours": 18634, "circumstances": "On 22 September 1966, the Viscount 832 aircraft registered VH-RMI, was engaged on a regular public transport service, designated Flight 149, from Mt. Isa to Longreach in Queensland, Australia, with a crew of four and twenty passengers on board. The flight departed from Mt. Isa at 1208 hours Australian Eastern Standard Time climbing to Flight Level 175 with an expected time interval of 73 minutes to Longreach. The flight progressed, apparently uneventfully, until 1252 hours when the Longreach Flight Service Unit heard the crew of VH-RMI say that it was on an emergency descent and to stand by. Two minutes later the aircraft advised that there were fire warnings in respect of Nos. 1 and 2 engines, that one of these warning conditions had ceased and that the propeller of the other engine could not be feathered. At 1259 hours information from the crew of VH-RMI, relayed to Longreach through the crew of another aircraft in the vicinity, indicated that there was a visible fire in No. 2 engine and that the aircraft was diverting below 5 000 ft to Winton. The town of Winton is located some 20 miles to port of the planned track and is 90 miles short of Longreach. No further communications were received from the aircraft but at 1303 hours a number of people located in the Winton area saw black smoke in the air west of the town, and it was subsequently established that this was associated with VH-RMI which had crashed in light timber on level ground some 131 miles short of the Winton aerodrome. The aircraft disintegrated on impact and all 24 occupants have been killed. ", "probable_cause": "The probable cause of the accident was that the means of securing the oil metering unit to the No. 2 cabin blower became ineffective and this led to the initiation of a fire within the blower, which propagated to the w$ng fuel tank and substantially reduced the strength of the main spar upper boom. It is probable that the separation of the oil metering unit arose from an out-of-balance condition induced by rotor break-up but the source of the rotor break-up could not be determined. \r\nThe following findings were reported: \r\n- The crash of the aircraft followed the failure in an upward direction of the port wing between No. 1 and No. 2 engines at approximately 1302:30 hours Eastern Standard Time when the aircraft was at a height of 3 500 ft to 4 000 ft above ground level,\r\n- The port wing failed as a result of a weakening of the main spar due to a fire in No. 2 cell of No. 2 fuel tank,\r\n- The fire originated in the No. 2 cabin blower and travelled through the rear of No. 2 engine nacelle and port wheel bay to the fuel tank,\r\n- The fire in No. 2 cabin blower was initiated as a result of a rotor break-up, the blower subsequently being driven in an out-of-balance condition by the quill shaft long enough for the metering unit to become separated from the rear end cover by the resulting vibration,\r\n- The metering unit continued to be driven after separation and lubricating oil continued to be supplied. The driven rotor lost its rear stub shaft radial location and caused metal-to-metal contact which generated a temperature sufficiently high to ignite the oil in that area,\r\n- It is not possible on the evidence to determine what was the cause of the rotor break-up."}