{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-kazan-5-killed", "date": "Jan 23, 1953 at 2037 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Leningrad – Moscow – Kazan – Sverdlovsk", "msn": "184 304 04", "yom": 1951, "flight_number": null, "city": "Kazan", "zone": "Republic of Tatarstan", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3705, "circumstances": "The crew was completing a cargo flight from Leningrad to Sverdlovsk with intermediate stops in Moscow-Bykovo Airport and Kazan, with a load of six brass panels weighing 155 kilos each and a batch of capacitors. The descent to Kazan was started by night and poor weather conditions with heavy snow falls, reducing the visibility down to zero. The crew obtained the permission to descent to 1,800, 1,200 and 600 meters and was unable to locate the runway. Guided by ATC, the aircraft descended to the altitude of 150 meters when the aircraft hit with its left engine the empennage of an Aeroflot Ilyushin II-12. Registered CCCP-L1435, this second aircraft was performing the cargo flight number SU022 from Novosibirsk to Moscow with an intermediate stop in Kazan, carrying a crew of six and a load of wire coils, electric engines and radio components. Following the collision, both aircraft dove into the ground and crashed in a snow covered field located three km southwest of the airport. Both aircraft were destroyed and all eleven crew members were killed. ", "probable_cause": "It was determined that the collision was the result of a series of omissions on part of the ATC based at Kazan Airport who failed to coordinate properly the radar coverage and failed to assist the crew adequately. The ATC in charge of the approach instructed the crew of the Lisunov to descend to 300 meters instead of the 900 meters as mentioned in the approach procedures. Due to poor weather conditions that reduced the visibility below minimas, it would be more appropriate that ATC postponed the departure of the Ilyushin II-12 or instructed the crew of the Lisunov LI-2 to follow a holding circuit or to divert to another airport. It was confirmed that both flying crew did not bear any responsibilities in this tragedy. "}