{"url": "https://www.baaa-acro.com/crash/crash-sud-aviation-se-210-caravelle-iii-antibes-95-killed", "date": "Sep 11, 1968 at 1034 LT", "type": "Sud-Aviation SE-210 Caravelle", "operator": "Air-France-31", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Ajaccio - Nice", "msn": "244", "yom": 1968, "flight_number": "AF1611", "city": "Antibes", "zone": "Alpes-Maritimes", "country": "France", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 89, "pax_fatalities": 89, "other_fatalities": 0, "total_fatalities": 95, "captain_hours": 8836, "captain_hours_type": 2054, "copilot_hours": 4293, "copilot_hours_type": 676, "aircraft_hours": 1001, "circumstances": "Following an uneventful flight from Ajaccio, the crew started the descent to Nice-Côte d'Azur Airport when the pilot sent a brief mayday message, saying 'fire on board, request urgent landing'. Few second later, the airplane went into a dive and crashed into the Mediterranean Sea some 40 km off Antibes. Few debris were found on water surface and none of the 95 occupants survived the crash. ", "probable_cause": "The exact cause of the accident could not be determined with certainty. At the beginning of the investigations, the board of inquiry reported that the following assumptions were not ruled out: pilot error, fire in the cockpit, aircraft shot down by a surface-to-air missile or the rupture of the hydraulic reservoir. Nevertheless, the aircraft totally disintegrated upon impact with the water surface as it was extremely violent, at a considerable speed and with a high rate of descent. It is believed the loss of control was the consequence of a fire that erupted in the rear part of the cabin, by the right lavatory and galley. Maybe the pilot became incapacitated by fumes but this was not confirmed. About 50 years after the accident, the French government may release some classified documents regarding this tragedy, reinforcing the assumption that the aircraft may have been shut down by a surface-to-air missile fired by the French Navy which was completing local exercises in the area at that time. In 2018, the real cause of this accident remains unclear. "}