{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130a-hercules-near-pearblossom-3-killed", "date": "Aug 13, 1994 at 1331 LT", "type": "Lockheed C-130 Hercules", "operator": "Hemet%20Valley%20Flying%20Service", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Mountains", "schedule": "Hemet - Hemet", "msn": "3148", "yom": 1957, "flight_number": "Tanker 82", "city": "Pearblossom", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 11000, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 20300, "circumstances": "While in level flight, the airplane's right wing separated and, during the separation sequence, wing fuel ignited. Subsequent laboratory examination of right-side, center-wing fragments revealed two fatigue cracks that propagated to overstress fractures. One of the cracks was within the underside wing skin below a doubler, and the other was within the doubler itself. The total size and origin of the fatigue regions could not be determined due to damage to fracture surfaces and a lack of available material. The airplane was delivered new to the U.S. Air Force in December 1957 and was retired from military service in 1986. In May 1990, the FAA issued a restricted-category special airworthiness certificate authorizing the airplane to dispense aerial fire retardant. At the time of the accident, the airplane had a total of 20,289 flight hours, 19,547 of which were acquired during its military service. The inspection and maintenance programs used by the operator, which were based on military standards, included general visual inspections for cracks but did not include enhanced or focused inspections of highly stressed areas, such as the wing sections, where the fatigue cracks that led to those accidents were located. The operator did not possess the engineering expertise necessary to conduct studies and engineering analysis to define the stresses associated with the firefighting operating environment and to predict the effects of those stresses on the operational life of the airplanes.", "probable_cause": "The inflight failure of the right wing due to fatigue cracking in the underside right wing skin and overlying doubler. A factor contributing to the accident was inadequate maintenance procedures to detect fatigue cracking."}