{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-cootamundra", "date": "Jun 25, 2001 at 1021 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Airtex%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sydney – Griffith", "msn": "110-241", "yom": 1980, "flight_number": null, "city": "Cootamundra", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6850, "captain_hours_type": 253, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Embraer EMB-110P1 Bandeirante, VH-OZG, departed from Sydney Kingsford Smith international airport at 0855 on 25 June 2001, on a single-pilot instrument flight rules (IFR) charter flight to Griffith. The nine occupants on board the aircraft included the pilot and eight passengers. At about 0945, while maintaining an altitude of 10,000 ft, the master caution light illuminated. At the same time, the multiple alarm panel ‘GENERATOR 2’ (right generator) warning light also illuminated, indicating that the generator was no longer supplying power to the main electrical bus bar. After resetting the generator and monitoring its output, the pilot was satisfied that it was operating normally. A short time later, the master warning light illuminated again. A number of circuit breakers tripped, accompanied by multiple master alarm panel warnings. The red ‘FIRE’ warning light on the right engine fire extinguisher ‘T’ handle also illuminated, accompanied by the aural fire alarm warning. The pilot reported that after silencing the aural fire alarm, he carried out the engine fire emergency checklist actions. However, he was unable to select the fuel cut-off position with the right fuel condition lever, despite overriding the locking mechanism using his left thumb while attempting to operate the lever with his right hand. He also reported that the propeller lever did not remain in the feathered detent, but moved forward, as if spring-loaded, to an intermediate position. After unsuccessfully attempting to select fuel cut-off with the right fuel condition lever, or feather the right propeller with the propeller lever, the pilot pulled the right ‘T’ handle to discharge the fire bottle. The amber discharge light illuminated and a short time later the fire alarm sounded again. Passengers reported seeing lights illuminated on the multiple alarm panel and heard the sound of a continuous fire alarm in the cockpit. At 0956, the pilot notified air traffic services (ATS) that there was a ‘problem’ with the aircraft, but did not specify the nature of that problem. Almost immediately the pilot transmitted a PAN radio call and advised ATS that there was a fire on board the aircraft. The nearest aerodromes for an emergency landing were not available due to fog, and the pilot decided to divert to Young, which was about 35 NM to the south east of the aircraft’s position at that time. The pilot advised ATS that the fire was extinguished, and that he was diverting the aircraft to Young. Two minutes later, the pilot repeated his advice to ATS stating that a fire in the right engine had been extinguished, and requested emergency services for the aircraft’s arrival at Young. The pilot informed one of the passengers that there was an engine fire warning, and that they would be landing at Young. The passengers subsequently reported seeing flames in the right engine nacelle and white smoke streaming from under the wing. Smoke had also started to enter the cabin in the vicinity of the wing root. The pilot subsequently reported that he had selected the master switch on the air conditioning control panel to the ‘vent’ position, and that he had opened the left direct vision window in an attempt to eliminate smoke from the cabin. When that did not appear to have any effect he closed the direct vision window. The pilot of another aircraft reported to ATS that Young was clear, but there were fog patches to the north. On arrival at Young, however, the pilot of the Bandeirante was unable to land the aircraft because of fog, and advised ATS that he was proceeding to Cootamundra, 27 NM to the south southwest of Young. The crew of an overflying airliner informed ATS that Cootamundra was clear of fog. ATS confirmed that advice by telephoning an aircraft operator at Cootamundra aerodrome. At 1017 thick smoke entered the cabin and the pilot transmitted a MAYDAY. He reported that the aircraft was 9 NM from Cootamundra, and ATS informed him that the aerodrome was clear of fog. The pilot advised that he was flying in visual conditions and that there was a serious fire on board. No further radio transmissions were heard from the aircraft. At 1021, approximately 25 minutes after first reporting a fire, the pilot made an approach to land on runway 16 at Cootamundra. He reported that when he selected the landing gear down on late final there was no indication that the gear had extended. The pilot reported that he did not have sufficient time to extend the gear manually using the emergency procedure because he was anxious to get the aircraft on the ground as quickly as possible. Unaware that the right main landing gear had extended the pilot advised the passengers to prepare for a ‘belly’ landing. He lowered full flap, selected the propeller levers to the feathered position and the condition levers to fuel cut-off. The aircraft landed with only the right main landing gear extended. The right main wheel touched down about 260 m beyond the runway threshold, about one metre from the right edge of the runway. During the landing roll the aircraft settled on the nose and the left engine nacelle and skidded for approximately 450 m before veering left off the bitumen. The soft grass surface swung the aircraft sharply left, and it came to a stop on the grass flight strip east of the runway, almost on a reciprocal heading. The pilot and passengers were uninjured, and vacated the aircraft through the cabin door and left overwing emergency exit. Personnel from a maintenance organisation at the aerodrome extinguished the fire in the right engine nacelle using portable fire extinguishers.", "probable_cause": "Significant factors:\r\n1. Vibration from the worn armature shaft of the right starter generator resulted in a fractured fuel return line.\r\n2. The armature shaft of the right engine starter generator failed in-flight.\r\n3. Sparks or frictional heat generated by the failed starter generator ignited the combustible fuel/air mixture in the right engine accessory compartment. \r\n4. Items on the engine fire emergency checklist were not completed, and the fire was not suppressed.\r\n5. The operator’s CASA approved emergency checklist did not contain smoke evacuation procedures.\r\n6. The pilot did not attempt to extend the landing gear using the emergency gear extension when he did not to get a positive indication that the gear was down and locked.\r\n7. The aircraft landed on the right main landing gear and slid to a stop on the right main gear, left engine nacelle and nose."}