{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-franklin", "date": "Mar 11, 2021 at 1953 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Duotech Services", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Franklin - Franklin", "msn": "421B-0654", "yom": 1974, "flight_number": null, "city": "Franklin-Macon County", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3000, "captain_hours_type": 7, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3406, "circumstances": "According to the pilot, during the takeoff roll from the 5,000-ft-long runway, after reaching an airspeed of 90 knots, the airplane’s acceleration slowed. The airplane reached a maximum airspeed of about 92 knots, which was below the planned rotation speed of 100 knots. The pilot elected to abort the takeoff with about 1,500 ft of remaining runway. He reduced the power to idle and initiated maximum braking. The pilot stated that he did not sense the airplane slowing down but observed tire marks on the runway postaccident that were consistent with braking. The airplane continued off the end of the runway and collided with a fence before coming to a stop. All of the occupants exited the airplane safely, and a post-crash fire ensued. Examination of the runway revealed tire skid marks that began 1,200 ft from the runway end and continued into the grass leading to the airplane. An examination of the airplane revealed that the entire cockpit and cabin areas were destroyed by fire. The engines did not display evidence of a catastrophic failure but were otherwise unable to be examined in more detail due to the degree of fire damage. The parking brake control was found in the off position. All hydraulic brake lines were destroyed by fire, and the main landing gear sustained fire and impact damage. Although the tire marks on the runway indicated that some braking action took place, the extensive fire damage precluded a detailed examination of the braking system, and there was insufficient evidence to determine the reason for the runway excursion.", "probable_cause": "The reason for this accident could not be determined based on the available information."}