{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-ingleside", "date": "Dec 18, 1995 at 1730 LT", "type": "Beechcraft 200 Super King Air", "operator": "Western Airways Inc.", "flight_phase": "Takeoff (climb)", "flight_type": "Illegal (smuggling)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ingleside - Cartagena", "msn": "BB-868", "yom": 1981, "flight_number": null, "city": "Ingleside-T. P. McCampbell-Porter", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On December 18, 1995, at 1730 central standard time, a Beech B200, N231RL, was substantially damaged, during takeoff near Ingleside, Texas. The commercial pilot and his passenger were not injured. The airplane was owned by R.A. Beeler Leasing Company, of Carrizo Springs, Texas, and operated by Western Airways Inc., of Houston, Texas. The airplane was stolen from the West Houston Airport at 1600. Visual meteorological conditions prevailed and no flight plan was filed. According to U.S. Customs officials, the operator's chief mechanic reported the aircraft stolen as soon as the airplane was broken into by the two occupants. A U.S. Customs airplane was vectored to intercept the stolen airplane. The owner of the airplane reported there was approximately 800 pounds of fuel aboard at the time the airplane was stolen. The airplane was intercepted as it was landing at the T.P. McCampbell Airport, near Ingleside, Texas. The Customs aircraft landed and blocked the single 4,996 foot runway. While attempting to takeoff to evade law enforcement personnel, the airplane impacted a fence, crossed a ditch, and came to rest in a swamp. The two occupants of the airplane jumped out and ran. The pilot's son was captured, but the pilot was not apprehended. The following items were found in the airplane: bolt cutters, 2 masks, loaded weapons, the pilot's wallet, and charts and maps indicating that the planned destination of the flight was near Cartagena, Colombia. The nose landing gear collapsed, the left wing sustained structural damage, and the pressure bulkhead was punctured.", "probable_cause": "The pilot's improper decision, while evading law enforcement personnel during an illegal/unauthorized operation. "}