{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-414-56-hudson-horn-island-6-killed", "date": "Jun 24, 1957 at 1535 LT", "type": "Lockheed L-414 Hudson", "operator": "Adastra%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Aerial photography", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Horn - Weipa Mission", "msn": "414-6429", "yom": 1942, "flight_number": null, "city": "Horn Island", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3083, "circumstances": "At 0735 hours, the aircraft departed Horn Island with only the normal crew on board to conduct aerial photography over the northern portion of the Cape York Peninsula. The aircraft returned to Horn Island at about midday and was refueled to full tanks. The crew lunched with the crew of World Wide Aerial Surveys Hudson VH-SMM which was also conducting aerial photography in the area. After lunch the three passengers boarded VH-AGO which set course for Weipa Mission at 1516 hours. At 1523 hours, Captain Linfoot advised the communication station on Thursday Island that he was returning to Horn Island with engine trouble and requesting that VH-SMM be held on the ground at Horn Island to render assistance if required. Following a baulked approach at Horn Island, the aircraft crashed on a tidal mud shelf 1.25 miles north-west of Horn Island Aerodrome at approximately 1535 hours. It was subsequently established that the port engine had seized as a result of a master rod bearing failure. The inquiry determined that VH-AGO had a total time of 3083 hours with 260 hours since last overhaul. \r\nThe following account of the accident is extracted from \"Aviation Safety Digest\":\r\n\"The aircraft was temporarily based at the Weipa Mission aerodrome, northern Queensland, with the normal crew consisting of a pilot, a navigator and a photographic assistant. On the day before the accident the aircraft was flown on a private flight from Weipa Mission to the Horn Island aerodrome with three non-paying passengers aboard in addition to the crew. The aircraft remained overnight at Horn Island, and early on the following morning took off with the normal crew, and carried out survey work over a period of some four hours. The aircraft returned to Horn lsland at about midday and was refueled. During the same morning another Hudson aircraft (VH-SMM of WWAS. Ed.) engaged on photographic survey work had arrived at the aerodrome and the two crews lunched together. Both aircraft were prepared for departure and the three passengers again boarded the Weipa Mission aircraft, which took-off first and set course at 1518 hours E.S.T. intending to climb to 7,000 feet en route for Weipa, 45 minutes flying time to the south. Five minutes after departure the pilot of this aircraft advised the communication station at Thursday Island that trouble had developed in the port engine and that he was returning, to land at Horn Island. He also asked that the other Hudson aircraft be held on the ground in case some assistance was needed. At the stage that this message was relayed to the captain of the second Hudson the aircraft was lined up for take-oft but immediately vacated the strip. The captain watched the circuit and approach of the other aircraft from a position clear of, but adjacent to, the threshold of Runway 08. The returning aircraft was seen to cross Runway 08 and then turn downwind at a height of 1,500-1,700 feet and proceed with a left-hand circuit towards the threshold of that runway. As the aircraft turned on to final approach at about the normal distance from the threshold but still unusually high, the ground observers noticed that the undercarriage had not been extended. The aircraft continued to descend in this configuration and it seemed likely at this stage that a wheels-up landing would be made well down the strip. When the aircraft had reached a point approximately 600 feet from the threshold and 150 feet above ground level the undercarriage was observed to extend and it was also noticed that the port propeller was feathered. At this point there appeared to be no wing flap extended and the aircraft crossed the strip threshold at a height of more than 100 feet and at a speed estimated to be well in excess of the normal approach speed. Soon after the aircraft had passed the threshold it was seen to roll and turn to port and this motion continued until the aircraft disappeared from view at such a height and angle of bank that an accident seemed imminent. The pilot of the Hudson on the ground immediately took-off and located the wrecked aircraft on a coral mud shelf just beyond the northern shore of the island. Ground parties discovered that the aircraft had been virtually destroyed by very high impact forces and the six occupants had lost their lives.\" \r\nThose on board at the time of the crash were:\r\nJoseph (Joe) Linfoot (Captain)\r\nHermione Ivy (Josie) Linfoot (Wife of the Captain)\r\nGraham Holstock (Navigator)\r\nHarold Corrigan (Camera Operator)\r\nWilliam Frank Mitchell (Director of Mitchell Aerial Services Pty Ltd, Cairns)\r\nLionel Kenneth George Jeffery (a pilot intending to join Adastra).\r\nSource & photos:\r\nhttp://www.adastron.com/adastra/aircraft/hudson/vh-ago.htm", "probable_cause": "The official report found that a baulked approach was initiated at or near the threshold of Runway 08. It was concluded that given the speed and height of the approach, a baulked approach was essential to avoid over-running the airstrip. The reference to a council truck may be related to the fact that the DCA groundsman was directed to drive his vehicle on to the runway to prevent Hudson VH-SMM from taking-off at the request of the captain of VH-AGO."}