{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-351c-kansas-city-4-killed", "date": "Apr 13, 1987 at 2155 LT", "type": "Boeing 707", "operator": "Buffalo%20Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Oklahoma City – Wichita – Kansas City – Fort Wayne", "msn": "19209", "yom": 1966, "flight_number": "BV721", "city": "Kansas City", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 10000, "captain_hours_type": 3500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Buffalo Airways flight 721, a regularly scheduled cargo flight, was operating between Oklahoma City, OK, and Fort Wayne, IN (FWA), with en route stops at Wichita, KS (ICT), and Kansas City, MO (MCI). The flight to Wichita was routine. En route to Kansas City, the crew deviated from course to avoid thunderstorms, but the descent into the terminal area was routine. At 21:42 flight 721 contacted the TRACON arrival radar controller. The controller directed the flight to turn to 060 degrees and told the flightcrew that they were being vectored to the ILS localizer for the ILS approach to runway 1. About 21:47 while the airplane was descending through about 6,500 feet, the first officer, who had been flying the airplane, turned the controls over to the captain. Buffalo Airways' regulations required captains to make all the approaches and landings whenever the ceilings and visibilities were less than 400 feet and 1 mile, respectively. At 21:50, after several intermediate descent clearances, flight 721 was cleared to descend to 2,400 feet. At 21:51, the controller told flight 721 that it was \"five miles from DOTTE (the LOM), turn left zero four zero, maintain two thousand four hundred until established, cleared ILS runway one approach.\" The crew had completed the before-landing checklist, the landing gear was down and locked, and the flaps had been extended to 25 degrees, as required, for landing. At 21:52:40, the local controller advised flight 721 that it was No. 2 to land and that the winds were zero four zero at eight knots, and that the RVR on runway 1 was more than 6,000 feet. At 21:52:47, the first officer stated, \"Localizer alive.\" The first office reported the airplane's altitude during the descent in 100-foot increments above \"minimums (DH)\" until the airplane reached the decision height. At 21:53:07, the first officer called, \"Marker inbound.\" The flightcrew then received ATIS information \"Sierra\" which stated that the weather at the airport was in part: ceiling--100 feet, overcast; visibility 1/2 mile, fog; wind 40° at 8 knots. At 21:53:24, the captain remarked, \"Already started the approach.\" At 21:53:32, 4 seconds after reporting that the airplane was 200 feet above minimums, the first officer told the local controller that, \"Seven twenty-one is the marker inbound.\" The local controller acknowledged receipt of the message. At 21:53:41, after receiving a low-altitude alert generated by the Automated Radar Tracking System III (ARTS III) computer's Minimum Safe Altitude Warning (MSAW) function, the local controller warned flight 721 to \"check altitude immediately should be two thousand four hundred, altimeter two nine six one.\" Flight 721 did not respond. However, the captain said \"Call the radar (radio) altimeter please.\" At 21:53:46, the first officer responded, \"Okay, there's twelve hundred on the (radio) altimeter.\" At 21:53:50, the local controller again called the flight and warned, \"I have a low altitude alert, climb and maintain two thousand four hundred.\" Again, the flightcrew did not acknowledge receipt of the warning. At 21:53:51, a crewmember called out \"pull it up,\" and at 2153:52, the captain applied power followed almost simultaneously by sounds of initial impact. Flight 721 struck the tops of trees on a 950-foot-high ridge about 3 nmi short of the approach end of runway 1. The airplane cut a relatively level 750- to 800-foot-long swath through the tree tops about 20 to 30 feet above the ground. The swath ended as the ridge and tree tops sloped downward. The airplane then rolled and turned to the right as it descended into the main impact area 2,000 feet beyond the initial impact site. All four occupants were killed.", "probable_cause": "The Safety Board determines that the probable cause of this accident was the captain’s intentional descent below the DH. Contributing to the accident was the breakdown in flightcrew coordination procedures which contributed to the failure of the captain and the first officer to detect that the airplane had not intercepted and was below the ILS glideslope. Also contributing to the accident was the failure, for unknown reasons, of the airplane’s GPWS to provide an unsafe deviation below the ILS glideslope warning."}