{"url": "https://www.baaa-acro.com/crash/crash-cessna-402a-melbourne-6-killed", "date": "Sep 3, 1986", "type": "Cessna 402", "operator": "Peninsula Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Melbourne - Leongatha", "msn": "402A-0130", "yom": 1969, "flight_number": null, "city": "Melbourne-Essendon", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight was intended to return patients to their home area following medical treatment in Melbourne. After an apparently normal take-off, the aircraft ceased climbing at about 100 feet above ground level. In response to a query from the Tower, the pilot advised that the left engine had failed, that he was feathering the propeller and would return for landing. The aircraft was seen to be deviating to the left, towards a large array of power lines. These lines extend from about 40 feet to 90 feet above the ground, and as the aircraft converged with the array it was probably below the height of the upper wires. The aircraft then suddenly veered to the left and subsequently struck the ground in a steep nose-down attitude. A fire broke out on impact and destroyed much of the wreckage. The final manoeuvre performed by the aircraft was typical of that which occurs when one engine of a twin-engine aircraft is producing considerably less power than the other, and airspeed is reduced to below that required to maintain directional control. The pilot had reported that the left engine had failed, and the loss of control as described by witnesses was consistent with a reduction of power from this engine, combined with low airspeed. ", "probable_cause": "The investigation of the accident was hampered by the extent of the fire damage. However, an extensive technical examination did not reveal any evidence of a defect or malfunction with either the engines, the various systems or the airframe which might have contributed to the accident. Although the pilot had indicated that he was feathering the left propeller, it was determined that the propeller was not feathered at the time of the accident. It was not possible to establish if the pilot had subsequently elected not to initiate feathering action, or whether such action was initiated too late for it to be completed before impact with the ground. The reason for the loss of performance reported by the pilot could not be established. It is likely that while the aircraft was being manoeuvred to avoid the power lines and return for a landing, the airspeed decayed to below the minimum required to enable adequate control of the aircraft to be maintained. At the point where control of the aircraft was lost, there was insufficient height available for the pilot to effect recovery. The reason continued flight was attempted, rather than a controlled forced landing in open areas prior to the power lines, could not be determined."}