{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47-dl-kabul", "date": "Jan 2, 1962 at 1316 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "IranAir", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kabul – Tehran", "msn": "6043", "yom": 1942, "flight_number": "IR123", "city": "Kabul", "zone": "Kabul", "country": "Afghanistan", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8800, "captain_hours_type": 3500, "copilot_hours": 3500, "copilot_hours_type": 2000, "aircraft_hours": null, "circumstances": "Flight IR123 was a scheduled international cargo flight from Kabul, Afghanistan to Tehran, Iran. The co-pilot was in the left-hand seat and pilot flying at the commencement of the takeoff run. The aircraft was cleared for takeoff on runway 29 at 13:13. When accelerating for takeoff the pilot-in-command noticed that the propeller of the no. 1 engine was overspeeding and surging as high as 3300 rpm. As the aircraft approached an indicated airspeed of about 80 kts the captain took command. He noticed that the aircraft was headed to the left away from the runway centreline towards three runway lights in a concrete footing at the left edge of the runway. To avoid a possible collision with these lights the captain applied elevator control and lifted the aircraft off the runway. The overspeeding propeller condition did not subside although he followed the procedure prescribed in the operations manual for corrective action. The flight path was about 30 to 45° to the left of the runway and in the general direction of the Kabul Airport terminal building so the captain attempted to turn the aircraft further to the left to avoid collision with the building. About 325 ft from the south edge of runway 29 the left wing contacted the ground and the aircraft crashed.", "probable_cause": "The captain failed to discontinue the take-off when he saw that No . 1 propeller was overspeeding and at a time when the aircraft was still on the runway."}