{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-14p-tkvarcheli-31-killed", "date": "Jun 10, 1960 at 1055 LT", "type": "Ilyushin II-14", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Rostov-on-Don – Krasnodar – Sochi – Sukhumi – Kutaisi – Tbilisi", "msn": "7 34 31 07", "yom": 7, "flight_number": "SU207", "city": "Tkvarcheli", "zone": "Abkhazia", "country": "Georgia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 24, "pax_fatalities": 24, "other_fatalities": 0, "total_fatalities": 31, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5423, "circumstances": "After his departure from Sukhumi Airport, the crew continued to the southeast bound for Kutaisi at an altitude of 1,200 meters when poor weather conditions were encountered with clouds from 600 to 1,000 meters. Following a navigation error, the aircraft deviated 17 km to the north when it struck trees and crashed in flames on the north slope of Mt Rech (1,436 meters high) located near Tkvarcheli. The wreckage was found a day later. The airplane was completely destroyed by impact forces and a post crash fire and all 31 occupants were killed. ", "probable_cause": "It was determined that the accident was the consequence of a navigation error on part of the crew, causing the aircraft to be off track by 17 km to the north. The following factors were considered as contributing:\r\n- The crew was hastily fixed the day prior to the accident on a complexe routing,\r\n- In spite of this complexity, the operations of the company failed to join a navigator to the crew, either a mechanic, \r\n- Poor flight preparation, \r\n- Poor weather assessment, \r\n- The crew failed to make fix point after his departure from Sukhumi, \r\n- Absence of radio monitoring on part of the Sukhumi services,\r\n- Meteorologists failed to inform the pilots about the wind component and the weather conditions along the route,\r\n- Shortcomings were noted with ATC services as the person in charge to follow the plane was a trainee who was not authorized to work independently. It was noted that for 20 minutes (a period corresponding to a distance of 100 km), the crew did not receive any ATC messages about his position or flight path."}