{"url": "https://www.baaa-acro.com/crash/crash-bae-125-600a-las-vegas", "date": "Aug 17, 1999 at 1817 LT", "type": "BAe 125", "operator": "DP Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Salina - Las Vegas", "msn": "256044", "yom": 1974, "flight_number": null, "city": "Las Vegas-McCarran", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10000, "captain_hours_type": 275, "copilot_hours": 5300, "copilot_hours_type": 700, "aircraft_hours": 5753, "circumstances": "The pilot landed with the landing gear in the retracted position, when both the main and auxiliary hydraulic systems failed to extend the gear. The airplane caught fire as it skidded down the runway. The left inboard main tire had blown on takeoff and a 30-inch section of tread was loose. Black marks were along the length of the landing gear strut and up into the wheel well directly above the left inboard wheel. The normal and emergency hydraulic systems both connect to a common valve body on the landing gear actuator. This valve body also had black marks on it. A gap of 0.035 inch was measured between the valve body and actuator. When either the normal or auxiliary hydraulic system was pressurized, red fluid leaked from this gap. Examination revealed that one of two bolts holding the hydraulic control valve in place had fractured and separated. The fractured bolt experienced a shear load that was oriented along the longitudinal axis of the actuator in a plane consistent with impact forces from the flapping tire tread section.. Separation of only one bolt allowed the control valve to twist about the remaining bolt in response to the load along the actuator's longitudinal axis. This led to a loss of clamping force on that side of the actuator. Hydraulic line pressure lifted the control valve, which resulted in rupture of an o-ring that sealed the hydraulic fluid passage. 14 CFR 25.739 describes the requirement for protection of equipment in wheel wheels from the effects of tire debris. The revision of this regulation in effect at the time the airplane's type design was approved by the FAA requires that equipment and systems essential to safe operation of the airplane that is located in wheel wells must be protected by shields or other means from the damaging effects of a loose tire tread, unless it is shown that a loose tire tread cannot cause damage. Examination of the airplane and the FAA approved production drawings disclosed that no shields were installed to protect the hydraulic system components in the wheel well.", "probable_cause": "The complete failure of all hydraulic systems due to the effects of a main gear tire disintegration on takeoff. Also causal was the manufacturer's inadequate design of the wheel wells, which did not comply with applicable certification regulations, and the FAA's failure to ensure that the airplane's design complied with standards mandated in certification regulations."}