{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-28-kardla-2-killed", "date": "Nov 23, 2001 at 1835 LT", "type": "PZL-Mielec AN-28", "operator": "Enimex.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tallinn - Kärdla", "msn": "1AJ003-03", "yom": 1986, "flight_number": "ENI1007", "city": "Kärdla", "zone": "Hiiumaa", "country": "Estonia", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 14, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 9840, "captain_hours_type": 192, "copilot_hours": 472, "copilot_hours_type": 106, "aircraft_hours": 1690, "circumstances": "En route from Tallinn to Kärdla, at an altitude of 6,000 feet, the crew obtained the last weather bulletin for Kärdla Airport. The actual conditions were as follow: wind 020° at 24 knots, visibility 8,000 metres, snow, overcast 1,200 feet, broken 600 feet, temperature 0°, dewpoint 0°, QNH 1001, braking action is good, runway in use 32. One minute later, the crew was cleared to descend to 1,400 feet and reported this altitude at a distance of 11 km from the airport. The airplane continued on a heading of 240° towards the OZ NDB beacon, which was the Final Approach Fix (FAF) located about 4 km from the runway threshold. The crew continued the descent and initiated a slow turn towards the runway some 2,5 km short of the FAF. The aircraft descended into trees some 1,500 metres short of runway threshold and crashed in a wooded area. Two passengers were killed and 15 other occupants were injured, some seriously. The aircraft was totally destroyed. ", "probable_cause": "The accident was the consequence of an incorrect assessment of the situation by the commander of the aircraft during the approach, which resulted in errors in the piloting techniques, expressed in:\r\n- Transition from intense icing conditions to active descent with a transition from the originally planned instrument approach to a visual approach;\r\n- Failure to take into account the possibility of complex meteorological conditions in preparation for the approach and during the approach - the crew did not consider the possibility of going around or returning to the point of departure;\r\n- Maintaining an unjustified low airspeed and high vertical descent speed during an approach with poor altitude control;\r\nAssociated factors were:\r\n- Difficult weather conditions due to severe icing conditions;\r\n- Reassessment by the aircraft commander of his knowledge and experience in controlling the An-28 aircraft in adverse weather conditions;\r\n- Failure to comply with the requirements of the Airplane Flight Manual of the An-28 aircraft for the operation of aircraft systems and crew resource management;\r\n- Failure to comply with the Airplane Flight Manual in terms of timely termination of the approach and transition to climb;\r\n- The copilot, taking into account the large flying experience of the aircraft commander and overestimating his flight and navigation skills, behaved passively and did not provide him with adequate assistance in difficult conditions during the approach;\r\n- Transition from an instrument approach to a visual approach without ATC clearance;\r\n- The lack of 32 visual assessment of the angle of the descent trajectory (PAPI system) on the runway."}