{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-altoona-3-killed", "date": "Jun 10, 1998 at 1304 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Mountain Aerostar", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Altoona – Syracuse", "msn": "61-0736-8063360", "yom": 1980, "flight_number": null, "city": "Altoona-Blair County", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1100, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after the airplane took off, a witness about 1 mile from the airport observed the airplane about 150 feet above the ground in a left turn, before it disappeared into the clouds. A witness across from where the airplane crashed stated he was in his shed when he heard the sound of an airplane overhead. When the sound faded and returned, like the airplane had circled above the  shed, he stepped outside and looked for the airplane. He saw the airplane exit the clouds in a near vertical position and impact the ground. He described the engine noise as loud and smooth. The airplane impacted in a field about 3/4 miles from the departure airport and was consumed by a post crash fire. Streaks of oil were observed on the leading edge of the right horizontal stabilizer extending to its upper and lower surfaces. Disassembly of both engines did not reveal any pre-impact mechanical malfunctions. A weather observation taken after the accident reported included a visibility of 2 miles with light drizzle and mist, and the ceiling was 400 foot overcast. Witnesses described the weather at the accident site as '...pretty foggy,' and worse than the conditions reported at the airport. ", "probable_cause": "The pilot's failure to maintain airspeed due to spatial disorientation, which resulted in an inadvertent stall and subsequent collision with terrain. A factor in the accident was the low ceiling. "}