{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-749a-79-33-constellation-singapore-33-killed", "date": "Mar 13, 1954 at 1434 LT", "type": "Lockheed L-749 Constellation", "operator": "BOAC-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sydney – Darwin – Jakarta – Singapore – Karachi – Beirut – Rome – London", "msn": "2554", "yom": 1947, "flight_number": null, "city": "Singapore-Kallang", "zone": "Singapore", "country": "Singapore", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 2, "pax_on_board": 31, "pax_fatalities": 31, "other_fatalities": 0, "total_fatalities": 33, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Jakarta, the crew started the descent to Singapore-Kallang in good weather conditions. On final approach to runway 06, the four engine aircraft christened 'Belfast' was too low and hit a sea wall, bounced and landed 80 yards past the runway threshold. On touchdown, the right main gear collapsed, the airplane veered off runway to the right, lost its right wing and came to rest in flames upside down. Seven crew members were injured while 33 other occupants, including all 31 passengers, were killed. ", "probable_cause": "The cause of the accident, i. e. the touchdown off the runway was attributed to the approach of the aircraft. While certain eye-witnesses describe the approach as normal, it was not normal relative to maintaining a steady glide path and rate of descent. The various rates of descent could be considered to be within normal bounds for a Constellation aircraft, but their general pattern was neither normal nor, having regard to the sea wall hazard, desirable. The extent to which the captain's original decision to land short on such a runway as 06 was an error can only be judged in relation to the wide range of expert pilot opinion as to what is a safe first point of touchdown. The fact that his first point of touchdown came back closer to the threshold markings than he originally intended can probably be attributed to a degree of tiredness of which he may or may not have been aware. "}