{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-28-dk-belem-6-killed", "date": "Dec 1, 1955 at 0657 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Cruzeiro-do-Sul-11", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Belém – Barreiras", "msn": "15845/32593", "yom": 1945, "flight_number": null, "city": "Belém", "zone": "Pará", "country": "Brazil", "region": "South America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off at 0657LT from Belém Airport, carrying 4 crew and 2 passengers, and had climbed to approximately 100 to 250 metres when the pilot noted signs of malfunctioning in the left engine. A violent stall and loss of power in this engine followed although the propeller continued to revolve. No emergency message was sent and the pilot did not press the feathering control. However, the rest of the emergency procedure appears to have been carried out or to have been in progress at the time of the crash. The hydraulic pump was off and this had the effect of stopping the retraction of the undercarriage half-way. The aerodynamic resistance of the semi-retracted undercarriage prevented the aircraft from maintaining altitude, carrying it down to 20 or 30 metres above the tree tops, possibly without this being noticed. There is reason to believe that the pilot was in the act of switching the fuel selector from one tank to the other when the left wing tip hit a tree breaking off 2.5 metres of the wing and half the aileron. The aircraft swerved 20 degrees to the left and nosed-up violently, The right engine at this time was on full power. The aircraft stalled and hit the ground 200 metres farther on. Explosion of the fuel tanks and fire followed. All six occupants were killed. ", "probable_cause": "Failure of the front bearing of the propeller shaft originated a process which led to disconnection of the reduction gear and left propeller and causing sudden stoppage of the left engine."}