{"url": "https://www.baaa-acro.com/crash/ground-accident-embraer-emb-120rt-brasilia-manaus", "date": "Aug 13, 2002 at 1225 LT", "type": "Embraer EMB-120 Brasília", "operator": "Rico", "flight_phase": "Taxiing", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Humaitá – Manaus", "msn": "120-004", "yom": 1986, "flight_number": "RLE4847", "city": "Manaus-Eduardo Gomes", "zone": "Amazonas", "country": "Brazil", "region": "South America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 22, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13474, "captain_hours_type": 518, "copilot_hours": 4110, "copilot_hours_type": 3660, "aircraft_hours": 26756, "circumstances": "Following an uneventful flight from Humaitá, the crew completed the landing at Manaus-Eduardo Gomes Airport. After taxi, the crew was approaching the apron when he feathered the propellers and applied the brakes as they wanted to stop the aircraft. There was no deceleration despite both crew applied brakes. The copilot suggested to use reverse thrust but this was not possible as the propellers were already feathered. Out of control, the aircraft  struck a brick building, damaging the left engine, and the right landing gear fell into a drainage ditch, approximately one meter deep. All 25 occupants evacuated safely while the aircraft was damaged beyond repair. ", "probable_cause": "The following factors were identified:\r\n- The crew did not have sufficient training to enable the desired assertiveness for the correct use of aircraft resources, which would probably have prevented the accident, since, instead of applying the emergency brake, they applied reverse with the feathered props, contrary to the procedure provided for in the Aircraft Manual.\r\n- The maintenance services were not efficient, as they did not comply with the Aircraft Maintenance Manual in relation to the dimensional adjustment of the Hub Cap Drive Clips' drive clips, and the Service Bulletin incorporated stickers to the outer doors of the main landing gear, as a reminder to the mechanic to check the clearances.\r\n- The copilot failed to apply the reverse pitch on the propellers as they were feathered, and at that moment the emergency brake should be commanded to brake the aircraft.\r\n- The company failed to adequately check the execution of the actions provided for in the Aircraft Maintenance Manual regarding the 'Antiskid' system and to verify the application of all service bulletins issued by the manufacturer.\n"}