{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-134a-rijeka-78-killed", "date": "May 23, 1971 at 2000 LT", "type": "Tupolev TU-134", "operator": "Aviogenex.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "London-Gatwick – Rijeka", "msn": "1 35 12 05", "yom": 1971, "flight_number": "JJ130", "city": "Rijeka", "zone": "Primorje-Gorski Kotar", "country": "Croatia", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 3, "pax_on_board": 76, "pax_fatalities": 75, "other_fatalities": 0, "total_fatalities": 78, "captain_hours": 9230, "captain_hours_type": 138, "copilot_hours": 2563, "copilot_hours_type": 899, "aircraft_hours": 111, "circumstances": "The aircraft departed London-Gatwick Airport on a charter flight (JJ130) to Rijeka, Croatia, carrying 76 British tourists and a crew of seven. While approaching runway 14 at Rijeka Airport, the crew encountered very bad weather conditions with cumulonimbus, heavy rain falls and turbulences. As the aircraft passed through the area, it was carried upwards and rolled to the right. The aircraft was now above the ILS glide slope. Some 800 meters short of the runway, at a height of 60 meters,  the crew decided to continue the approach. Power was reduced and the angle of descent increased to 10°. The aircraft struck the runway surface with its right main gear at a speed of 260 km/h with 4 g deceleration force. On impact, the right wing was torn off, the airplane slid for about 760 meters and came to rest upside down, in flames. Three crew members and 75 passengers were killed. Brand new, the aircraft was totally destroyed. ", "probable_cause": "It is considered that the probable main cause of the accident was a heavy landing on the right leg of the main landing gear, emphasised by an irregular position of the wheels and 0.7% slope up of the runway at the point of touchdown. The Commission consider that the described deviation from the flight technique in itself, did not cause the crash of the aircraft, but that loading which resulted from the conditions under which the landing was performed made a greater contribution to the crash. However, non-adequate handling of controls of the aircraft and engines could be explained only by false perceptions (illusions) of the crew concerning the aircraft position in respect to the runway. The last minute of the flight was analysed on the basis of: \r\n- Flight recorder oscillogram,\r\n- Results obtained during the investigation on the flight on board of the same type of aircraft,\r\n- Study of aerodynamic characteristics and stability of TU-134A - analysis of meteorological situation,\r\n- Analysis of crew members' statement.\r\nAccording to the opinion of the Commission this was an exceptional and complex case of many unfavourable circumstances which resulted in this catastrophe."}