{"url": "https://www.baaa-acro.com/crash/crash-gippsaero-ga8-airvan-umea-9-killed", "date": "Jul 14, 2019 at 1408 LT", "type": "GippsAero GA8 Airvan", "operator": "Skydive%20Umea", "flight_phase": "Flight", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Umeå - Umeå", "msn": "GA8-TC320-12-178", "yom": 2012, "flight_number": null, "city": "Umeå", "zone": "Västerbotten", "country": "Sweden", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 217, "captain_hours_type": 12, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1212, "circumstances": "The purpose of the flight was to drop eight parachutists from flight level 130 (an altitude of 13,000 feet, approximately 4,000 metres). The load sheet that the pilot received did not contain any information about the individual weights of the parachutists or the total mass of the load. The pilot could thus not, with any help from the load sheet, check or make his own calculation of mass and balance before the flight. The aeroplane was approaching the airport and, at 14:05 hrs, the pilot requested permission to drop the parachutists slightly higher because of clouds. The airspeed was decreasing in conjunction with the aeroplane’s approach to the airport. Just over a kilometre from the airport where the jump point was located, the aeroplane suddenly changed direction to the left and began descending rapidly in almost the opposite direction. The aeroplane then travelled just under one kilometre at the same time as it descended 1,500 metres, which is a dive angle of over 45 degrees. The aeroplane broke up in the air as both the airspeed and the g-forces exceeded the permitted values for the aeroplane. From an altitude of 2,000 metres, the aeroplane fell almost vertically with a descent velocity of around 60 m/s. The fact that no one was able to get out and save themselves using their parachute was probably due to the g-forces and the rotations that occurred. All those on board remained in the aeroplane and died immediately upon impact.", "probable_cause": "The control of the aeroplane was probably lost due to low airspeed and that the aeroplane was unstable as a result of a tail-heavy aeroplane in combination with the weather conditions, and a heavy workload in relation to the knowledge and experience of the pilot. Limited experience and knowledge of flying without visual references and changes to the centre of gravity in the aeroplane have probably led to it being impossible to regain control of the aeroplane.\r\nThe following factors are deemed to be probable causes of the accident:\r\n- The lack of a safe system for risk analyses and operational support, including data for making decisions concerning flights, termination or replanning of commenced flights.\r\n- The lack of a standardised practical and theoretical training programme with approval of a qualified instructor.\r\n- The lack of a safe system for determining centre of gravity prior to and in conjunction with parachuting jumps."}