{"url": "https://www.baaa-acro.com/crash/crash-spectrum-fj33-spanish-fork-2-killed", "date": "Jul 25, 2006 at 1606 LT", "type": "Spectrum FJ33", "operator": "Spectrum", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Spanish Fork - Spanish Fork", "msn": "01", "yom": 2006, "flight_number": null, "city": "Spanish Fork", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2300, "captain_hours_type": 22, "copilot_hours": 3100, "copilot_hours_type": 16, "aircraft_hours": 44, "circumstances": "The proto-type experimental light jet airplane was departing on a local maintenance test flight. Witnesses reported that the airplane entered a right roll almost immediately after liftoff. The roll continued to about 90 degrees right wing down at which point the right wingtip impacted the ground. During examination of the wreckage, the aileron control system was found connected such that the airplane rolled in the opposite direction to that commanded in the cockpit. The maintenance performed on the airplane before the accident flight included removal of the main landing gear (MLG) in order to stiffen the MLG struts. Interviews with the mechanics who performed the maintenance revealed that during re-installation and system testing of the MLG, it was discovered that the changes to the MLG struts impacted the Vbracket holding the aileron control system's upper torque tube. The V-bracket was removed and a redesigned V-bracket was installed in its place. This work required the disconnection of a portion of the aileron control system, including the removal of the aft upper torque tube bell crank from the torque tube. The mechanic who reinstalled the aft upper torque tube bell crank was under the incorrect assumption that there was only one way to install the bell crank on the torque tube. However, there are actually two positions in which the bell crank could be installed. The incorrect installation is accomplished by rotating the bell crank 180° about the axis of the torque tube and flipping it front to back, and this is the way the bell crank was found installed. With the bell crank installed incorrectly and the rest of the system installed as designed, there is binding in the system. This binding was noticed on the accident airplane during the inspection after initial installation. However, the mechanic did not recognize that the bell crank was improperly installed on the torque tube. Instead of fixing the problem by removing and correctly reinstalling the bell crank, he fixed the problem by disconnecting the necessary tie rods and rotating the upper torque tube so that the arm of the bell crank pointed up and to the left. This action reversed the movement of the ailerons. According to all of the personnel interviewed, there was no maintenance documentation to instruct mechanics how to perform the work since this was a proof-of-concept airplane. None of the mechanics who performed the  work could recall if the position of the ailerons in relation to the position of the control stick was checked. Such a position check, if it had been performed by either the mechanics after the maintenance or by the flight crew during the preflight checks, would assuredly have indicated that the system was installed incorrectly.", "probable_cause": "Incorrect installation by company maintenance personnel of the aft upper torque tube bell crank resulting in roll control that was opposite to that commanded in the cockpit. Contributing factors were the lack of maintenance documentation detailing the installation of the bell crank, the installing mechanic's incorrect assumption that the bell crank could only be installed in one position, and the failure of maintenance personnel and the flight crew to check the position of the control stick relative to the ailerons after the maintenance and during the preflight checks."}