{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47-dl-near-wadi-halfa", "date": "Oct 12, 1948", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Mercury%20Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Desert", "schedule": "Paris – Wadi Halfa – Khartoum – Johannesburg", "msn": "9145", "yom": 1943, "flight_number": null, "city": "Wadi Halfa", "zone": "Northern (الشمالية)", "country": "Sudan", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 21, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after takeoff from Wadi Halfa, a fire erupted in the cockpit. The crew was unable to extinguish the fire so the captain was forced to attempt an emergency landing in a desert area located few km from the airport. The aircraft written off while all 26 occupants escaped uninjured. ", "probable_cause": "The opinion was formed that the fire started in the left hand side of the pilot's compartment because of an electric short in the extension lamp, producing sufficient heat to ignite propeller deicing fluid, which, in the absence of evidence to the contrary, the Committee was of opinion must have leaked from the tank behind the Commander's seat. On available evidence, the crew made all possible efforts to extinguish the fire, but the effectiveness of their actions was nullified by the restricted area of operations and the inaccessibility of the seat of the fire. In view of the direct evidence of a blue flame at the time of the conflagration, there would appear to have been a high percentage of methyl spirits in the deicing fluid. This is confirmed by tests made of deicing fluid taken from other aircraft serviced by the same maintenance organisation which did not conform with specification An-F-13."}