{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-turbo-beaver-near-clearwater", "date": "Sep 22, 2000 at 1320 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Seair%20Seaplanes", "flight_phase": "Flight", "flight_type": "Geographical / Geophysical / Scientific", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Clearwater - Clearwater", "msn": "1673", "yom": 1967, "flight_number": null, "city": "Clearwater", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5000, "captain_hours_type": 900, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The de Havilland DHC-2T Beaver floatplane, serial number 1673TB43, was engaged in aerial application of fish fry to several lakes near Clearwater, British Columbia. The pilot and one other person were on board. The aircraft took off from Clearwater at about 1230 Pacific daylight time (PDT) to begin a planned series of drops to nearby lakes. The aircraft had dropped fish in four lakes before proceeding to Broken Hook Lake.When the aircraft was on approach to the northwestern end of Broken Hook Lake, the pilot reportedly advanced the power lever, but the engine did not respond. At this time, the aircraft was about 100 feet above ground level and struck several treetops. Within seconds, the aircraft descended, struck the terrain, and crashed into trees. The two occupants were seriously injured, and the aircraft was destroyed. There was no fire. The accident occurred at 1320 PDT.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The pilot did not avoid the trees that obstructed his immediate flight path on descent to the lake.\r\n2. The damage to the aircraft from the tree-strike seriously compromised the pilot's ability to control the aircraft, to the point where continued flight was impossible.\r\n3. The pilot and the passenger suffered serious injuries. It is highly likely that proper use of a passenger restraint system would have lessened the injuries to both persons.\r\nFindings as to Risk:\r\n1. Canadian regulations regarding the use of seats and seat restraint systems are not sufficiently clear about high-risk, aerial work operations, such as aerial application.\r\n2. Transport Canada was not advised of the fish-dropping operations and was unaware that the passenger in the cabin was unrestrained during high-risk operations.\r\n3. Canadian regulations do not require specific training in aerial application techniques, such as fish-dropping.\r\n4. The installation of the fish-hopper equipment constituted an aircraft modification, which had not been approved by Transport Canada.\r\nOther Findings:\r\n1. The operator did not maintain a proper logbook."}