{"url": "https://www.baaa-acro.com/crash/ground-explosion-lockheed-c-141a-lm-starlifter-mcchord-afb-3-killed", "date": "Sep 7, 1966", "type": "Lockheed C-141 Starlifter", "operator": "United%20States%20Air%20Force", "flight_phase": "Parking", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "6133", "yom": 1965, "flight_number": null, "city": "McChord AFB", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 0, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 3, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 7 September, 1966, 65-0281 was the first C-141 destroyed. It blew up while simultaneous hazardous maintenance procedures were being performed. Three maintenance members were killed in an explosion of the Right Extended Range tank. The Wing at McChord had recently converted to the StarLifter. The first aircraft had arrived on 9 August 1966. This aircraft, 65-0281, was the third C-141 to be stationed at McChord, and had arrived on base just a week before, on 29 August, 1966. The maintenance teams had minimal practical experience with the new airplane. It was having multiple maintenance difficulties. The Right Extended Range Tank feel gage was erratic, and the AC \"Power On\" Light was inop. Two electricians were in the cockpit working on the \"Power On\" Light. A Maintenance Team Chief was also in the cockpit with three trainees. In addition, he was supervising a maintenance team on another aircraft. The Assistant Team Chief had started de-fueling the Right Extended Range Tank to prepare it for troubleshooting. The other fuel tanks were full. Two additional technicians arrived to work on the fuel gage before the de-fueling was complete. One of the electrical technicians connected testing equipment to the fuel tank but failed to ground it. The other technician plugged an extension cord into the external 115V AC receptacle of the APU. The live extension cord apparently came in contact with the case of the test equipment. Electricity flowed through the case, up the cables into the tank. Due to a short in the coaxial shielding a spark was created within the nearly empty tank. The right wing exploded. The Assistant Team Chief standing under the wing, and the technician on the wing were killed almost immediately. One of the technicians in the cockpit was badly burned while exiting the right troop door into a burning pool of JP-4. He died a few days later. The others on the aircraft received only minor injuries. \r\nSource:\r\nhttp://www.c141heaven.info/dotcom/65/pic_65_0281.php", "probable_cause": null}