{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-340-13-near-dexter", "date": "Jan 19, 1955 at 1625 LT", "type": "Convair CV-340", "operator": "United-Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Newark – Allentown – Youngstown – Akron – Cleveland – Chicago – Moline – Iowa City – Des Moines – Omaha – Lincoln", "msn": "180", "yom": 1954, "flight_number": "UA329", "city": "Dexter", "zone": "Iowa", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 36, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7578, "captain_hours_type": 750, "copilot_hours": 2123, "copilot_hours_type": 1147, "aircraft_hours": 1502, "circumstances": "Flight 329 departed Des Moines on a VFR (Visual Flight Reed) night plan at 1608 for Omaha, Nebraska. The gross weight of the aircraft was 45,215 pounds 1,685 pounds less than the allowable 46,900 pounds. According to company records, the load was properly distributed with respect to the canter of gravity of the aircraft. The climb to 5,000 feet was uneventful but at that altitude the crew noticed vibration and a slight fore-and-aft movement of the control column. The climb was continued to 6,000 feet, where the aircraft was leveled off and power was reduced. As the vibration was still present at this time, the captain attempted to dampen it by engaging the autopilot; however, this was unsuccessful and it was immediately disengaged. The first officer next lowered the flaps, first to 5 degrees and then to 15 degrees, without any noticeable effect. The “Fasten Seat Belt\" sign was turned on and the captain told the first officer to advise the company of their difficulty via radio. About this time a sudden failure in the control system was felt and it was with extreme difficulty that any semblance of elevator control was maintained. The first officer again tried lowering the flaps, this time to the 24-degree position, but as this did not help to maintain control he returned them to the 15-degree position, where it was found the most favorable results were attained. Accordingly, the first officer transmitted \"Mayday” (distress call) on the radio and said that they were attempting to return to Des Moines but were experiencing control trouble. The buffeting became so severe it was then necessary for the copilot to help the can hold the control column. However, the buffeting lessened and the captain advised the first officer to depressurize the aircraft and tell the stewardess to prepare the passengers for an emergency landing. This was done. By that time the aircraft had descended below 3,000 feet. Both throttles were retarded in turn to see if the trouble could possibly be caused by one of the engines. This also proved to no avail. The vibration built up to high level and suddenly another failure in the control system was felt and the air-plane went into a steep climb. As it seemed that a stall was imminent, the captain quickly moved the propellers to a high r. p. m. and pushed the throttles forward until about 50 inches of manifold pressure was seen on the gauges. The airplane then nosed over and began to dive at a very steep angle. During this rapid descent the captain reduced power and headed toward open country to his right. When the aircraft reached 500 feet above the ground the captain was successful in flaring the aircraft and it struck the ground in a flat attitude. All occupants were quickly deplaned as soon as the aircraft stopped.", "probable_cause": "The Board determines that the probable cause of this accident was a series of omissions made by maintenance personnel during a scheduled inspection which resulted in the release of the aircraft in an unairworthy condition and an almost complete loss of elevator control during flight. The following findings were reported: \r\n- During a routine maintenance inspection of the aircraft an explanation was not written on the non-routine job card that the bolt had been removed and replaced finger-tight pending the arrival of a new bolt,\r\n- Final inspection of the servo tab system failed to disclose its unairworthy condition and the aircraft was released for service,\r\n- Vibration backed off an unsafetied not in the servo tab system resulting in a sequence of structural failures that ended in almost complete loss of control of the aircraft elevators."}