{"url": "https://www.baaa-acro.com/crash/ground-fire-douglas-dc-3c-san-juan", "date": "Apr 26, 2009 at 0428 LT", "type": "Douglas DC-3", "operator": "Four%20Star%20Air%20Cargo", "flight_phase": "Taxiing", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Juan - Charlotte Amalie", "msn": "10267", "yom": 1943, "flight_number": null, "city": "San Juan-Luis Muñoz Marín (Isla Verde)", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 50233, "captain_hours_type": 7000, "copilot_hours": 957, "copilot_hours_type": 204, "aircraft_hours": 19952, "circumstances": "During taxi to a runway, the instrument panel and cockpit floor erupted in flames. Examination of the wreckage revealed that the majority of the wires contained inside the main junction box had very little damage except for two wires that had insulation missing. The damage appeared to be associated with the routing of the two wires. Both wires were connected to the battery relay and ran through wires in and around the exposed terminal studs. Heat damage was noted on the insulation of wires and other components that were in contact with the exposed wires. The wires ran from the battery relay to the forward section of the cockpit, where the fire started. Due to the fire damage that consumed the cockpit, the examination was unable to determine what system the wires were associated with. Further examination revealed that the fuel pressure was a direct indicating system. Fuel traveled directly to the instruments in the cockpit via rigid aluminum lines routed on the right lower side of the fuselage, where more severe fire damage was noted. Review of maintenance records did not reveal any evidence of the fuel pressure indicating system lines and hoses having ever been replaced; however, they were only required to be replaced on an as-needed basis. The electrical system, instrument lines, and hoses through the nose compartment were required to be inspected on a Phase D inspection; the airplane's last Phase D inspection was completed about 9 months prior to the accident and the airplane had accrued 313.1 hours of operation since that inspection.\n", "probable_cause": "Worn electrical wires and a fuel pressure indicating system hose, which resulted in a ground fire during taxi.\n"}