{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-251b-agana", "date": "Aug 19, 2005 at 1418 LT", "type": "Boeing 747-200", "operator": "Northwest%20Airlines2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tokyo - Agana", "msn": "21709", "yom": 1979, "flight_number": "NW074", "city": "Agana-Antonio Borja Won Pat", "zone": "All Guam Island", "country": "Guam Island", "region": "Asia", "crew_on_board": 16, "crew_fatalities": 0, "pax_on_board": 324, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7850, "captain_hours_type": 7850, "copilot_hours": 9100, "copilot_hours_type": 8695, "aircraft_hours": 95270, "circumstances": "During the initial approach, the red GEAR annunciator light above the gear lever illuminated, and the landing gear warning horn sounded after the gear handle was selected down and the flaps were selected to 25 degrees. During the go-around, the captain asked the second officer (SO), \"what do you have for the gear lights?\" The SO responded, \"four here.\" When all gear are down and locked on the Boeing 747-200, the landing gear indication module located on the SO’s instrument panel has five green lights: one nose gear light above four main landing gear lights. The crew then read through the \"Red Gear Light Remains On (After Gear Extension)\" emergency/abnormal procedure from the cockpit operations manual to troubleshoot the problem. Although the checklist twice presented in boldface type that five lights must be present for the gear to be considered down and locked, the crew did not verbalize the phrase either time. The captain did not directly request a count, and the SO did not verbally confirm, the number of gear down annunciator lights that were illuminated; instead, the flight crew made only general comments regarding the gear, such as \"all gear,\" \"all green,\" or \"got 'em all.\" Because the crew believed that all of the gear annunciator lights were illuminated, they considered all gear down and locked and decided not to recycle the landing gear or attempt to extend any of the gear via the alternate systems before attempting a second approach. During all communications with air traffic control, the flight crew did not specify the nature of the problem that they were troubleshooting. Although the checklist did not authorize a low flyby, if the flight crewmembers had verbalized that they had a gear warning, the controller most likely would have been able to notify the crew of the nose gear position before the point at which a go-around was no longer safe. Multiple gear cycles were conducted after the accident, and the nose gear extended each time with all nose gear door and downlock indications correctly displayed on the landing gear indication module. Post accident examination of the nose gear door actuator found that one of the two lock keys was installed 180 degrees backward. Although this improper configuration could prevent proper extension of the nose gear, the actuator had been installed on the accident airplane since 2001 after the actuator was overhauled by the operator. No anomalies were found with the landing gear indication module, the nose gear-operated door sequence valve, and the nose/body landing gear selector valve.", "probable_cause": "The flight crews' failure to verify that the number of landing gear annunciations on the second officer’s panel was consistent with the number specified in the abnormal/emergency procedures checklist, which led to a landing with the nose gear retracted."}