{"url": "https://www.baaa-acro.com/crash/crash-cessna-208-caravan-675-addenbroke-island-4-killed", "date": "Jul 26, 2019 at 1104 LT", "type": "Cessna 208A Caravan", "operator": "Seair%20Seaplanes", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": null, "msn": "208-0501", "yom": 2008, "flight_number": null, "city": "Addenbroke Island", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 8500, "captain_hours_type": 504, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4576, "circumstances": "Seair Seaplanes (Seair) was contracted by a remote fishing lodge on the central coast of British Columbia (BC) (Figure 1) to provide seasonal transport of guests and supplies between Vancouver International Water Aerodrome (CAM9), BC, and the lodge, which is located about 66 nautical miles (NM) north-northwest of Port Hardy Airport (CYZT), BC, and about 29 NM southeast of Bella Bella (Campbell Island) Airport (CBBC), BC. On 26 July 2019, the occurrence pilot arrived at Seair’s CAM9 base at approximately 0630. Over the next hour, the pilot completed a daily inspection of the Cessna 208 Caravan aircraft (registration C-GURL, serial number 20800501), added 300 L of fuel to the aircraft, and began flight planning activities, which included gathering and interpreting weather information. On the morning of the occurrence, 4 Seair visual flight rules (VFR) flights were scheduled to fly to the central coast of BC, all on Caravan aircraft: C-GURL (the occurrence aircraft) was to depart CAM9 at 0730, C-GSAS at 0745, C-FLAC at 0800, and C-GUUS at 0900. The first 3 flights were direct flights to the fishing lodge, while the 4th flight had an intermediate stop at the Campbell River Water Aerodrome (CAE3), BC, to pick up passengers before heading to a research institute located approximately 4 NM southwest of the fishing lodge. Because of poor weather conditions in the central coast region, however, all of the flights were delayed. After the crews referred to weather cameras along the central coast region, the flights began to depart, but in a different order than originally scheduled. It is not uncommon for the order of departure to change when groups of aircraft are going to the same general location. One of Seair’s senior operational staff (operations manager) departed CAM9 at 0850 aboard C-FLAC. C-GUUS, bound for the research institute, departed CAM9 next at 0906, and then the occurrence aircraft departed at 0932 (Table 1). The pilot originally scheduled to fly C-GSAS declined the flight. This pilot had recently upgraded to the Caravan, had never flown to this destination before, and was concerned about the weather at the destination. When Seair’s chief pilot returned to CAM9 at 0953 after a series of scheduled flights on a different type of aircraft, he assumed the last remaining flight to the lodge and C-GSAS departed CAM9 at 1024.After departing the Vancouver terminal control area, the occurrence aircraft climbed to 4500 feet above sea level (ASL) and remained at this altitude until 1023, when a slow descent was initiated. The aircraft levelled off at approximately 1300 feet ASL at 1044, when it was approximately 18 NM northeast of Port Hardy Airport (CYZT), BC, and 57 NM southeast of the destination. At 1050, the occurrence aircraft slowly descended again as the flight continued northbound. During this descent, the aircraft’s flaps were extended to the 10° position. At this point, the occurrence aircraft was 37 NM south-southeast of the fishing lodge. The aircraft continued to descend until it reached an altitude of approximately 330 feet ASL, at 1056. By this point, the occurrence aircraft was being operated along the coastline, but over the ocean.  C-FLAC departed from the fishing lodge at 1056 on the return flight to CAM9. C-FLAC flew into the Fitz Hugh Sound and proceeded southbound along the western shoreline. At approximately 1100, it flew through an area of heavy rain where visibility was reduced to about 1 statute mile (SM). C-FLAC descended to about 170 feet ASL and maintained this altitude for the next 5 minutes before climbing to about 300 feet ASL. As the southbound C-FLAC entered Fitz Hugh Sound from the north at Hecate Island, the occurrence aircraft entered Fitz Hugh Sound from the south, near the southern tip of Calvert Island. The occurrence aircraft then changed course from the western to the eastern shoreline, and descended again to about 230 feet ASL (Figure 2), while maintaining an airspeed of approximately 125 knots. The 2 aircraft established 2-way radio contact. The pilot of C-FLAC indicated that Addenbroke Island was visible when he flew past it, and described the weather conditions in the Fitz Hugh Sound to the occurrence pilot as heavy rain showers and visibility of approximately 1 SM around Kelpie Point. The occurrence pilot then indicated that he would maintain a course along the eastern shoreline of the sound. At 1103, the 2 aircraft were separated by 2 NM and passed each other on reciprocal tracks, approximately 4 NM south of the accident site. The occurrence aircraft maintained a consistent track and altitude for the next 54 seconds, then slowly began a 25° change in track to the west (0.35 NM from the Addenbroke Island shoreline). Seven seconds after the turn started (0.12 NM from the island’s shoreline), the aircraft entered a shallow climb averaging 665 fpm. At 1104:55, the occurrence aircraft struck trees on Addenbroke Island at an altitude of approximately 490 feet ASL, at an airspeed of 114 knots, and in a relatively straight and level attitude. The aircraft then continued through the heavily forested hillside for approximately 450 feet, coming to rest at an elevation of 425 feet ASL, 9.7 NM east-southeast of the destination fishing lodge. The pilot and three passengers were killed and five other occupants were injured, four seriously. \n", "probable_cause": "Findings as to causes and contributing factors:\r\nThese are conditions, acts or safety deficiencies that were found to have caused or contributed to this occurrence.\r\n1. The flight departed Vancouver International Water Aerodrome even though the reported and forecast weather conditions in the vicinity of the destination were below visual flight rules minima; the decision to depart may have been influenced by the group dynamics of Seair pilots and senior staff at the flight planning stage.\r\n2. The pilot continued flight in reduced visibility, without recognizing the proximity to terrain, and subsequently impacted the rising terrain of Addenbroke Island.\r\n3. The configuration of the visual and aural alerting systems and the colouration ambiguity in the primary flight display of the Garmin G1000 was ineffective at alerting the occurrence pilot to the rising terrain ahead.\r\n4. The occurrence pilot’s attention, vigilance, and general cognitive function were most likely influenced to some degree by fatigue.\n\r\nFindings as to risk:\r\nThese are conditions, unsafe acts or safety deficiencies that were found not to be a factor in this occurrence but could have adverse consequences in future occurrences.\r\n1. If pilots do not receive specialized training that addresses the hazards of their flying environment, there is a risk that they will not be proficient in the specific skills necessary to maintain safety margins.\r\n2. If aircraft are operated in excess of the maximum allowable take-off weight, there is a risk of performance degradation and adverse flight characteristics, which could jeopardize the safety of the flight.\r\n3. If cargo is stowed in front of emergency exits, there is a risk that egress may be impeded in an emergency situation, potentially increasing evacuation time and risk of injuries.\r\n4. If air operators do not employ a methodology to accurately assess threats inherent to daily operations, then there is a risk that unsafe practices will become routine and operators will be unaware of the increased risk.\r\n5. If air operators that have flight data monitoring capabilities do not actively monitor their flight operations, they may not be able to identify drift toward unsafe practices that increase the risk to flight crew and passengers.\r\n6. If Transport Canada’s oversight of operators is insufficient, there is a risk that air operators will be non-compliant with regulations or drift toward unsafe practices, thereby reducing safety margins.\r\n7. If Transport Canada does not make safety management systems mandatory, and does not assess and monitor these systems, there is an increased risk that companies will be unable to effectively identify and mitigate the hazards associated within their operations.\n\r\nOther findings:\r\nThese items could enhance safety, resolve an issue of controversy, or provide a data point for future safety studies.\r\n1. The pilot was actively using a cellphone throughout the flight; the operator provided no guidance or limitations on approved cellphone use in flight."}