{"url": "https://www.baaa-acro.com/crash/crash-atr72-600-taipei-43-killed", "date": "Feb 4, 2015 at 1054 LT", "type": "ATR72-600", "operator": "TransAsia%20Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Taipei - Kinmen", "msn": "1141", "yom": 2014, "flight_number": "GE235", "city": "Taipei-Songshan", "zone": "Taipei City (臺北市)", "country": "Taiwan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 4, "pax_on_board": 53, "pax_fatalities": 39, "other_fatalities": 0, "total_fatalities": 43, "captain_hours": 4914, "captain_hours_type": 3151, "copilot_hours": 6922, "copilot_hours_type": 5687, "aircraft_hours": 1627, "circumstances": "The twin turboprop took off from runway 10 at 1052LT. While climbing to a height of 1,200 feet, the crew sent a mayday message, stating that an engine flamed out. Shortly later, the aircraft stalled and banked left up to an angle of 90° and hit the concrete barrier of a bridge crossing over the Keelung River. Out of control, the aircraft crashed into the river and was destroyed. It has been confirmed that 40 occupants were killed while 15 others were rescued. Three occupants remains missing. A taxi was hit on the bridge and its both occupants were also injured. According to the images available, it appears that the left engine was windmilling when the aircraft hit the bridge. First investigations reveals that the master warning activated during the initial climb when the left engine was throttled back. Shortly later, the right engine auto-feathered and the stall alarm sounded.", "probable_cause": "The accident was the result of many contributing factors which culminated in a stall-induced loss of control. During the initial climb after takeoff, an intermittent discontinuity in engine number 2’s auto feather unit (AFU) may have caused the automatic take off power control system  (ATPCS) sequence which resulted in the uncommanded autofeather of engine number 2 propellers. Following the uncommanded autofeather of engine number 2 propellers, the flight crew did not perform the documented abnormal and emergency procedures to identify the failure and implement the required corrective actions. This led the pilot flying (PF) to retard power of the operative engine number 1 and  shut down it ultimately. The loss of thrust during the initial climb and inappropriate flight control inputs by the PF generated a series of stall warnings, including activation of the stick shaker and pusher. After the engine number 1 was shut down, the loss of power from both engines was not detected and corrected by the crew in time to restart engine number 1. The crew did not respond to the stall warnings in a timely and effective manner. The aircraft stalled and continued descent during the attempted engine restart. The remaining altitude and time to impact were not enough to successfully restart the engine and recover the aircraft.\r\nThe following findings related to probable causes were noted:\r\nAn intermittent signal discontinuity between the auto feather unit (AFU) number 2 and the torque sensor may have caused the automatic take off power control system (ATPCS):\r\n- Not being armed steadily during takeoff roll,\r\n- Being activated during initial climb which resulted in a complete ATPCS sequence including the engine number 2 autofeathering.\r\nThe available evidence indicated the intermittent discontinuity between torque sensor and auto feather unit (AFU) number 2 was probably caused by the compromised soldering joints inside the AFU number 2. \r\nThe flight crew did not reject the take off when the automatic take off power control system ARM pushbutton did not light during the initial stages of the take off roll. \r\nTransAsia did not have a clear documented company policy with associated instructions, procedures, and notices to crew for ATR72-600 operations communicating the requirement to reject the take off if the automatic take off power control system did not arm.\r\nFollowing the uncommanded autofeather of engine number 2, the flight crew failed to perform the documented failure identification procedure before executing any actions. That resulted in pilot flying’s confusion regarding the identification and nature of the actual propulsion system malfunction and he reduced power on the operative engine number 1.\r\nThe flight crew’s non-compliance with TransAsia Airways ATR72-600 standard operating procedures - Abnormal and Emergency Procedures for an engine flame out at take off resulted in the pilot flying reducing power on and then shutting down the wrong engine.\r\nThe loss of engine power during the initial climb and inappropriate flight control inputs by the pilot flying generated a series of stall warnings, including activation of the stick pusher. The crew did not respond to the stall warnings in a timely and effective manner.\r\nThe loss of power from both engines was not detected and corrected by the crew in time to restart an engine. The aircraft stalled during the attempted restart at an altitude from which the aircraft could not recover from loss of control.\r\nFlight crew coordination, communication, and threat and error management (TEM) were less than effective, and compromised the safety of the flight. Both operating crew members failed to obtain relevant data from each other regarding the status of both engines at different points in the occurrence sequence. The pilot flying did not appropriately respond to or integrate input from the pilot monitoring.\r\nThe engine manufacturer attempted to control intermittent continuity failures of the auto feather unit (AFU) by introducing a recommended inspection service bulletin at 12,000 flight hours to address aging issues. The two AFU failures at 1,624 flight hours and 1,206 flight hours show that causes of intermittent continuity failures of the AFU were not only related to aging but also to other previously undiscovered issues and that the inspection service bulletin implemented by the engine manufacturer to address this issue before the occurrence was not sufficiently effective. The engine manufacturer has issued a modification addressing the specific finding of this investigation. This new modification is currently implemented in all new production engines, and another service bulletin is available for retrofit.\r\nPilot flying’s decision to disconnect the autopilot shortly after the first master warning increased the pilot flying’s subsequent workload and reduced his capacity to assess and cope with the emergency situation.\r\nThe omission of the required pre-take off briefing meant that the crew were not as mentally prepared as they could have been for the propulsion system malfunction they encountered after takeoff."}