{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46f-1-cu-commando-near-cedar-falls-2-killed", "date": "Apr 23, 1953 at 0055 LT", "type": "Curtiss C-46 Commando", "operator": "American Air Transport", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "Yes", "site": "Mountains", "schedule": "Columbia – Cheyenne – Seattle", "msn": "22498", "yom": 1945, "flight_number": null, "city": "Cedar Falls", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6790, "captain_hours_type": 2538, "copilot_hours": 348, "copilot_hours_type": 88, "aircraft_hours": 7477, "circumstances": "American Air Transport, Inc., an irregular air carrier, was operating this flight as a ferry operation from Columbia. South Carolina to Seattle, Washington for the purpose of later conducting a Civil Air Movement of military personnel from Seattle. Captain John W. Schroeder and First Officer James P. Gilbert flew the aircraft from Columbia to Cheyenne, Wyoming, departing Columbia at 1305 EST, April 22, 1953, and arriving at Cheyenne at 1835 MST of the same date. The flight from Columbia to Cheyenne was completed without incident. A second crew, Captain Maurice A. Booska, Chief Pilot of the company, and First Officer Donald F. Dwelley, rode as passengers to Cheyenne, at which point they relieved Schroeder and Gilbert, who continued with the flight as passengers. The aircraft was serviced at Cheyenne, making the total fuel load 1,200 gallons of 100-octane gasoline. Captain Booska received a weather briefing at the U. S. Weather Bureau Airport Station; following this, he filed a VFR flight plan to Boise, Idaho via Airways Green 3 and Red 1. Departing from Cheyenne at 2043 MST (delayed owing to repair of the left navigation light), the flight proceeded uneventfully. The pilot made position reports over Rawlins and Rock Springs. Wyoming; Malad City and Burley, Idaho; and three minutes east of Boise at 2252. In all position reports except Rock Springs and Malad City (where no altitude was given) the flight altitude was reported as 12,000 feet. Upon request from the flight, Boise radio furnished the Boeing Field-Seattle forecast and the 2228 en route weather between Boise and Seattle. The pilot then filed an IFR flight plan to destination, and the following clearance was transmitted by Boise radio at 2254: \"ATC CLEARS N1693M TO THE SEATTLE RANGE VIA RED 1, BLUE 32 BLUE 12, GREEN 2. MAINTAIN 12,000 FEET.\" The clearance was acknowledged by the pilot. Later position reports indicated that the flight was at 12,000 feet when over Baker. Oregon at 2331 and Pendleton, Oregon at 2353. Near Yakima, Washington the flight was cleared for descent to 10,000 feet and upon reporting over Yakima at 0026, it was further cleared to descend to and maintain 8,000 feet. Ellensburg, Washington radio received a position report at 0037 that the flight passed over Ellensburg 2 at 0034, 8,000 feet. IFR. Ellensburg radio transmitted the Boeing Field 2330 weather to the flight at 0040; the pilot acknowledged and advised that he would contact Seattle Air Route Traffic Control Center on 120.3 megacycles when over Easton, Washington. The pilot contacted Seattle Center at 0047 and reported over Easton at 8,000 feet, inbound to Boeing Field. Seattle Center thereupon issued the following clearance: \"NECTAR ONE SIX NINE THREE METRO YOU ARE CLEARED TO CROSS HOBART AT 8,000 SEATTLE AT OR ABOVE 4,000 MAINTAIN 4,000 NO DELAY EXPECTED CONTACT SEATTLE APPROACH CONTROL OVER HOBART FOR FURTHER CLEARANCE OVER.\" The controller in the Seattle Center who was handling this flight was at his control board, about four feet from a loud-speaker installed on top of the unit. The read-back of the clearance by the pilot of N1693M seemed to the controller to be as follows: \"ROGER, CLEARED TO - - - -(distinct pause involving a lapse of three or four seconds) CROSS THERE FOUR THOUSAND OR ABOVE THE RANGE STATION, AH, FOUR THOUSAND, REPORT HOBART TO YOU.\" A correction. \"NEGATIVE REPORT HOBART TO SEATTLE APPROACH CONTROL,\" was then immediately transmitted. The pilot replied, \"HOBART TO SEATTLE APPROACH CONTROL ROGER.\" These contacts were made at approximately 0048. There was no record of further transmission from the aircraft. When the pilot failed to report over Hobart, and the flight became overdue at Seattle, controllers in the Seattle Center and Boeing Field tower attempted to contact the flight, but without success. Search and rescue activities were then instituted. The accident scene was found the next day and the two survivors were rescued.", "probable_cause": "The Board determines that the probable cause of this accident was the pilot's misunderstanding of the clearance, failure to check en route altitude against available charts, and descent below prescribed minimum en route altitude. The fact that the controller did not detect the first of two errors made by the pilot was a contributing factor. The following findings were pointed out:\r\n- The read-back of the clearance by the pilot was in error on two points - crossing altitude for Hobart, and the erroneous understanding that he was to report to the Seattle Center over Hobart; the controller detected only the latter error,\r\n- The aircraft descended below the minimum altitude of 8,000 feet and crashed near the crest of a mountain at 4,000 feet MSL,\r\n- Both pilots probably experienced impaired efficiency due to oxygen want and fatigue,\r\n- There was no malfunction or failure of any component of the aircraft."}