{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-2-115e-croydon-15-killed", "date": "Dec 9, 1936 at 1030 LT", "type": "Douglas DC-2", "operator": "KLM-21", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "City", "schedule": "Croydon – Amsterdam – Berlin", "msn": "1358", "yom": 1935, "flight_number": null, "city": "Croydon", "zone": "Surrey", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 13, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airport of Croydon was shrouded in fog with visibility fluctuating at around 50 metres and all aircraft were operating under so-called \"QBI\" (a Q code denoting that all operations have to be performed under instrument flight rules) conditions. Crews were following a white line laid out approximately East-West on the grass surface of Croydon's landing area during their take-off runs (a normal procedure at several airports in the United Kingdom at the time, that had been in use at Croydon since 1931). A number of departures by this method had already been made that day by the time the KLM DC-2 took off, including a Swissair DC-2 about 25 minutes beforehand. The KLM DC-2 named 'Lijster' started its takeoff run along the white line but after about 200 yards (183 m), it veered off the line to the left and on becoming airborne headed south towards rising ground instead of in the normal westerly direction. After flying over the southern boundary of the airport, the aircraft hit the chimney of a house on Hillcrest Road, Purley, then crashed into an empty house on the opposite side of the street. The aircraft, the house and an adjoining house (also empty at the time) were destroyed in the crash and ensuing fire. One passenger and the stewardess survived while all 15 other occupants were killed, among them Admiral Salomon Arvid Achates Lindmann, former Prime Minister of Sweden, and Juan de la Cierva y Cordoniu, the inventor of the Autogyro in 1923 and the vertical takeoff in 1934. At this time, this accident was considered as the worst air crash in the UK in terms of the number of fatalities.\r\nCrew:\r\nLudwig Hautzmayer, pilot,\r\nPieter Cornelis van Bemmel Valentijn, radio operator,\r\nJaap Verkerk, flight engineer, \r\nHilde Bongertman, stewardess.", "probable_cause": "It was determined by the UK Accidents Investigation Branch that the pilot had failed to maintain directional control of the aircraft, and also demonstrated ‘poor judgement’ in not throttling down the engines and abandoning the take-off after it had departed the runway."}