{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-65-80-queen-air-north-myrtle-beach", "date": "Jun 5, 1998 at 1531 LT", "type": "Beechcraft 80 Queen Air", "operator": "Two Engines and a Prayer", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Malone - North Myrtle Beach", "msn": "LD-58", "yom": 1963, "flight_number": null, "city": "North Myrtle Beach", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 535, "captain_hours_type": 48, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6758, "circumstances": "After a 4.7 hour flight, while turning onto final, the airplane landed short. The pilot did not mention engine problems during a police interview. He subsequently told an FAA Inspector that the left engine failed, then later, that the right engine failed. He told the Safety Board that both engines failed. Adequate fuel was confirmed. The previous day, the right engine failed approaching another airport. The pilot performed a single-engine go-around, with landing gear and flaps down. He refused assistance and performed his own maintenance. He cleaned the fuel filters of both engines. During a ground runup, the right engine was hard to start, and required a high fuel flow to remain running. After the pilot re-cleaned the right fuel filter the engine ran fine. The flight was uneventful until the accident. Post-flight examination revealed all propeller blades bent back 90 degrees, with significant chordwise scoring on one blade per engine. The left engine fuel filter was relatively clean, with some brown residue which contained ferrous material. The right engine fuel filter was heavily coated with a white residue which contained aluminum, and brown material which contained ferrous material. The pilot received his multi-engine rating on April 22, 1998. ", "probable_cause": "The pilot's failure to follow emergency procedures, and his failure to maintain control of the airplane after a loss of power from one engine. Factors include fuel filter blockage, inadequate maintenance, and the pilot's lack of experience in multi-engine airplanes. "}