{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dash-7-102-bronnoysund-36-killed", "date": "May 6, 1988 at 2030 LT", "type": "De Havilland DHC-7 (Dash-7)", "operator": "Wideroe_1", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Trondheim – Namsos – Brønnøysund – Sandnessjøen – Bodø", "msn": "28", "yom": 1980, "flight_number": "WF710", "city": "Brønnøysund", "zone": "Nordland", "country": "Norway", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 33, "pax_fatalities": 33, "other_fatalities": 0, "total_fatalities": 36, "captain_hours": 19886, "captain_hours_type": 2849, "copilot_hours": 6458, "copilot_hours_type": 9, "aircraft_hours": 16934, "circumstances": "Widerøe flight 710 took off from Trondheim (TRD), Norway, at 19:23 local time on a domestic light to Namsos (OSY), Brønnøysund (BNN), Sandnessjøen (SSJ) and Bodø Airport (BOO).\r\nThe flight to Namsos was uneventful. The aircraft took off from Namsos at 20:07 and contacted Trondheim ACC six minutes later, stating that they were climbing from FL70 to FL90. At 20:20 the crew began their descent for Brønnøysund and switched frequencies to Brønnøysund AFIS. Weather reported at Brønnøysund was: wind 220°/05 kts, visibility 9 km, 3/8 stratus at 600 feet and 6/8 at 1000 feet, temperature +6 C, QNH 1022 MB. The crew executed a VOR/DME approach to Brønnøysund's runway 04, followed by a circle for landing on runway 22. The crew left the prescribed altitude 4 NM early. The aircraft descended until it flew into the Torghatten hillside at 560 feet. A retired police officer reported in July 2013 that a passenger had taken a mobile phone on board. The police officer disembarked the plane at Namsos, a stop-over and reported that the passenger with the mobile phone was seated in the cockpits jump-seat. After the accident, he reported this fact to the Joint Rescue Coordination Centre (JRCC). After reading the investigation report during the 25th anniversary of the accident, he noticed that there was no mention of the mobile phone.\r\nNMT 450 network-based mobiles at the time were fitted with a 15-watt transmitter and a powerful battery which could lead to disruption in electronic equipment. The Norwegian AIB conducted an investigation to determine if electronic interference from the mobile phone might have affected the flight instruments. The AIB concluded that there was no evidence to support the theory that there was any kind of interference.", "probable_cause": "The cause of the accident was that the last part of the approach was started about 4 NM too soon. The aircraft therefore flew below the safe terrain clearance altitude and crashed into rising terrain. The Board cannot indicate any certain reason why the approach started so early."}