{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-near-conchas", "date": "Aug 30, 1996 at 1830 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Kiowa Service", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Albuquerque - Alva", "msn": "421B-0014", "yom": 1970, "flight_number": null, "city": "Conchas", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2934, "captain_hours_type": 67, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2700, "circumstances": "At 1615, the pilot called FSS for a weather briefing and to file an IFR flight plan. He was told that there was thunderstorm activity, which was building in intensity, extending from Raton, New Mexico, to Garden City, Kansas, with some scattered activity in the Oklahoma panhandle. The briefer further reported that the thunderstorm activity was moving east, southeast. The pilot checked in with Albuquerque Center at 1750 during his departure climb to 21,000 feet. At 1755, convective SIGMET 70C was issued for isolated severe thunderstorms located 10 miles north, northeast, of Las Vegas, New Mexico. FAA Order 7110.65J, Air Traffic Control, section 2-6-2, states that 'controllers shall advise pilots of hazardous weather that may impact operations within 150 NM of their sector or area of jurisdiction.' SIGMET 70C was not given to the pilot by the center controller. Radio contact was lost at 1823. The pilot reported that the airplane was in VMC, approaching precipitation, when they encountered hail and the pilot's windshield was broken out which resulted in the airplane's depressurization. ", "probable_cause": "The pilot's inadvertent flight into hail which shattered the pilot's windshield and resulted in his incapacitation due to hypoxia. "}