{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-5-do-skymaster-jeddah", "date": "Sep 25, 1959 at 1405 LT", "type": "Douglas C-54 Skymaster", "operator": "Saudia", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jeddah – Riyadh", "msn": "7474", "yom": 1944, "flight_number": null, "city": "Jeddah", "zone": "Makkah l-Mukarramah (مكة المكرمة)", "country": "Saudi Arabia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 67, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Saudia DC-4 plane took off from Jeddah for a flight to Riyadh. Immediately following lift-off, the aircraft climbed at an abnormal high rate. The flight crew were not able to push the control column forward, so full forward trim and a power reduction were used to avert a stall. The aircraft stalled however and descended at almost a 90° angle. Power was reapplied and the controls were pulled back, effecting a recovery at a very low altitude. The DC-4 then began to climb again, approaching another stall. This time the stall was averted by reducing power and a left turn. A return to the runway was impossible so a forced belly landing was carried out near the airport. The airplane was damaged beyond repair while all 72 occupants were evacuated safely. ", "probable_cause": "The flight mechanic failed to place the gust lock in the fully secured position to unlock the controls prior to takeoff, and the spring holding the fairing on the tail skid was incorrectly attached to the elevator control lock mechanism. The spring tension caused the elevator gust lock to lock the elevator from down travel when the gust lock was not in the fully secured control unlock position. A contributing factor was that neither the captain nor the flight mechanic checked visually or manually to see that the gust lock was in the secured position to unlock the control prior to takeoff."}