{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-26a-marquise-marthas-vineyard-4-killed", "date": "Oct 6, 2000 at 2158 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Keith Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Trenton – Martha’s Vineyard", "msn": "358", "yom": 1977, "flight_number": null, "city": "Martha’s Vineyard", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1946, "captain_hours_type": 253, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5400, "circumstances": "The pilot departed on a night cross-country flight without obtaining a weather briefing or flight plan. Arriving in the area of the destination airport, the weather was reported as, 2 statute miles of visibility and mist; overcast cloud layer at 100 feet. The pilot requested an instrument flight rules clearance from the approach controller, and was vectored and cleared for the ILS 24 approach. The clearance included an altitude restriction of 1,500 feet msl, until the airplane was established on the localizer. As the pilot contacted the control tower, the tower controller issued a low altitude alert to the pilot. The pilot replied that he was climbing and the tower controller cleared the pilot to land, which the pilot acknowledged. No further pertinent radio transmissions were received from the airplane. The airplane came to rest in a wooded area about 3/4-mile from the runway threshold, and about 50 feet right of the extended centerline. Review of the approach plate for the ILS 24 approach revealed that the minimum glide slope intercept altitude at the beginning of the final approach segment on the precision approach was 1,500 feet. The glide slope altitude at the final approach fix for the non-precision approach, which was located about 4 miles from the approach end of the runway, was 1,407 feet. The glide slope altitude at the middle marker, which was located about 0.6 miles from the approach end of the runway, was 299 feet. Review of radar data revealed that the airplane was observed at 700 feet, about 4 miles from the airport, and at 300 feet, about 1.5 miles from the airport. The pilot had accumulated about 1,946 hours of total flight experience, with about 252 hours in make and model. The pilot had attended initial and recurrent training for the make and model airplane; however, did not complete the training. The pilot, aged 61, was Charles B. Yates, member of the New Jersey Senate, who was flying to Martha's Vineyard with his wife and two of his three children. ", "probable_cause": "The pilot's failure to follow instrument flight procedures resulting in a collision with a tree. A factor related to the accident was the low cloud ceiling."}