{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154b-2-norilsk-99-killed", "date": "Nov 16, 1981 at 1737 LT", "type": "Tupolev TU-154", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Krasnoyarsk - Norilsk", "msn": "81A480", "yom": 1981, "flight_number": "SU3603", "city": "Norilsk-Alykel", "zone": "Krasnoyarsk Krai", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 4, "pax_on_board": 160, "pax_fatalities": 95, "other_fatalities": 0, "total_fatalities": 99, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1889, "circumstances": "Following an uneventful flight from Krasnoyarsk, the crew started the descent to Norilsk-Alykel Airport. At an altitude of about 600 meters and a speed of 370 km/h, the undercarriage were lowered. At a distance of 19 km from the airport, at an altitude of 500 meters and a speed of 300 km/h, flaps were deployed to an angle of 28°. At this time, the crew calculated the landing speed at 265 km/h according to flight conditions and the total weight of the aircraft. Unfortunately, this calculation was wrong and the correct speed should be 270 km/h. On short final, the airplane descended below the glide and struck the ground at a speed of 261 km/h about 470 meters short of runway threshold. It slid for about 300 meters on an icy ground before coming to rest, bursting into flames. 68 occupants were injured while 99 others were killed, among them four crew members. The aircraft was destroyed. ", "probable_cause": "The accident resulted from a loss of longitudinal controllability on short final due to the combination of the following factors: \r\n- A significant reduction in the efficiency of the stabilizers after they were positioned beyond an angle of -20 °,\r\n- An automatic reduction of power on all three engine close to idle,\r\n- An aircraft with a forward center of gravity,\r\n- An insufficient approach speed, \r\n- An excessive rate of descent, \r\n- The late recognition by the crew of an emergency situation,\r\n- The failure of the crew to initiate a go-around procedure."}