{"url": "https://www.baaa-acro.com/crash/crash-vickers-745d-viscount-near-parrottsville-39-killed", "date": "Jul 9, 1964 at 1815 LT", "type": "Vickers Viscount", "operator": "United-Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Philadelphia – Washington DC – Knoxville – Huntsville", "msn": "103", "yom": 1955, "flight_number": "UA823", "city": "Parrottsville", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 35, "pax_fatalities": 35, "other_fatalities": 0, "total_fatalities": 39, "captain_hours": 15665, "captain_hours_type": 1700, "copilot_hours": 7715, "copilot_hours_type": 2100, "aircraft_hours": 23804, "circumstances": "A United Air Lines, Inc., Vickers Viscount 745D, N7405, Flight 823, crashed 2-1/4 rules northeast of Parrottsville Tennessee, at 1815 e.s.t., July 9, 1964. Thirty-four passengers and the four crew members died in the crash. One passenger died of injuries following a free fall from the aircraft before the crash. The aircraft was destroyed by fire and impact damage. Flight 823 was a regularly scheduled operation from Philadelphia, Pennsylvania, to Huntsville, Alabama, with en route stops at Washington, D. C., and Knoxville, Tennessee. The flight operated without any reported discrepancies or difficulties until approximately 1810 e.s.t., when it was observed flying at low altitude trailing smoke. The flight continued in a southwesterly direction and at a point approximately 1.6 nautical rules before the impact site, a passenger was seen falling from the aircraft, and a short time later a cabin window was seen falling. The aircraft was then observed going into a nose-high attitude, the left wing and the nose went down, and the aircraft dived into the ground, exploded, and burned.", "probable_cause": "The Board determines that the probable cause of this accident was an uncontrollable in-flight fire of undetermined origin, in the fuselage, which resulted in a loss of control of the aircraft."}