{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-wainwright-5-killed", "date": "Apr 10, 1997 at 2030 LT", "type": "Cessna 208B Grand Caravan", "operator": "Hageland-Aviation-Services-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Barrow - Wainwright", "msn": "208B-0455", "yom": 1995, "flight_number": "HAG502", "city": "Wainwright", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 3660, "captain_hours_type": 60, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1700, "circumstances": "The pilot had contacted the FSS 11 times on the day of the accident to obtain weather briefings. The conditions were below VFR minimums, which were required to conduct the passenger carrying commercial flight in a single-engine airplane. The conditions later improved and the pilot departed under a special VFR clearance. The pilot performed two approaches at the destination airport in IMC that were consistent with the two GPS approaches that were available there. Weather data and witnesses indicate that daylight conditions, low clouds and poor visibility prevailed, with cloud tops at 1,000 feet. After the second approach, the pilot radioed that he was heading back to the departure airport because he could not see the airport. No distress calls or unusual engine noises were heard. The airplane subsequently flew north of the airport and away from the departure airport at an altitude beneath the minimum radar coverage of 2,200 feet. It impacted the frozen Arctic Ocean in a right bank and at a 60-degree nose-down attitude about three miles away from the location of the pilot's last radio transmission. An examination of the airplane (before it sank through cracking ice) revealed no pre-impact mechanical malfunctions. An examination of the propeller revealed that it was under a power setting consistent with a maneuvering airspeed at the time of impact. An examination of the autopilot annunciator filament revealed that the autopilot was not engaged at impact. The airplane was nearly full of fuel and over its published maximum gross weight at impact. Small pieces of clear ice, about 1/4-inch thick, were found on portions of the tail surfaces. Interviews with operator employees and the pilot's wife revealed that the pilot may have felt pressure from himself and passengers to complete the flight. ", "probable_cause": "The pilot's intentional VFR flight into instrument meteorological conditions and his failure to maintain altitude/clearance from terrain. Factors contributing to the accident were the weather conditions. "}