{"url": "https://www.baaa-acro.com/crash/crash-cessna-414a-chancellor-yorba-linda-5-killed", "date": "Feb 3, 2019 at 1345 LT", "type": "Cessna 414 Chancellor", "operator": "KL Management", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Fullerton – Minden", "msn": "414A-0821", "yom": 1981, "flight_number": null, "city": "Yorba Linda", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 4, "total_fatalities": 5, "captain_hours": 10235, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9610, "circumstances": "The commercial pilot departed for a cross-country, personal flight with no flight plan filed. No evidence was found that the pilot received a preflight weather briefing; therefore, it could not be determined if he checked or received any weather information before or during the accident flight. Visual meteorological conditions existed at the departure airport; however, during the departure climb, the weather transitioned to instrument meteorological conditions (IMC) with precipitation, microburst, and rain showers over the accident area. During the takeoff clearance, the air traffic controller cautioned the pilot about deteriorating weather conditions about 4 miles east of the airport. Radar data showed that, about 5 1/2 minutes after takeoff, the airplane had climbed to about 7,800 ft above ground level before it started a rapid descending right turn and subsequently impacted the ground about 9.6 miles east of the departure airport. Recorded data from the airplane’s Appareo Stratus 2S (portable ADS-B receiver and attitude heading and reference system) revealed that, during the last 15 seconds of the flight, the airplane’s attitude changed erratically with the pitch angle fluctuating between 45° nose-down and 75°nose-up, and the bank angle fluctuating between 170° left and 150° right while descending from 5,500 to 500 ft above ground level, indicative of a loss of airplane control shortly after the airplane entered the clouds. Several witnesses located near the accident site reported seeing the airplane exit the clouds at a high descent rate, followed by airplane parts breaking off. One witness reported that he saw the airplane exit the overcast cloud layer with a nose down pitch of about 60°and remain in that attitude for about 4 to 5 seconds “before initiating a high-speed dive recovery,” at the bottom of which, the airplane began to roll right as the left horizontal stabilizer separated from the airplane, immediately followed by the remaining empennage. He added that the left wing then appeared to shear off near the left engine, followed by the wing igniting. An outdoor home security camera, located about 0.5 mile north-northwest of the accident location, captured the airplane exiting the clouds trailing black smoke and then igniting. Examination of the debris field, airplane component damage patterns, and the fracture surfaces of separated parts revealed that both wings and the one-piece horizontal stabilizer and elevators were separated from the empennage in flight due to overstress, which resulted from excessive air loads. Although the airplane was equipped with an autopilot, the erratic variations in heading and altitude during the last 15 seconds of the flight indicated that the pilot was likely hand-flying the airplane; therefore, he likely induced the excessive air loads while attempting to regain airplane control. Conditions conducive to the development of spatial orientation existed around the time of the in-flight breakup, including restricted visibility and the flight entering IMC. The flight track data was consistent with the known effects of spatial disorientation and a resultant loss of airplane control. Therefore, the pilot likely lost airplane control after inadvertently entering IMC due to spatial disorientation, which resulted in the exceedance of the airplane’s design stress limits and subsequent in-flight breakup. Contributing to accident was the pilot’s improper decision to conduct the flight under visual flight rules despite encountering IMC and continuing the flight when the conditions deteriorated. Toxicology testing on specimens from the pilot detected the presence of delta-9-tetrahydrocanninol (THC) in heart blood, which indicated that the pilot had used marijuana at some point before the flight. Although there is no direct relationship between postmortem blood levels and antemortem effects from THC, it does undergo postmortem redistribution. Therefore, the antemortem THC level was likely lower than detected postmortem level due to postmortem redistribution from use of marijuana days previously, and it is unlikely that the pilot’s use of marijuana contributed to his poor decision-making the day of the accident. The toxicology testing also detected 67 ng/mL of the sedating antihistamine diphenhydramine. Generally, diphenhydramine is expected to cause sedating effects between 25 to 1,120 ng/mL. However, diphenhydramine undergoes postmortem redistribution, and the postmortem heart blood level may increase by about three times. Therefore, the antemortem level of diphenhydramine was likely at or below the lowest level expected to cause significant effects, and thus it is unlikely that the pilot’s use of diphenhydramine contributed to the accident.", "probable_cause": "The pilot’s failure to maintain airplane control after entering instrument meteorological conditions (IMC) while climbing due to spatial disorientation, which resulted in the exceedance of the airplane’s design stress limits and subsequent in-flight break-up. Contributing to accident was the pilot's improper decision to conduct the flight under visual flight rules and to continue the flight when conditions deteriorated."}