{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-parker-1-killed", "date": "Aug 4, 2005 at 0206 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Flightline", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Salt Lake City - Denver", "msn": "1535", "yom": 1981, "flight_number": null, "city": "Parker", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4800, "captain_hours_type": 1200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12575, "circumstances": "The commercial pilot was executing a precision instrument approach at night in instrument meteorological conditions when the airplane collided with terrain about four miles short of the runway. A review of air traffic control communications and radar data revealed the pilot was vectored onto the final approach course but never got established on the glide slope. Instead, he made a controlled descent below the glide slope as he proceeded toward the airport. When the airplane was five miles from the airport, a tower controller received an aural low altitude alert generated by the Minimum Safe Altitude Warning (MSAW) system. The tower controller immediately notified the pilot of his low altitude, but the airplane collided with terrain within seconds. Examination of the instrument approach system and onboard flight navigation equipment revealed no pre-mishap anomalies. A review of the MSAW adaptation parameters revealed that the tower controller would only have received an aural alarm for aircraft operating within 5 nm of the airport. However, the frequency change from the approach controller to the tower controller occurred when the airplane was about 10.7 miles from the airport, leaving a 5.7 mile segment where both controllers could receive visual alerts, but only the approach controller received an aural alarm. A tower controller does not utilize a radar display as a primary resource for managing air traffic. In 2004, the FAA changed a policy, which eliminated an approach controller's responsibility to inform a tower controller of a low altitude alert if the tower had MSAW capability. The approach controller thought the MSAW alarm parameter was set 10 miles from the airport, and not the 5 miles that existed at the time of the accident. Subsequent investigation revealed, that The FAA had improperly informed controllers to ensure they understood the alarm parameters for control towers in their area of responsibility. This led the approach controller to conclude that the airplane was no longer her responsibility once she handed it over to the tower controller. Plus, the tone of the approach controller's aural MSAW alarm was not sufficient in properly alerting her of the low altitude alert.", "probable_cause": "The pilot’s failure to fly a stabilized instrument approach at night which resulted in controlled flight into terrain. Contributing factors were; the dark night, low clouds, the inadequate design and function of the airport facility’s Minimum Safe Altitude Warning System (MSAW), and the FAA’s inadequate procedure for updating information to ATC controllers."}