{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-trujillo", "date": "Nov 28, 2000 at 0625 LT", "type": "Swearingen SA227 Metro III", "operator": "Aero%20Condor", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lima - Trujillo", "msn": "AC-496", "yom": 1981, "flight_number": null, "city": "Trujillo", "zone": "La Libertad", "country": "Peru", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On November 28, 2000, at 0625 eastern standard time, a Fairchild SA227AC transport category airplane, N3107P, was substantially damaged while landing with an unsafe gear indication on the right main landing gear at the Trujillo International Airport, near Trujillo, Peru. The two commercial pilots aboard the cargo flight were not injured. The airplane was owned by Joda LLC, of Town and Country, Missouri, and was being operated as a cargo freighter by Aero Condor S.A., of Lima, Peru. Visual meteorological conditions prevailed for the cargo flight for which a VFR flight plan was filed. The scheduled cargo flight originated from the Lima International Airport, near Lima, Peru, approximately 0530. The operator reported that the flight crew had reported a complete loss of hydraulic power prior to initiating the approach. The flight crew was not able to extend the right main landing gear due to a leak in a hydraulic line in the right landing gear well. The runway was foamed and the crew performed an emergency landing with the other two landing gears extended. Examination of the airplane by the operator revealed structural damage to the right wing and the underside section of the tail section of the airplane. The right engine and the 4-propeller blades for the right engine were also damaged. Both pilots were uninjured. ", "probable_cause": null}