{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-216-java-sea-162-killed", "date": "Dec 28, 2014 at 0618 LT", "type": "Airbus A320", "operator": "Air-Asia-Indonesia", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Surabaya – Singapore", "msn": "3648", "yom": 2008, "flight_number": "QZ8501", "city": "Java Sea", "zone": "All Indonesia", "country": "Indonesia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 156, "pax_fatalities": 156, "other_fatalities": 0, "total_fatalities": 162, "captain_hours": 20537, "captain_hours_type": 4687, "copilot_hours": 2247, "copilot_hours_type": 1367, "aircraft_hours": 23039, "circumstances": "The aircraft left Surabaya-Juanda Airport at 0535LT and climbed to its assigned altitude of FL320 that he reached 19 minutes later. The crew contacted ATC to obtain the authorization to climb to FL380 and to divert to 310° due to bad weather conditions. At 0617, the radio contact was lost with the crew and a minute later, the transponder stopped when the aircraft disappeared from the radar screen. At this time, the aircraft was flying at the altitude of 36,300 feet and its speed was decreasing to 353 knots. It is believed the aircraft crashed some 80 nautical miles southeast off the Pulau Belitung Island, some 200 km from the Singapore Control Area. The Indonesian Company confirmed there were 156 Indonesian Citizens on board, three South Korean, one Malaysian, one Singapore and one French (the copilot) as well. At the time of the accident, the weather conditions were marginal with storm activity, rain falls and turbulence in the area between Pulau Belitung and Kalimantan. First debris were spotted by the Indonesian Navy some 48 hours later, about 150 NM east-south-east off the Pulau Belitung Island. About forty dead bodies were found up to December 30. The tail was recovered on January 10, 2015 and the black boxes were localized a day later. On January 12 and 13 respectively, the DFDR and the CVR were out of water and sent to Jakarta for analysis and investigations.", "probable_cause": "The cracking of a solder joint of both channel A and B resulted in loss of electrical continuity and led to RTLU (rudder travel limiter unit) failure. \r\nThe existing maintenance data analysis led to unresolved repetitive faults occurring with shorter intervals. The same fault occurred 4 times during the flight.\r\nThe flight crew action to the first 3 faults in accordance with the ECAM messages. Following the fourth fault, the FDR recorded different signatures that were similar to the FAC CB‟s being reset resulting in electrical interruption to the FAC‟s. \r\nThe electrical interruption to the FAC caused the autopilot to disengage and the flight control logic to change from Normal Law to Alternate Law, the rudder deflecting 2° to the left resulting the aircraft rolling up to 54° angle of bank. \r\nSubsequent flight crew action leading to inability to control the aircraft in the Alternate Law resulted in the aircraft departing from the normal flight envelope and entering prolonged stall condition that was beyond the capability of the flight crew to recover."}