{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-near-goiania", "date": "May 30, 2000 at 1620 LT", "type": "Beechcraft 90 King Air", "operator": "Government%20of%20Goias", "flight_phase": "Landing (descent or approach)", "flight_type": "Government", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Itapuranga - Goiânia", "msn": "LW-15", "yom": 1972, "flight_number": null, "city": "Goiânia", "zone": "Goiás", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5756, "captain_hours_type": 2000, "copilot_hours": 13000, "copilot_hours_type": 500, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed a private strip in Itapuranga on a flight to Goiânia, carrying seven passengers and two pilots. About 10 minutes after takeoff, while in cruising altitude, the captain informed ATC about the failure of the right engine. Because the flight was short (25 minutes in total), he decided to continue to Goiânia. Twelve minutes later, the left engine failed as well. The crew declared an emergency and as he was unable to reach Goiânia Airport, he attempted an emergency landing in a pasture. The aircraft crash landed 13 km short of runway 14 threshold. All nine occupants were rescued, among them seven were injured, three seriously. ", "probable_cause": "Both engines failed 12 minutes apart due to fuel exhaustion. The following contributing factors were identified:\r\n- Fuel tanks were empty, \r\n- The fuel quantity was insufficient to cover the requested flying distance,\r\n- Poor flight preparation and planning,\r\n- Complacency on part of the copilot, \r\n- Wrong decisions on part of the captain, \r\n- Failures in the organization of flights within the operations of the Government of the State of Goiás,\r\n- Miscalculations in fuel consumption.\r\n- Operating an airplane with faulty fuel gauges,\r\n- Failures in monitoring related to flight safety culture,\r\n- Poor crew resources management,\r\n- Poor crew coordination, \r\n- Lack of crew interactions."}