{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-301f-east-midlands", "date": "Jun 15, 2006 at 0502 LT", "type": "Boeing 737-300", "operator": "TNT%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Liège - Stansted", "msn": "23515/1355", "yom": 1987, "flight_number": "TAY325N", "city": "East Midlands", "zone": "Leicestershire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8325, "captain_hours_type": 4100, "copilot_hours": 1674, "copilot_hours_type": 1377, "aircraft_hours": 45832, "circumstances": "On a scheduled cargo flight from Liège Airport to London Stansted Airport the crew diverted to Nottingham East Midlands Airport due to unexpectedly poor weather conditions at Stansted. The weather conditions at EMA required a CAT IIIA approach and landing. On approach, at approximately 500 feet agl, the crew were passed a message by ATC advising them of a company request to divert to Liverpool Airport. The commander inadvertently disconnected both autopilots whilst attempting to reply to ATC. He then attempted to re-engage the autopilot in order to continue the approach. The aircraft diverged to the left of the runway centreline and developed a high rate of descent. The commander commenced a go-around but was too late to prevent the aircraft contacting the grass some 90 m to the left of the runway centreline. The aircraft became airborne again but, during contact with the ground, the right main landing gear had broken off. The crew subsequently made an emergency landing at Birmingham Airport (BHX).", "probable_cause": "Causal factors:\r\n1. ATC inappropriately transmitted a company R/T message when the aircraft was at a late stage of a CAT III automatic approach.\r\n2. The commander inadvertently disconnected the autopilots in attempting to respond to the R/T message. \r\n3. The crew did not make a decision to go-around when it was required after the disconnection of both autopilots below 500 ft during a CAT III approach.\r\n4. The commander lost situational awareness in the latter stages of the approach, following his inadvertent disconnection of the autopilots.\r\n5. The co-pilot did not call ‘go-around’ until after the aircraft had contacted the ground.\r\nContributory factors:\r\n1. The weather forecast gave no indication that mist and fog might occur.\r\n2. The commander re-engaged one of the autopilots during a CAT III approach, following the inadvertent disconnection of both autopilots at 400 feet aal.\r\n3. The training of the co-pilot was ineffective in respect of his understanding that he could call for a go-around during an approach."}