{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-grand-canyon-8-killed", "date": "Feb 13, 1995 at 1536 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Las%20Vegas%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Grand Canyon - Las Vegas", "msn": "31-7752121", "yom": 1977, "flight_number": "6G45", "city": "Grand Canyon-National Park", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 5086, "captain_hours_type": 480, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13367, "circumstances": "The charter flight was on a return tour trip after landing at the Grand Canyon National Park Airport. No fueling or maintenance was performed on the airplane while it sat on the ground for three hours. Shortly after takeoff from runway 21, the pilot transmitted that he had a problem and was declaring an emergency. He then stated '...I'm single engine right now....' The airplane was observed to be 100-200 feet above the terrain at the time. It continued flying for about 6 minutes, turning onto a crosswind, downwind, and then a right base leg for runway 21 before colliding with trees about 2.5 miles northeast of the airport. The airport is located in terrain that slopes upward from south to north and west to east. Winds were gusting to 29 knots. The density altitude was 6,870 feet. Examination of the suspect left engine did not reveal any evidence of failures or malfunctions. The investigation revealed deficiencies in the Federal Aviation Administration's oversight of the airline's maintenance program, and in the airline's extension of the time-in-service interval of the engines. The airline's AAIP does not require a maximum rated power check of the engines as required by the engine manufacturer's service instruction. In addition, the TBO of the engines had been extended from 1,800 to 2,400 hours. ", "probable_cause": "A loss of power on one engine for an undetermined reason(s), and the pilot's improper decision to return to the departure airport for landing which necessitated maneuvering over increasingly higher terrain. Factors in the accident were: the high gusting wind, the high density altitude, the rising terrain, and the reduced single-engine performance capability of the airplane under these conditions. "}