{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-chieftain-kalgoorlie-4-killed", "date": "Apr 30, 1981 at 1844 LT", "type": "Piper PA-31-310 Navajo", "operator": "Royal%20Flying%20Doctor%20Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jameson - Kalgoorlie", "msn": "31-7712056", "yom": 1977, "flight_number": null, "city": "Kalgoorlie", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 22655, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot acted as a relief pilot for the Eastern Goldfields Section of the Royal Flying Doctor Service based in Kalgoorlie. On 30 April 1981 he had been rostered as the duty pilot from 1100 hours to 1700 hours. He was advised by the chief pilot soon after 1100 hours that a flight to Jameson and return was required. The flight was planned to include a refuelling stop at Warburton en-route to Jameson. The pilot expressed concern that the flight might not be completed in daylight, but after discussing the problem with the chief pilot, it was concluded that the flight should return to Kalgoorlie about ten minutes before last light. The aircraft subsequently departed Kalgoorlie at 1221 hours, and the flight proceeded uneventfully. However, delays en-route and in refuelling resulted in the aircraft not departing Jameson until 1609 hours. Based on the flight plan time intervals, the expected arrival time at Kalgoorlie was 1844 hours which was an hour after last light. The pilot did not hold the necessary qualification allowing him to operate a multiengined aircraft at night, although he held such a rating for single-engined aircraft. He elected to proceed as planned, and declared the last section of the flight a Mercy Flight. At 1828 hours, when 55 km from Kalgoorlie, the pilot contacted Kalgoorlie Flight Service Unit and received details of the weather, as recorded thirty minutes earlier. This information included an observation of lightning to the west-south-west and a line of thunderstorms from north-west to south of the aerodrome. At 1840 hours, when about 13 km from Kalgoorlie he advised that he would use runway 28. No further communication was heard from the aircraft. Witnesses at Boulder, 4 km east of Kalgoorlie, subsequently reported that a severe squall entered the area shortly before the aircraft was seen turning on to final approach for the runway. The strong wind had generated dust clouds and the aircraft was seen to enter one of these, whilst executing a number of sudden attitude changes. It then collided with a mineshaft headframe. The left wing was torn from the aircraft which then crashed to the ground nearby. A passenger was seriously injured while four other occupants were killed.", "probable_cause": "There is insufficient evidence available to enable the cause of this accident to be determined. It is evident however, that the aircraft encountered severe turbulence at a low height during the approach for landing. No pre-existing defect or malfunction which could have contributed to the accident was found during the examination of the wreckage."}