{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-near-meekatharra-2-killed", "date": "Jan 26, 1990 at 0105 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Great Western Aviation", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Perth - Port Hedland", "msn": "746", "yom": 1979, "flight_number": null, "city": "Meekatharra", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 11030, "captain_hours_type": 51, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1902, "circumstances": "The aircraft had been chartered for a flight from Perth to Port Hedland. The pilot arrived at the aircraft at 2210 hours on 25 January, and after a short inspection of the aircraft, attended the CAA flight planning office for air traffic control and meteorology briefing. The briefing included information about a tropical cyclone off the NW coast of Australia and its potential effects on the proposed flight. After the flight plan was submitted, the pilot returned to the aircraft at 2315 hours as the loading was being completed, and conducted a preflight inspection of the aircraft and its load. The aircraft departed Perth at 2339 and commenced a climb towards Ballidu, the first turning point, over which it passed at 0003 hours. Subsequently, the aircraft passed over Mt Singleton at 0020, Mt Magnet at 0040 and Meekatharra at 0102 hours. After Ballidu, the aircraft climbed from FL170 to FL190 and climbed further to FL210 after Mt Magnet. While over Meekatharra, the passenger (also a licenced pilot) gave the position report. One minute later, the pilot radioed that the aircraft was out of control and descending. He called again 30 seconds later and advised that the aircraft was in ice and spinning down through 8,000 feet. No further communications were received from the aircraft. Both occupants were killed. ", "probable_cause": "The following findings were reported:\r\n- The pilot did not have recent experience in high-performance, high-altitude aircraft except for the 51.7 hours gained in the MU-2.\r\n- The pilot did not possess some of the experience levels and recency requirements placed on MU-2 pilots immediately after the accident by the CAA. \r\n- The pilot did not take sufficient account of the operational characteristics of this aircraft type. \r\n- The pilot's situational awareness was probably impaired during the flight, because of the combination of pre-existing cumulative fatigue, and insufficient sleep in the previous 42 hours. \r\n- The meteorological conditions were conducive to the formation of airframe icing on an aircraft flying in cloud along the flight planned route. \r\n- It is probable that control was lost as the aircraft banked to the left over Meekatharra, to change track towards Port Hedland. \r\n- The pilot reported that the aircraft was in ice during his last radio transmission. \r\n- The pilot was unable to recover from the spin before the aircraft hit the ground. "}