{"url": "https://www.baaa-acro.com/crash/crash-cessna-501-citation-isp-green-bay-1-killed", "date": "Apr 2, 2001 at 1628 LT", "type": "Cessna 501 Citation I", "operator": "Travelers Solution", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "No", "site": "City", "schedule": "Green Bay – Fort Myers", "msn": "501-0150", "yom": 1980, "flight_number": null, "city": "Green Bay", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4548, "captain_hours_type": 245, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5856, "circumstances": "At 1623:41, the pilot requested taxi clearance. The Green Bay (GRB) tower (ATCT) told the pilot to taxi to runway 18. At 1626:47 the pilot said that he was ready for takeoff. The ATCT local controller (LC) told the pilot, \"proceed on course, cleared for takeoff\". At 1627:33, radar showed the airplane began to accelerate down runway 18. At 1628:17 the LC told the pilot to contact departure control. The pilot responded, \"ah papa charlie we have a little problem here we're going to have to come back.\" The LC asked the pilot, \"what approach would you like?\" The pilot responded, \"like to keep the vis.\" At 1628:35, the LC asked the pilot, \"like the contact approach that what you're saying?\" There was no response from the pilot. At 1628:50, GRB radar showed the airplane on a heading of 091 degrees, at an altitude of 855 feet msl (160 feet agl), and at an airspeed of 206 knots. The airplane was 1.28 miles southeast of the airport radar. Radar contact with the airplane was lost at 1628:55. A witness to the accident said, \"It was snowing moderately at that time. The road was wet but not slippery. Crossing the intersection of Morning Glory Rd. & Main St., I noted a white private jet flying from the south. It was flying at approximately a 75-80 degree angle perpendicular to the ground with its left wing down & teetering slightly.\" The witness said, \"It then crossed Main Street with the lower wing tip approximately 20 to 30 feet above the power wires. The plane became more perpendicular to the ground at a 90 degree angle with the left wing down & (and) lost altitude crashing into the Morning Glory Dairy warehouse building.\" An examination of the airplane revealed no anomalies. At 1638, GRB weather was reported as ceilings of 200 feet broken, 800 feet overcast, visibility 1/2 statute mile with snow and fog, temperature 32 degrees F, dew point 32 degrees F, winds 120 degrees at 3 knots, and an altimeter setting of 29.99 inches Hg. Witnesses at the FBO said the pilot arrived to pick up the airplane after 1600. The pilot was briefed by the mechanic as he did his walk around inspection of the airplane. The pilot then\r\ngot into the airplane. The airplane was towed out and the tow bar removed. About two minutes later, the engines started. Less than five minutes after the engines started, the airplane taxied. The NTSB Audio Laboratory reviewed radio communications between ATCT and the pilot to determine from the speech evidence the pilot's level of psychological stress and workload. The examination indicated the pilot's speech characteristics were consistent with an increased stress/workload that might accompany a developing emergency. Referring to the pilot's final transmissions, \"His unusually long reaction time suggests that he was distracted by competing cockpit priorities and/or was having a difficult time determining his answer, while his fast speech and microphone keying provide further evidence of an urgency to return to other cockpit activities.\" The report states that the pilot's statements remained rational and showed good word choice and grammar. \"These factors, along with the relatively small change in fundamental frequency, suggest that the pilot did not reach an extreme level of stress.\" ", "probable_cause": "The pilot not maintaining aircraft control while maneuvering after takeoff and the pilot's inadequate preflight planning and preparation. Factors relating to the accident were the pilot's diverted attention while maneuvering after takeoff, the pilot's attempted VFR flight into instrument meteorological conditions, the pilot's visual lookout not being possible, the low ceiling, snow, and fog, the airplane's low altitude, and the building."}