{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-620-cheyenne-ii-near-big-bear-lake-7-killed", "date": "Feb 16, 1992 at 1635 LT", "type": "Piper PA-31 Cheyenne", "operator": "Andrew & Williamson Sales Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "San Diego - Big Bear", "msn": "31-8020051", "yom": 1980, "flight_number": null, "city": "Big Bear Lake", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 15000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilots had entered into an agreement with the 5 pax to fly them to a ski resort. The airplane owner stated that the pic, who was the company pilot, did not have permission to use the airplane, nor did the owner know the pax. The airport at the ski resort is located in mountainous terrain at 6,750 feet msl. There is no instrument approach. There is no record of any weather briefings. The airplane collided with terrain (Mt Clark) at about 6,580 feet msl approximately 7.5 miles southwest of the destination airport. Weather for the area was: mountains locally obscured 3,000 to 5,000 feet scattered to broken with tops to 9,000, and widely scattered visibilities below 3 miles with snow and rain showers. Examination of the wreckage and impact site revealed the aircraft collided with the brush and snow covered 45° slope in a level left turn. All seven occupants were killed. ", "probable_cause": "The pilot's poor judgement in continuing visual flight into instrument meteorological conditions, in mountainous terrain obscured by clouds. Factors in the accident were: the pilot's failure to obtain a preflight weather briefing, the weather conditions, and the high mountainous terrain."}