{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-mackenzie-lake-5-killed", "date": "Aug 13, 2001 at 1706 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Wahkash%20Contracting", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Campbell River - Mackenzie Sound", "msn": "257", "yom": 1952, "flight_number": null, "city": "Mackenzie Lake", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11325, "circumstances": "A de Havilland DHC-2 Beaver floatplane, C-GVHT (serial number 257), took off from Campbell River, British Columbia, at 1530 Pacific daylight time, with a pilot and four passengers on board. The aircraft was on a visual flight rules flight to a logging camp on Mackenzie Sound, 76 nautical miles northwest of Campbell River, and was scheduled to arrive at 1700. When the aircraft arrived over the Mackenzie logging camp, the pilot informed ground personnel by radio that he was overhead at 2800 feet, between cloud layers with no place to descend, and that because of unfavourable weather conditions, he was returning, presumably to Campbell River. The aircraft then flew to a clear area north of the camp and entered the Frederic Creek valley. When company ground personnel could not contact the aircraft by radio, they began a ground search, later followed by an aerial search. The searches were hampered by poor weather. The aircraft wreckage was found three days later, about four nautical miles northeast of the camp. The accident occurred at 1706 in daylight conditions. All occupants were fatally injured, and the aircraft was destroyed. The emergency locator transmitter was destroyed on impact and did not transmit a signal. No fire occurred.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The pilot abandoned his attempt to fly through the pass because of unsuitable weather conditions. He flew into a confined area that required him to manoeuvre the aircraft aggressively to avoid the rising terrain, causing the aircraft to stall.\r\n2. The aircraft weight exceeded the certificated MAUW, and the CG was outside the floatplane aft limit. The out-of-limit weight and balance aggravated aerodynamic stall and produced rapid and\r\nuncontrolled aircraft attitudes from which the pilot could not recover before striking the trees. \r\n3. Basic weight and balance of the aircraft was incorrectly recorded in several aircraft documents, leading to remarkable discrepancies in take-off weight and CG calculations. As a result, a pilot could not calculate an accurate weight and balance. In certain conditions, calculations erroneously showed that the aircraft was below maximum allowable gross weight.\r\nFindings as to Risk:\r\n1. The practice of using a non-standard passenger weight led to inaccurate take-off weight calculations and provided an estimated total passenger weight that was 185 pounds less than actual.\r\n2. Weight and balance calculations performed using inaccurate figures would not have revealed that the aircraft was overloaded until it was approximately 450 pounds beyond the maximum limit.\r\n3. Aircraft weight exceeded the maximum allowable gross weight, and the CG was outside the aft CG limit. This weight and balance combination placed the aircraft outside the manufacturer’s\r\noriginal design envelope, to where slow speed and stall handling characteristics are neither proven nor certificated.\r\n4. Cargo was not secured by the available cargo restraint and might have shifted during aircraft manoeuvring. Such cargo movement would have exacerbated the effects of the existing aft CG and likely increased the level of injury to the occupants. \r\nOther Findings:\r\n1. The pilot chose to fly above cloud in accordance with the visual flight rules and could not descend through the cloud at his intended landing site.\r\n2. The Alaska cargo door installation increases the volume of the cargo compartment. The installation is thereby conducive to larger loads being stowed farther aft and possible overloading of the cargo compartment.\r\n3. The DHC-2 Beaver is not equipped with an aural or visual stall warning system, nor is it required by regulation. Warning of an impending stall is dependent on juddering or some other aerodynamic indication."}