{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-near-wainwright-5-killed", "date": "Mar 28, 2008 at 0811 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "AD%20Williams%20Engineering", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Edmonton – Winnipeg", "msn": "46-22092", "yom": 1989, "flight_number": null, "city": "Wainwright", "zone": "Alberta", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The privately operated Piper PA-46-350P Jetprop DLX (registration C-FKKH, serial number 4622092) had departed from Edmonton, Alberta, at about 0733 mountain daylight time en route to Winnipeg, Manitoba, on an instrument flight rules flight plan. Shortly after the aircraft levelled off at its cleared altitude of flight level (FL) 270, the aircraft was observed on radar climbing through FL 274. When contacted by the controller, the pilot reported autopilot and gyro/horizon problems and difficulty maintaining altitude. Subsequently, he transmitted that his gyro/horizon had toppled and could no longer be relied upon for controlling the aircraft. The aircraft was observed on radar to make several heading and altitude changes, before commencing a right turn and a steep descent, after which the radar target was lost. An emergency locator transmitter signal was received by the Lloydminster, Alberta, Flight Service Station for about 1 ½ minutes before it stopped. The wreckage was found by the Royal Canadian Mounted Police about 16 nautical miles northeast of Wainwright at about 1205. None of the five people on board survived. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The gyro/horizon failed due to excessive wear on bearings and other components, resulting from a lack of maintenance and due to a vacuum system that was possibly not at minimum operating requirements for the instrument.\r\n2. The gyro/horizon was reinstalled into the aircraft to complete the occurrence flight without the benefit of the recommended overhaul.\r\n3. The autopilot became unusable when the attitude information from the gyro/horizon was disrupted.\r\n4. The pilot had not practised partial panel instrument flying for a number of years, was not able to transition to a partial panel situation, and lost control of the aircraft while flying in instrument meteorological conditions.\r\n5. The aircraft was loaded in excess of its certified gross weight and had a centre of gravity (C of G) that exceeded its aft limit. These two factors made the aircraft more difficult to handle due to an increase of the aircraft’s pitch control sensitivity and a reduction of longitudinal stability.\r\n6. The structural limitations of the aircraft were exceeded during the uncontrolled descent; this resulted in the in-flight breakup.\r\n7. There were a number of deficiencies with the company’s safety management system (SMS), in which the hazards should have been identified and the associated risks mitigated.\r\n8. The company did not conduct an annual risk assessment as required by its SMS; this increased the risk that a hazard could go undetected.\r\n9. The Canadian Business Aviation Association (CBAA) audit did not identify the risks in the company’s operations. \r\nFindings as to Risk:\r\n1. Lack of adequate instrument redundancy increases the risk of loss of control in single-pilot instrument flight rules (IFR) aircraft operations.\r\n2. The pilot did not reduce his airspeed while attempting to maintain control of the aircraft; a lower speed would have allowed a greater margin to maximum operating speed (Vmo) while manoeuvring.\r\n3. There were no quick-donning oxygen masks on board and the pilot was not wearing an oxygen mask at the time of the occurrence, as required by regulation.\r\n4. If effective oversight of private operator certificate (POC) holders is not exercised by the regulator or its delegated organization, there is an increased risk that safety deficiencies will not be identified and properly addressed.\r\nOther Finding:\r\n1. The approved maintenance organization (AMO) that was maintaining the aircraft did not have the approval to maintain PA-46 turbine aircraft. "}