{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2-near-shieli-13-killed", "date": "Feb 6, 1973 at 1610 LT", "type": "PZL-Mielec AN-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Kyzymshek – Shulakkurgan – Shymkent", "msn": "1G130-38", "yom": 1971, "flight_number": null, "city": "Shieli", "zone": "Kyzylorda", "country": "Kazakhstan", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane was completing a flight from Kyzymshek to Shymkent with an intermediate stop in Shulakkurgan. Prior to leave Shulakkurgan, the crew was informed about the poor weather conditions en route and the captain request for another itinerary. He was cleared by ATC to take another route to the west but few minutes after takeoff, the crew encountered poor weather conditions and failed to return. While cruising in low clouds and rain showers, the single engine airplane struck the slope of a mountain at an altitude of 454 meters and located in the Karamuryn Mountain Range. As the airplane failed to arrive at destination, SAR operations were conducted and the burnt wreckage was found two days later about 35 km northeast of Shieli. All 13 occupants have been killed. ", "probable_cause": "The accident was the consequence of a controlled flight into terrain in below-minima weather conditions. The captain decided to conduct the flight in poor weather conditions and failed to return, violating all procedures in place. ATC cleared the crew to take another route to the west which was also irresponsible and the meteorologist published bulletins with inaccurate information as weather conditions were worse than predicted. Mismanagement of flight, poor organization of operations and poor decisions made by the various actors involved in the organization of the flight were considered as contributing factors. "}