{"url": "https://www.baaa-acro.com/crash/crash-airbus-a300-622r-birmingham-2-killed", "date": "Aug 14, 2013 at 0447 LT", "type": "Airbus A300-600", "operator": "UPS", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Louisville - Birmingham", "msn": "841", "yom": 2003, "flight_number": "UPS1354", "city": "Birmingham–Shuttlesworth", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6406, "captain_hours_type": 3265, "copilot_hours": 4721, "copilot_hours_type": 403, "aircraft_hours": 11000, "circumstances": "On August 14, 2013, about 0447 central daylight time (CDT), UPS flight 1354, an Airbus A300-600, N155UP, crashed short of runway 18 during a localizer non precision approach to runway 18 at Birmingham-Shuttlesworth International Airport (BHM), Birmingham, Alabama. The captain and first officer were fatally injured, and the airplane was destroyed by impact forces and postcrash fire. The scheduled cargo flight was operating under the provisions of 14 Code of Federal Regulations Part 121 on an instrument flight rules flight plan, and dark night visual flight rules conditions prevailed at the airport; variable instrument meteorological conditions with a variable ceiling were present north of the airport on the approach course at the time of the accident. The flight originated from Louisville International Airport-Standiford Field, Louisville, Kentucky, about 0503 eastern daylight time. A notice to airmen in effect at the time of the accident indicated that runway 06/24, the longest runway available at the airport and the one with a precision approach, would be closed from 0400 to 0500 CDT. Because the flight's scheduled arrival time was 0451, only the shorter runway 18 with a non precision approach was available to the crew. Forecasted weather at BHM indicated that the low ceilings upon arrival required an alternate airport, but the dispatcher did not discuss the low ceilings, the single-approach option to the airport, or the reopening of runway 06/24 about 0500 with the flight crew. Further, during the flight, information about variable ceilings at the airport was not provided to the flight crew.", "probable_cause": "The NTSB determined that the probable causes of the crash were:\r\n- The crew continued an unstabilized approach into Birmingham Airport, \r\n- The crew failed to monitor the altitude and inadvertently descended below the minimum descent altitude when the runway was not yet in sight.\r\nContributing factors were: \r\n- The flight crew's failure to properly configure the on-board flight management computer,\r\n- The first officer's failure to make required call-outs,\r\n- The captain's decision to change the approach strategy without communicating his change to the first officer, \r\n- Flight crew fatigue."}