{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-2a8-ahmedabad-133-killed", "date": "Oct 19, 1988 at 0653 LT", "type": "Boeing 737-200", "operator": "Indian%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bombay - Ahmedabad", "msn": "20481", "yom": 1970, "flight_number": "IC113", "city": "Ahmedabad", "zone": "Gujarat", "country": "India", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 129, "pax_fatalities": 127, "other_fatalities": 0, "total_fatalities": 133, "captain_hours": 5985, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 42750, "circumstances": "Indian Airlines B-737 aircraft VT-EAH was operating scheduled flight IC113 (Bombay - Ahmedabad sector) on 19-10-1988. There were 135 occupants on board including 6 crew members. Aircraft contacted Ahmedabad Approach Control at 0620LT. Ahmedabad weather as per Metar of 0540LT was passed to the aircraft and again at 0625LT (speci) of 0610LT was passed to the aircraft and then visibility has been reduced from 6 km to 3 km. Clearance to descend to FL150 was given at 0632LT and the aircraft was further cleared to FL55, 25 DME at 0636LT. At 0641LT, the aircraft was advised to report over Ahmedabad VOR and 'Speci' of 0640LT was also transmitted to the aircraft as per the same the winds were calm, visibility 2 km in haze and was 1010. QNH was correctly read back by the aircraft. The pilot decided to carry localiser-DME approach for runway 23 and reported overhead Ahmedabad. The aircraft went outbound and reported turning inbound. This was the last transmission from the aircraft and thereafter contact with the ATC was lost at 0650:53. The aircraft was found crashed at a distance of 2,540 meters from the beginning of runway 23 on the extended centre line of the runway in a paddy field at about 0653LT. Out of 135 persons on board, 133 received fatal injuries. The remaining two were seriously injured. The aircraft was destroyed due to post impact fire. ", "probable_cause": "The cause of the accident is attributed to error on part of the pilot-in-command as well as copilot due to non adherence to laid down procedures under poor visibility conditions. Both pilot and copilot failed to follow approved procedures, directives, instructions, etc. Weather was considered as a contributing factor. "}