{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e18s-juneau-1-killed", "date": "Apr 10, 2002 at 1625 LT", "type": "Beechcraft E18", "operator": "Aleutian Air", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "BA-400", "yom": 1959, "flight_number": null, "city": "Juneau", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 22820, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The certificated airline transport pilot was departing on a 14 CFR Part 91 personal flight. The purpose of the flight was to deliver a load of wooden roofing shakes to a friend's remote lodge. Witnesses reported that just after takeoff, as the airplane climbed to about 200 to 300 feet above the ground, the airplane abruptly pitched up about 70 degrees, and drifted to the right. The airplane continued to turn to the right as the nose of the airplane lowered momentarily. As the airplane flew very slowly the landing gear was extended. The nose of the airplane pitched up again, the right wing dropped, and the airplane descended. One witness described the descent as: \"The wings rocked back and forth as it descended, like a card in the wind, with the nose of the airplane slightly higher.\" The airplane impacted shallow water in an area of tidal mud flats. A postaccident investigation revealed that the estimated gross weight of the airplane at takeoff was 11,500.8 pounds, 1,400.8 pounds in excess of the airplane's maximum takeoff gross weight. The airplane's center of gravity could not be calculated due to the fact that the exact location/station of the cargo could not be determined. Examination of the airplane revealed no evidence of any preimpact mechanical anomalies. ", "probable_cause": "The pilot's excessive loading of the airplane that precipitated an inadvertent stall/mush during the initial climb."}