{"url": "https://www.baaa-acro.com/crash/crash-cessna-207-skywagon-cradle-mountain", "date": "Nov 7, 2002 at 1404 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Dale Lawrence Triffett", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cradle Mountain - Cradle Mountain", "msn": "207-0141", "yom": 1970, "flight_number": null, "city": "Cradle Mountain", "zone": "Tasmania", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 730, "captain_hours_type": 180, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Cessna 207 aircraft (C207) was engaged on a sightseeing flight from Cradle Mountain, to Lake St. Clair and return. On board were the pilot and 4 passengers. The flight departed Cradle Mountain at approximately 1310 ESuT and tracked direct to Lake St Clair at 7000 ft due to turbulence. The aircraft then returned to Cradle Mountain. At approximately 1404, as the aircraft was approaching the airfield, the pilot configured the aircraft for a straight in approach to strip 02. The pilot had selected two stages of flap, and had reduced power to approximately 19 inches of manifold pressure. He reported that at approximately half a mile from the airfield the engine stopped without any prior warning. After completing trouble checks, the pilot became aware that the aircraft would not reach the airfield. He then manoeuvred the aircraft towards an open area on his right while broadcasting a MAYDAY call. Melbourne air traffic control acknowledged this call. The pilot then completed additional trouble checks and changed the fuel tank selection, but the engine failed to respond. The aircraft touched down heavily on the main wheels and slid approximately 40 metres before coming to a stop. During the touchdown and subsequent ground slide, the nose wheel detached from the aircraft, the propeller was damaged and the right wing was partially separated from the airframe. After the aircraft stopped the pilot checked the passengers and discovered that two of them had suffered serious injuries.", "probable_cause": "The pilot reported that he had completed a daily inspection of the aircraft earlier in the morning. That inspection included assessing the fuel quantity on board the aircraft and completing a fuel drain and water check. Both of these checks did not reveal any problem with the fuel. The pilot estimated that there was approximately 185 litres of fuel on board the aircraft, 90 litres in the right tank and 95 litres in the left tank. The aircraft had last been refuelled the day previously from drum stock. The aircraft had completed two flights since that refuelling with no problems being reported. The engineers that recovered the aircraft reported that there was approximately 30 litres of fuel in the left tank and approximately 100 litres of fuel in the right tank. The C207 aircraft has a fuel selector in the cockpit that allows the pilot to supply fuel to the engine from either the right tank or the left tank, but not from both tanks simultaneously. The pilot reported that he conducted the flight with the fuel selector switched to the left tank. He also reported that he did not move the selector during the flight and only moved it to the right tank as part of his trouble checks when the engine failed. The pilot reported that he did not complete flight or fuel plans for the flight, but operated on previous knowledge from other flights. A post occurrence analysis of the weather indicated that the winds at 7000 feet were as forecast. Post flight analysis of the flight revealed that the aircraft would have required 57 litres of fuel to complete the flight, which included allowances for taxi and climb. The engine was sent by the owner to an engine overhaul facility for testing. The ATSB did not attend the testing of the engine. The engine was fitted to the test cell in the condition as removed from the aircraft. The engine was started and test run in accordance with the engine manufacturer's overhaul manual. The engine ran normally and all temperature and pressure limits were within normal ranges. The investigation was unable to determine why the engine failed to operate normally in the latter stages of the flight."}