{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-fayetteville", "date": "Aug 28, 2015 at 1400 LT", "type": "Beechcraft 90 King Air", "operator": "Chopaire", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Shelbyville – Huntsville", "msn": "LW-40", "yom": 1973, "flight_number": null, "city": "Fayetteville", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1882, "captain_hours_type": 230, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11283, "circumstances": "Shortly after takeoff in day visual meteorological conditions, when the airplane was climbing through 3,000 ft mean sea level, a complete electrical failure occurred that affected electrical instrumentation and additional airplane equipment, including the landing gear. The pilot reported that he performed the electrical failure checklists and could not restore power. After additional troubleshooting with no success, he chose to divert to and land at another airport. While in the traffic pattern at his diversion airport, he attempted to lower the landing gear using the emergency landing gear extension procedures but could not confirm the landing gear were down and locked. Without any capability to communicate or confirmation that the landing gear were down, he decided to leave the airport traffic pattern and land on a nearby field to avoid airport traffic; the airplane sustained substantial damage to the fuselage, landing gear doors, engines, and propellers during the off-airport landing. The reason for the loss of electrical power could not be determined. Examination of the cockpit revealed that the landing gear's emergency engage handle, also known as the \"J\" handle, was not pulled up and turned, which was one of the steps listed in the airplane flight manual for the manual landing gear extension procedure. The \"J\" handle engages the clutch and allows for the handle to operate the landing gear chain. Without engaging the \"J\" handle, the landing gear handle pumping action would not have worked, which resulted in the gear-up landing. ", "probable_cause": "A total loss of electrical power for reasons that could not be determined and the pilot's subsequent failure to properly follow the manual landing gear extension procedures, which resulted in the landing gear not extending."}