{"url": "https://www.baaa-acro.com/crash/crash-atr72-212a-manila", "date": "Jul 28, 2010 at 1515 LT", "type": "ATR72-200", "operator": "Cebu%20Pacific-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tuguegarao – Manila", "msn": "828", "yom": 2008, "flight_number": "5J509", "city": "Manila-Ninoy Aquino", "zone": "Metro Manila", "country": "Philippines", "region": "Asia", "crew_on_board": 0, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Cebu Pacific Air flight 5J509, an ATR 72-500, took off from Tuguegarao Airport, Philippines, bound for Manila-Ninoy Aquino International Airport. The first officer was the Pilot Flying (PF) while the captain was the Pilot Not Flying (PNF). Approaching Manila, the flight was under radar vector for a VOR/DME approach to runway 24. At 7 miles on finals the approach was stabilized. A sudden tailwind was experienced by the crew at 500 feet radio altitude (RA) which resulted in an increase in airspeed and vertical speed. The captain took over the controls and continued the approach. Suddenly, the visibility went to zero and consequently the aircraft experienced a bounced landing three times, before a go-around was initiated. During climb out the crew noticed cockpit instruments were affected including both transponders and landing gears. They requested for a priority landing and were vectored and cleared to land on runway 13. After landing the aircraft was taxied to F4 where normal deplaning was carried out. No injuries were reported on the crew and passengers.", "probable_cause": "Primary Cause Factor:\r\n- Failure of the flight crew to discontinue the approach when deteriorating weather and their associated hazards to flight operations had moved into the airport (Human Factor)\r\nContributory Factor:\r\n- The adverse weather condition affected the judgment and decision-making of the PIC even prior to the approach to land. With poor weather conditions being encountered, the PIC still continued the approach and landing. (Environmental Factor)\r\nUnderlying Factor:\r\n- As a result of the bounced landing, several cockpit instruments were affected including both transponders on board. One of the nosewheels was detached and all the landing gears could not be retracted. Further, the integrity of the structure may have been affected and chance airframe failure was imminent. With all of these conditions, the Captain still opted to request for a priority landing when emergency landing was needed."}