{"url": "https://www.baaa-acro.com/crash/crash-antonov-12b-yeniseysk-1-killed", "date": "Oct 18, 1974 at 2352 LT", "type": "Antonov AN-12", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sverdlovsk - Kamensk-Uralski - Krasnoyarsk", "msn": "7 3 450 02", "yom": 1967, "flight_number": null, "city": "Yeniseysk", "zone": "Krasnoyarsk Krai", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11124, "circumstances": "The airplane was completing a flight from Sverdlovsk to Krasnoyarsk with an intermediate stop in Kamensk-Uralski, carrying six crew members and six passengers accompanying the cargo composed by 10 tons of various metallic materials. En route from Kamensk-Uralski to Krasnoyarsk, the crew was informed about poor weather conditions at destination and was instructed to divert to Yeniseysk Airport. On approach by night, the airplane descended below the glide and was too low when the copilot informed twice the captain they should initiate a go-around. For unknown reason, the captain continued the approach when the airplane, in a slight nose-down attitude, struck the ground with its nose gear 1,933 meters short of runway threshold. It bounced and flew for about 374 meters then struck trees and crashed 612 meters after initial impact. The aircraft was destroyed and the navigator was killed while 11 other occupants were injured. ", "probable_cause": "Poor approach planning on part of the crew who failed to follow the approach procedures and descended below the glide in poor visibility due to fog and night. The following contributing factors were reported:\r\n- The fog reduced the visibility and considerably complicated the flight process, \r\n- When approach lights were turn on in foggy conditions, this resulted in a screen that blinded the pilots,\r\n- The captain's decision to continue the approach below the prescribed minimum altitude when he should have initiate a go-around procedure."}