{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130e-hercules-near-bliss-6-killed", "date": "May 13, 1995", "type": "Lockheed C-130 Hercules", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Plain, Valley", "schedule": "Boise - Colorado Springs", "msn": "3801", "yom": 1963, "flight_number": "Sumit 38", "city": "Bliss", "zone": "Idaho", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After departure from Boise-Gowen Field, en route to Peterson AFB in Colorado Springs, the crew encountered technical problems with the engine n°2. The crew declared an emergency and elected to divert to Mountain Home AFB. About 20 minutes into the flight, the engine n°2 compressor disintegrated. The aircraft entered an uncontrolled descent and crashed 12 miles north of Bliss. All six crew members were killed. \r\nCrew:\r\nLt Col Robert Buckout, Commander\r\n1st Lt Lance Daugherty, pilot,\r\nCpt Geoffery Boyd, navigator,\r\nCMSgt Jimmy Vail, flight engineer, \r\nM/Sgt Jay Kemp, loadmaster,\r\nS/Sgt Michael Scheideman, loadmaster. ", "probable_cause": "The cause of the crash was that the number 2 (inside left wing) engine had a buggy undertemp sensor, causing the crew to enrich the fuel mixture, leading to an actual engine overtemp. One of the fuel lines ruptured or melted, causing the fire, and one of the crewmen hit the fire carts, but the fire re-erupted moments later, and there were no more extinguishers available for that engine. One of the pins that was supposed to melt in an engine fire, releasing the engine from the AC, failed to release the engine properly, while another worked properly. Still half connected to the wing hard point, the engine torqued at an awkward angle, causing severe wing and fuselage damage, which led to the crash."}