{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-gaspe-3-killed", "date": "Sep 27, 2003 at 1857 LT", "type": "Piper PA-31-310 Navajo", "operator": "Les Ailes de Gaspé", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Le Havre-aux-Maisons - Gaspé", "msn": "31-306", "yom": 1968, "flight_number": null, "city": "Gaspé", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 5262, "captain_hours_type": 3000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The PA-31-310, registration C-FARL, serial number 31306, operated by Les Ailes de Gaspé Inc., with one pilot and two passengers on board, was on a visual flight rules flight from Îles-de-la-Madeleine, Quebec to Gaspé, Quebec. While en route to Gaspé, the pilot was informed about weather conditions at his destination, which were a ceiling at 500 feet and visibility of ¾ mile in fog. The pilot requested clearance for an instrument approach, which he received at approximately 1857 eastern daylight time. A few seconds later the pilot switched on the aerodrome lights with his microphone button. That was the last radio transmission received from the aircraft. When the aircraft did not arrive at its destination, emergency procedures were initiated to find it. The wreckage was found the next day at 1028 eastern daylight time on a hilltop 1.2 nautical miles (nm) north-east of the airport. The aircraft was destroyed, but did not catch fire. The three occupants were fatally injured.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The pilot descended to the minimum descent altitude (MDA) without being established on the localizer track, thereby placing himself in a precarious situation with respect to the approach and to obstruction clearance. \r\n2. On an instrument approach, the pilot continued his descent below the MDA without having the visual references required to continue the landing, and he was a victim of CFIT (controlled flight into terrain).\r\nFindings as to Risk:\r\n1. The aircraft was not, nor was it required to be, equipped with a ground proximity warning system (GPWS) or a radio altimeter, either of which would have allowed the pilot to realize how close the aircraft was to the ground.\r\n2. The presence of a co-pilot would have allowed the pilots to share tasks, which undoubtedly would have facilitated identification of deviations from the approach profile.\r\n3. The existing regulations do not provide adequate protection against the risk of ground impact when instrument approaches are conducted in reduced visibility conditions.\r\nOther Findings:\r\n1. The emergency locator transmitter (ELT) could not emit a distress signal because the battery disconnected on impact. Location of the aircraft was delayed until the day after the accident, which could have had serious consequences if there had been any survivors."}