{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-greeley", "date": "Feb 21, 1990 at 0815 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Beegles Aircraft Services", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Greeley - Greeley", "msn": "31-8052052", "yom": 1980, "flight_number": null, "city": "Greeley", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2455, "captain_hours_type": 139, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 22598, "circumstances": "N3554p was on a maintenance test flight after the right wing was repaired. The pilot lost control of the airplane shortly after liftoff and was unable to regain control prior to the ground impact. The a&p mechanic who performed the repairs, re assembled the right wing aileron control cables per the Piper service manual. Post accident examination of the aileron control system revealed the right wing control cables were reversed on the aileron bellcrank, resulting in both ailerons moving the same direction (either up or down) when the control wheel was turned left or right. Both occupants were seriously injured. ", "probable_cause": "The improper identification of parts in the piper PA-31-350 service manual pertaining to the aileron cables. This discrepancy resulted in the improper installation of the aileron cables on the right aileron bellcrank by a mechanic during the reconstruction of the right wing. The improper connection resulted in a loss of aircraft control by the pilot immediately after takeoff. Also causal to the accident were the inadequate inspection of the flight control system by a second mechanic with inspection authorization, and the inadequate preflight inspection of the flight control system by the pilot prior to takeoff."}