{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-giii-biggin-hill", "date": "Nov 24, 2014 at 2030 LT", "type": "Gulfstream GIII", "operator": "World Heir", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Biggin Hill - Gander", "msn": "418", "yom": 1984, "flight_number": null, "city": "Biggin Hill", "zone": "London Metropolis", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4120, "captain_hours_type": 3650, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 24 November 2014 the crew of Gulfstream III N103CD planned for a private flight from Biggin Hill Airport to Gander International Airport in Canada. The weather reported at the airport at 2020 hrs was wind ‘calm’, greater than 10 km visibility with fog patches, no significant cloud, temperature 5°C, dew point 4°C and QNH 1027 hPa. At 2024 hrs, the crew was cleared to taxi to Holding Point J1 for a departure from Runway 03. After the crew read back the taxi clearance, the controller transmitted: “we are giving low level fog patches on the airfield, general visibility in excess of 10 km but visibility not measured in the fog patches. it seems to be very low, very thin fog from the zero three threshold to approximately half way down the runway then it looks completely clear”. The crew acknowledged the information. At 2028 hrs, the aircraft was at the holding point and was cleared for takeoff by the controller. The aircraft taxied towards the runway from J1 but lined up with the runway edge lights, which were positioned 3 m to the right of the edge of the runway. The aircraft began its takeoff run at 2030 hrs, passing over paved surface for approximately 248 m before running onto grass which lay beyond. The commander, who was the handling pilot, closed the thrust levers to reject the takeoff when he realized what had happened and the aircraft came to a halt on the grass having suffered major structural damage. The crew shut down the engines but were unable to contact ATC on the radio to tell the controller what had happened. The co-pilot moved from the flight deck into the passenger cabin and saw that no one had been injured. He vacated the aircraft through the rear baggage compartment and then helped the commander, who was still inside, to open the main exit door. The commander and the five passengers used the main exit to vacate the aircraft. The controller saw that the aircraft had stopped but did not realize that it was not on the runway. He attempted to contact the crew on the radio but, when he saw the lights of the aircraft switch off, he activated the crash alarm, at 2032 hrs, declaring an aircraft ground incident. At 2034 hrs the airport fire service reached the aircraft and declared an aircraft accident, after which the airport emergency plan was activated.", "probable_cause": "This was a private flight which could not depart in conditions of less than 400 m RVR. RVR cannot be measured at the threshold end of Runway 03 but the prevailing visibility was reported as being more than 10 km. The crew reported that there was moisture on the windscreen from the mist and they could see a “glow” around lights which were visible to them. They were also aware while taxiing that there was some patchy ground fog on the airfield. The ATC controller transmitted that visibility had not been measured in the fog patches but there seemed to be ‘very low, very thin fog from the zero three threshold to approximately half way down the runway’. With hindsight, this piece of information is significant but, at the time, the crew did not consider the fog to be widespread or thick; operating under FAR Part 91 in the United States, they were used to making their own judgments as to whether the visibility was suitable for a takeoff. However, after the aircraft came to a halt following its abortive takeoff attempt, the controller could only see the top of the fuselage and tail above the layer of fog. It is likely, therefore, that the visibility was worse than the crew appreciated at the time N103CD taxied from Holding Point J1. The route from J1 to the runway The information on the aerodrome chart used by the crew, and the source of information in the UK AIP, suggested that the aircraft would be required to taxi in a straight line from J1 to the runway and then make a right turn onto the runway heading. In fact, in order to taxi from J1 onto the runway, an aircraft must: taxi in a straight line; follow a curve to the right onto runway heading but still displaced to the right of the runway itself; turn left towards the runway; and then turn right again onto runway heading. The UK AIP states that there is no centreline lighting on Runway 03, and that the pavement width at the beginning of the runway is twice the normal runway width. It recognizes the potential for confusion and urges crews to ensure that they have lined up correctly. This information was not available to the crew on their aerodrome charts and both crew members believed that the runway had centreline lighting. Further, the light from those left-side runway edge lights covered in fog would have been scattered, making it harder for the crew to perceive them as a distinct line of lights. The situation is likely to have been made worse by the bright lights reflecting off the top of the fog layer, making the underlying runway lights even harder to see, or swamping them completely as shown in Figure 5. The CCTV images in Figure 5 show that peripheral lighting can interact with low fog layers to reduce the visibility of underlying aerodrome lighting. Current standards associated with apron lighting only address the minimum light levels required to make the areas safe and there are no standards relating to light spilling into other areas. \r\nHuman and environmental factors Five of the factors identified by the ATSB as being present in misaligned takeoffs were present in this accident:\r\n1. It was dark.\r\n2. It was potentially a confusing taxiway environment given that the aerodrome chart did not reflect the actual layout of the taxiways. Pilots had previously reported having difficulty when vacating the runway near the Runway 03 threshold because of a lack of taxiway lighting.\r\n3. There was an additional paved area (the ORP) near the runway.\r\n4. There was no runway centreline lighting and the runway edge lights before the displaced threshold were recessed.\r\n5. There was reduced visibility.\r\nIt appeared that the information available to the crew caused them to develop an incorrect expectation of their route to the runway. Both crew members believed that the runway had centreline lighting and, when the first right turn almost lined the aircraft up with some lights, their incorrect expectation was reinforced and they believed that the aircraft was lined up correctly. Cues to the contrary, such as runway edge lights on the other side of the runway, or the fact that the first three lights ahead of the aircraft were red (indicating that they were edge lights before the displaced threshold), did not appear to have been strong enough to make the crew realize that they had lost situational awareness. Figure 8 indicates that the apparent intensity of the white left-side runway edge lights was significantly less than that of the right-side lights, when viewed from the position where the aircraft lined up. This, along with other visual issues relating to contrast and the fog, is a plausible explanation as to why they were not noticed by the crew. The aircraft began its takeoff roll from a location beyond the first red runway edge light and approximately 46 m short of the next light, as shown in Figure 1. Aircraft structure only obscures approximately the first 13 m of pavement ahead of pilots within a Gulfstream III aircraft and therefore these lights would not have been obscured by the aircraft. However, it is likely that the recessed nature of the red edge lights before the displaced threshold made them less compelling than the elevated white edge lights beyond, which would explain why their significance – that they could only have been runway edge lights – was not appreciated by the flight crew."}