{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-stow", "date": "Jul 15, 2001 at 2107 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "David I. Laskin", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Columbia – Newburgh – Stow", "msn": "46-08110", "yom": 1988, "flight_number": null, "city": "Stow-Minute Man Air Field", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3500, "captain_hours_type": 2616, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2692, "circumstances": "Witnesses reported hearing an airplane engine at night, at high power for about 5 seconds followed by impact. They went to the scene and found the airplane on the left side of the approach end of runway 03, on fire. The pilot was removed and the fire was extinguished. The airplane had struck a runway threshold light located about 25 feet to the left side of the runway, and slid about 100 feet into trees, angling away from the runway on a heading of 360 degrees. The outboard 5 feet of the left wing was bent up about 20 degrees. Ground scars were found corresponding to the positions of the left, right, and nose landing gears, all of which had collapsed. The inboard section of the left wing came to rest on the nose of the airplane. The propeller blades were deformed with \"S\" bending and leading edge gouges. Flight control continuity was verified to the rudder and elevator. The aileron control cables had separated with puffed ends. All separations occurred at other than attach points. The pilot had received head injuries and has no memory of the accident.", "probable_cause": "The pilot's failure to maintain airplane control during a go-around."}