{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-200-vancouver-11-killed", "date": "Sep 3, 1978 at 1742 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Airwest%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Victoria - Vancouver", "msn": "215", "yom": 1969, "flight_number": null, "city": "Vancouver", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 11, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 6000, "captain_hours_type": 3600, "copilot_hours": 450, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Twin Otter C-FAIV, operating as a scheduled VFR flight, departed Victoria Harbour at 1718LT with Vancouver Harbour water-aerodrome as destination. The estimated time en route was 20 minutes. The flight proceeded normally and reported by Active Pass at 2,000 feet. This altitude was maintained in order to cross the Vancouver Control Zone in accordance with standard procedure; once out of the control zone, a slow descent was begun towards Vancouver Harbour. Normal radio procedures were followed as the flight reported by standard visual reporting points. Just before joining final approach, the transmission, \"AIV, Third Beach\", was made and landing clearance was given to the flight by the Harbour Tower. The approach continued, and when the aircraft reached approximately 175 feet above the surface, nine ground witnesses heard a loud noise from the aircraft. Two surviving witnesses also heard a noise. Power was subsequently applied and C-FAIV yawed left, rolled in the same direction and plunged into the harbour in a left-wing and nose-down attitude, 2 500 feet from the intended landing area. An ELT (Emergency Locator Transmitter) tone was heard by the tower controller 54 seconds after the radio call at Third Beach. The controller called the aircraft several times but there was no response. The flight had been of 24 minutes duration. Both pilots and nine passengers were killed while two others were injured. The aircraft was destroyed.", "probable_cause": "The following findings were determined:\r\n- The final approach to land was normal until an unusual noise occurred followed by loss of control,\r\n- The aircraft dived into the water with left wing down, nose down and with some sideslip. Value of roll, pitch and yaw, at impact could not be estimated with useful accuracy,\r\n- At impact, the complete left flap system was in the retracted position,\r\n- The inboard span-wise push-pull flap control rod (inboard bell-crank to inboard rod, PT # C6CW-1029-1), was severely stress-corroded and had at least three longitudinal cracks; the rod had separated from its inboard fitting,\r\n- It was deduced t h a t t h e in-flight failure of the left-hand inboard flap control rod led to sudden retraction of the complete left-hand flap system and sudden loss of control. \r\n- The passengers had not been briefed in evacuation procedures,\r\n- The crew was qualified for the type of operation in accordance with Transport Canada regulations. After the failure of the left flap control rod, no action by the pilot could have averted the accident. "}