{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-4-1009-boston-3-killed", "date": "Mar 10, 1964 at 0822 LT", "type": "Douglas DC-4", "operator": "Slick-Airways2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Windsor Locks – Boston", "msn": "18379", "yom": 1944, "flight_number": "SL012", "city": "Boston-Logan", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 6000, "captain_hours_type": 814, "copilot_hours": 5824, "copilot_hours_type": 4340, "aircraft_hours": 40233, "circumstances": "Slick Airways Flight 12, a Douglas C-54B-DC, N384, operating as a scheduled cargo flight from John F. Kennedy International Airport, New York, New York, to Logan International Airport, Boston, Massachusetts, with a stop at Bradley Field, Windsor Locks, Connecticut, crashed at 0821:35, March 10, 1964, while making an instrument approach to Runway 4R at Logan International Airport. The aircraft crashed in a lumberyard approximately 7,000 feet from the displaced threshold of Runway 4R and on the extended centerline of that runway. Boston weather at the time was: scattered clouds at 400 feet, overcast at 700 feet, surface visibility 1-1/2 miles in moderate sleet and fog, wind 050 degrees (.JPG\">), 22 knots, gusts to 28 knots, temperature 32 degrees, dewpoint 32 degrees. The captain, first officer, and freight handler, the only occupants, were killed. The aircraft was demolished by impact forces and the ensuing fire.", "probable_cause": "The Board determines the probable cause of this accident was loss of balancing forces on the horizontal surface of the aircraft's empennage, due to ice accretion, causing the aircraft to pitch nose down at an altitude too low to effect recovery."}