{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-i-stornoway-10-killed", "date": "Dec 8, 1983 at 1746 LT", "type": "Cessna 500 Citation", "operator": "Trans Europe Air Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Paris - Liverpool - Stornoway", "msn": "500-0326", "yom": 1976, "flight_number": null, "city": "Stornoway", "zone": "Hebrides Islands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 3300, "captain_hours_type": 350, "copilot_hours": 278, "copilot_hours_type": null, "aircraft_hours": 1871, "circumstances": "On the day of the accident, the aircraft left Biggin Hill, U.K. on a private flight at 12:51 hrs with full fuel tanks to fly to Paris-Le Bourget, France, carrying a pilot, a pilot's assistant and two passengers. At Le Bourget, two more passengers embarked and the aircraft departed for Liverpool, without refuelling, at approximately 13:55 hrs. It landed at Liverpool at 15:25 hrs, where it was refuelled with 800 litres of turbine fuel, the pilot being seen to mix anti-icing additive to the fuel as it was dispensed. Two more adult passengers and two infants were embarked and the aircraft left Liverpool at 16:32 hrs en route to Stornoway, Outer Hebrides, Scotland. The pilot had submitted an Instrument Flight Rules (IFR) flight plan to fly from Liverpool to Stornoway at Flight Level (FL) 310 via Dean Cross and Glasgow. At 16:53 hrs, when approximately over Dean Cross, he reported to the Scottish Air Traffic Control Centre (ScATCC) that he was at FL280 climbing to FL310. This radio call was heard by the pilot of another aircraft, registration N40GS. This aircraft was a Citation 11, which had been leased by the operating company of G-UESS and was carrying other members of the same private party to which the passengers in G-UESS belonged. N40GS had taken off from Biggin Hill and was also en-route to Stornoway via Dean Cross at FL350. When just north of Dean Cross, the pilot of N40GS saw G-UESS ahead of him and established radio contact with its pilot on the company discrete radio frequency. From that point on, the two aircraft remained in intermittent radio contact on this frequency. After passing Dean Cross, both aircraft were given clearance by ScATCC to route direct to Stornoway. At 17:00 hrs G-UESS was asked to climb to FL330 to avoid crossing traffic. At 17:18 hrs the pilot of N40GS reported that he still had G-UESS in sight and would be ready to descend in 3 minutes. At this time, his aircraft was slowly overtaking G-UESS. At 17:20 hrs ScATCC directed both aircraft to maintain a radar heading of 330° (M) so as to provide lateral separation during descent, and cleared N40GS to descend. Three minutes later, G-UESS was cleared to descend. During the descent, N40GS was cleared progressively to FL65 and G-UESS to FL85. At 17:29 hrs ScATCC released both aircraft from their radar headings, advising them that there was no other air traffic to affect them. ScATCC also advised N40GS that G-UESS was 5 miles to his right and slightly behind him. The pilot of G-UESS responded to this message by reporting that he had the other aircraft in sight. ScATCC then instructed both aircraft to establish radio contact with Stornoway. At 17:34 hrs Stornoway ATC passed details of the present Stornoway weather to both aircraft and asked them to report at 25 miles range from Stornoway. The weather as reported was fine with a light wind, good visibility and one eighth of low cloud. The pilot of G-UESS acknowledged the weather but did not repeat back the QNH. At this time, G-UESS was 49 miles from Stornoway descending through FL140. At 17:38 hrs N40GS reported at 25 miles range, and immediately afterwards G-UESS reported 30 miles from the airfield. N40GS was then cleared to 2,000 feet on the QNH of 1001. At 17:40 hrs the pilot of G-UESS reported that his range was 25 miles and that he had N40GS in sight. He asked for clearance to continue his descent and was cleared by the Stornoway controller to descend at his discretion with the aircraft ahead in sight. A moment later he was asked to report when he had the airfield in sight for a visual approach to runway 01. He acknowledged this message. No further communication was received from the aircraft and at 17:51 hrs, after failing to re-establish contact, the Stornoway controller reported to ScATCC that he had lost radio contact with G-UESS. The pilot of N40GS, who had meanwhile landed safely, stated afterwards that during the descent from FL350 they had passed through some layered stratus cloud and patches of altocumulus and cumulus cloud. The co-pilot in N40GS described a layer of lower cloud over the sea with tops between 3,000 and 4,000 feet, lying across the path of their descent into Stornoway. The pilot of N40GS was tracking directly to Stornoway airfield during the descent, using Omega/VLF area navigation equipment. At 17:45 hrs he reported to Stornoway ATC that he was just breaking cloud at 1,400 feet but stated later that he had cleared the base of the lowest cloud at between 1,100 and 1,000 feet, close to Stornoway. He also stated that the visibility below cloud was very good, even though the night was dark and he could not see the sea beneath him. N40GS experienced no icing and no significant turbulence during the descent. An intensive search was made for G-UESS that night, and two bodies were recovered one mile north-west of the last observed radar position. During the next 4 days, five more bodies and some small pieces of aircraft wreckage were found near the same position. The bodies of two more passengers were recovered from the sea bed on 28 February and 5 June 1984, and that of the pilot's assistant on 18 July 1984. Attempts to recover the main wreckage were not successful.", "probable_cause": "The pilot's lack of awareness of his true altitude, which resulted in his allowing his aircraft to descend until it struck the sea. Likely contributory factors were that he was distracted by the need to establish visual contact with another aircraft and that he was misled by false cues from lights on the ground ahead of him."}