{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-20-dk-khartoum-2-killed", "date": "Feb 21, 1967", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Sudan%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Khartoum - Khartoum", "msn": "15524/26969", "yom": 1944, "flight_number": null, "city": "Khartoum", "zone": "Khartoum (الخرطوم)", "country": "Sudan", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was completing a local training flight at Khartoum-Haj Yusuf Airport. Following several circuits and landings, the crew started a new approach to runway 36 with engine at idle. The airplane stalled, struck the roofs of two houses then crashed onto the ground, hit a truck and came to rest, broken in two. Two crew members were killed while two others were injured. ", "probable_cause": "Due to the lack of conclusive evidence it is not possible to formulate an opinion as to the direct cause of the accident. From the evidence available it is possible that one or more of the following items could have contributed tot the cause of the accident: \r\n- No satisfactory reason has yet been put forward for the initial turn of the aircraft to the port,\r\n- The loss of height after the turn was probably caused by the selection of the flaps from 1/4 position to the 'UP' position,\r\n- From witness' statement it would appear that at some time after the aircraft was starting to re-commence climbing on one or both of the engines 'coughed'. This could have been caused by the inadvertent mishandling of either the throttle and/or mixture control levers by the pilot under training as he left his seat. The possibility also exists that he may have pulled himself up by the ignition master switch, at the same time inadvertently switching 'off' the port ignition switch. (evidence of an explosion in the port exhaust system could have been caused by either of the above events,\r\n- If anything like the possibility mentioned in item 3) did in fact occur it would have been just at the critical time when the Training captain was re-gaining control of the aircraft, and could have presented him with a situation from which it was impossible to recover, bearing in mind the proximity of obstructions and the fact that he was alone in the cockpit."}