{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-hamilton", "date": "Dec 30, 2004 at 1300 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Kline and Associates", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hamilton – Stevensville", "msn": "61-0014", "yom": 1968, "flight_number": null, "city": "Hamilton-Ravalli County", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13409, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3289, "circumstances": "Immediately after taking off and raising the landing gear, the pilot noticed the left engine began to lose power. The airplane subsequently veered to the left before impacting up slopping terrain in a left wing low attitude, resulting in a fire breaking out which consumed the left side of the airplane. A postaccident examination revealed that the left engine had sustained thermal but no impact damage, and that the engine's right hand turbocharger had no thermal or impact damage. A further examination indicated that no restrictions were found in the center section of the turbocharger and there was no damage to the housing or the impeller; however, the impeller was frozen in the center section and would not turn. Indications of grooving and scraping from a lack of lubrication to the bearings and drive shaft was observed. No mechanical anomalies with the aircraft were noted by the pilot prior to takeoff which would have prevented normal operations.", "probable_cause": "A partial loss of engine power due to the lack of lubrication and subsequent failure of the left engine's right turbocharger for undetermined reasons, and subsequent forced landing after takeoff. A factor was the unsuitable terrain for the forced landing."}