{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-344c-windhoek-123-killed", "date": "Apr 20, 1968 at 2050 LT", "type": "Boeing 707", "operator": "South%20African%20Airways2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Johannesburg - Windhoek - Luanda - Las Palmas - Frankfurt - London", "msn": "19705/675", "yom": 1968, "flight_number": "SA228", "city": "Windhoek-JG Strijdom", "zone": "Khomas Region", "country": "Namibia", "region": "Africa", "crew_on_board": 12, "crew_fatalities": 12, "pax_on_board": 116, "pax_fatalities": 111, "other_fatalities": 0, "total_fatalities": 123, "captain_hours": 18102, "captain_hours_type": 4608, "copilot_hours": 4109, "copilot_hours_type": 229, "aircraft_hours": 238, "circumstances": "A Boeing 707-344C passenger jet, registered ZS-EUW, was destroyed in an accident near Windhoek-Strijdom International Airport, Namibia. The aircraft was operating on South African Airways' flight SA228 from Johannesburg to London via Windhoek, Luanda, Las Palmas and Frankfurt. The first leg of the flight was uneventful. Local weather conditions at Windhoek were fine: there was no cloud and no wind. The night was particularly dark as there was no moon and the horizon was indistinct. At 20:49 the aircraft took off from Windhoek runway 08 into conditions of complete darkness. The aircraft climbed to a height of about 650 feet above ground level. It leveled off and began to descend. Thirty seconds later, the aircraft flew into the ground at a point some 5,327 metres from the end of the runway. The level of the ground at the point of impact was 179 feet below the airport elevation or approximately 100 feet below the point of lift-off. The impact occurred at a ground speed of approximately 271 knots. The initial impact was in a slightly left-wing-down attitude. The fuselage and each of the 4 engine pods gouged deep trenches in the ground and the aircraft then began to break up as its momentum carried it onward. Wreckage was strewn over an area some 1,400 metres long and some 200 metres wide, and 2 separate fires broke out, presumably through the ignition of fuel on impact. Five passengers were seriously injured while 123 other occupants were killed.", "probable_cause": "In regard to the cause of the accident:\r\n(1) The effective cause of the accident was the human factor, and not any defect in the aircraft or in any of the engines or flight instruments.\r\n(2) After a normal take- off and retraction of the landing gear, and while the aircraft was approaching an estimated height of 650 feet, the flaps were fully retracted and the engine output reduced from take- off power to climb power. There is no reason to suppose that these steps were not taken in the correct sequence and at the prescribed indicated airspeeds. In that phase of flight these alterations in flap configuration and engine power would have caused the aircraft to level off and then lose height\r\n(a) unless the pilot checked that tendency and maintained a climbing attitude by appropriate action, or \r\n(b) until the aircraft gained much more speed.\r\n(3) The aircraft levelled off and lost height, and during the short period in which it did so the pilot appears to have acted as if he believed that the aircraft was still climbing. He appears to have altered the stabilizer trim to maintain the aircraft in its same pitch attitude, which he apparently believed was an attitude of climb, but which was in fact an attitude of descent. In that situation, which lasted for about 30 seconds, the aircraft lost approximately 750 feet in height and flew into the ground.\r\n(4) The co-pilot failed to monitor the flight instruments sufficiently to appreciate that the aircraft was losing height.\r\nThe following causes probably contributed in greater or lesser degree to the situation described above:\r\n(a) take-off into conditions of total darkness with no external visual reference;\r\n(b) inappropriate alteration of stabilizer trim;\r\n(c) spatial disorientation;\r\n(d) pre-occupation with after-take-off checks.\r\nThe following causes might have contributed in greater or lesser degree:\r\n(a) temporary confusion in the mind of the pilot on the position of the inertial-lead vertical speed indicator, arising from the difference in the instrument panel layout in the C model of the Boeing 707-344 aircraft, as compared with the A and B models, to which both pilots were accustomed;\r\n(b) the pilot's misinterpretation, by one thousand feet, of the reading on the drum-type altimeter, which is susceptible to ambiguous interpretation on the thousands scale;\r\n(c) distraction on the flight deck caused by a bird or bat strike, or some other relatively minor occurrence."}