{"url": "https://www.baaa-acro.com/crash/crash-canadair-cl-415-moosehead-lake", "date": "Jul 3, 2013 at 1415 LT", "type": "Canadair CL-415", "operator": "Government%20of%20Newfoundland%20%26%20Labrador", "flight_phase": "Takeoff (climb)", "flight_type": "Fire fighting", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Wabush - Wabush", "msn": "2076", "yom": 2010, "flight_number": null, "city": "Moosehead Lake", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12500, "captain_hours_type": 120, "copilot_hours": 1700, "copilot_hours_type": 138, "aircraft_hours": 461, "circumstances": "On 03 July 2013, at about 1415 Atlantic Daylight Time, the Government of Newfoundland and Labrador Air Services Division Bombardier CL-415 amphibious aircraft (registration C-FIZU, serial number 2076), operating as Tanker 286, departed Wabush, Newfoundland and Labrador, to fight a nearby forest fire. Shortly after departure, Tanker 286 touched down on Moosehead Lake to scoop a load of water. About 40 seconds later, the captain initiated a left-hand turn and almost immediately lost control of the aircraft. The aircraft water-looped and came to rest upright but  partially submerged. The flight crew exited the aircraft and remained on the top of the wing until rescued by boat. There was an insufficient forward impact force to activate the onboard 406-megahertz emergency locator transmitter. There were no injuries to the 2 crew members. The aircraft was destroyed. The accident occurred during daylight hours.", "probable_cause": "Findings as to causes and contributing factors:\r\n- It is likely that the PROBES AUTO/MANUAL switch was inadvertently moved from the AUTO to the MANUAL selection when the centre pedestal cover was removed.\r\n- The PROBES AUTO/MANUAL switch position check was not included on the Newfoundland and Labrador Government Air Services CL-415 checklist.\r\n- The flight crew was occupied with other flight activities during the scooping run and did not notice that the water quantity exceeded the predetermined limit until after the tanks had filled to capacity.\r\n- The flight crew decided to continue the take-off with the aircraft in an overweight condition.\r\n- The extended period with the probes deployed on the water resulted in a longer take-off run, and the pilot flying decided to alter the departure path to the left.\r\n- The left float contacted the surface of the lake during initiation of the left turn. Aircraft control was lost and resulted in collision with the water.\r\nFindings as to risk:\r\n- If safety equipment is installed in a manner that hampers its access and removal, then there is an increased risk that occupants may not be able to retrieve the safety equipment in a timely manner to ensure their survival.\r\n- If individuals are not trained on safety equipment installed on the aircraft, then there is an increased risk that the individuals may not be aware of how to effectively use the equipment.\r\n- If a checklist does not include a critical item, and flight crews are expected to rely on their memory, then there is a risk that that item will be missed, which could jeopardize the safety of flight.\r\n- If flight crews do not adhere to standard operating procedures, then there is a risk that errors and omissions can be introduced, which could jeopardize the safety of flight. \r\n- If a person is not restrained during flight and the aircraft either makes an abrupt manoeuvre or loses control, then that person is at a much greater risk of injury or death.\r\n- If an overweight take-off is carried out, there may be an adverse effect on the aircraft’s performance, which could jeopardize the safety of flight.\r\n- If companies do not have procedures for recording overweight take-offs and flight crews do not report them, then the overall condition of the aircraft’s structures will not be accurately known, which could jeopardize the safety of flight.\r\n- If organizations do not use formal and documented processes to manage operational risks, there is an increased risk that hazards will not be identified and mitigated.\r\n- If organizations do not have measures in place to raise awareness of the potential impact of stress on performance or to promote the early recognition and mitigation of stress, then there is an increased risk that errors will occur when an individual is affected by stress that has become chronic.\r\nOther findings:\r\n- Utilizing the locking position of the PROBES AUTO/MANUAL switch for the MANUAL selection allows the switch to be inadvertently moved from the AUTO to the MANUAL position."}