{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-freeport-9-killed", "date": "Nov 9, 2014 at 1652 LT", "type": "Learjet 35", "operator": "Diplomat Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "City", "schedule": "Nassau - Freeport", "msn": "258", "yom": 1979, "flight_number": null, "city": "Freeport", "zone": "West Grand Bahama", "country": "Bahamas", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 13800, "captain_hours_type": null, "copilot_hours": 996, "copilot_hours_type": null, "aircraft_hours": 12046, "circumstances": "The aircraft crashed into a garbage and metal recycling plant after striking a towering crane in the Grand Bahama Shipyard, while attempting a second landing approach to runway 06 at Freeport International Airport (MYGF), Freeport, Grand Bahama, Bahamas. The aircraft made an initial ILS instrument approach to Runway 06 at the Freeport International Airport but due to poor visibility and rain at the decision height, the crew executed a go around procedure. The crew requested to hold at the published holding point at 2,000 feet while they waited for the weather to improve. Once cleared for the second ILS approach, the crew proceeded inbound from the holding location to intercept the localizer of the ILS system associated with the instrument approach. During the approach, the crew periodically reported their position to ATC, as the approach was not in a radar environment. The crew was given current weather conditions and advised that the conditions were again deteriorating. The crew continued their approach and descended visually while attempting to find the runway, until the aircraft struck the crane positioned at Dock #2 of the Shipyard at approximately 220 feet above sea level, some 3.2 nautical miles (nm) from the runway threshold. A fireball lasting approximately 3 seconds was observed as a result of the contact between the aircraft and the crane. The right outboard wing, right landing gear and right wingtip fuel tank, separated from the aircraft on impact. This resulted in the aircraft travelling out of control, some 1,578 feet (526 yards) before crashing inverted into a pile of garbage and other debris in the City Services Garbage and Metal Recycling Plant adjacent to the Grand Bahama Shipyard. Both crew and 7 passengers were fatally injured. No person on the ground was injured. The crane in the shipyard that was struck received minimal damages while the generator unit and other equipment in the recycling plant received extensive damages.", "probable_cause": "The Air Accident Investigation & Prevention Unit (AAIPU) determines that the probable cause(s) of this accident were:\r\n- The poor decision making of the crew in initiating and continuing a descent in IMC below the authorized altitude, without visual contact with the runway environment. \r\nContributing Factors includes:\r\n- Improper planning of the approach,\r\n- Failure of the crew to follow the approved ILS approach while in IMC conditions,\r\n- Insufficient horizontal or vertical situational awareness,\r\n- Poor decision making,\r\n- Deliberate actions of the crew by disabling the terrain alert warning system,\r\n- Inadequate CRM practice."}