{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-santa-ana-5-killed", "date": "Mar 31, 1989 at 0835 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Richardons%20Jewellery", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Santa Ana – Pocatello – Camrose", "msn": "61-0522-219", "yom": 1978, "flight_number": null, "city": "Santa Ana-John Wayne", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 1490, "captain_hours_type": 243, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1908, "circumstances": "Several mechanic witnesses at the airport said the right engine backfired and trailed black smoke during the takeoff ground roll. Reportedly, the takeoff roll was about 80% longer than normal. Witnesses said the aircraft staggered off the ground, was slow and never got above 100 feet agl. The pilot reported to the tower that the flight had to come back to the runway. Shortly thereafter, witnesses saw the aircraft enter a steep left turn, apparently stall, then crash into some tennis courts. An investigation revealed evidence that the right engine had lost power. A modification kit for the fuel injector reference air lines was incorrectly installed and allowed an unfiltered air source. Spectral analysis of residue (from the right engine turbocharger compressor) revealed that it had the same composition as the alternate air door seal. Traces of the material were found in the fuel injector reference air line. All five occupants were killed. \n", "probable_cause": "Failure of the pilot to attain adequate airspeed before maneuvering (turning) back toward the airport, which resulted in a loss of aircraft control. A factor related to the accident was: improper maintenance/installation of a fuel injector reference air line, which allowed contamination of the injectors and loss of power in the right engine."}