{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-d18s-near-sioux-lookout", "date": "Jul 6, 1996", "type": "Beechcraft D18", "operator": "Rusty%20Myers", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Fort Frances – Granite Lake", "msn": "A-865", "yom": 1952, "flight_number": null, "city": "Sioux Lookout", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Fort Frances, Ontario, with the pilot and four passengers on a visual flight rules (VFR) flight to Granite Lake. The weather was overcast with good visibility on departure. However, about one-half of the way to Granite Lake, just north of Ignace, the pilot encountered an area of increasing rain and decreasing visibility. The pilot made several course deviations to find a route through the poor weather, but eventually could find neither a way out of the poor weather nor a lake with suitable conditions for landing. While manoeuvring at low level and with heavy rain obscuring the horizon, the pilot reported that the engines lost partial power because of carburettor icing. The pilot applied carburettor heat but was unable to restore engine power or sustain aircraft altitude. The pilot attempted to keep the aircraft level, and in a matter of seconds, the aircraft descended into the trees. The aircraft travelled approximately 500 feet through the trees; the left wing was torn off and a fuel-fed fire broke out almost immediately. All occupants survived the crash with minor injuries and exited the aircraft. The passenger occupying the copilot seat received burns to his upper body. The crash site was overflown about 15 minutes later by a second company pilot who transmitted a Mayday. The occupants were picked up by helicopter about one hour later", "probable_cause": "The pilot continued the flight into adverse weather at low level and force-landed the aircraft into trees when the engines experienced a partial power loss that was probably caused by carburettor icing."}