{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-500tp-malibu-meridian-marshfield-3-killed", "date": "Nov 22, 2008 at 2309 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "TES Leasing", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Green Bay – Marshfield", "msn": "46-97364", "yom": 2008, "flight_number": null, "city": "Marshfield", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 749, "captain_hours_type": 60, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 153, "circumstances": "Witnesses reported that the airplane appeared to be making a normal approach for landing when it suddenly rolled to the left, descended, and impacted the terrain about one-half mile from the runway. On arrival at the scene, the witnesses saw the airplane fully engulfed in flames. The flight was operating in night visual meteorological conditions and the runway lights were illuminated at the time of the accident. The pilot communicated no problems or difficulties while in contact with air traffic control (ATC) during the accident flight. A postaccident examination of the airframe and engine did not reveal any anomalies associated with a pre-impact failure or malfunction. Radar track data and weather observations indicated that the pilot climbed through an overcast cloud layer without the required ATC clearance, en route to his intended destination. The pilot previously had been issued a private pilot certificate with single and multi-engine airplane ratings upon successful completion of the prescribed practical tests. He was subsequently issued a commercial pilot certificate, which included the addition of an instrument airplane rating, based on military flight experience. However, a review of military records and statements from his family indicated that the pilot had never served in the military. The pilot's medical history and toxicology testing showed he had a history of back pain and was taking medication for that condition that commonly causes impairment. However, the time proximity for the pilot having taken the medication prior to the accident flight and any possible impairment, could not be determined.", "probable_cause": "The pilot's failure to maintain control of the airplane during final approach for landing in night, visual meteorological conditions for undetermined reasons."}