{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110c-bandeirante-senador-jose-porfirio-2-killed", "date": "Jan 25, 2010 at 1320 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Piquiatuba%20Taxi%20Aereo", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Belém - Senador José Porfirio", "msn": "110-103", "yom": 1976, "flight_number": null, "city": "Senador José Porfírio", "zone": "Pará", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 12350, "captain_hours_type": 3887, "copilot_hours": 701, "copilot_hours_type": 265, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Belém, the crew started the descent to Senador José Porfirio-Wilma Rebelo Airport in marginal weather conditions. On approach, the crew noticed an elevation of the left engine turbine temperature. The captain reduced the power on both engines and elected to make an emergency landing when the aircraft stalled and crashed in an open field located 4 km short of runway. The captain and a passenger were killed. All eight other occupants were killed, three seriously. The aircraft was destroyed. ", "probable_cause": "The following findings were identified:\r\n- Weather conditions made it difficult for the crew to locate the runway; \r\n- The crew failed to follow the emergency procedures and was unable to keep the aircraft level;\r\n- The captain did not feather the left propeller, which resulted in increased drag and reduced aircraft speed;\r\n- The engine maintenance did not meet the engine manufacturer's requirements; \r\n- No technical overhaul of the left engine had been carried out despite the fact that the 12-year calendar limit set by the manufacturer had been exceeded; \r\n- A nipple mounted on the left propeller governor was not intended for aeronautical use; \r\n- The poor seal caused by the improper connection allowed the pressure to drop, resulting in a loss of power on the left engine; \r\n- Poor organizational culture by the operator, which compromised the safety of the operation; \r\n- The company did not have an effective supervision program; \r\n- Poor judgment on part of the captain;\r\n- Poor aircraft maintenance."}