{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950-whangarei-2-killed", "date": "Nov 22, 2005 at 1142 LT", "type": "Fletcher FU-24", "operator": "Super%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "207", "yom": 1975, "flight_number": null, "city": "Whangarei", "zone": "Northland Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 16000, "captain_hours_type": 2382, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10597, "circumstances": "On 21 November 2005, the day before the accident, the pilot had completed a day of aerial topdressing in ZK-DZG, a New Zealand Aerospace Industries Fletcher FU24-950, then flown the aircraft with his loader-driver as a passenger to Whangarei Aerodrome. That evening the pilot contacted his operator’s (the company’s) chief engineer in Hamilton and said that the airspeed indicator in ZK-DZG was stuck on 80 knots. The chief engineer told him the pitot-static line for the indicator was probably blocked and to have a local aircraft engineer blow out the line. Early the next morning, the day of the accident, the pilot flew ZK-DZG with his loader-driver on board to an airstrip 50 km north-west of Whangarei to spread fertiliser on a farm property. As the morning progressed, the weather conditions became unsuitable for aerial topdressing. At about 1020, the pilot used his mobile telephone to talk to another company pilot at Kerikeri, and told him that the wind was too strong for further work. The conversation included general work-related issues and ended about 1045, with the pilot saying that he was shortly going to return to Whangarei and go to his motel. Before leaving for Whangarei, the pilot spoke with a truck driver who had delivered fertiliser to the airstrip about 1100. The driver commented later that the pilot said the wind had picked up enough to preclude further topdressing. After they had covered the fertiliser, the pilot told the driver that he and the loader-driver would fly to Whangarei. The driver did not recall anything untoward, except that the pilot had casually mentioned there was some electrical fault causing an amber light in the cockpit to flicker and that it would only be a problem if a second light came on. He said the pilot did not appear to be concerned about the light. The driver then left and did not see the aircraft depart. The pilot used his mobile telephone to tell an aircraft engineer at Whangarei Aerodrome about the airspeed indicator problem and asked him if he could have a look at it and blow out the pitot-static system. The engineer believed the call was made from the ground at about 1130, but he could not be certain of the time. The engineer agreed to rectify the problem and the pilot said he would arrive at the Aerodrome about noon. The engineer said he did not know that the pilot had spent the previous night in Whangarei or that the aircraft had been parked at the Aerodrome overnight. ZK-DZG was equipped with a global positioning system (GPS) and its navigation data was downloaded for analysis. From the data it was established that the aircraft departed from the airstrip at 1131 and flew for about 39 km on a track slightly right of the direct track to Whangarei Aerodrome, before altering heading direct to the aerodrome and Pukenui Forest located 5 km west of Whangarei city. A witness who had some aeroplane pilot flying experience, and was on a property close to the track of ZK-DZG, said he saw the aircraft fly past shortly after about 1130 at an estimated height of 500 feet. He watched it fly in the direction of Pukenui Forest for about 40 seconds before turning his head away. A short time later he turned again to look at the aircraft, which by then was just above the horizon about 2 ridges away. He said there was a strong, constant wind blowing from the right (south) of the aircraft, which appeared to be drifting sideways and rocking its wings. He then saw the aircraft enter a steep descending turn that seemed to tighten before it disappeared from view. He estimated it to have turned about 270 degrees. Another witness near the aircraft track and accident site reported seeing the aircraft at about 1140 flying just above the tree line and thought it might have been “dusting” the forest. The aircraft then turned and disappeared behind some trees. Other witnesses who heard or saw the aircraft described the weather as squally throughout the morning with strong winds from the south, and said that near the time of the accident there was no rain. The witnesses noticed nothing untoward with the aircraft itself, and at the time none was concerned that the aircraft may have been involved in an accident. The local aircraft engineer said he was not concerned when ZK-DZG did not arrive at Whangarei, because from his experience it was not unusual for agricultural pilots to change their plans at the last minute and to not inform the engineers. He described his conversation with the pilot as being casual and said the pilot did not mention that he was finishing topdressing for the day because of the weather. He thought the pilot was just trying to fit in the maintenance work and that his plans had changed. The pilot had not asked him to provide any search and rescue watch, nor did the engineer expect him to because he could not recall any pilot having asked him to do so. There was no evidence that the pilot made any radio calls during the flight. The frequency to which the radio was selected and its serviceability could not be determined because of the accident damage. At about 2200 a member of the pilot’s family contacted the emergency services when she became concerned that there had been no contact from the pilot. An extensive aerial search began at first light the next morning, and at about 1120 the wreckage of ZK-DZG was located about 50 metres (m) below a ridge in a heavily wooded area of Pukenui Forest, at an elevation of 920 feet above sea level. Both occupants were fatally injured. ", "probable_cause": "Findings are listed in order of development and not in order of priority.\r\n- The pilot was correctly licensed, experienced and authorised for the flight.\r\n- The pilot was operating the aircraft in an unserviceable condition because of a stuck airspeed indicator, which prevented him accurately assessing the aircraft airspeed. Consequently the\r\naircraft could have exceeded its airspeed limitations by some degree in the turbulent conditions. \r\n- The structural integrity of the vertical fin had been reduced to such an extent by a cluster of unnoticed pre-existing fatigue cracks in its leading edge that eventual failure was inevitable. When the fin failed, it brought about an unrecoverable loss of control and the accident.\r\n- Although the early design of the vertical fin met recognised requirements, it did not provide for any structural redundancy and the leading edge of the fin (a structural component) was not\r\ndamage-tolerant.\r\n- The cracks in the fin leading edge went unnoticed until the failure, most likely because an approved black rubber anti-abrasion strip along that surface had prevented any detailed examination of it.\r\n- The approved maintenance programmes did not reflect the inspection-dependent nature of the vertical fin for its ongoing airworthiness, with the inspection periods having been extended over\r\nthe years without full consideration given to the importance of frequent inspections for timely detection of fatigue damage.\r\n- There was no evidence that the fitment of a more powerful STC-approved turbine engine, in place of a piston engine, had initiated the fatigue cracks in the fin leading edge. However, once\r\nstarted, the extra engine power might have contributed to the rate of propagation of the cracks.\r\n- The vertical fin defects and failures in the Fletcher aircraft over the years were not confined to turbine-powered aircraft.\r\n- The CAA’s STC approval process for the turbine engine installation was generally robust and had followed recognised procedures, but the process should have been enhanced by an in-depth\r\nevaluation of the fatigue effects on the empennage.\r\n- Given the generally harsh operating environment and frequency of operations for the turbine powered Fletcher, the continued airworthiness requirements of the fin were not scrutinised as\r\nrobustly as they should have been during the STC approval process. Consequently the maintenance programmes had not been improved to ensure the ongoing structural integrity of the fin. "}