{"url": "https://www.baaa-acro.com/crash/crash-fokker-100-almaty-12-killed", "date": "Dec 27, 2019 at 0721 LT", "type": "Fokker 100", "operator": "Bek%20Air_0", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Almaty – Nursultan", "msn": "11496", "yom": 1996, "flight_number": "Z92100", "city": "Almaty", "zone": "Almaty Province", "country": "Kazakhstan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 1, "pax_on_board": 93, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 20141, "captain_hours_type": 3956, "copilot_hours": 11544, "copilot_hours_type": 4144, "aircraft_hours": 44632, "circumstances": "The Fokker 100 departed Almaty Airport on a regular schedule service (flight Z92100) to Astana-Nursultan Nazarbayev Airport, carrying 93 passengers and a crew of five. During the takeoff roll on runway 05R with flaps at zero, after a course of 36 seconds and at a speed of 148 knots, the crew started the rotation. Immediately after liftoff, the airplane rolled to the right at an angle of 5° then to the left at an angle of 19° without an increase of the indicated airspeed. After reaching the height of 20 feet in a pitch angle of 14°, the airplane started to descend then hit the runway surface with the base of the tail. It landed on its main landing gear and rolled for about 15 seconds with the nose gear still in the air. The airplane took off again at a speed of 138 knots then the crew retracted the landing gear. In a pitch angle of 19°, the airplane lost speed (130 knots), veered to the right, belly landed and slid for about 850 metres, went through a fence and eventually crashed into a house located near the perimeter fence, some 80 metres to the right of the extended center line. 47 occupants were injured, 39 escaped unhurt and 12 others were killed, among them the captain. The aircraft was destroyed. There was not fire. ", "probable_cause": "The accident was the consequence of an asymmetrical loss of wing lift properties at the stage of takeoff, which resulted in the aircraft crashing down immediately after leaving the runway and rolling to the right on the snowy ground, breaching the airport perimeter fence and colliding with a two-story private building located 9-10 m from the fence. As a result of collision, 11 passengers and one crew member died and 47 passengers received different injuries because of overloading, striking, destruction and crushing of the aircraft structure. The cause of the loss of wing lift properties was most likely the effect of ground icing.\r\nContributing factors:\r\n- The crew, after analyzing the actual meteorological situation at Almaty airport, may not have drawn sufficient conclusions to better inspect the entire aircraft and especially (tactile method) the leading edge of the wing;\r\n- The Flight Safety Management System (FMS) of Beck Air JSC contains mainly only general provisions and specific actions that were not adapted for implementation, which did not allow timely identification and elimination of existing risks affecting flight safety.\r\n- Collision of the aircraft with a two-storey private structure, which affected the severity of the consequences."}