{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e18-west-end-1-killed", "date": "Aug 28, 1995 at 1331 LT", "type": "Beechcraft E18", "operator": "Avmac Air", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Orlando - Freeport", "msn": "BA-427", "yom": 1959, "flight_number": null, "city": "West End", "zone": "West Grand Bahama", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9497, "circumstances": " On August 28, 1995, about 1331 eastern daylight time, a Beech E18S, N171LG, registered to Caribbean Leasing Company, and operated by Avmac Air, Inc., as a 14 CFR Part 135 nonscheduled international cargo flight, from Orlando, Florida, to Freeport, Bahamas, crashed into the Atlantic Ocean, about 45 miles northwest of Freeport. Instrument meteorological conditions prevailed at the time and an instrument flight rules flight plan was filed. The aircraft was destroyed. The airline transport-rated pilot has not been located and is presumed to have been fatally injured. The flight originated from Orlando, on August 28, 1995, about 1229.  A person identifying himself as the pilot of N171LG contacted the FAA Miami Flight Service Station by radio at 1328:33. The pilot reported he was 46 miles northwest of Freeport and requested information on the weather at Freeport. The pilot was given the weather. At 1330:15 the pilot reported he had an emergency. The controller asked what is the emergency and the pilot reported \"fire onboard.\" No further transmissions from the flight were received and attempts to contact the flight were unsuccessful. See the transcript of communications.  Search and rescue efforts were initiated and at 1600, a oil slick, the left main landing gear from N171LG, and personal effects of the pilot and debris from the cabin contents were found floating on the ocean surface, 40 miles northwest of Freeport. Examination of the recovered debris showed no evidence of fire damage. The main wreckage of N171LG was not located and recovered.", "probable_cause": "The cause of the accident could not be determined. "}