{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-76md-moscow-10-killed", "date": "Jul 14, 2001 at 0853 LT", "type": "Ilyushin II-76", "operator": "Russ%20Air%20Transport", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow – Norilsk – Bratsk – Taiyuan", "msn": "00434 51530", "yom": 1984, "flight_number": "RUR9633", "city": "Moscow-Chkalovsky", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3523, "circumstances": "The aircraft was engaged in a cargo flight from Moscow to Taiyuan, China, with intermediate stops in Norilsk and Bratsk, carrying two passengers, eight crew members and a load of 40,2 tons of construction materials. Due to foggy conditions, the horizontal visibility was reduced to 500-900 metres and the vertical visibility was estimated to be 70-80 metres. Following a takeoff roll of about 2,700 metres, the captain started the rotation at a speed of 290 km/h (about 25 km/h above the recommended speed). At a height of about 10 metres, the pilot-in-command started a turn to the right of 7° in order to compensate a deviation to the left during the takeoff roll. At a height of 23-24 metres, the stabilizers' position changed from -5,4° to -3,9° and the aircraft started to lose altitude. One second prior to impact, the elevator were in a 11-12° pitch angle and at a height of 20-21 metres, both right engines n°3 and 4 collided with trees at a distance of 930 metres from the runway end and 47 metres to the right of its extended centerline. Upon impact, both engines were torn off and the aircraft crashed in a wooded area located 1,460 metres past the runway end, bursting into flames. The aircraft was totally destroyed and all 10 occupants were killed. ", "probable_cause": "The following contributing factors were identified:\r\n- A series of negligences was noted in the operations of the company and the maintenance of the airplane,\r\n- The flight was not properly prepared and the total weight of the aircraft was well above the MTOW,\r\n- Due to the combination of the following factors, the pilots did not take the corrective actions to maintain a good climb path:\r\n- Lack of seriousness and lack of documentation control during cargo loading at Chkalovsky Airport,\r\n- Lack of rigor and non-compliance with standard operating procedures regarding the pre-takeoff check of the cargo, which led the ground personnel to load cargo with a total weight in excess of 13,6 to 14 tons,\r\n- At takeoff, the total weight of the aircraft was estimated to be 204 tons while it was certified for a maximum weight of 191.9 tons taking into account all factors at the time of the accident,\r\n- All crew members were unable to identify in due time the successive errors made by the captain (pilot-in-command), among others the stabilizers that were prematurely positioned in an angle of -3.9 ° while the trailing edge flaps were retracted, causing the lift to be insufficient, \r\n- The coordination within the flight crew was ineffective and the copilot and the navigator did not pay sufficient attention to the altitude of the aircraft through flight conditions in reduced visibility,\r\n- Lack of visibility caused by foggy conditions which did not allow the flight crew to distinguish in time the obstacles located past the runway end,\r\n- As a result of this accident, the operator certificate was revoked."}