{"url": "https://www.baaa-acro.com/crash/crash-gvf-ps-84-moscow-0", "date": "Aug 6, 1941 at 0550 LT", "type": "GVF PS-84", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pakhomovo - Moscow", "msn": "6 5 20", "yom": 1941, "flight_number": null, "city": "Moscow-Vnukovo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "In the early morning of August 6, two GVF PS-84 registered CCCP-L3480 and CCCP-L3432 departed Pakhomovo on a positioning flight to Moscow-Vnukovo. Due to the actual situation, the crew was unable to receive information about weather conditions at the destination airport and the person in charge at Pakhomovo Airport cleared both crew to takeoff without receiving any information about the weather conditions at destination. About 3 to 5 minutes separated both takeoffs. Upon arrival at Vnukovo Airport, the crew of CCCP-L3480 encountered foggy conditions, initiated a go around procedure and followed a circuit. As the second airplane was attempting to land, it collided with the first one that was attempting to land on the same runway but from the opposite direction. Both airplanes crash landed. CCCP-L3480 was repaired and returned to service while CCCP-L3432 was damaged beyond repair. The crew was injured. ", "probable_cause": "The collision was the consequence of the combination of the following factors:\r\n- The person in charge at Pakhomovo Airport cleared both crew to takeoff without receiving any information about the weather conditions at destination,\r\n- Both crew departed Pakhomovo without such information, \r\n- Lack of discipline on part of both crew,\r\n- Lack of visibility at destination airport due to foggy conditions, \r\n- Lack of communications between both airports, \r\n- Poor organization and supervision at Vnukovo Airport. "}