{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950m-near-matakana-1-killed", "date": "May 6, 1987 at 1453 LT", "type": "Fletcher FU-24", "operator": "Fieldair", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "88", "yom": 1962, "flight_number": null, "city": "Matakana", "zone": "Auckland Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "An aerial topdressing operation was being undertaken from a sloping airstrip located on a headland near Matakana. The fertilizer to be applied was granulated superphosphate totaling 60 tonnes. The aircraft arrived at the airstrip and while waiting for the loader to arrive the pilot walked the length of the runway, then requested that the farmer cut down some saplings at the end of the strip that might obstruct his climb out path. Upon arrival of the loader the pilot instructed the driver to place 18 hundredweight (cwt) or 915 kgs of fertilizer in the aircraft. This was done, along with the addition of some fuel, and the first flight of the operation commenced. The driver did not observe the take off but while reloading his vehicle at the bin noticed a cloud of fertilizer dust off the end of the strip, indicating that the pilot had jettisoned the load. A few minutes later the driver sighted the aircraft briefly through a gap in the trees. It was flying, apparently normally, at about sowing height and on a reciprocal course to the take off direction. A faint trail of fertilizer was coming from the hopper. The plane then disappeared behind some trees and the driver did not see it again. Just after losing sight of the aircraft he saw what seemed to be a piece of red paper fluttering to the ground. When the aircraft failed to land a search was made and the wreckage of ZK-CBI was found in dense scrub about 350 metres to the left of the departure end of the airstrip. The pilot, sole on board, was killed. The investigator found that the pilot had initiated jettisoning the load 36 metres before the boundary fence. It was not clear whether the plane was still on the ground or was airborne at a low speed when a collision with the concrete post and wire fence occurred. Two posts had almost completely severed both halves of the \" all flying \" tailplane or stabilator. The outboard left hand section was retained by the trim tab only. The outboard part of the right hand side of the stabilator later detached and was found 150 metres from the crash site. With this degree of damage to the tailplane horizontal control must have been difficult, but the pilot was able to clear a low ridge ahead and fly out over a large basin where a 180 degree turn was completed in order to land back on the airstrip. Before the approach could be completed however, the outer part of the RH side of the stabilator separated and the aircraft dived steeply to the ground. The aircraft was destroyed by the severe impact. Fire did not break out. This was not a survivable crash.", "probable_cause": "The probable cause of this accident was that the pilot did not initiate the jettisoning of the load in time to restore the take off performance which had been degraded by the kikuyu grass on the airstrip. The following findings were reported: \r\n- The aircraft was loaded within approved limits.\r\n- Kikuyu grass growing on the airstrip caused a significant deterioration in the acceleration of the plane on take off.\r\n- The aircraft was capable of normal operation before the collision with the fence.\r\n- The collision caused critical damage.\r\n- Some minutes after the collision about 1/4 of the total horizontal stabilizer area separated from the aircraft causing it to become uncontrollable in pitch and dive to the ground."}