{"url": "https://www.baaa-acro.com/crash/crash-hawker-siddeley-hs121-trident-1c-london-118-killed", "date": "Jun 18, 1972 at 1711 LT", "type": "Hawker Siddeley HS.121 Trident", "operator": "BEA", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "London - Brussels", "msn": "2109", "yom": 1964, "flight_number": "BE548", "city": "London-Heathrow", "zone": "London Metropolis", "country": "United Kingdom", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 109, "pax_fatalities": 109, "other_fatalities": 0, "total_fatalities": 118, "captain_hours": 15000, "captain_hours_type": 4000, "copilot_hours": 1400, "copilot_hours_type": 750, "aircraft_hours": null, "circumstances": "Following a normal takeoff roll on runway 28R, the aircraft rotated 42 seconds after brakes were released and lifted off 2 seconds later at 145 knots IAS. At 63 seconds the autopilot was engaged 355 feet above the runway at 170 knots IAS; the IAS speed lock was selected shortly thereafter. At 74 seconds the aircraft started a 20° banked turn to port towards the Epsom Non-Directional Beacon (NDB). At 83 seconds the captain reported 'Climbing as cleared'. He was then instructed to change frequency and contact London Air Traffic Control Centre. At 93 seconds the noise-abatement procedure was initiated. On the assumption that the captain was the handling pilot, this would involve the second officer selecting the flaps fully up and operating the thrust levers to reduce power to the pre-calculated figure. At 100 seconds the captain called 'Passing 1500' and at 103 seconds the aircraft was cleared to climb to Flight Level 60. This message was acknowledged by the captain at 108 seconds with the terse call 'up to 60'. This was the last message received from the flight. At second 114 when the airspeed was 162 knots and the altitude 1,772 feet, the droop lever was selected up putting the aircraft into the area of the stall as the droop started to move. At second 116 the stick-pusher stall recovery device operated, causing the autopilot automatically to disengage and the nose of the aircraft to pitch down and the stick-push to cease as the incidence decreased. Since the elevator trim would stay at its position on autopilot disengagement which at that speed with the droop up would be - the incidence then increased causing a second stick-push at second 124 and a third at second 127. At second 128 the stall recovery system was manually inhibited by pulling the lever. The aircraft then pitched up rapidly, losing speed and height, entering very soon afterwards the true aerodynamic stall and then a deep stall from which at that height no recovery was possible. Impact was at second 150 in a field next to the A30 motorway. The aircraft was totally destroyed and none of the 118 occupants survived the crash.", "probable_cause": "The immediate causes of the accident were these:\r\n- A failure by Captain Key to achieve and maintain adequate speed after noise-abatement procedures,\r\n- Retraction of the droops at some 60 knots below the proper speed causing the aircraft to enter the stall regime and the stick-shaker and pusher to operate,\r\n- Failure by the crew to monitor the speed errors and to observe the movement of the droop lever, \r\n- Failure by the crew to diagnose the reason for the stick-shaker operation and the concomitant warnings, \r\n- The dumping by the crew of the stall recovery system.\r\nThe underlying causes were these:\r\n- The abnormal heart condition of Captain Key leading to lack of concentration and impaired judgment sufficient to account for his toleration of the speed errors and to his retraction of, or order to retract, the droops in mistake for the flaps,\r\n- Some distraction, the nature of which is uncertain, possibly due to the presence of Captain Collins as a passenger on the flight deck, which caused S/O Ticehurst's attention to wander from his monitoring duties, \r\n- Lack of training directed at the possibility of 'subtle' pilot incapacitation, \r\n- Lack of experience of S/O Keighley, \r\n- Lack of knowledge in the crew of the possibility or implication of a change of configuration stall, \r\n- Lack of knowledge on the part of the crew that a stick-shaker and push might be experienced almost simultaneously and of the probable cause of such an event, \r\n- Lack of any mechanism to prevent retraction of the droops at too low a speed after flap-retraction. "}