{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-35-dk-dakota-iii-dolwyddelan-23-killed", "date": "Jan 10, 1952 at 1915 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Aer%20Lingus-1", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Northolt – Dublin", "msn": "16699/33447", "yom": 1945, "flight_number": null, "city": "Dolwyddelan", "zone": "Caernarfonshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 20, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 23, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 1725LT, the aircraft christened 'Saint Kevin' took off from Northolt Airport en route for Dublin, carrying a crew of three and twenty passengers. The flight was without incident as far as Welshpool. The intended course from this point onwards until the coast was reached at a point near Harlech, lay over the Welsh mountains with heights rising to about 3,000 feet. At 1855LT the 'Saint Kevin', which throughout was flying under Instrument Flight Rules, asked and received permission from Preston Air Traffic Control to ascend from 4,500 feet which was the planned height of the flight, to 6,500 feet, being the next authorized level for westbound flights on this route. No reason was given for this request.  At about 1912LT the aircraft reported its position to be over Nevin. At some time between 1912LT and 1915LT, the 'Saint Kevin', having changed to the Dublin frequency requested descent clearance. Dublin acknowledged this request and granted clearance which was not acknowledged. No further radio messages were received. At about 1915LT the aircraft crashed approximately 18 nautical miles from Nevin Beacon in a northerly direction, at a point about 4 nautical miles ESE from the summit of Snowdon. All 23 occupants lost their lives. ", "probable_cause": "The cause of the accident could not be determined with certainty. However, investigators concluded that the combination of several factors contributed to the accident, such as weather conditions (clouds, icing, turbulences), pilot decision, evaluation of the situation in flight, flight conditions, etc. Please refer to the final report below. "}