{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-131f-santa-cruz-113-killed", "date": "Oct 13, 1976 at 1332 LT", "type": "Boeing 707", "operator": "LAB%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Santa Cruz - Miami", "msn": "17671", "yom": 1959, "flight_number": null, "city": "Santa Cruz-El Trompillo", "zone": "Santa Cruz", "country": "Bolivia", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 110, "total_fatalities": 113, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After a long takeoff roll, the airplane took off from runway 32 but encountered serious difficulties to gain sufficient height. After liftoff, the airplane continued at a height of about six metres then struck successively trees, houses and power cables before crashing in a huge explosion on a soccer field located about 560 metres past the runway end. The aircraft disintegrated on impact and several houses and buildings were destroyed. All three crew members were killed as well as 110 people on the ground. 32 others were injured, most of them seriously. Weather conditions at the time of the accident were considered as marginal but did not contribute to the mishap.", "probable_cause": "It was reported that the Flight Data Recorder (FDR) was unserviceable at the time of the accident while the Cockpit Voice Recorder (CVR) contained only few information as the main cockpit mike was inoperative. Investigators confirmed that the accident was not caused by any engine failure, flight control malfunction or any structural failure. It is believed that the accident was the consequence of a poor flight preparation and wrong takeoff configuration on part of the crew who failed to select the correct takeoff speed. The following factors were considered as contributing:\r\n- Crew fatigue, \r\n- Wrong interpretation of the takeoff situation, \r\n- Non interruption of the takeoff procedure.  "}