{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-warracknabeal", "date": "May 6, 1969 at 1935 LT", "type": "Rockwell Shrike Commander 500", "operator": "Executive Air Services (Australia)", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Melbourne – Warracknabeal", "msn": null, "yom": null, "flight_number": null, "city": "Warracknabeal", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5427, "captain_hours_type": 966, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At approximately 1935 hours EST on 6 May, 1969 an Aero Commander 500S aircraft, registered VH-EXT, struck the ground and crashed 2 miles west of Warracknabeal Aerodrome, Victoria, while making an approach to land at that aerodrome. The aircraft was owned and operated by Executive Air Services Pty. Ltd. of Melbourne and at the time of the accident it was engaged on a scheduled passenger commuter service between Essendon and Warracknabeal. The pilot, Allan James WALKER, and one passenger received minor injuries. A second passenger, the only other occupant, was seriously injured. The aircraft was virtually destroyed by impact forces. The pilot, aged 28 years, held a Current Commercial Pilot Licence, which was endorsed for the Aero Commander type of aircraft. He was the holder of a Class One Instrument Rating and this rating had been renewed after a flight test on 2 April, 1969. His total flying experience amounted to 5427 hours and of this, 966 hours had been flown on Aero Commander aircraft. He had recorded totals of 335 hours of instrument flying and 292 hours of night flying. The aircraft was operating under a current certificate of airworthiness and there is no evidence to indicate that the aircraft was other than in an airworthy condition. There is no evidence that the gross weight of the aircraft and the position of the centre of gravity were other than within the specified limits throughout the flight. The weather at Warracknabeal at the time of the accident was fine. There was no cloud and the wind was from the south east at 10 to 15 knots. The night visibility, that is, the distance at which prominent lighted objects could be seen and recognised, was reported to be 20 miles but it was a very dark night and there was virtually no visible horizon. The aircraft departed Essendon at 1836 hours using the procedures applicable to flight under the Instrument Flight Rules. The night to Warracknabeal at 6,500 feet was uneventful and the pilot commenced descent when the aircraft was approximately 40 miles from that destination. During the descent he observed the lights of the town of Warracknabeal and the lighting at the aerodrome. After entering the circuit the pilot commenced a downwind leg for a landing towards the east on runway 08. He made a left turn onto base leg and noted the indicated altitude as 1, 000 feet and at that altitude the clearance between the aircraft and the local terrain should have been slightly more than 600 feet. On the base leg of the circuit the pilot was unable to see the runway lights and being unsure of his position, he elected to conduct a go around. He did not retract the undercarriage, which had been extended earlier in preparation for landing, and the pilot continued the second circuit at 1, 000 feet indicated altitude rather than climbing to establish 1, 000 feet terrain clearance which would have been the normal procedure. He flew over the non-directional beacon, which is located approximately 300 yards north of the western end of the runway on which he intended to land arid he then positioned the aircraft for the downwind leg of the circuit.", "probable_cause": "The probable cause of the accident was that the pilot, in approaching an aerodrome at night, did not use appropriate circuit procedures and did not make full use of the available visual and instrument information to ensure adequate terrain clearance."}