{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-850-truckee", "date": "Dec 13, 2009 at 1738 LT", "type": "Socata TBM-850", "operator": "Tahoe Investments", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Carlos – Truckee", "msn": "489", "yom": 2008, "flight_number": null, "city": "Truckee", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1738, "captain_hours_type": 1098, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 196, "circumstances": "During the flight, the instrument-rated private pilot was monitoring the weather at his intended destination. He noted the weather and runway conditions and decided to conduct a global-positioning-system instrument approach to a known closed runway with the intention of circling to a different runway. As the airplane neared the missed approach point, the pilot established visual contact with the airport's runway environment and canceled his instrument flight rules clearance. As he entered the left downwind leg of the traffic pattern for his intended runway, the pilot noticed that the first part of the runway was covered in fog and that the visibility was 0.75 of a mile with light snow. With at least 5,000 feet of clear runway, he opted to land just beyond the fog. Prior to touchdown, the pilot concluded that there was not enough runway length left to make a landing and performed a go-around by applying power, pitching up, and retracting the landing gear. During the go-around, the pilot focused outside the airplane cockpit but had no horizon reference in the dark night conditions. He heard the stall warning and realized that the aircraft was not climbing. The pilot pitched the nose down and observed only snow and trees ahead. Not being able to climb over the trees, the airplane subsequently impacted trees and terrain, coming to rest upright in a wooded, snow-covered field. The pilot stated that there were no anomalies with the engine or airframe that would have precluded normal operation of the airplane.", "probable_cause": "The pilot’s failure to maintain an adequate airspeed and clearance from terrain during an attempted go-around. Contributing to the accident was the pilot's decision to land on a partially obscured runway."}