{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-wollongong-1-killed", "date": "Apr 2, 1989 at 1030 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Aviation%20Centre", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Sydney - Wollongong", "msn": "61-0849-8162154", "yom": 1981, "flight_number": null, "city": "Wollongong", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was to conduct a charter with passengers from Sydney to Wollongong, Nowra, Canberra and return to Sydney, departing Sydney at about 10.00am. Earlier that morning he positioned the aircraft at Sydney and had it refuelled. When the passengers arrived he explained that the weather in the various destinations was very poor and that there was a possibility they may not be able to land. However, he was prepared to give it a try. As the passengers were pressed for time, they could not afford to take a chance with the weather and so they decided to drive. They told the pilot that if he could land at Wollongong later that day they would continue the flight with him. However, they impressed on him that there was no pressure for him to depart immediately as they would not be in Wollongong for several hours. After driving for a short time, the passengers decided that the weather did not appear as if it would improve, and believed that it would be better to complete the journey by car. They contacted the charter company by phone to cancel the charter, but the pilot had already departed. The flight to Wollongong appears to have proceeded normally where the pilot reported commencing an NDB approach, and would call again at a specified time. This was the last message received from the pilot. Witnesses on the ground at Wollongong, and on a yacht 20 nautical miles to the east of Wollongong reported hearing an aircraft flying at approximately 1000 to 2000 feet in the low cloud and rain. There were no other known aircraft in the area. Later that day a helicopter discovered wreckage debris in the sea, which was confirmed as being from the aircraft. The search was discontinued due to very poor weather and visibility, and cancelled two weeks later when further efforts failed to locate any trace of the aircraft. ", "probable_cause": "The reason why the aircraft flew into the sea could not be determined."}