{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-namsos-6-killed", "date": "Oct 27, 1993 at 1916 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Wideroe_1", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Trondheim - Namsos", "msn": "408", "yom": 1974, "flight_number": "WF744", "city": "Namsos", "zone": "Nord-Trøndelag", "country": "Norway", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 17, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 4835, "captain_hours_type": 1998, "copilot_hours": 6354, "copilot_hours_type": 1365, "aircraft_hours": 40453, "circumstances": "On approach to Namsos Airport by night, the crew encountered poor visibility due to rain falls. In below weather minima, the crew descended below the minimum safe altitude until the aircraft struck the ground and crashed in a swampy area located about 6 km short of runway. The aircraft was destroyed on impact and six occupants including both pilots were killed. All 13 other occupants were injured. ", "probable_cause": "The accident was the consequence of a controlled flight into terrain. The following findings were reported: \r\n- The company had failed to implement a standardized concept of aircraft operation that the pilots fully respected and lived by;\r\n- The approach briefing was not not fully implemented in accordance with the rules. There were deficiencies in:\r\n- \"Call outs\" during the approach\r\n- Descent rate (feet/min) during \"FAF inbound\"\r\n- Timing \"outbound\" from the IAF and the time from FAF to MAPt;\r\n- The crew did not execute the \"base turn\" at the scheduled time, with the consequence that the plane ended up about 14 NM from the airport;\r\n- The Pilot Flying ended the approach with reference to aircraft instruments and continued on a visual approach in the dark without visual reference to the underlying terrain. During this part of the approach the aircraft's position was not positively checked using any available navigational aids;\r\n- Both crew members had in all likelihood most of the attention out of the cockpit at the airport after the Pilot Not Flying announced that he had it in sight;\r\n- The crew was never aware of how close they were the underlying terrain;\r\n- The last part of the descent from about 500 feet indicated altitude to 392 feet can be caused by inattention to the fact that the plane may have been a little out of trim after the descent;\r\n- Crew Cooperation during the approach was not in accordance with with the CRM concept and seems to have ceased completely after the Pilot Not Flying called \"field in sight\";\r\n- Before the accident the company had not succeeded well enough with the introduction of standardization and internal control/quality assurance. This was essentially because the management had not placed enough emphasis on awareness and motivate employees;\r\n- The self-control system described in the airline operations manual and the parts of the quality system, was not incorporated in the organization and served as poor safety governing elements;\r\n- Neither the Norwegian CAA nor the company had defined what visual reference to terrain is, what sufficient visual references are and what the references must be in relation to a moving aircraft."}