{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-331b-santa-maria-144-killed", "date": "Feb 8, 1989 at 1408 LT", "type": "Boeing 707", "operator": "Independent-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bergame - Santa Maria - Punta Cana", "msn": "19572", "yom": 1968, "flight_number": "IDN1851", "city": "Santa Maria", "zone": "Azores Islands", "country": "Portugal", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 137, "pax_fatalities": 137, "other_fatalities": 0, "total_fatalities": 144, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 44755, "circumstances": "Independent Air flight IDN1851, a Boeing 707, departed Bergamo, Italy (BGY) at 10:04 UTC for a flight to Punta Cana, Dominican Republic (PUJ) via Santa Maria, Azores (SMA). At 13:56:47 Santa Maria Tower cleared the flight to descend to 3000 feet for a runway 19 ILS approach: \"Independent Air one eight five one roger reclear to three thousand feet on QNH one zero two seven and runway will be one niner.\" In that transmission, the trainee controller had transmitted an incorrect QNH that was 9 hPa too high. The actual QNH was 1018.7 hPa. After a brief pause the message resumed at 13:56:59: \"expect ILS approach runway one niner report reaching three thousand.\" This transmission was not recorded on the voice recorder of Flight 1851, probably because the first officer keyed his mike and read back: \"We’re recleared to 2,000 feet and ah ... .\" The first officer paused from 13:57:02 to 13:57:04, then unkeyed the mike momentarily. This transmission was not recorded on the ATS tapes. In the cockpit, the first officer questioned aloud the QNH value, but the captain agreed that the first officer had correctly understood the controller. After being cleared for the ILS approach the crew failed to accomplish an approach briefing, which would have included a review of the approach plate and minimum safe altitude. If the approach plate had been properly studied, they would have noticed that the minimum safe altitude was 3,000 feet and not 2,000 feet, as it had been understood, and they would have noticed the existence and elevation of Pico Alto. At 14:06, the flight was 7.5 nm from the point of impact, and beginning to level at 2,000 feet (610 meters) in light turbulence at 250 KIAS. At 14:07, the flight was over Santa Barbara and entering clouds at approximately 700 feet (213 meters) AGL in heavy turbulence at 223 KIAS. At 14:07:52, the captain said, \"Can’t keep this SOB thing straight up and down\". At approximately 14:08, the radio altimeter began to whine, followed by the GPWS alarm as the aircraft began to climb because of turbulence, but there was no reaction on the part of the flight crew. At 14:08:12, the aircraft was level when it impacted a mountain ridge of Pico Alto. It collided with a rock wall on the side of a road at the mountain top at an altitude of approximately 1,795 feet (547 meters) AMSL.", "probable_cause": "The Board of Inquiry understands that the accident was due to the non-observance by the crew of established operating procedures, which led to the deliberate descent of the aircraft to 2000ft in violation the minimum sector altitude of 3,000 feet, published in the appropriate aeronautical charts and cleared by the Santa Maria Aerodrome Control Tower.\r\nOther factors:\r\n1) Transmission by the Santa Maria Aerodrome Control Tower of a QNH value 9 hPa higher than the actual value, which put the aircraft at an actual altitude 240 feet below that indicated on board,\r\n2) Deficient communications technique on the part of the co-pilot, who started reading back the Tower's clearance to descend to 3000ft before the Tower completed its transmission, causing a communications overlap,\r\n3) Violation by the Aerodrome Control Tower of established procedures by not requiring a complete read back of the descent clearance,\r\n4) Non-adherence by the crew to the operating procedures published in the appropriate company manuals, namely with respect to cockpit discipline, approach briefing , repeating aloud descent clearances, and informal conversations in the cockpit below 10,000 feet,\r\n5) General crew apathy in dealing with the mistakes they made relating to the minimum sector altitude, which was known by at least one of the crew members, and to the ground proximity alarms,\r\n6) Non-adherence to standard phraseology both by the crew and by Air Traffic Control in some of the air-ground communications,\r\n7) Limited experience of the crew, especially the co-pilot, in international flights,\r\n8) Deficient crew training, namely concerning the GPWS as it did not include emergency manoeuvres to avoid collision into terrain,\r\n9) Use of a route which was not authorized in the AIP Portugal,\r\n10) The operational flight plan, whose final destination was not the SMA beacon, was not developed in accordance with the AIP Portugal."}