{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-mobile-1-killed", "date": "Oct 23, 2002 at 1945 LT", "type": "Cessna 208B Grand Caravan", "operator": "Mid-Atlantic Freight", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Mobile - Montgomery", "msn": "208B-0775", "yom": 1999, "flight_number": "BDC282", "city": "Mobile", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4584, "captain_hours_type": 838, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4001, "circumstances": "The airplane was destroyed by impact forces. There was no evidence of fire. Wreckage examinations and all recovered wreckage from the impact area revealed no evidence of an inflight collisionor breakup, or of external contact by a foreign object. An examination of the engine and the propeller indicated that the engine was producing power at impact. The recovered components showed no evidence of preexisting powerplant, system, or structural failures. Wreckage examinations showed crushing and bending consistent with a moderate angle of descent and a moderate right-wing-down attitude at impact. The amount of wreckage recovered indicates that all parts of the airplane were at the crash site. The wreckage was scattered over an area of about 600 feet. An examination of radar and airplane performance data indicated that the accident airplane initiated a descent from 3,000 feet immediately after the accident pilot was given a second traffic advisory by air traffic control. The pilot reported that the traffic was above him. At the time the pilot stated that he needed to deviate, data indicate that the accident airplane was in or entering an uncontrolled descent. Radar data indicated that, after departure from the airport, the closest identified airplane to the accident airplane was a DC-10, which was at an altitude of about 4,000 feet. The horizontal distance between the two airplanes was about 1.1 nautical miles, and the vertical distance between the airplanes was about 1,600 feet. The accident airplane was never in a location at which wake turbulence from the DC-10 would have intersected the Cessna's flightpath (behind and below the DC-10's flightpath). Given the relative positions of the accident airplane and the DC-10, wake turbulence was determined to not be a factor in this accident. Although the DC-10 was left of the position given to the pilot by Mobile Terminal Radar Approach Control, air traffic controllers do not have strict angular limits when providing traffic guidance. The Safety Board's airplane performance simulation showed that, beginning about 15 seconds before the time of the pilot's last transmission (\"I needed to deviate, I needed to deviate\"), his view of the DC-10 moved diagonally across the windscreen from his left to straight in front of the Cessna while tripling in size. The airplane performance simulation also indicated that the airplane experienced high bank and pitch angles shortly after the pilot stated, \"I needed to deviate\" (about 13 seconds after the transmission, the simulation showed the airplane rolling through 90° and continuing to roll to a peak of about 150° 3 seconds later) and that the airplane appeared to have nearly recovered from these extreme attitudes at impact. Performance data indicated that the airplane would had to have been structurally/aerodynamically intact to reach the point of ground impact from the point of inflight upset. There was no evidence of any other aircraft near the accident airplane or the DC-10 at the time of the accident. Soon after the accident, U.S. Coast Guard aircraft arrived at the accident scene. The meaning of the pilot's statement that he needed to deviate could not be determined. A review of air traffic control radar and transcripts revealed no evidence of pilot impairment or incapacitation before the onset of the descent and loss of control. A sound spectrum study conducted by the Safety Board found no evidence of loud noises during the pilot's last three radio transmissions but found that background noise increased, indicating that the cockpit area was still intact and that the airspeed was increasing. The study further determined that the overspeed warning had activated, which was consistent with the performance study and extreme fragmentation of the wreckage. Radar transponder data from the accident airplane were lost below 2,400 feet. The signal loss was likely caused by unusual attitudes, which can mask transponder antenna transmissions. A garbled transponder return recorded near the DC-10 was likely caused by the accident airplane's transponder returns masking the DC-10's returns (since the accident airplane was projected to be in line between the DC-10 and the ground radar) or by other environmental phenomena. Red transfer or scuff marks were observed on many pieces of the airplane wreckage, and these marks were concentrated on the lower airframe skin forward of the main landing gear and the nose landing gear area. The Safety Board and four laboratories compared the red-marked airplane pieces to samples of red-colored items found in the wreckage. These examinations determined that most of the red marks were caused by parts of the airplane, cargo, and items encountered during the wreckage recovery. The marks exhibited random directions of motion, and none of the marks exhibited evidence of an in-flight collision with another aircraft. A small piece of black, anodized aluminum found embedded in the left wing was subsequently identified as a fragment from a cockpit lighting dimmer. The accident occurred at night, with the moon obscured by low clouds. Instrument meteorological conditions prevailed, although visual conditions were reported between cloud layers. The terminal aerodrome forecast reported a possible cloud layer at 3,000 feet. Weather data and observations by the DC-10 pilot indicated that, after flying about 100 to 500 feet above the cloud layer and soon after sighting the DC-10, the accident airplane would have entered clouds. A number of conditions were present on the night of the accident that would have been conducive to spatial disorientation. For example, no visible horizon references existed between the cloud layers in which the pilot was flying because of the night conditions. In addition, to initiate a visual search and visually acquire the DC-10, varying degrees of eye and head movements would have accompanied the pilot's shifting of attention outside the cockpit. Once the DC-10 was visually acquired by the pilot, it would have existed as a light source moving against an otherwise featureless background, and its relative motion across and rising in the Cessna's windscreen could have been disorienting, especially if the pilot had fixated on it for any length of time. Maneuvering the airplane during this search would likely have compounded the pilot's resultant disorientation.", "probable_cause": "The pilot's spatial disorientation, which resulted in loss of airplane control. Contributing to the accident was the night instrument meteorological conditions with variable cloud layers."}