{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-300lw-super-king-air-nordelta-2-killed", "date": "Sep 14, 2014 at 1515 LT", "type": "Beechcraft 300 Super King Air", "operator": "Tango Jet", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Lincoln – Buenos Aires", "msn": "FA-221", "yom": 1992, "flight_number": null, "city": "Nordelta", "zone": "Buenos Aires province", "country": "Argentina", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 14004, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2630, "circumstances": "The twin engine aircraft departed Lincoln-Estancia La Nueva Airport on a private flight to Buenos Aires, carrying one passenger and one pilot. While descending to Buenos Aires-Aeroparque-Jorge Newbury Airport, the pilot was unable to intercept the ILS for runway 13 because of an excessive speed of 260 knots and a too high angle of descent. In such conditions, he could not configure the aircraft for approach and landing (flaps) in accordance with the information in the BE 300 flight manual. He completed a left turn at a speed of 228 knots and descended below the glide before initiating a second turn to the right when control was lost. The aircraft entered a dive and crashed onto two houses located in Nordelta, about 26 km northwest of the airport. The aircraft and two houses were destroyed and both occupants were killed, among them Gustavo Andres Deutsch aged 78 who was the former owner of the defunct airline LAPA.", "probable_cause": "The accident resulted from the combination of immediate triggers and failures in the aeronautical system's defenses, including:\r\n- Prevailing weather conditions at the scene of the accident;\r\n- Pilot-in-command experienced difficulties in managing aircraft control and flight path during an instrument approach;\r\n- The probability of overload of work of the pilot in command as a result of the operational demands presented by the situation;\r\n- The execution of the operation by a single pilot (single pilot operation), taking into account the age of the pilot; and\r\n- Deficiencies in pilot-in-command certification denying the value of CE-6 as a defense barrier for the aeronautical system (CE-6 is a Critical Element of ICAO Annex 19 regarding responsibilities in issuing licenses)."}