{"url": "https://www.baaa-acro.com/crash/crash-cessna-425-conquest-i-munich", "date": "Feb 2, 2010 at 0210 LT", "type": "Cessna 425 Conquest", "operator": "Aerowest", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hanover - Munich", "msn": "425-0222", "yom": 1985, "flight_number": null, "city": "Munich-Franz Josef Strauß", "zone": "Bavaria", "country": "Germany", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3600, "captain_hours_type": 400, "copilot_hours": 5200, "copilot_hours_type": 300, "aircraft_hours": 5836, "circumstances": "The aircraft took off at 0041 hrs from Hanover (EDDV) for a positioning flight to Munich (EDDM) with a crew of two pilots. The intention was to make a subsequent air ambulance flight from Munich to Kiel. During the climb the crew received the instruction for a direct flight to Munich and the clearance for a climb to Flight Level (FL) 230. The radar data showed that the aircraft turned south-east and climbed to FL230 after take-off. At 0123:45 hrs the crew made radio contact with Munich Radar. About five minutes later, the controller advised the crew that both runways were closed for snow removal, but that the southern runway would re-open in about 25-30 minutes. In response, the crew advised they would reduce the speed somewhat. The crew stated that the temperature in flight altitude had been -40 °C. At 0133:58 hrs the controller issued descent clearance to FL110. According to crew statements in this phase there were problems with the left engine. A system check indicated that the engine’s Interstage Turbine Temperature (ITT) had exceeded 900°C and the torque had reduced to zero. The crew then first worked through the memory items before \"beginning with the engine failure checklist\". In the presence of the BFU the crew gave their reasons for the shut-off of the engine as being the fast increase of the ITT and the decrease of the torque to zero. The crew could not give any other engine parameters like Ng per cent RPM, propeller RPM, fuel flow, oil pressure or oil temperature. The co-pilot reported via radio: \"… we request to maintain FL150 … we have engine failure on the left side, call you back.\" At that time, the radar data showed the aircraft at FL214. As the controller asked at 0138:15 hrs if a frequency change to approach control were possible, the co-pilot answered: \"... give us a minute, please, and then we report back, until we have everything secured ...\" At 0143:22 hrs the co-pilot advised the controller that the engine had been \"secured\" and a frequency change was now possible. The crew subsequently reported that, three to five minutes later there had been brief, strong vibrations in the right engine. The crew could not state which actions they had carried out after the descent clearance and during shut-off and securing of the left engine. Both pilots stated that there was no attempt to re-start the left engine.  After changing frequency to Munich Approach Control the crew was advised that runway 26L was available. The co-pilot declared emergency at 0143:48 hrs, about 25 NM away from the airport of destination, mentioning again the failure of the left engine. The controller responded by asking the crew what assistance they would require, and asked if a ten-mile approach would be acceptable. This was affirmed. At 0149:28 hrs the controller gave clearance for an ILS approach to runway 26L. At that time the radar data showed the airplane in FL78 flying with a ground speed of 210 kt to the south-east. The aircraft turned right towards the final approach and at 0151:53 hrs it reached the extended runway centre line about 17 NM prior to the runway threshold in 5,400 ft AMSL with a ground speed of 120 kt. At 0154:12 hrs the controller said: \"… observe you a quarter mile south of the centre line.\" According to the radar data the aircraft was in 5,000 ft AMSL with a ground speed of 90 kt at that time. The co-pilot answered: \"Ja, we are intercepting…\". Twenty seconds later the controller gave clearance to land on runway 26L. Up until about 0157:30 hrs the ground speed varied between 80 and 90 kt. From 0157:43 hrs on, within about 80 seconds, the speed increased from 100 kt to 120 kt. Thereby, the airplane had come within 5.5 NM of the threshold of runway 26L. Up until 0200:53 hrs the airplane flew with a ground speed of 100 - 110 kt. At 0201:32 hrs ground speed decreased to 80 kt. At that time, the airplane was in 1,900 ft AMSL and about 1.5 NM away from the threshold. Up until the last radar recording at 0202:27 hrs the ground speed remained at 80 kt. The crew stated the approach was flown with Blue Line Speed. During the final approach the aircraft veered slightly to the left and tended to sink below the glidepath. Approximately 3 NM from the threshold the approach lights had become visible and the flaps and the landing gear were extended. Then the airplane veered to the left and sank below the glidepath. The co-pilot stated a decision for a go-around was made. When an attempt was made to increase power from the right engine, no additional power was available. The aircraft had lost speed and to counteract it the elevator control horn was pushed. Prior to the landing, rescue and fire fighting vehicles were positioned at readiness in the vicinity of the airport’s southern fire station. The weather was described as very windy with a light snow flurry. The fire fighters subsequently reported they had seen two white landing lights and the dim outline of an approaching aircraft. The aircraft’s bank attitude was seen to alter a number of times. Shortly before landing, the landing lights suddenly disappeared and the aircraft was no longer visible.  The aircraft impacted the ground about 100 metres prior to the threshold of runway 26L. The crew turned off all the electrical systems and left the aircraft unaided. During the initial interviews by BFU and police the co-pilot repeatedly talked about a go-around the crew had intended and he had, therefore, pushed the power lever for the right engine forward. In later statements he stated that the engine power was to be increased. A few days after the accident, the BFU asked both pilots for a detailed written statement concerning the course of events. The BFU received documents with a short description of the accident in note form. The statements of the two pilots were almost identical in content and format.", "probable_cause": "The following findings were identified:\r\n- When the left engine was shut down, the propeller was not feathered,\r\n- During the final approach, the speed for an approach with one shut-off engine was lower than the reference speed, \r\n- The airplane veered to the left during power increase and became uncontrollable due to the lack of rudder effectiveness,\r\n- Non-adherence to checklists during the shut-off of the engine and,\r\n- Poor crew coordination."}