{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-15-dk-salisbury-1-killed", "date": "Feb 23, 1955 at 0920 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Central%20African%20Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Salisbury – Lusaka", "msn": "15109/26554", "yom": 1944, "flight_number": "CAA626", "city": "Harare", "zone": "Harare Province", "country": "Zimbabwe", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 1, "pax_on_board": 21, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Just after liftoff from runway 09, while in initial climb, the crew raised the gear when smoke spread into the cockpit. The captain decided to land immediately. The aircraft belly landed and skidded for dozen yards before it overran and came to rest on a railway. Twenty-five occupants evacuated safely while the flight engineer was killed by a propeller blade coming from the left engine that penetrated the cockpit. ", "probable_cause": "The cause of the accident was the presence of smoke in the flight crew compartment in sufficient quantity to make the captain apprehensive of fire and to cause him to land the aircraft immediately with the undercarriage retracted. The only defect revealed by subsequent investigation of the airframe, engine and accessories, was a fractured rubber hose on the port engine connecting the rocker box of one of the lower cylinders to the collector box. It is the option of the Investigating Officers that oil leaking from this fracture was carried by the airflow on to the exhaust collector ring and generated smoke. Tests carried out later on the same type of aircraft proved conclusively that smoke generated in this region will travel freely to the flight crew compartment via the wheel bay and interior of the centre section leading edge."}