{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-4-1009-mt-cameroun-29-killed", "date": "Feb 3, 1951 at 1430 LT", "type": "Douglas DC-4", "operator": "Air-France-31", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Brazzaville – Pointe Noire – Libreville – Douala – Niamey – Algiers – Marseille – Paris", "msn": "42992", "yom": 1946, "flight_number": null, "city": "Mt Cameroun", "zone": "Southwest", "country": "Cameroon", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 23, "pax_fatalities": 23, "other_fatalities": 0, "total_fatalities": 29, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine aircraft christened 'Ciel de Savoie' left Douala Airport at 1408LT bound for Niamey. Four minutes after takeoff, the crew modified his route and continued to the northwest at an altitude of 8,500 feet. About twenty minutes later, while flying in good weather conditions but facing the sun, the pilot in command realized he was facing a mountain and immediately made a sharp turn to the left when the left wing hit trees. Out of control, the aircraft crashed on the Mt Cameroon and disintegrated on impact. All 29 occupants were killed. \r\nCrew:\r\nJean Chansel, pilot,\r\nJean Gavignet, copilot,\r\nRoger Roure, radio navigator, \r\nPaul Frederic, mechanic, \r\nLina Cotton, stewardess, \r\nGeorges Vilard, steward. ", "probable_cause": "It was determined that the collision with the mountain was caused by a navigation error on part of the flying crew who decided, four minutes after takeoff from Douala Airport, to abandon the current procedure and followed a different route. The crew failed to follow the prescribed flight plan and to check the improvised route. Error of judgement and overconfidence on part of the crew were considered as contributory factors."}