{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-5-dk-fort-simpson", "date": "Jun 26, 1994 at 1404 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Buffalo%20Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Big Trout Lake – Fort Simpson", "msn": "12307", "yom": 1942, "flight_number": "BFL526", "city": "Fort Simpson", "zone": "Northwest Territories", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14000, "captain_hours_type": 9000, "copilot_hours": 1300, "copilot_hours_type": 850, "aircraft_hours": 18456, "circumstances": "Buffalo Air Flight 526, a Douglas DC-3C freighter based in Yellowknife, was hauling jet fuel to Trout Lake from Fort Simpson, Northwest Territories, in support of forest fire suppression operations. Before the departure from Yellowknife to Trout Lake, the flight crew checked the en route weather and filed a company flight itinerary. Dispatch issued the flight crew an aircraft-fuel-load receipt which indicated that the aircraft had been fuelled the night before with a total fuel quantity of about 436 imperial gallons (imp. gal.): full main tanks (336 imp. gal.), and 50 gallons in each auxiliary tank (100 imp. gal.). The first officer confirmed this quantity with a fuel dip-stick borrowed from the refueller. At 07:40 mountain daylight saving time, the flight crew departed Yellowknife in accordance with visual flight rules (VFR). On board the aircraft were 17 full 45-imperial-gallon drums of Turbo-B jet fuel. At 09:25 the aircraft landed at Trout Lake, and the 17 drums of jet fuel were off-loaded; the aircraft then departed for Fort Simpson at 0945. The 82-nautical-mile (nm) flight to Fort Simpson was flown at an altitude of about 2,500 feet above sea level (asl); the flight crew reported encountering light headwinds. At 10:20 the aircraft landed at Fort Simpson. Once again 17 drums of jet fuel were loaded on board, then the aircraft departed at 10:49. The captain climbed the aircraft to an altitude of 3,500 feet asl. After he levelled off the aircraft, the captain adjusted the engines to 575 brake horsepower (bhp) settings. At 11:20, the aircraft landed at Trout Lake and the drums were off-loaded, and at 11:35 the aircraft was once again airborne on the second round-trip shuttle flight. Thirty-five minutes later the aircraft landed at Fort Simpson. While the cargo was being loaded on the aircraft, the flight crew discussed their different calculations regarding the aircraft's fuel quantity. The first officer indicated that the aircraft required fuel. The captain calculated that the aircraft had sufficient fuel remaining. The captain decided that they would refuel at Fort Simpson on the next shuttle flight; nonetheless, since the flight crew considered the cockpit fuel gauges unreliable, the captain requested that the first officer confirm the fuel quantity using a dip-stick. At 12:28, the aircraft departed Fort Simpson and climbed to 5,000 feet asl. About eight minutes later, the flight crew noticed that the fuel pressure was fluctuating, indicating that the auxiliary tanks were empty. The captain repositioned the fuel tank selectors to their respective main tanks and enquired about the dip-stick measurements. The first officer responded that he had not checked the fuel quantity because the fuel dip-stick was missing. The crew discussed the fuel quantity remaining and the captain calculated that the aircraft had approximately 45 minutes of fuel remaining. Following the 13:00 touchdown at Trout Lake, the cargo was unloaded and 31 empty fuel drums were loaded on board the aircraft for Fort Simpson. At 13:25 the aircraft departed Trout Lake. The first officer was the pilot flying (PF) the aircraft, and was in the right seat. The captain performed the duties of the pilot not flying (PNF). Twenty miles southwest of Fort Simpson, the PNF reported their position to Fort Simpson Flight Service Station (FSS). He also requested that the aircraft refueller be advised that they would require fuel on arrival. The flight crew then completed the descent checks and, at 10 miles southwest of the airport, the PNF updated FSS of their position and received the airport advisory. Approximately six miles from the airport, at an altitude of about 400 to 500 feet above ground level (agl), the PF advised the PNF that the left engine was losing fuel pressure. Shortly thereafter, the left engine lost power. Immediately, the PNF switched the left fuel boost pump to the ON position, and the left fuel selector from LEFT MAIN to LEFT AUXILIARY tank position. The engine resumed power momentarily, but lost power again. The PNF then switched the left fuel selector to the RIGHT AUXILIARY tank position and the engine regained power; however, it promptly lost power again. Realizing that the fuel had been depleted in three of the four tanks, the captain took control of the aircraft and headed straight for runway 31. As the captain called for the engine failure check for the left engine, the first officer advised the captain that the right engine was losing power. With a loss of power in both engines, and without sufficient altitude to glide to the airport, the first officer called the Fort Simpson FSS to advise that the flight crew would attempt a landing on the road (Mackenzie Highway) north of the Liard River. However, the approach to the road was unsuccessful and the aircraft crash-landed into a treed area. At about 14:03, several witnesses at the Liard River ferry crossing observed the aircraft flying low in a northwesterly direction. The aircraft was estimated to be at about 40 feet agl when it crossed overhead the ferry terminal and was  descending. The witnesses reported that they heard the sound of the engines cutting in and out before the aircraft passed overhead their vantage points. They also reported seeing the landing gear being extended. The aircraft then disappeared from view behind the trees. Immediately thereafter, the aircraft struck trees near the road, and crashed about 1/2 nm short of runway 31. The aircraft had been flown for approximately 4 hours and 37 minutes since its last refuelling. ", "probable_cause": "The flight was commenced with a fuel quantity below the minimum requirements, resulting in loss of engine power because of fuel exhaustion. Contributing to the occurrence was the lack of flight crew coordination."}