{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-049-constellation-wilmington", "date": "Oct 12, 1946 at 1815 LT", "type": "Lockheed L-049 Constellation", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Wilmington", "msn": "2039", "yom": 1946, "flight_number": null, "city": "Wilmington-New Castle County", "zone": "Delaware", "country": "United States of America", "region": "North America", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9600, "captain_hours_type": 3450, "copilot_hours": 3000, "copilot_hours_type": 50, "aircraft_hours": 1195, "circumstances": "The crew was performing a positioning flight to Wilmington-New Castle Airport to pick up passengers. On approach, the crew was informed by ATC that weather conditions were poor and that it should be better to divert to Philadelphia. The pilot attempted to land on runway 14 but after touchdown, he realized his mistake and elected to go around. It was too late, the aircraft overran, went through the perimeter fence, crossed a road where it hit two cars and continued for about 650 feet before coming to rest in flames. While all eight crew members escaped unhurt, the aircraft was destroyed. ", "probable_cause": "At the time the aircraft arrived in the vicinity of New Castle, a line squall was approaching the airport. Although advised by the tower to proceed to an alternate airport, the captain elected to land at New Castle Airport. Although advised by the tower of a wind shift of approximately 145 degrees, and the availability of a suitable runway into the wind, the captain elected to continue a wind approach to Runway 14. During the final approach the precipitation increased from light drizzle to heavy showers. At the time of the landing the tailwind component along Runway 14 was at least 16 mph. The aircraft failed to make contact with the ground until having passed over 2,100 feet of the runway. The aircraft failed to decelerate completely within the remaining 3,100 feet of the runway. When it became apparent that the aircraft would not stop on the runway, the pilot applied power in an unsuccessful attempt to become airborne. The aircraft continued beyond the end of the runway, through the trees bordering the airport, across DuPont Parkway, and came to rest in an open field. After coming to rest the aircraft was almost totally destroyed by fire. The Board determines that the probable cause of this accident was the poor judgment of the pilot in continuing in his attempt to land on a wet runway with a tailwind component in excess of 16 mph after having passed 2,100 feet of the runway."}