{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950m-horohoro-1-killed", "date": "Jun 14, 1979 at 1140 LT", "type": "Fletcher FU-24", "operator": "James-Aviation", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Horohoro - Horohoro", "msn": "4", "yom": 1954, "flight_number": null, "city": "Horohoro", "zone": "Waikato Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot commenced work that day at 07:30, flying to an airstrip from where topdressing operations were to be carried out. At about 08:30 he took off on a survey flight accompanied by the lessee of the property. The passenger pointed out to the pilot the location of a 220 kilovolt power transmission line consisting of six conductor wires that ran above the eastern section of the farm, the area to be topdressed. The pilot then used the airstrip to finish a sowing operation on another farm. On the completion of that task the pilot turned his attention to topdressing the area he had surveyed some three hours earlier. With the aircraft refueled he took off to make his first runs. ZK-CPN did not return from this flight. Two men working on a fence line saw the aircraft approaching from the direction of the airstrip. It passed out of their sight behind a large knoll, but they could tell from the sound of the motor that it was making sowing runs. The Fletcher then came back into view banking steeply and turning right. The men saw \" something white \" fall from the plane just before it dived into the ground. Rushing to the crash scene they found the wreckage of ZK-CPN lying upside down in a creek. Fire had not broken out.There was no sign of life. The pair set off at once to get assistance.The investigation showed that 1.4 meters of the outboard section of the right wing had been severed from the airframe by one of the lower conductor wires of the high voltage transmission line that ran above the sowing area. Evidence of impact by an aircraft was found on the wire. The RH aileron balance was found some distance away from the severed wing section and had been separated by impact with the wire as well. The aircraft had rolled uncontrollably to the right and dived, crashing inverted and in a near-vertical attitude. This was not a survivable accident. The flying weather at the time was fine with only high cloud. The visibility was estimated as 30 km.", "probable_cause": "The investigator found that the probable cause of this accident was that damage sustained when the aircraft collided with a power conductor wire deprived the pilot of control of the aircraft."}