{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-600-montgomery", "date": "May 29, 1999 at 1724 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "Alpha Beta Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Montgomery – Columbus", "msn": "60-0553-179", "yom": 1978, "flight_number": null, "city": "Montgomery", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5000, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2322, "circumstances": "During the takeoff roll and initial climb both engines were producing normal power. As the airplane climbed through 150 feet, the left engine lost power. The pilot reported that he feathered the left propeller. He further stated that following the securing of the left engine, the right engine began to 'power down.' The pilot reported that he was unable to maintain a climb attitude and was forced to land on the airport in a grassy area. The subsequent examination of the cockpit disclosed that the left engine throttle was in the full forward position, and the right throttle lever was in the mid-range position. Both propeller levers were found full forward. The left engine mixture lever was in the full forward position, and the right mixture lever full aft, or lean, position. The functional check of both engines was conducted. Initially the left engine would not start, but after troubleshooting the fuel system, the left fuel boost pump was determined to have been defective. The 'loss of engine power after liftoff' checklist requires that the pilot identify the inoperative engine and to feather the propeller for the inoperative engine. ", "probable_cause": "The pilot's inadvertent shutdown of the wrong engine that resulted in the total loss of engine power. A factor was the loss of engine power due to fuel starvation when the left fuel boost pump failed. "}