{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-jefferson-city-4-killed", "date": "May 27, 1999 at 1826 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Robert E. Linville", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Poplar Bluff – Jefferson City", "msn": "421B-0965", "yom": 1975, "flight_number": null, "city": "Jefferson City", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1850, "captain_hours_type": 850, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5530, "circumstances": "The airplane impacted the ground in a nose low, inverted attitude. The pilot reported, 'Jeff Tower, N34TM, I've just lost power on the right engine, eh, left engine.' The airplane's altitude was approximately 200 to 400 feet when the airplane's wings wobbled back and forth. The airplane's wings banked approximately 90 degrees to the left, and then the airplane nosed over and impacted the ground. White smoke was seen coming from the belly of the airplane for 1 to 2 seconds about 20 seconds prior to it impacting the ground. The terrain was a flat, hard packed field used for growing grass sod. Both the left and right propellers were found 12 to 18 inches under the hard packed soil. Rotational paint transfer patterns from the propeller blades onto the hard packed soil were evident. The left and right propeller blades exhibited chordwise scratching and leading edge polishing. The #2 cylinder piston was broken and the piston pin was still attached to the piston rod. The NTSB Materials Laboratory examination revealed the fracture face of the #2 exhaust valve stem was consistent with a bending fatigue separation. Both #2 and #6 exhaust valve guides showed heavy wear that ovalized the bores. The annual inspection conducted on March 15, 1999, indicated the compression on the left engine was 80/64, 50, 67, 70, 69, and 62. ", "probable_cause": "The pilot failed to maintain control of the airplane. A factor was the partial loss of power due to the exhaust valve fatigue failure. "}