{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-ii-hobbs-1-killed", "date": "Oct 31, 2002 at 0733 LT", "type": "Piper PA-31 Cheyenne", "operator": "Robert D. Calhoon", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Hobbs - El Paso", "msn": "31-8020055", "yom": 1980, "flight_number": null, "city": "Hobbs-Lea County", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2893, "captain_hours_type": 765, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4900, "circumstances": "The pilot of the twin turbo-prop airplane lost control of the aircraft during the initial takeoff climb phase while in instrument meteorological conditions. An instrument flight rules flight plan was filed for the planned 169-nautical mile cross-country flight. The aircraft impacted terrain approximately 1.7 miles northwest of the departure airport. The 2,893-hour instrument rated private pilot, who had accumulated over 765 flight hours in the same make and model, had been cleared to his destination \"as filed,\" and told to maintain 7,000 feet, and to expect 17,000 feet in 10 minutes. After becoming airborne, the flight was cleared for a left turn. The tower controller then cleared the flight to contact air route traffic control center. The pilot did not acknowledge the frequency change; however, he did establish radio contact with center on 133.1, and reported \"climbing through 4,900 feet for assigned 7,000.\" The weather reported at the time of flight was winds from 010 degrees at 15 knots with 700 feet overcast and 3 miles  visibility in mist. The radar controller observed the aircraft climbing through 5,500 feet and subsequently observed the airplane starting a descent. No distress calls were received from the flight. Signatures at the initial point of impact were consistent with a nose-low ground impact in a slight right bank. A post-impact fire consumed the airplane. No discrepancies or anomalies were found at the accident site that could have prevented normal operation of the airplane.", "probable_cause": "The pilot's loss of control while in instrument meteorological conditions during initial takeoff climb. Contributing factors were the prevailing clouds and fog. "}