{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-28-near-szczecin", "date": "Nov 29, 1999", "type": "PZL-Mielec AN-28", "operator": "Enimex.gif", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Örebro – Szczecin – Budapest", "msn": "1AJ005-02", "yom": 1988, "flight_number": null, "city": "Szczecin", "zone": "West Pomeranian Voivodeship (Zachodniopomorskie)", "country": "Poland", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Örebro on a cargo flight to Budapest with an intermediate stop in Szczecin, carrying one passenger and two pilots. After passing over Rønne, Denmark, while in cruising altitude, a warning light came on in the cockpit panel, indicating a low fuel situation. A distance of 150 km was remaining to Szczecin Airport so the crew decided to continue. Few minutes later, while descending to Szczecin, both engines stopped simultaneously. The crew attempted an emergency landing in an open field located 30 km north of Szczecin. The aircraft rolled for few dozen metres and came to rest in a ravine. All three occupants escaped uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "It is believed that when departing from Örebro Airport in Sweden, the pilots calculated the amount of fuel based on the total weight of the cargo. Nevertheless, they later realized that the total weight of the cargo was 600 kilos lighter than initially mentioned on the load sheet. The crew then recalculated the total weight but failed to recalculate the amount of fuel. Also, it seems there was some confusion between liters and kilos when calculating the total weight of the cargo and the amount of fuel to put in the tanks."}