{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-200-san-diego-142-killed", "date": "Sep 25, 1978 at 0902 LT", "type": "Boeing 727-200", "operator": "PSA", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "City", "schedule": "Sacramento - Los Angeles - San Diego", "msn": "19688/589", "yom": 1968, "flight_number": "PS182", "city": "San Diego", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 128, "pax_fatalities": 128, "other_fatalities": 7, "total_fatalities": 142, "captain_hours": 14382, "captain_hours_type": 10482, "copilot_hours": 10049, "copilot_hours_type": 5800, "aircraft_hours": 24088, "circumstances": "The crew was completing flight PS182 from Sacramento to San Diego with an intermediate stop in Los Angeles. While descending to San Diego-Lindbergh Field runway 27, the crew was informed about the presence of a Cessna 172M registered N7711G and operated by the Gibbs Flight Center. The single engine airplane just departed San Diego Airport for a local training mission with one student pilot and one instructor on board. At 0901:47, at an altitude of 2,600 feet and 3 NM northeast of San Diego Airport, both airplane collided. Out of control, they dove into the ground and crashed into several houses and the 805 highway located between the districts of Altadena and City Heights. Both aircraft disintegrated on impact and all 137 occupants in both aircraft were killed as well as seven people on the ground. Nine other people on the ground were seriously injured as dozen houses were destroyed. ", "probable_cause": "The failure of the flight crew of Flight 182 to comply with the provisions of a maintain-visual-separation clearance, including the requirement to inform the controller when visual contact was lost; and the air traffic control procedures in effect which authorized the controllers to use visual separation procedures in a terminal area environment when the capability was available to provide either lateral or vertical separation to either aircraft. Contributing to the accident were:\r\n- The failure of the controller to advise Flight 182 of the direction of movement of the Cessna;\r\n- The failure of the pilot of the Cessna to maintain his assigned heading;\r\n- The improper resolution by the controller of the conflict alert."}