{"url": "https://www.baaa-acro.com/crash/crash-casa-2111-cheyenne-2-killed", "date": "Jul 10, 2003 at 1310 LT", "type": "Casa 2.111", "operator": "American%20Airpower%20Heritage%20Museum", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Midland – Cheyenne – Missoula", "msn": "124", "yom": 1952, "flight_number": null, "city": "Cheyenne", "zone": "Wyoming", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 21000, "captain_hours_type": null, "copilot_hours": 15000, "copilot_hours_type": null, "aircraft_hours": 1895, "circumstances": "The airplane was en route to an air show and was making a refueling stop. The tower controller cleared the pilot to land. The airplane was observed on a 3-mile straight-in final approach when it began a left turn. The controller asked the pilot what his intentions were. The pilot replied, \"We just lost our left engine.\" The pilot then reported that he wasn't going to make it to the airport. Witnesses observed the airplane flying \"low to the ground and under-speed for [a] good 4 minutes.\" The right propeller was turning, but the left propeller was not turning. There was no fire or smoke coming from the left engine. The pilot was \"obviously trying to pull up.\" The airplane \"dipped hard left,\" then struck the ground left wing first. It slid through a chain link fence, struck a parked automobile, and collided with a school bus wash barn. The ensuing fire destroyed the airplane, parked car, and wash barn. Disassembly and examination of both engines disclosed no anomalies that would have been causal or contributory to the accident. According to the Airplane Flight Manual, \"Maximum power will probably be required to maintain flight with one engine inoperative. Maximum power at slow air speed may cause loss of directional control.\"", "probable_cause": "A loss of engine power for reasons undetermined, and the pilot's failure to maintain aircraft control. Contributing factors were the unsuitable terrain on which to make a forced landing, low airspeed, the fence, automobile, and the school bus wash barn."}