{"url": "https://www.baaa-acro.com/crash/crash-sncase-se2010-armagnac-paris-2-killed", "date": "Jan 29, 1957 at 2024 LT", "type": "SNCASE SE.2010 Armagnac", "operator": "Société Auxiliaire de Gérance et d’Exploitation de Transports Aériens - SAGETA", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tunis – Paris", "msn": "06", "yom": 1952, "flight_number": null, "city": "Paris-Orly", "zone": "Val-de-Marne", "country": "France", "region": "Europe", "crew_on_board": 10, "crew_fatalities": 1, "pax_on_board": 60, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After a normal flight from Tunis the aircraft arrived at Paris at night and in weather conditions close to the operational minima and made an unsuccessful attempt to land using ILS monitored by GCA. The pilot-in-command then decided to land with GCA guidance. Lacking sufficient visual references to permit landing, the pilot applied full power at low altitude, in the immediate vicinity of the runway end. The aircraft, on a heading divergent from the landing runway, continued to lose altitude and struck the ground (at 1924 hours GMT) in a slightly nose-down position, banking to starboard. The right wing burned after separation from the fuselage and the rest of the aircraft turned over in a half-roll and broke up into four main parts. A crew member and a passenger were killed while 33 occupants were injured and 35 others were unhurt. ", "probable_cause": "The immediate cause of the accident was as follows: stalling as a result of delayed application of power with a heavy aircraft in final approach configuration and inadequate control of heading, airspeed and altitude after the visual break-through. The following contributing factors are noteworthy: \r\n- Deterioration in weather conditions in the immediate vicinity of the runway threshold,\r\n- Absence of radio altimeter,\r\n- Faulty application of landing tech niques by both ground and flight personnel."}