{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-13-new-york-la-guardia", "date": "Jan 14, 1952 at 0903 LT", "type": "Convair CV-240", "operator": "Northeast%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Boston – New York", "msn": "158", "yom": 1949, "flight_number": "NE801", "city": "New York-LaGuardia", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 33, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13849, "captain_hours_type": 2382, "copilot_hours": 5100, "copilot_hours_type": 700, "aircraft_hours": 5962, "circumstances": "Flight 801 originated at Boston, Massachusetts, for LaGuardia Field, nonstop, with a crew of Captain A. V. R. Marsh, First Officer Austin Officer Austin E. Briggs, and Stewardess Carolyn Mc Hull. It departed Boston at 0745, as schedules, in accordance with Instrument Flight Rules, via Airways Amber 7 and Red 3 to LaGuardia, Idlewild (New York International) Airport was the specified alternate. Upon departure from Boston the aircraft's gross weight was 38, 23 pounds, with a maximum allowable weight of 39,650 pounds, and the center of gravity was within prescribed limits. The flight proceeded uneventfully at its assigned altitude of 6,000 feet MSL in instrument weather with almost continuous rain. No actual icing occurred although the aircraft's de-icing equipment was used as a precaution because of the near freezing air temperatures. All required position reports were routine. At approximately 0845, the flight contacted LaGuardia approach control and advised, \"Northeast 801 over New Canaan - cleared to New Rochelle.\" (The flight had been cleared to New Rochelle by ARTC.) Approach control then requested the flight to report over the Port Chester, New York, fan marker, and gave it an expected approach clearance time of an the hour (0900), Runway 22, and the 0828 LaGuardia weather, as follows: \"estimated 3,000 overcast, one end one-half miles, rain and smoke, Wind southeast six, altimeter zero-zero-zero\" (30.00). The light reported over Port Chester at 0849 and was successively cleared to descend to 4,500 foot, to 3,500 foot, and to 2,500 foot altitudes. At 0855 it was cleared to leave New Rochelle, inbound, and shortly was instructed to make a 360-degree turn to assure separation from a preceding aircraft. The flight acknowledged and complied. At 0858 it reported leaving New Rochelle and was cleared for an approach to Runway 22, and at 0859, was told that Ground Control Approach advisories were available on a frequency of 109.9 megacycles. The flight acknowledged, and then was given the 0900 LaGuardia weather, ceiling 1,700 feet and visibility 1 1/2 miles. Flight 801 reported leaving the LaGuardia range at 0900 and was cleared to land on Runway 22. There was no further message from the flight. At 0903 it struck the water of Flushing Bay some 3,600 feet from the approach end of Runway 22. A motorboat operated by the Edo Corporation, docked about one-half mile away, reached the site approximately four minutes later. Passengers and crew, who had climbed out through the emergency exits and who were standing on and holding to the fat sinking aircraft, were taken aboard and then transferred to a tugboat that arrived shortly. All occupants were taken ashore and hospitalized.", "probable_cause": "The Board determined that the probable cause of this accident was the failure of the captain in command to monitor the copilot's approach and take corrective action when the aircraft first went appreciably below a normal approach path. The following findings were pointed out:\r\n- The weather data included a coiling of 1,700 feet and visibility of 1 1/2 miles,\r\n- Authorized minimum ceiling and visibility for the subject approach were 500 feet and one mile, respectively,\r\n- Instrument weather was encountered during the approach,\r\n- The approach was continued visually, despite the instrument weather,\r\n- Air speed was decreased and the aircraft settled rapidly to the water at 0903,\r\n- There was no malfunctioning or failure of the aircraft, or any of its components."}