{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-port-jefferson", "date": "May 26, 2003 at 1428 LT", "type": "Cessna 414 Chancellor", "operator": "Rits Aviation", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Orlando – White Plains", "msn": "414-0525", "yom": 1974, "flight_number": null, "city": "Port Jefferson", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1250, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4259, "circumstances": "The commercial pilot/owner was on a cross-country flight from Orlando, Florida, to Salisbury, Maryland, on an instrument flight rules (IFR) flight plan. The pilot stated that all five fuel tanks were topped off and verified as full before departure. The fueler, in a written statement, reported that he added 100 gallons of fuel and that the fuel tank levels were topped off. In addition to the main tanks, the airplane was equipped with two large-capacity auxiliary tanks (31.5 gallons of useable fuel each) and a locker tank, and the airplane's total useable fuel capacity was 183 gallons. As the airplane approached Maryland, the pilot requested weather for White Plains, New York (HPN) and then changed his destination to HPN. As he approached the New York area at 21,000 feet, air traffic control (ATC) instructed the pilot to fly a published arrival procedure and to maintain an altitude of 16,000 feet. The pilot stated that, due to poor weather and air traffic congestion, he became concerned about possible delays and informed ATC that he had \"minimal fuel.\" He did not declare an emergency. ATC then issued the pilot a descent clearance, and he reduced both throttles to idle. In preparation to level off at the new altitude, the pilot increased power on both throttles, and the right engine stopped producing power. The pilot was unable to maintain the assigned altitude and told the controller that he had \"lost an engine, and needed vectors to the nearest runway.\" The left engine stopped producing power about 2 minutes later. The pilot ditched the airplane and exited the airplane before it sank. The airplane was not recovered. The pilot reported that there were no mechanical problems with the airplane before the flight.", "probable_cause": "Loss of power to both engines for undetermined reasons."}