{"url": "https://www.baaa-acro.com/crash/crash-casa-212-aviocar-200-reykjavik-3-killed", "date": "Aug 2, 1988 at 1742 LT", "type": "Casa 212 Aviocar", "operator": "Geoterrex_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Ottawa – Goose Bay – Narsarsuaq – Reykjavik – Nantes", "msn": "245", "yom": 1982, "flight_number": null, "city": "Reykjavik", "zone": "Capital Region (Höfuðborgarsvæði)", "country": "Iceland", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4049, "circumstances": "The CASA 212 was bought by Geoterrex in 1983 and registered in Canada in 1985. The plane had been extensively modified for aerial survey work. These modifications consisted of two probes mounted on the fuselage above the cockpit and extending 10 feet in front of the aircraft nose, a l6-foot tail boom, and two wing tip pylons. The probes, pylons, and tail boom served to support a wire loop antenna which ran around the aircraft. In July 1988 the plane was prepared for a ferry flight across the Atlantic to Nantes, France. For the purposes of this ferry trip, the survey loop antenna and the wing tip pylons had been removed and stowed in the main cabin area. For this configuration a special ferry permit was necessary, but the company did not apply for one. On July 31, 1988 the aircraft departed Ottawa and arrived at Goose Bay later that day. On 2 August 1988, the aircraft departed Goose Bay at 09:05 UTC and arrived at Narsarsuaq, Greenland at 12:50 UTC. The aircraft was refuelled and departed one hour later at 13:50 UTC for Reykjavik, Iceland, at a planned altitude of FL130. Although the pilot’s instrument rating had expired and the co-pilot did not possess one, the crew filed an IFR flight plan to Reykjavik. The weight of the aircraft was about 3,000 pounds above the maximum authorized takeoff weight on takeoff from Narsarsuaq. At Reykjavik, the crew flew an ILS approach to runway 20. During the approach, the flaps were set at approximately 25 degrees, 15 degrees above the approved maximum of 10 degrees. Approximately one-half mile from the runway threshold, the aircraft entered a steep turn to the right, and the nose of the aircraft dropped sharply. The aircraft continued to turn to the right through 270 degrees and descended rapidly until it struck the ground approximately 900 feet short of the runway threshold. The aircraft burst into flames shortly after impact.", "probable_cause": "The crew lost control of the aircraft most probably because of large fluctuations in the power output of the right engine caused by the shift of an incorrectly installed speeder spring in the right propeller governor."}