{"url": "https://www.baaa-acro.com/crash/crash-consolidated-lb-30a-liberator-ii-swanage-27-killed", "date": "Jun 15, 1945 at 0815 LT", "type": "Consolidated LB-30 Liberator", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Plain, Valley", "schedule": "Holmsley South – Castel Benito – New Delhi", "msn": null, "yom": null, "flight_number": null, "city": "Swanage", "zone": "Dorset", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 22, "pax_fatalities": 22, "other_fatalities": 0, "total_fatalities": 27, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the morning of Friday, June 15, 1945, with the war still raging in the Far East, Liberator JT985 of No 232 Squadron took off from RAF Holmsley South in the New Forest, on the first leg of its long flight to New Delhi-Palam Airport, India. The first refueling stop was scheduled to be at RAF Castel Benito, near Tripoli in North Africa. This Liberator was a passenger-carrying RY-3' (US designation) variant, with passenger accommodation in the former bomb bay area as well as within the main fuselage, and was distinguished easily from the twin tail fin bomber variants so well known with Coastal Command and the USAAF by its single large tail fin. It was unarmed. The weather at Holmsley South was poor, but both the captain and the duty executive officer considered it suitable for take-off, but poor enough for a diversion to be likely if an early return was necessitated. JT985 departed at 07:20 hours. At 07:45 hours, shortly after crossing the coast outbound, the aircraft reported a loss of fuel pressure and that the crew were turning back to carry out a precautionary landing at Holmsley South. This information was repeated again 10 minutes later. At around 08:15 hours the owner of Encombe House, Sir Ernest Scott, and a worker at Encombe dairy saw the aircraft, which was obviously below the height of the hills, and both knew instinctively that it was going to crash. It impacted on the edge of what is now the Dorset Coastal Path, the wings were ripped off and the engines detached and were thrown forward towards Orchard Hill Farm, one wing coming to rest on the footpath (not a public footpath) in Polar Wood leading from the top of the ridge to the farm. There were no survivors. The first to reach the scene were an RAF sergeant by the name of Reginald Reynolds, who was staying at Encombe House, and members of an Army searchlight battery located between the farm and the village of Kingston; they were soon joined by RAF personnel from, presumably, nearby RAF Worth Matravers. The National Fire Service from Swanage was soon on the scene, as were local police officers. When the low cloud lifted at about eleven o'clock a scene of total devastation was revealed. The tragic remains of 27 bodies was joined by much in the way of personal belongings such as a baby's photograph, playing cards, personal notebooks, wallets and the like, together with a distinguished flying cross, thrown from its box but which was also retrieved. Who did the DFC belong to? Not any of the crew or passengers, so maybe it was being taken to India for presentation to its owner? There was also a large amount of tropical uniform items and, to the delight of the local children, tins of boiled sweets. The bodies of the crash victims were eventually taken away to Poole Mortuary. This was, and still is, Dorset's worst ever air crash.\r\nCrew (232nd Squadron):\r\nF/Lt Saxon Cole, pilot,\r\nF/O Donald Twaddle, copilot,\r\nF/O Joseph Todd, navigator,\r\nF/O George McPherson, radio officer,\r\nSgt George Wyke, flight engineer.\r\nSource: http://aviation-safety.net/wikibase/wiki.php?id=25114", "probable_cause": null}