{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-richmond-1-killed", "date": "Aug 13, 1984 at 0745 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Earl H. Nonow", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Westerly - Keene", "msn": "46-8408020", "yom": 1984, "flight_number": null, "city": "Richmond", "zone": "New Hampshire", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3097, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 117, "circumstances": "The pilot was flying inbound for the ILS runway 02 approach via the Gardner VOR transition. While on the transition, the aircraft descended below the 4,000 feet msl minimum altitude to 2,600 feet msl. The pilot was alerted by ATC. He responded that his chart read 3,000 feet. The aircraft then climbed above 2,700 feet, but descended again (to 1,500 feet msl) until about 2 miles outside the outer marker. The minimum published altitude to intercept the glide slope was 2,600 feet and the recommended (glide slope) altitude for crossing the outer marker was 2,548 feet. Before reaching the outer marker, the aircraft made an abrupt turn to the southwest, entered a steep descent and crashed in a wooded area. An exam of the aircraft did not disclose any evidence of a malfunction. A flight inspection of the nav aids disclosed satisfactory operation. A post mortem exam was inconclusive to possible physical impairment. The procedure turn altitude for the approach was 3,000 feet, but the Gardner transition did not require a procedure turn. The pilot, sole on board, was killed. ", "probable_cause": "Occurrence #1: loss of control - in flight\r\nPhase of operation: approach - iaf to faf/outer marker (ifr)\r\nFindings\r\n1. (c) ifr procedure - not followed - pilot in command\r\n2. (c) directional control - not maintained - pilot in command\r\n3. (c) proper altitude - not maintained - pilot in command\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: approach"}