{"url": "https://www.baaa-acro.com/crash/ground-fire-douglas-dc-9-32-atlanta", "date": "Nov 29, 2000 at 1550 LT", "type": "Douglas DC-9", "operator": "AirTran%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Atlanta - Akron", "msn": "47359/495", "yom": 1969, "flight_number": "FL956", "city": "Atlanta-William Berry Hartsfield", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 92, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12000, "captain_hours_type": 6000, "copilot_hours": 3100, "copilot_hours_type": 0, "aircraft_hours": 78255, "circumstances": "Shortly after takeoff, the airplane experienced electrical problems, including numerous tripped circuit breakers. The flight crew requested a return to airport. During the landing rollout, the lead flight attendant and air traffic control personnel reported to the flight crew that smoke was coming from the left side of the airplane; subsequently, the flight crew initiated an emergency evacuation on one of the taxiways. Examination of the airplane revealed fire damage to the left, forward areas of the fuselage, cabin, and forward cargo compartment. The greatest amount of fire damage was found just aft of the electrical disconnect panel located at fuselage station 237. There was no evidence that the drip shield normally installed over the disconnect panel was present at the time of the accident. Bluish stains caused by lavatory rinse fluid were observed on surfaces near the disconnect panel on the accident airplane and in the same areas on another of AirTran's DC-9 airplanes. Examination of one of the connectors from the disconnect panel on the accident airplane revealed light-blue and turquoise-green deposits on its internal surfaces and evidence of shorting between the connector pins. It could not be determined when the drip shield over the disconnect panel was removed; however, this likely contributed to the lavatory fluid contamination of the connectors. Following the accident, AirTran revised its lavatory servicing procedures to emphasize the importance of completely draining the waste tank to avoid overflows. Boeing issued an alert service bulletin recommending that operators of DC-9 airplanes visually inspect the connectors at the FS 237 disconnect panel for evidence of lavatory rinse fluid contamination and that they install a drip shield over the disconnect panel. Boeing also issued a service letter to operators to stress the importance of properly sealing floor panels and adhering to lavatory servicing procedures specified in its DC-9 Maintenance Manual. The Safety Board is aware of two incidents involving the military equivalent of the DC-9 that involved circumstances similar to the accident involving N826AT. Drip shields were installed above the FS 237 disconnect panels on both airplanes. ", "probable_cause": "The leakage of lavatory fluid from the airplane's forward lavatory onto electrical connectors, which caused shorting that led to a fire. Contributing to the accident were the inadequate servicing of the lavatory and the failure of maintenance to ensure reinstallation of the shield over the fuselage station 237 disconnect panel."}