{"url": "https://www.baaa-acro.com/crash/crash-martin-b-26-marauder-near-odessa-5-killed", "date": "Sep 28, 1995 at 1050 LT", "type": "Martin B-26 Marauder", "operator": "American%20Airpower%20Heritage%20Museum", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Midland - Midland", "msn": "2253", "yom": 1940, "flight_number": null, "city": "Odessa", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 21000, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2716, "circumstances": "Witnesses observed the aircraft approximately 250 feet above the ground heading towards the southwest. As the aircraft passed overhead, the 'engines were sputtering.' Approximately 3/4 mile from the witnesses, the aircraft made a 'sharp' right turn, nosed down, and impacted the ground. The engines 'quit' prior to the aircraft turning right. According to the operator, the flight was in preparation for a flight evaluation for the pilot-in-command by an FAA inspector. The pilot reported to Departure Control that he would be 'working on stalls and steep turns,' and the pilot was instructed to 'maintain VFR at or above five thousand five hundred.' The pilot-in-command had accumulated approximately 500 hours in the B-26. Prior to the accident flight, he had flown the B-26 once since October 8, 1993. That flight was on September 26, 1995, for a duration of 30 minutes. Prior to the flight the fuel tanks were 'sticked' and the total fuel was approximately 720 gallons of 100 octane low lead avgas. Examination of the airplane and engines did not disclose any pre mishap discrepancies. Due to the extent of damage, flight control continuity could not be established. ", "probable_cause": "The failure of the pilot to maintain minimum airspeed for flight resulting in an inadvertent stall/spin. Factors were the loss of power for undetermined reasons, and the pilot's lack of recent flight experience in the aircraft. "}