{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-209a-near-kansas-city", "date": "Nov 4, 1942 at 1149 LT", "type": "Douglas DC-3", "operator": "TWA-1", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Kansas City - Kansas City", "msn": "2015", "yom": 1937, "flight_number": null, "city": "Kansas City", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4488, "captain_hours_type": 2888, "copilot_hours": 1500, "copilot_hours_type": 700, "aircraft_hours": null, "circumstances": "A mid-air collision involving aircraft of United States registry, a Douglas DC3, NC18951, and a US Army aircraft, type C-53, registered 41-20116, occurred at an altitude of between 3,500 and 3,900 feet about 4 1/4 miles northeast of the Kansas City Range Station and 1 3/4 miles north of the on course of the northeast leg of the Kansas City Radio Range. At the time of the accident, NC18951 was operating on a check flight in the vicinity of the Kansas City Municipal Airport as a part of the routine instrument flight instruction of Transcontinental & Western Air. The C-53 was on a non-stop cross-country flight from Indianapolis to Wichita via Kansas City, in the service of the US Army Air Forces.  The DC-3 received major damage from the collision in the air and was demolished by the resultant crash landing in a group of small trees in the vicinity of Linden, Kansas. The C-53 received major damage as a result of the collision but succeeded in landing at the Kansas City Municipal Airport without further damage. The DC-3 captain sustained minor injuries. None of the 5 other persons involved was injured. \n", "probable_cause": "Error of judgment of the Kansas City Air Traffic Control operator in clearing the TWA DC-3 to climb into the overcast, within the limits of a civil airway, when he had knowledge of the expected arrival, in the immediate vicinity, of the Army C-53.  \n"}