{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-raleigh-3-killed", "date": "Dec 12, 2001 at 1904 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "M & M Aero", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dothan - Raleigh", "msn": "46-22044", "yom": 1989, "flight_number": null, "city": "Raleigh-Durham", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 926, "captain_hours_type": 10, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1679, "circumstances": "The flight was cleared for the ILS approach to runway 5R. The flight was at mid runway, at 2,100 feet, heading 049 degrees, at a speed of 163 knots, when the pilot stated \"...missed approach.\" He was instructed to maintain 2,000, and to fly runway heading. Radar showed N41003 started a right turn, was flying away from the airport/VOR, descending. At a point 0.57 miles from the airport/VOR, the flight had descended to 1,500 feet, was turning right, and increasing speed. The flight had descended 400 feet, and had traveled about 0.32 miles in 10 seconds. When radio and radar contact were lost, the flight was 2.35 miles from the airport/VOR, level at 1,600 feet, on a heading of 123 degrees, and at a speed of 169 knots. The published decision height (DH) was 620 feet mean sea level (msl). The published minimum visibility was 1/2 mile. The published Missed Approach in use at the time of the accident was; \"Climb to 1,000 [feet], then climbing right turn to 2,500 [feet] via heading 130 degrees, and RDU R-087 [087 degree radial] to ZEBUL Int [intersection] and hold.\" A witness stated that the aircraft was flying low, power seemed to be in a cruise configuration, and maintaining the same sound up until the crash. The reported weather at the time was: Winds 050 at 5 knots, visibility 1/2 statute mile, obscuration fog and drizzle, ceiling overcast 100, temperature and dew point 11 C, altimeter 30.30 in HG. At the time of the accident the pilot had 10 total flight hours in this make and model airplane; 33 total night flight hours; and 59 total instrument flight hours. ", "probable_cause": "The pilot's failure to maintain control of the airplane, due to spatial disorientation, while performing a missed approach, resulting in an uncontrolled descent, and subsequent impact  with a tree and a house. Factors in this accident were dark night, fog, drizzle, the pilot's lack of total instrument time, and his lack of total experience in this type of aircraft."}