{"url": "https://www.baaa-acro.com/crash/crash-avro-685-york-dakar-6-killed", "date": "Apr 13, 1947", "type": "Avro 685 York", "operator": "BSAA", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "London – Lisbon – Dakar – Natal – Rio de Janeiro", "msn": "1303", "yom": 1946, "flight_number": null, "city": "Dakar", "zone": "Dakar Region", "country": "Senegal", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On final approach to Dakar-Yoff Airport, the captain decided to go around due to low visibility causes by poor weather conditions. A second and a third attempt to land were aborted few minutes later. During the fourth attempt, while short of fuel, the aircraft landed hard and the undercarriage were sheared off. The aircraft slid on its belly for several yards and came to rest, broken in two. Six passengers were killed while nine other occupants were injured. ", "probable_cause": "Regarding the flight plan, there was too great errors in the ETA and the endurance was inexact. Lack of decision on the part of the pilot who, after his second attempt to land, and in view of his insufficient petrol reserve, should have carried out the diversionary plan. \r\nThe lighting of the runways was inadequate: there were no approach lights and there are no wireless facilities for landing in bad visibility at Dakar-Yoff Airport. \r\nContributory Causes: \r\nDifficulties in exchange of radio telephony communications between the control tower and the aircraft,\r\nInsufficient knowledge of the English language by the controllers in the tower, according to the Americans and British,\r\nAs regards to the crew, there certainly appears to have been a slight nervousness during the attempts to land, \r\nThe danger to passengers in the case of cabin fuselage below the wing in the event of a forced landing elsewhere than on a runway,\r\nLack of knowledge of the alternate airfield of Thies by BSAA crews. Thies was given on the old general aeronautical maps but at the time of the accident, no schedule for this aerodrome has yet been published by the Aeronautical Information Section. This schedule was available following the publication of the final investigation report. "}