{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-680-headland-1-killed", "date": "Oct 6, 1992 at 1105 LT", "type": "Rockwell Aero Commander 680", "operator": "William L. Benson", "flight_phase": "Taxiing", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Headland - Sylvester", "msn": "680-487-157", "yom": 1957, "flight_number": null, "city": "Headland", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 869, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8693, "circumstances": "According to the owner, he and the pilot had flown from Albany, Georgia to swap a Piper 28 for the Aero Commander 680. Prior to completing the trade, the previous owner reconstructed a set of aircraft maintenance logs which revealed the estimated total airframe time and engine serial numbers. The owner assumed that the airplane was airworthy. Since the pilot was not Aero Commander rated, they decided to taxi the airplane on the ramp and runway to gain some experience. While taxiing at a high rate of speed on runway 09, the owner reported that a gust of wind caught the airplane as the taxi speed approached 65 mph. The pilot lost control of the airplane as it became airborne. The airplane rotated to the right and the right wing struck the ground; the airplane cartwheeled to a stop facing the opposite direction. The wreckage examination failed to disclose a mechanical malfunction. Reportedly, the pilot completed a preflight but, the wreckage examination discovered a large bird's nest in the sump area of the left engine and a missing exhaust manifold. The pilot was not multi engine rated. The pilot was killed and the passenger was seriously injured. ", "probable_cause": "The pilot's failure to maintain control of the airplane while conducting a high speed taxi maneuver which resulted in inadvertent flight. Factors were the pilot's overconfidence in his ability, his lack of familiarity with the airplane and the wind gust."}