{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-rockford-1-killed", "date": "Dec 17, 2002 at 2251 LT", "type": "Cessna 208B Grand Caravan", "operator": "Planemasters", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Decatur – Rockford ", "msn": "208B-0143", "yom": 1988, "flight_number": "PMS1627", "city": "Rockford-Greater Rockford", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1872, "captain_hours_type": 1525, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10120, "circumstances": "The airplane collided with trees and terrain following a loss of control during an Instrument Landing System (ILS) approach at night. The impact occurred approximately 2.1 miles from the approach end of the runway. A witness reported hearing the airplane at \"mid-throttle\" as it flew over. He then heard the power increase followed by the impact. The witness stated there was no precipitation at the time of the accident and there were \"severe winds, mostly from the south, shifting volatile directly from the east.\" He also stated the visibility was \"extremely poor.\" Statements were received from five pilots who landed in transport category airplanes around the time of the accident. Three of these pilots reported experiencing a crosswind that varied from 15 to 50 knots during the approach. Four of the pilots reported airspeed fluctuations that varied between +/- 8 knots to +/- 10 knots during the approach. Three of the pilots reported breaking out of the clouds between 200 and 300 feet agl. Radar data indicates the airplane was high on the glideslope until it entered a rapid descent from an altitude of about 2,300 feet. Examination of the airframe, engine, and propeller governors failed to reveal any failures/malfunctions that would have resulted in the loss of control. ", "probable_cause": "The pilot's failure to maintain control of the airplane during the ILS approach. Factors associated with the accident were the low ceilings, high winds, crosswind, and wind shear conditions that existed."}