{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900c-eagleton-3-killed", "date": "Dec 9, 2002 at 1140 LT", "type": "Beechcraft 1900C", "operator": "Raytheon", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Mountains", "schedule": "Wichita - Mena", "msn": "UC-127", "yom": 1990, "flight_number": null, "city": "Eagleton", "zone": "Arkansas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 10200, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12473, "circumstances": "The aircraft collided with mountainous terrain in a level descent during a visual approach to the destination airport. According to recorded radar data, 10 minutes after descending from 15,000 feet, the flight impacted about 200 feet below the top of the partially obscured ridgeline (elevation of 2550 feet), and 8 miles from the destination. The data indicates the flight path was similar to the global positioning satellite (GPS) approach to the airport. Six minutes before the accident, and the pilot's last transmission to air traffic control, he was informed and acknowledged that radar service was terminated. The flight was 12.4 miles from the accident site when radar contact was lost. Reduced visibility due to fog hampered search & rescue efforts, and the aircraft wreckage was located the next day. The aircraft was equipped with a GPS navigation system; however the installation was incomplete, restricting its use to visual flight rules (VFR) only. The investigation did not determine if the GPS was being used at the time. A non-enhanced Ground Proximity Warning System was also installed. The maximum elevation figure listed on the sectional aeronautical chart covering the area of the accident site and destination airport was 3000 feet mean sea level. The chart also shows an advisory for the area to use caution due to rapidly rising. ", "probable_cause": "In-flight collision with terrain due to the pilot's failure to maintain clearance and altitude above rapidly rising terrain while on a VFR approach. Contributing factors were the obscuration of the terrain due to clouds."}