{"url": "https://www.baaa-acro.com/crash/crash-short-360-300-edinburgh-2-killed", "date": "Feb 27, 2001 at 1731 LT", "type": "Short 360", "operator": "Loganair", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Edinburgh –  Belfast", "msn": "3723", "yom": 1987, "flight_number": "LOG670A", "city": "Edinburgh", "zone": "Midlothian (County of Edinburgh)", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 13569, "captain_hours_type": 972, "copilot_hours": 438, "copilot_hours_type": 72, "aircraft_hours": null, "circumstances": "The aircraft landed at Edinburgh Airport, Scotland, at 00:03 and was parked there on Stand 31 in conditions including light and moderate snowfall. After preparation for a Royal Mail charter flight 670A to Belfast, start clearance was given at 15:03. At 15:12 hrs the crew advised ATC they were shutting down due to a technical problem. The crew then advised their company that a generator would not come on line. An avionics technician carried out diagnosis during which both engines were ground-run twice. No fault was found and the flight crew requested taxi clearance at 17:10. A normal take off from runway 06 was carried out followed by a reduction to climb power at 1,200 feet amsl. At 2,200 feet amsl the aircraft anti-icing systems were selected on. Three seconds later the torque on each engine reduced rapidly to zero. A MAYDAY call was made by the crew advising that they had experienced a double engine failure. The aircraft was ditched in the Firth of Forth estuary some 100 meters from the shoreline near Granton Harbour. Both pilots were killed.  Weather reported just before the accident with a temperature of +2°C, dewpoint of -3°C, visibility of more then 10 km, broken clouds at 4500 feet and cover at 8000 feet.", "probable_cause": "The following causal factors were identified:\r\n1) The operator did not have an established practical procedure for flight crews to fit engine intake blanks (‘bungs’) in adverse weather conditions. This meant that the advice contained in the aircraft manufacturer’s Maintenance Manual ‘Freezing weather-precautions’ was not complied with. Furthermore intake blanks were not provided on the aircraft nor were any readily available at Edinburgh Airport.\r\n2) A significant amount of snow almost certainly entered into the engine air intakes as a result of the aircraft being parked heading directly into strong surface winds during conditions of light to moderate snowfall overnight.\r\n3) The flow characteristics of the engine intake system most probably allowed large volumes of snow, ice or slush to accumulate in areas where it would not have been readily visible to the crew during a normal pre-flight inspection.\r\n4) At some stage, probably after engine ground running began, the deposits of snow, ice or slush almost certainly migrated from the plenum chambers down to the region of the intake anti-ice vanes. Conditions in the intakes prior to takeoff are considered to have caused re-freezing of the contaminant, allowing a significant proportion to remain in a state which precluded its ingestion into the engines during taxi, takeoff and initial climb.\r\n5) Movement of the intake anti-icing vanes, acting in conjunction with the presence of snow, ice or slush in the intake systems, altered the engine intake air flow conditions and resulted in the near simultaneous flameout of both engines.\r\n6) The standard operating procedure of selecting both intake anti-ice vane switches simultaneously, rather than sequentially with a time interval, eliminated a valuable means of protection against a simultaneous double engine flameout."}