{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-ridgway-reservoir-5-killed", "date": "Mar 22, 2014 at 1400 LT", "type": "Socata TBM-700", "operator": "Gadsden-Aviation", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Bartlesville – Montrose", "msn": "112", "yom": 1996, "flight_number": null, "city": "Ridgway Reservoir", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 908, "captain_hours_type": 9, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4848, "circumstances": "About 3 months before the accident, the pilot received about 9 hours of flight instruction, including completion of an instrument proficiency check, in the airplane. The accident flight was a personal cross-country flight operated under instrument flight rules (IFR). Radar track data depicted the flight proceeding on a west-southwest course at 15,800 ft mean sea level (msl) as it approached the destination airport. The flight was cleared by the air traffic controller for a GPS approach, passed the initial approach fix, and, shortly afterward, began a descent as permitted by the approach procedure. The track data indicated that the flight became established on the initial approach segment and remained above the designated minimum altitude of 12,000 ft msl. Average descent rates based on the available altitude data ranged from 500 feet per minute (fpm) to 1,000 fpm during this portion of the flight. At the intermediate navigation fix, the approach procedure required pilots to turn right and track a north-northwest course toward the airport. The track data indicated that the flight entered a right turn about 1 mile before reaching the intermediate fix. As the airplane entered the right turn, its average descent rate reached 4,000 fpm. The flight subsequently tracked northbound for nearly 1-1/2 miles. During this portion of the flight, the airplane initially descended at an average rate of 3,500 fpm then climbed at a rate of 1,800 fpm. The airplane subsequently entered a second right turn. The final three radar data points were each located within 505 ft laterally of each other and near the approximate accident site location. The average descent rate between the final two data points (altitudes of 10,100 ft msl and 8,700 ft msl) was 7,000 fpm. About the time that the final data point was recorded, the pilot informed the air traffic controller that the airplane was in a spin and that he was attempting to recover. No further communications were received from the pilot. The airplane subsequently impacted the surface of a reservoir at an elevation of about 6,780 ft and came to rest in 60 ft of water. A detailed postaccident examination of the airframe, engine and propeller assembly did not reveal any anomalies consistent with a preimpact failure or malfunction. The available meteorological data suggested that the airplane encountered clouds (tops about 16,000 ft msl or higher and bases about 10,000 ft msl) and was likely operating in IFR conditions during the final 15 minutes of the flight; however, no determination could be made regarding whether the clouds that the airplane descended through were solid or layered. In addition, the data suggested the possibility of both light icing and light turbulence between 12,000 ft msl and 16,000 ft msl along the flight path. Although the pilot appeared to be managing the flight appropriately during the initial descent, it could not be determined why he was unable to navigate to the approach fixes and maintain control of the airplane as he turned toward the airport and continued the descent.\n", "probable_cause": "The pilot's loss of airplane control during an instrument approach procedure, which resulted in the airplane exceeding its critical angle of attack and entering an inadvertent aerodynamic stall and spin."}