{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-c-17a-globemaster-iii-elmendorf-afb-4-killed", "date": "Jul 28, 2010 at 1822 LT", "type": "McDonnell Douglas C-17 Globemaster III", "operator": "United%20States%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Elmendorf AFB - Elmendorf AFB", "msn": "P-73", "yom": 2000, "flight_number": null, "city": "Elmendorf-Richardson AFB (JBER)", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was engaged in a training exercise in preparation to the 'Thunder Air Show' taking part at Elmendorf-Richardson AFB on 31JUL2010. Shortly after take off from runway 06, the pilot-in-command initiated a first turn to the left then a steep turn to the right when the aircraft entered an uncontrolled descent and crashed in a huge explosion in a wooded area located some 3 km northwest of the airbase. The aircraft was totally destroyed by impact forces and a post crash fire and all four crew members were killed. ", "probable_cause": "The board president found clear and convincing evidence that the cause of the mishap was pilot error. The pilot violated regulatory provisions and multiple flight manual procedures, placing the aircraft outside established flight parameters at an attitude and altitude where recovery was not possible. Furthermore, the copilot and safety observer did not realize the developing dangerous situation and failed to make appropriate inputs. In addition to multiple procedural errors, the board president found sufficient evidence that the crew on the flight deck ignored cautions and warnings and failed to respond to various challenge and reply items. The board also found channelized attention, overconfidence, expectancy, misplaced motivation, procedural guidance, and program oversight substantially contributed to the mishap."}