{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-graham-4-killed", "date": "Nov 12, 2001 at 2324 LT", "type": "Piper PA-31 Cheyenne", "operator": "Cage Acquisitions", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Mountains", "schedule": "Wharton – Graham", "msn": "31-7804006", "yom": 1978, "flight_number": null, "city": "Graham", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 4849, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3240, "circumstances": "At 2144, the pilot contacted air traffic control and requested visual flight rules (VFR) flight following to his destination. The flight was the final leg of a four-leg trip, which the pilot had begun approximately 1120 that morning. At 2220, the flight began a slow descent toward the destination airport. Radar data confirmed that the airplane executed a steady descent, and flew a straight line course toward Graham. The final radar return occurred 37 minutes later at an altitude of 3,000 feet (radar coverage is not available below 3,000 feet), 8 miles southeast of the Graham Municipal Airport. Two minutes after the final radar return, the pilot reported to air traffic control that the flight was two miles out, and he canceled VFR flight following. No further communications or distress calls were received from the airplane. The pilot did not request or receive updated weather from the air traffic controllers during the flight. According to witnesses who lived near the accident site, they heard an airplane flying low, observed dense fog and heard the sounds of an airplane crashing. According to the nearest weather reporting station, near the time of the accident, the temperature- dew point spread was within 2 degrees, visibilities were reduced to between 3 and 4 miles in fog, and the ceiling was decreasing from 600 feet broken to 400 feet overcast. At the time of the accident, the pilot's duty day exceeded 12 hours. Examination of the airframe revealed no preimpact anomalies and that the gear was extended and the flaps were retracted. Examination of both engines revealed evidence of power at the time of impact.\n", "probable_cause": "The pilot's failure to discontinue the approach after encountering instrument meteorological conditions, which resulted in controlled flight into terrain. Contributing factors were the dark night light condition, low ceiling, and reduced visibility due to fog."}