{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-near-nasirotu-17-killed", "date": "Jul 24, 1999 at 0533 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Air%20Fiji_1", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Nausori - Nadi", "msn": "110-416", "yom": 1983, "flight_number": "PC121", "city": "Nasirotu", "zone": "All Fiji Islands", "country": "Fiji Islands", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 15, "pax_fatalities": 15, "other_fatalities": 0, "total_fatalities": 17, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13563, "circumstances": "The twin engine aircraft departed Suva-Nausori Airport at 0525LT on a regular schedule service (flight PC121) to Nadi, carrying 15 passengers and two pilots. The crew continued to climb via route 28 Golf in relative good weather conditions. At 0532LT, the pilot reported 5,500 feet 22,4 km from the airport. One minute later, he reported at 6,000 feet when the aircraft disappeared from radar screens, eight minutes after takeoff. The wreckage was found at an altitude of 540 metres in a wooded an mountainous area located in the Mataicicia Mountain Range, 35,2 km west of Nausori Airport, south of the village of Nasirotu. The aircraft was totally destroyed by impact forces and all 17 occupants were killed, among them nine Fidjians, five Australians, one New Zealander, one Chinese and one Japanese. ", "probable_cause": "The following findings were identified:\r\n- The wreckage was found 3 km south of the intended route,\r\n- The aircraft struck a tall tree with its right wing 390 metres above ground, flew for another 1,300 metres then crashed,\r\n- The minimum safe altitude for the area is 5,400 feet,\r\n- No technical anomalies were found on the aircraft,\r\n- Investigations were unable to determine the exact cause why the crew failed to comply with the minimum safe altitude, \r\n- The captain had insufficient rest time prior to the flight and consumed an above-therapeutic level of antihistamine prior to the flight, which may have affected his capabilities to fly, \r\n- The operator's published standard operating procedures for the Embraer Bandeirante aircraft were inadequate, \r\n- Weather conditions were considered as good with a 40 km visibility, scattered clouds at 2,200 feet and no wind, \r\n- The total weight of the aircraft was just below the MTOW. "}