{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-berdoues", "date": "Jun 1, 2008 at 1700 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Berdoues - Berdoues", "msn": null, "yom": null, "flight_number": null, "city": "Berdoues", "zone": "Gers", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3180, "captain_hours_type": 31, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot, owner of the airplane and manager of the Berdoues Aerodrome, offered a first flight to five people with whom he enjoyed the day and lunch. Arriving at the airport, he spotted a large cumulonimbus to the west of the airport, approaching the runway. He thought he was able to perform the flight before weather conditions would deteriorate and decided to complete a flapless takeoff as usual. While taxiing to the runway and passing in front of the windsock, he realized the wind was from the south at 30 knots. He completed engine test on the runway 08 threshold then started the takeoff procedure. Just prior to rotation, while passing again in front of the windsock, he realized the wind changed and was now from the tail with the same speed. As it was too late to abandon the takeoff procedure, he decided to continue. The single engine airplane took off but encountered difficulties to gain height. It descended, struck a grassy area located past the runway end then struck small trees located 200 meters further. On impact, it lost its undercarriage and its left wing before coming to rest in a pasture located 300 meters from the runway end. All six occupants escaped with minor injuries while the aircraft was damaged beyond repair. ", "probable_cause": "It was determined that the pilot failed to take into consideration weather conditions prior to the flight after his judgment and capabilities were impaired due to alcohol consumption. An hour and 15 minutes after the accident, a blood test revealed a blood alcohol level of 0,98‰. Investigations reported that according to wind and weather conditions, a distance of 1,300 meters was necessary for takeoff while the runway 08 is 780 meters long. "}