{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-rainbow-lake", "date": "Jan 15, 1998 at 1935 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Airco Aircraft Charters", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rainbow Lake – High Level – Edmonton – Calgary ", "msn": "31-8152096", "yom": 1981, "flight_number": null, "city": "Rainbow Lake", "zone": "Alberta", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3700, "captain_hours_type": 93, "copilot_hours": 632, "copilot_hours_type": 277, "aircraft_hours": null, "circumstances": "The Airco Aircraft Charters Piper PA-31-350 Chieftain, serial number 31-8152096, had been chartered by Northern Sky Aviation to complete a daily passenger flight from the Edmonton City Centre Airport to High Level, Rainbow Lake, Edmonton, and Calgary, Alberta. The flight from Edmonton to High Level and Rainbow Lake was uneventful. Following a routine landing and turn around, the aircraft departed Rainbow Lake in darkness, at 1935 mountain standard time (MST), on an instrument flight rules (IFR) flight to Edmonton. Shortly after take-off from runway 27, the aircraft collided with trees and terrain approximately 3 000 feet west of the departure end of the runway. The nine occupants sustained minor injuries and the aircraft was substantially damaged. Immediately following the evacuation of the aircraft, a Rainbow Lake passenger initiated the local emergency response by cell phone. Volunteer ground rescue personnel organized a snowmobile search, and a helicopter was dispatched from the airport to conduct an aerial search. The ground search was hampered by darkness, dense forest, cold temperatures, and deep snow. The helicopter pilot located the aircraft wreckage on his first pass over the departure corridor and, following his immediate return to the airport, he lead the ground rescuers to the accident site. Rescuers reached the accident site approximately one and one-half hours after the occurrence and assisted all of the survivors to the Rainbow Lake nursing station.", "probable_cause": "The aircraft was inadvertently flown into trees and the ground, in controlled flight and dark ambient conditions, during a night departure because a positive rate of climb was not maintained after take off. Factors contributing to the accident were the pilot’s concentrating on blue line speed rather than maintaining a positive rate of climb, the dark ambient conditions, a departure profile into rising terrain, an overweight aircraft, and crew resource mismanagement."}