{"url": "https://www.baaa-acro.com/crash/crash-cessna-414a-chancellor-sydney-2-killed", "date": "Aug 5, 2010 at 2337 LT", "type": "Cessna 414 Chancellor", "operator": "Forent%20Energy", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Butonville - Sydney", "msn": "414A-0288", "yom": 1979, "flight_number": null, "city": "Sydney-J. A. Douglas McCurdy", "zone": "Nova Scotia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9677, "circumstances": "The privately owned Cessna 414A departed Toronto/Buttonville Municipal Airport, Ontario, en route to Sydney, Nova Scotia. The flight was operating under an instrument flight rules flight plan with the pilot-in-command and the aircraft owner on board. Nearing Sydney, the aircraft was cleared to conduct an instrument approach. At the final approach waypoint the pilot was advised to discontinue the approach due to conflicting traffic. While manoeuvring for a second approach, the aircraft departed from controlled flight, entered a rapid descent and impacted the water at 2335 Atlantic Daylight Time. The aircraft wreckage was located using a side-scan sonar 11 days later, in 170 feet of water. The aircraft had been destroyed and both occupants were fatally injured. No signal was detected from the emergency locator transmitter.", "probable_cause": "Findings as to Causes and Contributing Factors: \r\n1. It is likely that the PIC and the owner were both suffering some degree of spatial disorientation during the final portion of the flight. This resulted in a loss of control of the aircraft and the crew was unable to recover prior to contacting the surface of the water.  \r\n2. The PIC did not accept assistance in the form of radar vectors, which contributed to the workload during the approach.  \r\n3. Self-imposed pressure likely influenced the crew’s decision to depart Buttonville despite the flight conditions, lengthy day, and lack of experience with the aircraft and the destination airport. \r\nOther Findings:\r\n1. It could not be conclusively determined who was flying the aircraft at the time of the occurrence.  \r\n2. The lack of onboard recording devices prevented the investigation from determining the reasons why the aircraft departed controlled flight. \r\n3. The practice of placing aircraft technical records on board aircraft may impede an investigation if the records are lost due to an accident."}