{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-ii-toulouse-4-killed", "date": "Oct 28, 2011 at 2135 LT", "type": "Piper PA-31 Cheyenne", "operator": "Johannes Ruttinger Systemtechnik", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Kassel-Calden - Toulouse", "msn": "31-8020036", "yom": 1980, "flight_number": null, "city": "Toulouse-Blagnac", "zone": "Haute-Garonne", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1145, "captain_hours_type": 217, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7300, "circumstances": "The pilot, accompanied by three passengers who were family members, took off at 1835LT from Kassel-Calden Airport (Germany) for a private flight under IFR to Toulouse-Blagnac. After about three hours of flight, he was cleared for approach and received radar vectoring for the runway 14R ILS. During the last exchange with the controller, as the aeroplane was on final at 900 feet, the pilot stated that he had a problem without specifying what type, as the message was interrupted. Shortly afterwards, radar and radio contact was lost. The wreckage was found close to the threshold of runway 14R. Two passengers were rescued while the pilot and another passenger were killed. The occupants were four members of the same family : the parents and two children, a boy aged nine and a girl aged 13. While the parents were killed upon impact, the daughter died from her injuries a day later and the boy died three days later.", "probable_cause": "Causes of the Accident:\r\nIt is likely that during the final approach, a right engine anomaly, detected by the pilot, led to power asymmetry. As a result of a high workload, during the phase of deceleration and gear and flap extension, the pilot likely did not monitor the indicated airspeed, or noted a decrease in it. He may then have encountered difficulties in managing the power asymmetry before losing control of the aeroplane.\r\nThe following factors may have contributed to the accident:\r\n- continuation of a fast arrival in a cloud layer, at night to a height of about 1,000 feet before configuring the aeroplane to land, which resulted in a significant increase in the pilot’s workload during processing of the anomaly;\r\n- probable fascination with the objective given the proximity of the runway and the attraction induced by the approach lights;\r\n- degraded type rating training to adapt to the pilot’s constraints during its renewal; \r\n- absence of specific exercises relating to the conduct of a single engine approach at a speed close to VMCA, in the type rating training for single pilot multi-engine high performance aeroplanes."}