{"url": "https://www.baaa-acro.com/crash/crash-cessna-404-titan-ii-lansing", "date": "Apr 15, 2000 at 0743 LT", "type": "Cessna 404 Titan", "operator": "Superior%20Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lansing - Caro", "msn": "404-0225", "yom": 1978, "flight_number": null, "city": "Lansing", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3600, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17393, "circumstances": "The pilot was departing from Lansing, Michigan, when he reported engine problems. The aircraft subsequently lost power to both engines. Fuel receipts were found that indicate that the aircraft was serviced with 25 gallons of jet fuel in each wing tank. No preexisting anomalies were found with regard to the aircraft or its systems. An FAA inspector interviewed the person that had fueled the aircraft and that person stated he had used a JET-A fuel truck to fuel the accident aircraft. The inspector also interviewed the safety director of the company that provided the fueling service. The safety director told the inspector that the fuel truck used to fuel the accident aircraft was found to have a small nozzle installed on one of the hoses and not the wide nozzle used on jet fueling trucks. He also said that, '...the small nozzle was used for the purpose of fueling tugs at the airport and that the small nozzles were immediately removed from all jet refueling trucks so that this could not happen again.'", "probable_cause": "A loss of engine power due to improper fuel. Also causal was the improper aircraft service by the fixed base operator personnel and the unsuitable terrain for the forced landing encountered by the pilot. Factors were the improper grade of fuel and the lack of suitable terrain for the landing. "}