{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-14-neiva", "date": "Jun 14, 2002 at 1815 LT", "type": "Douglas DC-9", "operator": "Intercontinental%20de%20Aviacion-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bogotá – Florencia – Neiva", "msn": "45843", "yom": 1966, "flight_number": "RS8883", "city": "Neiva", "zone": "Huila", "country": "Colombia", "region": "South America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 65, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5590, "captain_hours_type": 442, "copilot_hours": 804, "copilot_hours_type": 461, "aircraft_hours": 73906, "circumstances": "Following an uneventful flight from Florencia, the crew was cleared to descend to Neiva-Benito Salas Airport. On approach, the aircraft was unstable and after the GPWS alarm sounded, the captain increased power and gained altitude, causing the aircraft to climb over the glide. The approach was continued and the airplane passed over the threshold at a height of 140 feet and eventually landed 1,700 feet past the runway threshold at intersection Bravo (the runway is 5,249 feet long). After touchdown, the crew started the braking procedure but two tyres burst and the aircraft was unable to stop within the remaining distance. It overran and came to rest in a grassy area. All 71 occupants evacuated safely while the aircraft was damaged beyond repair. ", "probable_cause": "The energy accumulated in the set of tires deflated the tire n°2, reducing the braking effectiveness by 50% due to the loss of the antiskid of that set in the same proportion, and subsequently the loss of 100% of the effectiveness of braking when tires n°3 and 4 burst successively, causing the aircraft to exceed the remaining runway length leading to the accident situation.\r\nThe following contributing factors were identified: \r\n- The increase in speed of the VRF by the crew that increased the landing length,\r\n- An unstabilized approach completed by the the crew,\r\n- The pressure exerted on the crew due to the public order situation in the city of Florence for the purpose of a possible overnight stay of the aircraft and consequently the crew. "}