{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-near-pickle-lake-1-killed", "date": "Dec 11, 2015 at 0909 LT", "type": "Cessna 208B Grand Caravan", "operator": "Wasaya", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Pickle Lake – Angling Lake", "msn": "208B-0240", "yom": 1990, "flight_number": "WSG127", "city": "Pickle Lake", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2990, "captain_hours_type": 245, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 36073, "circumstances": "On 11 December 2015, the pilot of Wasaya Airways Limited Partnership (Wasaya) flight 127 (WSG127) reported for duty at the Wasaya hangar at Pickle Lake Airport (CYPL), Ontario, at about 0815. The air taxi flight was to be the first of 3 cargo trips in the Cessna 208B Caravan (registration C-FKDL, serial number 208B0240) planned from CYPL to Angling Lake / Wapekeka Airport (CKB6), Ontario. The first flight was planned to depart at 0900. The pilot went to the Wasaya apron and conducted a pre-flight inspection of C-FKDL while a ground crew was loading cargo. A Wasaya aircraft fuel-handling technician confirmed with the pilot that the planned fuel load was 600 pounds per wing of Jet A fuel. After completing the fueling, the technician used the cockpit fuel-quantity indicators to verify that the distribution was 600 pounds per wing. The pilot returned to the hangar and received a briefing from the station manager regarding the planned flights. The pilot was advised that the first officer assigned to the flight had been reassigned to other duties in order to increase the aircraft’s available payload and load a snowmobile on board. The pilot completed and signed a Wasaya flight dispatch clearance (FDC) form for WSG127, and filed a copy of it, along with the flight cargo manifests, in the designated location in the company operations room. The FDC for WSG127 showed that the flight was planned to be conducted under visual flight rules (VFR), under company flight-following, at an altitude of 5500 feet above sea level (ASL). Time en route was calculated to be 66 minutes, with fuel consumption of 413 pounds. The pilot returned to the aircraft on the apron. Loading and fueling were complete, and the pilot conducted a final walk-around inspection of C-FKDL. Before entering the cockpit, the pilot conducted an inspection of the upper wing surface. At 0854, the pilot started the engine of C-FKDL and conducted ground checks for several minutes. At 0858, the pilot advised on the mandatory frequency (MF), 122.2 megahertz (MHz), that WSG127 was taxiing for departure from Runway 09 at CYPL. WSG127 departed from Runway 09 at 0900, and, at 0901, the pilot reported on the MF that the flight was airborne. The flight climbed eastward for several miles and then turned left toward the track to CKB6. At about 3000 feet ASL, WSG127 briefly descended about 100 feet over 10 seconds, and then resumed climbing. At 0905, the pilot reported on the MF that WSG127 was clear of the MF zone. WSG127 intercepted the track to CKB6 and climbed northward until the flight reached a peak altitude of about 4600 feet ASL at 0908:41, and then began descending at 0908:46. At 0909:16, the flight made a sharp right turn of about 120° as it descended through about 4000 feet ASL. At 0909:39, the descent ended at about 2800 feet and the aircraft climbed to about 3000 feet ASL before again beginning to descend. At approximately 0910, WSG127 collided with trees and terrain at an elevation of 1460 feet ASL during daylight hours.", "probable_cause": "Findings as to causes and contributing factors:\r\n1. Although the aircraft was prohibited from flying in known or forecast icing conditions, Wasaya Airways Limited Partnership (Wasaya) flight 127 (WSG127) was dispatched into forecast icing conditions.\r\n2. The high take-off weight of WSG127 increased the severity of degraded performance when the flight encountered icing conditions.\r\n3. The pilot of WSG127 continued the flight in icing conditions for about 6 minutes, resulting in progressively degraded performance.\r\n4. WSG127 experienced substantially degraded aircraft performance as a result of ice accumulation, resulting in aerodynamic stall, loss of control, and collision with terrain.\r\n5. The Type C pilot self-dispatch procedures and practices in use at Wasaya at the time of the occurrence did not ensure that operational risk was managed to an acceptable level.\r\n6. Wasaya had not implemented all of the mitigation strategies from its January 2015 risk assessment of Cessna 208B operations in known or forecast icing conditions, and the company remained exposed to some unmitigated hazards that had been identified in the risk assessment.\r\n7. There was a company norm of dispatching Cessna 208B flights into forecast icing conditions, although 4 of Wasaya’s 5 Cessna 208B aircraft were prohibited from operating in these conditions.\n\r\nFindings as to risk:\r\n1. Without effective risk-management processes, aircraft may continue to be dispatched into forecast or known icing conditions that exceed the operating capabilities of the aircraft, increasing the risk of degraded aircraft performance or loss of control.\r\n2. If pilots operating under self-dispatch do not have adequate tools to complete an operational risk assessment before releasing a flight, there is an increased likelihood that hazards will not be identified or adequately mitigated.\r\n3. If aircraft that are not certified for flight in known or forecast icing conditions are dispatched into, and encounter, such conditions, there is an increased risk of degraded performance or loss of control.\r\n4. If aircraft that are certified for flight in known or forecast icing conditions are dispatched into, and encounter, such conditions, at weights exceeding limitations, there is an increased risk of loss of control.\r\n5. If flights are continued in known icing conditions in aircraft that are not certified to do so, there is an increased risk of degraded aircraft performance and loss of control. \r\n6. If operators exceed aircraft manufacturers’ recommended ICEX II servicing intervals, there is an increased risk of degraded aircraft performance or loss of control resulting from greater accretion of ice on the leading-edge de-icing and propeller blade anti-icing boots.\r\n7. If pilots do not receive the minimum required training, there is an increased risk that they will lack the necessary technical knowledge to operate aircraft safely.\r\n8. If pilots are not provided with the information they need to calculate the aircraft’s centre of gravity accurately, they risk departing with their aircraft’s centre of gravity outside the limits, which can lead to loss of control.\r\n9. If emergency locator transmitter antennas and cable connections are not robust enough to survive impact forces, potentially life-saving search-and-rescue operations may be impaired by the absence of a usable signal.\n\r\nOther findings:\r\n1. Wasaya’s use of a satellite aircraft flight-following system provided early warning of WSG127’s abnormal status and an accurate last known position for search-and-rescue operations.\r\n2. The investigation could not determine whether the autopilot had been used by the pilot of WSG127 at any time during the flight."}