{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-211-sochi-113-killed", "date": "May 3, 2006 at 0213 LT", "type": "Airbus A320", "operator": "Armavia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Yerevan - Sochi", "msn": "547", "yom": 1995, "flight_number": "RNV967", "city": "Sochi-Adler", "zone": "Krasnodar Krai", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 105, "pax_fatalities": 105, "other_fatalities": 0, "total_fatalities": 113, "captain_hours": 5458, "captain_hours_type": 1436, "copilot_hours": 2185, "copilot_hours_type": 1022, "aircraft_hours": 28234, "circumstances": "On 2 May 2006 the Armavia A320, registered EK-32009, was undertaking passenger flight RNV 967 from Zvartnots (Yerevan, Armenia) to Adler (Sochi, Russia). Preliminary preparation of the crew was conducted on 23-24 May 2006 under the guidance of the airline’s Flight Director, in accordance with the requirements of ROLRGA RA-2000, Section 7.2.1. Pre-flight briefing of the crew was conducted on the day of departure, under the guidance of the Captain, in accordance with the requirements of ROLRGA RA-2000, Section 8.2.1 On 2 May 2006 at 19.30 the crew passed the pre-flight medical examination. The crew’s pre-flight rest period exceeded 24 hours. In accordance with ROLRGA RA-2000 and Work-Rest Norms for civil aircraft crews from the Republic of Armenia, each crew member is individually responsible for adherence to the pre-flight rest regime. It should be noted that it was difficult for the crew to take adequate rest during the day before the night flight, due to impairment of bio-rhythms. That is most likely why, in their cockpit conversations the crew members mentioned that they had not got enough sleep. In order to make their decision for departure, the crew obtained the observed weather data and the weather forecast for the takeoff, landing and alternate aerodromes that met the requirements for IFR flights. According to the documents submitted, the airplane takeoff weight and the centre of gravity were 62,712 kg and 29.9% mean aerodynamic chord, i.e. within the A320 FCOM limitations. There were 113 occupants on board: 105 passengers (including 5 children and 1 baby), 2 pilots, 5 flight attendants and 1 engineer. The airplane took off from Zvartnots airport at 20:47. Takeoff, climb and cruise were uneventful. The first communication between the Sochi approach controller and the crew took place at 21:10:20. At that moment the airplane was beyond the coverage area of Sochi aerodrome radar. Up until 21:17 the approach controller and the crew discussed the observed and forecast weather, and as a result the crew decided to return to Yerevan. At 21:26:37, after the decision had already been made, the crew asked the controller about the latest observed weather. At 21:30:49 the controller informed the crew that visibility was 3,600 m and the cloud ceiling 170 m. At 21.31.14 the crew decided to continue the flight to Sochi airport. The next communication with the approach controller was at 22:00:45. At that moment the airplane was descending to an altitude of 3,600 m heading to GUKIN point and was being tracked by the Sochi radar. The approach controller cleared the airplane for descent to 1,800 m and reported the observed weather at Sochi, as at 22:00, for runway 06, which was above the aerodrome minimum. Then the crew was handed over to the holding and tower controllers, and was cleared for descent to 600 m, as per aerodrome pressure QNH 1016 hPa, before entering the turn to final. While performing the turn to final, the runway extended centreline was overshot. Having eliminated the deviation, the airplane started descending along the glide slope, following the approach pattern. At 22:10:45 the crew reported extension of the landing gear and their readiness for landing. In response they were advised of the distance of 10 km and weather 4000 x 190, and were cleared for landing. However, about 30 seconds later, the controller advised the crew of the observed cloud ceiling at 100 m and instructed them to stop their descent and carry out a right turn and climb up to 600 m and also to get in touch with the holding controller. The last communication with the crew was at 22:12:35. After that the crew did not respond to any of the controller’s calls. At 22:13:03 the airplane struck the water, was destroyed and sank. ", "probable_cause": "The fatal crash of the Armavia A320 EK-32009 was a CFIT accident that happened due to collision with the water while carrying-out a climbing manoeuvre after an aborted approach to Sochi airport at night with weather conditions below the established minima for runway 06. While performing the climb with the autopilot disengaged, the Captain, being in a psychoemotional stress condition, made nose down control inputs due to the loss of pitch and roll awareness. This started the abnormal situation. Subsequently the Captain's inputs in the pitch channel were insufficient to prevent development of the abnormal situation into the catastrophic one. Along with the inadequate control inputs of the Captain, the contributing factors to development of the abnormal situation into the catastrophic one were also the lack of necessary monitoring of the aircraft descent parameters (pitch attitude, altitude, vertical speed) by the co-pilot and the absence of proper reaction by the crew to the EGPWS warning."}