{"url": "https://www.baaa-acro.com/crash/crash-cessna-t207-turbo-skywagon-west-amatuli-island-3-killed", "date": "Jul 1, 2005 at 1200 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Aero%20Tech", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Homer - Homer", "msn": "207-0221", "yom": 1973, "flight_number": null, "city": "West Amatuli Island", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 8432, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7416, "circumstances": "The airline transport certificated pilot and the two pilot-rated passengers traveled to Alaska for a Title 14, CFR Part 91 personal flying vacation. The pilot received a VFR check-out in a rented airplane, and was the only person authorized by its owner to fly it. The pilot obtained a weather briefing for the day of the accident flight, and queried an FAA automated flight service station (AFSS) specialist about VFR conditions for a sightseeing flight. The FSS specialist stated, in part, \"Well, it doesn't really look good probably anywhere today...\" The area forecast included areas of marginal VFR and IFR conditions, and an AIRMET for mountain obscuration. The cloud and sky conditions included scattered clouds at 1,500 feet in light rain showers, with areas of isolated ceilings below 1,000 feet, and visibility below 3 statute miles in rain showers and mist. The weather briefing included a report from a pilot who was about 23 miles north of the accident scene about 2 hours before the accident airplane departed. The pilot reported fog and mist to the water, and said he was unable to maintain VFR. Five minutes after receiving the weather briefing, the accident pilot again called the AFSS and requested the telephone number to an automated weather observing system, located south of the point of departure, where VFR conditions were forecast. Local fishing charter captains reported fog in the area of the islands where the accident occurred. One vessel captain reported hearing an airplane in the vicinity of the islands, but could not see it because of the fog. The pilot did not file a flight plan, nor did he indicate any planned itinerary. The airplane was reported overdue two days after departure. The accident wreckage was located an additional two days later on the north cliff face of a remote island. The airplane had collided with the island at high speed, about 800 feet mean sea level, and a post crash fire had incinerated the cockpit and cabin area.", "probable_cause": "The pilot's continued VFR flight into instrument meteorological conditions, which resulted in an in-flight collision with an island cliff during cruise flight. A factor contributing to the accident was fog in the area of the accident."}