{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31p-425-pressurized-navajo-carrollton-3-killed", "date": "Oct 27, 1982 at 1120 LT", "type": "Piper PA-31-310 Navajo", "operator": "Standard Fittings", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "City", "schedule": "Opelousas - Dallas", "msn": "31-7400226", "yom": 1974, "flight_number": null, "city": "Carrollton", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 10024, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A PA-31, N100FD, was being vectored by DFW approach control (approach control) for a landing on runway 13L at Dallas-Love Field. The pilot's last received and acknowledged instructions were to descend and maintain 2,000 feet and turn left to 190°. Simultaneously, a Cessna 337, N72430, departed runway 15 at Addison Airport, under tower control, and was to make a right climbing turn of approx 180°. Two min after takeoff, the pilot asked and got approval for freq change. 24 seconds later, he contacted approach control stating he had just departed Addison and was climbing to 2,500 feet on a 300° heading. The controller misunderstood the pilot's departure point and instructed him to change to frequency 120.5. The two aircraft immediately collided. A 2,000 feet ceiling was reported, two witnesses stated they could see more blue sky than clouds. A witness approximately 8 miles away saw a fireball in the clouds. Investigation revealed the controller, vectoring N100FD, prematurely cleared the aircraft to an altitude which was below the ceiling of the Addison Airport traffic area and prior to reaching the airspace delegated for that purpose by an ATC letter of agreement.", "probable_cause": "Occurrence #1: midair collision\r\nPhase of operation: approach - IAF to FAF/outer marker (IFR)\r\nFindings\r\n1. (c) procedures/directives - not followed - ATC personnel (dep/apch)\r\n2. (c) VFR procedures - improper - pilot of other aircraft\r\n3. (f) weather condition - clouds"}