{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-caravan-cross-city", "date": "Sep 5, 2007 at 0533 LT", "type": "Cessna 208A Caravan", "operator": "Paragon%20Air%20Express", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Mobile - Tampa", "msn": "208-0702", "yom": 1998, "flight_number": null, "city": "Cross City", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11732, "captain_hours_type": 5470, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7844, "circumstances": "The pilot stated that he was on a repositioning flight to Tampa, Florida. He was cruising at 11,000 feet msl when, with no warning or spool down time, the engine failed. The engine indications instantly went to zero. The pilot declared an emergency to the air traffic controller and was advised that the nearest airport was 29 miles away. He maneuvered the airplane toward the airport and went through the engine failure procedures. The attempts to restart the engine were unsuccessful. The pilot configured the airplane for best glide speed. After gliding for 22 miles, the airplane's altitude was about 300 feet msl. The pilot slowed the airplane to just above stall speed before impacting small pine trees pulling back on the yoke and stalling the airplane into the trees. The engine was examined at Pratt and Whitney of Canada, with Transportation Safety Board of Canada oversight. The engine compressor turbine blades were fractured at varying heights from the roots to approximately half of the span. Materials analysis determined the blade fractures to display impact damage and overheating. The primary cause of the blade fractures could not be determined. There were no other pre-impact anomalies or operational dysfunction observed to any of the engine components examined. Impact damage to the blade airfoils precluded determination of the original fracture mechanism.", "probable_cause": "A total loss of engine power during cruise flight due to the fracture and separation of the compressor turbine blades for undetermined reasons. Contributing to the accident was the unsuitable terrain for a forced landing."}