{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-rawlins-3-killed", "date": "Jan 11, 2005 at 2145 LT", "type": "Beechcraft 90 King Air", "operator": "Mountain%20Flight%20Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Steamboat Springs – Rawlins", "msn": "LW-280", "yom": 1978, "flight_number": null, "city": "Rawlins", "zone": "Wyoming", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3778, "captain_hours_type": 414, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8921, "circumstances": "The air ambulance was dispatched from Steamboat Springs, Colorado (SBS), to pick up and transport a patient in serious condition from Rawlins Municipal Airport/Harvey Field (RWL) to Casper, Wyoming. Approaching RWL, the pilot initiated a right turn outbound to maneuver for the final approach course of the VOR/GPS approach to runway 22. On the inbound course to the airport, the airplane impacted mountainous terrain, approximately 2.5 nautical miles east-northeast of the airport. The airplane, configured for landing, struck the terrain wings level, in a 45-degree nose-down dive, consistent with impact following an aerodynamic stall. Approximately 5 minutes before the accident, RWL reported broken ceilings at 1,100 and 1,800 feet above ground level (agl), 3,100 feet agl overcast, visibility 2.5 statute miles with light snow and mist, temperature 33 degrees Fahrenheit (F), dew point 30 degrees F, winds 240 degrees at 3 knots, and altimeter 29.35 inches. Before departing SBS, the pilot received a weather briefing from Denver Flight Service. The briefer told the pilot that there was a band of light to moderate snow shower activity halfway between Rock Springs and Rawlins, spreading to the northeast. The briefer told the pilot there were adverse conditions and flight precautions along his route for occasional mountain or terrain obscurations. The pilot responded that he planned to fly instrument flight rules for the entire flight. The National Weather Service, Surface Analysis showed a north-south stationary front positioned along the front range of the Rocky Mountains beginning at the Wyoming/Montana border and extending south into north-central Colorado. Station plots indicated patchy snow over western Colorado and Wyoming. The most recent AIRMET reported, \"Occasional moderate rime or mixed icing in clouds and precipitation between the freezing level and flight level 220.\" The freezing level for the area encompassing the route of flight began at the surface. Witnesses in the vicinity of RWL reported surface weather conditions varying from freezing rain to heavy snow. An examination of the airplane showed clear ice up to 1 ½ inches thick adhering to the vertical stabilizer, the left and right wings, the right main landing gear tire, and the right propeller. The airplane's aerodynamic performance was degraded due to the ice contamination, leading to a stall. An examination of the airplane's systems revealed no anomalies. A human factors review of interviews and other materials showed insufficient evidence that the company placed pressure on the pilot to take the flight; however, the review did not rule out the pilot inducing pressure on himself. FAA Advisory Circular (AC) 135-15, Emergency Medical Services/Airplane  (EMS/A) addresses several subject areas not practiced by the operator, including, \"Additional considerations when planning IFR flights include the following: (1) Avoid flight in icing weather whenever possible.\"", "probable_cause": "The pilot's inadvertent flight into adverse weather [severe icing] conditions, resulting in an aerodynamic stall impact with rising, mountainous terrain during approach. A factor contributing to the accident was the pilot's inadequate planning for the forecasted icing conditions.\n"}