{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-ii-hyannis-1-killed", "date": "Nov 18, 1994 at 2200 LT", "type": "Cessna 402", "operator": "Island%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Nantucket - Hyannis", "msn": "402C-0223", "yom": 1979, "flight_number": null, "city": "Hyannis-Barnstable", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3350, "captain_hours_type": 450, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14178, "circumstances": "The airplane was on an ILS runway 15 approach and collided in-flight with static wires, approximately 2 miles north of the runway. The wires were located in the airplane's flight path, and in a direct line with the ILS final approach course. At the time of the accident the local control tower was closed. Three other aircraft made the approach prior to N402BK, and the pilots of those aircraft all agreed that at about 500 to 700 feet msl, on the final approach course, they encountered downdrafts and turbulence. All the pilots agreed, the downdrafts caused their airplanes to fall below the glide slope, and that in order to rejoin the glide slope, they had to increase power or change the airplane's pitch attitude. The Otis Air National Guard Base 2155 weather observation was; indefinite ceiling 100 sky obscured, visibility 3/4 miles, light rain and fog, temperature 59° F, dew point 58° F, wind 170°, 14 knots, gust to 19, altimeter 29.96 inches hg.", "probable_cause": "The pilot's failure to maintain a proper glide path during an ILS approach, which resulted in a collision with power lines. Factors in this accident were; adverse weather conditions with turbulence, downdrafts and fog."}