{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6a-agana-80-killed", "date": "Sep 19, 1960 at 0602 LT", "type": "Douglas DC-6", "operator": "World-Airways-2", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Clark – Agana – Wake – Travis", "msn": "44914", "yom": 1956, "flight_number": "WO830", "city": "Agana-Antonio Borja Won Pat", "zone": "All Guam Island", "country": "Guam Island", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 7, "pax_on_board": 86, "pax_fatalities": 73, "other_fatalities": 0, "total_fatalities": 80, "captain_hours": 15681, "captain_hours_type": 2548, "copilot_hours": 6317, "copilot_hours_type": 217, "aircraft_hours": 12746, "circumstances": "On September 19, 1960, at approximately 0602 local time, a Douglas DC-6AB, N 90779, operated by World Airways, Inc., as Military Air Transport Flight 830/18, bound for Wake Island and the United States. crashed and burned on Mt. Barrigada approximately two nautical miles from the departure end of runway 6L, Agana Naval Air Station, Guam, Mariana Islands. Of the 94 occupants on board, seven crew members and 73 passengers received fatal injuries; one crew member and 13 passengers survived. The flight received FAA Air Route Traffic Control route and departure clearances and took off into night VFR weather conditions. It made a right turn after takeoff and although making a-continuous climb over the distance flown. it struck Mt. Barrigada at a point approximately 300 feet above the elevation of the airport, and slid into the thick-underbrush cutting a Swath for nearly 1,1000 feet before it came to rest. Damage and injury were more attributable to fire than impact forces. The Board determines that this accident occurred because of the failure of the pilot to comply with published departure procedures applicable to runways 6 left and 6 right.", "probable_cause": "The Board determines that the probable cause of this accident was the failure of the pilot to comply with published departure procedures applicable to runways 6 left and 6 right. In addition, World Airways operations manual stated that radio facility charts, current flight information manuals and other documents which indicated the correct departure procedure for runway 06L must be carried in the airplane. These documents advise pilots when taking off in this direction to climb to an altitude of 1,000 feet before turning to the east. It is therefore difficult to understand why this procedure was not followed. Owing to the low intensity of the single red flashing beacon on the summit of the mountain and the likelihood of early morning mountain haze, it is questionable whether the beacon would have been visible to the crew, thus alerting them to their precarious position in sufficient time for evasive action to be taken."}