{"url": "https://www.baaa-acro.com/crash/crash-cessna-207-skywagon-susitna-river-1-killed", "date": "Jun 13, 2018 at 1205 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Spernak%20Airways", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Anchorage - Tyonek", "msn": "207-0027", "yom": 1969, "flight_number": null, "city": "Susitna River", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1442, "captain_hours_type": 514, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 31711, "circumstances": "Two wheel-equipped, high-wing airplanes, a Cessna 207 and a Cessna 175, collided midair while in cruise flight in day visual meteorological conditions. Both airplanes were operating under visual flight rules, and neither airplane was in communication with an air traffic control facility. The Cessna 175 pilot stated that he was making position reports during cruise flight about 1,000ft above mean sea level when he established contact with the pilot of another airplane, which was passing in the opposite direction. As he watched that airplane pass well below him, he noticed the shadow of a second airplane converging with the shadow of his airplane from the opposite direction. He looked forward and saw the spinner of the converging airplane in his windscreen and immediately pulled aft on the control yoke; the airplanes subsequently collided. The Cessna 207 descended uncontrolled into the river. Although damaged, the Cessna 175 continued to fly, and the pilot proceeded to an airport and landed safely. An examination of both airplanes revealed impact signatures consistent with the two airplanes colliding nearly head-on. About 4 years before the accident, following a series of midair collisions in the Matanuska Susitna (MatSu) Valley (the area where the accident occurred), the FAA made significant changes to the common traffic advisory frequencies (CTAF) assigned north and west of Anchorage, Alaska. The FAA established geographic CTAF areas based, in part, on flight patterns, traffic flow, private and public airports, and off-airport landing sites. The CTAF for the area where the accident occurred was at a frequency changeover point with westbound Cook Inlet traffic communicating on 122.70 and eastbound traffic on 122.90 Mhz. The pilot of the Cessna 175, which was traveling on an eastbound heading at the time of the accident, reported that he had a primary active radio frequency of 122.90 Mhz, and a nonactive secondary frequency 135.25 Mhz in his transceiver at the time of the collision. The transceivers from the other airplane were not recovered, and it could not be determined whether the pilot of the Cessna 207 was monitoring the CTAF or making position reports. ", "probable_cause": "The failure of both pilots to see and avoid the other airplane while in level cruise flight, which resulted in a midair collision."}