{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-10-dk-toronto-2-killed", "date": "Jun 22, 1983 at 0858 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Skycraft%20Air%20Transport", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cleveland - Toronto", "msn": "12424", "yom": 1944, "flight_number": null, "city": "Toronto-Lester Bowles Pearson", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A Douglas C-47A cargo plane was destroyed when it crashed while in final approach to Toronto International Airport, ON (YYZ), Canada. Both pilots were killed. Skycraft Air Transport Flight 505 operated on a cargo flight from Cleveland-Hopkins International Airport, OH (CLE), USA. It was loaded with 6 wire mesh baskets, each almost filled with automobile roof bows. On completion of the loading, the crew chief stated he asked the flight crew if they wished the load tied down. They responded by saying they would take care of it. Flight 505 departed Cleveland at 07:45, on a VFR flight plan. The Toronto terminal controller gave a few small heading changes to direct the flight to the instrument landing system (ILS) localizer for an almost straight-in approach to runway 06R, then transferred it to the arrival controller, who continued vectoring the aircraft. During the approach, the arrival controller twice requested Flight 505 to maintain its best speed for spacing from other aircraft. The crew initially reported they were flying their maximum speed, and later indicated they were at their best speed as the aircraft was fairly heavy. Flight 505 called the tower over the outer marker and was cleared to land. After crossing the threshold 100 to 150 ft above the runway, the nose of the aircraft smoothly rose 5 to 10 deg. The nose then dropped an almost equal number of degrees, as if a correction had been made for the nose high attitude. This up, then down pitch movement was quickly followed by two pitch oscillations of increasing speed and magnitude. On the fourth oscillation, the nose continued to rise 45 to 60 deg. and the aircraft started to climb. The engine noise seemed to increase as the aircraft pitched up for the last time. At approximately 200 ft, as the aircraft reached the apex of its climb, the left wing dropped and the aircraft yawed to the left approximately 90 degrees. The wings levelled, then the aircraft fell into the field to the right side of the runway. The time between the beginning of the first oscillation and the impact with the ground is estimated to have been approximately 10 seconds. On impact the right main gear ruptured a fuel tank and a post-impact fuel fire ensued.", "probable_cause": "The aircraft's weight and centre of gravity limits were exceeded, and the cargo was not secured. These factors led to loss of control of the aircraft."}