{"url": "https://www.baaa-acro.com/crash/crash-gaf-nomad-n22b-kota-kinabalu-11-killed", "date": "Jun 6, 1976 at 1541 LT", "type": "GAF Nomad N.22", "operator": "Sabah%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Government", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Labuan - Kota Kinabalu", "msn": "14", "yom": 1975, "flight_number": null, "city": "Kota Kinabalu", "zone": "Sabah", "country": "Malaysia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane was completing a flight from Labuan to Kota Kinabalu, carrying the Prime Minister of Sabah and his delegation. On final approach to runway 20, while at an altitude of 600 feet and a speed of 86 knots, the airplane stalled and crashed into the shallow sea which was about three feet deep, some 3 km short of runway threshold. The aircraft was totally destroyed and all 11 occupants have been killed. \r\nCrew:\r\nGhandi Nathan.\r\nPassengers:\r\nTun Fuad Stephens, Prime Minister of Sabah,\r\nDatuk Peter Mojuntin, Sabah Minister of Local Government and Housing,\r\nDatuk Salleh Sulong, Sabah Finance Minister,\r\nChong Thien Vun, Sabah Works and Communication Minister,\r\nDatuk Darius Binion, Assistant Minister to Deputy Chief Minister,\r\nDatuk Wahid Peter Andu, secretary to Sabah Finance Minister,\r\nDr. Syed Hussin Wafa, Director of State Economic Planning Unit,\r\nDatuk Ishak Atan, Private Secretary to Malaysian Federal Finance Minister Tengku Razaleigh Hamzah,\r\nJohari Stephens (Tun Fuad's eldest son),\r\nCorporal Said Mohammad, bodyguard to Tun Fuad Stephens.", "probable_cause": "The findings of an investigating team did not reveal any technical errors or sabotage as being the causes of the air crash. What they have instead discovered is that the fault was due to human error. It was also revealed that the aircraft's storage space at the back of the aircraft, was loaded with goods above the maximum load. As a consequence this had resulted in the aircraft losing control when it attempted to land at the Kota Kinabalu Airport, thus resulting in the accident."}