{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-marie-galante-15-killed", "date": "Nov 18, 1978", "type": "De Havilland DHC-6 Twin Otter", "operator": "Air%20Guadeloupe", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Pointe-à-Pitre - Marie-Galante", "msn": "469", "yom": 1975, "flight_number": null, "city": "Marie-Galante", "zone": "Guadeloupe", "country": "Guadeloupe", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 19, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine airplane departed Pointe-à-Pitre on a schedule flight to the Island of Marie-Galante, carrying 19 passengers and one pilot. Weather conditions deteriorated en route and while approaching Marie-Galante, the ceiling was very low, about 200 feet above water with rain falls, turbulences and stormy conditions. While completing a slight turn to the left, the left wing tip struck the water surface. The aircraft crashed into the sea and sank by a depth of 13 meters few hundred meters offshore. Five passengers were rescued while 15 other occupants, among them the pilot, were killed. The wreckage was recovered. The aircraft was not equipped with a flight data recorder or an autopilot system. ", "probable_cause": "In the absence of a flight data recorder (not compulsory on this type of aircraft), investigators stated that their examination of the wreck showed no evidence of a technical failure of the aircraft or of its engines or equipment prior to impact, and that the probable cause of the accident was the decision taken by the pilot to descend in cloud to try to establish visual contact with the ground or the sea. The absence of an autopilot system (it was not installed in the aircraft) was acknowledge by the commission. It was reported that the airline had requested and obtained from the French CAA an exemption to fly this aircraft with only one pilot, but the said exemption mentioned that an operative autopilot system was compulsory for all flights, which was not the case for this aircraft. Prior to the accident, the Pilot's Association had officially protested in writing about the total lack of implementation of these provisions by the airline, about the pressures exerted onto the pilots to accept such flights in the absence of ATC radar coverage, of airborne weather radar, DME and transponder equipment, together with inadequate maintenance practices.  "}