{"url": "https://www.baaa-acro.com/crash/crash-handley-page-hpr-7-dart-herald-203-jersey", "date": "Dec 24, 1974 at 2018 LT", "type": "Handley Page HPR-7 Dart Herald", "operator": "British%20Island%20Airways.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Southampton - Saint Peter", "msn": "196", "yom": 1968, "flight_number": "UK185", "city": "Jersey", "zone": "Channel Islands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 49, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3515, "captain_hours_type": 504, "copilot_hours": 7052, "copilot_hours_type": 680, "aircraft_hours": 11781, "circumstances": "The aircraft was operating British Island Airways flight UK 185, a scheduled night passenger service from Southampton (SOU) to Guernsey (GCI). It taxied out initially at 17:49 but during the takeoff run it was noticed that the starboard engine's rpm gauge indicated 14,550 rpm instead of 15,000 and that the torque reading on the same engine was below the datum appropriate to the use of water methanol injection. The commander, who was handling the aircraft, therefore decided to abandon the takeoff when the speed had reached about 60 knots and he returned the aircraft to the apron. A ground run carried out on the starboard engine produced normal full power indications and so the passengers were re-embarked and the flight departed for the second time at 18:21. The power output from the engines during this takeoff was satisfactory but when the aircraft had reached about 200 feet a rise in the torque indication of the starboard engine was observed. Climb power was set and the flight climbed to FL80 and continued on track to Guernsey. The descent into Guernsey was started when the aircraft was about 35 nm from the airport. Power was reduced on both engines but when the fuel flow was being trimmed back the starboard engine's turbine gas temperature (TGT), torque and fuel flow gauges showed an increase in their readings and because they continued to rise the engine was shut down and the propeller feathered. Guernsey Approach Control was informed of the situation and asked to have the emergency services standing by for the landing. The aircraft continued the descent but when it was about 5 nm from the runway it was advised by ATC that the airline had requested that it should land at Jersey airport instead of Guernsey. It was therefore decided to divert to Jersey and clearance was received from ATC to proceed on course at 1,500 feet above mean sea level (amsl). The aircraft changed to the Jersey Approach Control frequency and after ensuring that ATC was aware of the emergency the commander requested permission to make an ILS approach to runway 27 although the weather at the time was clear. The commander did not consider that it was necessary to brief the co-pilot about the approach and landing to Jersey as this had already been covered during a previous approach to the airport earlier in the day and he made no special reference to the single engine approach condition. Jersey radar positioned the aircraft on the ILS localiser and it became established at a range of about 5½ nm from the runway and commenced its descent shortly afterwards. In the vicinity of the outer marker the undercarriage was lowered followed by takeoff flap (5°). ATC cleared the aircraft to land and reported the wind as 270° at 10 knots. The aircraft continued its descent flying slightly above the ILS glide path with the airspeed increasing from about 120 knots to 137 knots. Power was reduced on the port engine to a very low value and the IAS began to decay at a rate of about one knot per second. When the aircraft was between 400 and 300 feet above the runway full landing flap (30°) was selected and both pilots considered that at this stage they were correctly positioned for the approach. The co-pilot noticed that the airspeed was about 105-110 knots when he selected full flap. (The recommended speed for the final approach was 99½ knots, ie 10 knots above VATI). The aircraft became displaced to the right of the runway centre line as it approached the threshold and the commander tried to realign it with the runway by making a sidestep manoeuvre to the left. The IAS had continued to decrease at a steady rate during the final stage of the descent and that at this point it was about 89 knots. When the commander realised that he was not going to be successful in his attempt to realign the aircraft with the runway centre line he called for full power. The aircraft was now alongside the runway threshold lights. The co-pilot advanced the throttle on the port engine and believing that the commander had also called 'overshooting' he selected the undercarriage to retract. The aircraft began to yaw and roll rapidly to the right resulting in the starboard wing tip and starboard main wheels almost simultaneously striking the ground well to the right of the runway edge. The aircraft subsided on to the grass as the undercarriage retracted, spun round to the right through approximately 180° and then slid backwards until it came to rest astride a small road on the northern perimeter of the airfield. All 53 occupants were evacuated safely, four of them were slightly injured. ", "probable_cause": "The accident was caused by the application of asymmetric full power when there was insufficient airspeed to maintain directional control and when the aircraft was too close to the ground to allow recovery from the uncontrollable yaw and roll which developed. Other causal factors were:\r\n- The requirement to carry out a single engine approach,\r\n- The failure to keep the aircraft correctly aligned with the runway,\r\n- The failure to maintain adequate airspeed during the final stages of the approach."}