{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-12p-kazan-1-killed", "date": "Apr 30, 1953 at 2137 LT", "type": "Ilyushin II-12", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Moscow – Kazan", "msn": "9 301 31 14", "yom": 24, "flight_number": "SU035", "city": "Kazan", "zone": "Republic of Tatarstan", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 18, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Moscow-Vnukovo at 1911LT and continued under VFR at an altitude of 1,200 meters until Kazan. The crew obtained the permission to descent to Kazan and reduced his altitude to 600 and then 300 meters. During 3 to 4 minutes, the aircraft was flying along the Volga River at an altitude of 300 meters when the crew heard a noise and both engines lost power simultaneously. In the mean time, fire erupted from the exhaust pipe and the crew elected to activate the fire extinguisher system on both engines but without success. The captain reduced his altitude in an attempt to make an emergency landing on the Volga River. The airplane crash landed on the water and eventually came to rest near the bank. 22 occupants were able to evacuate the cabin while a passenger died from drowning. The aircraft sank to a depth of 18 meters. ", "probable_cause": "It was determined that the aircraft collided, at an altitude of 300 meters, with several ducks. A duck hit the left engine while a second hit the top part of the cockpit, just above the windshield. The impact damaged the upper side of the flight deck and a short-circuit occurred on the magneto switch, causing both engines to stop. The crew elected to feather both propellers but this was not possible because the generator did not provide sufficient power at that time. "}