{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690-temecula", "date": "Oct 13, 2001 at 2220 LT", "type": "Rockwell Grand Commander 690", "operator": "Mach 1 Aircraft", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Flagstaff – Temecula", "msn": "690-11072", "yom": 1973, "flight_number": null, "city": "Temecula-French Valley", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12880, "captain_hours_type": 4205, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4844, "circumstances": "The airplane collided with an airport boundary fence during an aborted landing. The pilot made a normal approach following the visual approach slope indicator (VASI) with gear down and full flaps and touched down just past the numbers and began to decelerate. The pilot selected reverse thrust with both engines. As he added power to decelerate, the airplane suddenly veered to the left and off the runway when the right engine did not go into reverse thrust. He deselected reverse thrust and aligned the airplane with the runway. He was approaching the end of the runway at high speed and elected to attempt a takeoff. The airplane went off the end of the runway onto smooth grass. The pilot rotated the airplane, but the airplane collided with an airport boundary fence and came to rest in a field. In a post accident examination, when the power levers were placed in the full reverse position, the left fuel control measured 4°, while the right measured 0°. The left pitch control measured 10°, while the right measured 0°; the controls should have read 0°. A controls engineer determined that during landing, there would be a 10° propeller pitch control (PPC) angle mismatch, which would be about 2.5° of BETA angle. With matched levers, there would be asymmetric reverse thrust with the left engine lower in torque. This would result in the airplane turning towards the left if both propellers had gone into reverse pitch.", "probable_cause": "A misrigging of the engine controls that resulted in an asymmetric reverse thrust condition."}