{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2tp-near-rocca-di-mezzo-3-killed", "date": "Mar 9, 2002 at 1339 LT", "type": "PZL-Mielec AN-2", "operator": "Svedijos Prekes", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Mountains", "schedule": "Budapest - Tunis", "msn": "1G137-53", "yom": 1972, "flight_number": "SJK2801", "city": "Rocca di Mezzo", "zone": "Abruzzo", "country": "Italy", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Budapest-Ferihegy Airport at 0829LT on a VFR flight to Tunis. According to the flight plan the aircraft would fly over Split, Pescara, crossing the Apennines towards Ostia and then onwards to Tunis. Weather conditions over the central part of Italy were poor with a cold front associated with thunderstorm activity, low clouds and icing conditions. After passing over the Adriatic sea, the aircraft overflew Pescara at 1320LT where the pilot informed ATC that the aircraft was inbound Aneda (a reporting point 19 NM East of Monte Rotondo) at a cruising altitude of 5.500 feet. While in vicinity of Pescara, ATC requested and obtained confirmation from the crew that he was able to continue under VFR mode. Shortly later, at a speed of 115 knots, the single engine aircraft struck the slope of Mt Rotondo (1.880 metres high) located near Rocca di Mezzo. The aircraft disintegrated on impact and all three occupants were killed. ", "probable_cause": "Analysis of available evidence make it reasonable to classify the event investigated as an unintentional terrain impact, Controlled Flight Into Terrain (CFIT). At accident time, because of the reduced visibility, incompatible with VFR flying, the crew could not evaluate correctly the orography of the area along there route. It has to be noted that it was not possible to ascertain if adequate maps were available to the crew showing the exact position of ground relief and obstacles. It was not possible to determine if the pilots had flown across the same area in the past. Given the meteorological conditions over the area, the crew did not conform to the Visual Flying Rules that mandated for a track change to maintain the required flight parameters (visibility/clearance from obstacles) and/or a diversion to a suitable alternate airport (as international rules mandate).\r\nContributing factors:\r\nAnalysis of available evidence suggests that the following may be considered as contributory factors to the accident. The prevailing meteorological conditions existing on March 9, 2002 over the flight path of LY-AVD across the central part of Italy did not allow for the flight to be continued under VFR. The Antonov AN-2 was not fit for flying in low visibility (IMC) and was not equipped for flying in icing conditions. The pilot of the LY-AVD did not hold the required English language radio-telephony (RT) qualification to operate outside the country of licensing. The pilot of the LY-AVD did not hold an IFR qualification (for flying in IMC)."}