{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-4-1009a-sydney", "date": "Dec 13, 1950 at 0600 LT", "type": "Douglas DC-4", "operator": "Swissair", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Zurich – Geneva – Shannon – Gander – New York", "msn": "43073", "yom": 1947, "flight_number": null, "city": "Sydney", "zone": "Nova Scotia", "country": "Canada", "region": "North America", "crew_on_board": 11, "crew_fatalities": 0, "pax_on_board": 20, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While approaching Gander in poor weather conditions, ATC instructed the crew to divert to Sydney, Nova Scotia. On final approach, the aircraft was too low and hit three approach lights. Immediately, the pilot in command increased power but as both left engines were damaged by obstacle impact, they failed to respond properly. As a result, the left wing stalled and the aircraft crashed in flames few dozen yards short of runway. All 31 occupants were able to evacuate the cabin and the crew extinguished the fire. Unfortunately, thirty minutes later, another fire erupted on the left side of the aircraft, partially destroying the airplane. Carrying 2,5 tons of cargo, the aircraft christened 'Zürich' was performing a regular schedule flight from Zurich to New York via Geneva, Shannon and Gander. ", "probable_cause": "The impact of the aircraft with the ground while out of control due to failure on the part of the captain to maintain sufficient height to clear the approach light poles, three of which were struck by the aircraft. After striking the approach light poles, the captain and first officer were unable to maintain control of the aircraft due to the malfunctioning of numbers 1 and 2 engines and structural damage to the left wing and flap."}