{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3a-legazpi-2-killed", "date": "Dec 16, 1965 at 1722 LT", "type": "Douglas DC-3", "operator": "Air%20Manila", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Manila – Legazpi", "msn": null, "yom": null, "flight_number": "AM101", "city": "Legazpi", "zone": "Albay", "country": "Philippines", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 18, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1957, "captain_hours_type": 1256, "copilot_hours": 2596, "copilot_hours_type": 709, "aircraft_hours": null, "circumstances": "Flight AM101 was a scheduled domestic flight from Manila to Legaspi. It took off from Manila International Airport at 1505 hours. At 1640 hours it established initial contact with Legaspi Radio, reported 7 minutes north-west of the field and requested weather and landing information. Legaspi Radio transmitted the following information: 1600H surface wind 0400/8 kt, visibility 5 km clouds 6 oktas 450 metres, 8 oktas 2,100 metres; temperature 24°, dewpoint 24°, runway in use 06 QNH 29.81 inches. At 1707 hours the flight requested information regarding the traffic in the circuit and was informed that there was none. At 1715 hours the sound of an aircraft, presumably AM101, was heard south of the airport but the aircraft was hardly visible. At 1716 hours the flight inquired again about the present weather and the 1700 hours weather observation was passed to the aircraft. Subsequent inquiry about present visibility, wind direction and speed was made by the flight which was advised that the wind was 040 18 kt and the visibility approximately 4 km. At 1718 hours the flight was seen turning for a landing on Runway 24. The landing roll was described by witnesses as unusually fast after the aircraft made a two-wheel touchdown, tail wheel high approximately 300 m after the threshold of Runway 24. Before the tail wheel came into contact with the runway full power was applied and the aircraft was observed airborne. At approximately 200 ft altitude, it initiated a tight left turn, collided with the top of a tree and then hit a building located two miles southwest of Legaspi Airport. Both pilots were killed while all other occupants were injured. ", "probable_cause": "The Board determined that the probable cause of this accident was a power stall during a tight turn manoeuvre at too low an altitude from which successful recovery was impossible."}