{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-325-navajo-independence", "date": "May 2, 1992 at 0930 LT", "type": "Piper PA-31-310 Navajo", "operator": "Cross Country Construction", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hemet - Carson City", "msn": "31-7612023", "yom": 1976, "flight_number": null, "city": "Independence", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1800, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1750, "circumstances": "The Piper Navajo had not flown for about 9 months. During preparation for flight the pilot discovered that the battery was dead. The battery was removed for charging by the fixed base operator, the battery box was cleaned and painted. The operator advised that the battery was over 3 years old plus the 9 months of non use rendered the battery non reliable and recommended that it be replaced. The pilot choose not to change the battery. The pilot requested that the main tanks be topped. The pilot flew the airplane for a short time. The next day (day of the accident) the pilot, while preflighting the airplane, discovered that the battery was again dead so he requested an external power cart for starting. About an hour into the cross country flight the pilot stated that both engines quit while on the aux tanks. He stated that he had no electrical power for fuel boost pumps or starters. The airplane collided with electrical power lines during the emergency landing attempt in an alfalfa field.", "probable_cause": "Fuel starvation due to \r\n1) the pilots inadequate preflight planning preparation, \r\n2) the pilot's fuel system management, and \r\n3) his operation of the aircraft with known deficiencies in the aircraft electrical system. \r\nFactors in the accident were: \r\n1) the deteriorated condition of the airplane battery, and\r\n2) the pilots lack of recent experience."}