{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-4y0-pontianak-0", "date": "Nov 2, 2010 at 1118 LT", "type": "Boeing 737-400", "operator": "Lion%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jakarta – Pontianak", "msn": "24911/2033", "yom": 1991, "flight_number": "JT712", "city": "Pontianak-Supadio", "zone": "West Kalimantan", "country": "Indonesia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 169, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8190, "captain_hours_type": null, "copilot_hours": 656, "copilot_hours_type": null, "aircraft_hours": 49107, "circumstances": "On 2 November 2010, a Boeing Company B737-400 aircraft, registered PK-LIQ, was being operated by Lion Mentari Airlines on a passenger schedule flight with flight number JT 712. This flight was the first flight for the crew and was scheduled for departure at 09.30 LT (02.30 UTC). On board the flight was 175 person included 2 pilots and 4 flight attendants and 169 passengers consisted 2 infants and one engineer. The pilots stated that the aircraft had history problem on the difficulty of selection the thrust reversers and automatic of the speed brake deployment. This problem was repetitive since the past three months. The aircraft pushed back at 0950 LT (0250 UTC). During taxi out, the yaw damper light illuminated for two times. The pilot referred to the Quick Reference Handbook (QRH) which guided the pilot to turn off the yaw dumper switch then back to turn on. Considered to these problems, the pilot asked the engineer to come to cockpit and asked to witness the problem. The aircraft departed Soekarno Hatta International Airport, Jakarta at 1012 LT (0312 UTC) with destination of Supadio Airport, Pontianak. The Pilot in Command acted as pilot flying (PF) and the Second in Command acted as pilot monitoring (PM). The flight to Pontianak until commenced for descent was uneventful. Prior to descend, the PF performed approach crew briefing with additional briefing included review of the past experiences on the repetitive problems of thrust reversers which sometimes hard to operate and the speed brake failed to auto deploy. Considering these problems, the PF asked to the PM to check and to remind him to the auto deployment of the speed brake after the aircraft touch down. During descend, the pilot was instructed by Pontianak Approach controller to conduct Instrument Landing System (ILS) approach for runway 15 and was informed that the weather was slight rain. On the initial approach, the auto pilot engaged, flaps 5° and aircraft speed 180 knots. After the aircraft captured the localizer at 1300 feet, the PF asked to the PM to select the landing gear down, flaps 15° and the speed decreased to 160 knots. The PF aimed to set the flaps landing configuration when the glide slope captured. When the glide slope captured, the auto pilot did not automatically follow the glide path and the aircraft altitude maintained at 1300 feet, resulted in the aircraft slightly above the normal glide path. The PF realized the condition then disengaged the auto pilot and the auto throttle simultaneously, and fly manually to correct the glide path by pushing the aircraft pitch down. While trying to regain the correct the glide path, the PF commanded for flaps 40° and to complete the landing checklist. The flap lever has been selected to 40°, but the indicator indicated at 30°. Realized to the flaps indication, the PF asked the landing speed for flaps 30° configuration in case the flaps could not move further to 40°. When aircraft altitude was 600 feet and the pilots completing the landing checklist, the PM reselected the flap from 30° to 40° and was successful. The pilots realized that the aircraft touched down was beyond the touchdown zone and during the landing roll the PF tried to select the thrust reverser but the levers were hard to select and followed by the speed brake failed to automatic-deploy. The pilots did not feel the deceleration, and then the PF applied maximum manual braking and selected the speed brake handle manually. Afterward, the thrust reversers successfully operated and a loud sound was heard prior to the aircraft stop. The Supadio tower controller on duty noticed that the aircraft was about to overrun the runway and immediately pressed the crash bell. The aircraft stopped at approximately 70 meters from the runway or 10 meters from the end of stop-way. The PIC then commanded to the flight attendants to evacuate the passengers through the exits. No one injured in this accident.", "probable_cause": "The following factors were identified:\r\n- Inconsistency to the Aircraft Maintenance Manual (AMM) for the rectifications performed during the period of the reversers and auto speed brake deployment problem was might probably result of the unsolved symptom problems.\r\n- The decision to land during the un-stabilized approach which occurred from 1000 feet to 50 feet above threshold influenced by lack of crew ability in assessing to accurately perceive what was going on in the flight deck and outside the airplane.\r\n- The effect of delayed of the speed brake and thrust reverser deployment effected to the aircraft deceleration which required landing distance greater than the available landing distance."}