{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-27-near-vega-baja-1-killed", "date": "Sep 29, 2004 at 1859 LT", "type": "Britten-Norman Islander", "operator": "Air%20Flamenco", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Mayaguez – San Juan", "msn": "905", "yom": 1981, "flight_number": null, "city": "Vega Baja", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On September 29, 2004, about 1859, Atlantic standard time, the accident airplane, N902GD, operating as an \"on demand\" air taxi flight, transporting bank financial documents, departed\r\nMayaguez, Puerto Rico, and was later reported as not having arrived at its destination. Search and rescue assets later discovered airplane related debris, specific to the missing airplane, floating in the Atlantic Ocean, in the vicinity of geographic position 18 degrees 29 minutes north latitude, 066 degrees 27 minutes west longitude. The NTSB evaluated radar and weather data, and radar track data for the flight showed that after departure the accident airplane climbed to 1,700 feet, and then descended to 1,300 feet at 1840. From 1840 to 1850, the radar data indicated that the flight was proceeding east along the northern coast of Puerto Rico, at an altitude of 1,100 feet. About 1855, the data showed that the airplane climbed to 1,400 feet, and about 1856, it descended to about 1,000 feet. About 1858, the airplane descended to 800 feet, and then to 600 feet, before disappearing from radar at 18:59:18. Weather data showed that a weak upper air trough, a moist low level southeasterly flow and associated showers and thunderstorms had formed over Puerto Rico during the time of the accident flight. The weather data showed that at departure visual meteorological conditions existed, but doppler weather radar data showed that a 50 dBz (level 5) rain shower was positioned about 3 to 5 miles off the airplane's right wing from 1837 to 1838, and from 1855 to 1901 there was a level 4-5 (45-50 dBZ) rain shower along the accident airplane's track, and the radar track data along with the doppler weather radar data was consistent with the flight having penetrated the rain shower corresponding to the time radar contact with the flight was lost. The NTSB Weather Group Chairman's Report has been included as an attachment to the factual report.", "probable_cause": "The pilot's improper inflight planning which resulted in an inflight encounter with weather (low ceilings and thunderstorms), his loss of aircraft control, and an inflight collision with the ocean during uncontrolled descent."}