{"url": "https://www.baaa-acro.com/crash/crash-lockheed-18-56-23-lodestar-tallahassee-4-killed", "date": "Jun 8, 1962 at 0756 LT", "type": "Lockheed 18 LodeStar", "operator": "Winn-Dixie", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Montgomery – Jacksonville", "msn": "2477", "yom": 1943, "flight_number": null, "city": "Tallahassee", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A Lockheed Lodestar 18, registered N45W and owned by Winn-Dixie Stores, Inc, departed Montgomery-Dannelly Field, Alabama, at approximately 07:06 on company business flight to Jacksonville, Florida. En route altitude was 8,000 feet. A Lockheed T-33A-1-LO Shooting Star US Air Force jet trainer, serial 51-4532, departed Moody AFB at approximately 07:13 on a local IFR training flight. The T-33 climbed to 20,000 feet following takeoff from Moody and proceeded to the Tallahassee VOR where it was cleared by Tallahassee Approach Control for penetration and an ILS approach to runway 36 at Tallahassee Airport. While under Tallahassee Approach Control, two ILS approaches were completed followed by two ILS missed approaches. After the second ILS missed approach, the flight was cleared at approximately 07:50 by Tallahassee Approach Control, \"...from present position direct to the Tallahassee OMNI, maintain 3,000, anticipate routing Victor 22, Greenville, direct to Valdosta OMNI.\" After that the T-33 reported VFR on top at 4000 feet. The crew continued VFR and requested a climb to 20.000 feet, direct to Valdosta, which was approved. The two aircraft collided in midair at approximately 8,000 feet altitude, approximately 4.3 miles northwest of the Tallahassee VOR Station. The T-33 climbed up into the Lodestar. The Lodestar's right propeller cut through the forward end of the T-33 right tip tank. The Lodestar's fuselage lower surface scrubbed across the T-33's right wing upper surface just inboard of that tip tank at an angle of 14 degrees leftward from the T-33's longitudinal axis. The various impacts on the T-33's right wing caused it to yaw to the right, with the result that its tail assembly ripped through the Lodestar's left wing at a greater angle than that of initial impact. The Lodestar's left wing was severed from trailing edge to leading edge at this time. The impact severed the T-33's tail assembly causing loss of control. The T-33 entered an inverted flat spin in which it remained until contact with the ground. Both crew members of the T-33 ejected safely. The Lodestar crashed, killing all four on board.", "probable_cause": "The Board determines the probable cause of this accident was failure of the T-33 pilots to observe the Lodestar while climbing through its flight altitude. unauthorized deviation from an IFR flight plan was a contributing factor."}