{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-sanderson-1-killed", "date": "Aug 16, 2002 at 1135 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Hill Peterson Carper Bee & Deitzler", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Mountains", "schedule": "Charleston - Charleston", "msn": "31-8052205", "yom": 1980, "flight_number": null, "city": "Sanderson", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5720, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4493, "circumstances": "The pilot completed a flight without incident, and seemed in good spirits before departing, by himself, on the return flight. The second flight also progressed without a incident until cleared from 8,000 feet msl to 5,000 feet msl, which the pilot acknowledged. Visual meteorological conditions prevailed at the time, and radar data depicted the airplane initiate and maintain a 500-foot per-minute descent until radar contact was lost at approximately 400 feet agl. The pilot made no mention of difficulties while en route or during the descent. The airplane impacted trees at the top of a ridge in an approximate level attitude, and came to rest approximately 1,450 feet beyond, at the bottom of a ravine. Examination of the wreckage revealed no preimpact failures or malfunctions. The pilot had been diagnosed with Crohn's disease (a chronic recurrent gastrointestinal disease, with no clear surgical cure) for approximately 35 years, which required him to undergo several surgeries more than 20 years before the accident. The pilot received a letter from the FAA on June 11, 1998, stating he was eligible for a first-class medical certificate. In the letter there was no requirement for a follow up gastroenterological review, but the pilot was reminded he was prohibited from operating an aircraft if new symptoms or adverse changes occurred, or anytime medication was required. His condition seemed to be stable until approximately 5 months prior to the accident. During this time frame, he experienced weight loss and blood loss, was prescribed several different medications to include intravenous meperidine, received 3 units of blood, and had a peripherally inserted central catheter placed. On the pilot's airmen medical application dated the month prior to the accident, the pilot reported he did not currently use any medications, and did not note any changes to his health. A toxicological test conducted after the accident identified meperidine in the pilot's tissue.", "probable_cause": "Physiological impairment or incapacitation likely related to the pilot's recent exacerbation of Crohn's disease. A factor in the accident was the pilot's decision to conduct the flight in his current medical condition."}