{"url": "https://www.baaa-acro.com/crash/crash-bristol-170-freighter-21-madrid-37-killed", "date": "May 9, 1957 at 1904 LT", "type": "Bristol 170 Freighter", "operator": "Aviaco-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Santiago de Compostela – Madrid", "msn": "12757", "yom": 1946, "flight_number": "AO111", "city": "Madrid-Barajas", "zone": "Madrid", "country": "Spain", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 32, "pax_fatalities": 32, "other_fatalities": 0, "total_fatalities": 37, "captain_hours": 5478, "captain_hours_type": null, "copilot_hours": 427, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a scheduled passenger transport flight from Santiago de Compostela to Madrid, carrying 32 passengers and 5 crew. As requested, the flight passed downwind to align itself for landing on the assigned runway 23 during which maneuver the control tower gave it the green light for landing. The aircraft went by at an altitude of about 300 metres, banking slightly to the left in order to see the light signal more easily. At 1904 hours it saw the green light, compensated for its left bank and, banking to the right, started a right spin which continued to the ground. The aircraft hit the ground with the front part of the fuselage, the right wing and the right engine propeller and caught fire. Although the airport fire fighting services reached the aircraft 6 minutes after the accident and promptly went into action, it was impossible to extinguish fire completely for more an hour. Its effects, however, were reduced to such an extent that the crew and passengers could have been saved had they not all died as a consequence of the violent impact. ", "probable_cause": "The accident was due to personnel errors. \r\n1) The failure of radiotelephony compelled the pilot to concentrate on the green light during the approach manoeuvre, \r\n2) The pilot's attention was so distracted that he operated close to the speed limit. Although such a distraction is infrequent, statistics show that it may occur after 5 000, 7 000 and even after 13 000 flying hours."}