{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-8-311-paris-4-killed", "date": "Jan 6, 1993 at 1920 LT", "type": "De Havilland DHC-8-300 (Dash-8)", "operator": "Lufthansa%20Cityline-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bremen - Paris", "msn": "210", "yom": 1990, "flight_number": "LH5634", "city": "Paris-Roissy-CDG", "zone": "Val-d'Oise", "country": "France", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 19, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 11924, "captain_hours_type": 2003, "copilot_hours": 500, "copilot_hours_type": 293, "aircraft_hours": 5973, "circumstances": "While approaching Paris-Roissy-CDG Airport by night, at a distance of 13 km from runway 27 threshold, the crew was instructed by ATC to modify the approach trajectory and to descent to runway 28. This late request was necessary because runway 27 was just closed to traffic after a Korean Air B747 contacted the runway surface with its engine n°1. While completing a left turn, the airplane lost height and crashed in a field located 1,800 metres short of runway. Four passengers were killed while 19 other occupants were injured. The aircraft was destroyed. At the time of the accident, the visibility was reduced between 700 and 1,400 metres due to light fog and rain. The copilot was in command and it is believed the crew was disturbed by the late runway change. While on descent heading 265°, 100 seconds before FDR stopped recording, at an altitude of 1,600 feet and a speed of 170 knots, both engine torques were at 20%. Twenty seconds later, both engines torque dropped to zero and the automatic pilot system was deactivated. At this time, the flaps were retracted. The sink rate increased then the aircraft entered a nose-up attitude with its speed decreasing. The aircraft struck the ground at a speed of 110 knots and crashed. ", "probable_cause": null}