{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-749a-79-constellation-near-lajes-30-killed", "date": "Aug 9, 1954 at 0240 LT", "type": "Lockheed L-749 Constellation", "operator": "Avianca-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Hamburg – Frankfurt – Paris – Madrid – Lisbon – Ponta Delgada – Hamilton – Bogotá", "msn": "2664", "yom": 1951, "flight_number": null, "city": "Lajes", "zone": "Azores Islands", "country": "Portugal", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 21, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 30, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was performing a transatlantic flight from Hamburg to Bogotá with intermediates stops at Frankfurt, Paris, Madrid, Lisbon, Ponta Delgada and Hamilton. While approaching Ponta Delgada by night, the crew was informed about fog at destination and as the visibility was below minima, the captain decided to divert to Lajes. After a uneventful refueling stop, the crew took off from Lajes Airport, bound for Hamilton, Bermuda, at 0237LT. Three minutes after its departure from runway 34, while climbing, the four engine aircraft hit the slope of a mountain and burst into flames about 9 km southwest of the airport. The aircraft disintegrated on impact and all 30 occupants were killed. ", "probable_cause": "The probable initial cause of the accident was the failure of the pilot to carry out the normal climb-out procedure following take-off from runway 34 on a flight to Bermuda and his having made a turn to the left instead of to the right, thus flying into the mountains instead of turning out to sea. \r\nThe possibility of the aircraft having been forced to make a left turn may be disregarded since, from examination of the wreckage, it appears that no mechanical failure occurred. \r\nThe procedure to be followed had been duly explained to the crew both at the briefing and in the instructions which were certainly given by the tower. It is pointed out, moreover, that the chart of Lajes in the route manual supplied to the crew clearly shows that all turns must be made towards the Northeast. \r\nThe question of a right turn following take-off appears to have been deemed a secondary matter by the crew members who called at the briefing office. They simply established that they had to proceed directly to Ponto Sul in order to avoid a collision with the mountains, the highest point of which reached 7 615 feet. \r\nFrom the heading presumed to have been flown by the aircraft before it crashed, it is quite apparent that the pilot did, in fact, intend to proceed to Ponto Sul. He appears not to have realized, however, that to do so he had to turn eastward towards the sea and not to the west over the land. \r\nIt is necessary to mention that, according to his company, this was the first time that the captain had landed at Lajes and that at Santa Maria, where he had already landed several times, the take-off procedure for flights towards the Northwest in the direction of Bermuda also involves a turn towards the sea. The turn at Santa Maria is made to the left, however, as the airport is located on the extreme west of the island. \r\nThe point known as Ponto Sul is shown on the reproduced 1:l 000 000 chart at Fig. 30. Examination of this chart will immediately explain the reason for the adoption in the Azores control area of the standard procedure whereby aircraft are required to fly over this point before proceeding towards Bermuda, in order to avoid the high ground on Terceira, S. Jorge, Pico and Faial Islands. \r\nSince Lajes Airport is located in the extreme Northeast of the Ihla Terceira, the requirement, for reasons of safety, to turn to the east and out to sea in order to avoid the mountains on the island needs no special comment, being obvious in view of the nature of the terrain. "}