{"url": "https://www.baaa-acro.com/crash/crash-breguet-bre1150-atlantic-farnborough-6-killed", "date": "Sep 20, 1968 at 1513 LT", "type": "Breguet Bre.1150 Atlantic", "operator": "Marine-Nationale", "flight_phase": "Landing (descent or approach)", "flight_type": "Demonstration", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Farnborough - Farnborough", "msn": "43", "yom": null, "flight_number": null, "city": "Farnborough", "zone": "Hampshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 1, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Registered 43 (F-XCVX), the aircraft was engaged in a demo flight at the annual Farnborough Airshow and was carrying five officers of the flottille 22F based at Nîmes-Garons Naval Air Station, France. Following several circuits, the crew decided to make a new low pass in front of the spectators with the left engine shut down and its propeller feathered. On final, while at an altitude of 300 feet and a speed of 140 knots with the flaps down to 10°, the aircraft stalled and crashed in a huge explosion on a parking located few hundred yards short of runway. Upon impact, the empennage was torn off and crashed on the roof of the staff mess of the British Air Force Aeronautical Research Center. All five crew members were killed as well one man on the ground. \r\nCrew:\r\nCpt Jean-Yves Saint-M'Leux,\r\nOE1 G. Durand, \r\nEV C. Lemaire,\r\nQM R. Bequier,\r\nS/Maj A. Goasguen.", "probable_cause": "As a result of the undercarriage having been left extended, it is possible that the air speed at the time of unfeathering the port prop was less than normal, and less than intended by the pilot. This in itself would not have resulted in an accident. Possibly because of [a] control jam, the rudder deflection necessary at this speed to balance the asymmetric thrust of the starboard engine and the drag of the unfeathered port propeller, was not applied. This was the most important cause, and allowed yaw, sideslip and roll to develop to the extent that the pilot had inadequate control of the port turn which he had initiated. The aircraft’s height and speed were insufficient to permit recovery by a reduction of power on the starboard engine. Bank therefore increased beyond the point at which level flight could be sustained, and the aircraft stalled in the turn and crashed."}