{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154b-2-sochi-92-killed", "date": "Dec 25, 2016 at 0525 LT", "type": "Tupolev TU-154", "operator": "Russian%20Air%20Force.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Moscow - Sochi - Hmeimim", "msn": "83A-572", "yom": 1983, "flight_number": null, "city": "Sochi-Adler", "zone": "Krasnodar Krai", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 84, "pax_fatalities": 84, "other_fatalities": 0, "total_fatalities": 92, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6689, "circumstances": "The airplane departed Moscow-Chkhalovksy AFB at 0138LT on a flight to Hmeimin AFB located near Latakia, Syria, carrying 84 passengers and 8 crew members. At 0343LT, the aircraft landed at Sochi-Adler Airport to refuel. At 0525LT, the takeoff was initiated from runway 24. After a course of 34 seconds, the pilot-in-command initiated the rotation at a speed of 300 km/h. Shortly after liftoff, the undercarriage were raised and the pilot continued to climb with a nose-up angle of 15°. About 53 seconds after takeoff, at an altitude of 157 metres, the captain asked the flaps to be retracted while the aircraft was climbing to a height of 231 metres with a speed of 360 km/h. Following erroneous movements on the control column, the aircraft nosed down and its speed increased to 373 km/h when the GPWS alarm sounded in the cockpit. With a rate of descent of 30 metres per second, the aircraft reached the speed of 540 km/h, rolled to the left to an angle of 50° and eventually crashed in the sea some 1,270 metres offshore, at 05:25 and 49 seconds. The flight took 73 seconds between liftoff and impact with water. The wreckage was found 2,760 metres from the end of runway 24 and 340 metres to the left of its extended centerline, at a depth of 30 metres. The aircraft disintegrated on impact and all 92 occupants were killed, among them 64 members of the Alexandrov Choir of the Red Army, their Artistic Director, nine journalists, seven officers from the Ministry of Defence, two senior officials and one representative of a public Company who were traveling to Hmeimim Air Base to commemorate the New Year's Eve celebrations with Russian soldiers based in Syria.", "probable_cause": "The accident was the consequence of a loss of control that occurred during initial climb by night over the sea after the pilot-in-command suffered a spatial disorientation due to an excessive neuropsychic stress combined with fatigue."}