{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46r-350t-matrix-cat-cay", "date": "Aug 25, 2013 at 1406 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Pure Beauty Farms", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Cat Cay - Kendall-Miami", "msn": "46-92004", "yom": 2008, "flight_number": null, "city": "Cat Cay", "zone": "Bimini", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12250, "captain_hours_type": 210, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1000, "circumstances": "According to the pilot, he applied full power, set the flaps at 10 degrees, released the brakes, and, after reaching 80 knots, he rotated the airplane. The pilot further reported that the engine subsequently lost total power when the airplane was about 150 ft above ground level. The airplane then impacted water in a nose-down, right-wing-low attitude about 300 ft from the end of the runway. The pilot reported that he thought that the runway was 1,900 ft long; however, it was only 1,300 ft long. Review of the takeoff ground roll distance charts contained in the Pilot’s Operating Handbook (POH) revealed that, with flap settings of 0 and 20 degrees, the ground roll would have been 1,700 and 1,150 ft, respectively. Takeoff ground roll distances were not provided for use of 10 degrees of flaps; however, the POH stated that 10 degrees of flaps could be used. Although the distance was not specified, it is likely that the airplane would have required more than 1,300 ft for takeoff with 10 degrees of flaps. Examination of the engine revealed saltwater corrosion throughout it; however, this was likely due to the airplane’s submersion in water after the accident. No other mechanical malfunctions or abnormalities were noted. Examination of data extracted from the multifunction display (MFD) and primary flight display (PFD) revealed that the engine parameters were performing in the normal operating range until the end of the recordings. The data also indicated that, 7 seconds before the end of the recordings, the airplane pitched up from 0 to about 17 degrees and then rolled 17 degrees left wing down while continuing to pitch up to 20 degrees. The airplane then rolled 77 degrees right wing down and pitched down about 50 degrees. The highest airspeed recorded by the MFD and PFD was about 70 knots, which occurred about 1 second before the end of the recordings. The POH stated that, depending on the landing gear position, flap setting, and bank angle, the stall speed for the airplane would be between 65 and 71 knots. Based on the evidence, it is likely that the engine did not lose power as reported by the pilot. As the airplane approached the end of the runway and the pilot realized that it was not long enough for his planned takeoff, he attempted to lift off at an insufficient airspeed and at too high of a pitch angle, which resulted in an aerodynamic stall at a low altitude. If the pilot had known the actual runway length, he might have used a flap setting of 20 degrees, which would have provided sufficient distance for the takeoff.\n", "probable_cause": "The pilot’s attempt to rotate the airplane before obtaining sufficient airspeed and his improper pitch control during takeoff, which resulted in the airplane exceeding its critical angle-of-attack and subsequently experiencing an aerodynamic stall at a low altitude. Contributing to the accident was the pilot’s lack of awareness of the length of the runway, which led to his attempting to take off with the airplane improperly configured."}