{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-stockholm-3-killed", "date": "Dec 3, 1992 at 0706 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Sigtuna Aero", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "City", "schedule": "Stockholm - Biggin Hill", "msn": "46-08118", "yom": 1988, "flight_number": null, "city": "Stockholm-Bromma", "zone": "Uppland", "country": "Sweden", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 386, "captain_hours_type": 127, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 845, "circumstances": "The single engine aircraft departed Stockholm-Bromma Airport runway 12 at 0703LT on a charter flight to Biggin Hill, carrying two passengers and one pilot. During climbout, at an altitude of 1,500 feet, the pilot was cleared to turn right and to continue to climb to FL040. At an altitude of 2,200 feet, the aircraft entered an uncontrolled descent then partially disintegrated in the air and eventually crashed in a residential area located in Åkeslund, south of the airport, three minutes after takeoff. Several cars and apartments were destroyed but no one on the ground was injured. The aircraft was destroyed and all three occupants were killed. At the time of the accident, weather conditions were marginal with clouds and turbulences.", "probable_cause": "It was determined that the aircraft was operated with a speed 30% above the maneuverable speed when, in turbulences, the left wing broke away due to excessive g loads. The aircraft entered an uncontrolled descent and partially disintegrated before final impact. A probable disconnection or malfunction of the gyro horizon/automatic pilot system as well as a wrong trim on part of the pilot were considered as contributing factors. "}