{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-near-novato-1-killed", "date": "Mar 5, 1998 at 1905 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Airpac%20Airlines", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Mountains", "schedule": "Santa Rosa - Oakland", "msn": "31-7952014", "yom": 1979, "flight_number": "APC263", "city": "Novato-Gnoss Field", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4300, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6881, "circumstances": "The airplane was on a VFR dusk cross-country flight when it collided with the 1,500-foot level of a hill. Radar data showed the aircraft in a descent from 2,000 feet until radar contact was lost about 1,500 feet msl, with a final ground speed of 194 knots. The route taken by the pilot was about 5 miles west of the route that the company pilots routinely flew, but while crossing higher terrain, it was a more direct route to the destination. A company pilot flying a few minutes ahead of the accident flight reported it was necessary to descend to between 1,200 and 1,500 feet msl in order to maintain VFR. A low-pressure system approaching the area from the west had resulted in low stratus, rain, and fog. At the time of the accident, a nearby weather reporting facility reported a 1,300-foot broken ceiling with 5- to 6-mile visibility in light rain and mist. On the evening of the accident, the pilot was scheduled to give a speech as her final examination in an evening college course. She had informed the instructor that she might be late, but had been told that he could not hold the class past its scheduled dismissal time to accommodate her late arrival. ", "probable_cause": "The pilot's failure to maintain adequate terrain clearance after initiating a descent over mountainous terrain at night and under marginal VFR conditions. The pilot's self-induced pressure to arrive at class with enough time remaining to take the final examination was a factor in the accident. "}