{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-anchorage", "date": "Dec 9, 1987 at 1558 LT", "type": "Cessna 402", "operator": "Wilbur%27s", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Valdez - Anchorage", "msn": "402B-0328", "yom": 1972, "flight_number": "8F304", "city": "Anchorage-Ted Stevens Intl", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11495, "captain_hours_type": 1225, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5301, "circumstances": "During arrival in heavy traffic, Reeve flight 726 (Boeing 727) and Wilburs flight 304 (Cessna 402B, N969JW) received radar advisories for visual approaches to runways 06L and 06R, respectively. Subsequently, both flights were cleared to land. At 1555:04, the local tower controller transmitted that the wind at the approach end of runway 06R was from 340° at 9 knots and the midfield wind was 330° at 7 knots. At approximately 1557, flight 726 landed on runway 06L. Approximately 69 seconds later, as flight 304 was crossing the threshold (thr) of runway 06R at about 100 feet agl, the aircraft encountered wake turbulences (w/t) and rolled sharply to the right, byd 90°. The pilot corrected with aileron and power, but the aircraft lost altitude and hit the ground before recovery. The wind during the 1601 weather observation was 020° at 5 kts. Runway centerlines were 700 feet apart, threshold of runway 06L was 4,600 feet byd the threshold of runway 06R. The approach control did not advise either flight of the other's position, nor did the tower controller give a w/t advisory to flight 304. Calculations showed vortices could have drifted from runway 06L to runway 06R in as little as 28 seconds. FAA handbook addressed w/t advisory for parallel runway options with less than 2,500 feet separation, but did not address offset thresholds. All five occupants were injured. ", "probable_cause": "Occurrence #1: vortex turbulence encountered\r\nPhase of operation: approach - vfr pattern - final approach\r\nFindings\r\n1. (f) light condition - dusk\r\n2. (f) atc clearance - improper - atc personnel (dep/apch)\r\n3. (f) unsafe/hazardous condition warning - not issued - atc personnel (lcl/gnd/clnc)\r\n4. Condition(s)/step(s) insufficiently defined - faa (other/organization)\r\n5. (c) in-flight planning/decision - improper - pilot in command\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: approach - vfr pattern - final approach"}