{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-20dc-cartersville-2-killed", "date": "Jun 29, 1989 at 0004 LT", "type": "Dassault Falcon 20", "operator": "Phoenix%20Air_0", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cartersville - Montgomery", "msn": "208", "yom": 1970, "flight_number": "PHX125", "city": "Cartersville", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7940, "captain_hours_type": 770, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13547, "circumstances": "The crew arrived at the airport about 20 minutes before the planned midnight takeoff time, after the pilot-in-command had spent the day moving furniture. A night watchman noted that the preflight inspection and takeoff roll to rotation/lift-off was normal. There was no post-takeoff radio call to either unicom or ATC, although the crew had filed an IFR flight plan. After taking off from runway 36, the aircraft crashed about 1.8 mile north of the runway. The wreckage was found after interruption of electrical power to a nearby city. Initial impact was with trees, while in a shallow/left/descending turn. An area of trees about 1/2 mile long was damaged by impact and fire. Before coming to rest, the aircraft hit a powerline support tower. There was evidence the aircraft was traveling at about 260 knots, when it crashed. No preimpact part failure or malfunction was found that would have resulted in the accident. Both pilots were killed. ", "probable_cause": "Failure of the pilot-in-command (pic) to assure that the aircraft maintained a climb profile after takeoff. Factors related to the accident were: dark night, the crew's lack of visual perception at night, the pic's lack of rest (fatigue), and the copilot's failure to attain remedial action."}