{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-los-angeles-12-killed", "date": "Feb 1, 1991 at 1807 LT", "type": "Swearingen SA227 Metro III", "operator": "Skywest-Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Los Angeles - Palmdale", "msn": "AC-683", "yom": 1987, "flight_number": "OO5569", "city": "Los Angeles", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 8808, "captain_hours_type": 2107, "copilot_hours": 8000, "copilot_hours_type": 1363, "aircraft_hours": null, "circumstances": "SKW5569, N683AV, had been cleared to runway 24L, at intersection 45, to position and hold. The local controller, because of her preoccupation with another airplane, forgot she had placed SKW5569 on the runway and subsequently cleared US1493, N388US, for landing. After the collision, the two airplanes slid off the runway into an unoccupied fire station. The tower operating procedures did not require flight progress strips to be processed through the local ground control position. Because this strip was not present, the local controller misidentified an airplane and issued a landing clearance. The technical appraisal program for air traffic controllers is not being fully utilized because of a lack of understanding by supervisors and the unavailability of appraisal histories.", "probable_cause": "The failure of the los angeles air traffic facility management to implement procedures that provided redundancy comparable to the requirements contained in the national operational position standards and the failure of the faa air traffic service to provide adequate policy direction and oversight to its air traffic control facility managers. These failures created an environment in the Los Angeles air traffic control tower that ultimately led to the failure of the local controller 2 (lc2) to maintain an awareness of the traffic situation, culminating in the inappropriate clearances and the subsequent collision of the usair and skywest aircraft. Contributing to the cause of the accident was the failure of the faa to provide effective quality assurance of the atc system."}