{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54g-1-do-skymaster-sargasso-sea-6-killed", "date": "Jul 3, 1947", "type": "Douglas C-54 Skymaster", "operator": "USAAF", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Hamilton - Morrison", "msn": "35972", "yom": 1945, "flight_number": null, "city": "Sargasso Sea", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine aircraft left Hamilton, Bermuda, bound for Morrison AFB located in Palm Beach, Florida. While cruising about 294 miles northeast of the Florida coast, the crew encountered severe weather conditions with thunderstorm activity and turbulence. The aircraft went out of control and crashed into the sea. Some debris were found but no trace of the six occupants that were considered as deceased. ", "probable_cause": "After considering all available facts and existing weather conditions, it is the opinion of the Accident Investigating Board at Morrison Field, Florida, that the aircraft encountered violent turbulence and the pilot lost control of the aircraft. It is possible that structural failure was a factor prior to contact with the ocean. No evidence of fire exists. There was no evidence of a ditching attempt and the debris found indicates that the crew compartment was torn apart on contact with the ocean. The last plotted position of the aircraft and the corresponding position of the frontal zone substantiates the weather assumption. Contributing factors to this accident were possible navigational error allowing aircraft to drift north of course to frontal zone and pilot error in that no apparent effort was made to circumnavigate the frontal weather."}