{"url": "https://www.baaa-acro.com/crash/crash-junkers-ju523m-roure-10-killed", "date": "Feb 24, 1939 at 0745 LT", "type": "Junkers JU.52", "operator": "RLM", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Palma de Majorca – Barcelona – Genoa – Rome – Berlin", "msn": "5210", "yom": 1937, "flight_number": null, "city": "Nice", "zone": "Alpes-Maritimes", "country": "France", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on its way from Palma to Berlin with intermediate stops in Barcelona, Genoa and Rome. Among the passengers were German and Italian citizens. While cruising north of Nice, the crew encountered poor weather conditions with fog, snow falls and low clouds. The crew tried several times to contact the radio station in Genoa without success, and was unable to fix his real position. While cruising at a height of 700 metres, the three engine aircraft impacted three larches, lost its undercarriage, stalled and crashed in a snow covered terrain located between the villages of Roure and Saint Sauveur, in the Mercantour National Park, bursting into flames. SAR operations were initiated but the first rescuers, soldiers from the French 141st Alpine Infantry Regiment, arrived on scene in the morning of March 4, 1939. The aircraft was found partially destroyed by fire and all 10 occupants were killed.\r\nCrew:\r\nLothar Lessman, pilot,\r\nHermann Grünewald, copilot, \r\nWilly Wohlecke, mechanic. \r\nPassengers:\r\nWalter Uhl,\r\nErich Regenhardt, \r\nPaul Timmier, \r\nOscar Berti, \r\nWillem Bodden, \r\nWerner Kubenik, \r\nMichael Hagel.", "probable_cause": "French commission concluded the accident was due to a navigation error on part of the crew. This was caused by the poor weather conditions and low visibility in the region at the time of the accident. In such conditions, crew was unable to maintain visual contact with the ground. Also, a failure of the navigation instrument may have contributed to the accident. It was concluded the aircraft was not performing any spy or reconnaissance mission, but only a liaison flight between Spain, Italy and Germany."}