{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-700-near-mt-elmo-5-killed", "date": "Nov 28, 1995 at 1946 LT", "type": "Rockwell Aero Commander 700 (Fuji FA-300)", "operator": "John C. Hessel", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Mountains", "schedule": "Calgary - Hillsboro", "msn": "700-020", "yom": 1978, "flight_number": null, "city": "Mt Elmo", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 3000, "captain_hours_type": 100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At about 1826 mountain standard time (MST), the aircraft, with the pilot and four passengers on board, departed the Calgary International Airport, Alberta, on a night instrument flight rules (IFR) flight to Hillsboro, Oregon, USA. At about 1946 the aircraft disappeared from the Vancouver Area Control Centre (ACC) radar screen in the vicinity of Castlegar, British Columbia. The Victoria Rescue Coordination Centre (RCC) was notified, and search aircraft were dispatched. Despite bi-national search cooperation and radar fixes of the aircraft's last known position (LKP), a seven-day search failed to locate the missing aircraft. An emergency locator transmitter (ELT) signal was not received. On 14 June 1996, the wreckage was located at latitude 49°14'48\"N, longitude 117°03'20\"W, at an elevation of approximately 6,700 feet above sea level (asl). The aircraft was destroyed by impact forces and a post-crash fire. The pilot and four passengers were fatally injured.", "probable_cause": "It could not be determined why the aircraft departed cruise flight and began a rapid descent from which the pilot did not recover. It was determined, however, that the pilot attempted flight through an area where the probability of severe clear icing, in freezing drizzle, was predicted by the area forecast.\n"}