{"url": "https://www.baaa-acro.com/crash/crash-bristol-142-blenheim-iv-raf-manston-2-killed", "date": "Aug 7, 1941 at 1755 LT", "type": "Bristol 142 Blenheim", "operator": "Royal-Air-Force-4", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Manston - Manston", "msn": null, "yom": null, "flight_number": null, "city": "Manston", "zone": "Kent", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was engaged in a local test flight out from RAF Manston on this aircraft that have been repaired. Upon takeoff from a grassy runway, it appears that the airplane became airborne sooner than normal due to a bump in the surface of the airfield. Shortly after liftoff, it entered a right turn then stalled and crashed. Two crew members were killed and a third was injured. \r\nCrew:\r\nP/O Harold Andrew Thomas Lind, pilot, \r\nSgt Norman William Paples, observer, \r\nSgt Eric Douglas Kennedy, wireless operator. ", "probable_cause": "The report, which fails to list details of the crew, carries on to describe the accident which befell the Blenheim. It appears that it became airborne sooner than normal due to a bump in the surface of the airfield ( Manston was, of course, a grass airfield in those days) and, almost immediately, it commenced a right-hand turn at a low speed, and the undercarriage was lowered as if the pilot was attempting to land again. Unfortunately the Blenheim stalled and crashed. Examination of the wreckage at the scene of the accident showed that the main controls were in order, but after removal of the aircraft for more detailed examination it was found that the starboard elevator was jammed 'solid' in the neutral position. Unbroken dope showed that this tab had not moved from the neutral position in which it had been left after the inspection on 26.7.41. The port tab was fully down in the tail heavy position but this was considered to be due to impact. All three hinges on the starboard tab were rusted tightly on the sleeves which form the bearing journals and which are pinned on to the elevator framework tubing. In the centre bearing which is nearest to the tab actuating lever the bearing journal locating rivet had sheared, possibly during an effort to alter the tab settings. There was no sign of lubrication on any of the hinges. The report concludes by running through the likely sequence of events that lead to the accident, beginning with the Blenheim being left outside for so long, which allowed the parts to rust solid, continuing with the suggestion that the pilot had relied on the tab position indicator being in neutral and hadn't tested the circuit, and ending with his decision to land so that the trim problems could be investigated. The ultimate cause of the crash was, of course, the low-speed stall."}