{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-fort-wayne-1-killed", "date": "Nov 9, 2000 at 0123 LT", "type": "Swearingen SA226 Metro II", "operator": "Superior%20Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Wayne – Milwaukee", "msn": "TC-255", "yom": 1978, "flight_number": null, "city": "Fort Wayne", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2870, "captain_hours_type": 75, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 20885, "circumstances": "The airplane was destroyed on impact with trees and terrain after takeoff. A post-impact fire ensued. A courier stated that he put 14 cases and 5 bags into the airplane and that \"everything took place as it normally does.\" A witness stated, \"I heard a very low flying aircraft come directly over my house. ... It sounded very revved up like a chainsaw cutting through a tree at high speed.\" The accident airplane's radar returns, as depicted on a chart, exhibited a horseshoe shaped flight path. That chart showed that the airplane made a left climbing turn to a maximum altitude of 2,479 feet. That chart showed the airplane in a descending left turn after that maximum recorded altitude was attained. The operator reported the pilot had flown about 75 hours in the same make and model airplane and had flown about 190 hours in the last 90 days. The weather was: Wind 090 degrees at 7 knots; visibility 1 statute mile; present weather light rain, mist; sky condition overcast 200 feet; temperature 9 degrees C; dew point 9 degrees C. No pre-impact engine anomalies were found. NTSB's Materials Laboratory Division examined the annunciator panel and recovered light assemblies and stated, \"Item '29' was a light assembly with an identification cover indicating that it was the '[Right-hand] AC BUS' light. Examination of the filaments in the two installed bulbs revealed that one had been stretched, deformed and fractured and the other had been stretched and deformed.\" The airplane manufacturer stated that the airplane's left-hand and right-hand attitude gyros are powered by the 115-volt alternating current essential bus. Two inverters are installed and one inverter is used at a time as selected by the inverter select switch. The inverter select switch is located on the right hand switch panel. The airplane was not equipped with a backup attitude gyro and was not required to be equipped with one. The airplane was certified with a minimum flight crew of one pilot. Subsequent to the accident, the operator transitioned \"from the single pilot operation of our Fairchild Metroliner to the inclusion of a First Officer.\"", "probable_cause": "The indicated failure of the right hand AC bus during takeoff with low ceiling. The factors were the low ceiling, night, and the excessive workload the pilot experienced on takeoff with an electrical failure without a second in command."}