{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-juiz-de-fora-8-killed", "date": "Jul 28, 2012 at 0745 LT", "type": "Beechcraft 200 Super King Air", "operator": "Vilma-Alimentos", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Belo Horizonte - Juiz de Fora", "msn": "BY-51", "yom": 2009, "flight_number": null, "city": "Juiz de Fora", "zone": "Minas Gerais", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 14170, "captain_hours_type": 2170, "copilot_hours": 730, "copilot_hours_type": 415, "aircraft_hours": 385, "circumstances": "The twin engine aircraft departed Belo Horizonte-Pampulha Airport at 0700LT on a flight to Juiz de Fora, carrying six passengers and two pilots. In contact with Juiz de Fora Radio, the crew learned that the weather conditions at the aerodrome were below the IFR minima due to mist, and decided to maintain the route towards the destination and perform a non-precision RNAV (GNSS) IFR approach for landing on runway 03. During the final approach, the aircraft collided first with obstacles and then with the ground, at a distance of 245 meters from the runway 03 threshold, and exploded on impact. The aircraft was totally destroyed and all 8 occupants were killed, among them both President and Vice-President of the Vilmas Alimentos Group. ", "probable_cause": "The following factors were identified:\r\n- The pilot may have displayed a complacent attitude, both in relation to the operation of the aircraft in general and to the need to accommodate his employers’ demands for arriving in SBJF. It is also possible to infer a posture of excessive self-confidence and confidence in the aircraft, in spite of the elements which signaled the risks inherent to the situation. \r\n- It is possible that the different levels of experience of the two pilots, as well as the copilot’s personal features (besides being timid, he showed an excessive respect for the captain), may have resulted in a failure of communication between the crewmembers.\r\n- It is possible that the captain’s leadership style and the copilot’s personal features resulted in lack of assertive attitudes on the part of the crew, hindering the exchange of adequate information, generating a faulty perception in relation to all the important elements of the environment, even with the aircraft alerts functioning in a perfect manner.\r\n- The meteorological conditions in SBJF were below the minima for IFR operations on account of mist, with a ceiling at 100ft.\r\n- The crew did not inform Juiz de Fora Radio about their passage of the MDA and, even without visual contact with the runway, deliberately continued in their descent, not complying with the prescriptions of the items 10.4 and 15.4 of the ICA 100-12 (Rules of the Air and Air Traffic Services).\r\n- The crew judged that it would be possible to continue descending after the MDA, even without having the runway in sight."}