{"url": "https://www.baaa-acro.com/crash/crash-cessna-421a-golden-eagle-i-deland-3-killed", "date": "Sep 29, 2019 at 1600 LT", "type": "Cessna 421A Golden Eagle I", "operator": "Martin Flores", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "DeLand - DeLand", "msn": "421A-0164", "yom": 1968, "flight_number": null, "city": "DeLand", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 500, "captain_hours_type": 0, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 858, "circumstances": "The owner of the airplane had purchased the airplane with the intent to resell it after repairs had been made. As part of that process, a mechanic hired by the owner had assessed the airplane’s condition, proposed the necessary repairs to the airplane’s owner, and had identified a pilot who would, once the repairs and required inspection annual inspection had been completed, fly the airplane from where it was located to where the owner resided. While the mechanic had identified a potential pilot for the relocation flight, he had not yet completed the repairs to the airplane, nor had he completed the necessary logbook entries that would have returned the airplane to service. The pilot-rated passenger onboard the airplane for the accident flight, was the pilot who had been identified by the mechanic for the relocation flight. Review of the pilot-rated passenger’s flight experience revealed that he did not possess the necessary pilot certificate rating, nor did he have the flight experience necessary to act as pilot-in-command of the complex, highperformance, pressurized, multi-engine airplane. Additionally, the owner of the airplane had not given the pilot-rated-passenger, or anyone else, permission to fly the airplane. The reason for, and the circumstances under which the pilot-rated passenger and the commercial pilot (who did hold a multi-engine rating) were flying the airplane on the accident flight could not be definitively determined, although because another passenger was onboard the airplane, it is most likely that the accident flight was personal in nature. Given the commercial pilot’s previous flight experience, it is also likely that he was acting as pilot-in-command for the flight. One witness said that he heard the airplane’s engines backfiring as it flew overhead, while another witness located about 1 mile from the accident site heard the accident airplane flying overhead. The second witness said that both engines were running, but they seemed to be running at idle and that the flaps and landing gear were retracted. The witness saw the airplane roll to the left three times before descending below the tree line. As the airplane descended toward the ground, the witness heard the engines make “two pop” sounds. The airplane impacted a wooded area about 4 miles from the departure airport, and the wreckage path through the trees was only about 75-feet long. While the witnesses described the airplane’s engines backfiring or popping before the accident, the postaccident examination of the wreckage revealed no evidence of any preimpact mechanical malfunctions or failures that would have precluded normal operation. Additionally, examination of both propeller blades showed evidence of low rotational energy at impact, and that neither propeller had been feathered in flight. Given the witness statement describing the airplane “rolling three times” before it descended from view toward the ground, it is most likely that the pilot lost control of the airplane and while maneuvering. It is also likely that the pilot’s lack of any documented previous training or flight experience in the accident airplane make and model contributed to his inability to maintain control of the airplane. Toxicology testing was performed on the pilot’s chest cavity blood. The results identified 6.7 ng/ml of delta-9-tetrahydracannabinol (THC, the active compound in marijuana) as well as 2.6 ng/ml of its active metabolite, 11-hydroxy-THC and 41.3 ng/ml of its inactive metabolite delta9-carboxy-THC. Because the measured THC levels were from cavity blood, it was not possible to determine when the pilot last used marijuana or whether he was impaired by it at the time of the flight. As a result, it could not be determined whether effects from the pilot’s use of marijuana contributed to the accident circumstances.", "probable_cause": "The pilot’s failure to maintain control of the airplane, which resulted in a collision with terrain. Contributing was the pilot’s lack of training and experience in the accident airplane make and model."}