{"url": "https://www.baaa-acro.com/crash/crash-saab-2000-paris-roissy-cdg", "date": "Jan 28, 2014 at 0731 LT", "type": "Saab 2000", "operator": "Etihad-Regional", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Leipzig – Paris", "msn": "010", "yom": 1994, "flight_number": "DWT250", "city": "Paris-Roissy-CDG", "zone": "Val-d'Oise", "country": "France", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 16, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6640, "captain_hours_type": 2260, "copilot_hours": 630, "copilot_hours_type": 80, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Leipzig, the crew  started the descent to Paris-Roissy-CDG Airport runway 27R. At an altitude of 400 feet on approach, the automatic pilot system was deactivated. At an altitude of 200 feet, the decision height, the crew decided to continue the approach as the runway was in sight and the aircraft was stable. During the last segment, at a height of 50 feet, power levers were reduced to flight idle and the aircraft went into a nose up attitude (maximum value of 11°). Both main gears touched down at a speed of 120 knots but the aircraft bounced twice and went into a pitch down attitude, causing the nose gear to land first during the third touchdown. On impact, the nose gear collapsed and the aircraft slid for dozen yards before coming to rest. All 19 occupants were evacuated safely and the aircraft was later considered as damaged beyond repair.", "probable_cause": "During the flare the captain detected that the landing would be hard and in an emergency action, he quickly pulled the nose up without announcing his intention to the first officer who was the pilot flying. This lack of coordination within the flight crew caused a double controls and successive and opposite actions on the flight controls during the bouncing management. "}