{"url": "https://www.baaa-acro.com/crash/crash-cessna-t207a-turbo-stationair-8-nightmute", "date": "Sep 2, 2011 at 1335 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Ryan%20Air_0.png", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Tununak - Bethel", "msn": "207-0629", "yom": 1981, "flight_number": null, "city": "Nightmute", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1670, "captain_hours_type": 216, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 19562, "circumstances": "On September 2, 2011, about 1335 Alaska daylight time, a Cessna 208B airplane, N207DR, and a Cessna 207 airplane, N73789, collided in midair about 9 miles north of Nightmute, Alaska. Both airplanes were being operated as charter flights under the provisions of 14 Code of Federal Regulations (CFR) Part 135 in visual meteorological conditions when the accident occurred. The Cessna 208B was operated by Grant Aviation Inc., Anchorage, Alaska, and the Cessna 207 was operated by Ryan Air, Anchorage, Alaska. Visual flight rules (VFR) company flight following procedures were in effect for each flight. The sole occupant of the Cessna 208B, an airline transport pilot, sustained fatal injuries. The sole occupant of the Cessna 207, a commercial pilot, was uninjured. The Cessna 208B was destroyed, and the Cessna 207 sustained substantial damage. After the collision, the Cessna 208B descended uncontrolled and impacted tundra-covered terrain, and a postcrash fire consumed most of the wreckage. The Cessna 207’s right wing was damaged during the collision and the subsequent forced landing on tundra-covered terrain. Both airplanes were based at the Bethel Airport, Bethel, Alaska, and were returning to Bethel at the time of the collision. The Cessna 208B departed from the Toksook Bay Airport, Toksook Bay, Alaska, about 1325, and the Cessna 207 departed from the Tununak Airport, Tununak, Alaska. During separate telephone conversations with the National Transportation Safety Board (NTSB) investigator-in-charge on September 2, the chief pilot for Ryan Air, as well as the director of operations for Grant Aviation, independently reported that both pilots had a close personal relationship. During an initial interview with the NTSB IIC on September 3, in Bethel, the pilot of the Cessna 207 reported that both airplanes departed from the neighboring Alaskan villages about the same time and that both airplanes were en route to Bethel along similar flight routes. She said that, just after takeoff from Tununak, she talked with the pilot of the Cessna 208B on a prearranged, discreet radio frequency, and the two agreed to meet up in-flight for the flight back to Bethel. She said that, while her airplane was in level cruise flight at 1,200 feet above mean sea level (msl), the pilot of the Cessna 208B flew his airplane along the left side of her airplane, and they continued to talk via radio. She said that the pilot of the Cessna 208B then unexpectedly and unannounced climbed his airplane above and over the top of her airplane. She said that she immediately told the pilot of the Cessna 208B that she could not see him and that she was concerned about where he was. She said that the Cessna 208B pilot then said, in part: \"Whatever you do, don't pitch up.\" The next thing she recalled was moments later seeing the wings and cockpit of the descending Cessna 208B pass by the right the side of her airplane, which was instantaneously followed by an impact with her airplane’s right wing. The Cessna 207 pilot reported that, after the impact, while she struggled to maintain control of her airplane, she saw the Cessna 208B pass underneath her airplane from right-to-left, and it began a gradual descent, which steepened as the airplane continued to the left and away from her airplane. She said that she told the pilot of the Cessna 208B that she thought she was going to crash.She said that the pilot of the Cessna 208B simply stated, “Me too.” She said that she watched as the Cessna 208B continued to descend, and then it entered a steep, vertical, nose-down descent before it collided with the tundra-covered terrain below. She said that a postcrash fire started instantaneously upon impact. Unable to maintain level cruise flight and with limited roll control, the Cessna 207 pilot selected an area of rolling, tundra-covered terrain as a forced landing site. During touchdown, the airplane’s nosewheel collapsed, and the airplane nosed down. The Cessna 207’s forced landing site was about 2 miles east of the Cessna 208B’s accident site. ", "probable_cause": null}