{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-90-dl-detroit-3-killed", "date": "Nov 19, 1949 at 1011 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Meteor-Air-Transport", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Teterboro – Dunkirk – Detroit", "msn": "20136", "yom": 1944, "flight_number": "VV959", "city": "Detroit-City (Coleman A. Young)", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 1, "total_fatalities": 3, "captain_hours": 1957, "captain_hours_type": 1500, "copilot_hours": 1589, "copilot_hours_type": null, "aircraft_hours": 3416, "circumstances": "Due to snow conditions the flight was delayed at Dunkirk for several hours. During this time the crew obtained weather information and had the aircraft serviced with 230 gallons of fuel. Two known attempts to take off from Dunkirk were made, at 0215, and at 0405 but these were discontinued after a short take-off run because of the accumulation of snow on the aircraft. This snow had accumulated during the time the aircraft was on the ground. A special weather forecast requested from New York and delivered to the crew at 0355, predicted that between Dunkirk and Detroit ceilings would be 3,000 to 4,000 feet MSL, visibility seven miles or more, and that there would be icing in the clouds. At 0808, Captain Dede filed with Cleveland Air Route Traffic Control an IFR flight plan which described a route to Detroit by way of Clear Creek, Canada, at an altitude of 4,000 feet, with Cleveland, Ohio, being designated as the alternate airport. Twenty-nine minutes later, at 0837, the flight took off from Dunkirk. There was sufficient fuel aboard to fly three hours and 40 minutes, and the computed elapsed time to Detroit was one hour and 50 minutes. At this time the total gross weight of the aircraft was 27,050 pounds which was 150 pounds above the allowable limit. Routine progress reports were mad, by the flight when over Clear Creek and Windsor, Canada, and at 0954, Detroit Air Route Traffic Control cleared the flight to contact Detroit City Airport Approach Control Instructions were given the flight by Approach Control and Runway 25 was designated as the runway in use. The flight was also advised that the visibility, restricted by snow showers and smoke, was one mile, and that the surface wind was 15 miles per hour from the southwest. The Detroit City Airport tower controller first observed the aircraft one mile east southeast of the airport with its landing gear down, flying on an approximate heading of 300 degrees and at an altitude estimated to be 700 feet above the ground. When the flight was almost over the field, it requested permission to make a left circle of the air port before landing. Clearance to do this was granted and again the flight was instructed to land on Runway 25. The flight passed directly over the airport, turned left and then flew on an easterly heading until it was approximately three quarters of a mile east of the approach end of the runway. Here it was seen to make a steep left turn and change direction approximately 180 degrees. Although the aircraft straightened out from this turn, it continued to lose altitude until it struck the chimney of a house in a residential district of Detroit approximately 3,200 feet east of the airport. The aircraft then struck and demolished a second house approximately 45 feet west of the first house. Fire developed which partially destroyed the aircraft. Both pilots and one person on the ground were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the pilot's action in making a steep turn on final approach without at the same time maintaining adequate air speed, causing the aircraft to settle to the ground."}