{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-near-craig-1-killed", "date": "Apr 23, 2020 at 2130 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Tiadaghton Aviation", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": null, "msn": "61-0393-117", "yom": 1977, "flight_number": null, "city": "Craig", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 30, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The student pilot, who was not qualified to operate the airplane, reportedly flew from California to Pennsylvania on a commercial flight the morning of the accident to pick up and fly the accident airplane, which he purchased, to California. The student pilot departed Pennsylvania at 0719 and made several en route stops before arriving at the departure airport at 1949. A witness stated that the airplane’s right engine quit during taxi at the last en route stop and the pilot said he \"cut it a little close on fuel.\" Another witness said that the pilot was “really tired” and planned to fly over the mountains for his return flight. The student pilot was not in communications with air traffic control while en route from the departure airport and did not receive an instrument flight rules clearance to operate the flight in class A airspace as required by Federal Aviation Regulations. The airplane was not equipped with automatic dependent surveillance-broadcast as required for flight in class A airspace. Radar track data indicate the airplane last departed from Fort Collins, Colorado, and maneuvered while climbing to 16,000 ft. The airplane proceeded west/southwest for a little over 40 miles before climbing to about 22,000 ft. The airplane then made several large heading changes and altitude changes between 20,000 ft and 23,000 ft before entering a tight looping turn to the left and losing altitude rapidly before track data was lost. All components of the airplane were distributed along the wreckage path in a manner consistent with a low-angle, high-speed impact with terrain. The airplane was destroyed. A green cylindrical tank consistent in color with an oxygen tank was separated from the airframe and was found along the wreckage path. Portions of pneumatic lines were attached to the tank and exhibited impact damage and separations from impact. Due to accident-related damage, the amount of the tank’s contents prior to the accident are unknown, and the functionality, if any, of the oxygen system is unknown. The reason for the airplane’s impact with terrain could not be determined based on available evidence.", "probable_cause": "The student pilot’s flight into terrain for undetermined reasons."}