{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-beechjet-400a-rome", "date": "Mar 14, 2016 at 1508 LT", "type": "Beechcraft Beechjet 400", "operator": "Flight-Options", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jackson - Rome", "msn": "RK-426", "yom": 2005, "flight_number": null, "city": "Rome-Richard B. Russell", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10393, "captain_hours_type": 6174, "copilot_hours": 6036, "copilot_hours_type": 407, "aircraft_hours": 7061, "circumstances": "The pilots of the business jet were conducting a cross-country positioning flight. According to the pilot flying (PF), the flight was uneventful until the landing. While completing the descent checklist and while passing through 18,000 ft mean sea level (msl), the pilot monitoring (PM), received the automated weather report from the destination airport and briefed the PF that the wind was variable at 6 knots, gusting to 17 knots. The PF then programmed the flight management system for a visual approach to runway 7 and briefed the reference speed (Vref) as 107 knots and the go-around speed as 129 knots based on an airplane weight. The PF further reported that he knew the runway was over 4,400 ft long (the runway was 4,495 ft long) and he thought that the airplane needed about 2,900 ft of runway to safely land. During the left descending turn to the base leg of the traffic pattern, the PF overshot the final approach and had to turn back toward the runway centerline as the airplane was being “pushed by the winds.” About 500 ft above ground level (agl), both pilots acknowledged that the approach was “stabilized” while the airspeed was fluctuating between 112 and 115 knots. About 200 ft agl, both pilots noticed that the airplane was beginning to descend and that the airspeed was starting to decrease. The PF added power to maintain the descent rate and airspeed. The PF stated that, after adding power and during the last 200 ft of the approach, the wind was “gusty,” that a left crosswind existed, that the ground speed seemed “very fast,” and that excessive power was required to maintain airspeed. When the airplane was between about 75 and 100 ft agl, the PF asked the PM for the wind information, and the PM responded that the wind was variable at 6 knots, gusting to 17 knots. Both pilots noted that the ground speed was “very fast” but decided to continue the approach. Neither pilot reported seeing the windsock located off the right side of the runway. Review of weather data recorded by the airport’s automated weather observation system revealed that about 3 minutes before the landing, the wind was from 240° at 16 knots, gusting to 26 knots, which would have resulted in a 3- to 5-knot crosswind and 16- to 26-knot tailwind. Assuming these conditions, the airplane’s landing distance would have been about 4,175 ft per the unfactored landing distance performance chart. Tire skid marks were found beginning about 1,000 feet from the approach end of runway 7. The PF stated that the airplane touched down “abruptly at Vref+5 and he applied the brakes while the PM applied the speed brakes. Neither pilot felt the airplane decelerating, so the PF applied harder pressure to the brakes with no effect and subsequently applied full braking pressure. When it was evident that the airplane was going to depart the end of the runway, the PM applied the emergency brakes, at which point he felt some deceleration; however, the airplane overran the end of the runway and travelled through grass and mud for about 370 feet before stopping. Examination of the airplane revealed that the nose landing gear (NLG) had collapsed, which resulted in the forward fuselage striking the ground and the airframe sustaining substantial damage. Although the pilots reported that they never felt the braking nor antiskid systems working and that they believed that they should have been able to stop the airplane before it departed the runway, postaccident testing of the brake and antiskid systems revealed no evidence of preaccident mechanical malfunctions or failures that would have precluded normal operation, and they functioned as designed. Given the tire skid marks observed on the runway following the accident, as well as the postaccident component examination and testing results, the brakes and antiskid system likely operated nominally during the landing. Based on the available evidence, the pilots failed to recognize performance cues and use available sources of wind information that would have indicated that they were landing in significant tailwind conditions and conduct a go-around. Landing under these conditions significantly increased the amount of runway needed to stop the airplane and resulted in the subsequent runway overrun and the collapse of the NLG.", "probable_cause": "The pilots’ failure to use available sources of wind information before landing and recognize cues indicating the presence of the tailwind and conduct a go-around, which resulted in their landing with a significant tailwind and a subsequent runway overrun. "}