{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-36-marquise-terrace-2-killed", "date": "Dec 20, 2005 at 1834 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Nav%20Air%20Charter", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Terrace – Vancouver", "msn": "672", "yom": 1975, "flight_number": "FCV831", "city": "Terrace", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2111, "captain_hours_type": 655, "copilot_hours": 2000, "copilot_hours_type": 500, "aircraft_hours": null, "circumstances": "At 1834 Pacific standard time, the Nav Air Charter Inc. Mitsubishi MU-2B-36 aircraft (registration C-FTWO, serial number 672) took off from Runway 15 at the Terrace Airport for a courier flight to Vancouver, British Columbia. The left engine lost power shortly after take-off. The aircraft descended, with a slight left bank, into trees and crashed about 1600 feet east of the departure end of Runway 15 on a heading of 072° magnetic. The aircraft was destroyed by the impact and a post-crash fire, and the two pilots were fatally injured. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. During the take-off, the left engine combustion chamber plenum split open due to a fatigue crack. The rupture was so extensive that the engine flamed out. \r\n2. The crew did not feather the left engine or retract the flaps, and the aircraft entered a moderate left-hand turn after take-off; the resulting drag caused the aircraft to descend until it contacted trees.\r\n3. The first officer’s flying skills may have been challenged during the handling of the engine failure, and the checklist was conducted out of sequence, suggesting that there may have been uncertainty in the cockpit. A contributing factor may have been the captain’s unfamiliarity with handling an emergency from the right seat.\r\n4. The use of flap 20 for take-off, although in accordance with company policy, contributed to the difficulty in handling the aircraft during the emergency. \r\nFindings as to Risk:\r\n1. The TPE331 series engine plenum is prone to developing cracks at bosses, particularly in areas where two bosses are in close proximity and a reinforcing weld has been made. Cracks that develop in this area cannot necessarily be detected by visual inspections or even by fluorescent dye-penetrant inspections (FPIs).\r\n2. Because the wing was wet and the air temperature was at 0°C, it is possible that ice may have formed on top of the wing during the take-off, degrading the wing’s ability to generate lift. \r\n3. Being required to conduct only flap 20 take-offs increases the risk of an accident in the event of an engine problem immediately after take-off.\r\nOther Finding:\r\n1. The plenum manufactured with a single machined casting, incorporating the P3 and bleed air bosses, is an improvement over the non-single casting boss plenum; however, cracks may still develop at bosses elsewhere on the plenum. "}