{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-277-lagos", "date": "Sep 7, 2006 at 1305 LT", "type": "Boeing 727-200", "operator": "DHL", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Abidjan - Accra - Lagos", "msn": "22644/1768", "yom": 1981, "flight_number": "DHL110", "city": "Lagos-Murtala Muhammed", "zone": "Lagos", "country": "Nigeria", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17295, "captain_hours_type": 7820, "copilot_hours": 2972, "copilot_hours_type": 2422, "aircraft_hours": 52728, "circumstances": "On the day of the accident, Flight DV110 routing was Abidjan – Accra - Lagos. It departed Abidjan at 1015 hrs for Lagos via Accra. The aircraft finally departed Accra for Lagos at 1145 hrs with a total declared cargo weight of 50014 lbs (22733 kgs). The aircraft contacted Lagos Area Control at 1242 hrs, while maintaining FL 210 (21, 000ft) and was given an in-bound clearance to Lagos VOR (LAG) for ILS approach on runway 18L. At 1252 hrs, Lagos Approach cleared it to FL050 (5,000 feet) and at 12 NM, it was further cleared down to 3500ft on QNH 1013 hpa, and finally to 2,200 feet and to report established on the ILS. At 4 NM to the runway, the aircraft reported fully established on the ILS and was handed over to Control Tower for landing instructions. At 1303 hrs and 2 NM to the runway, the aircraft was cleared to land on runway 18L but to exercise caution, as the runway surface was wet. The cloud was low; the Captain said in his statement that the cloud base was about 100 feet above minimum. Speci weather was also available to the crew. The pilot was advised to exercise caution due to the rain and the weather at that time. In spite of all the warnings the copilot was still allowed to proceed with the landing. At the point of touch down the captain observed that it was impossible to stop on the runway and he called for a go-around. The procedure was not properly executed and thus the aircraft overshot the runway 400m into the grass area. There was no fire outbreak and no injury was sustained by any of the crew members. There was serious damage to the aircraft.", "probable_cause": "Causal Factor:\r\nThe decision of the crew to continue an unstabilised approach despite the prevailing adverse weather condition.\r\nContributory Factors:\r\n- The captain did not take over the control of the flight from the first officer in the known bad weather situation,\r\n- The crew resource management was inadequate."}