{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-600-near-cornelia-5-killed", "date": "Jan 18, 2005 at 1655 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "Aquila Air", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Pretoria – Harrismith", "msn": "60-0041-090", "yom": 1970, "flight_number": null, "city": "Cornelia", "zone": "Free State", "country": "South Africa", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 5929, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 18 January 2005 at approximately 1340Z, the pilot accompanied by 4 passengers, took off on a private flight from FAWB (Wonderboom Aerodrome) to FAHS (Harrismith aerodrome). However, the pilot advised the FAWB ATC (Wonderboom Air Traffic Controller) that the intended destination was Springs via Delmas. Sometime after 1455Z the aircraft impacted the ground at a high descent rate and high forward speed on a heading of 260˚M in a 15˚ nose-down and 30˚ right-wing low attitude, whilst the nose of the aircraft was facing in a direction of 211˚M, near Cornelia. Partly cloudy weather conditions, with isolated thundershowers prevailed at the time of the accident. Although there were no eyewitnesses to the accident, local inhabitants reported a severe storm in the vicinity of the accident site at the estimated time of the accident. The five occupants were fatally injured and the aircraft destroyed on impact.", "probable_cause": "The pilot may have lost control of the aircraft due to adverse weather conditions and entered a spiral whilst descending for landing at Harrismith. According to the official weather report, the most likely weather conditions at the place of the accident were partly cloudy with isolated thundershowers. Although there were no eyewitnesses to the accident, local inhabitants reported a severe storm in the vicinity of the accident site at the estimated time of the accident."}