{"url": "https://www.baaa-acro.com/crash/crash-short-360-marsa-al-burayqah-22-killed", "date": "Jan 13, 2000 at 1238 LT", "type": "Short 360", "operator": "Sirte-Oil-Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Tripoli - Marsa el Brega", "msn": "3763", "yom": 1990, "flight_number": null, "city": "Marsa el Brega", "zone": "Al Wahat (الواحات)", "country": "Libya", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 38, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 22, "captain_hours": 8814, "captain_hours_type": 3840, "copilot_hours": 10422, "copilot_hours_type": 1950, "aircraft_hours": 7138, "circumstances": "The aircraft took off at 0929 utc from Tripoli-Intl Airport with two flight crew, one cabin crew and 38 passengers of which three children and one infant with 3,200 lbs of fuel on board. The aircraft flew on the route Tripoli - Beniwalid - Tilal direct to Marsa Brega. During flight, the crew have noticed fuel imbalance so they did a cross feeding until fuel balanced at 11:17:12 utc. At 11:25:51 utc, the aircraft started to descend from FL070 at 40 nm from Marsa Brega. At 11:36:57 utc, the left engine flamed out and the captain asked his f/o to confirm left engine failure at 11:37:27 utc. The f/o confirmed the left engine failure at 11:37:28 utc. The right engine flamed out at 11:37:39 utc. The captain asked his f/o to inform soc operation at Marsa Brega about the two engines failure and his decision to ditch at 11:37:57 utc. The captain asked his f/o to relight the engine at 11:38:05 utc. The GPWS activated since the aircraft was in an unsafe situation. At 11:38:34 utc, the aircraft ditched in the sea at 30 23.457 N 019 28.953 E. Both pilots and 17 other occupants were rescued while 22 other people including the cabin crew were killed. The aircraft was destroyed. Most of the passengers were employees of the Sirte Oil Company and working at the Marsa Brega Oil Complex. On board were 15 Libyans (among them both pilots), 13 British, two Canadians, three Indians, three Croatians, three Philippines, one Pakistan and one Tunisian, the cabin crew. Operated by the Libyan Sirte Oil Company, the aircraft was owned by Avisto, a Swiss operator. ", "probable_cause": "The following findings were identified: \r\n- The crew was properly certificated and qualified for the flight.\r\n- There was no evidence of factors which would have detracted from the crews physical ability to operate the aircraft,\r\n- The aircraft was properly certificated.\r\n- The certificate of airworthiness has no expiry date according to Swiss regulations and considered to be valid and of transport category.\r\n- The certificate of maintenance was valid.\r\n- The insurance policy certificate was valid.\r\n- The aircraft weight and CofG were within prescribed limits.\r\n- The aircraft flew five sectors on that day before the crash flight.\r\n- The emergency doors were not used except the cockpit emergency hatch.\r\n- Fuel samples analyzed and found up to jet a1 specification.\r\n- The aircraft was not in landing configuration, landing gear up and flaps up.\r\n- The passengers were not informed about the aircraft ditching.\r\n- The tail unit and the aircraft nose has destroyed which led the aircraft to sink in few minutes.\r\n- The aircraft was equipped with a GPWS system.\r\n- The aircraft maintenance schedule was not approved by FOCA.\r\nProbable causes:\r\n- Melting of ice formed at engines intake resulted in ware ingestion and both engine flame out.\r\n- The flight crew failed to operate the engine anti-icing system.\r\n- The flight crew were busy with a discussion not relevant to their flight of the aircraft. "}