{"url": "https://www.baaa-acro.com/crash/crash-yakovlev-yak-42-near-katerini-70-killed", "date": "Dec 17, 1997 at 2112 LT", "type": "Yakovlev Yak-42", "operator": "Aerosweet%20Airlines.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Lvov - Odessa - Thessaloniki", "msn": "26 06 164", "yom": 1986, "flight_number": "AEW241", "city": "Katerini", "zone": "Central Macedonia / Κεντρική Μακεδονία", "country": "Greece", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 62, "pax_fatalities": 62, "other_fatalities": 0, "total_fatalities": 70, "captain_hours": 9850, "captain_hours_type": 2300, "copilot_hours": 16210, "copilot_hours_type": 5350, "aircraft_hours": 12008, "circumstances": "AeroSvit Airlines Flight 241 was a scheduled service from Kiev, Ukraine to Thessaloniki, Greece with an en route stop at Odessa, Ukraine. The first leg of the flight was operated by a Boeing 737. Because of engine problems, an aircraft change had to be made at Odessa. The last leg of the flight was carried out using a Yakovlev 42 (UR-42334), which was being chartered from Lvovskie Avialinii. The flight crew had no previous experience in flying to Thessaloniki. The flight was dispatched from Odessa with the No 1 VHF/NAV receiver inoperative, which was contrary to the minimum equipment list (MEL), and took off at 17:23 hours UTC. The weather conditions at Thessaloniki Airport were above required approach and landing minima, however, darkness and an overcast cloud layer obscured awareness of mountainous terrain in the area. The flight was instructed by the approach controller to conduct the LAMBI1F standard arrival procedure and was cleared to execute a VOR-DME-ILS approach to runway 16. The aircraft did not follow the \"19 DME arc\" as required by the approach procedure, but proceeded directly to the THS NDB. It overshot the localizer course at least twice and the flight crew were unable to establish a stabilized approach. According to the CVR cockpit conversations, the flight crew was confused and uncertain with respect to the navigation aids and the information that was presented. During the approach there were no standard callouts made by the flight crew related to the glide slope, outer marker or minima. At 18:54 UTC the Thessaloniki Tower controller reported that they had passed the airport. The flight crew was unaware that they overflew the runway until they were informed by the controller. The flight crew then initiated a go-around but did not follow the published missed approach procedure, nor did they follow the instructions given by the ATC. Although instructed by ATC to proceed to, and enter the south holding pattern, the flight continued on a flight path to the west. The flight crew remained confused, disorganized, and disoriented during the missed approach and the subsequent clearances issued by ATC. They had lost situational and terrain awareness, and they were uncertain with respect to the radio navigation aids and the information that was presented. They also requested \"route vectors\" and \"heading\" twice although Thessaloniki Airport was a non-radar facility. The flight crew occasionally was confused in reading and reporting the correct distances on their DME equipment (miles to kilometers and vice versa) as their instruments displayed distances in kilometers. The flight crew in their effort to solve the navigational problem, often switched their focus from VOR/DME information to ADF, and vice versa. This, in conjunction with the VHF/NAV receiver malfunction, contributed greatly to the confusion in the cockpit and to the loss of orientation. At 19:12 UTC the GPWS sounded for 4 seconds. At the same time the approach controller radioed: \"AEW number one, continue VOR-DME/ILS approach minima, continue and report approaching the outer marker\". The crew replied: \"Outer marker will be report`. After a while the approach controller asked: \"AEW-241, do you have the field in sight?\". At that time the GPWS sounded again. Shortly afterwards the aircraft impacted the side of Mount Pente Pigadia at 3300 feet. The wreckage was found at 10:30 hours, December 20. At the same date a Greek Air Force Lockheed Hercules, which was being used in the search, crashed, killing all 5 on board. On October 6, 2000 a trial began with two air traffic controllers being accused of many counts of manslaughter and of violating the transportation regulations. They were sentenced to five years imprisonment. In December 2002 a Thessaloniki appeals court reduced the sentences of two air traffic controllers to four years and four months each.", "probable_cause": "Causes:\r\n1. The failure of the flight crew to adequately plan and execute the approach and missed approach procedure for runway 16 at Makedonia airport.\r\n2. The failure of the flight crew to properly utilize the Makedonia airport radio navigational aids and aircraft radio equipment / instruments and to interpret the information that was presented.\r\n3. The failure of the flight crew to declare an emergency when they lost their orientation following the missed approach, despite numerous cues alerting them for the aforementioned situation.\r\n4. The captain's failure to achieve maximum performance climb in response to the GPWS alarm signal, 30\" prior to impact.\r\n5. The lack of command presence, cockpit discipline and resource management which resulted in a disorganized, confused and ultimately dysfunctional flight crew.\r\n6. The company's inadequate oversight, over their flight operations, that allowed for and resulted in scheduling one inadequately prepared and marginally qualified flight crew and an aircraft which did not comply with national and international airworthiness regulations (it had not been issued the Type Certificate with the corresponding Amendment for the international flights), to execute a regular passenger flight with No 1 VHF/NAV receiver inoperative.\r\nContributing Factors:\r\n1. The inadequate training provided to the flight crew for cockpit resource management and international flight operations.\r\n2. The dispatch of the aircraft with No 1 VHF/NAV receiver, inoperative, despite the restrictions provided in M.E.L. (Appendix 28, pages 14, 16).\r\n3. The assignment of a marginally qualified instructor pilot to this specific flight who disrupted and substantially reduced the coordination and effectiveness of the flight crew.\r\n4. The inaccurate display of the symbol (R) on the Jeppesen Sanderson Inc. chart 11-1, for runway 16, from which the flight crew, most probably, have formed the wrong impression that radar service was available in Makedonia airport.\r\n5. The insufficient evaluation by the Approach Control, under the aforementioned circumstances, of the difficulties encountered by the flight crew in following procedures and clearances, which prevented the Controllers to offer any available assistance, by their own initiative, in order to prevent, probably, the accident."}