{"url": "https://www.baaa-acro.com/crash/crash-convair-c-131e-samaritan-saint-johns-4-killed", "date": "Feb 5, 1996 at 0950 LT", "type": "Convair C-131 Samaritan", "operator": "Business Air Connection", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Saint Johns – Brownsville – Chetumal", "msn": "338", "yom": 1956, "flight_number": null, "city": "Saint Johns-Industrial", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 18400, "captain_hours_type": 8, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 18715, "circumstances": "Witnesses observed the aircraft departing from runway 14 with a rolling start. They said the aircraft rotated at the departure end of the runway and remained in ground effect with an excessive, nose high attitude. It then struck the airport perimeter fence, a barrier wall, and power lines. Power line wires were dragged through a residential area, resulting in additional damage. The airplane then crashed in a pasture and burned. Investigation revealed the airplane had been loaded to a gross weight (GW) of 50,870 lbs. Its maximum GW was limited to 48,000 lbs at sea level with the use of antidetonation injection (ADI) fluid and 40,900 lbs without ADI. Density altitude at the airport was 6200 feet. For conditions at the airport, maximum GW for takeoff with ADI and 15° of flaps was 43,205 lbs; without ADI and with 13 degrees of flaps, maximum GW was 38,909 lbs. The airplane flaps were found in the retracted position, but there was no performance data for takeoff with the flaps retracted. No ADI fluid was found in the line to the right engine, although it was intact; the ADI tank was destroyed; the ADI line to the left engine was damaged. The airplane was being flown under provision of a ferry permit, which did not provide for the cargo or the two passengers that were aboard. The first pilot (PIC) had accrued about 8 hours of flight experience in the make and model of airplane. ", "probable_cause": "Inadequate preflight planning and preparation by the first pilot (PIC), his failure to ensure the aircraft was properly loaded within limitations, his failure to use proper flaps for takeoff, his failure to use ADI assisted takeoff, and his resultant failure to attain sufficient airspeed to climb after takeoff. Factors relating to the accident were: the high density altitude, and the PIC's lack of experience in the make and model of airplane. "}