{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-grand-lac-germain-1-killed", "date": "Apr 1, 2007 at 0700 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Aeropro", "flight_phase": "Flight", "flight_type": "Ambulance", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Seven Islands - Wabush", "msn": "31-7752123", "yom": 1977, "flight_number": null, "city": "Grand Lac Germain", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5475, "captain_hours_type": 790, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft, operated by Aéropro, was on a visual flight rules (VFR) flight from Sept-Îles, Quebec, to Wabush, Newfoundland and Labrador. The pilot, who was the sole occupant, took off around 0630 eastern daylight time. Shortly before 0700, the aircraft turned off its route and proceeded to Grand lac Germain to fly over the cottage of friends. Around 0700, the aircraft overflew the southeast bay of Grand lac Germain. The pilot then overflew a second time. The aircraft proceeded northeast and disappeared behind the trees. A few seconds later, the twin-engine aircraft crashed on the frozen surface of the lake. The pilot was fatally injured; the aircraft was destroyed by impact forces. ", "probable_cause": "Finding as to Causes and Contributing Factors:\r\n1. The aircraft stalled at an altitude that was too low for the pilot to recover. \r\nFindings as to Risk:\r\n1. The aircraft was flying at an altitude that could lead to a collision with an obstacle and that did not allow time for recovery.\r\n2. The steep right bank of the aircraft considerably increased the aircraft’s stall speed.\r\n3. The form used to record the pilot’s flight time, flight duty time, and rest periods had not been updated for over a month; this did not allow the company manager to monitor the pilot’s hours.\r\n4. At the time of the occurrence, the Aéropro company operations manual did not make provision for the restrictions on daytime VFR flights prescribed in Section 703.27 of the Canadian Aviation Regulations.\r\nOther Findings:\r\n1. The fact that the aircraft was not equipped with a flight data recorder (FDR) or a cockpit voice recorder (CVR) limited the information available for the investigation and limited the scope of the investigation.\r\n2. Since the aircraft was on a medical evacuation (MEDEVAC) flight, the company mistakenly advised the search and rescue centre that there were two pilots on board the aircraft when it was reported missing. "}