{"url": "https://www.baaa-acro.com/crash/crash-cessna-208-caravan-i-near-oksibil-1-killed", "date": "Apr 12, 2017 at 1240 LT", "type": "Cessna 208A Caravan", "operator": "Spirit-Avia-Sentosa1", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Tanah Merah – Oksibil", "msn": "208-0313", "yom": 1999, "flight_number": null, "city": "Oksibil", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4236, "captain_hours_type": 2552, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6226, "circumstances": "On 12 April 2017, a Cessna C208 aircraft registered PK-FSO was being operated by PT. Spirit Avia Sentosa (FlyingSAS) for unscheduled cargo flight. The flights of the day scheduled for the aircraft were Mopah Airport (WAKK) – Tanah Merah Airport (WAKT) – Oksibil Airport (WAJO) – Tanah Merah – Oksibil – Tanah Merah. The estimated time departure of first flight from Mopah Airport to Tanah Merah was 0800 LT and the flight departed at 0848 LT, on board the aircraft were two pilots and seven passengers. The aircraft arrived in Tanah Merah at about 0943 LT. At 1012 LT, the flight departed from Tanah Merah to Oksibil. About 10 Nm from Oksibil the pilot contacted the Oksibil tower controller to get air traffic services and landed at 1044 LT. The flight then departed from Oksibil to Tanah Merah at 1058 LT and arrived about 1126 LT. These flights were single pilot operation. At 1144 LT on daylight condition, the aircraft departed Tanah Merah with intended cruising altitude of 7,000 feet. Prior to departure, there was no report or record of aircraft system malfunction. On board the aircraft was one pilot, 1,225 kg of general cargo and 800 pounds of fuel which was sufficient for about 3 hours of flight time. After departure, the pilot advised Tanah Merah tower controller of the estimate time arrival at Oksibil would be 1224 LT. At 1149 LT, the pilot advised Tanah Merah tower controller that the aircraft position was about 10 Nm from Tanah Merah and passing altitude of 3,500 feet. The Tanah Merah tower controller acknowledged the message and advised the pilot to monitor radio communication on frequency 122.7 MHz for traffic monitoring. At about 29 Nm from Oksibil, the PK-FSO aircraft passed a Cessna 208B aircraft which was flying on opposite direction from Oksibil to Tanah Merah at altitude 6,000 feet. At this time, the aircraft ground speed recorded on the flight following system was about 164 knots. The Cessna 208B pilot advised to the pilot on radio frequency 122.7 MHz that the PK-FSO aircraft was in sight. The pilot responded that the aircraft was maintaining 7,000 feet on direct route to Oksibil. At 1230 LT, the Oksibil tower controller received phone call from the FlyingSAS officer at Jakarta which confirming whether the PK-FSO aircraft has landed on Oksibil. The Oksibil tower controller responded that there was no communication with the PK-FSO pilot. The Oksibil tower controller did not receive the flight plan for the second flight of the PK-FSO flight. Afterwards, the Oksibil tower controller called Tanah Merah tower controller confirming the PK-FSO flight and was informed that PK-FSO departed Tanah Merah to Oksibil at 1144 LT and the reported estimate time of arrival Oksibil was 1224 LT. At 1240 LT, the Oksibil tower controller received another phone call from the FlyingSAS officer at Jakarta which informed that the FlyingSAS flight following system received SOS signal (emergency signal) from PK-FSO aircraft and the last position recorded was on coordinate 04°48’47.7” S; 140°39’31.7” E which located approximately 6 Nm north of Oksibil. Afterwards, the Oksibil air traffic controller advised the occurrence to the Search and Rescue Agency. On 13 April 2017, at 0711 LT, the PK-FSO aircraft was found on ridge of Anem Mountain which located about 7 Nm north of Oksibil. The following figure showed the illustration of the aircraft track plotted on the Google earth refer to the known coordinates of Tanah Merah, Oksibil and the crash site.", "probable_cause": "The possibility of the pilot being fatigue, physical and environment condition increased pilot sleepiness which might have made the pilot inadvertently falling asleep indicated by no pilot activity. The absence of GA-EGPWS aural alert and warning was unable to wake up the pilot."}