{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-580-bradford-11-killed", "date": "Jan 6, 1969 at 2035 LT", "type": "Convair CV-580", "operator": "Allegheny-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Washington DC – Harrisburg – Bradford – Erie – Detroit", "msn": "386", "yom": 1956, "flight_number": "AL737", "city": "Bradford", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 25, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 5761, "captain_hours_type": 499, "copilot_hours": 8220, "copilot_hours_type": 738, "aircraft_hours": 27285, "circumstances": "Allegheny Airlines Flight 737 was a scheduled passenger flight from Washington, DC, to Detroit, MI, with en route stops at Harrisburg, Bradford, and Erie, PA. The flight was uneventful until it arrived in the Bradford area, about 20:22. About 20:23, Erie Approach Control asked flight 737 to report their distance to the airport: \"Allegheny seven thirty seven, what are you showing DME from Bradford?\". Upon which the crew replied, \"Fifteen\". Erie Approach Control then instructed, \"... descend and cruise four thousand via Victor thirty three and cleared for the VOR thirty two (runway 32) approach to the Bradford Airport, report leaving six and Bradford's current weather sky partially obscured, measured ceiling eight hundred overcast, visibility one and one half and light snow showers, wind one seventy degrees at ten (knots) Bradford altimeter twenty nine point four nine.\" At ten miles from the airport Flight 737 asked for clearance to make its instrument approach to runway 14 instead of runway 32. The Bradford FSS Specialist obtained approval for this change from Erie Approach Control and so advised the flight. At 20:31 the flight reported completing the procedure turn inbound. The Convair clipped treetops 4,7nm short of the airport and cut a swath through trees bordering a fairway of the Pine Acres Golf Course. The aircraft came to rest inverted. Both pilots and 9 passengers were killed while 17 other occupants were injured. The aircraft was destroyed. ", "probable_cause": "Investigations were unable to determine precisely the probable cause of this accident. Of some 13 potential causes examined by the Board, three remain after final analysis. They are:\r\n- Misreading of the altimeter by the captain, \r\n- A malfunction of the captain's altimeter after completion of the instrument approach procedure turn, and \r\n- A misreading of the instrument approach chart. Of these three, no single one can be accepted or rejected to the exclusion of another based on the available evidence."}