{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-7cf-san-juan-5-killed", "date": "Dec 31, 1972 at 1923 LT", "type": "Douglas DC-7", "operator": "American Express Leasing", "flight_phase": "Takeoff (climb)", "flight_type": "Humanitarian", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Miami - San Juan - Managua", "msn": "45130", "yom": 1957, "flight_number": null, "city": "San Juan-Luis Muñoz Marín (Isla Verde)", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 12400, "captain_hours_type": 3000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine airplane was engaged in a humanitarian flight from Miami to Managua with an intermediate stop in San Juan, carrying three crew members, two passengers (among them the famous American Baseball player Roberto Clemente aged 38) and various goods for the victims of the recent earthquake in Nicaragua. The crew was cleared to takeoff from runway 08 at 1920LT. After rotation, the crew was instructed to turn to left according to departure procedures. Three minutes after takeoff, while in initial climb by night, the airplane suffered various technical problems, lost height, stalled and crashed into the sea few hundred meters offshore. Some debris were found floating on water and all five occupants were killed. ", "probable_cause": "It was determined that the loss of control was caused by the failure of the engine n°2 and a loss of power on engine n°3. The failure of the engine n°2 was caused by engine structure problems with master and connecting rods, cylinder assembly and piston rings. Investigations also determined that the aircraft was not properly maintained and inspected in accordance with the rules in force. Also, the flight engineer was not qualified for this type of aircraft. The following factors were reported:\r\n- The aircraft was overloaded by 4,193 pounds (1,902 kg),\r\n- Improperly loaded aircraft,\r\n- Powerplant structure, \r\n- Inadequate maintenance and inspection, \r\n- Deficiency in the company maintenance program, violating services regulation, \r\n- Previous damages."}