{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-65-a80-queen-air-near-biloela-1-killed", "date": "Aug 7, 1985 at 0350 LT", "type": "Beechcraft 80 Queen Air", "operator": "Norfolk%20Island%20Airlines", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Brisbane - Rockhampton", "msn": "LD-234", "yom": 1965, "flight_number": null, "city": "Biloela", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "This aircraft had only recently been acquired by the company. It had a fuel system different to other aircraft of the same type in the fleet. On the other aircraft there were three detents for each fuel selector, On, Off, Crossfeed. On this aircraft there were four detents, Off, Outboard, Inboard, Crossfeed. The pilot had not previously flown this aircraft. After a flight time of about 110 minutes the pilot reported that both engines had stopped and he was unable to access fuel from the outboard tanks. When the wreckage was located no evidence of fuel was found in the inboard tanks. The pilot, sole on board, was killed.", "probable_cause": " An inspection of the wreckage did not reveal any fault with the engines or fuel system which may have contributed to the occurrence. It was evident that the engines had stopped when the fuel from the inboard tanks was exhausted. A quantity of fuel remained in the outboard tanks. The day prior to this flight the pilot was briefed on the fuel system of VH-FDR by the company check pilot. The briefing was carried out with the use of the Pilots Operating Manual for the aircraft. Because VH-FDR was not available at the time, the pilot was not able to study the fuel management panel in daylight hours. It is not known if the pilot familiarised himself with the panel before commencing the flight. The aircraft is normally operated with the inboard tanks selected for takeoff. Evidence was obtained from flight documentation found in the wreckage which indicated that the pilot had changed the fuel selections from Inboard, about 30 minutes before he reported that the engines had stopped. However, the exhaustion of the fuel contained in the inboard tanks indicates that the selectors could not have been correctly positioned in the detents for the outboard tanks. Tests carried out found that if the selectors were positioned between the inboard and outboard detents, sufficient fuel, to allow the engines to be operated, would still be drawn from the inboard tanks. The reason the pilot was unable to access fuel from the outboard tanks could not be determined."}