{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-325-navajo-state-college-2-killed", "date": "Jun 16, 2016 at 0830 LT", "type": "Piper PA-31-310 Navajo", "operator": "Aero-National", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Washington County – State College", "msn": "31-8012081", "yom": 1980, "flight_number": null, "city": "State College-University Park", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 12493, "captain_hours_type": 718, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16040, "circumstances": "The commercial pilot was completing an instrument flight rules air taxi flight on a route that he had flown numerous times for the customer on board. Radar and voice communication data revealed that the airplane was vectored to the final approach course for the precision approach and was given a radio frequency change to the destination airport control tower frequency. The tower controller issued a landing clearance, which the pilot acknowledged; there were no further communications with the pilot. Weather conditions at the airport at the time of the accident included an overcast ceiling at 300 ft with 1 mile visibility in mist. The wreckage was located in densely-wooded terrain. Postaccident examination revealed no evidence of any mechanical malfunctions or anomalies that would have precluded normal operation. The wreckage path and evidence of engine power displayed by numerous cut tree branches was consistent with a controlled, wings-level descent with power. A radar performance study revealed that, as the airplane crossed the precision final approach fix 6.7 nautical miles (nm) from the runway threshold, the airplane was 800 ft above the glideslope. At the outer marker, 5.5 nm from the runway threshold, the airplane was 500 ft above the glideslope. When radar contact was lost 3.2 nm from the threshold, the airplane was about 250 ft above the glideslope. Although the airplane remained within the lateral limits of the approach localizer, its last two recorded radar returns would have correlated with a full downward deflection of the glideslope indicator in the cockpit, and therefore, an unstabilized approach. Further interpolation of radar data revealed that, during the last 2 minutes of the accident flight, the airplane's rate of descent increased from 400 ft per minute (fpm) to greater than 1,700 fpm, likely as a result of pilot inputs. During the final minute of the flight, the rate decreased briefly to 1,000 fpm before radar contact was lost. The company's standard operating procedures stated that, if a rate of descent greater than 1,000 fpm was encountered during an instrument approach, a missed approach should be performed. The airplane's relative position to the glideslope and its rapid changes in descent rate after crossing the outer marker suggest that the airplane never met the operator's stabilized approach criteria. Rather than executing a missed approach procedure as outlined in the company's operating procedures, the pilot chose to continue the unstabilized approach, which resulted in a descent into trees and terrain. It is unlikely that the pilot's well-controlled diabetes and effectively treated sleep apnea contributed to the circumstances of this accident. However, whether or not the pilot's multiple sclerosis contributed to this accident could not be determined.", "probable_cause": "The pilot's decision to continue an unstabilized instrument approach in instrument meteorological conditions, which resulted in controlled flight into terrain.\n"}