{"url": "https://www.baaa-acro.com/crash/crash-fairchild-hiller-fh-227b-near-glenn-falls-14-killed", "date": "Nov 19, 1969 at 2020 LT", "type": "Fairchild-Hiller FH-227", "operator": "Mohawk%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Albany – Glenn Falls", "msn": "531", "yom": 1966, "flight_number": "MO411", "city": "Glenn Falls", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 5167, "captain_hours_type": 343, "copilot_hours": 3910, "copilot_hours_type": 67, "aircraft_hours": 7553, "circumstances": "Mohawk Airlines flight 411, while en route to Glenn Falls from Albany, New York, crashed about 2020LT in mountainous terrain approximately 9 nautical miles north of the Warren County Airport, Glenn Falls. The flight had been cleared for a VOR approach to runway 19, since the surface wind was from 150° at 12 knots with gusts to 20 knots. The ceiling at Glenn Falls was given as 2,100 feet overcast, and the visibility was 7 miles in light rain. The flight overflew Glenn Falls at 3,000 feet and proceeded north for about 1 minute and 15 seconds at which time a left turn was initiated preparatory to return to the airport to land on runway 19. During the last portion of this turn, the aircraft contacted trees and the northwest slope of the Pilot Knob Mountain on a heading of about 180°, approximately one nautical mile east of Katsskill Bay, New York. It then impacted the face of a rock cliff, after which it dropped approximately 38 feet, became lodged between trees and the side of the mountain, and burned. The elevation of the initial impact with the rock face of Pilot Knob Mountain was approximately 1,960 feet. The three crew members and 11 passengers received fatal injuries, and the aircraft was destroyed. ", "probable_cause": "The probable cause of this accident was that the captain, while conducting an approach, exceeded his clearance limits and, thereafter, flew the aircraft into a severe 'lee of the mountain downdraft' at an altitude insufficient for recovery. No evidence was found to explain why this particular approach was attempted. "}