{"url": "https://www.baaa-acro.com/crash/ground-collision-atr72-500-medan", "date": "Aug 3, 2017 at 1100 LT", "type": "ATR72-500", "operator": "Wings%20Air", "flight_phase": "Taxiing", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Medan – Meulaboh", "msn": "869", "yom": 2009, "flight_number": "IW1252", "city": "Medan-Kualanamu-Deli Serdang", "zone": "North Sumatra", "country": "Indonesia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 67, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13006, "captain_hours_type": 624, "copilot_hours": 263, "copilot_hours_type": 109, "aircraft_hours": 14321, "circumstances": "On 3 August 2017, a Boeing 737-900 ER aircraft, operated by PT. Lion Mentari Airlines (Lion Air) as a scheduled passenger flight from Sultan Iskandar Muda International Airport, Banda Aceh (WITT) to Kualanamu International Airport, Medan (WIMM) as flight number JT 197. JT197 departed at 1010 LT (0310 UTC) in daylight condition, with 151 persons on board. Meanwhile, an ATR 72-500 aircraft, operated by PT. Wings Abadi Airlines (Wings Air) as scheduled passenger flight from Medan with intended destination to Cut Nyak Dien Airport, Meulaboh (WITC) as flight number IW1252. On board IW1252 were two pilots, one observer pilot, two flight attendants and 67 passengers. At 0356 UTC, the IW1252 pilot requested taxi clearance to runway 23 from the Medan Ground controller and was instructed to follow U2 taxi route, the IW1252 pilot requested to depart via intersection taxiway D which was approved by Medan Tower controller. At 0357 UTC, JT197 was on landing approach and received landing clearance. At 04:00:01 UTC, the Medan Tower controller issued conditional clearance to the IW1252 pilot, to enter the runway after the JT197 had landed. This conditional clearance was combined with the air traffic control route clearance. IW1252 continued to taxi and entered the runway. At 04:00:50 UTC, JT197 touched down on runway 23 and a few second later impacted with the IW1252. There were no injuries during this occurrence, but both aircraft were substantially damaged. After impact, debris from the impact aircraft remained on the runway. Prior to the runway inspection, one aircraft departed and one aircraft landed.", "probable_cause": "The communication misunderstanding of the conditional clearance to enter runway while the IW1252 pilots did not aware of JT197 had received landing clearance and the unobserved IW1252 aircraft movement made the IW1252 aircraft entered the runway."}