{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-southport", "date": "Mar 22, 1998 at 1050 LT", "type": "Piper PA-31-310 Navajo", "operator": "Arapahoe Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Southport - Washington DC", "msn": "31-493", "yom": 1969, "flight_number": null, "city": "Southport", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 955, "captain_hours_type": 260, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 694, "circumstances": "The pilot stated he checked the fuel quantity in the inboard fuel tanks, but may have omitted the outboard tanks. He departed and climbed to 100 feet where the airplane yawed right. He believed it was a gust of wind which he attempted to correct. At 200 feet, the pilot stated the airplane rolled hard right and impacted trees in a 60 degree nose down attitude. There was no indication of a left engine discrepancy prior to impact. The right engine was examined with no fuel found in the fuel lines, and trace fuel was found in the fuel servo. According to the accident pilot, he regularly flew between Washington-Dulles and Southport, North Carolina using only the inboard tanks. Because of this, he did not check the location of the fuel selector, nor did he necessarily check the fuel quantity in the outboard fuel tanks. The cockpit fuel selector for the right engine was found in the outboard tank location. The right outboard tank on this airplane was not breached, and contained no fuel. The takeoff checklist states the fuel selector should be on the inboard fuel tank prior to takeoff. ", "probable_cause": "The pilot's failure to follow the preflight checklist, which resulted in a loss of engine power due to fuel starvation. Contributing to the significance of the accident was the pilot's failure to maintain control of the aircraft following the loss of engine power. "}