{"url": "https://www.baaa-acro.com/crash/crash-cessna-441-conquest-ii-near-birmingham-2-killed", "date": "Dec 10, 2003 at 1420 LT", "type": "Cessna 441 Conquest", "operator": "Warrington Development Corporation", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Birmingham – Venice", "msn": "441-0181", "yom": 1980, "flight_number": null, "city": "Birmingham–Shuttlesworth", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8378, "captain_hours_type": 424, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5933, "circumstances": "The flight was climbing from 5,000 to 10,000 feet and the pilot obtained a maximum altitude of 6,300 feet. The airplane then began to lose altitude and deviate off course. The pilot declared a mayday and reported the airplane was in a spin. Several witnesses near the accident site reported hearing airplane engine noises and seeing the airplane descend from the clouds in a nose-down spiral to the ground. Two AIRMETs were valid at the time of the accident and included the accident location: \"AIRMET TANGO update 3 for turbulence ... . Occasional moderate turbulence below a flight level of 18,000 feet due to wind shear ... .\" \"AIRMET ZULU update 2 for ice and freezing level ... . Occasional moderate rime and/or mixed icing in clouds and precipitation below 8,000 feet.\" Two pilots who departed in separate Beech 200 airplanes about the time of the accident airplane stated they encountered \"moderate rime\" icing between 5,000 and 6,000 feet, and one pilot reported instrument meteorological conditions and light turbulence between 1,800 to 6,000 feet. Examination of the airplane revealed no evidence of airframe or engine malfunction. The de-ice ejector flow control valves for the left wing, right wing, and empennage pneumatic boots were removed for examination, and all valves functioned when power was supplied. ", "probable_cause": "The pilot's failure to maintain adequate airspeed during climb in icing conditions, which resulted in an inadvertent stall / spin of the airplane and subsequent uncontrolled descent and collision with terrain. A factor was the accumulation of airframe ice."}