{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-30cf-istanbul", "date": "Jan 2, 1976 at 0636 LT", "type": "Douglas DC-10", "operator": "Overseas%20National%20Airways.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jeddah - Ankara", "msn": "46825", "yom": 1973, "flight_number": "SV5130", "city": "Istanbul-Yeşilköy", "zone": "Marmara Region (Marmara Bölgesi)", "country": "Turkey", "region": "Asia", "crew_on_board": 12, "crew_fatalities": 0, "pax_on_board": 364, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9848, "circumstances": "Leased by Saudi Arabian Airlines, the aircraft was completing a charter flight (hajj flight) from Jeddah to Ankara. En route, the crew was informed about poor weather conditions in Ankara (limited visibility due to foggy conditions) and was instructed to divert to Istanbul-Yeşilköy Airport. On approach to runway 24, the copilot informed the captain that one of the VASI's light was red and that their altitude was insufficient. The captain increased engine power but the aircraft continued to descent until it struck the ground eight meters short of the concrete runway. On impact, the left engine (n°1) was torn off and both left main gear and central gear were also torn off when the airplane struck the shoulder of the first runway's concrete block. The aircraft slid on its belly for few hundred meters, veered to the left and came to rest in flames in a grassy area. All 376 occupants were quickly evacuated, among them 10 were slightly injured. The aircraft was damaged beyond repair. ", "probable_cause": "The crew reported the runway in sight while passing the local NDB about 600 feet below the published minimums. The descent was completed below the glide slope. There were strong evidences that the first officer's altitude callouts were from the radio-altimeter, which was considered as a contributing factor."}