{"url": "https://www.baaa-acro.com/crash/crash-quest-kodiak-100-goias", "date": "Nov 10, 2017 at 1327 LT", "type": "Quest Kodiak 100", "operator": "Mid-Continent-Aviation-Services", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lucas do Rio Verde – Anápolis", "msn": "100-0154", "yom": 2015, "flight_number": null, "city": "Goiás", "zone": "Goiás", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3000, "captain_hours_type": 8, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off from the Bom Futuro Municipal Aerodrome (SILC), Lucas do Rio Verde - MT, to the Anápolis Aerodrome (SWNS) - GO, in order to carry out a transfer flight, with a pilot and three passengers on board. During the flight, the pilot identified conflicting information related to the amount of fuel remaining and chose to make an intermediate landing on an unapproved runway, located in the city of Goiás Velho - GO, in order to check the data visually. After the conference, the N154KQ took off from that location and, reaching approximately 300ft height, the aircraft lost power, colliding with vegetation 1.86 km from the runway used for takeoff. The aircraft was destroyed by the fire. The pilot suffered serious injuries and the three passengers suffered minor injuries.", "probable_cause": "Contributing factors:\r\n- Attitude – a contributor\r\nThe pilot's failure to monitor the fueling showed a complacent attitude regarding the verification of conditions that could affect flight safety. Therefore, the lack of knowledge about the real fuel levels implied the insertion of wrong data and an intermediate landing to check the situation, after its identification.\r\n- Training – undetermined\r\nIt is possible that the pilot's little familiarization with the aircraft emergency procedures delayed the identification of the situation and limited his possibilities of action. \r\n- Insufficient pilot’s experience – undetermined\r\nThe pilot's little experience on the aircraft may have slowed his ability to recognize the emergency and to perform the actions described in the checklist efficiently.\n"}