{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601p-austin-1-killed", "date": "Sep 10, 2014 at 1326 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "David Anderson", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dallas – Austin", "msn": "61-0215-023", "yom": 1975, "flight_number": null, "city": "Austin-Bergstrom", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 525, "captain_hours_type": 37, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3438, "circumstances": "Witnesses reported observing the airplane flying slowly toward the airport at a low altitude. The left engine was at a low rpm; \"sputtering,\" \"knocking,\" or making a \"banging\" noise; and trailing black smoke. One witness said that, as the airplane passed over his location, he saw the tail \"kick\" horizontally to the right and the airplane bank slightly left. The airplane subsequently collided with trees and impacted a field 1/2 mile north of the airport. Disassembly of the right engine revealed no anomalies, and signatures on the right propeller blades were consistent with power and rotation on impact. The left propeller was found feathered. Disassembly of the left engine revealed that the spark plugs were black and heavily carbonized, consistent with a rich fuel-air mixture; the exhaust tubing also exhibited dark sooting. The rubber boot that connected the intercooler to the fuel injector servo was found dislodged and partially sucked in toward the servo. The clamp used to secure the hose was loose but remained around the servo, the safety wire on the clamp was in place, and the clamp was not impact damaged or bent. The condition of the boot and the clamp were consistent with improper installation. The time since the last overhaul of the left engine was about 1,050 hours. The last 100-hour inspection occurred 3 months before the accident, and the airplane had been flown only 0.8 hour since then. It could not be determined when the rubber boot was improperly installed. Although the left engine had failed, the pilot should have been able to fly the airplane and maintain altitude on the operable right engine, particularly since he had appropriately feathered the left engine. ", "probable_cause": "The pilot's failure to maintain sufficient clearance from trees during the single engine and landing approach. Contributing to the accident was the loss of power in the left engine due to an improperly installed rubber boot that became dislodged and was then partially sucked into the fuel injector servo, which caused an excessively rich fuel-air mixture that would not support combustion."}