{"url": "https://www.baaa-acro.com/crash/crash-lockheed-kc-130f-hercules-hong-kong-59-killed", "date": "Aug 24, 1965 at 1010 LT", "type": "Lockheed C-130 Hercules", "operator": "USMC.png", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Hong Kong – Đà Nẵng – Saigon", "msn": "3693", "yom": 1962, "flight_number": null, "city": "Hong Kong-Kai Tak", "zone": "Hong Kong", "country": "China", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 4, "pax_on_board": 65, "pax_fatalities": 55, "other_fatalities": 0, "total_fatalities": 59, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a flight from Hong Kong to Saigon with an intermediate stop in Đà Nẵng, carrying 6 crew members and 65 soldiers on leave. During the takeoff roll on runway 13, at a speed of 150 km/h, the flight engineer reported a loss of pressure on engine number one and instructed the pilot to abandon the takeoff procedure. The copilot, who was in the left seat, reduced engine power when, in the mean time, the captain who was seating in the right seat, started the rotation. In stall condition with an asymmetrical thrust, the airplane climbed to a height of 100 feet then banked left and struck a 2 meters high sea wall with its left wingtip. It flew another 250 meters then crashed into the Kowloon Bay. Both pilots and 10 passengers survived while all 59 other occupants were killed. ", "probable_cause": "The exact cause of the technical issue on engine number one remains unclear. However, it was reported this engine was changed two weeks prior to the accident but not the propeller. It was determined the accident was the result of a partial loss of power on engine number one associated with a lack of crew coordination. The lack of experience of the copilot and wrong decisions on part of the captain were considered as contributing factors."}