{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-saint-antonin-sur-bayon-2-killed", "date": "Nov 4, 2010 at 1620 LT", "type": "Beechcraft 90 King Air", "operator": "Aero-Pyrenees-2", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Mountains", "schedule": "Aix-les-Milles - Aix-les-Milles", "msn": "LJ-579", "yom": 1973, "flight_number": null, "city": "Saint-Antonin-sur-Bayon", "zone": "Bouches-du-Rhône", "country": "France", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 9925, "captain_hours_type": 2100, "copilot_hours": 499, "copilot_hours_type": 1, "aircraft_hours": 9716, "circumstances": "The twin engine aircraft departed Aix-les-Milles Airport at 1520LT on a local training flight. The crew was cleared to fly between 5,000 and 6,000 feet. The aircraft overflew successively Marseille and Toulon then passed over Le Castellet. While cruising at an altitude of 6,000 feet and at a speed of 110 knots, the airplane entered an uncontrolled descent, dove into the ground with a rate of descent of 6,000 feet per minute and crashed in a near vertical position in a rocky zone located in the Sainte-Victoire Mountain Range, near Saint-Antonin-sur-Bayon. The aircraft was destroyed by impact forces and a post crash fire and both occupants were killed, one instructor and one pilot under supervision. ", "probable_cause": "Loss of control during an exercise at low speed and certainly in a single engine configuration. \r\nContributory factors:\r\n- No reference methods to conduct the exercise, for instructors on this type of aircraft,\r\n- Exercise conducted in a height which insufficient margin and lower than the one recommended by the manufacturer, \r\n- Insufficient vigilance on part of the instructor (however with unanimous recognized skills) but whose instruction on Beechcraft King Air 90 could not be established. "}