{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-concord-4-killed", "date": "Dec 21, 2006 at 1101 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "John Frank Mauricio Trustee", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "San Diego – Concord", "msn": "46-22061", "yom": 1989, "flight_number": null, "city": "Concord-Buchanan Field", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3628, "captain_hours_type": 25, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2470, "circumstances": "While on an instrument approach for landing, the local tower air traffic controller observed on the BRITE radar repeater scope that the airplane passed the outer marker (OM), 600 feet below the permissible crossing altitude. The controller issued a low altitude alert to the pilot and cleared him to land. The controller also reminded the pilot that the minimum descent altitude for the Localizer Directional Aid (LDA) approach was 440 feet, and provided instructions for the missed approach. At that point the pilot reported that he had the airport in sight and acknowledged the landing instructions. The controller again cleared the pilot to land on the prescribed runway for the instrument approach, and the pilot acknowledged the landing clearance. Shortly thereafter the controller instructed the pilot to execute the missed approach as the radar track showed that the airplane was off course. The pilot was instructed to initiate a climbing left turn to the VOR. The pilot said he had the airport in sight and that he saw one of the cross runways and wanted to land. The controller told the pilot that circling to that runway was not an authorized procedure for the LDA approach and again instructed the pilot to perform the missed approach. A witness stated that he was working on a storage container, about 50 feet in height, when the airplane passed overhead. He estimated the airplane to be about 50 feet higher than the storage container. The airplane made a turn westbound and the witness looked away for a second. When he looked back the airplane was in a nose and left wing down attitude and then it impacted the ground. Another witness located on the airport's north-northeast corner also observed the airplane flying toward the airport. He reported simultaneously hearing the engine power up and observed the left wing stall prior to it impacting the ground. Both witnesses reported that they did not hear anything wrong with the engine. Examination of the airframe, power plant, and propeller revealed no mechanical anomalies that would have precluded normal operation. Internal damage signatures in the engine and propeller were consistent with the production of significant power at the time of impact. A review of the weather in the area revealed that while light rain and mist were occurring near the accident site, no meteorological phenomena existed that would have adversely affected the flight. The pilot and two passengers were killed while a third passenger, a boy aged 12, was seriously injured. He died from his injuries few hours later. ", "probable_cause": "Failure of the pilot to follow the prescribed instrument approach procedures and to maintain an adequate airspeed while maneuvering in the airport environment that led to a stall."}