{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-i-near-cagliari-6-killed", "date": "Feb 24, 2004 at 0549 LT", "type": "Cessna 500 Citation", "operator": "City-Jet%20Luftfahrt", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "No", "site": "Mountains", "schedule": "Rome – Cagliari", "msn": "500-0289", "yom": 1976, "flight_number": "CIT124", "city": "Cagliari", "zone": "Sardinia", "country": "Italy", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 5472, "captain_hours_type": 2709, "copilot_hours": 2300, "copilot_hours_type": 1600, "aircraft_hours": 6471, "circumstances": "The aircraft departed Rome-Ciampino Airport on an ambulance flight to Cagliari, carrying three pilots, three doctors and a cooler containing a heart for a patient. The descent to Cagliari-Elmas Airport was initiated by night under VFR mode. After the crew was cleared to descend to 2,500 feet, ATC reported runway 32 in use and asked the crew to report on short final. About two minutes later, at an altitude of 3,333 feet, the aircraft struck the slope of Mt Su Baccu Malu located 32 km northeast of Cagliari Airport. The aircraft was totally destroyed by impact forces and all six occupants were killed.  ", "probable_cause": "The accident, classified as CFIT, was caused by the conduct of the flight at a height significantly below the Area Minimum Altitude, insufficient to maintain the separation from the ground during a night visual approach in the absence of adequate visual reference.\r\npossible contributory factors that have been identified:\r\n- The aircraft instrumentation did not include a GPWS or TAWS, whose installation is not required by law;\r\n- The erroneous descent by visual flight references, confusing the Elmas runway lights, given that the crew had no special familiarity with the area of Cagliari, the onset of a perspective illusions phenomena, with specific reference to the so-called \"black hole approach\";\r\n- The misunderstanding by crew members, of the Cagliari Approach controllers instruction to transfer to Elmas TWR ('CIT 124 continue not below 2500 feet, further descent with Elmas TWR 120.6 bye') which may have created the impression, despite the crew had confirmed that they are able to separate themselves from the obstacles that the descent down was free of obstructions;\r\n- Failure to use published procedures and available instruments in a descent to a closer airport and in an unfamiliar area , under conditions of total darkness;\r\n- The anticipation of the deviation from the airway perhaps caused [the crew] to try to speed up the arrival at destination, which determined overflying areas of higher elevation;\r\n- Read errors of the elevations listed in the maps consulted, facilitated by the non representation of the ground color;\r\n- The extended period of wakefulness without adequate rest, which may have contributed to a reduction in the performance of the crew."}