{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh106-comet-1a-mauripur-11-killed", "date": "Mar 3, 1953 at 0335 LT", "type": "De Havilland DH.106 Comet", "operator": "CP%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Demonstration", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "London – Rome – Beirut – Karachi – Yangon – Jakarta – Darwin – Sydney", "msn": "6014", "yom": 1952, "flight_number": null, "city": "Mauripur AFB (Karachi)", "zone": "Sindh (سنڌ سندھ)", "country": "Pakistan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 51, "circumstances": "The crew (five flying crew and six De Havilland engineers) were conducting a demo flight from London to Sydney to show this new jetliner to potential clients in Southeast Asia and Oceania. While taking off from runway 25 (2,500 meters long) at Mauripur Airbase, the airplane failed to get airborne, overran, hit several obstacles, went through a perimeter fence and eventually crashed in flames in a small river. The aircraft was destroyed by a post crash fire and all 11 occupants were killed. ", "probable_cause": "The accident was caused by the fact that the nose of the aircraft was lifted too high during the takeoff run, resulting in a partially stalled condition and excessive drag. This did not permit normal acceleration and prevented the aircraft from becoming airborne within the prescribed distance. The pilot appears to have realised that the nose was excessively high and took corrective action, but this was done too late to prevent the aircraft striking an obstruction immediately beyond the perimeter fence before it became airborne. The following factor was considered as contributory: the pilot, who had only limited experience in the Comet aircraft, elected to takeoff at night at the maximum permissible takeoff for the prevailing conditions. The circumstances required strict adherence to the prescribed takeoff technique, which was not complied with."}