{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-900-florianopolis-2-killed", "date": "Feb 1, 2016 at 0519 LT", "type": "Socata TBM-900", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Florianópolis – Ji-Paraná", "msn": "1071", "yom": 2015, "flight_number": null, "city": "Florianópolis-Hercílio Luz", "zone": "Santa Catarina", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1535, "captain_hours_type": 154, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 195, "circumstances": "The single engine aircraft departed Florianópolis-Hercilio Luz Airport at 0515LT on a private flight to Ji-Paraná, carrying one passenger and one pilot. While climbing by night at an altitude of 3,600 feet, the pilot initiated a right turn. Then the aircraft completed a 360 turn and crashed in the sea off Campeche Island. Few debris were found the following morning floating on water and the main wreckage was found two weeks later. Both occupants were killed. ", "probable_cause": "Contributing factors:\r\n- Application of commands – undetermined\r\nConsidering the hypothesis of spatial disorientation, of the disabling type, it is possible that the pilot has reached a situation of complete inability to operate correctly controls the aircraft in order to regain control of the flight.\r\n- Attitude – undetermined\r\nIt is possible that the high subordination of the pilot to the requests of his boss has made it difficult for you to position yourself in relation to your limitation in flying at night and in instrument flight meteorological conditions.\r\n- Disorientation – undetermined\r\nConditions favorable to disorientation, that is, the night flight over the sea, within clouds and manual operation, as well as the dynamics of the aircraft trajectory recorded by the radar, among other factors, make spatial disorientation the main hypothesis for the accident.\r\n- Visual illusions – undetermined\r\nIt is also possible that the pilot suffered visual illusions when flying over the sea in night time. When not seeing the lighting on land, and being at night dark, with cloudiness, the pilot may have confused spatial references.\r\n- Instruction – undetermined\r\nIt is possible that the lack of familiarity with the English language has made it difficult, in to some degree, knowledge of the resources, equipment and systems present in the aircraft, as well as in the instruction received in a flight simulator."}