{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-680flp-kona-1-killed", "date": "Sep 10, 1989 at 1518 LT", "type": "Rockwell Grand Commander 680", "operator": "Peter M. Maveal", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kona - Honolulu", "msn": "680-1503-18", "yom": 1965, "flight_number": null, "city": "Kona-Keahole", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 203, "captain_hours_type": 23, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4790, "circumstances": "As the aircraft was departing from runway 17, smoke was observed coming from the right engine. The pilot confirmed a loss of power and made a right turn back toward the runway, then reported he had 'lost both engines.' The aircraft was extensively damaged during a landing on rough, rocky terrain about 1/4 mile southwest of the runway threshold. Investigation revealed the aircraft had just changed ownership. During pre-purchase inspection in Florida, metal particles were found in the oil screens of both engines. Oil was changed and flushed, but metal particles were found after another engine run. In May 1989, the right engine was replaced with an engine from another aircraft. The aircraft was flown to Oakland, CA, where it was painted and new interior was installed. A local mechanic noted metal particles in both eng oil screens and recommended oil analysis, but ferrying pilot refused. After flight to Hawaii, no oil stain noted on fuselage before flight on 9/9/89. Exam of wreckage revealed both engines failed from detonation. Heavy oil streaks found behind right engine, some streaks of oil found behind left engine. Right engine  crankshaft/rod bearing surface was 0.010' under standard, but rod bearings were standard size. While the passenger was seriously injured, the pilot was killed. ", "probable_cause": "Inadequate maintenance, and operation by the pilot with known deficiencies in the aircraft. Factors related to the accident were: excessive wear in both engines, improper use of powerplant controls by the pilot, subsequent overtemperature/detonation in both engines, improper emergency procedures by the pilot (including premature gear extension and/or failure to properly reduce drag on the aircraft after loss of engine power), and the pilot's lack of experience in multi engine and this make and model of aircraft."}