{"url": "https://www.baaa-acro.com/crash/crash-vickers-763d-viscount-managua-15-killed", "date": "Mar 5, 1959 at 1335 LT", "type": "Vickers Viscount", "operator": "TACA-Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Managua – Tegucigalpa – San Salvador – Guatemala City – Mexico City – New Orleans", "msn": "82", "yom": 1955, "flight_number": "TA779", "city": "Managua-Augusto Cesar Sandino-Las Mercedes", "zone": "Managua City District", "country": "Nicaragua", "region": "Central America", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 15, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after takeoff from runway 29 at Managua-Las Mercedes Airport, while in initial climb, the aircraft banked left and crashed in flames in a field located 2,4 km from the airport. The aircraft was destroyed by impact forces and a post crash fire and 15 people were killed, among them two crew members. Four occupants survived the crash. ", "probable_cause": "In accordance with the documentation obtained and data collected during the inquiry, the Investigating Board reached the following conclusions. The accident was caused by the following factors: \r\n- Failure of number 1 engine at the end of runway 29 during takeoff and before reaching V2 speed,\r\n- The non-retraction of the landing gear immediately after the aircraft reached V2 speed,\r\n- Failure of engine number 2 a few seconds later, during a climb with insufficient speed to maintain control which resulted in a forced turn to the left that became tighter and tighter; the aircraft finally rolled into an inverted position and hit a tree with its left wing. Several possible reasons for the failure of engines no.1 and 2 and the non-retraction of the landing gear were considered, however the Board found no substantiating evidence or proof in the various tests carried out on the aircraft's parts to support any one of them. \r\nThe Board was therefore, unable positively to attribute the accident to any mechanical or electrical failure or to any piloting error."}