{"url": "https://www.baaa-acro.com/crash/crash-vickers-628-viking-1b-barseback-27-killed", "date": "Feb 8, 1949 at 1956 LT", "type": "Vickers Viking", "operator": "SAS.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Madrid – Paris – Copenhagen", "msn": "199", "yom": 1947, "flight_number": null, "city": "Barsebäck", "zone": "Skåne", "country": "Sweden", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 23, "pax_fatalities": 23, "other_fatalities": 0, "total_fatalities": 27, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 611, "circumstances": "The aircraft christened 'Torlak Viking' was performing a charter flight from Madrid to Copenhagen with an intermediate stop in Paris, carrying 23 Spanish tourists. The crew left Paris-Le Bourget Airport at 1610LT and started the descent to Copenhagen-Kastrup Airport at 1845LT. Sixteen minutes later, at 1901LT, ATC informed the crew that the airport just closed to all traffic due to poor weather conditions and the captain was advised to divert or to Aalborg or to Göteborg. The captain preferred to stack for several minutes vertical to the airport and at 1931LT, he was number one and received the permission to start an approach to runway 22 maintaining a minimum safe altitude of 1,000 feet. Seven minutes before the ETA, while at an altitude estimated between 700 and 800 feet, the twin engine aircraft went out of control and crashed into the Øresund, about 18 km northeast of Kastrup Airport. SAR operations were conducted but were eventually suspended few days later as no trace of the aircraft nor the 27 occupants was found. A month later, the wreckage was found at a depth of 23 meters about two km off Barsebäck, Sweden. Transferred from DDL to SAS on August 1st, 1948, the aircraft was repainted in SAS colors shortly later. ", "probable_cause": "The exact cause of the loss of control remains unknown. "}