{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-2h6-jambi-1-killed", "date": "Aug 27, 2008 at 1634 LT", "type": "Boeing 737-200", "operator": "Sriwijaya-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jakarta - Jambi", "msn": "23320/1120", "yom": 1985, "flight_number": "SJY062", "city": "Jambi", "zone": "Jambi", "country": "Indonesia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 124, "pax_fatalities": 0, "other_fatalities": 1, "total_fatalities": 1, "captain_hours": 7794, "captain_hours_type": 6238, "copilot_hours": 5254, "copilot_hours_type": 4143, "aircraft_hours": 49996, "circumstances": "On 27 August 2008, a Boeing 737-200 aircraft, registered PK-CJG, was being operated on a scheduled passenger service from Soekarno-Hatta International Airport, Jakarta to Sultan Thaha Airport, Jambi with flight number SJY062. On board the flight were two pilots, four flight attendants, and 124 passengers. The Pilot in Command (PIC) acted as Pilot Flying (PF) while the Second in Command (SIC) acted as Pilot Monitoring (PM). The flight time from Jakarta to Jambi was estimated to be about one hour and the aircraft was dispatched with approximately 4 hours of fuel endurance. The number one electrical engine driven generator was unserviceable, as such the Auxiliary Power Unit (APU) generator was used during the flight to maintain two generators operation. Prior to descent into Jambi, the PIC conducted the crew briefing and stated a plan for Makinga straight-in approach to runway 31 with flap 40°, reviewed the go-around procedures and stated that Palembang was the alternate airport.There was no abnormality recorded nor reported until the PIC commenced the approach to Jambi. At 09:18 UTC, the SIC contacted Thaha Tower controller and reported that the aircraft was descending and passing FL160 and had been cleared by Palembang Approach control to descend to 12,000 feet. The Thaha Tower controller issued a clearance to descend to 2500 feet and advised that runway 31 was in use. The SIC asked about the weather conditions and was informed that the wind was calm, rain over the field and low cloud on final approach to runway 31. The PIC flew the aircraft direct to intercept the final approach to runway 31. While descending through 2500 feet, and about 8 miles from the VOR, the flap one degree and flap 5° were selected. Subsequently the landing gear was extended and flap 15° was selected. 13 seconds after flap 15 selection, the pilots noticed that the hydraulic system A low pressure warning light illuminated, and also the hydraulic system A quantity indicator showed zero. The PIC commanded the SIC to check the threshold speed for the existing configuration of landing, weight and with flap 15°. The SIC called out that the threshold speed was 134 kts and the PIC decided to continue with the landing. The PIC continued the approach and advised the SIC that he aimed to fly the aircraft slightly below the normal glide path in order to get more distance available for the landing roll. The aircraft touched down at 0930 UTC and during the landing roll, the PIC had difficulty selecting the thrust reversers. The PIC the applied manual braking. During the subsequent interview, the crew reported that initially they felt a deceleration then afterward a gradual loss of deceleration. The PIC reapplied the brakes and exclaimed to the SIC about the braking condition, then the SIC also applied the brakes to maximum in responding to the situation. The aircraft drifted to the right of the runway centre line about 200 meters prior to departing off the end of the runway, and stopped about 120 meters from the end of the runway 31 in a field about 6 meters below the runway level. Three farmers who were working in that area were hit by the aircraft. One was fatally injured and the other two were seriously injured. The pilots reported that, after the aircraft came to a stop, they executed the Emergency  on Ground Procedure. The PIC could not put both start levers to the cut-off position, and also could not pull the engines and APU fire warning levers. The PIC also noticed that the speed brake lever did not extend. The radio communications and the interphone were also not working. The flight attendants noticed a significant impact before the aircraft stopped. They waited for any emergency command from the PIC before ordering the evacuation. However, the passengers started to evacuate the aircraft through the right over-wing exit window before commanded by the flight attendants. The flight attendants subsequently executed the evacuation procedure without command from the PIC. The left aft cabin door was blocked by the left main landing gear that had detached from the aircraft and the flight attendants were unable to open the door. The right main landing gear and both engines were also detached from the aircraft. The Airport Rescue and Fire Fighting (ARFF) come to the crash site and activated the extinguishing agent while the passengers were evacuating the aircraft. The PIC, SIC and FA1 were the last persons to evacuate the aircraft. The APU was still running after all passengers and crew evacuation completed, afterward one company engineer went to the cockpit and switched off the APU. All crew and passengers safely evacuated the aircraft. No significant property damage was reported. ", "probable_cause": "Contributing Factors:\r\n- When the aircraft approach for runway 31, the Loss of Hydraulic System A occurred at approximately at 1,600 feet. At this stage, there was sufficient time for pilots to conduct a missed approach and review the procedures and determine all the consequences prior to landing the aircraft.\r\n- The smooth touchdown with a speed 27 kts greater than Vref and the absence of speed brake selection, led to the aircraft not decelerating as expected."}