{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-ornskoldsvik", "date": "Jan 21, 1989 at 1747 LT", "type": "Swearingen SA226 Metro II", "operator": "Muk%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Örnsköldsvik - Örebro", "msn": "TC-317", "yom": 1979, "flight_number": null, "city": "Örnsköldsvik", "zone": "Ångermanland", "country": "Sweden", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 15, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2900, "captain_hours_type": 500, "copilot_hours": 1025, "copilot_hours_type": 268, "aircraft_hours": 8009, "circumstances": "After takeoff from Örnsköldsvik Airport, while climbing to an altitude of 7,000 feet, the left engine oil pressure warning light sounded. The crew shut down the engine but was unable to feather the propeller. Doing so, a fuse blew and only the right side of the instrument lights remained functional. After being cleared to return, the crew completed a turn but on approach, he was forced to use full elevator and rudder deflection because the left propeller could not be feathered. Misaligned, the aircraft landed 30 meters to the left of the runway then rolled few dozen meters before coming to rest. All 17 occupants escaped uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "Because the left propeller could not be feathered, this created drag the the crew was forced to compensate with trim and rudder deflection, causing the aircraft to be misaligned on final approach.\r\nThe following contributing factors were reported: \r\n- An oil leak in the left engine during initial climb forced the crew to shut it down,\r\n- Power supply problems caused by the left side not having been isolated from the right side,\r\n- Wrong adjustment of the speed control trigger, \r\n- Inadequate following of the checklist. "}