{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b99-airliner-monroe-14-killed", "date": "Jul 6, 1969 at 2122 LT", "type": "Beechcraft 99 Airliner", "operator": "Air%20South", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Atlanta - Greenville", "msn": "U-016", "yom": 1968, "flight_number": "KQ168", "city": "Monroe", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 8753, "captain_hours_type": 987, "copilot_hours": 3898, "copilot_hours_type": 254, "aircraft_hours": 2226, "circumstances": "Air South Flight 168 departed Atlanta at 21:07. At 21:13 the flight reported level at its assigned cruising altitude of 7,000 feet. The Beech had been cruising for eleven minutes when it attained a gradual nose down attitude due to a change in the longitudinal trim. The pilots noticed the change after about six seconds and initiated a recovery action. The horizontal stabilizer continued to move to a full nose down position. Excessive pulling force on the control column was necessary to recover from the high speed dive. The necessary stick forces for such an out-of-trim condition can exceed the capability of one pilot, and in some cases two pilots, to control. The Beech continued to descend until both wings failed at high speed, just before the airplane crashed into the ground in a near vertical attitude.", "probable_cause": "An unwanted change in longitudinal trim which resulted in a nosedown high-speed flight condition that was beyond the physical capability of the pilots to overcome. The initiating element in the accident sequence could not be specifically determined. However, the design of the aircraft flight control system was conducive to malfunctions which, if undetected by the crew, could lead to a loss of control."}