{"url": "https://www.baaa-acro.com/crash/crash-vickers-610-viking-1b-neara-py-40-killed", "date": "Sep 12, 1963 at 0030 LT", "type": "Vickers Viking", "operator": "Air%20Nautic", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "London-Gatwick – Perpignan", "msn": "216", "yom": 1947, "flight_number": null, "city": "Py", "zone": "Pyrénées-Orientales", "country": "France", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 36, "pax_fatalities": 36, "other_fatalities": 0, "total_fatalities": 40, "captain_hours": 22800, "captain_hours_type": 4100, "copilot_hours": 17500, "copilot_hours_type": 750, "aircraft_hours": 20547, "circumstances": "The aircraft left London-Gatwick Airport at 2013LT on a charter flight to Perpignan with 36 passengers and a crew of four on board. At 2315LT, the crew was cleared to continue direct to Perpignan maintaining the altitude of 9,500 feet. At 0008LT, the crew was cleared by Marseille Control to descend to FL65 and then FL55 seven minutes later. While approaching Perpignan, the crew was informed about the poor weather conditions at destination with thunderstorm activity. At this time, the crew informed ground that the radiocompas settings were inexploitable due to the violent storm. While cruising in low visibility, the airplane struck trees and crashed on the Roc de Planes, in the massif of the Mottes-Rouges, near the village of Py. The airplane disintegrated on impact and all 40 occupants were killed. The wreckage was found some 48 km southwest of Perpignan-Rivesaltes Airport at an altitude of 1,810 meters. \r\nCrew:\r\nMax-Marie Dunoyer de Lescheraine, pilot,\r\nLéopold Marold, copilot,\r\nÉmile-Lucien Jamin, navigator,\r\nMuriel Tiberghain, stewardess.", "probable_cause": "The accident was caused by a navigation error on part of the flying crew, caused by several errors of judgement in flight. The crew failed to make precised reports between Limoges and Perpignan and failed to use properly the VOR of Toulouse and Istres. It was noted that the crew continued to the south at an altitude of 6,000 feet without knowing his real position. It is possible that fatigue may contribute to the accident. "}