{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-8-q402-saarbrucken", "date": "Sep 30, 2015 at 1016 LT", "type": "De Havilland DHC-8-400 (Dash-8)", "operator": "Luxair-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hamburg - Saarbrücken - Luxembourg", "msn": "4420", "yom": 2012, "flight_number": "LG9562", "city": "Saarbrücken", "zone": "Saarland", "country": "Germany", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 16, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11927, "captain_hours_type": 3649, "copilot_hours": 3295, "copilot_hours_type": 1483, "aircraft_hours": 7131, "circumstances": "On the day of the accident, the crew of four was deployed for flights from Luxembourg (LUX) via Saarbrucken (SCN) to Hamburg (HAM) and back again via Saarbrucken to Luxembourg with a Bombardier DHC-8-402. The crew stated that they had met at about 0530 hrs for pre-flight preparations. The flights up until the take-off in Saarbrucken had occurred without incident. All in all the working atmosphere had been good and relaxed and they had been ahead of schedule. Saarbrucken was the destination airport for 14 passengers. The remaining 16 passengers’ destination airport was Luxembourg. According to the Cockpit Voice Recorder (CVR), the Flight Data Recorder (FDR), and the radio communication recordings, the engine start-up clearance was issued at 1009:47 hrs approximately 25 minutes ahead of schedule. At 1015:03 hrs while taxiing on taxiway C take-off clearance was issued. The Into Position Check was conducted at 1015:33 hrs on runway 09. The Pilot in Command (PIC) was Pilot Flying (PF) and the co-pilot Pilot Non Flying (PNF). The plan was to conduct take-off with reduced engine thrust (81%). During take-off the following callouts were made:\r\n1016:24 PF take off, my controls\r\n1016:25 PNF your controls\r\n1016:27 PNF spoiler is closed\r\n1016:30 PNF autofeather armed\r\n1016:33 PF looks like spring\r\n1016:35 PNF yeah, power is checked\r\n1016:36 PNF 80 knots\r\n1016:37 PF checked\r\n1016:40 PNF V1, rotate\r\n1016:42 Background click sound, probably gear lever UP\r\n1016:43 PNF upps, sorry\r\nDuring the rotation phase with approximately 127 KIAS and a nose-up attitude of approximately 5°, the landing gear retracted. At 1016:44 hrs the airplane’s tail had the first ground contact (tail strike). The tail strike warning light illuminated. Approximately 875 m after the initial ground contact the airplane came to a stop after it had bounced three times and skidded on the fuselage. The cabin crew stated that due to smoke and fume development in the cabin the airplane was evacuated right away. All passengers and the crew were uninjured and left the severely damaged airplane without help. ", "probable_cause": "The air accident was the result of an early retraction of the retractable landing gear during take-off, which was not prevented by the landing gear selector lever and the retracting control logic.\r\nContributory factors:\r\n- Reduced concentration level,\r\n- A break in the callout process / task sequence on the part of the PNF,\r\n- Actuation of the landing gear lever to the UP Position too early,\r\n- Control logic design allows retraction of the landing gear with one wheel airborne."}