{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-300-diamond-cleveland", "date": "Feb 10, 2002 at 2302 LT", "type": "Mitsubishi MU-300 Diamond", "operator": "Flight-Options", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago - Cleveland", "msn": "004", "yom": 1980, "flight_number": null, "city": "Cleveland-Cuyahoga County", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12478, "captain_hours_type": 2000, "copilot_hours": 3899, "copilot_hours_type": 326, "aircraft_hours": 7457, "circumstances": "As the airplane was descending to the airport, the pilot-in-command (PIC) calculated that the required distance to land on a dry runway would be 2,720 feet. The second-in-command (SIC) stated to the PIC, \"all right if I touch down and there's no brakes I'm going around.\" The ILS Runway 23 approach was in use, and the braking action was reported \"poor\" by a Hawker Jet, which had landed prior to the accident flight. All runway surfaces were covered with a thin layer of snow. The airplane touched down with about 2,233 feet of runway remaining, of the 5,101-foot long runway. The airplane departed the end of the runway, and proceeded into an overrun grassy area, where the nose landing gear assembly collapsed. The tower controller advised the flightcrew prior to landing that the wind conditions were from 330 degrees at 18 knots. According to the airplane's Pilot's Operating Manual, the estimated landing distance on a dry runway, for the conditions at the time of the accident, was about 2,750 feet. No charts were available in the FAA approved Airplane Flight Manual, to compute a landing distance incorporating a contaminated runway. Review of 14 CFR Part 25.1, which prescribed airworthiness standards for the issue of type certificates, and changes to those certificates, for transport category airplanes, revealed, \"For landplanes and amphibians, the landing distance on land must be determined on a level, smooth, dry, hard-surfaced runway.\" There were no requirements for the applicant to determine landing distances on a wet or contaminated runway. The latest weather recorded at the airport, included winds from 330 degrees at 12 knots, gusts to 22 knots; visibility 3/4 statute mile, light snow; and overcast clouds at 300 feet.", "probable_cause": "The pilot's failure to obtain the proper touch down point on the runway, and the pilot-in-commands failure to initiate a go-round. Factors in the accident were the tailwind condition, the snow-covered runway."}