{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-mina-6-killed", "date": "Oct 25, 1999 at 1213 LT", "type": "Learjet 35", "operator": "Sunjet Aviation", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Orlando - Dallas", "msn": "35-060", "yom": 1976, "flight_number": null, "city": "Mina", "zone": "South Dakota", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 4280, "captain_hours_type": 60, "copilot_hours": 1700, "copilot_hours_type": 200, "aircraft_hours": 10506, "circumstances": "On October 25, 1999, about 1213 central daylight time (CDT), a Learjet Model 35, N47BA, operated by Sunjet Aviation, Inc., of Sanford, Florida, crashed near Aberdeen, South Dakota. The airplane departed Orlando, Florida, for Dallas, Texas, about 0920 eastern daylight time (EDT). Radio contact with the flight was lost north of Gainesville, Florida, after air traffic control (ATC) cleared the airplane to flight level (FL) 390. The airplane was intercepted by several U.S. Air Force (USAF) and Air National Guard (ANG) aircraft as it proceeded northwestbound. The military pilots in a position to observe the accident airplane at close range stated (in interviews or via radio transmissions) that the forward windshields of the Learjet seemed to be frosted or covered with condensation. The military pilots could not see into the cabin. They did not observe any structural anomaly or other unusual condition. The military pilots observed the airplane depart controlled flight and spiral to the ground, impacting an open field. All occupants on board the airplane (the captain, first officer, and four passengers) were killed, and the airplane was destroyed.\r\nCrew:\r\nMichael Kling,\r\nStephanie Bellegarrigue.\r\nPassengers:\r\nPayne Stewart,\r\nVan Ardan,\r\nBruce Borland,\r\nRobert Fraley.", "probable_cause": "Incapacitation of the flight crewmembers as a result of their failure to receive supplemental oxygen following a loss of cabin pressurization, for undetermined reasons. "}