{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-1245-faridabad-10-killed", "date": "May 25, 2011 at 2243 LT", "type": "Pilatus PC-12", "operator": "Air%20Charter%20Services-2", "flight_phase": "Flight", "flight_type": "Ambulance", "survivors": "No", "site": "City", "schedule": "Patna - New Delhi", "msn": "632", "yom": 2005, "flight_number": null, "city": "Faridabad", "zone": "Haryana", "country": "India", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 3, "total_fatalities": 10, "captain_hours": 1521, "captain_hours_type": 1300, "copilot_hours": 300, "copilot_hours_type": 70, "aircraft_hours": 1483, "circumstances": "M/s Air Charter Services Pvt Ltd. offered their aircraft VT-ACF for operating medical evacuation flight to pick one critically ill patient from Patna on 25/05/2011. The Aircraft took off from Delhi to Patna with two crew members, two doctors and one male nurse. The Flight to Patna was uneventful. The Air Ambulance along with patient and one attendant took off from Patna at 20:31:58 IST, the aircraft during arrival to land at Delhi crashed near Faridabad on a Radial of 145 degree and distance of 15.2 nm at 22:42:32 IST. Aircraft reached Patna at 18:31 IST. Flight Plan for the flight from Patna to Delhi was filed with the ATC at Patna via W45-LLK-R594 at FL260, planned ETD being 22:00 hours IST and EET of 2hours for a planned ETA at VIDP being 24:00 hours IST. The crew took self-briefing of the weather and same “Self Briefing” was recorded on the flight plan submitted at ATC Patna. The passenger manifest submitted at Patna indicated a total of 2 crew and 5 passengers inclusive of the patient. Weather at Patna at the time of departure was 3000m visibility with Haze. Total fuel on board for departure at Delhi was 1516 lts. The preflight/transit inspection of the aircraft at Patna was carried out by the crew as per laid down guidelines. The crew requested for startup at 20:21 IST from Patna ATC and reported airborne at 20:33:43 IST. The aircraft climbed and maintained FL 260 for cruise. On handover from Varanasi Area Control (Radar), the aircraft came in contact with Delhi Area Control (East) Radar at 21:53:40 IST at 120.9 MHz. At 21:53:40 IST aircraft was identified on Radar by squawking code 3313. At 22:02:05 IST the crew requested for left deviation of 10° due to weather, the same was approved by the RSR controller. At 22:05:04 IST the crew informed that they have a critical patient on board and requested for priority landing and ambulance on arrival. The same was approved by the RSR controller. The aircraft was handed over to Approach Control on 126.35 MHz at 22:28:03 IST. At 22:28:18 IST VT-ACF contacted TAR (Terminal Approach Radar) on 126.35 MHz and it was maintaining FL160. At 22:32:22 IST, VT-ACF was asked to continue heading to DPN (VOR) and was cleared to descend to FL110. At 22:36:34 IST, the TAR controller informed VT-ACF about weather on HDG 330°, the crew replied in “Affirmative” and requested for left heading. At 22:38:12 IST, TAR controller gave aircraft left heading 285° which was copied by the aircraft. The aircraft started turning left, passing heading 289, it climbed from FL125 to FL141. At 22:40:32 IST the TAR controller gave 3 calls to VT-ACF. At 22:40:43 IST aircraft transmitted a feeble call “Into bad weather”, at that instance the aircraft had climbed FL 146.Thereafter the aircraft was seen turning right in a very tight turn at a low radar ground speed and loosing height rapidly from FL146 to FL 016. Again at 22:41:32 IST TAR controller gave call to VT-ACF, aircraft transmitted a feeble call “Into bad weather. Thereafter the controller gave repeated calls on both 126.35 MHz and also 121.5 MHz, before the blip on radar became static on a radial of 145 degree at 15.2 nm from DPN VOR at 22:42:32 IST. All attempts to raise contact with the aircraft failed. The TAR controller then informed the duty WSO and also the ATC Tower. At 22:50:00 IST, the tower informed the WSO that they have got a call from the City Fire Brigade confirming that an aircraft has crashed near Faridabad in a congested residential area known as Parvatia Colony. After the accident, local residents of the area and police tried to put off the fire and extricate the bodies from the wreckage of the aircraft.", "probable_cause": "The probable cause of the accident could be attributed to departure of the aircraft from controlled flight due to an external weather related phenomenon, mishandling of controls, spatial disorientation or a combination of the three.\n"}