{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-kokoda-13-killed", "date": "Aug 11, 2009 at 1114 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Airlines%20PNG", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Port Moresby - Kokoda", "msn": "441", "yom": 1975, "flight_number": "CG4684", "city": "Kokoda", "zone": "Central", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": 2270, "captain_hours_type": 1970, "copilot_hours": 2150, "copilot_hours_type": 1940, "aircraft_hours": 46700, "circumstances": "On 11 August 2009, a de Havilland Canada DHC-6 Twin Otter aircraft, registered P2-MCB, with two pilots and 11 passengers, was being operated on a scheduled regular public transport service from Port Moresby to Kokoda Airstrip, Papua New Guinea (PNG). At about 1113, the aircraft impacted terrain on the eastern slope of the Kokoda Gap at about 5,780 ft above mean sea level in heavily-timbered jungle about 11 km south-east of Kokoda Airstrip. The aircraft was destroyed by impact forces. There were no survivors. Prior to the accident the crew were manoeuvring the aircraft within the Kokoda Gap, probably in an attempt to maintain visual flight in reported cloudy conditions. The investigation concluded that the accident was probably the result of controlled flight into terrain: that is, an otherwise airworthy aircraft was unintentionally flown into terrain, with little or no awareness by the crew of the impending collision. \n", "probable_cause": "From the evidence available, the following findings are made with respect to the collision with terrain, 11 km south-east of Kokoda Airstrip, Papua New Guinea, involving a de Havilland Canada DHC-6-300 Twin Otter aircraft, registered P2-MCB, and should not be read as apportioning blame or liability to any particular organisation or individual.\r\nContributing safety factors:\r\n• Visual flight in the Kokoda Gap was made difficult by the extensive cloud coverage in the area.\r\n• The crew attempted to continue the descent visually within the Kokoda Gap despite the weather conditions not being conducive to visual flight.\r\n• It was probable that while manoeuvring at low level near the junction of the Kokoda Gap and Kokoda Valley, the aircraft entered instrument meteorological conditions.\r\n• The aircraft collided with terrain in controlled flight.\r\nOther safety factors:\r\n• The copilot was assessed during normal proficiency checks for instrument approach procedures but was not qualified for flight in instrument meteorological conditions.\r\n• The operator did not have a published emergency recovery procedure for application in the case of inadvertent flight into instrument meteorological conditions.\r\n• The Civil Aviation Safety Authority Papua New Guinea surveillance of the operator did not identify the operations by the operator in contravention of Rule 91.112.\r\n• The lack of a reliable mandatory occurrence reporting arrangement minimized the likelihood of an informed response to Papua New Guinea-specific safety risks.\r\n• There was no qualified Director (or similar) of Aviation Medicine in Papua New Guinea (PNG).\r\n• The lack of both flight data and cockpit voice recorders adversely affected a full understanding of the accident by the investigation.\r\nOther key findings:\r\n• The investigation was unable to discount the possible incapacitation of the copilot as a factor in the accident.\r\n• Although not required by the aviation rules at the time of the accident, the adoption of threat and error management training for flight crews, and of the methodology by operators would provide a tool to identify and mitigate operational risk as follows:\r\n– by flight crews, when flight planning and during flight; and\r\n– by operators, when developing their operational procedures. "}