{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c99-airliner-butte-2-killed", "date": "Mar 18, 2006 at 1455 LT", "type": "Beechcraft 99 Airliner", "operator": "Ameriflight2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Helena - Butte", "msn": "U-218", "yom": 1983, "flight_number": "AMF2591", "city": "Butte", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5219, "captain_hours_type": 2616, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 22169, "circumstances": "The cargo flight collided with mountainous terrain in controlled flight while executing an instrument approach procedure. Two pilots were aboard; the company's training and check captain/pilot-in-command in the right seat, and a newly hired commercial pilot in left seat, who was in training for captain The flight had been cleared for the VOR or GPS-B approach via the 7 DME arc. According to the approach plate, the transition to the approach is via a DME arc at 9,000 feet with no procedure turn. The flight is to track inbound on the 127 degree radial, descending down to, but no lower than, 7,700 feet to the initial approach fix (IAF). After crossing the IAF, the flight is to turn to 097 degrees for 10 nautical miles and descend to 6,900 feet. The remainder of the 1.5 nautical miles to the runway is to be flown under visual conditions. Documentation of the accident site indicated that the aircraft collided with trees and subsequently the mountainous terrain on a heading of approximately 127 degrees and about 6,900 feet mean sea level. The initial impact point was located approximately nine nautical miles on a magnetic bearing of 130 degrees from the IAF. Documentation of the horizontal situation indicator (HSI) on the left side instrument panel indicated that the course arrow was positioned to approximately 127 degrees, the inbound heading to the IAF. The copilot (right side) course arrow was positioned to 115 degrees. The location of the wreckage and the 127 degree heading on the HSI indicate that the pilots failed to follow the approach procedure and turn to a heading of 097 degrees after crossing the IAF. Instrument meteorological conditions were reported in the area consisting of icing conditions, heavy snow fall, with poor visibility and mountain obscuration. No pre-impact mechanical malfunctions or failures were identified.", "probable_cause": "The second pilot's failure to follow the published instrument approach procedure and the captain/PIC's inadequate supervision. Snow and mountain obscuration were factors."}