{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b60-duke-oulu-2-killed", "date": "Dec 20, 1994 at 1627 LT", "type": "Beechcraft 60 Duke", "operator": "United Seafood", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bremerhaven – Oulu – Murmansk", "msn": "P-510", "yom": 1979, "flight_number": null, "city": "Oulu", "zone": "Northern Ostrobothnia", "country": "Finland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2024, "captain_hours_type": 11, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3310, "circumstances": "The aircraft registered N911SG arrived in Oulu on a private flight from Bremerhaven, Germany (EDWB) on 20 December 1994, with the intention to continue the flight to Murmansk, Russia (ULMM). Landing time at Oulu airport was 15.03. The aircraft had one passenger in addition to the pilot-in-command and a representative of the operator company, who had been marked as a crew member. After the landing the pilot-in-command contacted air traffic control by radio and told that the aircraft needed refuelling, without mentioning the fuel type required. The ATC officer transmitted the information by telephone to the fuel company, saying that the aircraft would take JET. According to the delivery receipt, the aircraft was refuelled with 664 litres of jet fuel, JET A-1, whereas the proper fuel type for the aircraft would have been AVGAS 100LL. The aircraft was refuelled on a stand situated in front of the terminal building. The fuel was delivered by a tanker car used only for JET A-1 refuelling and equipped with labels clearly indicating the fuel type. The representative of the aircraft operator/possessor company, who had been registered as a crew member in the aircraft log book, was present during refuelling, and the tanks were filled up according to his instructions on the quantity of fuel needed. He also accepted the fuel sample presented to him and signed the delivery receipt. He paid for the fuel in cash. The fuel tanks had not been marked with the minimum fuel grade of aviation gasoline used, as provided for in the airworthiness requirements. The filling orifices were equipped with restrictors in order to prevent jet fuel nozzles from going in and thus to prevent incorrect refuelling. The tanker car replenishment nozzle had been manufactured with an expansion, which had been shaped and dimensioned to fulfil the requirements set for jet fuel nozzles in different standards. The expansion is intended to prevent jet fuel nozzles from fitting into the orifices of aviation gasoline tanks. However, after the expansion the nozzle tip had been shaped as a Camlock coupling, which was smaller in dimension than the expansion and thus fitted into the reduced filling orifices, making it possible to fill the aviation gasoline tanks with jet fuel. During refuelling, the pilot-in-command visited meteo and paid for the landing. The aircraft had an IFR flight plan drawn up by the pilot-in-command for the continued flight from Oulu to Murmansk. According to the plan, flight time was one hour and 35 minutes, alternate aerodrome Ivalo (EFIV) and endurance 5 hours. The aircraft left for this planned flight from Oulu, runway 30, at 16.19. It had been cleared to Murmansk and to climb after take-off to FL 160 with a right turn. According to the ATC officer who had monitored the take-off, the gradient of climb was rather low. Four minutes after take-off the ATC officer gave the departure time to the aircraft and asked the crew to change over to Rovaniemi Area Control Centre radio frequency. The crew acknowledged the frequency. Without contacting Rovaniemi ACC the crew called again at Oulu ATC frequency at 4 min 47 sec after take-off, stating that they wanted to return to the airport because they were having some problems. The ATC officer cleared the aircraft to call on final 12. Approximately 10 seconds after this transmission the ATC officer asked whether any emergency equipment was needed, and the answer was negative. At 16.25.25, when the ATC officer asked if the crew had the field in sight, the crew confirmed this and reported that their DME distance was 6 nm. At 16.26.11 the crew called mayday, stating that both engines were stopping. At 16.26.38 the mayday call was repeated and emergency landing reported. Rovaniemi ACC monitored the aircraft by radar, and the last reliable radar contact was established at 16.26.30. On the basis of recorded radar data, the crash site was estimated to be approximately 1 NM from Laanila NDB, in the direction of 60°. Rescue units found the aircraft in a forest at 17.06. It had struck into trees, turned upside down and been destroyed. The aircraft door was shut and the occupants were still inside. The passenger on the back seat had been thrown away from his seat and was found dead at the accident site. The pilot-in-command was on the left front seat, seriously injured and unconscious, with his seat belt fastened (he died from his injuries 10 days later on December 30). The right crew seat occupant was injured but conscious, and his seat belt was fastened as well. It came out during the investigation that he was actually a passenger.", "probable_cause": "The accident was caused by incorrect refuelling. This was made possible by a series of human errors, which together with the fact that the technical defences failed, permitted the aircraft to be refuelled with Jet A-1 instead of Avgas 100LL. The incorrect fuel caused knocking, which resulted in engine damage and eventual stopping of both engines."}