{"url": "https://www.baaa-acro.com/crash/crash-bristol-142-blenheim-i-khalkis", "date": "Dec 1, 1940", "type": "Bristol 142 Blenheim", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Bombing", "survivors": "Yes", "site": "Plain, Valley", "schedule": null, "msn": "8056", "yom": 1937, "flight_number": null, "city": "Khalkis", "zone": "Central Greece / Στερεά Ελλάδα", "country": "Greece", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 1 December 1940 three Blenheims from 30 Sqn RAF returning over the mountains to their Greek base from a raid on Valona ran into a severe front which caused ice to begin forming on the wings, badly affecting control of the aircraft. As conditions deteriorated further, the formation leader, Flt Lt Alfred Llewellyn Bocking, a Canadian in the RAF since 1935, started to consider whether or not the crews should all bale out. At that point however, a murky gap in the snow clouds was sighted and Bocking and another pilot managed to dive through it, emerging in clearer air between the whitened mountain-sides, and reached base. The third pilot, Sgt G. Ratlidge, became separated in the dive, so he attempted to climb over the cloud layer. However, at 20,000 feet his Blenheim I K7103 wallowed so badly that, despite full power and his strenuous efforts, it kept slipping back into the clutches of the cloud, taking on more ice, which soon blocked a carburetor air intake. One engine stopped, flipping the aircraft into an immediate spin in the cloud. Ratlidge ordered his crew to abandon the aircraft but the violent spin had flung the observer’s parachute pack into the well, way out of reach so he could not clip it on. The pilot and the air gunner decided to stay with him aboard the aircraft, which lost 13,000 feet and spun out of the cloud at 7,000 feet into a narrow valley near Khalkis with sheer mountain faces rising into the cloud on either side of them. The pilot recovered from the spin and on sighting a small but rough cultivated area made a successful ’dead-stick’ forced landing on to it - the only possible place to put the aircraft down for miles around. All three crew were safe. The Blenheim was not recovered.\r\nSource:\r\nhttp://aviationarchaeology.gr/wp-content/uploads/2014/09/Bristol-Blenheim-losses-in-Greece-1940-1941.pdf", "probable_cause": null}