{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-i-traitors-cove-6-killed", "date": "Aug 16, 2007 at 1730 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Seawind Aviation", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Traitor's Cove - Ketchikan", "msn": "1306", "yom": 1959, "flight_number": null, "city": "Traitor's Cove", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 17000, "captain_hours_type": 7000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 22409, "circumstances": "The float-equipped airplane was departing from a remote bay 20 miles north of Ketchikan, Alaska, to return air taxi passengers to Ketchikan after a ground tour. The accident pilot, who reported that he had 17,000 flight hours and 7,000 hours in the make and model of the accident airplane, said that southeasterly winds had begun to increase while he was waiting at the bay for the passengers to return from the tour. He said that, unlike when he had landed about 2.5 hours earlier, it was no longer “nice and calm” when the passengers returned. The pilot noticed choppy waves in parts of a nearby cove. To avoid some of the wind and waves, the pilot elected to take off toward the interior of the bay, in the direction of rising terrain. The pilot said that he had never taken off in that direction before. The pilot also said that he had intended to make a shallow, right-climbing turn toward the mouth of the bay and away from the terrain, but shortly after takeoff, he saw numerous choppy waves concentrated along his proposed departure flightpath, which he said indicated to him that strong winds were likely along that path. The pilot decided to change his plan and continue flying straight temporarily, away from the waves, and to make a left, 180-degree turn inside the bay, which was surrounded by high terrain. The pilot indicated that when the turn was initiated, the airplane was about 400 feet above the water, and he did not recall the indicated airspeed. The attempted 180-degree turn was within the airplane’s performance capabilities but placed it closer to rising terrain. While attempting this turn, the pilot encountered a downdraft, was unable to climb above the terrain, and stalled the airplane about 60 feet above the ground. The downdraft likely made it more difficult to avoid descending into the rising terrain. A weather study by the National Transportation Safety Board confirmed that there was a gust front in the area and an abrupt wind change about the time of the accident. Pilots flying nearby also reported low-level windshear, strong winds, and turbulence. No mechanical anomalies were discovered during postaccident inspections by the Safety Board. Five passengers including two children were killed. A month later, one of the survivor died from his injuries. ", "probable_cause": "An inadvertent aerodynamic stall resulting from the pilot's poor decision-making and inadequate planning and execution when he took off toward nearby rising terrain, in strong winds, under circumstances where his options for maneuvering were severely limited and where his safety margin was, thus, insufficient."}