{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-2-112-atlanta-5-killed", "date": "May 6, 1935 at 0330 LT", "type": "Douglas DC-2", "operator": "TWA-1", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Los Angeles – Albuquerque – Kansas City – New York", "msn": "1295", "yom": 1934, "flight_number": "TW006", "city": "Atlanta", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 8, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While cruising 10 km west from Macon, Missouri, the crew encountered poor weather conditions and was unable to contact the base in Kansas City. In low visibility due to fog, the crew was unable to fix his position and attempted to make an emergency landing in an open field. The aircraft impacted ground and crashed. Both pilots and three passengers were killed, among them Bronson M. Cutting, Senator of New Mexico. ", "probable_cause": "It is the opinion of the Accident Board that the probable direct cause of this accident was an unintentional collision with the ground while the airplane was being maneuvered at a very low altitude in fog and darkness. The probable contributory causes of this accident were:              \r\n- A forecast by the United States Weather Bureau which did not predict the hazardous weather that developed during the latter part of the forecast period. \r\n- Improper clearance of the airplane from Albuquerque by the company's ground personnel because of their knowledge that the plane's two-way radio was not functioning on the Western night frequency. \r\n- Improper control by the company's ground personnel at Albuquerque for not calling the airplane back or ordering it to stop at an intermediate point when it was found that two-way radio communication could not be established. \r\n- Error on the part of the pilot for proceeding in the flight after discovering that he was unable to effectively communicate with the ground. \r\n- Failure of the company's ground personnel at Kansas City to expeditiously redispatch the airplane to a field where better weather existed when it became apparent that the ceiling at Kansas City was dropping to and below the authorized minimum for landing and while the airplane still had sufficient fuel to meet the Department of Commerce requirement of 45-minute fuel reserve after effecting a landing."}