{"url": "https://www.baaa-acro.com/crash/crash-cessna-401-rutherfordton-1-killed", "date": "Aug 1, 1991 at 1435 LT", "type": "Cessna 401", "operator": "Hyman S. Fisher", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Rutherfordton - Salisbury", "msn": "401-0098", "yom": 1969, "flight_number": null, "city": "Rutherfordton", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1310, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5975, "circumstances": "The accident occurred during the pilot's second attempt to fly to his destination. According to airport personnel, he did not refuel the airplane after he returned from the first attempt. He had onloaded 43.6 gallons of fuel before departing on the first flight. After departing Rutherfordton on the second flight, the airplane was observed about 400 feet above the ground and 4 miles north of Monroe. One witness reported that the right engine was sputtering as it flew overhead; seconds later, the airplane crashed into a wooded area. A wreckage examination disclosed that the fuel system was empty. No fuel was found in the left engine fuel flow divider. Airport personnel also reported the pilot was not knowledgeable of the aircraft fuel system. According to the owner's manual, the fuel consumption rate for cruise at 75% power was about 16 gallons per hour per engine. The pilot had operated the engines approximately 2 hours 10 minutes before they lost power. The pilot, sole on board, was killed. ", "probable_cause": "Inadequate preflight by the pilot, which resulted in fuel exhaustion, due to an inadequate supply of fuel. The pilot's lack of familiarity with the aircraft fuel system was a related factor."}