{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-guyton-2-killed", "date": "Dec 29, 1997 at 0845 LT", "type": "Cessna 414 Chancellor", "operator": "Valley Forge Manufacturing Corporation", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Orlando – White Sulphur", "msn": "414-0205", "yom": 1971, "flight_number": null, "city": "Guyton", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3996, "captain_hours_type": 1545, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3872, "circumstances": "About 26 minutes after takeoff while at 21500 feet, the pilot requested a non existent route. Seven minutes later, the passenger stated the pilot was light headed and fading then he had passed out. The passenger had once held a student pilot certificate and about 5 years earlier she had accrued 73 hours of flight time in Cessna 150/152 aircraft. The air traffic controller, and other pilots on the radio frequency tried to assist the passenger. The passenger was advised to provide oxygen for herself and the pilot, but she was unable. The airplane climbed to 34,200 feet where the airplane departed controlled flight, recovered, then departed controlled flight several more times before beginning a nose low descent. Witnesses reported hearing the airplane orbiting several times while flying above a cloud layer then observed the airplane orbiting beneath the clouds. While in a descending right wing low attitude, the airplane impacted the ground and came to rest submerged in a pond. Examination of the flight controls, engines, and propellers revealed no evidence of preimpact failure or malfunction. A discrepancy with the regulating valve was noted. Two small holes were noted in the cabin door seal. The left wing pressurization duct had been replaced about 8 years earlier but the right wing pressurization duct, had not been replaced. The ducts are on-condition components. There was no preimpact failure or malfunction noted with the barometric pressure switch, the cabin altitude annunciator bulbs, the safety valve, solenoid valve, or differential pressure/cabin altitude gauge. Testing for carbon monoxide for both was negative. ", "probable_cause": "Inadequate maintenance of the cabin pressurization system, which resulted in inadequate pressurization and incapacitation of the pilot due to the hypoxia. Also causal was the pilot's failure to adequately monitor the cabin pressurization system. "}