{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-springfield-1-killed", "date": "Jan 3, 1989 at 0812 LT", "type": "Piper PA-31-310 Navajo", "operator": "Apollo Lines", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Indianapolis - Columbus", "msn": "31-47", "yom": 1967, "flight_number": null, "city": "Springfield", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1041, "captain_hours_type": 57, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5906, "circumstances": "The pilot was making a contract cargo flight under far 91 rules and had experienced icing enroute. When just past Dayton, he indicated that he 'had a little fuel problem' and needed to get into OSU without delays. A short time later he indicated that he needed to go to the nearest airport. He was vectored toward SGH for landing. He then indicated that he had lost an engine and a short time later indicated that he had lost the other engine. The aircraft crashed in a residential area. There was no fire and only residual fuel was found in the airplane. The company president indicated that he did not encourage his pilots to carry 'excess fuel'. It was reported that this pilot, along with others, had been 'chewed out' for carrying 'excess fuel'. The operation should have been conducted under far 135 rules since the company had retained operational control of the operation. The pilot, sole on board, was killed. ", "probable_cause": "Fuel exhaustion precipitated by the inadequate fuel consumption calculations performed by the pilot, pressure from the company president to not carry excess fuel and improper in-flight planning/decisions by the pilot by not refueling enroute before fuel was exhausted. Contributing to the accident was the inadequate surveillance and certification of the operator by the FAA. \r\nOccurrence #1: loss of engine power (total) - nonmechanical\r\nPhase of operation: descent\r\nFindings\r\n1. (c) fuel consumption calculations - inadequate - pilot in command\r\n2. (c) company-induced pressure - company/operator management\r\n3. (c) inadequate surveillance of operation - faa (organization)\r\n4. (c) fluid, fuel - exhaustion\r\n5. (c) aircraft preflight - inadequate - pilot in command\r\n6. (c) inadequate certification/approval - faa (organization)\r\n7. (c) refueling - not performed - pilot in command\r\n8. (c) in-flight planning/decision - inadequate - pilot in command\r\n----------\r\nOccurrence #2: forced landing\r\nPhase of operation: descent - emergency\r\n----------\r\nOccurrence #3: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled"}