{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1049c-55-81-super-constellation-biak-58-killed", "date": "Jul 16, 1957 at 0336 LT", "type": "Lockheed L-1049 Super Constellation", "operator": "KLM-21", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Biak – Manila – Calcutta – Karachi – Bahrain – Cairo – Rome – Amsterdam", "msn": "4504", "yom": 1953, "flight_number": "KL844", "city": "Biak", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 59, "pax_fatalities": 49, "other_fatalities": 0, "total_fatalities": 58, "captain_hours": 9396, "captain_hours_type": 1835, "copilot_hours": 3497, "copilot_hours_type": 1651, "aircraft_hours": 11867, "circumstances": "On 16 July at 0332 hours local time (15 July - 1802 hours GMT) the aircraft took off from Mokmer aerodrome on the Island of Biak, on a scheduled transport flight to Manila. It carried nine crew members and fifty-nine passengers. A few minutes after take-off the pilot asked the operator in the control tower to keep the runway lights on. Shortly thereafter he requested permission to make a \"low run\" over the aerodrome. Both requests were granted, In the meantime, the aircraft had made a turn to the right and a turn to the left and was flying in a westerly direction back towards the aerodrome. During this approach the aircraft lost altitude gradually and at 0336 local time it crashed into the sea one kilometer from the shore. It burst into flames, broke apart and sank immediately. Eleven passengers and one stewardess were rescued.The stewardess and one of the surviving passengers died later in hospital.", "probable_cause": "As a result of the foregoing it is concluded that the explanation of the accident lies either in an error on the part of the pilot or in a technical failure. The Board was unable to state whether the accident could have been caused by a combination of both pilot error and technical failure. The Board was of the opinion that low runs should not be made by aircraft on scheduled services. The magnitude of the danger that is inherent in the proximity of the ground on take-off and landing should not be increased unnecessarily by flying at low altitude. "}