{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh60x-moth-detling-2-killed", "date": "Jul 20, 1930 at 1400 LT", "type": "De Havilland DH.60 Moth", "operator": "S. E. H. Spencer", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Detling - Hamble", "msn": "446", "yom": 1927, "flight_number": null, "city": "Detling", "zone": "Kent", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot/owner S. E. H. Spencer was accompanied by Miss Grace and on the day of the accident, the two people had arrived at Detling at 1300LT from Hamble, Hampshire. After a lunch break, Miss Grace suggested that the pilot should carry out some aerobatics before proceeding on the return journey. They took off in a normal manner and climbed to 300 feet whilst circling the landing ground, and then Spencer executed a half-roll to port. This manoeuvre was followed, as soon as the Moth had recovered from the loss of height, by a loop which was made with a very low margin of speed and from which the machine leveled out at only 50 feet above the ground. It then assumed a slightly climbing attitude, rolled, and nose dived straight into the ground. Witnesses said that the engine was shut off when the Moth completed the first half of the loop, and was not heard to accelerate again. Examination of the charred wreckage didn't reveal any obvious defects in the airframe or engine, and it was apparent that it had crashed in a stalled condition. The petrol tank came into violent contact with the engine on impact and was crushed before igniting, hence the fierceness of the fire.", "probable_cause": "The investigators' conclusion was that G-EBUR had crashed due to an error of judgement on the part of the pilot which caused the aircraft to stall on completing a loop at extremely low altitude."}