{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-75-dl-madrid-21-killed", "date": "Oct 28, 1957 at 1805 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Iberia-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tangier – Madrid", "msn": "19332", "yom": 1943, "flight_number": null, "city": "Madrid-Getafe", "zone": "Madrid", "country": "Spain", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 17, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 1759 hours the aircraft was in contact with Barajas Control Tower and reported normal flight and that the airport was in sight. It requested landing data and asked that the ILS be turned onto test the airborne installation in the prevailing visual meteorological conditions. Barajas replied: \"Runway 33, wind calm, QNH 30.13, report on reaching base leg, ILS out of order\". At 1803 the aircraft called the Paracuellos Area Control Centre asking for emergency entry clearance as its left engine was on fire. It was given absolute priority for the use of any runway. That was the last contact with the aircraft. Shortly thereafter an engine fell clear, and 30 seconds later an intense light was seen caused by a fire accompanied by columns of black smoke. After making a turn the aircraft began to lose height rapidly and fell to the ground near Getafe. The airplane was destroyed by a post crash fire and all 21 occupants have been killed. ", "probable_cause": "The accident was caused by a fire produced by extraneous objects, which developed in the left nacelle. A different type of fire would have burned the wheel, the magneto couplings and the landing gear leg; fuel combustion alone would not have been sufficient to weaken so rapidly the engine support fittings."}