{"url": "https://www.baaa-acro.com/crash/crash-handley-page-hpr7-dart-herald-214-curitiba-21-killed", "date": "Nov 3, 1967 at 1130 LT", "type": "Handley Page HPR-7 Dart Herald", "operator": "Sadia_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "São Paulo – Curitiba", "msn": "190", "yom": 1965, "flight_number": null, "city": "Curitiba", "zone": "Paraná", "country": "Brazil", "region": "South America", "crew_on_board": 5, "crew_fatalities": 3, "pax_on_board": 20, "pax_fatalities": 18, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": 14104, "captain_hours_type": 2568, "copilot_hours": 5963, "copilot_hours_type": 2021, "aircraft_hours": 3191, "circumstances": "The aircraft, registration PP-SDJ, took off from São Paulo-Congonhas Airport, at 1015 hours Z, with Curitiba-Afonso Pena, Paraná, as its destination, carrying five crew members and twenty passengers. In accordance with its approved IFR flight plan, the aircraft was to fly Airway Green 3 at flight level 130, and at a speed of 300 km/h. The flight time on the São Paulo-Curitiba segment was estimated to be 1:00 hour. After the take-off from São Paulo the flight proceeded in accordance with the approved flight plan in visual meteorological conditions (VMC) as far as the vicinity of Paranagul. There the aircraft changed to instrument flight (IMC) in moderate turbulence. At that moment one of the ADF was set on the Paranagul marine NDB (NX-320 kc/s) and the other on the Paranagud NDB (PG-340 kc/s). Without a correct fix being obtained over Paranagua the position report was transmitted at 1117 hours Z to Curitiba Control and the aircraft changed heading, approaching Curitiba on a magnetic heading of 283°. The ADFs were then set respectively on the frequencies of the Curitiba NDB (CT-390 kc/s) and the Bacacheri NDB (BI-300 kc/s). The pilots found it necessary to change the ADF frequencies several times on the São Paulo-Curitiba segment and finally one ADF was set on the Curitiba NDB and the other on Broadcasting Station ZYM-5 (560 kc/s). In reply to the position report Curitiba Control cleared the aircraft to descend to flight level 70 and report when having the Bacacheri NDB at 30°: the aircraft flew in IMC conditions and moderate turbulence with its airborne radar and VOR switched off. At 1126 hours Z the pilot reported his position to Curitiba Control as having the Bacacheri NDB at 30° and he was instructed to proceed and hold above Curitiba NDB and descend to flight level 50. At 1128 hours Z the pilot reported over Curitiba NDB and initiated the downwind leg (IFR descent pattern phase for touchdown on Curitiba-Afonso Pena runway 15). After this radio message the aircraft left the magnetic heading 283° relating to the São Paulo-Curitiba segment to intercept the downwind leg on a heading of 359° in the descent pattern. Seventeen seconds later when the aircraft had executed approximately 45° of a turn to the right, it collided on a heading of 325° with a hill at an altitude of 4 635 ft. At the moment of impact the aircraft was executing a turn with slight bank to the right. Two crew members and two passengers survived while 21 other occupants were killed. The aircraft was destroyed. ", "probable_cause": "The accident was then consequence of pilot error through improper procedure in instrument flight. The following contributing factors were reported: \r\n- Lack of a dynamic programme for aircraft accident prevention,\r\n- Non-confirmation over Curitiba-Afonso Pena NDB,\r\n- Inaccurate position relative to Curitiba-Bacacheri NDB,\r\n- Failure to use VOR equipment,\r\n- Failure to execute all the phases of the descent, with assumed interception of downwind leg without confirmation of position,\r\n- Momentary radio-direction finding indication of inaccurate fix."}