{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-200-lima", "date": "Dec 13, 2003 at 2248 LT", "type": "Boeing 737-200", "operator": "Aero%20Continente", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Caracas - Lima", "msn": "20956", "yom": 1974, "flight_number": "ACQ341", "city": "Lima-Callao-Jorge Chávez", "zone": "Lima", "country": "Peru", "region": "South America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 94, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 25502, "captain_hours_type": null, "copilot_hours": 2229, "copilot_hours_type": null, "aircraft_hours": 62716, "circumstances": "Following an uneventful flight from Caracas, the crew started the approach to Lima-Callao-Jorge Chávez Airport when the crew noted an asymmetric warning with the flaps. The crew decided to continue the approach but failed to lower the undercarriage. The aircraft belly landed at a speed of 190 knots and slid on runway 15 for 2,347 metres before coming to rest. All 100 occupants escaped uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "Failure of the crew to verify and check the Non Normal Checklist of the Quick Reference Handbook (QRH) due to technical problems at the time of approach and landing, causing the omission of the extension of the gear and subsequent contact of the aircraft with the runway with landing gear retracted. The following findings were identified: \r\n- During the approach, an indication of flap asymmetry presented.\r\n- Due to the tightness of the itinerary programmed by the company, the total flight hours and the flight's working day were within the limits of the maximum allowed by the RAP, which could have influenced (due to fatigue) the poor performance by the crew.\r\n- The lack of recording of some parameters of the flight recorders (FDR and CVR) prevented the resolution of some important and useful details for the investigation.\r\n- The flap asymmetry indication, due to an indication fault in the Flap Position Indicator caused by high electrical resistance originating from the winding inside the synchro transmitter of the right side Flap Position Transmitter.\r\n- The omission of the use in the approach phase of the procedures described in the QRH for this type of abnormal situations.\r\n- The lack of decision to carry out a Go Around, taking into account that the period of time to carry out the QRH procedures for this abnormal situation was not going to be enough.\r\n- Overconfidence (complacency) during the approach phase under abnormal conditions (indication of flap asymmetry).\r\n- Lack of Crew Resource Management during the approach and landing phases, especially under abnormal conditions.\r\n- Lack of leadership during the abnormal situation presented.\r\n- Lack of communication with the Control Tower about the abnormal conditions in which the approach and landing were to be carried out.\r\n- Itinerary very adjusted to the limits of flight hours and working hours, established by the RAP."}