{"url": "https://www.baaa-acro.com/crash/crash-basler-bt-67-newton-2-killed", "date": "Mar 15, 1997 at 1528 LT", "type": "Basler BT-67", "operator": "Basler%20Airlines", "flight_phase": "Flight", "flight_type": "Aerial photography", "survivors": "No", "site": "City", "schedule": "Oshkosh - Newton", "msn": "26002", "yom": 1943, "flight_number": null, "city": "Newton", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5350, "captain_hours_type": 3775, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17616, "circumstances": "At 1400 cst, modified Douglas DC-3C/BT-67R, TZ-389, and Beech A36, N3657A, began formation flight to get DC-3 flying time and for the 2nd occupant of the A36 to get aerial photos of the DC-3. A witness saw the airplanes at 500 feet to 700 feet agl, \"flying close together heading north.\" He said \"the big plane (DC-3) was flying straight and level. The little plane (A36) was just to the west of the big plane. The little plane then hit the big plane near the middle.\" After impact, pieces of acft were seen falling. Another witness saw the DC-3 heading north and the A36 circling it above and below. On its last pass, the A36 circled behind the DC-3, then crossed over the top and hitting the top of the DC-3. About 5 seconds after impact, the DC-3 gently rolled/turned westbound (apparently descending and gaining airspeed); the left wing then came off, followed by the right wing about 2 seconds later. Parts of the A36 empennage were found 3590 to 4,910 feet from the main wreckage. There was evidence that during impact, the DC-3 elevator and rudder controls were severed. No preimpact anomalies were found. At 1445 cst, an AIRMET had been issued, forecasting light to moderate turbulence below 8,000 feet msl. Toxicology tests of the DC-3 copilot's blood showed 0.127 mcg/ml amitriptyline (a prescription antidepressant with sedative side effects), 0.039 mcg/ml nortriptyline (metabolite of amitriptyline), and an undetermined amount of ephedrine and phenylpropanolamine (over-the-counter medications used in cold preparations, diet aids and stimulants). ", "probable_cause": "Failure of the Beech A36 pilot to maintain clearance from the modified Douglas DC-3, while positioning the A36 for photography of the DC-3. "}