{"url": "https://www.baaa-acro.com/crash/crash-atr72-212-shannon", "date": "Jul 17, 2011 at 1021 LT", "type": "ATR72-200", "operator": "Aer%20Arann", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Manchester - Shannon", "msn": "413", "yom": 1994, "flight_number": "EI3601", "city": "Shannon", "zone": "Munster", "country": "Ireland", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 21, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2882, "captain_hours_type": 2444, "copilot_hours": 1678, "copilot_hours_type": 1351, "aircraft_hours": 32617, "circumstances": "The aircraft and crew commenced operations in EINN that morning, departing at 05.52 hrs and arriving at EGCC at 07.13 hrs. During the turnaround, fuel was uplifted and 21 passengers boarded. Using the flight number and call sign EI-3601 the scheduled passenger service departed EGCC at 07.47 hrs for EINN with an estimated flight time of one hour and nine minutes. En-route operations were normal and, in consultation with ATC, the aircraft descended and was cleared to self-position to DERAG2  for an Instrument Landing System (ILS) approach to RWY 24. At 09.08 hrs the aircraft commenced an approach to RWY 24 in strong and gusty crosswind conditions. Following a turbulent approach difficulty was experienced in landing the aircraft, which contacted the runway in a nose-down attitude and bounced. A go-around was performed and the aircraft was vectored for a second approach. During this second approach landing turbulence was again experienced. Following bounces the aircraft pitched nose down and contacted the runway heavily in a nose down attitude. The nose gear collapsed and the aircraft nose descended onto the runway. The aircraft sustained damage with directional control being lost. The aircraft came to rest at the junction of the runway and a taxiway. Following engine shutdown the forward Cabin Crew Member (CCM) advised the cockpit that there was no smoke and that the doors could be opened following which, an evacuation was commenced. Airport fire crews arrived on scene promptly and assisted passengers disembarking the aircraft. There were no injuries. ", "probable_cause": "Probable Cause: \r\n1. Excessive approach speed and inadequate control of aircraft pitch during a crosswind landing in very blustery conditions.\r\nContributory Factors: \r\n1. Confusing wording in the FCOM that led the crew to compute an excessive wind factor in the determination of Vapp.\r\n2. Incorrect power handling technique while landing.  \r\n3. Inexperience of the pilot in command.  \r\n4. Inadequate information provided to flight crew regarding crosswind landing techniques. "}