{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-peachland-3-killed", "date": "May 13, 2012 at 1845 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Colin Moyes", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Okanagan Lake - Pitt Meadows", "msn": "1667", "yom": 1966, "flight_number": null, "city": "Peachland", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 420, "captain_hours_type": 50, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The privately operated de Havilland DHC-2 MK 1 amphibious floatplane (registration C-GCZA, serial number 1667) departed Okanagan Lake, near Kelowna, for a daytime flight under visual flight rules to Pitt Meadows, British Columbia, with the pilot and 2 passengers on board. While enroute, the aircraft struck trees and collided with terrain close to and 100 feet below the level of Highway 97C, near the Brenda Mines tailings hill. At 1850 Pacific Daylight Time, a brief 406-megahertz emergency-locator-transmitter signal was detected, which identified the aircraft; however, a location could not be determined. Most of the aircraft was consumed by a post-impact fire. The 3 occupants were fatally injured.", "probable_cause": "There was no indication that an aircraft system malfunction contributed to this occurrence. There were no drastic changes in the aircraft’s flight path, and no emergency calls from the pilot to indicate that an in-flight emergency was experienced. The constant ground speed and flight path would also suggest that the aircraft was under the control of the pilot. As a result, this analysis will focus on the phenomenon of controlled flight into terrain (CFIT).\r\nFindings as to Causes and Contributing Factors:\r\n1. The combination of relatively high weight, effects of density altitude, and down-flowing air likely reduced the climb performance of the aircraft, resulting in the aircraft’s altitude being lower than anticipated at that stage in the flight.  \r\n2. The pilot’s vision was likely impaired by the sun, and the pilot may have been exposed to visual illusions; both were factors that contributed to the pilot not noticing the trees and the rising terrain, and colliding with them.  \r\nFindings as to Risk:\r\n1. Visual illusions cause false impressions or misconceptions of actual conditions. Unrecognized and uncorrected spatial disorientation, caused by illusions, carries a high risk of incident or accident.  \r\n2. When there are no special departure procedures published for airports in mountainous regions surrounded by high terrain, there is a risk of pilots departing the valley at an altitude too low for terrain clearance.  \r\nOther Findings:\r\n1. Information from the Wide Area Multilateration system was not preserved following the occurrence, as local NAV CANADA personnel were not aware that unfiltered data were only available for a limited time."}