{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-15-dc-skymaster-frankfurt-2-killed", "date": "Jan 21, 1967 at 0513 LT", "type": "Douglas C-54 Skymaster", "operator": "Air%20Ferry", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Manchester – Frankfurt", "msn": "10359", "yom": 1944, "flight_number": "BE200", "city": "Frankfurt-Main", "zone": "Hesse", "country": "Germany", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6600, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 35500, "circumstances": "Flight BE/LH200 was a non-scheduled international cargo flight from Manchester to Frankfurt. An IFR flight plan via Congleton beacon, airways Amber 1, Amber 2, Blue 3, Dover beacon and airway Green 1 to Frankfurt was filed. Take-off from Manchester was scheduled at 0010 hours GMT; however, because of a malfunction in the door warning device, the flight took off at 0119 hours. At 0402 hours it contacted Frankfurt Approach Control. It was requested to report over Frankfurt VOR and was given a QNH of 1018 mb. At 0405 hours the flight reported over Frankfurt VOR at FL 60 and was instructed to carry out an ILS approach to runway 25R. At approximately 0410 hours the flight was advised that it was 8 miles from touchdown and instructed to contact the tower on 118.7 MHz and to continue its ILS approach to runway 25R. The flight immediately contacted the tower and was cleared to land on runway 25R, the wind being calm. This was acknowledged by the flight: at no time was the QFE given to or requested by the flight. Two minutes after its last radio transmission and whilst on a heading of about 260°, the aircraft struck a tree approximately 2 700 m before the threshold of runway 25R and 100 m left of the extended centre line. After striking several more trees it continued on a track of about 280' and crashed. The accident occurred at approximately 0413 hours. The aircraft was destroyed by impact forces and a post crash fire and both crew members were killed. ", "probable_cause": "The accident is probably attributable to the fact that the crew did not set the altimeters in the final approach according to the instructions in the operations manual. This error was aggravated by the fact that the final approach checklist did not coincide with the altimeter setting procedure. In consequence the crew unintentionally flew below critical height and the aircraft collided with trees when the altimeters were showing approximately 200 ft above the critical height. The following findings were reported:\r\n- The flight progressed normally until the last communication of the aircraft approximately 5-6 NM before the threshold of runway 25R. The aircraft then descended below the glide path and collided with trees approximately 2 700 m before the threshold,\r\n- Weather conditions at the airport were above the prescribed weather minima,\r\n- The radio navigational aids, and the approach and runway lighting were operating normally: the strength of the lighting used was adequate for the visibility conditions. The VASIS was inoperative and the crew had been duly notified by NOTAM,\r\n- The approach sequenced flashing lights were not in use,\r\n- No evidence of a malfunction or failure of the aircraft, its engines, or its systems prior to impact was found. The pilot-in-command's altimeters were found one at a setting of 1018.5 mb corresponding to the QNH, the other at 29.92 in. Hg, and the co-pilot's altimeter at a setting of 30.08 in. Hg corresponding also to the QNH. In accordance with the operator's instructions and with normal crew practice, both the pilot-in-command's first altimeter and the co-pilot's altimeter should have been set at the QFE."}