{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-60-duke-loveland-1-killed", "date": "May 15, 2019 at 1248 LT", "type": "Beechcraft 60 Duke", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Broomfield – Loveland", "msn": "P-79", "yom": 1969, "flight_number": null, "city": "Loveland", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7000, "captain_hours_type": 100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3119, "circumstances": "The commercial pilot was relocating the multiengine airplane following the completion of an extensive avionics upgrade, which also included the installation of new fuel flow transducers. As the pilot neared the destination airport, he reported over the common traffic advisory frequency that he had \"an engine out [and] smoke in the cockpit.\" Witnesses observed and airport surveillance video showed fire emanating from the airplane's right wing. As the airplane turned towards the runway, it entered a rightrolling descent and impacted the ground near the airport's perimeter fence. The right propeller was found feathered. Examination of the right engine revealed evidence of a fire aft of the engine-driven fuel pump. The fuel pump was discolored by the fire. The fire sleeves on both the fuel pump inlet and outlet hoses were burned away. The fuel outlet hose from the fuel pump to the flow transducer was found loose. The reason the hose was loose was not determined. It is likely that pressurized fuel sprayed from the fuel pump outlet hose and was ignited by the hot turbocharger, which resulted in the inflight fire.", "probable_cause": "A loss of control due to an inflight right engine fire due to the loose fuel hose between the engine-driven fuel pump and the flow transducer."}