{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-donzeil-8-killed", "date": "Nov 7, 1996 at 1029 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Jetcom", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Geneva - Bordeaux", "msn": "421C-0217", "yom": 1976, "flight_number": null, "city": "Donzeil", "zone": "Creuse", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 7047, "captain_hours_type": 113, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2488, "circumstances": "The twin engine aircraft departed Geneva-Cointrin Airport at 0842LT on a charter flight to Bordeaux-Mérignac, carrying one pilot and seven passengers. At 0903LT, while cruising at an altitude of 20,000 feet, the pilot informed ATC about the failure of the right engine and was cleared to reduce his altitude and to divert to Limoges Airport. The pilot elected to restart the engine below FL100 but was unable to do so. Due to high drag, the aircraft continued to lose height and was unable to reach Limoges Airport. At 1029LT, the aircraft went out of control and crashed in an open field, bursting into flames. The wreckage was found near Donzeil, between Guéret and Aubusson, about 60 km northeast of Limoges. The aircraft was totally destroyed by impact forces and a post crash fire and all eight occupants were killed. \r\nPilot:\r\nJean-Claude Kaufmann.\r\nPassengers:\r\nJacques Faini, \r\nSerge Frochot, \r\nDidier Hostettler, \r\nÉtienne Moinat, \r\nJean-Claude Paccaud, \r\nMichel Rothen,\r\nJean-François Troger. ", "probable_cause": "It was determined that the accident was the consequence of an inappropriate management of the flight following jamming of the propeller in an intermediate position after the RH crankshaft rupture. The inappropriate management was due to:\r\n- The pilot's relative lack of experience on this aircraft type,\r\n- His false notions about the aircraft's performance and about the existence of a flight level to maintain level flight with an unfeathered propeller and an heavy aircraft,\r\n- A series of misjudged strategies to attempt to continue the flight then to land at Limoges when the aircraft's altitude no longer made this possible.\r\nThe lack of instructions relative to inspections by a reliable method for detection of cracks on crankshafts installed on GTSIO-520 engines was a contributory factor."}