{"url": "https://www.baaa-acro.com/crash/crash-vickers-803-viscount-wexford-61-killed", "date": "Mar 24, 1968 at 1058 LT", "type": "Vickers Viscount", "operator": "Aer%20Lingus-1", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Cork - London-Heathrow", "msn": "178", "yom": 1957, "flight_number": "EI712", "city": "Wexford", "zone": "Leinster", "country": "Ireland", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 57, "pax_fatalities": 57, "other_fatalities": 0, "total_fatalities": 61, "captain_hours": 6683, "captain_hours_type": 1679, "copilot_hours": 1139, "copilot_hours_type": 900, "aircraft_hours": 18806, "circumstances": "Viscount aeroplane type 803, registration: EI-AOM departed from Cork Airport at 10.32 hours en route for London operating as Aer Lingus Flight 712. The take-off was normal. The flight was cleared by Air Traffic Control to proceed via Airways Blue 10, Green 1 at flight level 170 (17,000'). At 10.38, when the aeroplane had passed through 7,000', clearance on course to Tuskar was given. At 10.40, after the flight had reported it was by Youghal at 7,500' climbing to 17,000', ATC Cork  suggested that if desired, the flight could route direct to Strumble. No direct acceptance of this suggestion was received. At 10.57.07 the flight reported \"by Bannow (a reporting point on the route at 51º 68' N - 06º 12' W) level 170 (17,000') estimating Strumble at 03\". The flight was instructed to change to the London Airways frequency of 131.2, and this was acknowledged by the reply \"131.2\". The time of this call was 10.57.29. At 10.58.02, London Radar intercepted a call (garbled and simultaneous with another call) which appeared to be, and was later confirmed as \"Echo India Alpha Oscar Mike with you\", and eight (8) seconds later, a call was intercepted which was interpreted as \"Five thousand feet descending spinning rapidly\". This call was also heard by another Aer Lingus aircraft en route Dublin-Bristol (The word \"Five\" was later, after repeated acoustic analysis, interpreted as more likely to be the word \"twelve\".) This was the last call received from the aircraft. At 11.10, London ATC advised Shannon ATC that they had no radio contact with EI-AOM. At 11.13 London advised Shannon that they had requested Aer Lingus Flight EI 362 (Dublin-Bristol) to search west of Strumble. This flight descended to 500' in good visibility, but saw nothing. Between 11.13 and 11.25, efforts were made to make radio contact with the flight, with no result, and at 11.25 a full alert was declared. At 12.36 a report from the U.K. was received by Haulbowline that wreckage had been sighted in position 51º 57' N, 06º 10' W Rosslare Lifeboat was proceeding, but two surface vessels within 4 nautical miles of this position saw nothing. At 12.52 hours the Air Corps reported that they had dispatched a Dove aeroplane and a helicopter to search. At 13.10 hours there were ten aircraft from the U.K. in the search area. At 15.30 hours the reported sighting of wreckage was cancelled. Nothing positive was discovered on this day. On 25 March 1968, at 06.15 hours, the search was resumed by aircraft and ships from the U.K., and at 12.41 hours, wreckage was sighted and bodies recovered from a position 6 nautical miles north-east of Tuskar Rock. More floating wreckage was reported scattered for a further 6 nautical miles north-west of this point. The Irish Naval Service ship, L.E. Macha, which had been on patrol off the north-west coast, joined in the search on 26 March 1968, and took over duty as Search Controller. A total of 13 bodies was eventually recovered in the search during the next few days, together with a quantity of light floating wreckage-mostly cabin furnishings, and some baggage, seat cushions, and the wheels and inner cylinder from the port main landing gear. One additional body was recovered later. The position of the main wreckage remained obscure in spite of prolonged and diligent search by sonar equipped ships of the British Navy and trawling by Irish trawlers-\"Glendalough\" from Kilmore Quay and \"Cu na Mara\" of the Irish Fisheries Board (An Bord Iascaigh Mhara). Eventually, on 5 June 1968 \"Glendalough\" hauled in position 1.72 nautical miles from Tuskar Rock with Tuskar bearing 280º, in 39 fathoms and brought up a quantity of positively identifiable wreckage. The \"Cu na Mara\" in the same location also brought up wreckage. On the following day more wreckage was brought up by these trawlers, and divers from H.M.S. Reclaim confirmed a mass of wreckage \"like a scrap yard\" in this position. Subsequent salvage operations confirmed that a major portion of the aircraft at least was located here. Two eyewitnesses, one a sailor on a coastal vessel, who thought he had seen an aircraft crash into the sea but did not report it at the time, and another witness on shore, who saw a splash in the sea near the Tuskar Rock, gave the time as between 11.10 and 11.15. The position lines of these two witnesses approximately cross the location where the main wreckage was eventually found. The aircraft was totally demolished by violent impact with the sea. The bulk of the wreckage was found in 39 fathoms of water with all parts lying in close proximity. About 60-65% of the aircraft (by weight) was recovered, and included the major parts of three engines, a few parts of the fourth, and all four propellers, the almost complete primary structure of the wings from tip to tip, and the fin and rudder. None of the wreckage displayed any evidence of fire or explosion. No part of the tail planes or elevators were recovered, with the exception of small portions of the spring tab and trim tab. The recovered wreckage revealed extensive damage to the whole structure, which virtually disintegrated.", "probable_cause": "There is not enough evidence available on which to reach a conclusion of reasonable probability as to the initial cause of this accident. The probable cause of the final impact with the sea was impairment of the controllability of the aircraft in the fore and aft (pitching) plane. Speculation continued since the time of the accident, prompted by a hypothesis posed in the report, that the Viscount may have been initially upset by the possible presence of another airborne object, drone or missile in its vicinity at the time. On the 30th anniversary of the accident, following newspaper articles and television programmes focusing on the possible involvement of U.K ships and missile ranges on the Welsh Coast in the downing of the aircraft, it was decided that Irish and U.K. officials would review all files held relating to the accident to see if the cause of the accident could be established. It was a.o. concluded that \"the possibility of a cause other than a (near) collision with another airborne object being the initial cause of the upset ... does not appear to have been adequately examined in the 1970 Report.\" Following the review, in July 2000, the Irish Minister for Public Enterprise commissioned an independent study of the accident circumstances. The International Study Team published their findings in December 2001:\r\n- An initial event, which cannot be clearly identified, disturbed the air flow around the horizontal tail surfaces and the pitch control of the aircraft. In the light of what was observed by non-skilled people there was a strong indication that structural fatigue, flutter, corrosion or bird strike could have been involved,\r\n- It is possible that the sensitivity of the engine fuel control units to negative accelerations imposed during the initial upset, had an adverse effect on the subsequent flight path of the aircraft,\r\n- The severe manoeuvres of the aircraft following the initial upset and the subsequent flight would have been outside the airworthiness certification envelope and may have resulted in some deformation of the structure,\r\n- A number of possible causes for an impairment of pitch control were examined and it is considered very possible that excessive spring tab free play resulted in the fatigue failure of a component in the tab operating mechanism thus inducing a tailplane-elevator tab free flutter condition,\r\n- The loads induced by the flutter condition would be of sufficient magnitude and frequency to cause a fatigue failure of the port tailplane within the timescale estimated for EI-AOM,\r\n- There was no involvement of any other aircraft or missile."}