{"url": "https://www.baaa-acro.com/crash/crash-airbus-a310-308-near-mezhdurechensk-75-killed", "date": "Mar 23, 1994 at 0057 LT", "type": "Airbus A310", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Moscow - Hong Kong", "msn": "596", "yom": 1991, "flight_number": "SU593", "city": "Mezhdurechensk", "zone": "Kemerovo oblast", "country": "Russia", "region": "Asia", "crew_on_board": 12, "crew_fatalities": 12, "pax_on_board": 63, "pax_fatalities": 63, "other_fatalities": 0, "total_fatalities": 75, "captain_hours": 9675, "captain_hours_type": 38, "copilot_hours": 5855, "copilot_hours_type": 440, "aircraft_hours": 5375, "circumstances": "While cruising by night at the assigned altitude of 10,100 metres, approaching the Novokuznetsk reporting point, the captain's daughter entered the cockpit. She was allowed to sit the left-hand seat while the captain demonstrated some autopilot features, using HDG/S and NAV submodes to alter the heading. The captain's son then took the left front seat. The captain intended to demonstrate the same manoeuvre when his son asked if he could turn the control wheel. He then turned the wheel slightly (applying a force of between 8-10 kg) and held it in that position for a few seconds before returning the wheel to the neutral position. The captain then demonstrated the same features as he did to his daughter and ended by using the NAV submode to bring the aircraft back on course. As the autopilot attempted to level the aircraft at its programmed heading, it came in conflict with the inputs from the control wheel which was blocked in a neutral position. Forces on the control wheel increased to 12-13 kg until the torque limiter activated by disconnecting the autopilot servo from the aileron control linkage. The autopilot remained engaged however. The aircraft then started to bank to the right at 2,5° per second, reaching 45° when the autopilot wasn't able to maintain altitude. The A310 started buffeting, which caught the attention of the captain who told the copilot to take control while he was trying to regain his seat. The seat of the copilot was fully aft, so it took him an additional 2-3 seconds to get to the control wheel. The bank continued to 90°, the aircraft pitched up steeply with +4,8g accelerations, stalled and entered a spin. Two minutes and six seconds later the aircraft struck the ground. The aircraft disintegrated on impact and all 75 occupants were killed, among them 25 foreigners. ", "probable_cause": "The accident was caused by a stall, spin and impact with the ground resulting from a combination of the following factors:\r\n1. The decision by the PIC to allow an unqualified and unauthorized outsider (his son) to occupy his duty station and intervene in the flying of the aeroplane.\r\n2. The execution of demonstration manoeuvres that were not anticipated in the flight plan or flight situation, with the PIC operating the autopilot while not at his duty station.\r\n3. Application by the outsider and the co-pilot of control forces that interfered with the functioning of the roll channel of the autopilot (and are not recommended in the A310 flight manual), thus overriding the autopilot and disconnecting it from the aileron control linkage.\r\n4. The copilot and PIC failed to detect the fact that the autopilot had become disconnected from the aileron control linkage, probably because:\r\n- The A310 instrumentation has no declutch warning. The provision of signals in accordance with the requirements of Airworthiness Standard NLGS-3, para. 8.2.7.3., and international recommended practices, could have enabled the crew to detect the disengaged autopilot in a timely manner.\r\n- The copilot and PIC may have been unaware of the peculiarities of the declutching function and the actions to be taken in such a situation because of a lack of appropriate information in the flight manual and crew training programme;\r\n- It was difficult for the co-pilot to detect the disengagement of the autopilot by feel, either because of the small forces on his control column or because he took changing forces to be the result of Eldar's actions;\r\n- The PIC was away from his position and distracted by the conversation with his daughter.\r\n5. A slight, unintentional further turn of the control wheel(s) following disengagement of the autopilot caused a right roll to develop.\r\n6. The PIC and copilot failed to detect the excessive right bank angle, which exceeded operating limits, and were late in re-entering the aircraft control loop because their attention was focussed on determining why the aircraft had banked to the right, a manoeuvre they interpreted as entry into a holding area with either no course line or with a new (false) course line generated on the navigational display.\r\nA strong signal indicating that the aeroplane had exceeded the allowable operating bank angle, taking account of the delay in recognizing and assessing the situation and making a decision, could in this situation have attracted the crew's attention and enabled them to detect the bank at an earlier stage.\r\n7. The aeroplane was subjected to buffeting and high angles of attack because the autopilot continued to perform its height-keeping function even after the actuator declutched and as the right roll developed, until the pilot disconnected it by overriding its longitudinal channel.\r\n8. Inappropriate and ineffective action on the part of the copilot, who failed to disconnect the autopilot and to push the control column forward when the buffeting occurred and the aeroplane entered an unusual attitude (high angles of attack and pitch). These actions, which caused the aeroplane to stall and spin, could have resulted from:\r\n- the presence of an outsider in the left-hand pilot's seat and the resulting delay before the PIC re-entered the aeroplane control loop;\r\n- the less-than-optimum working posture of the copilot, whose seat was pushed back to its rearmost position;\r\n- the occurrence, 2 seconds following the onset of buffeting, of an unintentional pitching up of the aeroplane, which sharply increased the angle of attack and reduced lateral controllability;\r\n- unpreparedness of the crew to act in this situation because of lack of appropriate drills in the training programme;\r\n- temporary loss of spatial orientation in night conditions."}