{"url": "https://www.baaa-acro.com/crash/crash-cessna-207a-skywagon-manokotak", "date": "Dec 17, 1998 at 1740 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Yute%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Dillingham – Togiak – Manokotak – Togiak – Dillingham", "msn": "207-0364", "yom": 1976, "flight_number": "UYA611", "city": "Manokotak", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1600, "captain_hours_type": 700, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7283, "circumstances": "The certificated commercial pilot and the pilot-rated, nonrevenue passenger, departed at night from a remote village airport on the last leg of a VFR scheduled air taxi flight. The destination airport was 17 nautical miles northeast of the departure point. After departure, the pilot said he encountered severe turbulence and entered a snow squall where the visibility dropped below 1 mile. The pilot said he was in instrument meteorological conditions, and a strong surface wind was blowing the airplane toward the southwest. He began correcting his course toward the southeast, and then collided with a snow-covered hill. The passenger said that light snow showers were falling in the area, along with turbulence and strong winds from the northeast. After departing on the accident flight, snow showers intensified, and the pilot turned toward the south, away from the intended destination. About 10 minutes after takeoff, the passenger inquired about the direction of flight, and the pilot said he was going to head to the coast and follow it to the destination. The visibility was about 1 mile. No ground features were visible until the passenger saw snow-covered terrain about 3 feet below the airplane. The airplane then collided with terrain. The pilot indicated he obtained a weather briefing from an FAA Flight Service Station. ", "probable_cause": "The pilot's continued VFR flight into instrument meteorological conditions. Factors in the accident were dark night conditions, snow covered terrain, and low ceilings. "}