{"url": "https://www.baaa-acro.com/crash/crash-waco-uic-mont-leveque-4-killed", "date": "Jan 19, 1937 at 1445 LT", "type": "Waco UIC", "operator": "M. A. G. van der Leeuw", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Paris – Rotterdam", "msn": "3790", "yom": 1933, "flight_number": null, "city": "Mont-l’Évêque", "zone": "Oise", "country": "France", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The single engine airplane departed Paris-Le Bourget Airport at 1415LT on a flight to Rotterdam with two passengers and two crew members on board. Thirty minutes into the flight, while cruising at an altitude of 300 metres, the aircraft rolled to the left, entered a dive and crashed in a swampy area located in Mont-l'Evêque, east of Senlis. All four occupants were killed. The crew was repatriating the aircraft to The Netherlands as his owner, Mr. M. A. G. van der Leeuw, died in another Waco crash near Rotterdam 3 December 1936.\r\nCrew:\r\nJoachim Tissot, pilot,\r\nAlbertus Sommer, pilot.\r\nPassengers: \r\nAdriamis Hoertens,\r\nJacob Maltha.", "probable_cause": "The accident is attributable to an in-flight breakup of the left airframe following, it seems, a resource following either a spin or a spiral and nose-down descent. The pilot who, at a given moment was in the clouds, would thus have, for a cause that the commission could not specify, lost the control of the plane. The aircraft would then have entered a spin or a steep dive and the pilot would have pulled it up sharply in sight of the ground, coming out of the clouds. It should be noted that the maximum load of 1'540 kilos indicated on the certificate of airworthiness was largely reached and that the speed of the aircraft must, at the time it was righted, have been very close to the speed limit of 300 km/h and that it could not, under these conditions, resist the acceleration due to a brutal resource."}