{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-81-gottrora", "date": "Dec 27, 1991 at 0851 LT", "type": "McDonnell Douglas MD-81", "operator": "SAS.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Stockholm - Copenhagen - Warsaw", "msn": "53003", "yom": 1991, "flight_number": "SK751", "city": "Gottröra", "zone": "Uppland", "country": "Sweden", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 123, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8020, "captain_hours_type": 590, "copilot_hours": 3015, "copilot_hours_type": 76, "aircraft_hours": 1608, "circumstances": "The MD-81 arrived from Zurich at 22:09 and was parked at gate 2 overnight with temperatures of around +1 deg. C. Approx. 2550 kg of fuel remained in each wing tank. The aircraft was scheduled to leave Stockholm for Copenhagen at 08:30 and the temperature had dropped to -0 deg C in the early morning. During the night and in the early morning clear ice had formed on the upper side of the wings, but this was not detected by the ground crew member who checked the forward part of the wing. The aircraft was fuelled with 1400 kg of fuel and was ready for de-icing at 08:30, which was done using 850l of Type I fluid. After de-icing the mechanic didn't check whether there was any clear ice on the upper side of the wings, since he had previously found none. The flight was then cleared to taxi to runway 08 and the aircraft took off at 08:47. After 25 seconds (at 1124 feet height) bangs, vibrations and jerks were perceived in the aircraft. This was caused by a no. 2 engine surge. The engine was throttled down a little, but throttle control simultaneously changed to an automatic mode which increased throttle setting with altitude (Automatic Thrust Restoration - ATR). This in turn increased the intensity of the surging. The no. 1 engine surged 39 seconds later, but this was not noticed by the flight crew. An attempt to switch on the autopilot at 2616 feet failed. At 76 resp. 78 seconds into the flight both the no. 2 and no. 1 engine failed after breakup of the stage 1 stators of both engines (initiated by high loads from the surges). The aircraft was climbing through 3206 feet at that moment with a 196 KIAS. A no. 1 engine fire warning at 91 seconds into the flight made the crew activate the fire extinguishing system. A SAS captain traveling the passenger cabin realized that there were problems and hurried to the cockpit to assist the flight crew. The aircraft was in a gliding left turn at that moment. When descending through 420 m, still in the clouds, the assisting captain gradually extended the flaps. The flaps were fully extended at 1100 feet (340 m) and the plane broke through the clouds at 980-820 feet. A field in the direction of flight was chosen for an emergency landing. The wheels were selected down and Stockholm control was informed about the imminent crash-landing. The MD-81 contacted trees at 121 knots and a major portion of the right wing broke off. The plane then struck sloping ground tail-first and slid along the ground for 110 m. The fuselage was broken into three pieces, but there was no fire.", "probable_cause": "The accident was caused by SAS' instructions and routines being inadequate to ensure that clear ice was removed from the wings of the aircraft prior to takeoff. Hence the aircraft took off with clear ice on the wings. In connection with lift-off, the clear ice loosened and was ingested by the engines. The ice caused damage to the engine fan stages, which led to engine surges. The surges destroyed the engines. Contributory causes were: The pilots were not trained to identify and eliminate engine surging; ATR-which was unknown within SAS - was activated and increased the engine power without the pilot's knowledge."}