{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-200-coventry-5-killed", "date": "Dec 21, 1994 at 0953 LT", "type": "Boeing 737-200", "operator": "Air%20Alg%C3%A9rie", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Algiers - Amsterdam - Coventry", "msn": "20758", "yom": 1973, "flight_number": "AH702P", "city": "Coventry", "zone": "West Midlands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 10686, "captain_hours_type": 2187, "copilot_hours": 2858, "copilot_hours_type": 2055, "aircraft_hours": 45633, "circumstances": "The Boeing 737, named \"Oasis\" was owned and operated by Air Algerie and had been leased by Phoenix Aviation in order to operate a series of live animal export flights from the UK to France and the Netherlands. On December 21, at 06:42 the plane departed from Amsterdam for a flight to Coventry. Weather at Coventry worsened and when arriving near Coventry, the RVR for runway 23 was 700 metres. The aircraft was not able to receive the Coventry runway 23 ILS as its dual navigation receiver system was not to an updated 40 channel ILS standard, so an SRA approach was flown. The radar guidance was completed at 0,5 miles from touchdown; the commander decided to discontinue the approach and execute a go-around. A holding pattern was then taken up at 07:44. When holding, the RVR further reduced to 600 m and the flight diverted to East Midlands to wait on the ground for weather improvement. The aircraft landed there at 08:08. At around 09:00 weather conditions improved to 1200 m visibility and an overcast cloud base at 600 feet. The flight departed East Midlands at 09:38 and climbed to FL40. Approaching Coventry, the crew received radar vectors for a runway 23 approach. After some initial confusion about the heading (the controller wanted the crew to turn left for 010°, while the crew understood 100°) the turn was continued to 260° and the SRA approach started at 12 miles from touchdown. The aircraft descended below the Minimum Descent Height (MDH) for the approach procedure and collided with an 86 feet high (291 feet ams) electricity transmission tower (pylon) which was situated on the extended centreline of the runway, some 1.1 miles from the threshold. The collision caused major damage to the inboard high lift devices on the left wing and the left engine. The consequent loss of lift on the left wing and the thrust asymmetry, caused the aircraft to roll uncontrollably to the left. When passing through a wings vertical attitude, the left wingtip impacted the gable end of a house. The aircraft continued rolling to an inverted attitude and impacted the ground in an area of woodland close to the edge of the housing conurbation. An intense fire ensued.", "probable_cause": "The following factors were reported:\r\n- The flight crew allowed the aircraft to descend significantly below the normal approach glide path during a Surveillance Radar Approach to runway 23 at Coventry Airport, in conditions of patchy lifting fog. The descent was continued below the promulgated Minimum Descent Height without the appropriate visual reference to the approach lighting or the runway threshold.\r\n- The standard company operating procedure of cross-checking altimeter height indications during the approach was not observed and the appropriate Minimum Descent Height was not called by the non handling pilot.\r\n- The performance of the flight crew was impaired by the effects of tiredness, having completed over 10 hours of flight duty through the night during five flight sectors which included a total of six approaches to land."}