{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-15-dk-gustavus-4-killed", "date": "Nov 23, 1957 at 2000 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Air%20National%20Guard", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Francisco – McChord – Annette Island – Anchorage", "msn": "15219/26664", "yom": 1944, "flight_number": null, "city": "Gustavus", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The morning of the crash, the crew departed from McChord Air Force Base near Tacoma, Washington, where they had picked up “hitchhiker” Corporal Timmons and then flew northward. Radio difficulties developed necessitating a return to McChord. Soon remedied, they departed once more for their first fuel stop, Annette Island, near Ketchikan, Alaska, enroute to their final destination, Anchorage, Alaska. High winds and severe turbulence prevented them from landing at Annette Island. The crew was given a choice – either return to a Canadian airport behind them or proceed north to Gustavus where runway lights and equipment for instrument landings offered better facilities for night landings than even Juneau in those days. The weather in Gustavus was reported as “clear and no winds” to “very slight winds”. The crew elected to go to Gustavus. Although the California pilot was well-trained in multi-engine instrument approaches, he was relatively new to Alaskan conditions. As the plane approached Gustavus, it was dark and beginning to snow. The passengers on the plane realized they had arrived in the Gustavus area, momentarily spotting lights through the dark and snow as they anxiously looked out the windows. The fuel supply was very low, so there were no options of returning to Annette or proceeding to Anchorage. The captain was leery of making the standard instrument approach to Gustavus because it would have required him to fly well beyond the airfield, far out over Glacier Bay with an aircraft that was running precariously low on fuel. On the next attempt – now the third time over the airport area in what the locals described as a snow squall, Mr. Aase reported that, “The pilot was in line for the runway, but got a bit low and the right wing caught a tall tree that made the aircraft start to spin and (it) nosed into the ground. “The front of the plane was badly damaged.  At the same time the plane was twisting, the tail slowly lowered into the trees which cushioned it. It set down gently into the trees so that the fuselage from the wall aft was just about in perfect condition. So apparently, while attempting to keep the airfield in sight, he elected to circle and make a “short” visual approach to the runway. All four crew members were killed and the seven passengers were injured. \r\nCrew:\r\nCpt Robert E. Kafader,\r\n1st Lt Dennis V. Stamey,\r\nS/Sgt Floyd S. Porter,\r\nS/Sgt David A. Dial.\r\nPassengers:\r\nLloyd Timmons,\r\n2nd Lt Harry S. Aase,\r\nCpt Robert D. Ellis,\r\nW/O Richard J. Mueller,\r\nM/Sgt James E. O’Rourke,\r\n1st Lt Wallace J. Harrison,\r\n2nd Lt William W. Caldwell.\r\nSource and text by Rita Wilson via \r\nhttp://www.gustavushistory.org/articles/view.aspx?id=10000", "probable_cause": null}