{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-little-grand-rapids-4-killed", "date": "Dec 9, 1997 at 1526 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Sowind Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Winnipeg - Little Grand Rapids", "msn": "110-285", "yom": 1980, "flight_number": "4K301", "city": "Little Grand Rapids", "zone": "Manitoba", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 15, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 15000, "captain_hours_type": 114, "copilot_hours": 700, "copilot_hours_type": 367, "aircraft_hours": 13724, "circumstances": "The Sowind Air Ltd. Embraer EMB-110P1 Bandeirante aircraft departed the operator's base at St. Andrews, Manitoba, with a crew of 2 and 15 passengers, on a 40-minute, scheduled flight to Little Grand Rapids, Manitoba. The aircraft arrived at Little Grand Rapids, and the crew flew an instrument approach to the airport and executed a missed approach because the required visual reference was not established. A second instrument approach was attempted. Ground-based witnesses observed the aircraft very low over the lake to the south of the airport and to the east of the normal approach path. Passengers in the aircraft also reported being very low over the lake and to the east of the normal approach path. The passengers described an increase in engine power followed by a rapid series of steep banking manoeuvres after the aircraft crossed the shoreline to the southeast of the airport. During the manoeuvres, the aircraft descended into the trees and crashed approximately 400 feet south and 1 600 feet east of the approach to runway 36 at Little Grand Rapids. The captain and three passengers were fatally injured, and the first officer and the remaining 12 passengers were seriously injured.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. At the time of the occurrence, the base of the cloud at Little Grand Rapids was between 100 and 300 feet agl, with fog to the east of the airport, and the visibility was one to two miles.\r\n2. The aircraft was flown in marginal weather at low level, below the minimum en route altitude for commuter operations and below the MDA for the NDB A approach at Little Grand Rapids. The MDA for the approach was 1 560 feet asl, 555 feet above the airport elevation.\r\n3. While the aircraft was being manoeuvred at very low level in marginal weather, it descended after an abrupt turn, and flew, in controlled flight, into the terrain.\r\nOther Findings:\r\n1. At both take-off and landing, the aircraft was about 1 000 pounds heavier than the relevant maximum allowable weight.\r\n2. The GPS installed in C-GVRO was not approved as a primary navigational aid. The available information indicates that the flight crew used the GPS as a primary navigational aid during the last approach to Little Grand Rapids.\r\n3. The aircraft was not equipped with a GPWS, nor was it required to be by regulation.\r\n4. The weight and balance report that was submitted to Transport Canada, required for the importation of C-GVRO, contained numerous discrepancies; the report was not reviewed for accuracy by Transport Canada.\r\n5. The emergency locator transmitter (ELT) produced a very weak signal because the antenna cable had been installed with little slack, and it pulled out of the antenna fitting during impact.\r\n6. It could not be determined whether the presence of carbon monoxide and diphenhydramine in the captain's body affected his decision making and level of alertness.\r\n7. The company, which had been an air taxi operator, did not effectively manage either the addition of the more complex commuter operations or the introduction of the larger Bandeirante aircraft.\r\n8. The difficulty that the company had in the transition to commuter operations and in the introduction of the Bandeirante aircraft was underestimated by Transport Canada.\r\n9. There were inadequacies in TC=s oversight, whereby the post-certification audit of the company was not conducted, thus eliminating an important mechanism by which TC could have found, and addressed, the inadequate safety management practices, non-conformance with pilot training requirements, and related operating irregularities.\r\n10. The pilots had passed their flying proficiency and medical tests, but they had not completed elements of pilot training requirements with respect to servicing and operational control and right seat conversion as prescribed by TC. Also, no company pilot had received required training in the use of onboard survival or emergency equipment.\r\n11. There was no indication found of any pre-impact failure or malfunction of the airframe, flight controls, or engines.\r\n12. The aircraft was not equipped with either a CVR or an FDR; TC had given the company an exemption to operate without a CVR until 01 August 1998, and the aircraft was not required to be equipped with an FDR.\r\n13. The absence of recorders on this aircraft, which was configured to carry 20 people, left many of the otherwise ascertainable facts associated with the accident unknown and reduced the opportunity of uncovering risks to safety associated with the flight. \r\n14. Conditions were conducive to the pilot experiencing a false sensation that the aircraft was climbing (somatogravic illusion) after increasing the engine power, and he may have been manoeuvring to avoid an abandoned fire tower."}