{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-decatur", "date": "Mar 31, 2001 at 1215 LT", "type": "De Havilland DHC-3 Otter", "operator": "Bishop Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Decatur - Decatur", "msn": "115", "yom": 1956, "flight_number": null, "city": "Decatur", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 21, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 33000, "captain_hours_type": 169, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6633, "circumstances": "The pilot and 21 jumpers were aboard the airplane for the local skydiving flight. The airplane took off to the north on the wet grass runway. Jumpers reported that during the initial takeoff climb, the aircraft assumed a \"very steep angle of attack,\" and described the pilot \"winding the wheel on the lower right side of the chair clockwise, frantically,\" and \"busy with a wheel between the seats.\" The airplane impacted trees and terrain approximately 250 yards east of the runway. The pilot reported that the \"airplane flew through a dust devil\" and did not have enough altitude for a complete recovery. The pilot stated the winds were northerly at 6 to 8 knots with \"extreme\" turbulence. The nearest weather observation facility reported clear skies with calm wind. Takeoff weight and center of gravity (CG) were calculated at 9,118.05 lbs and 161.92 inches. The AFM listed the maximum gross weight at 8,000 pounds and the aft CG limit at 152.2 inches. Further, an AFM WARNING stated: C. G. POSITION OF THE LOADED AIRCRAFT MUST BE CHECKED AND VERIFIED PRIOR TO TAKE-OFF, AND APPROPRIATE TRIM SETTINGS SHOULD BE USED; OTHERWISE ABNORMAL STICK FORCES AND POSITIONS MAY RESULT. The elevator trim wheel is located on the righthand side of the pilot's seat. Post-accident examination of the airplane revealed that there were 16 seatbelts in the cabin section and 2 seatbelts in the cockpit. Additionally, a placard installed in the cockpit stated, in part, THIS AIRPLANE IS LIMITED TO THE OPERATION OF NINE PASSENGERS OR LESS. Regarding the discrepancy between the placarded 9 passenger limit and the 21 jumpers aboard, the pilot stated that parachute jumpers are not considered to be passengers and therefore, he did not have to comply with the placarded limit.", "probable_cause": "The pilot's failure to maintain aircraft control during the takeoff/initial climb. Contributing factors were the pilot's exceeding aircraft weight and balance limits and the dust devil."}