{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54e-5-do-skymaster-near-stephenville-39-killed", "date": "Oct 3, 1946 at 0503 LT", "type": "Douglas C-54 Skymaster", "operator": "American%20Overseas%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "New York – Gander – Shannon – London – Berlin", "msn": "27290", "yom": 1945, "flight_number": null, "city": "Stephenville", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 31, "pax_fatalities": 31, "other_fatalities": 0, "total_fatalities": 39, "captain_hours": 3926, "captain_hours_type": 1561, "copilot_hours": 1707, "copilot_hours_type": 805, "aircraft_hours": 3731, "circumstances": "The four engine aircraft left New York-La Guardia Airport at 1214LT bound for Berlin, Germany, with intermediate stops in Gander, Shannon and London. While descending over Newfoundland, the crew encountered poor weather conditions and was forced to divert to Stephenville-Ernest Harmon Airport where he landed at 1630LT. For operation reasons, the crew should have a 12 hours rest time and the next departure was then scheduled at 0445LT the following morning. By night, the crew started the takeoff roll from runway 07 and after rotation, continued straight ahead when few minutes later, at an altitude of 1,160 feet, the aircraft hit the slope of a mountain and crashed in a dense wooded area located 7 miles northeast of the airfield. The aircraft christened 'Flagship New England' disintegrated on impact and all 39 occupants were killed. At the time of accident, weather conditions were considered as good with a ceiling at 5,000 feet (overcast) and a visibility above 10 miles. \r\nCrew:\r\nWilliam A. Westerfield, pilot,\r\nRobert Beckman Lehr, copilot,\r\nJohn B. Tierney Jr., navigator, \r\nJames M. Barry, radio officer, \r\nMark Spelar, flight engineer, \r\nHerbert B. Ewing, purser, \r\nJerome Lewis, navigator, \r\nMargaret Ann Burleigh, stewardess.", "probable_cause": "It was determined that the pilot in command continued in a straight ahead direction after rotation instead of turning to the right to avoid the rising terrain. Unfortunately, it was not possible to ascertain the reason why the crew decided to follow such wrong procedure. In conclusion, on the basic of the foregoing, the Board determined that the probable cause of this accident was the action of the pilot in maintaining the direction of takeoff toward higher terrain over which adequate clearance could not be gained."}