{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-500b-bartlesville", "date": "Jan 13, 2012 at 1930 LT", "type": "Rockwell Aero Commander 500", "operator": "Central%20Air%20Southwest", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kansas City - Cushing", "msn": "500-1533-191", "yom": 1965, "flight_number": "CTL327", "city": "Bartlesville-Frank Phillips", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8487, "captain_hours_type": 3477, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was en route on a positioning flight when the airplane’s right engine surged and experienced a partial loss of power. He adjusted the power and fuel mixture controls; however, a few seconds later, the engine surged again. The pilot noted that the fuel flow gauge was below 90 pounds, so he turned the right fuel pump on. The pilot then felt a surge on the left engine, so he performed the same actions he as did for the right engine. He believed that he had some sort of fuel starvation problem. The pilot then turned to an alternate airport, at which time both engines lost total power. The airplane impacted trees and terrain about 1.5 miles from the airport. The left side fuel tank was breached during the accident; however, there was no indication of a fuel leak, and about a gallon of fuel was recovered from the airplane during the wreckage retrieval. The company’s route coordinator reported that prior to the accident flight, the pilot checked the fuel gauge and said the airplane had 120 gallons of fuel. A review of the airplane’s flight history revealed that, following the flight immediately before the accident flight, the airplane was left with approximately 50 gallons of fuel on board; there was no record of the airplane having been refueled after that flight. Another company pilot reported the airplane fuel gauge had a unique trait in that, after the airplane’s electrical power has been turned off, the gauge will rise 40 to 60 gallons before returning to zero. When the master switch was turned to the battery position during an examination of another airplane belonging to the operator, the fuel gauge indicated approximately 100 gallons of fuel; however, when the master switch was turned to the off position, the fuel quantity on the gauge rose to 120 gallons, before dropping off scale, past empty. Additionally, the fuel cap was removed and fuel could be seen in the tank, but there was no way to visually verify the quantity of fuel in the tank.\n", "probable_cause": "The total loss of engine power due to fuel exhaustion and the pilot’s inadequate preflight inspection, which did not correctly identify the airplane’s fuel quantity before departure."}