{"url": "https://www.baaa-acro.com/crash/crash-cessna-208-caravan-i-sheffield", "date": "Sep 15, 2009 at 1435 LT", "type": "Cessna 208A Caravan", "operator": "North%20American%20Flight%20Services", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Farmingdale - Saratoga Springs", "msn": "208-0001", "yom": 1985, "flight_number": null, "city": "Sheffield", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3100, "captain_hours_type": 25, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10182, "circumstances": "The pilot and the five passengers, who were employees of an industrial services company, were returning from a job site with hazardous materials used for blasting operations. The airplane was in a climb, at an altitude of 8,500 feet, when it experienced a catastrophic engine failure. The pilot declared an emergency and subsequently performed a forced landing to a field. During the landing, the airplane's right wing struck a tree and separated. All occupants exited the airplane without injury; however, the airplane became fully engulfed in fire, which consumed the majority of the airplane. The airplane was equipped with a turbine engine that, at the time of the accident, had been operated for about 7,620 hours since new and 65 hours since it was overhauled about 19 months prior to the accident. Impact damage was observed to the interior of the engine exhaust duct. In addition, the exhaust duct contained portions of a fractured power turbine blade. Additional examination of the engine revealed damage consistent with a distressed 1st stage sun gear, and associated compressor turbine and power turbine damage. Examination of the sun gear teeth output splines revealed that they were too damaged to determine the cause of their deterioration. It was noted that the sun gear found on the accident engine was previously removed from another engine due to \"spalled gear teeth\" about 7 years prior to the accident. The condition of the sun gear when installed on the accident engine could not be determined.", "probable_cause": "A total loss of engine power due to a failure of the 1st stage sun gear output splines for unknown reasons, which resulted in a power turbine overspeed condition, with subsequent blade distress/release."}