{"url": "https://www.baaa-acro.com/crash/ground-fire-swearingen-sa226at-merlin-iv-copenhagen", "date": "Nov 12, 1982 at 1811 LT", "type": "Swearingen SA226AT Merlin IV", "operator": "Danair", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Stauning - Copenhagen", "msn": "AT-015", "yom": 1974, "flight_number": "DX386", "city": "Copenhagen-Kastrup", "zone": "Hovedstaden", "country": "Denmark", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 13, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2395, "circumstances": "The aircraft was completing flight DX386 from Stauning to Copenhagen. It departed Stauning at 1724LT with 13 passengers and a crew of two on board. During approach to runway 22L at Kastrup Airport, the captain noticed a faint smell of burnt insulation and asked the copilot if he could smell anything \"hot\". The copilot who could not confirm the smell was asked by the captain to turn the cabin temperature - which was operated in manual mode - towards cold. The captain checked indication and warning systems for generators, batteries, circuit breakers and continued the approach. After a normal approach and landing at 18:07 hours the aircraft was cleared to the parking area via taxiway two and to change frequency to Apron Tower when clear of the runway. After contact with Apron Tower instructions were received for taxi to parking via taxiway two and inner perimeter but one minute later new instructions were received to taxi via runway three zero. While taxiing the left engine was shut down as is normal company procedure and taxiing continued on the right engine. Suddenly the captain noticed a flash outside the aircraft. The captain's first thought was that fire had started in the left engine or in the brakes and he brought the aircraft to a halt to investigate. Very shortly after a flash fire erupted in the left hand cockpit side console aft of and close to the captain's left leg. The crew made no radio transmissions about the fire since all electrical power was immediately turned off, in accordance with emergency procedure, after the aircraft was brought to a stop. The captain shouted towards the cabin: \"It is burning, out\". The passengers and crew then vacated the aircraft. The accident occurred at or about 18:11 hours on runway 30 during darkness. All 15 occupants escaped uninjured.", "probable_cause": "An intense fire had erupted in the aft end of the left hand cockpit side console/ originating from an electrical short to ground. Contributing to the intensity of the fire was escaping oxygen under 70 PSI pressure through a melted PVC oxygen tube."}