{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-near-invermere-3-killed", "date": "Oct 26, 2007 at 1912 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "New Century Airplane Sales", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Salem – Calgary", "msn": "46-08065", "yom": 1987, "flight_number": null, "city": "Invermere", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The privately operated Piper Malibu PA-46-310P was en route from Salem, Oregon, to Springbank, Alberta, on an instrument flight rules flight plan. During the descent through 17 000 feet at approximately 55 nautical miles (nm) southwest of Calgary, the pilot declared an emergency with the Edmonton Area Control Centre, indicating that the engine had failed. The pilot attempted an emergency landing at the Fairmont Hot Springs airport in British Columbia, but crashed at night at about 1912 mountain daylight time 11 nm east of Invermere, British Columbia, in wooded terrain. The pilot and two passengers were fatally injured. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. An unapproved part was installed in the alternator coupling. This resulted in debris from the coupling causing a partial blockage of oil flow to the number two connecting rod bearing. This low oil flow caused overheating and failure of the bearings, connecting rod cap bolts and nuts, and the subsequent engine failure. \r\n2. The engine failure occurred after sunset and the low-lighting conditions in the valley would have made selecting a suitable landing area difficult. \r\n3. The engine knocking was not reported to maintenance personnel which prevented an opportunity to discover the deteriorating engine condition.\r\nFinding as to Risk:\r\n1. All flights on the day of the accident were carried out without the oil filler cap in place. The absence of the oil filler cap could have resulted in the loss of engine oil. \r\nOther Findings:\r\n1. There were no current instrument flight rules charts or approach plates on board the aircraft for the intended flight.\r\n2. The Teledyne Continental Motors Service Bulletin M84-5 addressed only the 520 series engines and did not include other gear-driven alternator equipped engines."}