{"url": "https://www.baaa-acro.com/crash/crash-vickers-744-viscount-chicago", "date": "Feb 20, 1956 at 0811 LT", "type": "Vickers Viscount", "operator": "Capital-Airlines3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Detroit – Chicago", "msn": "90", "yom": 1955, "flight_number": "CA141", "city": "Chicago-Midway", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 38, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17752, "captain_hours_type": 610, "copilot_hours": 5539, "copilot_hours_type": 53, "aircraft_hours": 1541, "circumstances": "Capital Airlines flight 141 of February 20, 1956, originated at Willow Run Airport, Detroit, Michigan, and was a regularly scheduled flight to Chicago. The crew consisted of Captain Roger Harrison Taylor, First Officer George Richard Hanst and Stewardesses Jacqueline V. Sadowski and Gloria Galloway. Captain R. E. Gilliland, the fifth assigned crew member, was deadheading to Chicago and rode in the passenger cabin. Following a weather briefing, which included a review of en route and terminal weather forecasts, a VFR flight plan was filed. Departure from Detroit was at 0700. The gross takeoff weight of the air- craft was 54,701 pounds, which was below the specified limit; the load was distributed properly with respect to the center of gravity of the aircraft. The flight to the vicinity of Chicago was routine. Near Chicago Flight 141 reported to the Chicago tower that it was over the shoreline. The flight later reported passing Kedzie and was cleared to land on runway 31R. The flight was observed to make a right turn to final approach and appeared to descend in a normal manner until over the west side of Cicero Avenue (the eastern boundary of the airport) at an altitude of 25 to 50 feet above the ground. At this point the airplane appeared to decelerate and descend rapidly. The aircraft was further observed to strike the ground in a slightly nose-up attitude several hundred feet short of the threshold of threshold of the runway, and the top of the fuselage was seen to break open adjacent to the wing spar to fuselage attachment. As the aircraft proceeded down the runway the landing gear retracted and the aircraft then slid on its belly until it came to rest to the left of the runway, 1,626 feet beyond the point of initial impact. All occupants left the aircraft through emergency exits or the main cabin door. The fire department, having been called by tower personnel, arrived at the scene before all persons had evacuated the aircraft. However, there was no fire. The Chicago weather at 0720 was reported as: Sky clear, visibility 6 miles; smoke; wind north-northwest.", "probable_cause": "The Board determines that the probable cause of this accident was a malfunctioning of the propeller control switches which culminated in an abrupt loss of lift. The following findings were reported: \r\n- Three of the four landing gear actuated switches, which are located on the landing gear also struts and which effect operation of the propeller, were found to have been capable of malfunctioning by jamming, sticking, or freezing,\r\n- No periodic inspection for internal examination of these switches had been established by the company prior to the accident,\r\n- At least two of the tending gear actuated switches malfunctioned, making it possible for the 21-degree pitch stops to be withdrawn, and consequently ineffective,\r\n- The crew failed to see the 21-degree pitch warning light on, and, therefore, they did not actuate the emergency switch,\r\n- During the final stage of the approach at Chicago, the propellers moved to the ground fine pitch range,\r\n- When the first officer saw three of the 17-degree pitch warning lights come on, he advanced all four throttles quickly,\r\n- The rapid advance of the throttles caused the propeller governor control to move the propeller blades to the four-degree pitch position, thereby creating both propeller drag and loss of wing lift."}