{"url": "https://www.baaa-acro.com/crash/crash-antonov-26b-100-pasto", "date": "Aug 22, 2007 at 1510 LT", "type": "Antonov AN-26", "operator": "Selva%20Colombia2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cali – Villagarzón", "msn": "108 03", "yom": 1981, "flight_number": null, "city": "Pasto-Antonio Nariño", "zone": "Nariño", "country": "Colombia", "region": "South America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 50, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12243, "captain_hours_type": 1133, "copilot_hours": 822, "copilot_hours_type": 595, "aircraft_hours": 17124, "circumstances": "En route from Calí to Villagarzón, the crew contacted ATC and reported technical problems with the left engine. After being cleared to divert to Pasto-Antonio Nariño Airport, the crew modified his route and started the descent. On approach, the flaps were lowered at 38° and the speed was reduced to 250 km/h. After the gears were selected down, the speed increased to 270 km/h so full flaps was selected. After touchdown on runway 02 which is 2,312 metres long, the aircraft was unable to stop within the remaining distance. It overran, went down a 15 metres high embankment and came to rest, broken in two and with its left wing torn off. All 53 occupants were rescued, among them few were injured. ", "probable_cause": "      Taking into account that the operator failed to cooperate with the investigators by sending the necessary documentation on the the anti skid system, the braking system, as well as the propellers and did not manage the reading of the flight recorders; the available evidence establishes as POSSIBLE CAUSE the failure of one or some of the related systems above; in addition to the inadequate operation during the single-engine landing, which finally produced the departure of the aircraft at the end of the runway."}