{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-200-mt-battle-creek-1-killed", "date": "Jul 14, 1988 at 1140 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Kenn%20Borek%20Air-2_0", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Mountains", "schedule": "Redmond - John Day", "msn": "417", "yom": 1974, "flight_number": null, "city": "Mt Battle Creek", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The DHC-6 Twin Otter, C-GKBM, was under contract to the U.S. Forest Service. It was to be repositioned to John Day, OR to pick up passengers. At 11:35 PDT, the pilot checked in with John Day Dispatch and transmitted his expected time of arrival would be 12:15 PDT. About 11:40 the aircraft contacted three trees with the right wing at the 5,000-foot level of Battle Creek Mountain. This impact separated the wing into three sections before the aircraft \"exited\" over the mountain edge. The final impact site was on this ridgeline with the aircraft coming to final rest in a steep canyon to the east. There was a high mountain further east on the flight path that also needed to be crossed before a descent to John Day, Oregon could be commenced. The pilot's medical records indicated the he had been having medical problems, some of which he did not want brought to the attention of the Medical Doctor (MD) designated by the FAA to do flight physicals. In addition, he did not tell his supervisor that he was having medical problems. It was noted that he had complaints of chronic muscular neck pains, back problems, falling asleep, allergy problems, numbness in the top of his feet, feeling tired and run down, and pain in his legs. The flight track showed a gradual descent of about 400 feet per minute. He was off course to the right for about five minutes before impacting with trees. This flight tract strongly supported a very high probability of sleep-induced unconsciousness.", "probable_cause": "The most probable cause of this mishap was determined to be the pilot’s acute in-flight incapacitation due to sleep."}