{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-850-clermont-ferrand-3-killed", "date": "Aug 8, 2013 at 0940 LT", "type": "Socata TBM-850", "operator": "Aircraft%20Guaranty%20Corp%20Trustee", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Toussus-le-Noble - Clermont-Ferrand - Biarritz", "msn": "645", "yom": 2013, "flight_number": null, "city": "Clermont-Ferrand-Auvergne (Aulnat)", "zone": "Puy-de-Dôme", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 615, "captain_hours_type": 51, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On an ILS Z approach to Clermont-Ferrand-Auvergne Airport Runway 26 in IMC conditions, the pilot was instructed by ATC to climb to 6,000 feet to TIS VOR via a right turn because he failed to follow the published missed approach procedures. The single engine aircraft departed the approach path and control was lost after it completed several turns on climb and descent. It entered a high nose-down attitude and struck the ground at high speed about 6 km short of runway. The aircraft disintegrated on impact and all three occupants aged respectively 70, 73 and 76 years old were killed. They were completing an intermediate stop at Clermont-Ferrand Airport to pick up two additional passengers before continuing to Biarritz. ", "probable_cause": "The trace from the radar data shows that the aircraft followed the ILS Z 26 procedure track in the horizontal plane to about 6.4 NM from the runway threshold. This observation is consistent with the autopilot tracking of the ILS Z 26 procedure entered into the FMS in GPS mode. The transition from GPS to LOC occurred after the FAP. Although the APP mode was engaged, the aircraft did not descend as expected by the pilot. It continued in line with the localizer but in level flight at 4000 feet for more than 1 nm. The pilot attempted to catch up with the glide path from above. Unable to stabilize his course, he aborted the approach without following the prescribed go-around path or the heading and altitude instructions provided by the controller. He made a succession of left and right turns and climbs and descents. The track and readbacks show that he lost situational awareness. The airspeed regression following the last climb caused the pilot to lose control of the aircraft, which collided with the ground. The entire approach was flown with no outside visibility.\r\nContributing factors (may have contributed to the loss of control):\r\n- A coding error in the Garmin 1000 avionics suite database that prevented the automatic transition from GPS mode to LOC mode. Thus the automatic interception of the descent plan did not occur, which probably surprised the pilot and led him to resume manual piloting with excessive corrections.\r\n- The pilot's overconfidence in the aircraft's autopilot system.\r\n- Lack of knowledge of the conditions required for the aircraft autopilot system to capture and track the glide path.\r\n- Lack of consistency verification by the pilot between the coded procedure in the avionics suite and his breakthrough sheet.\r\n- The pilot's lack of total and recent instrument flight experience without external visual reference, which may have contributed to his increased stress, lack of availability, and spatial disorientation.\r\n- Sensory illusions that the pilot may have been confronted with, given the numerous changes in aircraft attitude, without external visual reference.\r\n- The acquisition of additional experience and skills with safety pilots after obtaining the SET class rating, which is ineffective and outside the regulatory training framework, which can lead pilots to free themselves from this support when it is considered to be restrictive."}