{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-monterey", "date": "Apr 14, 1999 at 1800 LT", "type": "Piper PA-31-310 Navajo", "operator": "Tokyo International Trading America", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Honolulu – Long Beach", "msn": "31-234", "yom": 1968, "flight_number": null, "city": "Monterey", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 427, "captain_hours_type": 42, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4882, "circumstances": "The pilot reported that about 150 miles southwest of Monterey, the right engine made unusual noises, began to run rough, and exhibited high cylinder head temperature at the limits of the gauge. He advised Oakland Center of his position and situation, but did not declare an emergency. The pilot attempted to open the right engine cowl flap; however, it malfunctioned. He then increased fuel flow to the right engine in order to cool it and eventually had to reduce power on that side to keep it running. To compensate for the power loss in the right engine, he had to add power to the left engine. The combination of remedial actions increased the fuel consumption beyond his planned fuel burn rate. The flight attitude required by the asymmetric power also induced a periodic unporting condition in the outboard fuel tank pickups. The pilot said he was forced to switch to the inboard tanks until that supply was exhausted and then attempted to feed from the outboard tanks. The pilot said he was unsuccessful in maintaining consistent engine power output and was forced to ditch 20 miles short of the coastline. The pilot's VFR flight plan indicated that the total time en route would be 13 hours 10 minutes and total fuel onboard was 14 hours. The lapsed time from departure until the aircraft ditching was approximately 13 hours 12 minutes. ", "probable_cause": "An undetermined system malfunction in the right engine, which led to an increase in fuel usage beyond the pilot's planned fuel consumption rate and eventual fuel supply exhaustion. "}