{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-port-blakely", "date": "Oct 1, 1999 at 1445 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Kenmore-Air", "flight_phase": "Flight", "flight_type": "Aerial photography", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Seattle - Seattle", "msn": "504", "yom": 1953, "flight_number": null, "city": "Port Blakely", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1829, "captain_hours_type": 240, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 30792, "circumstances": "The pilot-in-command (PIC) departed Lake Union seaplane base with four British Broadcasting Company passengers aboard the De Havilland DHC-2 'Beaver.' The passengers were engaged in aerial videography of an east/west geological fault line crossing from south Seattle through Blakely Harbor near the south end of Bainbridge Island. An onboard video recorder captured a voice instructing 'Keep as low as you can and slow as you can while we're doing this please... .' The PIC's first pass over the south end of Bainbridge Island was uneventful and the aircraft was maneuvered for a second pass. The PIC reported that approaching the upsloping, tree covered terrain he applied climb flaps and power but shortly thereafter realized the climb rate was less than he expected. He attempted a shallow left turn towards down sloping terrain and then leveled the wings as the aircraft descended into the treetops. The scenario was corroborated by two onboard video recordings. The pilot reported no powerplant or control system malfunction during the accident flight. He also reported encountering a downdraft condition over the tree covered terrain. Winds remained below 12 knots throughout the day at reporting stations near the accident site, and the video recordings showed no wind streaking and only sporadic whitecaps on the surface of Puget Sound during the transit from Seattle to the south end of Bainbridge Island. ", "probable_cause": "The pilot-in-command's failure to maintain adequate clearance from trees/terrain. Contributing factors were rising terrain and trees. "}