{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-3f9c-kiri-kasama-3-killed", "date": "Dec 19, 1994 at 1906 LT", "type": "Boeing 707", "operator": "Nigeria%20Airways-2", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Jeddah - Kano", "msn": "20669", "yom": 1972, "flight_number": "WT9805", "city": "Kiri Kasama", "zone": "Jigawa", "country": "Nigeria", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 31477, "circumstances": "The aircraft was on a cargo flight from Jeddah (JED) to Kano (KAN). The total cargo uplift was 35 tonnes packed in 13 pallets and some loose bundles of merchandise that were loaded in the lower cargo hold. The departure from Jeddah was delayed for thirteen hours because of problems starting the n°4 engine. The Boeing 707 departed at 13:48 UTC. As the aircraft approached N'Djamena at FL350, about 17:00 UTC, the flight engineer noted a strange smell in the cockpit. The ground engineer and the loadmaster who were sitting in the cargo compartment area of the aircraft confirmed that the smell had persisted for a while around them. It appeared that the area around pallet number 11 was misty. The pallet was sprayed with a fire extinguisher and the smoke evacuation procedure was carried out. This stopped the fumes temporarily. The aircraft was now halfway between N'Djamena and Kano with about 40 minutes flight time to go. At 18:00 the flight was cleared to descend. Then the Master Warning sounded, followed one minute later by a Fire Warning. Smoke entered the cabin. A descent was initiated with a descent rate close to 3,000 feet per minute. Later the pitch trims became ineffective before the aircraft crashed into marshland. Tire ground marks at the scene of the accident indicated that the aircraft must have descended very slowly into the elephant grass and may have somersaulted on contact with the water, then exploded and disintegrated along the wreckage trail. Both loadmasters were killed as well as one crew member. Both other occupants were injured. ", "probable_cause": "The probable cause of this accident was a heat generating substance that was hidden in a cargo of fabrics inside pallet n°11 in the cargo compartment of the aircraft. The heat that emanated from the pallet resulted in smoke that caused a major distraction in the cockpit and later caused an explosion which seriously impaired the flight controls of the aircraft."}