{"url": "https://www.baaa-acro.com/crash/crash-learjet-25c-lexington-1-killed", "date": "Aug 30, 2002 at 1307 LT", "type": "Learjet 25", "operator": "Care Flight International", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Marco Island - Lexington", "msn": "25-073", "yom": 1972, "flight_number": null, "city": "Lexington-Blue Grass", "zone": "Kentucky", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2681, "captain_hours_type": 436, "copilot_hours": 1363, "copilot_hours_type": 60, "aircraft_hours": 7514, "circumstances": "Shortly before landing, the crew confirmed that the hydraulic and emergency air pressures were \"good\", and that the circuit breakers on the \"right and left\" were in. In addition, the first officer reported \"arming one and two.\" The airplane landed 1,000 - 1,500 feet from the landing threshold of runway 04, which was 7,003 feet in length. The captain utilized aerodynamic braking during part of the landing roll. About 3 seconds after touchdown, the first officer stated, \"they're not deployed, they're armed only.\" About 6 seconds after touchdown, there was an increase in engine rpm. Shortly after that, there was an expletive from the captain. One and a half seconds later, there was another expletive. Slightly less than 2 seconds later, the captain told the first officer to \"brake me,\" and 2.7 seconds after that, stated \"emergency brake.\" About 4 seconds later, there was a \"clunk\", followed by a decrease in engine rpm 1 second later. Immediately after that, the captain stated, \"we're going off the end.\" The airplane subsequently dropped off an embankment at the end of the runway, impacted and descended through a localizer tower, then impacted the ground and slid across a highway. The airplane had been fitted with a conversion that included thrust reversers. An examination of the wreckage revealed that the thrust reversers were out of the stowed position, but not deployed. The drag chute was also not deployed. Brake calipers were tested with compressed air, and operated normally. Brake disc pads were measured, and found to be within limits. According to an excerpt from the conversion maintenance manual, reverser deployment was hydraulically actuated and electrically controlled. There was also an accumulator which allowed deploy/stow cycling in the event of hydraulic system failure. Interlocks were provided so that the reverser doors could not be deployed until the control panel ARM switch was on, the main throttle levers were in idle position, and the airplane was on the ground with the squat switches engaged. The previous crew reported no mechanical anomalies. Runway elevation rose by approximately 35 feet during the first 2/3 of its length, then decreased until it was 8 feet lower at its departure end. Winds were reported as being from 050 degrees true at 7 knots. At the airplane's projected landing weight, without the use of thrust reversers, the estimated landing distance was about 2,850 feet with the anti-skid operative, and 3,400 feet with the anti-skid inoperative. ", "probable_cause": "The captain's addition of forward thrust during the landing rollout, which resulted in a lack of braking effectiveness and a subsequent runway overrun. A factor was the captain's inability to deploy the thrust reversers for undetermined reasons."}