{"url": "https://www.baaa-acro.com/crash/ground-accident-boeing-737-3h4-nashville", "date": "Dec 15, 2015 at 1730 LT", "type": "Boeing 737-300", "operator": "Southwest-Airlines-2", "flight_phase": "Taxiing", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Houston – Nashville", "msn": "27719/2894", "yom": 1997, "flight_number": "WN031", "city": "Nashville-Intl", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 133, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 19186, "captain_hours_type": 14186, "copilot_hours": 15500, "copilot_hours_type": 5473, "aircraft_hours": 58630, "circumstances": "On December 15, 2015, at 5:23pm central standard time (CST), Southwest Airlines flight 31, a Boeing 737-300, N649SW, exited the taxiway while taxing to the gate and came to rest in a ditch at the Nashville International Airport (BNA), Nashville, Tennessee. Nine of the 138 passengers and crew onboard received minor injuries during the evacuation and the airplane was substantially damaged. The airplane was operating under the provisions of 14 Code of Federal Regulations Part 121 as a regularly scheduled passenger flight from William P. Hobby Airport (HOU), Houston, Texas. Weather was not a factor, light conditions were dark just after sunset. The airplane landed normally on runway 20R and exited at taxiway B2. The flight crew received and understood the taxi instructions to their assigned gate. As the crew proceeded along taxiway T3, the flight crew had difficulty locating taxiway T4 as the area was dark, and there was glare from the terminal lights ahead. The crew maneuvered the airplane along T3 and onto T4, and then turned back to the right on a general heading consistent with heading across the ramp toward the assigned gate. The flight crew could not see T4 or the grassy area because the taxiway lights were off and the glare from the terminal lights. As a result, the airplane left the pavement and came to rest in a drainage ditch resulting in substantial damage to airplane. The cabin crew initially attempted to keep the passengers seated, but after being unable to contact the flight crew due to the loud alarm on the flight deck, the cabin crew properly initiated and conducted an evacuation. As a result of past complaints regarding the brightness of the green taxiway centerline lights on taxiways H, J, L and T-6, BNA tower controllers routinely turned off the taxiway centerline lighting. Although the facility had not received any requests on the day of the accident, about 30 minutes prior to the event the tower controller in charge (CIC) turned off the centerline lights as a matter of routine. In doing so, the CIC inadvertently turned off the \"TWY J & Apron 2\" selector, which included the taxiway lights in the vicinity of the excursion. The airfield lighting panel screensaver feature prevented the tower controllers from having an immediate visual reference to the status of the airfield lighting.", "probable_cause": "The flight crew's early turn towards the assigned gate because taxiway lighting had been inadvertently turned off by the controller-in-charge which resulted in the airplane leaving the paved surface. Contributing to the accident was the operation of the screen-saver function on the lighting control panel that prevented the tower controllers from having an immediate visual reference\r\nto the status of the airfield lighting."}