{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-600-fort-chaffee-1-killed", "date": "Mar 1, 1991 at 1655 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "Lawrence R. Edwards", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Fort Smith – Vicksburg", "msn": "60-0045-100", "yom": 1970, "flight_number": null, "city": "Fort Chaffee", "zone": "Arkansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1800, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot of the multi-engine aircraft reported that his right engine was losing oil as he was climbing to cruise altitude. He secured the engine, feathered the propeller, and maneuvered to return to the airport. The pilot trimmed the aircraft for single engine operation and extended the main landing gear. During the approach, the operating left engine would not develop full power and the pilot reported to atc that he could not make the airport. The aircraft continued its emergency descent, impacted trees, and descended uncontrolled through a densely wooded area. A fuel tank ruptured during the uncontrolled descent through the trees and a fire/explosion occurred. The aircraft continued to burn after ground impact. Both engines were disassembled and numerous mechanical anomalies were found. They had been recently overhauled. This was the first flight of the aircraft since the engine overhauls. The pilot/owner was en route to sell the aircraft when the accident occurred. The pilot, sole on board, was killed. ", "probable_cause": "The pilot's operation of the aircraft with known deficiencies in equipment. Factors were the improper overhaul of the engines by other maintenance personnel resulting in oil loss, deteriorated engine performance, and unsuitable terrain."}