{"url": "https://www.baaa-acro.com/crash/crash-consolidated-pby-5a-catalina-raiatea-15-killed", "date": "Feb 19, 1958 at 1200 LT", "type": "Consolidated PBY Catalina", "operator": "RAI", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Papeete – Raiatea – Bora Bora", "msn": "296", "yom": 1941, "flight_number": null, "city": "Raiatea Island", "zone": "Windward Islands", "country": "French Polynesia", "region": "Oceania", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 23, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": null, "captain_hours_type": 36, "copilot_hours": 6600, "copilot_hours_type": 91, "aircraft_hours": 2277, "circumstances": "The approach to Raiatea lagoon was performed in good weather conditions with a grey ceiling (altostratus) and several fractocumulus at 400 meters, good visibility. No wind and no waves on the sea gaves a very calm lagoon. While completing a last turn to the right to align to the landing area (seaplane base), the right wing tip struck the water surface. The airplane cartwheeled and crashed into the sea about 1,400 meters short of landing point. Eleven passengers were injured while 15 other occupants, among them all three crew members, were killed. The airplane sank by a depth of 36 meters ten minutes later. ", "probable_cause": "The combination of an uniformly gray sky (altostratus clouds across the region and some fractocumulus at 400 meters), the absence of wind and the absence of lines on a gray and smooth lagoon created favorable conditions for an illusion and made it difficult to assess the exact height above the water level during the most difficult operation of the flight, the water landing. The evidence indicates that no maneuver was initiated to change the nose down attitude. The pilot did not see the water. Although there was no wind, the windsock had previously stopped in a position that prompted the pilot to land facing the NW which is used once in twenty at Raiatea. In addition, the sun , even through the altrostratus could be annoying; facing the NW, the pilot had the sun three quarter from the rear. Note that during the landing opposite the NW, the lap is necessarily right to avoid overflying the city and land. Vertical visibility of the first pilot during a right turn is poorer. Finally, the slight correction of alignment by the pilot resulted the right wing striking the water at too low altitude."}