{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b90-king-air-west-palm-beach-8-killed", "date": "Sep 3, 1999 at 0325 LT", "type": "Beechcraft 90 King Air", "operator": "CP Horizons Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Pontiac – Boca Raton", "msn": "LJ-493", "yom": 1970, "flight_number": null, "city": "West Palm Beach", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 11562, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8832, "circumstances": "At 0314, the pilot reported to the Air Traffic Control (ATC) Tower that he wanted to divert from his destination to land at a closer airport, and was cleared for a visual approach. At 0325, the pilot issued a \"Mayday.\" On final approach the airplane struck a building and wires about 1/2 mile short of the runway. Witnesses that saw the airplane just before impact said that the airplane was low, there was no in-flight fire, and the engine sounds \"...appeared to be a fluttering sound as if air [was] passing through the propeller.\" The pilot had filed for a cruise altitude of 15,000 feet, with a time en route of 5 hours, and fuel on board 6 hours. Weight and balance calculations showed that the pilot was operating about 722 pounds above the maximum gross weight for the takeoff, climb, and maximum cruise power settings. The Pilot Operating Handbook calculations showed that most of the fuel would have been used during the flight. The engine and propeller examinations revealed that both engines were not producing power at impact (windmilling). There were no discrepancies found with the engines or propellers. Examination of the propellers revealed that they were not in the feather position and they were not in beta/reverse position. Line personnel at the departure airport confirmed that all the tanks were topped off (282 gallons added). It took the flight 32 minutes to reach a cruise altitude of 15,000 feet, which calculated to about 293.3 pounds (1 gallon of Jet \"A\" equals 6.7 pounds), and a flight time of 4.9 hours from takeoff to impact. Sample calculations indicated that the fuel burn rate would have caused the airplane to use 2,649.3 pounds of Jet \"A\" turbine fuel during the flight. The flight departed with all tanks full 384 gallons usable (2,572.8 pounds), which calculates to insufficient fuel for the completion of the flight. Two gallons of fuel was drained from the right nacelle tank at the crash site, and there was no evidence of in-flight leakage. The sample calculations do not consider performance degradation for operating the airplane above the maximum allowable gross weight, which would cause the fuel consumption to go up because more power was required for the overweight conditions. The pilot's flight plan was for economy cruise, plus the airplane was over gross weight at takeoff, and there are no performance charts for that condition. So, the performance was even poorer than shown on the maximum power chart for climb and cruise. Calculations of the maximum allowable fuel that could be on board the aircraft showed that only 1851 pounds of turbine fuel could be carried to start the flight at the maximum allowable weight, or about 3.2 hours of flight. The en route winds aloft at the airplane's altitude indicated a slight tailwind for half the flight and a headwind of about 15 knots for the remainder of the flight.", "probable_cause": "A total loss of engine power due to fuel exhaustion. Contributing factors in this accident were the pilot's operation of the airplane in an overweight condition, inadequate pre-flight and inflight planning."}