{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-580-buena-vista", "date": "Jan 20, 1989 at 0925 LT", "type": "Convair CV-580", "operator": "Aspen%20Airways", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Denver - Durango", "msn": "336", "yom": 1968, "flight_number": null, "city": "Buena Vista", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 23, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 18644, "captain_hours_type": 6224, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 54108, "circumstances": "During flight, crew shut down the right engine when warning light for gearbox oil pressure illuminated and pressure was noted below minimum limit of 130 psi. Shortly after securing right engine, left engine lost power (fuel tank shutoff valve switch and fuel crossfeed valve switch were located near each other). Attempts to restart left engine were unsuccessful. With lack of alternative current electrical power, captain could not unfeather right engine for restart. During emergency landing, aircraft was damaged on uneven terrain. Operational check of right engine (at ground level) revealed no malfunction that would have prevented normal operation. Examination of left engine revealed turbine section had overheated and turbine blades had severe heat damage. Captain said that when he tried to restart left engine, fuel valves were in normal position and power lever was 1' above idle. He recalled an engine rpm of 8000, but didn't recall if he had used feather button to reduce rpm to 3000 (as directed by checklist). He verified fuel switches were 'on' and he tried to crossfeed fuel (in event of blockage). Cross feeding of fuel was not part of restart procedure. Flight manual cautioned about importance of reducing power to flight idle, to decrease fuel flow to engine and minimize possible overheating.", "probable_cause": "Inadvertent deactivation of fuel to the left engine as the pilot was making a precautionary shutdown of the right engine, and his failure to follow the emergency checklist procedure. Related factors were: low gearbox oil pressure (at flight altitude), and uneven terrain that was encountered during the emergency landing. \r\nOccurrence #1: loss of engine power (total) - nonmechanical\r\nPhase of operation: cruise - normal\r\nFindings\r\n1. 1 engine\r\n2. (f) lubricating system - pressure too low\r\n3. Propeller feathering - intentional\r\n----------\r\nOccurrence #2: loss of engine power (total) - nonmechanical\r\nPhase of operation: cruise\r\nFindings\r\n4. All engines\r\n5. (c) fuel supply - inadvertent deactivation - pilot in command\r\n----------\r\nOccurrence #3: forced landing\r\nPhase of operation: descent - emergency\r\nFindings\r\n6. (c) emergency procedure - improper - pilot in command\r\n7. (c) checklist - not followed - pilot in command\r\n----------\r\nOccurrence #4: on ground/water encounter with terrain/water\r\nPhase of operation: landing - roll\r\nFindings\r\n8. (f) terrain condition - rough/uneven"}