{"url": "https://www.baaa-acro.com/crash/crash-antonov-26-rostov-don-16-killed", "date": "Dec 23, 1982 at 2044 LT", "type": "Antonov AN-26", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sukhumi – Krasnodar – Rostov-on-Don – Krasnovodsk", "msn": "77305308", "yom": 1977, "flight_number": null, "city": "Rostov-on-Don", "zone": "Rostov oblast", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was completing a cargo flight from Sukhumi to Krasnovodsk with intermediate stops in Krasnodar and Rostov-on-Don, carrying 12 passengers (pilots and engineers), four crew members and a load of one ton of mandarins and Christmas trees. Upon departure from Rostov-on-Don Airport, weather conditions were poor due to the night and fog, reducing the vertical visibility to 60 meters and the horizontal visibility to 720 meters. Rotation was made after a course of 750 meters at a speed of 233 km/h. While climbing to a height of 170 meters, at a speed of 320 km/h, the captain requested the flaps to be raised when the aircraft lost height and initiated a descent with a positive acceleration of 1,5 G and with a rate of 5-7 meters per second. In a nose-down attitude and at a speed of 405 km/h, the airplane struck pine trees and crashed in a wooded area located 5 km from the airport, bursting into flames. The accident occurred one minute and 40 seconds after takeoff. The burned wreckage was found 1,180 meters to the left of the approach path. The aircraft was destroyed and all 16 occupants were killed. ", "probable_cause": "It was determined that the total weight of the aircraft at the time of the accident was 943 kilos above MTOW while the CofG was within limits. Investigations revealed serious shortcomings in the organization and preparation of the flight as well as the training of the various crew members."}