{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-850-fayetteville", "date": "Oct 5, 2014 at 1255 LT", "type": "Socata TBM-850", "operator": "TBM 850 536", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Atlanta – Pine Mountain", "msn": "536", "yom": 2010, "flight_number": null, "city": "Fayetteville", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4244, "captain_hours_type": 411, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 719, "circumstances": "The private pilot was conducting a personal cross-country flight. The pilot reported that, during cruise flight at 6,000 ft mean sea level, he observed a crew alerting system oil pressure message, followed by a total loss of engine power. An air traffic controller provided vectors to a local airport; however, the pilot reported that the airplane would not reach the runway. He did not attempt to restart the engine. He feathered the propeller and placed the power lever to \"idle\" and the condition lever to \"cut off.\" The pilot subsequently attempted a forced landing to a sports field with the gear and flaps retracted. The airplane collided with trees and the ground and then came to rest upright. Examination of the engine revealed that it displayed contact signatures to its internal components and evidence of ingested unburned organic debris, consistent with the engine likely being unpowered and the engine gas generator and power sections wind-milling at the time of impact. No evidence of any preimpact mechanical anomalies or malfunctions to any of the engine components was found that would have precluded normal operation. Recorded GPS flight track and systems data showed that the loss of engine power was preceded by about 5 minutes of flight on a constant heading and altitude with an excessive lateral g force of about 0.17 g and a bank angle between about 8 and 10 degrees, consistent with a side-slip flight condition. The airplane then entered a right turn with the autopilot engaged, and it lost power at the end of the turn. The data indicated that, even though the autopilot was engaged, the lateral g forces increased as the airplane leveled off and accelerated, indicating that the automatic rudder trim feature of the yaw damper system was not engaged. Given that the yaw damper system operated normally after the flight, it is likely that the pilot inadvertently and unknowingly disengaged the yaw damper during flight with the autopilot engaged. During a postaccident interview, the pilot stated that he was not aware of a side-slip condition before the loss of engine power. Although the fuel tank system was designed to prevent unporting of the fuel lines during momentary periods of uncoordinated flight, it was not intended to do so for extended periods of uncoordinated flight. Therefore, the fuel tank feed line likely unported during the prolonged uncoordinated flight, which resulted in the subsequent loss of engine power. If the pilot had recognized the side-slip condition, he could have returned to coordinated flight and prevented the engine power loss. Also, once the airplane returned to coordinated flight, an engine restart would have been possible.", "probable_cause": "The pilot's inadvertent deactivation of the yaw damper in flight, which resulted in a prolonged side-slip condition that led to fuel starvation and the eventual total loss of engine power. Contributing to the accident was the pilot's failure to attempt to restart the engine.\n"}