{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-21-near-cucuta-143-killed", "date": "Mar 17, 1988 at 1317 LT", "type": "Boeing 727-100", "operator": "Avianca-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Bucaramanga – Cúcuta – Cartagena – Barranquilla", "msn": "18999", "yom": 1966, "flight_number": "AV410", "city": "Cúcuta", "zone": "Norte de Santander", "country": "Colombia", "region": "South America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 136, "pax_fatalities": 136, "other_fatalities": 0, "total_fatalities": 143, "captain_hours": 9727, "captain_hours_type": 4050, "copilot_hours": null, "copilot_hours_type": 340, "aircraft_hours": 43848, "circumstances": "Avianca flight 410 was destroyed when it impacted El Espartillo Mountain after takeoff from Cúcuta Airport in Colombia. All 143 occupants sustained fatal injuries. The aircraft, a Boeing 727-21 operated flight AV410 from Bucaramanga to Barranquilla, with en route stops at Cúcuta and Cartagena. Because the originally planned aircraft was not available, HK-1716 was prepared for the flight. This resulted in a departure delay of 2 hours and 30 minutes. The flight landed at Cúcuta at 12:28 local time. At 13:06, the pilot requested clearance to start, but he was told there was a 10-minute delay because of three incoming aircraft. The crew immediately requested clearance for a climb on course (\"Why not clear us to climb on course to avoid delaying this flight further? We're: pretty far behind\") and the tower granted their request at 13:08: \"OK, cleared for engine start, climb on course VMC, report ready to taxi, temperature 28°\". This, added to the anomalous presence in the cockpit of another pilot whose loquaciousness continually disrupted the work of all the crew members, affected the way in which the pilot supervised the actions of his co-pilot, who was Pilot Flying. There was no crew briefing, nor did the pilot-in command give any instructions for the VMC departure. Two minutes later the tower controller instructed them to taxi to runway 33. At 13:12 the tower reported, \"Cleared to Cartagena via Uniform Whisky 19, Whisky 7, Whisky 10, climb and maintain two six zero after takeoff, climb on course VMC, QNH ....correction transponder Alpha 2216\". Take-off clearance was issued at 13:13. The initial climb path followed the extended runway centre line to the inner marker, at which point the aircraft entered a continuous left turn. At 13:17 the pilot said to the copilot, \"In any case, start turning right.\" Subsequently the aircraft struck the peak of El Espartillo at an elevation of 6,343 feet.", "probable_cause": "The accident was the consequence of the following active and passive factors: \r\n1. Active:\r\nA. Personnel factors - Pilot-in-command - Procedures, Regulations and instructions\r\na) Diverted attention from operation of aircraft and failed to exercise adequate and constant supervision over the performance of his co-pilot;\r\nb) Tolerated inappropriate interference with cockpit discipline by authorized persons with access to the flight deck;\r\nc) Continued VFR flight into IMC.\r\nB. Personnel factor - Non-crew pilot in cockpit - Procedures, regulations and instructions\r\nInterfered constantly with the normal operation of the aircraft, distracting the crew from the efficient execution of their duties.\r\n2. Passive\r\nA. Personnel factor- Crew- Procedures, regulations and instructions: lack of teamwork on the part of the crew, reflected in the failure to coordinate the instructions needed to take off and climb out in VMC using a profile established in accordance with the specific conditions.\r\nB. Other factors - Meeting the schedule: The delays resulting from the change of aircraft for mechanical reasons contributed to the decision by the pilot-in-command to give inappropriate support to company priorities and request to depart, rather than waiting as recommended by the Control Tower, in order to avoid adding to the delays already experienced.\""}