{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-560e-livingston-2-killed", "date": "Nov 20, 1982 at 1614 LT", "type": "Rockwell Aero Commander 560", "operator": "Alfred Wonesh", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Plain, Valley", "schedule": "Blairstown - Teterboro", "msn": "560-0744", "yom": 1959, "flight_number": null, "city": "Livingston", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 730, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Aero Commander 560E, N3827C (27C) was returning from Blairstown where it had been flown for minor maintenance. The pilot was on an IFR flight plan, cleared by New York tracon to proceed at 2,000 feet msl on a radar vector of 170° for an ILS approach to the Teterboro Airport. The aircraft was equipped with an altitude encoding transponder that was being used. The pilot was advised of numerous targets at his 12 o'clock position. At approximately the same time, Cessna 182Q, N96402 (402), was on a flight from the Kupper Airport to Ramapo Airport. A direct route between these airports would have intersected the nw edge of the New York TCA where positive control began between 1,800 and 7,000 feet msl. The pilot was proceeding VFR with no flight plan and was not in radio communication with any ATC facility. 402 was equipped with a transponder that was operating, but had no altitude encoding capability. As the aircraft converged, 402 was on a northeasterly heading. The planes collided about 1 mile inside the TCA. Then impacted the ground approximately 1,500 feet apart. A map was found in 402 with a line drawn between the airports and intersecting the TCA. All three occupants in both aircraft were killed. ", "probable_cause": "Occurrence #1: midair collision\r\nPhase of operation: approach\r\nFindings\r\n1. (f) air/ground communications - not attained - pilot of other aircraft\r\n2. (f) procedures/directives - not followed - pilot of other aircraft\r\n3. (f) traffic advisory - not obtained - pilot of other aircraft\r\n4. (f) unsafe/hazardous condition - not identified - ATC personnel (dep/apch)\r\n5. (c) visual lookout - inadequate - pilot in command\r\n6. (c) visual lookout - inadequate - pilot of other aircraft"}