{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-e20-lukla-3-killed", "date": "Apr 14, 2019 at 0907 LT", "type": "Let L-410", "operator": "Summit-Air-Nepal", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lukla - Manthali", "msn": "13 29 14", "yom": 2013, "flight_number": "GO802D", "city": "Lukla-Tenzing-Hillary", "zone": "Sagarmatha", "country": "Nepal", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 2, "total_fatalities": 3, "captain_hours": 15652, "captain_hours_type": 3558, "copilot_hours": 865, "copilot_hours_type": 636, "aircraft_hours": 4426, "circumstances": "On 14 April 2019, around 0322Hrs, Aircraft Industries' L410UPV-E20, registration 9NAMH, owned and operated by Summit Air Pvt. Ltd. met with an accident at Tenzing-Hillary Airport, Lukla when it veered right and excurred the runway during take-off roll from runway 24. The aircraft first collided with Manang Air's helicopter, AS350B3e, registration 9N-ALC, with its rotor blade running on idle power and then with Shree Airlines' helicopter, AS350B3e, registration 9N-ALK just outside the inner perimeter fence of the aerodrome into the helipad before coming to a stop. The PIC and Cabin Crew of 9N-AMH survived the accident, whereas the Co-pilot and one security personnel on ground were killed on the spot. One more security personnel succumbed to injury later in hospital during the course of treatment. 9N-AMH and 9N-ALC both were substantially damaged by impact forces. There was no post-crash fire. Prior to the accident the aircraft had completed 3 flights on Ramechhap-Lukla-Ramechhap sector. According to PIC, he was in the left seat as the pilot monitoring (PM) and the co-pilot, in the right seat was the pilot flying (PF). According to CCTV footages, the aircraft arrived at the apron from VNRC to VNLK at 0315Hrs and shut its LH engine. The PIC started the LH engine at about 0318 Hrs after unloading cargo and passengers. At 0322:30 Hrs, the PIC aligned the aircraft with the runway at the runway threshold 24 and then handed over the controls to the co-pilot for the take-off roll. The take-off roll commenced at 0322:50 Hrs. CCTV footage captured that within 3 seconds the aircraft veered right and made an excursion. The aircraft exited the runway and travelled about 42.8 ft across the grassy part on right side of runway 24, before striking the airport inner perimeter fence. It then continued to skid for about 43 ft, into the upper helipad, crashing into 9N-ALC. Eye witnesses statements, CCTV footages and initial examination of the wreckage showed that rotor blades of helicopter 9N-ALC were on idle when RH wing of the aircraft swept two security personnel (on ground) before slashing its rotor shaft. The moving rotors cut through the cockpit on the right side slaying the Co-pilot immediately. The helicopter toppled onto the lower helipad 6 ft below. The LH wing of the aircraft broke the skid of helicopter 9NALK and came to a halt with toppled 9N-ALC beneath its RH main wheel assembly. Due to 2impact, 9N-ALK shifted about 8 ft laterally and suffered minor damages. There was no post-crash fire. The PIC switched off the battery and came out of the aircraft through emergency exit along with the cabin crew. The captain of the helicopter 9N-ALC was rescued immediately. 9N-ALC's crew sustained a broken tail-bone whereas 9N-ALK's crew escaped without sustaining major injuries. All three deceased were Nepalese citizens. Aircraft 9N-AMH and helicopter 9N-ALC were substantially damaged while the helicopter 9N-ALK endured partial damages.", "probable_cause": "The commission concluded that the probable cause of the accident was aircraft's veering towards right during initial take-off roll as a result of asymmetric power due to abrupt shifting of right power lever rearwards and failure to abort the takeoff by crew. There were not enough evidences to determine the exact reason for abrupt shifting of the power lever.\r\nContributing Factors:\r\n1. Failure of the PF(being a less experienced co-pilot) to immediately assess and act upon the abrupt shifting of the right power lever resulted in aircraft veering to the right causing certain time lapse for PIC to take controls in order to initiate correction.\r\n2. PIC's attempted corrections of adding power could not correct the veering. Subsequently, application of brakes resulted in asymmetric braking due to the position of the pedals, and further contributed veering towards right."}