{"url": "https://www.baaa-acro.com/crash/crash-cessna-414a-chancellor-kahului-3-killed", "date": "Mar 8, 2006 at 1913 LT", "type": "Cessna 414 Chancellor", "operator": "Hawaii%20Air%20Ambulance", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Honolulu - Kahului", "msn": "414A-0113", "yom": 1978, "flight_number": null, "city": "Kahului", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3141, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8734, "circumstances": "The twin-engine medical transport airplane was on a positioning flight when the pilot reported a loss of power affecting one engine before impacting terrain 0.6 miles west of the approach end of the runway. The airplane was at 2,600 feet and in a shallow descent approximately 8 miles northwest of the airport when the pilot checked in with the tower and requested landing. Three and a half minutes later, the pilot reported that he had lost an engine and was in a righthand turn. Radar data indicated that the airplane was 2 miles southwest of the airport at 1,200 feet msl. The radar track continued to depict the airplane in a descent and in a right-hand turn, approximately 1.9 miles west of the approach end of the runway. The altitude fluctuated between 400 and 600 feet, the track turned right again, and stabilized on an approximate 100- degree magnetic heading, which put the airplane on a left base for the runway. The track entered a third right-hand turn at 500 feet. The pilot's last transmission indicated that one engine was not producing power. The last radar return was 6 seconds later at 200 feet, in the direct vicinity of where the wreckage was located. Using the radar track data, the average ground speed calculations showed a steady decrease from 134 knots at the time of the pilot's initial report of a problem, to 76 knots immediately before the airplane impacted terrain. The documented minimum controllable airspeed (VMC) for this airplane is 68 knots. The zero bank angle stall speed varied from 78 knots at a cruise configuration to 70 knots with the gear and flaps down. A sound spectrum study using recorded air traffic control communications concluded that one engine was operating at 2,630 rpm, and one engine was operating at 1,320 rpm. Propeller damage was consistent with the right engine operating at much higher power than the left engine at the time of impact, and both propellers were at or near the low pitch stops (not feathered). Examination and teardown of both engines did not reveal any evidence of mechanical malfunction. Investigators found that the landing gear was down and the flaps were fully deployed at impact. In this configuration, performance calculations showed that level flight was not possible with one engine inoperative, and that once the airspeed had decreased below minimum controllable airspeed (VMC), the airplane could stall, roll in the direction of the inoperative engine, and enter an uncontrolled descent. The pilot had been trained and had demonstrated a satisfactory ability to operate the airplane in slow flight and single engine landings. However, flight at minimum controllable airspeed with one engine inoperative was not practiced during training. The operator's training manual stated that during single engine training an objective was to ensure the pilot reduced drag; however, there was no procedure to accomplish this objective, and the ground training syllabus did not specifically address engine out airplane configuration performance as a dedicated topic of instruction. The operator's emergency procedures checklist and manufacturer's information manual clearly addressed the performance penalties of configuring the airplane with an inoperative engine, propeller unfeathered, the landing gear down, and/or the flaps deployed. The engine failure during flight procedure checklist and the engine  inoperative go-around checklist, if followed, configure the airplane for level single engine flight by feathering the propeller, raising the flaps, and retracting the landing gear.", "probable_cause": "The failure of the pilot to execute the published emergency procedures pertaining to configuring the airplane for single engine flight, which would have allowed him to maintain minimum controllable airspeed (VMC) and level flight. The pilot's failure to maintain minimum controllable airspeed (VMC) led to a stall and subsequent VMC roll at a low altitude. Contributing to the accident was the operator's inadequate pilot training in the single engine flight regime, and the loss of power from the left engine for undetermined reasons."}