{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-4-1009-philadelphia-7-killed", "date": "Jan 14, 1951 at 1413 LT", "type": "Douglas DC-4", "operator": "National-Airlines-4", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Newark – Philadelphia – Norfolk", "msn": "43102", "yom": 22, "flight_number": "NA083", "city": "Philadelphia", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 25, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 6723, "captain_hours_type": 191, "copilot_hours": 4214, "copilot_hours_type": 158, "aircraft_hours": null, "circumstances": "National Airlines’ Flight 83 departed Newark, New Jersey, at 1333, January 14, 1951, for Norfolk, Virginia, with a scheduled stop at Philadelphia. The crew consisted of Captain Howell C. Barwick, Copilot Edward J Zatarain, and Stewardess Mary Frances Housley. The aircraft’s total weight at takeoff was 58,601 pounds, which was within the allowable gross takeoff weight of 64,211 pounds, the load was properly distributed. Flight 83 was scheduled to leave Newark at 1300, but was delayed 33 minutes due to the replacement of a malfunctioning generator. The company flight clearance was filed at 1215 for the scheduled departure at 1300, and this clearance was also used for the delayed departure. Attached to it was the weather information for the flight, and a notice that the ILS (instrument landing system) glide path at Philadelphia was inoperative until further notice Immediately before taking off, the pilot requested and received from the tower the latest Philadelphia weather (reported on the 1328 CAA teletype sequence report and received at Newark after he boarded the aircraft), which was ceiling measured 1,000 feet, overcast, wind south-southwest at four miles per hour, and visibility 1 1/2 miles, with light snow and smoke Flight 83 was cleared by the New York Air Route Traffic Control to proceed to North Philadelphia range station via Amber Airway No 7, to maintain 4,000 feet, with Newark designated as the alternate airport. Thirteen minutes after takeoff, at 1346, Air Route Traffic Control issued the flight a new clearance to proceed to the Philadelphia ILS outer marker, to maintain 4,000 feet, and to contact Philadelphia Approach Control when passing the Northeast Philadelphia range station. At 1354 the flight reported over Northeast Philadelphia at 4,000 feet and was cleared by Approach Control to descend, crossing the Philadelphia range station at 3,000 feet, and to advise the tower when leaving the 4,000 and 3,000-foot levels. It was also advised that the altitude was unrestricted after passing the range station, and that it was cleared to make a straight-in approach to Runway 9 With the above clearance, local weather was given precipitation ceiling 500 feet, sky obscured, visibility 1, 1/4 miles, snow and smoke, and wind south-southwest two miles per hour. Following this clearance, the flight descended and reported over the Philadelphia range station at 3,000 feet, was again cleared for an approach to Runway 9, and was advised to report leaving thousand-foot levels. The flight acknowledged and reported leaving 3,000 feet at 1404, but no report of leaving 2,000 feet was received by Approach Control. According to the captain, they then proceeded to the outer marker and executed a procedure turn. At 1408 the flight reported over the outer marker, inbound, and stated that it was at 1,600 feet and descending. A clearance was immediately reissued to land on Runway 9, and the wind was given as south-southwest, three miles per hour. The flight was advised that the glide path was inoperative, that the frequency of the ILS localizer was 110 3 mc, that a 2,000-foot extension to the west end of the runway was under construction, and that braking action on Runway 9 was poor-to-fair. According to tower personnel this transmission was acknowledged. The crew, however, stated that they did not receive it. The flight continued its approach past the middle marker to the airport, and was first observed by ground witnesses beneath the overcast and directly over the intersection of Runways 4/22 and 9/27, located approximately 1,200 feet east of the threshold of Runway 9. Although the aircraft was first seen beneath the overcast and within the boundaries of the airport, the crew stated that they became contact at an altitude of approximately 500 feet, between the outer and middle markers. The aircraft was next seen to descend steeply, flare out for a landing in a normal manner, and float a considerable distance. After making contact with the runway the aircraft continued straight ahead, passed beyond the end of the runway, and crashed into a ditch at the east boundary of the airport. Fire immediately followed. Seven of the twenty-eight occupants did not evacuate the aircraft, and were fatally burned. The airport fire-fighting equipment was dispatched immediately to the scene, but efforts to extinguish the fire and rescue the remaining occupants were futile.", "probable_cause": "The Board determines that the probable cause of this accident was the captain’s error in judgment in landing the aircraft too far down the slippery runway instead of executing a missed approach procedure. The following contributory factors were found:\r\n- The runway was covered with wet snow and braking conditions were poor-to-fair,\r\n- The landing was made too far down the slippery runway to permit stopping within its limits."}