{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-20c-toledo-3-killed", "date": "Apr 8, 2003 at 1349 LT", "type": "Dassault Falcon 20", "operator": "Grand%20Aire_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Traverse City – Toledo", "msn": "147", "yom": 1968, "flight_number": "GAE183", "city": "Toledo-Express", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4829, "captain_hours_type": 1100, "copilot_hours": 4632, "copilot_hours_type": 16, "aircraft_hours": 19093, "circumstances": "The flight crew of the Fan Jet Falcon (DA-20) were practicing ILS approaches in instrument meteorological conditions with low clouds and rime ice. A first officer (FO) in training occupied the right seat, while the pilot-in-command (PIC), who was also the company chief pilot/check airman/designated flight instructor, occupied the left seat and was handling the radios. On the second approach, the airplane struck trees and burned, 1.57 nm from approach end of the runway. The landing gear was found extended, and the trailing edge and droop leading edge flaps were retracted. The wing and engine cowl anti-ice valves were found closed, consistent with it being off in the cockpit. Radar data revealed that on approach, the airspeed decreased from 188 knots to 141 knots at the outer marker, and continued to decrease down to 106 knots, when the airplane entered an abrupt descent and disappeared from radar. Simulator flights matched the radar profile with a flight idle approach, a power reduction inside the outer marker, and 1/4 inch of ice on the wings. In the simulator, the airplane stalled about 2 miles from the end of the runway with an airspeed of 103 kts. At flight idle, the engine power in the last 2 minutes of approach was below the recommended power setting for wing or engine anti-ice to be effective. Vref and stall speeds were computed to be 129 kts and 96 kts, with wing flaps and droop leading edges retracted. The PIC had about 1,100 hours in the make and model. The PIC did not have any documented previous flight instruction experience in make and model or any other multi-engine airplanes. The PIC had given 4 pilot proficiency checks in the DA-20 since receiving his check airman designation. The company Director of Operations reported that the accident FO was the first student the PIC had taken through the initial second-in-command course. The PIC and FO had received all of their turbojet experience with the operator.", "probable_cause": "The flight instructor's inadequate supervision of the flight, including his failure to maintain an approach airspeed consistent with the airplane's configuration, which resulted in an aerodynamic stall due to slow airspeed, and subsequent uncontrolled descent into trees. Factors were the icing conditions, the flight instructors failure to turn on the wing and engine  anti-ice, and his lack of experience as an instructor pilot in the airplane."}