{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-globe", "date": "Jul 22, 2005 at 0830 LT", "type": "Cessna 208B Grand Caravan", "operator": "Baltimore Air Transport", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Phoenix – Globe – Safford ", "msn": "208B-0863", "yom": 2000, "flight_number": null, "city": "Globe", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5545, "captain_hours_type": 203, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4461, "circumstances": "The airplane impacted a road and scrub brush during a forced landing, which was preceded by a total loss of engine power. According to the pilot, he heard a loud \"thunk\" during takeoff climb and noted a loss of engine power. He manipulated the power lever from the full forward position to the full aft position (\"stop-to-stop\") and noted he had no power. Post-accident examination of the Pratt & Whitney Canada PT6A -114A engine revealed that the compressor turbine (CT) vane's outer rim liberated a section of metal that damaged the turbine blades downstream. The area of liberated material from the CT vane outer rim was examined by the manufacturer's metallurgists. The fracture surface of the outer rim showed evidence of fatigue with signs of oxidation in some areas indicating the crack had been in existence for some time. The liberated material impact damaged the CT blades and resulted in a loss of power. Review of the operator's records revealed that the engine was approved for an extension beyond the normally recommended 3,600-hour overhaul period, to 5,100 hours. The engine had accumulated 4,461.3 hours at the time of the accident. In addition, the turbine section (hot section) had a recommended overhaul period of 1,800 hours; however, the operator instead elected to utilize an engine trend monitoring program in accordance with a manufacturer issued service bulletin. Many errors were noted with the operator's manually recorded data utilized for the trend monitoring. However, it is not likely that the engine trend data, even had it been correctly recorded and monitored, would have depicted the fatigue cracking in the CT vane outer rim. As a result, the manufacturer issued a service information letter (SIL) PT6A116 in January 27, 2003 (following a similar investigation), which reminded operators to conduct borescope inspections of the CT vane during routine fuel nozzle maintenance, as the manufacturer's maintenance manual recommended. Review of the maintenance record entries for the accident engine revealed no evidence that a borescope inspection had been conducted in conjunction with the fuel nozzle checks.", "probable_cause": "The fatigue failure of the compressor turbine stator vane, the liberation of vane material into the compressor turbine, and the total loss of engine power. Also causal was the operator's failure to inspect the compressor turbine vane during fuel nozzle checks."}