{"url": "https://www.baaa-acro.com/crash/crash-fokker-50-catania", "date": "Apr 30, 2016 at 1135 LT", "type": "Fokker 50", "operator": "Air-Vallee.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rimini – Catania", "msn": "20128", "yom": 1988, "flight_number": "RVL233", "city": "Catania", "zone": "Sicily", "country": "Italy", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 18, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6850, "captain_hours_type": 781, "copilot_hours": 2680, "copilot_hours_type": 10, "aircraft_hours": null, "circumstances": "On April 30, 2016, the aircraft Fokker F27 MK50 registration marks SE-LEZ, operating Air Vallee flight number RVL233, took off from Rimini airport at 06.48 hrs with 18 passengers and 3 crew on board. During the final approach to Catania airport, with the aircraft stabilized on ILS Z RWY 08, the crew noticed that the right and left main landing gear lights were green but the nose landing gear light was amber. The crew informed the ATS (Catania APP) that they were in contact with the problem and informed them of their intention to continue the approach to perform a low pass on the runway followed by a standard missed approach procedure, in order to request a visual verification from the control tower of the actual extension of the nose gear. During the low passage, the control tower informed the crew that the nose gear was not extended despite the opening of the nose gear compartment. After the passage, all lights, including the amber light of the nose landing gear, went off. The aircraft proceeded to the INDAX point to perform a holding at an altitude of 3000 feet as agreed with ATS during which the crew applied the abnormal procedures for nose gear unsafe down after selection and alternate down procedures. Both procedures were unsuccessful and the crew declared an \"emergency\" informing ATS of their intention to perform a final maneuver (leveled 2G turn). The captain of the flight, who had been PNF up to that moment, took the controls as PF and executed the turn: also in this case without any positive outcome. The crew informed ATS of the situation, stating the number of passengers, the amount of fuel on board and the absence of dangerous goods. The crew decided to follow a VOR procedure for RWY26 followed by a visual approach in order to make a last low passage to check the condition of the nose gear. After this second missed approach, the aircraft was instructed to perform an ILS procedure for RWY 08. Landing took place at 09:34 hrs with the main gear properly extracted and locked, the nose gear in \"up\" position and the doors open. The following is a sequence of pictures taken from a video of the accident, acquired by ANSV through the Catania airport operator, in which the aircraft is seen landing with the nose landing gear not extended and touching the ground only when it reached the speed necessary to sustain it in the absence of nose landing gear support. After completion of the landing run, with the aircraft remaining in the middle of the runway, the engines were shut down and passengers and crew disembarked without further incident. Some of the passengers were transferred to the airport emergency room and subsequently some of them were sent to hospital for further examination; no passenger was reported to have sustained injuries as a result of the event. ", "probable_cause": "The accident was caused by the failure of the nose landing gear (nose gear up) due to over-extension of the shock absorber which caused interference between the tires and the NLG compartment and locked the NLG in a retracted position. The over-extension was caused by the incorrect installation of some internal components of the shock absorber during the replacement of the internal seals the day before the accident.\r\nThe following factors contributed significantly to the improper activity conducted at maintenance:\r\n- the insufficient experience of technical personnel in carrying out the maintenance tasks conducted on the NLG;\r\n- the lack of controls on the operations carried out, deemed unnecessary by the CAMO engineering department;\r\n- the lack of definition of roles and tasks during the planning phase of the maintenance work;\r\n- the operational pressure on maintenance personnel, arising from the need to conclude maintenance operations quickly in order not to penalize the management of the aircraft;\r\n- the insufficient clarity and lack of sensitive information in the maintenance tasks and related figures contained in the AMM, regarding the replacement of internal shock absorber seals, subsequently made clearer by the manufacturer;\r\n- the reported black and white printing of the applied AMM procedures, which could have made the warnings in the manual barely legible."}