{"url": "https://www.baaa-acro.com/crash/crash-fokker-super-universal-tokyo-83-killed", "date": "Aug 24, 1938 at 0855 LT", "type": "Fokker Super Universal", "operator": "Japan%20Air%20Transport", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "City", "schedule": "Tokyo - Tokyo", "msn": "875", "yom": 1929, "flight_number": null, "city": "Tokyo", "zone": "Kantō", "country": "Japan", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 82, "total_fatalities": 85, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The single engine airplane departed Tokyo-Haneda Airport at 0850LT on a local training flight, carrying three crew members. Weather conditions were marginal with a limited visibility caused by fog. Five minutes after takeoff, while completing an approach to Haneda Airport, the airplane collided with a Mitsubishi Ki-1 (Hanriot HD-14) that was also completing a local training flight out from Tokyo-Haneda Airport. Registered J-BIDH and operated by the Japan Flying School, the aircraft was carrying two pilots, one student and one instructor. Following the collision, the Mitsubishi dove into the ground and crashed onto a house located in the district of Morigasaki. Out of control, the Fokker crashed on the factory of the Yamamoto Rush Manufacturing Company also located in the district of Morigasaki, less than 3 km northwest of Haneda Airport. Both pilots on board the Mitsubishi were killed. All three crew on board the Fokker were killed as well as 80 people on the ground, most of them employees of the YRMC and/or locals who wanted to take part to rescue operations. \r\nFokker crew:\r\nHaruo Tanaka, instructor, \r\nTadashi Sakai, student pilot, \r\nRyosaku Aoki, student pilot. \r\nMitsubishi crew:\r\nToshio Fujita, instructor, \r\nBunzo Ito, student pilot.", "probable_cause": "It was established that the collision occurred in a limited visibility due to fog in the area of the Haneda Airport. The crew of the Fokker was supposed to complete a touch and go manoeuvre but instead initiated a go around procedure when the collision occurred, probably after cutting the trajectory of the Mitsubishi."}