{"url": "https://www.baaa-acro.com/crash/crash-cessna-411-corona-1-killed", "date": "May 4, 2003 at 1453 LT", "type": "Cessna 411", "operator": "Roger L. Maino", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Corona – Santa Monica", "msn": "411-0202", "yom": 1966, "flight_number": null, "city": "Corona", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3901, "captain_hours_type": 412, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4915, "circumstances": "The pilot lost control of his twin engine airplane and collided with terrain while returning to the departure airport after reporting an engine problem. Shortly after takeoff, about 4,000 feet msl, the pilot reported to ATC that he had an engine problem and would return to the airport. The radar plot reveals a steady descent of the airplane from 4,000 feet msl to the accident site, approximately 2 miles from the designated airport. Ground witnesses reported that they saw the airplane flying very low, about 500 feet agl, seconds prior to the accident apparently heading toward the departure airport. The witnesses reported consistent observations of the airplane \"wobbling,\" then going into a steep knife-edge left bank before it dove into the ground. Witnesses at the airport said that the pilot sought out help in getting his radios operating prior to takeoff, telling the witness, \"it's been four and a half months since I've been in an airplane, I can't even figure out how to put the radios back in.\" No fueling records were found for the airplane at the departure airport. The last documented fueling of the airplane was on October 31, 2002, with the addition of 56.2 gallons. Witnesses reported that the airplane did not take on any fuel immediately prior to the flight on May 4th. The flight was the first flight since the airplane received its annual inspection 2 months prior to the accident, and, it was the pilot's first flight after 4 months of inactivity. It is a common practice for maintenance personnel to pull the landing light circuit breakers during maintenance to prevent the fuel transfer pumps, which are wired through the landing light system, from operating continuously. The fuel transfer pumps move fuel from the forward part of the main fuel tank to the center baffle area where it is picked up and routed to the engine. It is conceivable that these circuit breakers were not reset by the pilot for this flight. Wreckage examination revealed a post accident fire on the right wing of the airplane and no fire on the left wing. Additionally, only a small amount of fuel was identified around the left wing tanks after the accident, and no hydraulic deformation was observed to the left main tank or the internal baffles. The landing gear bellcrank indicates that the landing gear was in the down position. The engine and propeller post impact signatures indicate that the left engine was operating at a low power setting (wind milling), while the right engine and propeller indicate a high power setting. Disassembly and inspection of the internal propeller hub components showed that the left propeller was not feathered. The left engine is the critical engine and loss of power in that engine would make directional control more difficult at slower speeds. The airplane owners manual states that  \"climb or continued level flight at a moderate altitude is improbable with the landing gear extended or the propeller windmilling.\" The single engine flight procedure delineated in the manual dictates a higher than normal altitude for a successful single engine landing approach. ", "probable_cause": "The failure of the pilot to properly configure the airplane for a one engine inoperative condition (including his failure to feather the propeller of the affected engine, retract the landing gear, and maintain minimum single engine speed). Factors related to the accident were fuel starvation of the left engine, due to an inadequate fuel supply in the left tanks, inoperative fuel transfer pumps, and the pilot's decision to take off without fueling."}