{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-prototskiye", "date": "Aug 6, 2014 at 0715 LT", "type": "PZL-Mielec AN-2", "operator": "Yug Line", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Prototskiye - Prototskiye", "msn": "1G205-31", "yom": 1983, "flight_number": null, "city": "Prototskiye", "zone": "Krasnodar Krai", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7503, "circumstances": "The crew was engaged in a crop spraying mission on rice paddy field located in Prototskiye (Krasnoarmeisk district of the Krasnodar region). Two minutes after takeoff, while flying at a height of about 50 metres, the engine lost power. The captain attempted an emergency landing when the aircraft nosed over and came to rest upside down, some 2 km east of Prototskiye. Those parts of the fuselage which were above the water were consumed by the erupting fire and both pilots escaped uninjured. \n", "probable_cause": " The accident with An-2 RA-17890 aircraft was caused by its nosing-over during the emergency landing at the submerged rice bay. The emergency landing was due to the engine power loss in flight caused by the destruction of the can type combustor of the exhaust collector and burnout of the carburetor intake valve with the following high-temperature gases ingestion in the intake areas of the engine carburetor. The fatigue destruction of the can type combustor of the exhaust collector was caused along the main crack near the intake flex socket, it started from the surface of the damaged inlet port under the tube attachment pin towards the exhaust collector. By the moment of the main crack formation both inlet ports in left can type combustor under the tube attachment pin towards the exhaust collector had intolerable damage and size. During the last overhaul of the engine exhaust system of An-2 RA-17890 aircraft the left can type combustor had intolerable damage in its attaching lug to the exhaust collector which wasn't eliminated. The destruction of the inlet port valve was caused by the fusion of the boundaries of it material grains in conditions of acute temperature exposure induced by the destruction of the left can type combustor wall towards the main crack. Inadequate material (aluminum alloy D-16) of the valve specified by the drawing of aluminum allow AL-9T contributed to the valve destruction."}