{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-214-philadelphia", "date": "Mar 13, 2014 at 1822 LT", "type": "Airbus A320", "operator": "US%20Airways2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Philadelphia – Fort Lauderdale", "msn": "1141", "yom": 1999, "flight_number": "US1702", "city": "Philadelphia", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 149, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 23830, "captain_hours_type": 4457, "copilot_hours": 6713, "copilot_hours_type": 4457, "aircraft_hours": 44230, "circumstances": "Before pushback from the gate, the first officer, who was the pilot monitoring, initialized the flight management computer (FMC) and mistakenly entered the incorrect departure runway (27R instead of the assigned 27L). As the captain taxied onto runway 27L for departure, he noticed that the wrong runway was entered in the FMC. The captain asked the first officer to correct the runway entry in the FMC, which she completed about 27 seconds before the beginning of the takeoff roll; however, she did not enter the FLEX temperature (a reduced takeoff thrust setting) for the newly entered runway or upload the related V-speeds. As a result, the FMC's ability to execute a FLEX power takeoff was invalidated, and V-speeds did not appear on the primary flight display (PFD) or the multipurpose control display unit during the takeoff roll. According to the captain, once the airplane was cleared for takeoff on runway 27L, he set FLEX thrust with the thrust levers, and he felt that the performance and acceleration of the airplane on the takeoff roll was normal. About 2 seconds later, as the airplane reached about 56 knots indicated airspeed (KIAS), cockpit voice recorder (CVR) data indicate that the flight crew received a single level two caution chime and an electronic centralized aircraft monitoring (ECAM) message indicating that the thrust was not  set correctly. The first officer called \"engine thrust levers not set.\" According to the operator's pilot handbook, in response to an \"engine thrust levers not set\" ECAM message, the thrust levers should be moved to the takeoff/go-around (TO/GA) detent. However, the captain responded by saying \"they're set\" and moving the thrust levers from the FLEX position to the CL (climb) detent then back to the FLEX position. As the airplane continued to accelerate, the first officer did not make a callout at 80 KIAS, as required by the operator's standard operating procedures (SOPs). As the airplane reached 86 KIAS, the automated RETARD aural alert sounded and continued until the end of the CVR recording. According to Airbus, the RETARD alert is designed to occur at 20 ft radio altitude on landing and advise the pilot to reduce the thrust levers to idle. The captain later reported that he had never heard an aural RETARD alert on takeoff, only knew of it on landing, and did not know what it was telling him. He further said that when the RETARD aural alert sounded, he did not plan to reject the takeoff because they were in a high-speed regime, they had no red warning lights, and there was nothing to suggest that the takeoff should be rejected. The first officer later reported that there were no V-speeds depicted on the PFD and, thus, she could not call V1 or VR during the takeoff. She was not aware of any guidance or procedure that recommended rejecting or continuing a takeoff when there were no V-speeds displayed. She further said she \"assumed [the captain] wouldn't continue to takeoff if he did not know the V-speeds.\" The captain stated that he had recalled the V-speeds as previously briefed from the Taxi checklist, which happened to be the same V-speeds for runway 27L. The captain continued the takeoff roll despite the lack of displayed V-speeds, no callouts from the first officer, and the continued and repeated RETARD aural alert. FDR data show that the airplane rotated at 164 KIAS. However, in a postaccident interview, the captain stated that he \"had the perception the aircraft was unsafe to fly\" and that he decided \"the safest action was not to continue,\" so he commenced a rejected takeoff. FDR data indicate that the captain reduced the engines to idle and made an airplane-nose-down input as the airplane reached 167 KIAS (well above the V1 speed of 157 KIAS) and achieved a 6.7 degree nose-high attitude. The airplane's pitch decreased until the nose gear contacted the runway. However, the airplane then bounced back into the air and achieved a radio altitude of about 15 ft. Video from airport security cameras show the airplane fully above the runway surface after the bounce. The tail of the airplane then struck the runway surface, followed by the main landing gear then the nose landing gear, resulting in its fracture. The airplane slid to its final resting position on the left side of runway 27L. The operator's SOPs address the conditions under which a rejected takeoff should be performed within both low-speed (below 80 KIAS) and high-speed (between 80 KIAS and V1) regimes but provide no guidance for rejecting a takeoff after V1 and rotation. Simulator testing performed after the accident demonstrated that increasing the thrust levers to the TO/GA detent, as required by SOPs upon the activation of the \"thrust not set\" ECAM message, would have silenced the RETARD aural alert. At the time of the accident, neither the operator's training program nor manuals provided to flight crews specifically addressed what to do in the event the RETARD alert occurred during takeoff; although, 9 months before the accident, US Airways published a safety article regarding the conditions under which the alert would activate during takeoff. The operator's postaccident actions include a policy change (published via bulletin) to its pilot handbook specifying that moving the thrust levers to the TO/GA detent will cancel the RETARD aural alert. Although simulator testing indicated that the airplane was capable of sustaining flight after liftoff, it is likely that the cascading alerts (the ECAM message and the RETARD alert) and the lack of V-speed callouts eventually led the captain to have a heightened concern for the airplane's state as rotation occurred. FDR data indicate that the captain made erratic pitch inputs after the initial rotation, leading to the nose impacting the runway and the airplane bouncing into the air after the throttle levers had been returned to idle. Airbus simulation of the accident airplane's acceleration, rotation, and pitch response to the cyclic longitudinal inputs demonstrated that the airplane was responding as expected to the control inputs. Collectively, the events before rotation (the incorrect runway programmed in the FMC, the \"thrust not set\" ECAM message during the takeoff roll, the RETARD alert, and the lack of required V-speeds callouts) should have prompted the flight crew not to proceed with the takeoff roll. The flight crewmembers exhibited a self-induced pressure to continue the takeoff rather than taking the time to ensure the airplane was properly configured. Further, the captain initiated a rejected takeoff after the airplane's speed was beyond V1 and the nosewheel was off the runway when he should have been committed to the takeoff. The flight crewmembers' performance was indicative of poor crew resource management in that they failed to assess their situation when an error was discovered, to request a delayed takeoff, to communicate effectively, and to follow SOPs. Specifically, the captain's decision to abort the takeoff after rotation, the flight crew's failure to verify the correct departure runway before gate departure, and the captain's failure to move the thrust levers to the TO/GA detent in response to the ECAM message were all contrary to the operator's SOPs. Member Weener filed a statement, concurring in part and dissenting in part, that can be found in the public docket for this accident. Chairman Hart, Vice Chairman Dinh-Zarr, and Member Sumwalt joined the statement.", "probable_cause": "The captain's decision to reject the takeoff after the airplane had rotated. Contributing to the accident was the flight crew's failure to follow standard operating procedures by not verifying that the airplane's flight management computer was properly configured for takeoff and the captain's failure to perform the correct action in response to the electronic centralized aircraft monitoring alert."}