{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh89-dragon-rapide-hinchinbrook-island-2-killed", "date": "Oct 26, 1953 at 2155 LT", "type": "De Havilland DH.89 Dragon Rapide", "operator": "Queensland Ambulance Transport Brigade", "flight_phase": "Flight", "flight_type": "Ambulance", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Iron Range – Cairns", "msn": "6713", "yom": 1944, "flight_number": null, "city": "Hinchinbrook Island", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Aerial ambulance was called out to Iron Range on Cape York to collect a patient, an aboriginal stockman who had been bitten by a snake. Capt Dick Brampton was one of half a dozen ANA pilots who were rostered to fly the Ambulance plane as needed for the Cairns Ambulance Transport Brigade. On board as well was an ambulance bearer. Capt Dick Brampton took off fairly late from Iron Range, and was confronted by very low thick cloud north of Cairns. The Rapide was only VFR nor IFR and Capt Brampton could not get a fix on Cairns. He was redirected further south. He apparently ran out of fuel north of Hinchinbrook Island and landed the aircraft on the water near Brooke Island. Nearly two hours late on estimated ETA at Townsville that evening, a radio call was heard at 9.48pm “Lost, low fuel”. At 9.55pm another call saying the aircraft was being ditched. Within an hour of the last message, a RAAF Lincoln from Townsville and an ANA DC-3 from Cairns were searching an area near Hinchinbrook Island, 20 miles north of Ingham. The ambulance bearer was uninjured and got out okay, along with Capt Brampton who had some leg injuries. The stockman went down with the plane which did not float for long. Apparently Capt Dick Brampton survived for some time in the water, but was unable to stay afloat due to his injuries. He was not wearing a life jacket. The ambulance bearer was picked up six hours later by a passing coastal freighter. Neither Capt Brampton's body nor any parts of the plane were ever found. ", "probable_cause": "Fuel exhaustion."}