{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-83-detroit", "date": "Mar 8, 2017 at 1452 LT", "type": "McDonnell Douglas MD-83", "operator": "Ameristar%20Jet%20Charter2", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Detroit - Washington DC", "msn": "53123/1987", "yom": 1992, "flight_number": "7Z9363", "city": "Detroit-Willow Run (Ypsilanti)", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 110, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15518, "captain_hours_type": 8495, "copilot_hours": 9660, "copilot_hours_type": 2462, "aircraft_hours": 41008, "circumstances": "A McDonnell Douglas MD-83, registration N786TW, suffered a runway excursion following an aborted takeoff from runway 23L at Detroit-Willow Run Airport, Michigan, USA. The aircraft had been chartered by the University of Michigan Basketball team for a flight to a game in Washington, DC. The flight crew prepared for take-off and calculated V-speeds (V1, VR, V2) using \"Normal Thrust Takeoff\", a 10 kts headwind, and a take-off weight of 146,600 lbs. The V-speeds for this configuration were 139 kts, 142 kts, and 150 kts, respectively. However, the flight crew chose to increase VR to 150 kts to allow for more control during take-off in the presence of windshear. During takeoff roll, at 14:51:56 (about 3,000 ft down the runway) and about 138 kts of airspeed, the control column was pulled back slightly from a non-dimensional value of -7 to -5.52. The airplane’s left elevator followed the control input and moved from a position of -15° trailing edge down to -13° trailing edge down. The right elevator did not change and stayed at approximately -16° trailing edge down. At 14:52:01 a large control column input was made (151 kts and 4100 ft down the runway) to a non-dimensional 18.5 and the left elevator moves to a position near 15° trailing edge up. After 14:52:05 the right elevator moves to -13° trailing edge down, but no more. The airplane does not respond in pitch and does not rotate. The captain decided to abort the takeoff. The maximum ground speed was 163 kts (173 kts airspeed) and the airplane began to decelerate as soon as the brakes were applied at 14:52:08. Spoilers were deployed at 14:52:10 and thrust reversers were deployed between 14:52:13 and 14:52:15. The aircraft could not be stopped on the runway. The airplane’s ground speed was 100 kts when it left the paved surface. The aircraft overran the end of the runway, damaged approach lights, went through the perimeter fence and crossed Tyler Road. It came to rest on grassy terrain, 345 meters past the end of the runway, with the rear fuselage across a ditch. The nose landing gear had collapsed. Runway 23L is a 7543 ft long runway.", "probable_cause": "The NTSB determines that the probable cause of this accident was the jammed condition of the airplane’s right elevator, which resulted from exposure to localized, dynamic wind while the airplane was parked and rendered the airplane unable to rotate during takeoff. Contributing to the accident were (1) the effect of a large structure on the gusting surface wind at the airplane’s parked location, which led to turbulent gust loads on the right elevator sufficient to jam it, even though the horizontal surface wind speed was below the certification design limit and maintenance inspection criteria for the airplane, and (2) the lack of a means to enable the flight crew to detect a jammed elevator during preflight checks for the Boeing MD-83 airplane. Contributing to the survivability of the accident was the captain’s timely and appropriate decision to reject the takeoff, the check airman’s disciplined adherence to standard operating procedures after the captain called for the rejected takeoff, and the dimensionally compliant runway safety area where the overrun occurred."}