{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-63f-near-narrows-6-killed", "date": "Dec 22, 1996 at 1810 LT", "type": "Douglas DC-8", "operator": "Airborne%20Express-2", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Mountains", "schedule": "Greensboro - Greensboro", "msn": "45901", "yom": 1967, "flight_number": null, "city": "Narrows", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 8087, "captain_hours_type": 869, "copilot_hours": 8426, "copilot_hours_type": 1509, "aircraft_hours": 62800, "circumstances": "The airplane impacted mountainous terrain while on a post-modification functional evaluation flight (FEF). The pilot flying (PF) had applied inappropriate control column back pressure during the clean stall maneuver recovery attempt in an inadequate performance of the stall recovery procedure established in ABX's (Airborne Express) operations manual. The pilot not flying (PNF), in the right seat, was serving as the pilot-in-command and was conducting instruction in FEF procedures. The PNF failed to recognize, address and correct the PF's inappropriate control inputs. An inoperative stall warning system failed to reinforce to the flightcrew the indications that the airplane was in a full stall during the recovery attempt. The flightcrew's exposure to a low fidelity reproduction of the DC-8's stall characteristics in the ABX DC-8 flight training simulator was a factor in the PF holding aft (stall-inducing) control column inputs when the airplane began to pitch down and roll. The accident could have been prevented if ABX had institutionalized and the flightcrew had used the revised FEF flight stall recovery procedure agreed upon by ABX in 1991. The informality of the ABX FEF training program permitted the inappropriate pairing of two pilots for an FEF, neither of whom had handled the flight controls during an actual stall in the DC-8. ", "probable_cause": "The inappropriate control inputs applied by the flying pilot during a stall recovery attempt, the failure of the non flying pilot-in-command to recognize, address, and correct these inappropriate control inputs, and the failure of ABX to establish a formal functional evaluation flight program that included adequate program guidelines, requirements and pilot training for performance of these flights. Contributing to the causes of the accident were the inoperative stick shaker stall warning system and the ABX DC-8 flight training simulator's inadequate fidelity in reproducing the airplane's stall characteristics."}