{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-aspen-3-killed", "date": "Feb 13, 1991 at 1741 LT", "type": "Learjet 35", "operator": "Richmor%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Las Vegas - Aspen", "msn": "35-291", "yom": 1980, "flight_number": null, "city": "Aspen-Pitkin County-Sardy Field", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 10530, "captain_hours_type": 3700, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight crew reported to the tower controller that they were over the airport and requested a right downwind circling approach to runway 15. The tower controller and other witnesses observed the airplane in a steep right bank on base leg. The airplane overshot the extended runway centerline. The tower controller observed the airplane entering a steeper right bank to correct back to the runway centerline. The controller stated that he observed the airplane \"flutter\" and then crash right-wing first, about one mile north of the runway threshold. Other witnesses reported a variety of indications consistent with a loss of control. The last recorded transmission was \"Oh no you're (stall…).\" The ( ) indicates that the word was questionable text. Both engines were producing about 1,700 pounds of thrust (2,561 pounds available). A snow squall had just passed over the airport and was obscuring mountains to the east. The terrain was snow covered. The accident occurred about eight minutes before official sunset. The approach procedure is not authorized at night or for category D airplanes. Minimums for the approach were three miles visibility with an MDA of 10,840 feet. Airport elevation is 7,815 feet. Both pilots were rated in the airplane. It could not be determined which pilot was at the controls at the time of the accident.", "probable_cause": "The flight crew's failure to maintain airspeed and control of the airplane while maneuvering to land. Contributing factors were the flight crew's execution of an unstabilized approach and the surrounding snow-covered mountainous terrain."}