{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-olathe-5-killed", "date": "Jan 21, 2005 at 0943 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Riley Rocket", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Olathe – Zephyrhills", "msn": "421C-0681", "yom": 1979, "flight_number": null, "city": "Olathe", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 6064, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2957, "circumstances": "The airplane received substantial damage on impact with trees, terrain, and a residence about one mile from the departure airport during instrument meteorological conditions. The airport elevation was 1,096 feet mean sea level. The personal flight was operating on an instrument flight rules (IFR) flight plan with a filed equipment suffix designating that the airplane was equipped with a Global Positioning System. Airplane records indicate that the airplane was equipped with a GPS but was not approved for IFR navigation. The pilot was issued a departure clearance to 3,000 feet and heading of 130 degrees. Radar data indicates that the airplane leveled off at an altitude approximately 2,000 feet during a 32 second period while executing a right turn to the assigned heading. Witnesses reported that the airplane impacted terrain in a right wing nose low attitude. Wreckage distribution and ground scarring was indicative of a high-speed impact with terrain. No anomalies that would have precluded normal operation of the airplane were noted. The calculated airplane weight was approximately 597 lbs above the maximum gross weight of the airplane.", "probable_cause": "The pilot's failure to maintain adequate altitude/clearance during cruise flight, resulting in collision with trees. Contributing factors were the low altitude and low ceiling."}