{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-recife-17-killed", "date": "Nov 11, 1991 at 2143 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Nordeste", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "City", "schedule": "Recife - Maceió - Aracajú - Salvador", "msn": "110-314", "yom": 1980, "flight_number": "NES115", "city": "Recife-Guararapes", "zone": "Pernambuco", "country": "Brazil", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 2, "total_fatalities": 17, "captain_hours": 4295, "captain_hours_type": 901, "copilot_hours": 2604, "copilot_hours_type": 1401, "aircraft_hours": 3973, "circumstances": "During the takeoff roll on runway 36 at Recife-Guararapes Airport, the right engine failed. The crew decided to continue the takeoff procedure and completed the rotation after a course of 900 metres. Thirty seconds after rotation, at a height of about 100 feet, the right engine caught fire and exploded. The crew lost control of the airplane that crashed in the district of Ipsep near the airport. The aircraft and several buildings were destroyed. All 15 occupants as well as two people on the ground were killed. ", "probable_cause": "The accident was the consequence of the failure of the right engine during takeoff. It was determined that the temperature indicator for the right engine was faulty, displaying a lower than actual temperature. The engine operated for some time at high temperatures because of the faulty system. It was also found that, after completion, some maintenance and inspection tasks were just signed by the maintenance engineer. Signatures from the maintenance inspector were missing.\r\nThe following contributing factors were reported:\r\n- Poor crew reaction to an emergency situation, \r\n- Poor maintenance,\r\n- Manufacturing deficiency, \r\n- The crew failed to abort the takeoff procedure."}