{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130-hercules-near-alert-5-killed", "date": "Oct 30, 1991 at 1640 LT", "type": "Lockheed C-130 Hercules", "operator": "Royal-Canadian-Air-Force-31", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Edmonton - Thule - Alert", "msn": "4192", "yom": 1967, "flight_number": "Boxtop22", "city": "Alert AFB", "zone": "Nunavut", "country": "Canada", "region": "North America", "crew_on_board": 5, "crew_fatalities": 2, "pax_on_board": 13, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Every year, in the cold and darkness of late October, personnel at Canadian Forces Station Alert on Ellesmere Island, Nunavut, gather at a cairn near the runway to remember the crew and passengers of Hercules 130322 who lost their lives during a resupply mission to the station. On October 30, 1991, at approximately 4:40 p.m., flight 22 of Operation Boxtop – as the biannual resupply mission is called – was on its final approach to the station from Thule Air Force Base in Greenland. As the CC-130 Hercules from 435 Transport and Rescue Squadron, loaded with 3,400 litres of diesel fuel, began its descent, the pilot flying lost sight of the runway. Moments later, radar contact and communication were lost as the aircraft crashed approximately 16 km south of the station. The crew of another CC-130 Hercules, also bound for Alert, saw the fires of the crash and identified the location of Boxtop 22. The crash took the lives of five Canadian Armed Forces members – four died in the crash and one perished before help arrived – and led to the boldest and most massive air disaster rescue mission ever undertaken by the Canadian military in the High Arctic. Thirteen lives were saved. Within a half hour of the rescue call, a Hercules carrying 12 search and rescue technicians from 440 Search and Rescue Squadron in Edmonton, Alberta, was in the air. It reached the crash site seven and a half hours later, but the SAR technicians couldn’t descend due to the weather. Another Hercules from 413 Search and Rescue Squadron in Greenwood, Nova Scotia, soon joined the search. Meanwhile, search and rescue technicians formed a ground rescue team at Alert and set out overland for the crash site, guided through the darkness and horrendous weather conditions by a Hercules. The survivors, some soaked in diesel fuel, endured high winds and temperatures between -20C and -30C. Many sheltered in the tail section of the downed aircraft but others were more exposed to the elements. Finally, the 413 Squadron team finally got a break in the weather and six SAR technicians parachuted into the site more than 32 hours after the crash and began looking for survivors. They were joined soon after by more SAR technicians. When the ground rescue team finally arrived – 21 hours after it had set out – 26 rescuers were on the ground. They warmed and treated the injured and prepared them for medical evacuation. A Twin Huey helicopter from Alert made three trips to bring the survivors back to the station. Once again this year, personnel at Alert will conduct a parade on October 30 to commemorate the crash. The parade will begin at 4:30 p.m. and continue through the 4:40 p.m. timing when the crash occurred.\r\nThose killed were:\r\nCpt John Couch, pilot,\r\nCpt Judy Trépanier, logistics officer,\r\nM/WO Tom Jardine, regional services manager CANEX,\r\nW/O Robert Grimsley, supply technician,\r\nM/Cpl Roland Pitre, traffic technician.\r\nThose who survived were:\r\nRobert Thomson, \r\nSusan Hillier,\r\nCpt Richard Dumoulin, logistics officer,\r\nCpt Wilma DeGroot, doctor, \r\nLt Joe Bales, pilot,\r\nLt Mike Moore, navigator,\r\nM/WO Marc Tremblay, supply technician,\r\nSgt Paul West, flight engineer,\r\nM/Cpl Tony Cobden, communications researcher,\r\nM/Cpl David Meace, radio technician, \r\nM/Cpl Mario Ellefsen, communications researcher, \r\nM/S “Monty” Montgomery, communications researcher,\r\nPvt Bill Vance, communications researcher.\r\nSource: \r\nhttp://www.rcaf-arc.forces.gc.ca/en/article-template-standard.page?doc=remembering-the-crash-of-boxtop-flight-22/ig9v1k0t", "probable_cause": null}