{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-21-tiraora-lodge", "date": "Mar 19, 1989 at 1635 LT", "type": "Britten-Norman Islander", "operator": "Soundsair2", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Picton - Tiraora Lodge - Wellington", "msn": "406", "yom": 1974, "flight_number": null, "city": "Tiraora Lodge", "zone": "Marlborough District Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2345, "captain_hours_type": 28, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3166, "circumstances": "The flight was from Koromiko via Tiraora Lodge airstrip to Wellington. ZK-SFE took off from Koromiko with one pilot and five passengers at about 1620 hours. Three of the passengers were members of the pilot’s family. It was intended to make a stop at Tiraora Lodge airstrip to pick up additional passengers before proceeding to Wellington. Enroute to Tiraora Lodge, the aircraft encountered some turbulence from the westerly wind which was established aloft. The pilot flew the aircraft on a straight-in approach to Tiraora Lodge airstrip vector 26. Out on the bay wind gusts were disturbing the water but inshore the water was calm. There was no white water in the bay and the pilot assessed the surface wind speed as ten to fifteen knots. The sun was shining across the top of the ridge of hills which lay beyond the airstrip. As its azimuth was virtually the same as the runway direction the associated glare meant the pilot was unable to see the runway. However, the shadow of the ridge appeared to lie where the runway should have been so the pilot continued the landing approach expecting the aircraft would be in shadow when it was closer to the runway threshold and thus he would be able to see to make the landing. During the approach the aircraft encountered a downdraught which required the pilot to apply power to maintain the glidepath. The company’s missed approach procedure at Tiraora Lodge was to commence a level turn to the left 200 m from the threshold, the turn being sufficiently steep to be completed over the water. Thus the aircraft would not have to clear the trees, about 130 feet high, which surrounded the Lodge. The position from which the missed approach was to be commenced was not defined in terms of landmarks. The pilot elected to maintain a height of 200 feet on the approach reasoning that if he was unable to complete the landing, he would be able to turn above the trees which would therefore not be the limiting obstacle. By this stage, the aircraft’s indicated airspeed had been reduced to less than 88 knots and the pilot “toggled” the selector switch with the intention of setting landing flap (56°). When the pilot was able to see the airstrip he was abeam its lower end, to the right of the runway. The terrain ahead of him was uneven and divided by drainage ditches and deer fences. The overrun area beyond the runway precluded a safe arrival if the aircraft could not be stopped on the runway. A climb straight ahead was not possible due to the steep rise to a ridge at 2500 feet immediately beyond the end of the runway and high ground also prevented a turn to the right. However, a left turn seemed to offer an escape route as the ground in that direction rose less steeply. The pilot therefore commenced a missed approach to the left. He applied full power, selected flap towards “TAKE-OFF” and commenced a level turn. He had to descend the aircraft to keep it flying. Although the engines were delivering full power the performance of the aircraft was much less than he expected. Because he had been having problems with the flap actuation and indication system the pilot thought the flaps might not have retracted from the “LANDING” flap position to the “TAKE-OFF’’ position properly. On recollection, after the accident, he thought he may not have selected “LANDING” flap correctly during the approach and when he selected “TAKE-OFF” on the go-around the flaps travelled from “TAKE-OFF” to the 6° down position. Although he believed the flap position indicator to be unserviceable he did not check the position of the flaps themselves visually after either selection. Witnesses on the ground commented that the aircraft seemed to be affected by turbulence on the approach, was flying very slowly as it came level with the runway threshold and that it banked steeply when it commenced its turn. Although the pilot could not recollect hearing the stall warning horn, the passengers said that it came on and sounded continuously. During the missed approach the aircraft collided with a telephone line. When the pilot felt the drag of the telephone wire, he closed the throttles. Then, when he found the aircraft was still flying, he applied full power but the aircraft pitched nose up so he reduced the power again. The aircraft descended into the water at an angle of about 25° and then floated briefly on the surface of the bay. Although the pilot had attempted to flare the aircraft it was in a nose-down attitude on impact. All of the passengers escaped or were assisted from the aircraft and taken ashore to the Lodge for first aid and dry clothes. The accident took place in daylight at about 1635 hours NZST. The accident site was Northwest Bay, Pelorus Sound.", "probable_cause": "The probable cause of this accident was the pilot’s decision to continue to fly the aircraft, at 200 feet amsl, past the point from which a missed approach could be successfully achieved, when he was unable to see the position of the runway, its threshold or the windsock.\r\nOther contributory factors were:\r\n- The pilot’s unfamiliarity with the Tiraora Lodge Airstrip,\r\n- The pilot’s inadequate training in strip operation and on the aircraft type,\r\n- The pilot’s failure to check the position of the aircraft’s flaps, visually, during the missed approach procedure when he believed the flap position indicator to be unreliable,\r\n- The pilot’s unfamiliarity with the aircraft’s flap operating system,\r\n- The lack of a suitable wind measuring device or other information on the local winds in the area and the presence of a substantial downflow in the area of the attempted missed approach,\r\n- Obstructions within the obstruction free area prescribed for approved landing grounds,\r\n- The absence of supervision of the airline by the regulatory authority."}