{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154b-2-moscow", "date": "May 21, 1986 at 1521 LT", "type": "Tupolev TU-154", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Abakan - Chelyabinsk - Moscow", "msn": "79A327", "yom": 1979, "flight_number": null, "city": "Moscow-Sheremetyevo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 10, "crew_fatalities": 0, "pax_on_board": 175, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11922, "circumstances": "Following an uneventful flight from Chelyabinsk to Moscow in relative good weather conditions, the crew started the descent to Moscow-Domodedovo when the weather conditions worsened. While descending to an altitude of 3,600 meters, the aircraft entered an area of heavy rain falls and icing (a cold front was passing over Moscow at that time). The Pitot tubes became obstructed, modifying some instruments settings. The airspeed indicator fell to zero and the crew thought the aircraft was near stall conditions so he initiated an emergency descent with a rate of descent of 100 meters per second and a speed of 813 km/h. The aircraft encountered positive acceleration of 3,2 g and suffered structural damages. The crew was able to divert to Moscow-Sheremetyevo Airport where an emergency landing was completed. All 185 occupants evacuated safely and the aircraft was later declared as damaged beyond repair due to irreparable damages to the main structure (fuselage). ", "probable_cause": "It was determined that the crew failed to prepare the light properly at Chelyabinsk Airport and failed to follow the pre-takeoff checklist. Doing so, the crew forgot to activate the Pitot heating system. While descending to Moscow, the Pitot tube became obstructed by ice because they were not heated. "}