{"url": "https://www.baaa-acro.com/crash/crash-polikarpov-p-5-near-karatkansk-1-killed", "date": "May 18, 1934 at 2020 LT", "type": "Polikarpov P-5", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Postal (mail)", "survivors": "No", "site": "Plain, Valley", "schedule": "Novosibirsk – Omsk", "msn": "6434", "yom": 1933, "flight_number": null, "city": "Karatkansk", "zone": "Novosibirsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 491, "circumstances": "The pilot, sole on board, departed Novosibirsk Airport at 1740LT on a mail flight to Omsk. After passing over Tatarsk, weather conditions worsened with low ceiling, heavy rain falls and strong winds up to 57 km/h. After entering clouds, the pilots lost his bearings and elected to return to Tatarsk but the local beacon was unserviceable due to poor weather conditions. The pilot turned several minutes and probably attempted an emergency landing when the aircraft impacted ground and crashed in a field located 5 km south of the Karatkansk Station. The airplane was destroyed and the pilot was killed. ", "probable_cause": "The accident was the consequence of an impact with the ground at high speed while the pilot had lost all bearings in an unfavorable environment. \r\nThe following contributing factors were identified:\r\n- The person in charge to provide weather bulletin prior to departure from Novosibirsk failed to transmit accurate weather reports to the pilot;\r\n- The person in charge to provide same services en route (at the intermediate weather station) also failed to provide accurate information;\r\n- The pilot took the decision to continue the flight through clouds and below the altitude of 200 metres. \n\r\nTranslated with www.DeepL.com/Translator (free version)"}