{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-4-cheyenne-2-killed", "date": "Oct 8, 1946 at 0433 LT", "type": "Douglas DC-4", "operator": "United-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Francisco – Cheyenne – Chicago", "msn": "10471", "yom": 1944, "flight_number": "UA028", "city": "Cheyenne", "zone": "Wyoming", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 43, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 12573, "captain_hours_type": 2425, "copilot_hours": 3551, "copilot_hours_type": 831, "aircraft_hours": 3077, "circumstances": "An approach from the west was then decided on by the Captain as visibility there had been fair. The First Officer contacted the tower and was cleared to land on Runway 12 (to the southeast). While headed west the Captain started a gradual left turn at the western boundary of the field, continued it for a short time and then entered a right turn in an attempt to line up with and land on Runway 12. This right turn was continued at an altitude of some 200 feet above the ground with, wheels down, 15 degree of flap and airspeed of approximately 120 mph (once as low as 110 mph). The Captain instructed the First Officer, who occupied the right hand pilot seat, (on the low and field side of the turn) to \"sing out\" when he saw the field. When the First Officer did see it he said \"There's the field at 2 o'clock\" (at a relative bearing of 60 degree). The Captain then leaned to the right to see the field himself and during this momentary diversion from the instruments enough altitude was lost to permit the right wing tip to strike the ground. The site was on rolling prairie approximately 20 feet higher than, and about 1 1/2 miles northwest of the Cheyenne Airport, on the U. S. Military Reservation of Fort Warren. At the instant of impact the aircraft was still in a right turn, banked approximately 15 degree and headed northeast. It came to rest about 700 feet beyond the point of first impact. A gasoline fire developed on the ground along the crash path and the right wing, which had been torn from the fuselage, was partly burned. Two passengers were killed while most of the other occupants were injured, some of them seriously.", "probable_cause": "The Captain started a standard instrument approach to the Cheyenne Airport but did not follow through with the prescribed missed-approach procedure after descending below the minimum altitude. During the final attempt to land, the aircraft struck the ground with its right wing while in a right turn. The Board determines that the probable cause of this accident was a loss of altitude during a turn preparatory to a final approach while the pilot was maneuvering in an attempt to land."}