{"url": "https://www.baaa-acro.com/crash/crash-cessna-551-citation-iisp-lufkin", "date": "Dec 2, 2020 at 0842 LT", "type": "Cessna 551 Citation II", "operator": "Aviation Stars II", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Austin - Lufkin", "msn": "551-0095", "yom": 1978, "flight_number": null, "city": "Lufkin-Angelina County", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17772, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9395, "circumstances": "After a 30-minute uneventful instrument flight rules (IFR) flight, the business jet landed in the rain on the 4,311ft-long runway. The pilot reported, and runway skid marks corroborated, that the airplane touched down about 1,000 ft from the approach end of the runway. The pilot reported braking action was initially normal and the anti-skid system cycled twice before it stopped working and he was unable to slow the airplane using the emergency brakes. The airplane continued off the departure end of the runway where it traveled through wet grass and a fence before coming to rest with the landing gear collapsed. A video of the airplane during the landing roll indicated there was a significant amount of water on the runway. No mechanical anomalies were found with the brake/antiskid systems during the postaccident examination of the airplane. Marks on the runway indicated functionality of the antiskid system. Stopping performance calculations estimated the distance required to stop the airplane on the runway was about 4,127 ft. The runway length remaining after the airplane touched down was about 3,311 ft. The pilot was aware of the runway length and weather conditions prior to departure and reported that he should have not accepted the trip.", "probable_cause": "The pilot’s decision to land on a runway that did not provide enough length to stop the airplane given the wet surface conditions, resulting in a runway excursion. "}