{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-4a-caribou-sparrevohn-1-killed", "date": "Jan 29, 1997 at 2310 LT", "type": "De Havilland DHC-4 Caribou", "operator": "Southcentral%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Saint Mary's - Kenai", "msn": "126", "yom": 1963, "flight_number": null, "city": "Sparrevohn", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4987, "captain_hours_type": 220, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13923, "circumstances": "The CFR Part 135 cargo flight departed at night on an IFR flight with a load of mining equipment. Route of flight was over remote/mountainous terrain. About 2 hours after takeoff, while cruising at 12,000' feet msl, the right engine and propeller began to overspeed. The captain feathered the #2 engine and declared an emergency. He began to divert to an alternate destination, about 120 miles away in an area of lower terrain, but the aircraft would not maintain altitude (single engine service ceiling, as loaded, was about 8,700 feet). The captain increased power to the left engine, but it began to produce banging and coughing noises. The captain elected to perform an emergency landing at a nearby, remote, military airfield (A/F). The A/F was located in mountainous terrain and had a one-way, daylight only approach. The captain lowered the gear and flaps, and began a visual approach while attempting to keep the runway end identifier lights (REIL) in view. The aircraft encountered severe turbulence, and the captain applied full throttle to the left engine in an attempt to climb. The REIL disappeared from view, and the aircraft collided with snow covered terrain about 2 miles west of the A/F. Ground personnel at the A/F reported high winds and blowing snow with limited visibility. Postcrash exam of the right engine revealed a loss of the propeller control system hydraulic oil. Flight at 12,000 feet was conducted without crew oxygen. The crew had exceeded their maximum allowable duty day without adequate crew rest. ", "probable_cause": "Loss of the right engine propeller control oil, which led to an overspeed of the right engine and propeller, and necessitated a shut-down of the right engine; and failure of the pilot to maintain adequate altitude/distance from terrain during visual approach for a precautionary landing at an alternate airport. Factors relating to the accident were: fluctuation of the left engine power, premature lowering of the airplane flaps, and an encounter with adverse weather conditions (including high winds, severe turbulence, and white-out conditions) during the approach."}