{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61p-aerostar-ted-smith-601-antwerp-4-killed", "date": "Jun 2, 1990 at 1911 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "ITD Inc.", "flight_phase": "Flight", "flight_type": "Cinematography", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Antwerp - Antwerp", "msn": "61-0743-8063365", "yom": 1980, "flight_number": null, "city": "Antwerp-Deurne", "zone": "Antwerp", "country": "Belgium", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Delta Air Transport of Belgium arranged a Piper 601P Aerostar, N4PC, to shoot a promotion film. It was to fly in formation with an DAT Embraer 120 Brasilia near Antwerp Airport (ANW). The Brasilia, OO-DTH, departed Liège-Bierset Airport (LGG) at 17:57 and headed for Antwerp. Piper Aerostar N4PC took off from Antwerp at 18:43 and headed for Kallo, were both aircraft would join formation. It was agreed that the Aerostar would be on the left hand side of the EMB-120 because the camera crew was sitting on the right hand side of the Aerostar. After circling the city of Antwerp, the crew of OO-DTH contacted the Antwerp air traffic controller, stating his intentions to carry out a low pass over runway 29, followed by a high speed pass. The Aerostar would be alongside OO-DTH on both occasions. After that they would break and continued to Brussels. Antwerp Tower issued clearance at 19:06. At 19:08 OO-DTH radioed their plans to N4PC: \"I am starting approach and descent. I am going over the runway. I will not make a touch and go, I will just pull up, left and then back high speed.\" The pilot of N4PC replied: \"OK... I will go straight ahead\". At 19:11 both aircraft made a low pass over runway 29 at a speed of 140 kts. OO-DTh was climbing away in a left turn when a mid-air collision occurred with N4PC. The tail of the Piper was sheared off and the aircraft crashed out of control near a railway line. All four occupants were killed. The Brasilia was able to make a safe emergency landing at Antwerpen.\n", "probable_cause": "The collision was the consequence of the following factors: \r\n- Misunderstanding between both crew due to a poor flight preparation, especially regarding the end of the mission and the evacuation of the area,\r\n- The captain of the Embraer indicated he would pull up for climb then initiate a left turn while the pilot of the Piper indicated he would continue straight ahead, which caused the Piper to cut the trajectory of the Embraer that was flying on the right side of the Piper, \r\n- The pilot of the Piper was seating in the left front seat in his cockpit so his position did not allow him to have a good overview of the situation and the exact position of the Embraer."}