{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-159-gulfstream-i-linneus-2-killed", "date": "Jul 19, 2000 at 0031 LT", "type": "Grumman G-159 Gulfstream I", "operator": "Airwave Transport", "flight_phase": "Flight", "flight_type": "Postal (mail)", "survivors": "No", "site": "Plain, Valley", "schedule": "Moncton - Montreal", "msn": "154", "yom": 1965, "flight_number": "AWV9807", "city": "Linneus", "zone": "Maine", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6000, "captain_hours_type": 500, "copilot_hours": 600, "copilot_hours_type": 300, "aircraft_hours": 22050, "circumstances": "The airplane was in cruise flight at 16,000 feet, in instrument meteorological conditions. About two minutes after the crew ceased cross-feeding due to a fuel imbalance, the left engine experienced a total loss of power. About one minute later, the co-pilot indicated to the pilot-in-command (PIC) that the airplane was losing airspeed, and about 15 seconds later, the co-pilot remarked \"keep it up, keep it up.\" Shortly thereafter, the airplane departed controlled flight and impacted terrain. The airplane was destroyed by fire and impact forces. Examination of the left engine revealed no evidence of any pre-impact failures that would have accounted for an uncommanded in-flight shut-down. A SIGMET for potential severe clear icing was effective for airplane's flight path; however, the flight crew did not report or discuss any weather related problems around the time of the accident. At the time of the accident, the airplane was above its single-engine service ceiling. The PIC had accumulated approximately 6,000 hours of total flight experience, of which, about 500 hours were as PIC in make and model. The co-pilot had approximately 600 hours of total fight experience, of which, 300 hours were in make and model.", "probable_cause": "The pilot-in-command's failure to maintain minimum control airspeed, which resulted in a loss of control. Factors in this accident were clouds, and a loss of engine power for undetermined reasons, while in cruise flight above the airplane's single engine service ceiling. "}