{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-caribbean-sea", "date": "Nov 24, 2011 at 0823 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Boeck & Boeck", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Aguadilla - Saint George", "msn": "46-36423", "yom": 2007, "flight_number": null, "city": "Caribbean Sea", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2175, "captain_hours_type": 643, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 215, "circumstances": "While delivering the single-engine, turbine-powered airplane to Brazil during a multiple leg trip, the pilot decided to fly direct from his departure airport in Puerto Rico to his destination airport in Grenada instead of following the island chain and staying within power-off gliding distance of the shore. During the cruise portion of the flight, a total loss of engine power occurred over open water in visual meteorological conditions at 27,000 feet, about 119 miles west of a suitable landing area. During the loss of power, the engine torque indication dropped from the cruise power setting to 0 foot-pounds (ft-lbs) of torque, the engine then began to vibrate, and smoke began emanating from the engine. The pilot ditched the airplane, it sank, and it was not recovered. The pilot and the pilot-rated passenger were rescued by a French Navy helicopter. The pilot said that he had decided to take a direct route instead of staying closer to the island chain between the two airports because he had ferried 3 airplanes down to Brazil in the last year and that it was a judgment call and a calculated risk because the engine was reliable. At the airplane’s planned operating altitude of 27,000 feet, the airplane could have glided about 54 miles; if the route had been planned to take advantage of this glide distance, the pilot could have remained off shore island chain and taken a shorter, although not direct, route. Review of fueling documentation, the Pilot's Operating Handbook (POH), and statements made by the pilot and pilot-rated passenger also revealed that on the accident flight, good operating practices were disregarded. For instance, during fueling, the airplane which was not equipped with fuel heaters, had been topped off with fuel, but no fuel icing additive had been added, even though the pilot was planning to operate the airplane at 27,000 feet. The airplane was also operated in excess of the manufacturer's published weight limitations, and no power setting or performance information was available for climb and cruise operations in excess of these limitations. Furthermore, according to the pilot, before the loss of engine power, the torque was about 937 ft-lbs. According to the pilot-rated passenger, before the failure, the torque gauge was indicating about 980 ft-lbs. Review of the maximum cruise performance chart in the POH and Airplane Flight Manual (AFM) revealed that both of the stated torque settings exceeded the maximum torque setting listed on the chart. Operating the engine beyond the recommended power settings specified in the POH/AFM for a prolonged period will result in accelerated deterioration due to hot section component distress and will affect engine reliability and durability. ", "probable_cause": "The total loss of engine power during cruise flight for reasons that could not be determined because the airplane was not recovered. Contributing to the accident was the pilot’s failure to comply with the airplane and engine limitations, and his decision to fly over water beyond power-off gliding distance from shore."}