{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-22-salt-lake-city-43-killed", "date": "Nov 11, 1965 at 1752 LT", "type": "Boeing 727-100", "operator": "United-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Cleveland – Chicago – Denver – Salt Lake City – San Francisco", "msn": "18322", "yom": 1965, "flight_number": "UA227", "city": "Salt Lake City", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 85, "pax_fatalities": 43, "other_fatalities": 0, "total_fatalities": 43, "captain_hours": 17743, "captain_hours_type": 334, "copilot_hours": 6074, "copilot_hours_type": 84, "aircraft_hours": 1781, "circumstances": "Flight 227 took off from New York-LaGuardia (LGA) for a flight to San Francisco (SFO) via Cleveland (CLE), Chicago (MDW), Denver (DEN) and Salt Lake City (SLC). The aircraft took off from Denver at 16:54 and climbed to its assigned cruising altitude of FL310. At 17:38 flight 227 began its descent for Salt Lake City. The flight proceeded in accordance with radar vectors. After a radar handoff to Salt Lake City Approach Control new clearance altitudes were given. At 17:47 the approach controller advised, \"United seventy twenty seven ... five miles south of Riverton Fan Marker coming on localizer course cleared for ILS runway three four left approach.\" The pilot replied \"Okay we're slowed to two fifty (Knots) and we're at ten (10,000 feet) we have the runway in sight now, we'll cancel and standby with you for traffic.\" Control of the flight was transferred to the tower and at 17:49:40 landing clearance was issued. The aircraft crossed the outer marker over 2,000 fee & above the ILS glide slope. The rate of descent during the final approach exceeded 2,000 ft/min, approximately three times the United Air Lines recommended rate of descent for landing approaches. The first officer attempted to apply power but the captain stopped him. Power was then applied too late to arrest the rate of descent. The airplane touched down 335 feet short of the threshold of runway 34L. The right and left main landing gear began to separate and the airplane slid onto the runway. Severe upward and rearward impact forces from the right main Landing gear assembly produced a large impact hole and ruptured fuel lines and the no. 3 generator leads between fuselage station 1030 and 1130 on the right side. The fuel was ignited by sparks from the fuselage scraping on the runway and/or the severed generator leads. 13 passengers were uninjured while 35 people were wounded. 43 other occupants were killed.", "probable_cause": "The Board determines the probable cause of this accident was the failure of the Captain to take timely action to arrest an excessive descent rate during the landing approach."}