{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-6b2-h4-turbo-porter-lillo-2-killed", "date": "May 30, 2008 at 1545 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "Skydive%20Lillo", "flight_phase": "Flight", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lillo - Lillo", "msn": "700", "yom": 1969, "flight_number": null, "city": "Lillo", "zone": "Castile-La Mancha", "country": "Spain", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 10, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1100, "captain_hours_type": 150, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15833, "circumstances": "The airplane had taken off from runway 30 at the Lillo (Toledo) Aerodrome for a local parachute drop. On board were the pilot and 10 skydivers, six of whom consisted of instructor-student pairs doing tandem jumps. When at an altitude of approximately 14,000 feet and having sounded the acoustic signal indicating two minutes to go before the jump, the airplane was subjected to an instantaneous and sharp negative acceleration that pushed two occupants against the ceiling of the aircraft. As soon as the airplane regained a normal attitude, the left wing fractured and detached. As a result, the airplane started to fall to the ground. Nine of the parachutists were  ejected out and were able to open their parachutes at a sufficient enough altitude to land normally. The airplane eventually impacted the ground and burst into flames at a site located 4.5 km north of the aerodrome. The fire destroyed the area between the firewall and the aft end of the passenger cabin. The pilot and one parachutist were unable to exit the aircraft and died on impact. Several components, including the detached wing and its control surfaces, as well as part of the horizontal stabilizer, were thrown off and found between 1.5 km and 2.5 km to the northeast of the main crash site.\n", "probable_cause": "The accident took place as the aircraft was entering an area of strong turbulence inside a storm. The aircraft was turning left to align with the heading used for the parachuting run, and as a result of the turn both the wing and the tail were subjected to loads in excess of design loads. This caused several of their components to fracture, resulting in the detachment of the left wing and the horizontal stabilizer. Contributing significantly to the accident is the fact that neither the company that operated the aircraft nor the jump supervisors were aware of the violent storm present to the north of the aerodrome, exactly over the area where the flight and the skydiving activity were going to take place.\n"}