{"url": "https://www.baaa-acro.com/crash/ground-collision-atr72-202-warsaw", "date": "Jul 14, 2011 at 2230 LT", "type": "ATR72-200", "operator": "EuroLOT", "flight_phase": "Taxiing", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Wrocław – Warsaw", "msn": "478", "yom": 1995, "flight_number": "ELO3850", "city": "Warsaw-Okęcie-Frederic Chopin", "zone": "Masovian Voivodeship (Mazowieckie)", "country": "Poland", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 33, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 14 July, 2011 ATR 72 flight crew after landing at EPWA aerodrome received the clearance for taxiing to parking stand 41 via taxiways: \"S\", \"O\" and \"M\". When the airplane was on taxiway \"M2\", \"Mulag\" type tractor was moving by the service road, passing perpendicularly to taxiway “M2”. The tractor driver did not give the right of way to ATR 72 and the tractor collided with the airplane. As a result, the airplane and the tractor sustained substantial damages. The flight crew stopped the airplane and shut down the engines. Airport Fire Brigade and an ambulance were called. The tractor operator suffered some injuries and was taken to hospital. the airplane passengers and the flight crew did not suffer any injuries. The impact caused a fuel leakage from the airplane of 200 m2 in area, which was removed along with other elements of the damaged aircraft by the Airport Fire Brigade. The airplane and the \"Mulag\" tractor were withdrawn from the further service. During the accident there were adverse weather conditions at the airport - heavy rain and lightning which caused reduction in visibility.", "probable_cause": "Inadequate observation of the Ground Movement Area by the “Mulag” tractor operator.\r\nContributing factors:\r\n1. Heavy rain and lightning.\r\n2. Light reflections on the aerodrome surface which hindered observation from the tractor cab.\r\n3. Construction of the \"Mulag” tractor cab, left side of which could partially or completely obscure silhouette of the airplane.\r\n4. Short distance between a service road and taxiway \"O2\"."}