{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-76md-baku-3-killed", "date": "Mar 4, 2004 at 0940 LT", "type": "Ilyushin II-76", "operator": "Azov-Avia", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ankara – Bakou – Kabul", "msn": "00634 68036", "yom": 1986, "flight_number": null, "city": "Baku-Heydar Aliyev (Bina)", "zone": "Absheron", "country": "Azerbaijan", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Ankara, Turkey, on a cargo flight to Kabul, Afghanistan, with an intermediate stop in Baku, Azerbaijan. In Ankara, the airplane was loaded with 39,980 kg of cargo. At Baku Airport, 47 tons of fuel were added, bringing the takeoff weight to 189 tons, and the centre of gravity to 29,3% MAC, which was within the prescribed limits. During the eight-hour stopover the crew decided to rest in the aircraft instead of a hotel. As the aircraft started taxiing to the runway the flight engineer was heard saying that he would select the flaps at 30 degrees and slats at 14 degrees for takeoff. This however was not done. Prior to takeoff the position of the flaps was not verified by any of the crew members. Takeoff was thus commenced with flaps and slats retracted and the stabilizer trimmed at the takeoff position -4 degrees (corresponding to actual takeoff weight, CofG and flaps at 30°). At a speed of 210 km/h the pilot pulled on the control column to lift off the nose gear. At a calculated unstick speed of 265 km/h the angle of attack reached 9 degrees but the plane did not lift off the runway. Accelerating through 290 km/h the angle of attack of the aircraft reached 14,5 degrees, setting off the angle of attack warning on the flight deck. Some 1750 meters down the runway, the aft fuselage struck the runway. Seventy meters further on, at a speed of 300 km/h and an angle of attack of 19,4°, the Ilyushin lifted off the runway. The air traffic controller who witnessed the departure advised the crew to abort the takeoff, but the captain apparently continued. The airplane rolled to the left until the wing contacted the runway. Then the flight engineer noted his error and, without informing the captain, began extending the flaps and slats. Again without informing the captain, the flight engineer brought back the power levers of the four engines to idle. After three seconds he moved them from idle to the 'engine shutdown' position. The captain three times yelled \"takeoff\" but the engines were already shut down. After flying for 490 meters the aircraft struck the ground and crashed.", "probable_cause": "Failure of the flight engineer to extend flaps and slats prior to takeoff. The following contributing factors were identified:\r\n- Poor crew coordination,\r\n- Poor flight preparation,\r\n- Crew fatigue."}