{"url": "https://www.baaa-acro.com/crash/crash-avro-748-378-2b-stansted", "date": "Mar 30, 1998 at 2331 LT", "type": "Avro 748", "operator": "Emerald%20Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Stansted - Leeds-Bradford", "msn": "1791", "yom": 1982, "flight_number": null, "city": "Stansted", "zone": "Essex", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 40, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6100, "captain_hours_type": 3950, "copilot_hours": 1100, "copilot_hours_type": 250, "aircraft_hours": 18352, "circumstances": "Immediately after take-off from London (Stansted) Airport, on a night flight with 30 passengers and 4 crew on board, an uncontained failure of the right engine occurred. This resulted in sudden power loss and a major engine bay fire. The commander elected to land back on the runway. The aircraft overran the paved surface, and uneven ground in the overrun area caused the nose landing gear to collapse. After the aircraft had come to rest, with the engine bay fire continuing, the crew organized a rapid evacuation and all the occupants escaped, with little or no injury. The engine bay fire was extinguished by the Airport Fire Service (AFS), but fuel release continued for some hours.", "probable_cause": "The engine failure was caused by high-cycle fatigue cracking of the High Pressure (HP) turbine disc. Four similar Dart turbine failures had occurred over the previous 26 year period. These had been attributed to a combination of turbine entry flow distortion and turbine blade wear. The following causal factors were identified:\r\n- Significant reduction in the fatigue strength  f the HP turbine disc due to surface corrosion, \r\n- Inadequate control of the fit between engine turbine assembly seal members, possibly influenced by inadequate turbine clamping blot fit, causing sufficient reduction in the natural frequency of an HP turbine disc vibratory mode to allow its excitation within the normal operating speed range and consequent excessive stressing of the disc, \r\n- Fuel leakage from the engine bay fuel system, resulting in a major nacelle fire, \r\n- Failure to identify the turbine assembly seal member fit and HP turbine disc corrosion as possible contributors to disc fatigue damage after previous similar failures."}