{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a60-duke-hurley-3-killed", "date": "Jan 5, 1995 at 1835 LT", "type": "Beechcraft 60 Duke", "operator": "Mt Nebo Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "P-242", "yom": 1973, "flight_number": null, "city": "Hurley-Grant County", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2746, "captain_hours_type": 209, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During climb to cruise the pilot reported a power loss on one engine and received vectors for a return to the departure airport. The pilot was subsequently cleared for the VOR-A approach and reported intercepting the inbound radial. The impact site was right of the inbound radial and short of the extended runway centerline. Weather at the airport was VFR. Post impact fire damaged the airplane. The left engine propeller was in the feather position. Visual and metallurgical examination confirmed the turbocharger shaft separated due to fatigue. The shaft contained chromium. The aircraft overhaul manual states that 'chrome plating...restoration of the shaft...are not permitted.' Metallographics revealed a microstructure of grey iron (automotive application) in the center housing. The turbocharger was overhauled and installed on the left engine in october 1989. All three occupants were killed. ", "probable_cause": "The pilot's failure to maintain airspeed during a single engine approach resulting in an inadvertent stall. Factors were a fatigue separation of a shaft in the left engine turbocharger due to use of a Federal Aviation Administration approved overhaul procedure that was not consistent with the manufacturer's overhaul procedure, and the resultant loss of power to the left engine. "}