{"url": "https://www.baaa-acro.com/crash/crash-pac-750xtol-golgubip", "date": "Jul 19, 2014 at 1143 LT", "type": "PAC 750XL - Pacific Aerospace Corporation", "operator": "Niugini%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kiunga – Golgubip", "msn": "190", "yom": 2013, "flight_number": null, "city": "Golgubip", "zone": "Western (Fly)", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2930, "captain_hours_type": 1900, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 143, "circumstances": "A Pacific Aerospace PAC P-750 XTOL single engine aircraft was chartered to transport store goods and six passengers from Kiunga to Golgubip. Although Golgubip is in mountainous terrain and the weather in the area is often poor, the pilot was tasked to fly there without ever having been to Golgubip before. The terrain to the north north east of Golgubip rises gradually behind the airstrip. Visual illusions which may affect the pilot’s perception of height and distance can be associated with airstrips situated in terrain of this kind. On arrival at Golgubip, the pilot orbited and positioned the aircraft for landing. During the final approach he decided to discontinue the approach and to initiate a go-around procedure. The aircraft impacted terrain approximately 500 metres northwest of the airstrip and was substantially damaged. The six passengers were unhurt while the pilot sustained serious injuries. The pilot was treated in Golgubip following the accident, and was airlifted the next day to Tabubil, where he was admitted to hospital. It was later reported that the GPWS alarm sounded on approach until the final impact. ", "probable_cause": "Loss of control on final approach, maybe following visual illusions."}