{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46f-1-cu-commando-jamaica-5-killed", "date": "Apr 5, 1952 at 0827 LT", "type": "Curtiss C-46 Commando", "operator": "US Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Fort Lauderdale – Charleston – Raleigh – Teterboro", "msn": "22464", "yom": 1945, "flight_number": "US4-2", "city": "New York-Idlewild", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 3, "total_fatalities": 5, "captain_hours": 4760, "captain_hours_type": 2225, "copilot_hours": 2000, "copilot_hours_type": 246, "aircraft_hours": 4293, "circumstances": "The flight was designated as No. 4-2 because it was being operated as the second section of a regularly scheduled cargo flight that left Fort Lauderdale, Florida, on April 4. Flight 4-2 departed Fort Lauderdale April 5, 1952, at 0055, with a crew consisting of Captain William B. Crockett, Jr., and Copilot Jack L. Woerderhoff. The destination was Teterboro, New Jersey, with intermediate stops at Charleston. South Carolina, and Raleigh-Durham, North Carolina. The gross weight of the aircraft upon departure was less than the maximum of 48,000 pounds permitted in cargo operations, and the load was placed so that the aircraft's center of gravity was within prescribed limits. This first segment of the flight was conducted according to visual flight rules. It was entirely routine with a landing at Charleston at 0328. Fuel was added but no cargo was loaded or discharged at Charleston. Takeoff from Charleston was at 0410, with a flight plan calling for instrument flight rules. Again the gross weight was less than the allowable and the center of gravity was within prescribed limits. This segment of the flight was also routine, with a landing at Raleigh-Durham at 0524. Again the cargo remained unchanged although 284 gallons of fuel were added. At Rale-gh-Durhan the pilots were briefed at the office of the U. S. Weather Bureau on current and forecast weather conditions over the route. It was indicated that no difficulty should be encountered en route to the New York area, but the ceilings and visibilities there and at Philadelphia, the alternate, would be 800 feet and live miles with heavy rain upon arrival. At 0554 the crew filed a flight plan according to instrument flight rules to cruise from Raleigh-Durham to new York International Airport (Idlewild) at 3,000 feet. The original destination, Teterboro, was changed because of worsening weather there, and the alternate was Philadelphia International Airport. The estimated time en route was two hours and ten minutes. The aircraft carried fuel for four hours' flight. The 0528 weather sequence reported Idlewild, the destination, as 2,100 feet ceiling and 4-mile visibility, and Philadelphia, the alternate, as also above minimums. Upon departure from Raleigh-Durham at 0608 the aircraft's gross weight was about 172 pounds less than its maximum allowable of 48,000 pounds, and its center of gravity was within prescribed limits. The flight proceeded uneventfully at its planned altitude of 3,000 feet. Routine position reports were made through Air Route Traffic Control and arrival over the Idlewild range station was estimated at 0810. At 0809 the flight was instructed by ARTC (Air Route Traffic Control) to climb to 3,500 feet and to contact Idlewild Approach Control when over Scotland Intersection (where the south-west leg of the Idlewild range intersects the southeast leg of the Newark range). The next instruction to the flight was from Idlewild Approach Control and directed it to hold at Scotland at 3,500 feet, and to expect approach clearance at 0828. The flight reported over Scotland at 3,500 feet at 0817. Immediately following the flight was given Idlewild weather as follows: \"Weather 0804 time now 0817, measured 500 broken, 1800 overcast, visibility 1 1/2 miles in heavy rain, the altimeter 29.82.\" The approach controller first saw the flight on the airport surveillance radar (ASR) when it was approaching Scotland. He asked the flight if it could make a straight-in approach from its present position and the flight replied affirmatively. It was then cleared for a straight-in approach, instructed to descend immediately, and to report passing through 2,500 feet. The flight acknowledged and subsequently reported leaving 2,500 feet, and then leaving 2,000 feet. The controller then cleared the flight to continue descent, to advise upon reaching 1,500 feet, and then cleared it to \"pass over Runway 4 and make left turn into Runway 13 left.\" The next contact with the flight was at 0825, when it reported \"contact\" over the outer marker, located at the Idlewild range station, 2.9 miles from the approach end of Runway No. 4. The local controller then took over control of the flight and advised it to \"bear left and make a right turn into Runway 13L, that's the big runway on the north side of the airport, and call base leg coming up on the Federal Building. Go ahead and you'll probably De west of the Federal Building when you call.\" This was acknowledged by the flight, which presumably intended to comply because the message was not questioned. At 0827 the local controller saw the aircraft below the overcast and at an estimated altitude of 500 feet, between the tower and Runway 4. 2 He at once transmitted, \"Just saw you pass over the airport. You should be passing those hangars now. If you start your left turn and watch the hangers on your left wing, you'll be able to make a left turn into Runway One Three. Go ahead, sir.\" The landing gear appeared to be fully extended, but the flap position was not noticed. A few seconds later the aircraft disappeared from view on a northerly heading and still at an estimated altitude of 500 feet. The local controller at once asked the flight if it had started the left turn, and the flight replied that it was pilling up to execute a missed approach. The tower gave immediate instruction to turn right and proceed to Long Beach intersection (the SE leg of the Idlewild Range and the SW leg of the Hempstead Range, about 10 miles SE of Idlewild) at 1,500 feet altitude. This transmission was acknowledged. This was the last communication from the flight. A very short time later the aircraft crashed at the intersection of 169th Street and 89th Avenue, Jamaica, New York, about 4.4 miles north of the Idlewild control tower. ", "probable_cause": "The Board determines that the probable cause of this accident was loss of control following sudden engine failure caused by a deteriorated fuel feed valve diaphragm during an attempted missed approach. The following findings were pointed out:\r\n- As the flight approached Idlewild it was given the local weather including a measured ceiling of 500 feet and a visibility of one and one-half miles,\r\n- This ceiling and visibility were the minimums for the subject flight,\r\n- The captain elected not to follow the tower's suggestions due to limited forward visibility at his altitude,\r\n- During power application for a missed approach the fuel feed valve diaphragm of the left engine either completely failed or an existing failure became worse, this diaphragm had not been replaced at the time of engine over-haul, as required,\r\n- The left engine then acted erratically with surging, intermittently cutting out,\r\n- At the time the flight was on instruments in turbulent air,\r\n- Control was lost and the aircraft descended rapidly in a sharply nose-down right slip taking on aspects of a spin, and crashed."}