{"url": "https://www.baaa-acro.com/crash/crash-avro-748-335-2a-iqaluit", "date": "Dec 3, 1998 at 1536 LT", "type": "Avro 748", "operator": "First%20Air.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Iqaluit - Igloolik", "msn": "1759", "yom": 1978, "flight_number": "FAB802", "city": "Iqaluit", "zone": "Nunavut", "country": "Canada", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8000, "captain_hours_type": 800, "copilot_hours": 2143, "copilot_hours_type": 117, "aircraft_hours": null, "circumstances": "At approximately 1536 eastern standard time, First Air flight 802, a Hawker Siddeley HS-748-2A, serial number 1759, was on a scheduled flight from Iqaluit to Igloolik, Nunavut. On board were two flight crew, one flight attendant, one loadmaster, and three passengers. During the take-off run on runway 36, at the rotation speed (VR), the captain rotated the aircraft; however, the aircraft did not get airborne. Approximately seven seconds after VR, the captain called for and initiated a rejected take-off. The aircraft could not be stopped on the runway, and the nose-wheel gear collapsed as the aircraft rolled through the soft ground beyond the end of the runway. The aircraft hit the localizer antenna and continued skidding approximately 700 feet. It came to rest in a ravine in a nose-down attitude, approximately 800 feet off the declared end of the runway. The flight attendant initiated an evacuation through the left, main, rear cabin door. The two pilots evacuated the aircraft through the cockpit windows and joined the passengers and the flight attendant at the rear of the aircraft. The flight attendant was slightly injured during the sudden deceleration of the aircraft. The aircraft was substantially damaged.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The captain rejected the take-off at a speed well above the engine-failure recognition speed (V1) with insufficient runway remaining to stop before the end of the runway.\r\n2. The far-forward position of the centre of gravity contributed to the pilot not rotating the aircraft to the normal take-off attitude.\r\n3. The aircraft never achieved the required pitch for take-off. The captain=s inability to accurately assess the pitch attitude was probably influenced by the heavier than normal elevator control forces and the limited nighttime visual references.\r\n4. The loadmaster did not follow the company- and Transport Canada-approved procedures to evaluate the excess baggage added to the aircraft, which led to a discrepancy of 450 pounds and a C of G position further forward than expected.\r\n5. The performance analysis suggested that the aircraft was under-rotated as a result of a forward C of G loading and the generated lift never exceeded the aircraft=s weight during the take-off attempt.\r\nFindings as to Risk:\r\n1. The aircraft was approximately 200 pounds over maximum gross take-off weight.\r\n2. The aircraft accelerated more slowly than normal, probably because of the snow on the runway.\r\n3. Although atmospheric conditions were conducive to contamination and the aircraft was not de-iced, it could not be determined if contamination was present or if it degraded the aircraft performance during the attempted take-off.\r\n4. Water methanol was not used for the occurrence take-off. Use of water methanol may have reduced the consequences of the rejected take-off.\r\n5. The captain did not call for the overrun drill, and none of the items on the checklist were covered by the crew.\r\n6. The co-pilot did not follow the emergency checklist and call air traffic control to advise of the rejected take-off or call over the public address system to advise the passengers to brace.\r\n7. The aircraft lost all its electrical systems during the impact with the large rocks, rendering the radios unserviceable.\r\n8. No HS-748 simulator exists that could be used to train pilots on the various take-off and rejected take-off scenarios.\r\n9. There was confusion regarding the aircraft=s location. The flight service station, fire trucks, and intervening teams were not using an available grid map for orientation.\r\n10. There is a risk associated with not de-icing aircraft before take-off in weather conditions such as those on the day of the accident.\r\n11. There is a risk associated with not calculating the WAT limit and performance of an aircraft during an engine-out procedure in an environment with obstacles.\r\nOther Findings\r\n1. The aircraft=s brakes, anti-skid system, and tires functioned properly throughout the rejected take-off."}