{"url": "https://www.baaa-acro.com/crash/crash-antonov-24rv-bugulma-41-killed", "date": "Nov 26, 1991 at 0502 LT", "type": "Antonov AN-24", "operator": "Tatarstan-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Nizhnevartovsk - Bugulma", "msn": "17307204", "yom": 1971, "flight_number": null, "city": "Bugulma", "zone": "Republic of Tatarstan", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 37, "pax_fatalities": 37, "other_fatalities": 0, "total_fatalities": 41, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Nizhnevartovsk on a charter flight to Bugulma, carrying four crew members and 37 employees from an oil company. Weather conditions in Bugulma were poor with clouds down to 80 metres, icing conditions and a visibility of 800 metres. At an altitude of 1,100 metres on approach, the crew encountered icing conditions but did not consider it necessary to activate the deicing systems. Still descending to the altitude of 900 metres, the icing alarm sounded in the cockpit but the captain decided to continue the approach in such configuration. After the crew selected the flaps down to an angle of 30°, he was cleared to land when the aircraft became unstable and departed the approach path to the right. After the aircraft crossed the permissible deviation limit, the crew was instructed by ATC to initiate a go-around procedure. The captain increased engine power and initiated a go-around maneuver when the aircraft adopted a high angle of attack then stalled and pitched down to an angle of 75-80°. At a speed of 260 km/h, the aircraft struck the ground 802 metres short of runway and was destroyed upon impact. The wreckage was found 598 metres to the right of the extended runway centerline and all 41 occupants were killed. ", "probable_cause": "The accident was the consequence of the combination of the following factors:\r\n- Icing conditions and poor weather conditions that were underestimated and misevaluated by the flight crew, \r\n- An excessive accumulation of frost on the stabilizers (up to 15 millimetres), \r\n- Failure of the crew to activate the deicing systems prior to enter the clouds,\r\n- The decision of the captain to continue the approach after the icing alarm sounded, \r\n- The crew selected flaps down to an angle of 30° without inspecting the wings and stabs surfaces, (in icing conditions, flaps should be deployed in 15° max), \r\n- The flaps were not retracted when the crew initiated the go-around procedure, which caused the aircraft to adopt a high angle of attack,\r\n- Poor crew interactions, \r\n- Lack of crew supervision and mutual monitoring and checks. "}