{"url": "https://www.baaa-acro.com/crash/crash-sukhoi-superjet-100-95b-yakutsk", "date": "Oct 10, 2018 at 0321 LT", "type": "Sukhoi Superjet 100-95", "operator": "Yakutia-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ulan-Ude - Yakutsk", "msn": "95019", "yom": 2012, "flight_number": "SYL414", "city": "Yakutsk-Intl (Platon Oyunsky)", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 87, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13125, "captain_hours_type": 1080, "copilot_hours": 3200, "copilot_hours_type": 1300, "aircraft_hours": 8115, "circumstances": "Following an uneventful flight from Ulan-Ude, the crew initiated the approach to Yakutsk-Platon Oyunsky Intl Airport Runway 23L. Due to work in progress, the runway 05R threshold was displaced by 1,150 metres, reducing the landing distance to 2,248 metres for the runway 23L on which the touchdown zone lighting system was unserviceable. On approach, the crew was informed by ATC that the friction coefficient was 0,45. The crew completed the landing on runway 23L with a slight tailwind component of 4 knots and started the braking procedure. Unable to stop within the remaining distance, the aircraft overran, entered the construction area and collided with the junction of a concrete section under reconstruction, causing both main landing gear to collapse (the left main gear was torn off). The aircraft slid for another 250 metres before coming to rest. All 92 occupants evacuated safely and the aircraft was damaged beyond repair. ", "probable_cause": "The cause of the aviation accident with the RRJ 95B RA-89011 aircraft when landing at night with one deactivated thrust reverser was the transfer to the crew of incorrect information about the value of the friction coefficient, which led to the landing on an icy runway, the average normative friction coefficient which was less than 0.3, which did not allow landing in accordance with current regulations. This led to a significant increase in landing distance, rolling the aircraft out of the runway and collision with the junction of the reconstructed section of the runway with a height of about 0.4 m, which led to the destruction of the main landing gear supports and damage to the engines with fuel leakage without causing a fire.\r\nThe contributing factors were the following:\r\n- Absence of a connecting ramp (which was not envisaged by the reconstruction project) between the current and the part of the runway being reconstructed;\r\n- inefficiency of the SMS of Yakutsk Airport JSC in terms of identification and control of risks associated with the possibility of ice formation at the runway, and insufficient control over the implementation of the SMS by aviation authorities;\r\n- erroneous determination of the Xc value at the last measurement;\r\n- inefficiency of ice removal procedure during runway cleaning due to lack of chemical reagents for ice removal and/or thermal machines at the airfield;\r\n- lack of information from the RRJ-95LR-100 RA 89038 aircraft crew about actual rolling out of the runway, which was an aviation incident and was subject to investigation;\r\n- failure by airport and ATC officials to take appropriate action after receiving the RRJ-95LR-100 RA-89038 low friction report from the aircraft crew."}