{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-hallo-bay", "date": "May 22, 2006 at 1300 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Andrew%20Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Hallo Bay-Kodiak", "msn": "1687", "yom": 1967, "flight_number": null, "city": "Hallo Bay", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7460, "captain_hours_type": 40, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16360, "circumstances": "The commercial certificated pilot was departing a remote bay with five passengers in an amphibious float-equipped airplane on the return portion of a Title 14, CFR Part 135 sightseeing flight. The pilot began the takeoff run toward the north, with the wind from the north between 15 to 20 knots, and 4 to 6 foot sea swells. When the airplane had climbed to about 10 to 15 feet, the pilot said a windshear was encountered, which pushed the airplane down. The airplane's floats struck a wave, missed about 4 to 5 swells, and then struck another wave, which produced a loud \"bang.\" The company guide, seated in the right front seat, told the pilot that the right float assembly was broken and displaced upward. The airplane cleared a few additional swells, and then collided with the water. Both float assemblies were crushed upward, and the left float began flooding. The guide exited the airplane onto the right float, and made a distress call via a satellite telephone. All occupants donned a life preserver as the airplane began sinking. The pilot said that after about 15 minutes, the rising water level in the airplane necessitated an evacuation, and all occupants exited into the water, and held onto the right float as the airplane rolled left. The airplane remained floating from the right float, and was being moved away from shore by wind and wave action. The pilot said that one passenger was washed away from the float within about 5 minutes, and two more passengers followed shortly thereafter. Within about 5 minutes after entering the water, the pilot said he lost his grip on the float, and does not remember anything further until regaining consciousness in a hospital. He was told by medical staff that he had been severely hypothermic. U.S. Coast Guard aircraft were already airborne on a training mission, and diverted to rescue the occupants. About 1320, a C-130 flew overhead, and began dropping inflatable rafts. The company guide was the only one able to climb into a raft. When the helicopters arrived, they completed the rescue using a hoist and a rescue swimmer. The passengers reported that they also were unable to hold onto the airplane after entering the water, became unconscious, and were severely hypothermic upon reaching a hospital. The airplane was not equipped with a life raft, and was not required to be so equipped.\n", "probable_cause": "The pilot's inadequate evaluation of the weather conditions, and his selection of unsuitable terrain (rough water) for takeoff, which resulted in a collision with ocean swells during takeoff initial climb, and a hard emergency landing and a roll over. Factors contributing to the accident were a windshear, rough water, and buckling of the float assemblies when the airplane struck the waves."}