{"url": "https://www.baaa-acro.com/crash/crash-avro-504n-carlton-cleveland", "date": "Sep 15, 1936", "type": "Avro 504", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Military", "survivors": "Yes", "site": "Mountains", "schedule": "Hendon – Abbotsinch", "msn": "K1982", "yom": 1931, "flight_number": null, "city": "Carlton-in-Cleveland", "zone": "Yorkshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was being ferried from Hendon to Abbotsinch Airfield up the east coast of England. It is thought that it took a route commonly used at the time which involved flying up the North-East coast of England and using airfields on the route to refuel. During the stretch from Driffield to Usworth, the pilot lost his bearings in fog and flew into a hillside close to Dromonby Grange Farm located near Carlton-in-Cleveland. The aircraft was badly damaged and the pilot injured. The accident was heard by local people who were soon on the scene. He was treated at the scene by Dr. S. T. Pybus of Stokesley before being taken to the Station Sick Quarters at Thornaby Airfield where he spent two days. He was then transferred to a military hospital where he spent a further twenty five days before being released. Avro 504 K1982 was built to contract 90666/31 by A.V. Roe Ltd in Manchester and delivered to Kenley on 9th July 1931. It was issued to 602 (City of Glasgow) Squadron on 12th May 1932. Following the incident detailed above the wreckage was removed to Thornaby Airfield where it was struck off charge on 1st December 1936 as damaged beyond economical repair.\r\nCrew:\r\nF/O James Galt MacIntyre.\r\nSource:\r\nhttp://www.yorkshire-aircraft.co.uk/aircraft/planes/preww2/k1982.html", "probable_cause": "The pilot lost his bearings while cruising in foggy conditions."}