{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-820c-navajo-belo-horizonte-4-killed", "date": "Jun 11, 2003 at 1600 LT", "type": "Embraer EMB-820 Navajo/Carajá", "operator": "Astro Taxi Aéreo", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Belo Horizonte – Juiz de Fora", "msn": "820-044", "yom": 1977, "flight_number": null, "city": "Belo Horizonte-Pampulha-Carlos Drummond de Andrade", "zone": "Minas Gerais", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 180, "captain_hours_type": null, "copilot_hours": 150, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Belo Horizonte-Pampulha Airport at 1522LT on a taxi flight to Juiz de Fora, carrying two pilots, two passengers and a load of valuables. While cruising about 35 nm south of Belo Horizonte, the crew encountered technical problems with the engines and elected to return for an emergency landing. On approach to runway 13, the aircraft was too high and the crew was cleared to make a 360 turn to reduce his altitude. Doing so and after he completed 270° of this turn, the aircraft entered an uncontrolled descent and crashed 2 km short of runway, bursting into flames. The aircraft was totally destroyed by impact forces and a post crash fire and all four occupants were killed. ", "probable_cause": "The right engine suffered a oil leak in flight following the failure of a hose due to poor maintenance. The following contributing factors were identified:\r\n- Both pilots did not have sufficient experience nor training on this type of aircraft,\r\n- The copilot was flying for this operator for the first time, \r\n- The operator was unable to provide any maintenance documentation nor crew training documentation to investigators, \r\n- Both engines were running at impact but with limited power,\r\n- The right propeller was feathered at impact."}