{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-25-marquise-cobb-county", "date": "Sep 28, 2011 at 1715 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Laurel Mountain Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Huntsville - Cobb County", "msn": "257", "yom": 1973, "flight_number": null, "city": "Cobb County-McCollum", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11100, "captain_hours_type": 1500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6196, "circumstances": "The pilot stated that after landing, the nose landing gear collapsed. Examination of the airplane nose strut down-lock installation revealed that the strut on the right side of the nose landing gear trunnion was installed incorrectly; the strut installed on the right was a left-sided strut. Incorrect installation of the strut could result in the bearing pulling loose from the pin on the right side of the trunnion, which could allow the nose landing gear to collapse. A review of maintenance records revealed recent maintenance activity on the nose gear involving the strut. The design of the strut is common for the left and right. Both struts have the same base part number, and a distinguishing numerical suffix is added for left side and right side strut determination. If correctly installed, the numbers should be oriented facing outboard. The original MU-2 Maintenance Manual did not address the installation or correct orientation of the strut. The manufacturer issued MU-2 Service Bulletin (SB) No. 200B, dated June 24, 1994, to address the orientation and adjustment. Service Bulletin 200B states on page 8 of 10 that the “Part Number may be visible in this (the) area from the out board sides (Inked P/N may be faded out).”", "probable_cause": "The improper installation of the nose landing gear strut and subsequent collapse of the nose landing gear during landing.\n"}