{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-26-islander-anguilla", "date": "Feb 2, 2008 at 1420 LT", "type": "Britten-Norman Islander", "operator": "Air%20Montserrat", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Anguilla - Sint Maarten", "msn": "88", "yom": 1969, "flight_number": null, "city": "Anguilla", "zone": "All Anguilla", "country": "Anguilla", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4217, "captain_hours_type": 693, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The commander intended to fly the BN-2 Islander aircraft from Anguilla Wallblake International Airport (AXA) to the neighbouring island of St Maarten (SXM) to await cargo inbound on another flight. The cabin of the aircraft was configured for cargo operations with no passenger seats fitted, as the only other planned occupant was the operator’s Chief Engineer, who would be sitting beside the commander in the right hand seat. However, the commander asked the operator if he could take a family member with him to SXM. The operator agreed and an extra seat was fitted. Witnesses stated that the commander appeared \"rushed\" prior to departure. The commander stated that he partially carried out the normal pre-flight inspection. He then started the engines. Before taxiing he realised that the nose landing gear chocks were still in place so he shut down the left hand engine, removed and stowed the chocks and then restarted the left engine. The aircraft took off from runway 10 at 14:15 hrs. At between 100 ft and 150 ft the commander initiated a left turn but after some initial movement the ailerons jammed. When he discovered that he was unable to straighten the ailerons he attempted to return to land on runway 10. The other flight controls did not appear to be restricted. With the ailerons jammed, the aircraft continued to turn to the left, losing altitude as it flew over a settlement to the north of the aerodrome, until pointed directly at the Air Traffic Control tower, causing the Air Traffic Control Officer (ATCO) to abandon the tower. The commander judged that the aircraft was too fast and high to attempt a landing and therefore initiated a go-around, applying full power. He continued the left turn, losing height and speed to position the aircraft for another approach but, as the aircraft descended over the northern edge of the runway, its left wing struck the perimeter fence. On impact the aircraft spun about its vertical axis with its wings level and continued sliding sideways on its right side for approximately 80 ft before coming to rest facing north-west.", "probable_cause": "The commander was probably distracted from his normal duties whilst arranging additional seating to accommodate the second passenger. He did not complete the requisite pre-flight check or the subsequent check of full and free movement of the flight controls, either of which would have revealed an obstruction to proper operation of the ailerons."}