{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226at-merlin-iva-columbretes-islands-10-killed", "date": "Oct 10, 2001 at 1042 LT", "type": "Swearingen SA226AT Merlin IV", "operator": "Flightline%20Spain", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Barcelona - Oran", "msn": "AT-043", "yom": 1976, "flight_number": "FTL101", "city": "Columbretes Islands", "zone": "Valencian Community", "country": "Spain", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11950, "circumstances": "The twin engine airplane departed Barcelona Airport at 1018LT on a charter flight to Oran, Algeria, carrying eight American businessmen and two pilots. En route, while cruising along the Spanish coast, the crew encountered poor weather conditions with thunderstorm activity, and was cleared to deviate from the prescribed flight plan to the east. Shortly later, the aircraft entered an area of heavy turbulences and was presumably struck by lighting, causing the electrical system to fail. The aircraft entered an uncontrolled descent and crashed in the Mediterranean Sea about 18 km northwest of the Columbretes Islands. Few debris were found floating on water and all 10 occupants were killed. ", "probable_cause": "Although the causes of the accident could not be determined, considering the circumstances in which it occurred and the history of similar events with aircraft of the same type, is considered that the probable cause of the accident was a total loss of the electrical system, caused by a lightning strike in the middle of the storm in which it was flying, without the crew being able to recover. It is possible that the lightning strike produced other damages to the airplane and/or could have induced or produced failures in other systems of the airplane. The set of these circumstances, aggravated by the storm, with strong rains and turbulence and the associated lack of visibility, lead to the impact of the airplane with the sea."}