{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-1-do-skymaster-castel-benito-1-killed", "date": "Feb 4, 1949", "type": "Douglas C-54 Skymaster", "operator": "Skyways-of-London-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nairobi – Khartoum – Tripoli – London", "msn": "7464", "yom": 1944, "flight_number": null, "city": "Castel Benito (Qaser Bin Ghashir)", "zone": "Tripoli (طرابلس)", "country": "Libya", "region": "Africa", "crew_on_board": 9, "crew_fatalities": 1, "pax_on_board": 44, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The descent to Tripoli-Castel Benito Airport was completed in poor weather conditions with heavy rain falls and a visibility reduced to two miles. On final approach at an altitude of 700 feet, both right engines stopped simultaneously. The pilot lost control of the aircraft that stalled and crashed in a wooded area located few miles short of runway. Fifteen occupants were injured while 37 others were unarmed. Unfortunately, a crew member was killed. ", "probable_cause": "Failure of the captain to maintain a safe height by using available power on both left engines after the failure of both right engines. The reason for this failure by the captain could not be determined. The failure of both right engines was caused by a fuel starvation due to an insufficient amount of fuel in the right tank. This fuel shortage was the result of the wing tanks being allowed to become progressively unbalanced during the last stage of the flight. An attempt by the flight engineer under emergency conditions to cross feed the right engines from the left tanks failed owing to the full operation not having been completed in time."}