{"url": "https://www.baaa-acro.com/crash/crash-pac-cresco-08-600-near-carterton-1-killed", "date": "Apr 24, 2020 at 0710 LT", "type": "PAC Cresco 08-600 (08-750)", "operator": "Ravensdown%20Aerowork", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Mountains", "schedule": null, "msn": "30", "yom": 2002, "flight_number": null, "city": "Carterton", "zone": "Greater Wellington Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 15000, "captain_hours_type": 8700, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 24 April 2020 the pilot of a Pacific Aerospace Cresco 08-600 aircraft, registered ZK-LTK (the aeroplane), was conducting agricultural flight operations spreading superphosphate fertilizer on a farm in the Kourarau Hill area, near Masterton. The airstrip was a typical topdressing airstrip, with a downward slope and a left bend of about 5 degrees partway down the strip, in the direction of take-off. The ground at the end of the airstrip dropped sharply away to a valley that ran perpendicular to the direction of the airstrip. On the commencement of the third topdressing flight, witnesses reported, the aeroplane accelerated normally from the loading point. However, the aeroplane did not follow the direction of the airstrip around to the left, as it had done during the previous two flights. Instead, the aeroplane continued in a straight line from the load point and subsequently struck uneven terrain off to the right of the airstrip. The impact with the uneven terrain caused the right main undercarriage assembly to fracture off and damage the right wing and flap. The aeroplane descended into the valley, striking a tree with the right-hand wing, then continued across the valley floor and impacted the far side of the valley, coming to rest inverted. The aeroplane was destroyed by the impacts and a post-crash fire. The sole pilot occupant did not survive the accident sequence.", "probable_cause": "The following findings were identified:\r\n- The pilot did not make the necessary left turn during the take-off roll to align with the strip centreline, so the aeroplane continued the take-off roll in a straight line.\r\n- The right-rear undercarriage struck uneven ground with sufficient force to break the undercarriage mounting brackets and dislodge the undercarriage assembly from the aeroplane.\r\n- The right main undercarriage subsequently struck the right flap, resulting in a partial dislocation of the flap. This very likely resulted in the aeroplane becoming uncontrollable.\r\n- The pilot was about as likely as not to have been incapacitated early in the take-off roll."}