{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690b-pacific-ocean-9-killed", "date": "Oct 2, 1994 at 1315 LT", "type": "Rockwell Grand Commander 690", "operator": "Seaview Air", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Sydney - Williamtown - Lord Howe Island", "msn": "690-11380", "yom": 1977, "flight_number": "CD111", "city": "Pacific Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 2915, "captain_hours_type": 60, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6014, "circumstances": "At 1018 hours EST, on Sunday 2 October 1994, the pilot submitted a flight plan by telephone to the Melbourne Regional Briefing Office of the Civil Aviation Authority. The flight plan indicated that Aero Commander 690 aircraft VH-SVQ would be conducting a regular public transport service, flight CD 111, from Sydney (Kingsford-Smith) Airport to Lord Howe Island with an intermediate landing at Williamtown. The flight was planned to operate in accordance with instrument flight rules with a nominated departure time from Sydney of 1100 hours. The aircraft was crewed by one pilot. The aircraft departed Sydney at 1117, carrying baggage that had been off-loaded from another company service which was to operate direct from Sydney to Lord Howe Island that day. The flight to Williamtown apparently proceeded normally and the aircraft arrived at about 1140. The company had no ground-based representatives at Williamtown but the pilot was observed by other persons in the terminal building to converse with passengers before proceeding to the aircraft. No other person saw the pilot and the passengers board the aircraft. At 1206 the pilot informed Sydney Flight Service that the aircraft was taxiing at Williamtown for Lord Howe Island and that he intended climbing to flight level (FL) 210. Departure was subsequently reported as 1208 when the pilot reported tracking 060 on climb to FL230 which was the original planned cruising level. The pilot reported passing 20,000 feet on climb to FL210 at 1229 and shortly afterwards asked if VH-IBF, a company aircraft flown by the chief pilot and operating from Sydney direct to Lord Howe Island, had departed. The pilot was advised that it had departed. The radar trace showed that the climb was discontinued at 20,400 ft at 1231:22. Three seconds later the aircraft commenced descent. The last recorded radar trace for SVQ was at 19,800 ft at 1232:54. The pilot of SVQ did not report at the position ‘Shark’ at 1232 as scheduled in his flight plan, and at 1235 he notified that the aircraft had commenced a descent to FL130. At 1238, the pilot of SVQ asked Sydney Flight Service if IBF was listening on high frequency and was advised that the aircraft was not due on frequency for another 30 minutes. He requested that the pilot of IBF call him on the company VHF frequency and reported that the aircraft had just passed ‘Shark’ and he would shortly provide an estimate for the next position, ‘Shrimp’. At 1245, he provided an estimate for ‘Shrimp’ of 1310 and stated that the aircraft was maintaining FL160. No explanation of the amended level was given by the pilot or sought by Sydney Flight Service. The chief pilot subsequently stated that he contacted SVQ on company frequency at about 1240 and that the pilot of that aircraft reported a severe vibration which he thought was caused by airframe or propeller icing. He also confirmed that he had turned the propeller heat on. The chief pilot recalled that he asked the pilot of SVQ if the cockpit indication showed that the propeller heat was working normally, to which he replied ‘yes its working’. During this period, the chief pilot and the pilot of SVQ had also discussed crew rostering. Prior to contact with the chief pilot, the pilot of SVQ contacted the pilot of VH-SVV, another company aircraft which was operating a flight from Coffs Harbour to Lord Howe Island. At 1316, after SVQ had not reported at the ‘Shrimp’ position, Sydney Flight Service commenced communications checks but was unable to establish communications with SVQ directly or through any other aircraft. At 1325 an uncertainty phase was declared and the Melbourne Rescue Coordination Centre was subsequently notified at 1331. At 1401 the duty officer at the Melbourne Rescue Coordination Centre contacted the Lord Howe Island aerodrome terminal and left a message for the pilot of IBF to telephone the Centre. After the arrival of IBF at Lord Howe Island, the company managing director, who was also on board the aircraft, called the Melbourne Search and Rescue Centre at 1410 to inquire about SVQ. Arrangements were made by the company and Civil Aviation Authority search and rescue to organise search aircraft and a distress phase was declared at 1411. Subsequently, the crews of IBF and SVV reported hearing a radio transmission from the pilot of SVQ, stating that he had ‘lost it’. Attempts at the time by the chief pilot to contact SVQ were unsuccessful.", "probable_cause": "The factors that directly related to the loss of the aircraft could not be determined."}