{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154m-smolensk-96-killed", "date": "Apr 10, 2010 at 1041 LT", "type": "Tupolev TU-154", "operator": "Polish%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Government", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Warsaw - Smolensk", "msn": "90A-837", "yom": 1990, "flight_number": "PLF101", "city": "Smolensk", "zone": "Smolensk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 88, "pax_fatalities": 88, "other_fatalities": 0, "total_fatalities": 96, "captain_hours": 3531, "captain_hours_type": 2906, "copilot_hours": 1909, "copilot_hours_type": 475, "aircraft_hours": 5142, "circumstances": "On approach to Smolensk Airport in poor weather conditions, crew was forced to make a go-around and approach was abandoned three times. On the fourth approach, at a speed of 260 km/h, aircraft went beyond the minimum safe altitude, hit tree tops, lost its left wing and crashed in a huge explosion. All 96 occupants were killed, among them the President of the Polish Republic Lech Kaczyński  and his wife. He was flying to Smolensk to take part to the commemoration of the 70th anniversary of Katyn massacre when Soviet Army killed 20,000 Polish officers. Among the delegation were also members of the Polish Senate and Government; the ex President, the vice-president of low Chamber, the Senate vice-president, the president of the polish central bank, the chief of military staff, the chief of ground forces, the chief of the Air Force, the chief of special forces, the chief of Marines, the personal assistant of President, the chief of National Security, the vice-Minister of Defense and the vice-Minister of Foreign Affairs. ", "probable_cause": "The immediate cause of the accident was the descent below the minimum descent altitude at an excessive rate of descent in weather conditions which prevented visual contact with the ground, as well as a delayed execution of the go-around procedure. Those circumstances led to an impact on a terrain obstacle resulting in separation of a part of the left wing with aileron and consequently to the loss of aircraft control and eventual ground impact. \r\nCircumstances Contributing to the Accident:\r\n1) Failure to monitor altitude by means of a pressure altimeter during a non-precision approach; \r\n2) failure by the crew to respond to the PULL UP warning generated by the TAWS;\r\n3) attempt to execute the go-around maneuver under the control of ABSU (automatic go-around)\r\n4) Approach Control confirming to the crew the correct position of the airplane in relation to the RWY threshold, glide slope, and course which might have affirmed the crew's belief that the approach was proceeding correctly although the airplane was actually outside the permissible deviation margin; \r\n5) failure by LZC to inform the crew about descending below the glide slope and delayed issuance of the level-out command;\r\n6) incorrect training of the Tu-154M flight crews in the 36 Regiment. \r\nConducive circumstances \r\n1) incorrect coordination of the crew's work, which placed an excessive burden on the aircraft commander in the final phase of the flight; \r\n2) insufficient flight preparation of the crew; \r\n3) the crew‘s insufficient knowledge of the airplane's systems and their limitations; \r\n4) inadequate cross-monitoring among the crew members and failure to respond to the mistakes committed;\r\n5) crew composition inadequate for the task; \r\n6) ineffective immediate supervision of the 36 Regiment's flight training process by the Air Force Command;\r\n7) failure by the 36 Regiment to develop procedures governing the crew's actions in the event of: \r\na) failure to meet the established approach criteria; \r\nb) using radio altimeter for establishing alarm altitude values for various types of approach; \r\nc) distribution of duties in a multi-crew flight. \r\n8) sporadic performance of flight support duties by LZC over the last 12 months, in particular under difficult WC, and lack of practical experience as LZC at the SMOLENSK NORTH airfield. "}