{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-14-denver-28-killed", "date": "Nov 15, 1987 at 1415 LT", "type": "Douglas DC-9", "operator": "Continental%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Denver - Boisé", "msn": "45726", "yom": 1966, "flight_number": "CO1713", "city": "Denver-Stapleton", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 3, "pax_on_board": 77, "pax_fatalities": 25, "other_fatalities": 0, "total_fatalities": 28, "captain_hours": 12125, "captain_hours_type": 133, "copilot_hours": 3186, "copilot_hours_type": 36, "aircraft_hours": 42184, "circumstances": "Weather conditions were moderate snow and freezing temperatures. Following a 27 minute delay between deicing and departure, on takeoff the aircraft was over-rotated by the first officer. Aircraft control was lost, the aircraft stalled and impacted off the right side of the runway. Company procedures called for repeat deicing when in icing conditions if a delay exceeds 20 minutes. Confusion between the tower and the flight crew due to procedural errors resulted in the delayed takeoff clearance. Both pilots were inexperienced in their respective crew positions. The captain had 33 hours experience as a DC-9 captain. The first officer had 36 hours jet experience, all in the DC-9. First officer demonstrated weak scan in training and had pilot performance problems with previous employers. First officer was on reserve, and had not flown for 24 days. The trip was assigned to the first officer for proficiency. Flight was first officer's 2nd trip as DC-9 first officer. Wing vortices from a landing aircraft on a parallel runway were not a factor in the accident. ", "probable_cause": "The captain's failure to have the airplane de-iced a second time after delay before take-off that led to upper wing surface contamination and a loss of control during rapid take-off rotation by the first officer.\r\nContributing was the absence of regulatory or management controls governing operations by newly qualified flight crew members and the confusion that existed between the flight crew and air traffic controllers that led to the delay in departure."}