{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-850-racine-1-killed", "date": "Sep 5, 2011 at 1833 LT", "type": "Socata TBM-850", "operator": "Green Plane", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Mosinee – Waukegan", "msn": "546", "yom": 2010, "flight_number": null, "city": "Racine", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2075, "captain_hours_type": 165, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 217, "circumstances": "During cruise flight, the pilot reported to an air traffic controller that the airplane was having engine fuel pressure problems. The controller advised the pilot of available airports for landing if necessary and asked the pilot's intentions. The pilot chose to continue the flight. GPS data recorded by an onboard avionics system indicated that the engine had momentarily lost total power about 20 seconds before the pilot reported a problem to the controller. About 7 minutes later, when the airplane was about 7,000 feet above ground level, the engine lost total power again, and power was not restored for the remainder of the flight. The pilot attempted to glide to an airport about 10 miles away, but the airplane crashed in a field about 3 miles from the airport. GPS data showed a loss of fuel pressure before each of the engine power losses and prolonged lateral g forces consistent with a side-slip flight condition. The rudder trim tab was found displaced to the left about 3/8 inch. Flight testing and recorded flight data revealed that the rudder trim tab displacement was consistent with that required to achieve no side slip during a typical climb segment.  The GPS and flight data indicated that the lateral g-forces increased as the airplane leveled off and accelerated, indicating that the automatic rudder trim feature of the yaw damper system was either not engaged or not operating. The recorded data indicated autopilot system engagement, which should have automatically engaged the yaw damper system. However, the data indicated the yaw damper was not engaged; the yaw damper could have subsequently been turned off by several means not recorded by the avionics system. Testing of the manual electric rudder (yaw) trim system revealed no anomalies, indicating that the pilot would have still been able to trim the airplane using the manual system. It is likely that the pilot's failure to properly trim the airplane's rudder led to a prolonged uncoordinated flight condition. Although the fuel tank system is designed to prevent unporting of the fuel lines during momentary periods of uncoordinated flight, it is not intended to do so for extended periods of uncoordinated flight. Therefore, the fuel tank feed line likely unported during the prolonged uncoordinated flight, which resulted in the subsequent loss of fuel pressure and engine power. The propeller and propeller controls were not in the feathered position, thus the windmilling propeller would have increased the airplane's descent rate during the glide portion of the flight. The glide airspeed  used by the pilot was 20 knots below the airspeed recommended by the Pilot's Operating Handbook (POH), and the reduced airspeed also would have increased the airplane's descent rate during the glide. The flight and GPS data indicated that the airplane had a gliding range of about 16 nautical miles from the altitude where the final loss of engine power occurred; however, the glide performance was dependent on several factors, including feathering the propeller and maintaining the proper airspeed, neither of which the  pilot did. Although the POH did not contain maximum range glide performance data with a windmilling propeller, based on the available information, it is likely that the airplane could have glided to the alternate airport about 10 miles away if the pilot had followed the proper procedures.", "probable_cause": "The pilot's failure to properly trim the airplane's rudder during cruise flight, which resulted in a prolonged uncoordinated flight condition, unporting of the fuel tank feed line, and subsequent fuel starvation and engine power loss. Contributing to the accident was the pilot's failure to feather the engine's propeller and maintain a proper glide airspeed following the loss of engine power.\n"}