{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-4-near-issoudun-79-killed", "date": "Aug 11, 1957 at 1415 LT", "type": "Douglas DC-4", "operator": "Maritime%20Central%20Airways", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "London – Keflavik – Goose Bay – Toronto", "msn": "18374", "yom": 1944, "flight_number": null, "city": "Issoudun", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 73, "pax_fatalities": 73, "other_fatalities": 0, "total_fatalities": 79, "captain_hours": 13500, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "CF-MCF departed London, England at 2148 GMT on 10 August on a charter flight to Toronto, Canada, with planned refuelling stops at Keflavik, Iceland and Goose Bay, Labrador. It carried a crew of 6 and 73 passengers (including 2 infants) The aircraft departed from Keflavik at 0512 GMT on 11 August, after a stop of 1 hour 6 minutes during which it was refuelled to capacity. At 1320 GMT it advised that it would overfly Goose Bay and proceed to Montreal. It arrived over Goose Bay at 1403, nineteen minutes ahead of its ETA, over Seven Islands at 1558 GMT and over Quebec Radio Range at 1807 hours Quebec Radio Range Station relayed a message to the aircraft at 1810 requesting it to contact Montreal Range approaching Rougemont for clearance - this was the last contact with the aircraft. While cruising at an altitude of 6,000 feet, the aircraft went through a thunderstorm area, went out of control and entered a spin. In a 70° nose-down attitude, the airplane struck the ground at a speed of 200 knots and disintegrated in a field located 7 km west of Issoudun. All 79 occupants have been killed. ", "probable_cause": "The accident was attributed to severe turbulence encountered whilst flying in a cumulonimbus cloud, resulting in a chain of events quickly leading up to a complete loss of control and causing the aircraft to dive to the ground m a near vertical nose-down attitude. "}