{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-600-mt-black-fork-11-killed", "date": "Sep 27, 1973 at 2052 LT", "type": "Convair CV-600", "operator": "Texas%20International", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Memphis – Pine Bluff – El Dorado – Texarkana – Dallas", "msn": "56", "yom": 1948, "flight_number": "TI655", "city": "Mt Black Fork", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 11800, "captain_hours_type": 6000, "copilot_hours": 7106, "copilot_hours_type": 4500, "aircraft_hours": 51208, "circumstances": "Texas International Airlines Flight 655 was a regularly scheduled passenger and cargo flight from Dallas to Memphis and return, with en route stops at Texarkana, El Dorado, and Pine Bluff. Flight 655 departed Memphis on the return flight at 18:42. After a stop at Pine Bluff, the flight continued toward El Dorado were it landed at 19:53. The crew conferred with the waiting pilots and used the Convair's weather radar to examine the weather echoes west of El Dorado. The crew commented on what appeared to be a 15-mile-wide break in the line of weather echoes, near the 300° radial of the El Dorado VORTAC and about 35 miles west-northwest of the airport. As Flight 655 taxied to runway 22, the crew contacted the FSS and stated that they were taxiing and would be proceeding under visual flight rules (VFR) to Texarkana. The aircraft took off at 20:15. After takeoff, the aircraft flew a magnetic heading of 290° and climbed to an altitude of 1,500 feet msl. The flight operated between altitudes of 1,500 feet and 3,000 feet until 20:49:47. From that time until the time of impact at 20:52:19, the aircraft's altitude varied between 2,200 feet and 2,025 feet. As the flight progressed, the first officer (pilot flying) expressed concern about the flight's position relative to the elevation of the terrain. About 12 minutes before impact, the first officer stated, \"I sure wish I knew where ... we were.\" A few minutes later he stated, \"Paintin' ridges and everything else boss, and I'm not familiar with the terrain.\" Two minutes and 40 seconds before impact and after the captain's ordered descent to 2,000 feet, the first officer said, \"I'll be .... Man, I wish I knew where we were so we'd have some idea of the general ... terrain around this ... place.\" The captain told the first officer that the highest point in the area was \"twelve hundred\" feet and that they were not near that point. About 14 seconds before impact, the first officer mentioned that they were about to pass over Page VORTAC. Six seconds later the captain said that the heading to Texarkana was 180°. The first officer said that it was 152°. At 20:52:17, the first officer said, \"Minimum en route altitude here is forty-four hun...\" His statement was terminated by the sound of the crash. The aircraft crashed into the steep, heavily wooded, north slope of Black Fork Mountain in the Ouachita Mountain Range at an elevation of 2,025 feet (617 m) and about 600 feet below the top of the ridge.", "probable_cause": "The captain's attempt to operate the flight under VFR in night IMC without using all the navigational aids and information available to him; and his deviation from the preplanned route, without adequate position information. The carrier did not monitor and control adequately the actions of the flight crew or the progress of the flight."}