{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46a-50-cu-commando-near-little-valley-26-killed", "date": "Dec 29, 1951 at 2225 LT", "type": "Curtiss C-46 Commando", "operator": "Continental Charters", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Miami – Pittsburgh – Buffalo", "msn": "30466", "yom": 1944, "flight_number": "COC44-2", "city": "Little Valley", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 36, "pax_fatalities": 23, "other_fatalities": 0, "total_fatalities": 26, "captain_hours": 3107, "captain_hours_type": null, "copilot_hours": 6361, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Flight 44-2 originated at Miami, Florida, and was scheduled to depart there for Buffalo, New York, via Pittsburgh, Pennsylvania, at 1000, December 29, 1951. Because of a mechanical delay actual takeoff was not made until 1540. The crew consisted of Captain Victor A. Harris, Copilot Hans E. Rutzebeck, and Stewardesses Pearl Moon and Dolores Harvey. On board were 24 passengers for Pittsburgh, four passengers for Buffalo, and three extra crew members who were to fly the return trip to Miami. The flight arrived at Pittsburgh without incident at 2115 and 24 passengers deplaned. At Pittsburgh 29 Miami-hound passengers, including an infant, boarded the aircraft. It was originally planned that these passengers would be picked up on the southbound flight Buffalo to Miami, however, due to the fact that the flight was 5 hours 40 minutes late arriving Pittsburgh, the passengers were enplaned northbound in order that, after servicing, the flight could proceed nonstop Buffalo to Miami. No fuel was added at Pittsburgh and Flight 44-2 departed there for Buffalo at 2147 on a VFR flight plan. The takeoff weight was 40,263 pounds, which was 4 737 pounds less than the aircraft's certificated gross of 45,000 pounds, and the disposable load was properly distributed with respect to the center of gravity. At 2152 the flight called Pittsburgh Tower and reported its time off was 2147, this was the last radio contact. When the flight failed to arrive at Buffalo within a reasonable time after its ETA (2247), a search was initiated. It was not until 1433, December 31, however, chat a report was confirmed to the Sheriff's office, Cattaraugus County, New York, that the aircraft wreckage had been located in a heavily wooded area near Little Valley, New York. A survivor, who had made his way from the wreckage to a farmhouse to obtain help, reported that the crash occurred at 2225 December 29, approximately 38 minutes after the flight departed Pittsburgh.", "probable_cause": "The Board determines that the probable cause of this accident was the captain's poor judgement in attempting a flight by visual reference during instrument weather conditions. The following findings were pointed out:\r\n- The flight departed Pittsburgh on a VFR flight plan when IFR conditions prevailed over the proposed direct Pittsburgh-Buffalo route,\r\n- The flight from Pittsburgh to the accident scene was conducted below the minimum altitude prescribed for VFR night operation,\r\n- The accident occurred approximately 11 miles east of the direct course, Pittsburgh to Buffalo, and under conditions of almost zero ceiling and visibility.\n"}