{"url": "https://www.baaa-acro.com/crash/crash-fokker-50-nairobi-4-killed", "date": "Jul 2, 2014 at 0417 LT", "type": "Fokker 50", "operator": "Skyward%20International%20Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Nairobi - Mogadishu", "msn": "20262", "yom": 26, "flight_number": null, "city": "Nairobi-Jomo Kenyatta (ex Embakasi)", "zone": "Nairobi City District", "country": "Kenya", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 14531, "captain_hours_type": 6821, "copilot_hours": 823, "copilot_hours_type": 513, "aircraft_hours": 27342, "circumstances": "On 2 July 2014, about 01.14 UTC, 5Y-CET, a Fokker F50, an international cargo flight, operated by Skyward International, crashed shortly after takeoff from Jomo Kenyatta International Airport (JKIA), Nairobi, Kenya (JKIA). Instrument Meteorological Conditions prevailed at the time and the airplane was on an instrument flight plan. The four crewmembers were fatally injured. The airplane was destroyed and consumed by post-crash fire. The destination of the flight was Aden Adee International Airport, Mogadishu, Somalia. The airplane was repositioned from its home base at Wilson Airport in Nairobi, the day before. The accident captain (CAPT) and another first officer conducted the repositioning flight. (see Aircraft Information). At JKIA, the airplane was loaded with cargo in preparation for the accident flight. The accident crew consisted of the Capt and FO in addition to a maintenance engineer and loadmaster. According to air traffic control (ATC), the flight plan was filed for duration of 2.5 hours at an altitude of 19,000 feet along with 5 hours of fuel aboard. Based on flight recorder data, the Capt was the pilot-flying and the FO was the pilot-monitoring. The accident flight was reconstructed using data from air traffic control and flight recorder information. According to FDR data, engine start occurred at at 01.50.20. At about 01.10.59 the flight made initial contact with JKIA air traffic control tower and after routine communication, including the confirmation of the number of person and fuel endurance, the flight was cleared for takeoff at 0112.30. At 01.11.58, both engines accelerated to a high power setting with engine no. 1 stabilizing at 78% torque, 100% propeller speed and engine 2 stabilizing at 80% torque, 99% propeller speed. About six seconds later, the Capt indicates “power is set”. About 2 seconds afterwards the Capt indicated “the auto-feather is off, left” and then 5 seconds later, the FO calls out “seven eighty” (?). About 16 seconds after initial engine acceleration was applied, the first of a series of three chimes audio alerts occurred, and continued at 1 second interval throughout the CVR recording. Immediately after the initial chimes, the Capt said “you see” and “how much is that?”. The FO responded “okay niner”. The Capt then asked “it has gotten to?” The FO replied “thirty four thirty ninety two” and shortly afterward “the left one is thirty”. About 24 seconds after initial engine acceleration, engine 1 torque climbs over a period of 2 seconds to a recorded value of 119.9%, the maximum value the recorder is capable of recording. Simultaneously Engine 1 propeller speed falls from 100% to 57%. Other engine shaft speeds remain at approximately their original high power values. Airspeed at the point this change occurs was less than 30 knots. During this period, the FO called out “one twenty two now [pause] torque”. The Capt responded “it is rising eh? The FO then noted “torque one twenty six now”. About 31 seconds after initial engine acceleration, the FO called out “okay speed alive sixty”. About a second later the Capt asked “do we reduce or”? The FO responded “we can just cut”. The Capt inquired “do we abort or continue?” The FO responded, “okay one one twelve and nine four point three” and then “okay one sixteen [pause] ninety four.” The Capt acknowledged “yeah okay” About 47 seconds after initial engine acceleration, the Capt said twice “did I reduce it?”and the FO responded sequentially “yeah” and “okay”] About 52 seconds after initial engine acceleration, the Capt asked “how is it now?” and the FO replied “yeah one oh two [pause] ninety four”. About 7 seconds later the FO called out “okay, one sixteen ninety four”. About 1 minute after initial engine acceleration, the Capt inquired “Is it really going?” The FO replied “one oh one, ninety five”. The Capt acknowledged and shortly afterward he queried “is it going really, is the aircraft really moving”. The FO responded “okay, one oh one, ninety five”. About 4 seconds later, the Capt indicated “it is not giving power” About 1 minute 9 seconds after the initial engine acceleration the FO called out “okay speed has now reached about hundred”. The Capt responded “oh yeah” and immediately afterward the FO called out “okay one eleven, ninety five”. About 1 minute 18 seconds after the initial engine acceleration, the FO indicated “hundred now”. The Capt acknowledged. About 1 minute 26 seconds after the initial engine acceleration, the FO called out “V one V R rotate” About 1 minute 33 seconds after the initial engine acceleration a transition of the airplane from ground to air mode is recorded and the pressure altitude begins to climb along with the Capt immediately afterward expressing two exclamations. Following the transition to air mode there were 51 seconds of flight recorder data before the recording ended. During this time and over a period of about 3 seconds, the FO calls out “positive rate of climb” and the Capt responded “gear up”. About 3 second later, the Capt expressed “it doesn’t have power [pause] it’s on one side.” About 6 seconds afterward, the FO said “we can also turn back”. About 3 seconds later the first of seven “don’t sink” (GPWS aural warning alerts) begins over a period of 23 seconds. After the second GPWS alert the Capt queried “ok, we’re ok?” After the third GPWS alert, the FO said “we can turn back” and the Capt immediately responded “let’s just go”. The FO replied “okay”. After the fifth GPWS alert, the Capt indicated “and this one is showing one fourteen” and then queried? “we can turn back?”. About 2 seconds later, the FO called out “okay speed is one hundred” and the Capt responded “but this one has nothing” About 1 second later and about the time of the sixth GPW alert, JKIA control tower radioed “five yankee charlie echo tango contact radar one two three decimal three. Good morning.” After the seventh GPWS alert the recording ended about 13 seconds later. During this time, the controller called the aircraft again. The Capt expressed “tell him [pause] tell him we have no power”. The last CVR data indicates the FO radioed, “ah tower charlie echo” and the transmission abruptly ended along with simultaneous sounds of distress. According to FDR data, about 15 seconds after the airplane transitioned from ground to air mode the recorded altitude peaked about 5060 feet and accompanied by a maximum airspeed of 100 knots. Along with a variation of airspeed between 90 knots and 100 knots for the remainder of the recording, during the following 20 seconds the altitude decreased to about 5000 feet and then increased to 5050 feet over the next 10 seconds where it remained until the recording ended at 1.14.27. Witness Accounts (Air Traffic Controller Civilians). The aircraft crashed during the hours of darkness at geographical coordinates of 01° 17’16”S, 36° 57’5”E.", "probable_cause": "The probable cause of the accident was the decision by the crew to conduct the flight with a known mechanical problem and their failure to abort or reject the takeoff after receiving twenty seven cautions. \r\nThe following findings were identified:\r\n- A three chime alert occurred during the positioning flight from HKNW to HKJK,\r\n- Crew continued with the flight with a known fault,\r\n- No evidence that remedial maintenance action was taken after landing from that flight prior to the event flight,\r\n- No evidence of the anomaly being captured in the aircraft technical log,\r\n- At least one of the occupants during the event flight, possibly the PIC, had been present during the positioning flight and thus was aware of the three chime alert that had occurred then,\r\n- Twenty seven sound of three chime alert event occurred during the take off roll on the accident flight,\r\n- The aforementioned alert occurred well before V1,\r\n- The left engine exhibited high torque values (in excess of 120%) while the left propeller speed was reduced to the range between 45% to 55% rpm for most of the flight,\r\n- Crew continued with take of roll and subsequent rotation despite the twenty seven chime alert,\r\n- When airborne, crew contemplated turning back but eventually elected to continue with the flight,\r\n- Cargo weight exceeded what was indicated in the load sheet 36,\r\n- There was no evidence of any maintenance having been conducted on the aircraft since its Certificate of Airworthiness issue two months previously (9th May 2014).\n"}