{"url": "https://www.baaa-acro.com/crash/crash-learjet-36a-stephenville-2-killed", "date": "Dec 6, 1996 at 0238 LT", "type": "Learjet 36", "operator": "Chrysler%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Grand Rapids – Stephenville – Shannon", "msn": "36-033", "yom": 1977, "flight_number": null, "city": "Stephenville", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5700, "captain_hours_type": 3000, "copilot_hours": 2800, "copilot_hours_type": 400, "aircraft_hours": null, "circumstances": "Learjet L36A (serial number 033), N14TX, was on an instrument flight rules (IFR) flight from Grand Rapids, Michigan, to Stephenville, Newfoundland. At 0216 Newfoundland standard time (NST1), N14TX was cleared by Gander Area Control Centre (ACC) for an approach to the Stephenville airport. The co-pilot contacted the St. John=s Flight Service Station (FSS) and advised that they would be conducting an approach to runway 28. The FSS specialist relayed the latest Stephenville weather observation and runway surface condition report to the aircraft and requested that the crew advise St. John=s FSS when they had landed. When the crew of N14TX did not report after landing at Stephenville, the St. John=s FSS specialist advised Gander ACC that the aircraft was missing, and a search was begun. Initial information received by the agencies searching for the missing aircraft did not include the aircraft=s last recorded radar position. The wreckage was located approximately three hours and ten minutes after the aircraft was reported missing, within the airport perimeter, close to the last observed aircraft radar position. The aircraft struck a service road embankment in an inverted, wings-level attitude. The two crew members were fatally injured. The accident occurred during the hours of darkness at approximately 0238 NST.", "probable_cause": "Shortly after crossing the runway threshold, the aircraft began moving to the left of the runway. The motion probably was undetected by the pilot until the aircraft touched down off the left side of the runway surface. The pilot did not maintain the proper aircraft attitude during an attempted missed approach, and the aircraft struck the terrain."}