{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-e19a-bergamo-3-killed", "date": "Oct 30, 2005 at 2204 LT", "type": "Let L-410", "operator": "Trade-Air-2", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bergamo - Zagreb", "msn": "91 25 38", "yom": 1991, "flight_number": "TDR729", "city": "Bergamo-Orio al Serio", "zone": "Lombardy", "country": "Italy", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 7780, "captain_hours_type": 760, "copilot_hours": 1272, "copilot_hours_type": 200, "aircraft_hours": 7185, "circumstances": "The twin engine aircraft departed Bergamo-Orio al Serio Airport on a night cargo service to Zagreb, carrying one passenger (the captain's wife), two pilots and a load of 1,600 kilos of small packages. After takeoff from runway 28, while climbing in foggy conditions, the aircraft entered a left turn then descended, collided with a powerline and crashed in an open field located one km north of the airfield. The aircraft disintegrated on impact and all three occupants were killed. ", "probable_cause": "As far as is established, documented and substantiated, the cause of the accident is due to a loss of control in flight of the aircraft. Although the cause of this loss of control could not be established with incontrovertible certainty, it can reasonably be assumed that it was caused by a deterioration in the situation awareness of the crew during the initial climb immediately after take-off. The loss of such situation awareness may have been contributed jointly or severally:\r\n- The displacement or incorrect positioning of the load, which would have induced a moment of rotation on the longitudinal axis of the aircraft (roll) not immediately perceived and counteracted by the crew;\r\n- Spatial disorientation, as a result of the possible optical illusion produced by the high speed \"E\" TWY lights, which, crossing the thick fog, could have induced the pilot to veer, thus causing the final loss of control of the aircraft. In addition, the limited flight experience of the co-pilot and the inadequate application of CRM techniques by the crew did not allow for a timely identification of the hazardous situation and the necessary actions to recover the aircraft."}