{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-14fk-leningrad-9-killed", "date": "Nov 25, 1960 at 1435 LT", "type": "Ilyushin II-14", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Leningrad - Leningrad", "msn": "1480 019 43", "yom": 27, "flight_number": null, "city": "Leningrad-Shosseynaya", "zone": "Leningrad oblast", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1709, "circumstances": "The crew departed Leningrad-Shosseynaya Airport at 0947LT for a local training mission. At this time, weather conditions were poor with low clouds down to 200 meters, mist and a visibility less than 5 km. Thus, the crew was instructed to complete the training mission in the vicinity of the airfield. At the beginning of the afternoon, ATC authorized the crew to continue the mission and while cruising at an altitude of 2,100 meters, the pilot-in-command lost control of the airplane that went into a dive. After crossing the last cloud layer, the pilot elected to regain control but it was too late. The airplane crashed and exploded in a field located in Dachnoe, less than a km north of the airfield. The aircraft was totally destroyed and all nine occupants were killed, among them three pilots, four instructors and two passengers. ", "probable_cause": "The loss of control occurred while the crew was simulating the failure of the right engine in cloudy conditions. Most probably due to successive errors, or maybe due to a spatial disorientation that affected the pilot-in-command, the airplane went out of control and entered a dive. The pilot elected to regain control after passing the last cloud layer (200 meters from the ground) but the distance between the aircraft and the ground was insufficient. The presence of two civilians on board was against the published regulation. "}