{"url": "https://www.baaa-acro.com/crash/crash-lockheed-p2v-7-neptune-reno-3-killed", "date": "Sep 1, 2008 at 1810 LT", "type": "Lockheed P-2 Neptune", "operator": "Neptune-Aviation-2", "flight_phase": "Takeoff (climb)", "flight_type": "Fire fighting", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Reno - Reno", "msn": "726-7285", "yom": 1958, "flight_number": "Tanker 09", "city": "Reno-Stead", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 9520, "captain_hours_type": null, "copilot_hours": 2812, "copilot_hours_type": null, "aircraft_hours": 10217, "circumstances": "Just after the airplane's landing gear was retracted during takeoff for a retardant drop mission, a ball of fire was observed coming out of the left jet engine before the airplane rolled steeply to the left and descended into the terrain. Prior to takeoff, the captain said he would make the takeoff and provided a takeoff briefing concerning the runway to be used and his intentions should an emergency develop. Shortly thereafter, the captain informed the co-pilot that this would actually be his (the co-pilot's) takeoff. On the cockpit voice recorder, the co-pilot stated \"Same briefing (sound of laughter)\". The co-pilot did not give an additional takeoff briefing beyond the one given by the captain and the captain did not ask the co-pilot to give one. During the initial climb, the captain said he detected a fire on the left side of the airplane and the copilot responded that he was holding full right aileron. At no point did either pilot call for the jettisoning of the retardant load as required by company standard operating procedures, or verbally enunciate the jet engine fire emergency checklist. Recorded data showed that the airplane's airspeed then decayed below the minimum air control speed, which resulted in an increased roll rate to the left and impact with terrain. The 11th stage compressor disc of the left jet engine failed in fatigue, which caused a catastrophic failure of the compressor section and the initiation of the engine fire. Metallurgical examination of the fracture identified several origin points at scratches in the surface finish of the disk. The scratches were too small to have been observed with the approved inspection procedures used by the company. A review of the FAA sanctioned Approved Aircraft Inspection Program, revealed no shortcomings or anomalies in the performance or documentation of the program. A post-accident examination of the airframe and three remaining engines revealed no anomalies that would have precluded normal operations.\n", "probable_cause": "The failure of the flight crew to maintain airspeed above in-flight minimum control speed (Vmca) after losing power in the left jet engine during initial climb after takeoff. Contributing to the accident was the crew's inadequate cockpit resource management procedures, the failure of the captain to assume command of the airplane during the emergency, the flight crew's failure to carry out the jet engine fire emergency procedure, and the failure of the crew to jettison the retardant load."}