{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54d-15-dc-skymaster-taboga-island-23-killed", "date": "Jun 9, 1946 at 1030 LT", "type": "Douglas C-54 Skymaster", "operator": "USAAF", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "Mountains", "schedule": "West Palm Beach - Albrook", "msn": "22181", "yom": 9, "flight_number": null, "city": "Taboga Island", "zone": "Panamá", "country": "Panama", "region": "Central America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 17, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 23, "captain_hours": 1335, "captain_hours_type": 543, "copilot_hours": 1312, "copilot_hours_type": 393, "aircraft_hours": null, "circumstances": "The crew was performing a flight from West Palm Beach to Albrook AFB, Panama City. Following an uneventful flight, the pilot started the descent from the south when the ATC instructed the crew to maintain a minimum safe altitude of 1,000 feet on approach. The four engine aircraft hit the slope of a shrouded mountain located on Taboga Island, about 15 km south of the airfield. The aircraft was destroyed by impact forces and all 23 occupants were killed, among them one civilian. \r\nSource: http://www.canalzonestudygroup.com/Issue133.pdf", "probable_cause": "It is the opinion of the members of the Investigating Board that the pilot sighted Otoque Island and mistook it for Taboga and that he was in the vicinity of Otoque Island when he gave his estimated position of 15 miles southeast of the field. It is furtherbelieved that when the pilot called the tower and gave his estimated position as 5 miles south of field and at 1,000 feet on instruments that he thought he was past Taboga Island, approaching Albrook Field, and that by dropping down a little he would be contact again. Actually the estimated distance of 10 miles traveled would place him over Taboga from Otoque. The pilot, Captain Lawrence W. Parks, filed an instrument flight plan from Morrison Field, West Palm Beach, to Albrook Field, without holding a currently effective Instrument Pilot Certificate. AAF Form 8 (white) or AAF Form 8A (green) in violation of AAF Regulation 60-16A. The weather on Taboga Island at the time of the crash was reported as a ceiling of approximately 750 feet above sea level, with a visibility of 15 miles. The top 250 feet of Taboga was covered with clouds and the visibility was 1/16 mile with light drizzle."}