{"url": "https://www.baaa-acro.com/crash/crash-airbus-a310-304-near-kathmandu-113-killed", "date": "Jul 31, 1992 at 1245 LT", "type": "Airbus A310", "operator": "Thai-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Bangkok - Kathmandu", "msn": "438", "yom": 1987, "flight_number": "TG311", "city": "Kathmandu", "zone": "Bagmati", "country": "Nepal", "region": "Asia", "crew_on_board": 14, "crew_fatalities": 14, "pax_on_board": 99, "pax_fatalities": 99, "other_fatalities": 0, "total_fatalities": 113, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Thai Airways Flight 311 was conducting the Sierra (VOR/DME) approach to runway 02 at Tribhuvan International Airport, in instrument weather conditions. A flap fault occurred while the flight was on the approach; this caused the crew to ask for clearance back to Calcutta, a decision that was in keeping with both Company and performance requirements, which necessitate the use of full flaps for the steep final approach. Shortly (21 seconds) after making this request, at a distance of approximately 12 nm from the Kathmandu VOR, the flap fault was rectified by retracting and then reselecting the flaps. The crew determined that it was not possible to continue the straight-in approach, due to the steep descent angles required and the position of the aircraft. The crew stated to the control tower that they wished to start their approach again and requested a left turn back to the Romeo fix, which is 41 nm south south-west (202 radial) of the Kathmandu VOR. The Controller, in the non-radar environment, responded by clearing the flight to make the Sierra approach, which starts at the 202 radial and 16 nautical miles from the VOR. The crew response to the clearance was to report that, at the moment, they couldn't land and to ask again for left turn back to Romeo to start their approach again. After further dialogue with the controller, which included requests for a left turn, the crew unilaterally initiated a right turn from the aircraft's 025° heading and commenced a climb from an altitude of 10,500 feet to FL180, when the flight was about 7 nm south of the Kathmandu VOR. The crew reported to the tower controller that the flight was climbing and the controller replied by instructing the crew to report at 16 nm for the Sierra approach. During the turn, there was more discussion between the tower controller and the flight, where it was established that the aircraft was to maintain an altitude of FL115 and was to 'proceed to Romeo' and contact the Area Control Center (ACC) controller. The flight, commencing a descent while in the turn, completed a 360° turn, momentarily rolling out on headings of 045° and 340°, and again proceeded toward the north on a heading of 025° magnetic. When the flight was about 5 nm south-west of the Kathmandu VOR, the crew contacted the ACC and stated that the aircraft was 'heading 025' and they wished to proceed to Romeo to start their approach again; adding they had 'technical problems concerned with the flight.' It was again established that the flight was to proceed to Romeo and the crew agreed to 'report over Romeo.' It was determined from the cockpit voice recorder that the crew was in the process of inserting 'Romeo' and other related navigational information in the Flight Management System, but were experiencing difficulties. The flight continued towards the north on a heading of 025° and then, at about 16 nm north, the heading was altered to the left to 005°. Slightly over one minute later, the Ground Proximity Warning System (GPWS) sounded the warning 'terrain, terrain' followed by 'whoop whoop pull-up'; the aural warning continued until impact approximately 16 seconds later. Engine thrust was increasing and 'Level Change' had been announced on the cockpit, just before the impact occurred at the 11,500-foot level of a 16,000-foot peak; the accident site was located on the 015 radial (north-north east) at 23.3 nm from the Kathmandu VOR. The aircraft was destroyed and all 113 occupants were killed. ", "probable_cause": "TG311 flight crew's management of the aircraft flight path wherein the flight proceeded in a northerly direction which was opposite to the cleared point Romeo to the South; ineffective radio communication between the area control centre and the TG311 flight crew which allowed the flight to continue in the wrong direction, in that the TG311 crew never provided the aircraft's VOR radial when stating DME and the controller never solicited this information and thus the aircraft's position was not transmitted at any time; and ineffective cockpit crew coordination by the TG311 crew in conducting flight navigation duties. Contributing factors were: the misleading depiction of Romeo on the operator's approach chart used by the flight crew; a flap fault, although corrected, required that the initial approach be discontinued; and radio communication difficulties between the TG311 crew and the air traffic controllers that stemmed from language difficulties and ineffective discussion of apparent unresolved problems."}