{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-orlando-3-killed", "date": "May 1, 1987 at 1548 LT", "type": "Cessna 340", "operator": "Midwest Packaging Materials Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Huntsville – Orlando", "msn": "340A-0629", "yom": 1978, "flight_number": null, "city": "Orlando", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2335, "captain_hours_type": 340, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The two aircraft, a Cessna 340A and a North American SNJ-4, collided in flight at approximately 3,000 feet msl over Orlando, FL in VMC with a visibility of 7 miles. Both aircraft were in contact  with and being radar vectored by Orlando Approach Control. The Cessna 340 was in level flight and the SNJ was completing a right turn and still descending to 1,500 feet when the collision occurred. Both aircraft were operating under IFR flight rules with the Cessna 340 being vectored to runway 18R at Orlando-Intl (MCO) and the SNJ being directed to Orlando-Executive Airport (ORL). The accident occurred 7 miles northwest of ORL in the MCO Airport radar service outer area. During the vectoring, there was a lack of coordination between controllers during a transfer of control. The receiving controller failed to maintain radar target identification. There was also a lack of traffic advisories. The aircraft pilots were limited in their ability to see due to aircraft structure and relative positions to each other. After the collision, both aircraft crashed in uncontrolled descent. All four occupants in both aircraft were killed. ", "probable_cause": "Occurrence #1: midair collision\r\nPhase of operation: cruise - normal\r\nFindings\r\n1. (c) crew/group coordination - not performed - atc personnel (dep/apch)\r\n2. (f) radar, approach/departure - inadequate\r\n3. (c) identification of aircraft on radar - inadequate - atc personnel (dep/apch)\r\n4. (f) traffic advisory - not issued - atc personnel (dep/apch)\r\n5. (f) visual lookout - inadequate - pilot in command\r\n6. (f) visual lookout - inadequate - pilot of other aircraft\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled"}