{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-cape-richards", "date": "Jul 5, 1989 at 1645 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Reef World Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Cap Richards-Townsville", "msn": "436", "yom": 1953, "flight_number": null, "city": "Cape Richards", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was scheduled to conduct three round trips between Townsville and Cape Richards, with a stop at Orpheus Island on some legs, during the day. The pilot involved in the accident flew the first and third trips and another pilot flew the second. After the first trip the pilot reported that he pumped the floats out and considered that the quantity of water removed was normal. On the third trip he picked up a \"standby\" passenger at Orpheus Island. On arrival at Cape Richards the scheduled six passengers were loaded. A witness employed by the resort to handle the aircraft and passengers on the island reported that the floats appeared to be sitting in the water such that the water was above the normal water line on the floats. Examination of the aircraft loading indicated that the aircraft was overweight and the centre of gravity was just inside the rear limit. The pilot reported taxiing at 1613 hours with eight persons on board. At 1624 hours he reported that he was returning to unload one passenger. In that time two takeoff attempts into the north-east were made. The wind in the bay where the attempts were made was a light northerly. The pilot again reported taxiing at 1634 hours with seven persons on board. A further two takeoff attempts were made. On the final attempt the pilot did not taxi as far into the bay as on previous occasions. The takeoff was continued well out beyond the shelter of the island into an area where the wind was easterly at about 10 knots, and the swell was 1 to 1.5 metres. The pilot reported that the aircraft had attained an indicated airspeed of 55 knots, and he intended to fly it off the water at 57 knots. The right float had lifted from the water and it hit a wave which pushed the right wing up. The pilot was unable to lift the left wing which hit the water, causing the aircraft to cart-wheel. ", "probable_cause": "The following factors were considered relevant to the development of the accident:\r\n1. The pilot selected the incorrect takeoff direction for the wind conditions prevailing.\r\n2. The pilot continued the takeoff into an area of unsuitable swell. This accident was not the subject of an on-scene investigation."}