{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-8-402q-hubli", "date": "Mar 8, 2015 at 1915 LT", "type": "De Havilland DHC-8-400 (Dash-8)", "operator": "SpiceJet", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bangalore – Hubli", "msn": "4373", "yom": 2011, "flight_number": "SG1085", "city": "Hubli", "zone": "Karnataka", "country": "India", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 78, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7050, "captain_hours_type": 1850, "copilot_hours": 1343, "copilot_hours_type": 1083, "aircraft_hours": 10224, "circumstances": "On 08.03.2015 M/s Spice Jet Ltd. Bombardier Q-400 aircraft VT-SUA, was operating a scheduled flight from Bangalore to Hubli under the command of ATPL license holder endorsed on type with duly qualified First Officer on type. There were 78 passengers and 4 crew members on board the aircraft. Previous to the accident flight, the aircraft VT-SUA had operated a flight Chennai – Bangalore with the same PIC. The flight was uneventful and there was no snag reported by the PIC on the completion of the flight. Subsequently the aircraft was scheduled for SG-1085, Bangalore - Hubli on 08.03.2015 at around 13:00 UTC. The aircraft took off from Bangalore at around 1300 UTC and the visibility reported for Hubli was 10 km. When the aircraft came in contact with Mangalore ATC, Mangalore ATC cleared aircraft direct to Hubli and informed heavy rains and thunder showers over Hubli with visibility 3000 m. Since the weather at Hubli had deteriorated, the PIC reduced aircraft speed for reassuring the flight parameters. As there is no refueling facility available at Hubli, the sector is a tankering sector hence the aircraft had enough fuel for holding. While approaching into Hubli the pilot requested latest weather from ATC Hubli. At around 60 nm from Hubli, the weather reported by ATC Hubli was heavy rain and visibility 4000 meters. The ATC cleared aircraft for NDB approach runway 26, however the PIC preferred to carry out VOR DME trial procedure for runway 26. The runway condition was neither asked by the cockpit crew nor intimated by the ATC. The descent was commenced and about 25 nm short of Hubli, ATC again advised visibility has reduced to 3000 m due heavy rain and thunderstorm. Thereafter the crew decided to hold over Hubli until the weather improves. 20 minutes into holding, the ATC again informed that visibility has improved to 4000m in moderate rain. Subsequently descent was requested by the pilot for runway 26. The PIC stated that he had established visual reference with runway at about 6 nm on the final approach course. The crew also selected vipers on short finals to have a better visibility. The aircraft landed normally. The PIC had stated that after touch down and reducing power to DISC, as he was concentrating on the far end of the runway as the runway was wet, he did not realize that the aircraft was drifting to the left of the center line. He further mentioned that he selected full reverse on both the engines to maintain the aircraft on the center line however the aircraft veered toward the left side of the runway and in the process overrun the runway edge light followed by LH landing gear collapsed. After the left landing gear collapsed the left propeller blades hit the runway surface and sheared off from the root attachment. The PIC maneuvered the aircraft however the nose wheel tyre failed under over load conditions and the nose landing gear collapsed and the aircraft belly came in contact with the runway surface. Subsequently, the aircraft exited the runway on the left side on Kutcha and came to the final stop at round 52 meters away from the runway center line. The cockpit crew switched off the engines and the electrical power supply and cockpit door and announced evacuation. The cabin crew opened and the cabin doors on the right for evacuation. The ATC had alerted the fire services and the fire vehicles reached the aircraft after it came to final halt position. The fire personnel also assisted in the safe evacuation of all the passengers from the RH side. There was no injury to any of the occupants on board the aircraft. There was no postaccident fire.", "probable_cause": "Loss of visual cues after touch down in inclemental weather conditions resulted in veering of the aircraft towards left of the centerline leading to runway excursion and accident. \r\nFollowing are the contributory factors:\r\n1. Inappropriate handling technique of the aircraft controls by the PIC to maintain the directional control of the aircraft after landing.\r\n2. Non-standards callouts by the first officer to correct situation after landing. \r\n3. Impact of the landing gear with the non-frangible erected runway edge light resulted in retraction of the same.\r\n4. At the time of the accident DGCA O.M. No. AV.15026/006/92- AS dated 3rd February 1992 was in force, which dictated examiners and instructors of the operators only to carry out trial procedures in VMC and during Daytime only. M/s Spice jet instructions to the flight crew did not reflect the same and allowed flight crew with less experience & below VMC flight conditions to carry out trial procedures. This may have contributed to the accident."}