{"url": "https://www.baaa-acro.com/crash/crash-antonov-24b-wroclaw", "date": "Jan 24, 1969 at 1730 LT", "type": "Antonov AN-24", "operator": "LOT-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Warsaw - Wrocław", "msn": "67302405", "yom": 1966, "flight_number": "LO149", "city": "Wrocław", "zone": "Lower Silesian Voivodeship (Dolnośląskie)", "country": "Poland", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 44, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9500, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": 3000, "aircraft_hours": 3018, "circumstances": "Flight LO149 was a scheduled domestic flight from Warsaw to Wrocław. It took off from Warsaw at 1635 hours local time carrying a crew of 4 and 44 passengers. The flight was uneventful and about 10 minutes before reaching the Wrocław non-directional radio beacon, it was cleared by the Area Control Centre to descend from its cruising altitude of 4 500 m to 1 500 m and instructed to contact the Wrocław Control Zone. The Control Zone cleared the flight to 1 500 m, requested it to report when passing over the NDB - ETA 1722 hours - and gave it the latest weather information for Wrocław as being: cloud base 150 m, visibility 1600 m in light fog, wind 3000 to 310013 to 4 mfsec, QFE 765.5 mm. Hg. The altimeters were set at the correct setting and after having reported over the NDB the flight, which was descending towards the outer locator, was warned by the Control Zone that the visibility had deteriorated to 800 m, i.e. 300 m below the minimum authorized for landing at Wrocław Airport. However, the pilot continued to descend in the direction of the outer locator. At an altitude of 90 m the pilot-in-command ordered a reduction of engine power and flew over the outer locator at an altitude of 50 to 60 m instead of the prescribed 225 m. He reported over the outer locator and shortly thereafter was advised that the visibility had further deteriorated to 400 m and that fog had appeared. In spite of this information the pilot continued his approach and informed the Control Zone that he would try to land. After passing the outer locator the rate of descent of the aircraft was probably established at approximately 3 to 5 m/sec and the last altitude reported by the flight engineer was 30 m. Seven hundred metres beyond the outer locator the aircraft was levelled qff at a height of 10 m and both wings cut the tops of some trees. As a result of the impact part of the right wing (3 m long) and of its aileron were torn off from the aircraft and the aircraft went into a 400 bank to the right. Approximately 145 m from the point of contact with the trees, the right wing came into contact with the ground and left a trace 41 m long. The aircraft was then momentarily straightened up but the right wing dropped again, contacted the ground again and was further damaged. At approximately 350 m from the point of initial contact with the trees, the aircraft, still banked to the right, struck two 30 000 volt power lines breaking all six electric cables with its fuselage and left wing. It then flew over 5 railway tracks and struck with its right wing the five overhead electric traction cables as well as 25 wires of the railway signalling equipment located 60 cm above the ground. All cables and wires were broken and the right wing of the aircraft became entangled in the wires. This reduced the speed of the aircraft and straightened it up, but the angle strut of the right landing gear was damaged and the right landing gear folded backwards. After having travelled a short distance nearly level, with the left landing gear rolling on the ground, the nose gear and right propeller became detached and the aircraft turned slightly to the right, 141 m farther on the left landing gear struck a road embankment 70 cm high and immediately thereafter the aircraft struck a steel electric light pole on the road and bent it to the ground. The aircraft then made a 180° turn and came to a stop on the road at a point located 3.5 km before the threshold of the runway and nearly on the extended centre line of the runway. The accident occurred at 1730 hours. ", "probable_cause": "The accident was attributed to the decision of the pilot-in-command to carry out an approach in weather conditions below the minimum limits prescribed for Wrocław Airport and his non-observance of the prescribed altitude over the outer radio beacon while performing the approach procedure. The accident was the pilot-in-command's fault as well as the co pilot's since the latter did not prevent the pilot-in-command from violating the flight rules. The following findings were reported:\r\n- The pilot-in-command carried out an approach procedure in weather conditions below the authorized minima for Wroclaw Airport,\r\n- The pilot-in-command did not observe the prescribed minimum height limits for an approach procedure using two radio beacons at Wroclaw Airport,\r\n- The copilot did not report to the pilot-in-command that the aircraft went below the prescribed minimum height limits during the approach."}