{"url": "https://www.baaa-acro.com/crash/crash-cessna-501-citation-i-akron-1-killed", "date": "Aug 2, 1979 at 1602 LT", "type": "Cessna 501 Citation I", "operator": "Thurman L. Munson", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Akron - Akron", "msn": "501-0110", "yom": 1979, "flight_number": null, "city": "Akron-Canton", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 428, "captain_hours_type": 6, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 43, "circumstances": "About 1607 e.d.t., on August 2, 1979, a Cessna Citation piloted by Mr. Thurman L. Munson crashed short of runway 19 at the Akron-Canton Airport near Canton, Ohio. The pilot was practicing touch-and-go landings during a local flight with two passengers aboard. The aircraft first touched down in a relatively level, clear area about 870 feet short of the runway. The aircraft slid through a small clump of trees, hit a large stump, and came to rest on a road adjacent to the airport boundary fence. Fire erupted immediately after the aircraft came to rest. The two passengers escaped from the wreckage; the pilot was killed. Thurman Lee Munson, aged 32, an American Major League Baseball catcher, was killed. ", "probable_cause": "The pilot's failure to recognize the need for, and to take action to maintain, sufficient airspeed to prevent a stall into the ground during an attempted landing. The pilot also failed to recognize the need for timely and sufficient power application to prevent the stall during an approach conducted inadvertently without flaps extended. Contributing to the pilot's inability to recognize the problem and to take proper action was his failure to use the appropriate checklist, and his nonstandard pattern procedures which resulted in an abnormal approach profile."}