{"url": "https://www.baaa-acro.com/crash/crash-lockheed-p2v-7-neptune-near-modena-2-killed", "date": "Jun 3, 2012 at 1347 LT", "type": "Lockheed P-2 Neptune", "operator": "Neptune-Aviation-2", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Mountains", "schedule": "Cedar City - Cedar City", "msn": "826-8010", "yom": 1959, "flight_number": "Tanker 11", "city": "Modena", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6145, "captain_hours_type": 1850, "copilot_hours": 4288, "copilot_hours_type": 38, "aircraft_hours": 12313, "circumstances": "The airplane collided with mountainous terrain while conducting firefighting operations, 20 miles north of Modena, Utah. The airplane was operated by Neptune Aviation Services under contract with the US Forest Service as an exclusive public-use fixed-wing airtanker service contract conducted under the operational control of the Bureau of Land management (BLM). Both pilots were fatally injured. The airplane was destroyed by impact forces and post crash fire. Visual meteorological conditions prevailed, and a company flight plan had been filed. The flight originated in Cedar City, Utah, at 1315. The crew of Tanker 11 consisted of the pilot, copilot, and crew chief. They were based out of Missoula, MT, and had been together as a crew for the previous 3 weeks. Normally, the crews stay together for the entire fire season. Tanker 11 crew had operated out of Reno for the 2 weeks prior to the accident. During fire drop operations the tanker is manned by the pilot and copilot, while the crew chief remains at the fire base as ground personnel. The day before the accident while en route from Reno to Cedar City they performed one retardant drop on the White Rock fire, then landed at Cedar City. The crew departed the Cedar City tanker base and arrived at their hotel in Cedar City around 2230. The following morning, the day of the accident, the crew met at 0815, and rode into the Cedar City tanker base together. Tanker 11 took off at 1214 on its first drop on the White Rock fire, and returned at 1254. The crew shut down the airplane, reloaded the airplane with retardant, and did not take on any fuel. Tanker 11 departed the tanker base at 1307 to conduct its second retardant drop of the day, which was to be in the same location as the first drop. Upon arriving in the Fire Traffic Area (FTA) Tanker 11 followed the lead airplane, a Beech Kingair 90, into the drop zone. The drop zone was located in a shallow valley that was 0.4 miles wide and 350 feet deep. The lead airplane flew a shallow right-hand turn on to final, then dropped to an altitude of 150 feet above the valley floor over the intended drop area. While making the right turn on to final behind the lead plane, Tanker 11's right wing tip collided with terrain that was about 700 feet left of the lead airplane's flight path, which resulted in a rapid right yaw, followed by impact with terrain; a fire ball subsequently erupted. Tanker 11 created a 1,088-foot-long debris field and post impact fire.", "probable_cause": "The flight crew's misjudgment of terrain clearance while maneuvering for an aerial application run, which resulted in controlled flight into terrain. Contributing to the accident was the flight crew's failure to follow the lead airplane's track and to effectively compensate for the tailwind condition while maneuvering."}