{"url": "https://www.baaa-acro.com/crash/crash-cessna-560xl-citation-excel-aligarh", "date": "Aug 27, 2019 at 0840 LT", "type": "Cessna 560XLS Citation Excel", "operator": "Air%20Charter%20Services-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New Delhi - Aligarh", "msn": "560-5259", "yom": 2002, "flight_number": null, "city": "Aligarh-Dhanipur", "zone": "Uttar Pradesh", "country": "India", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5484, "captain_hours_type": 1064, "copilot_hours": 1365, "copilot_hours_type": 1060, "aircraft_hours": 7688, "circumstances": "On 27 Aug 19, M/s Air Charter Services Pvt Ltd Cessna Citation 560 XL aircraft (VTAVV), while operating a flight from Delhi to Aligarh (Dhanipur Airstrip) was involved in an accident during landing on runway 11.The operator is having a maintenance facility at Aligarh Airport and aircraft was scheduled to undergo ADS-B modification. There were 02 cockpit crew and 04 SOD onboard the aircraft. The aircraft was under the command of a PIC, who was an ATPL holder duly qualified on type with a CPL holder co-pilot, duly qualified on type as Pilot Monitoring. This was the first flight of the day for both pilots. Both, PIC and Co-Pilot had prior experience of operating to Aligarh airport, which is an uncontrolled airport. As per the flight plan, ETD from Delhi was 0800 IST and ETA at Aligarh was 0820 IST. The crew had reported around 0630 IST at Delhi airport and underwent BA test. The MET report to operate the aircraft to Aligarh was well within the VFR conditions. The aircraft Take-off weight was within limits including 1900 Kgs of fuel on board. As per the statement of PIC, the Co-pilot was briefed about pre departure checklists including METAR before approaching the aircraft. Once at the aircraft, prefight checks were carried out by PIC before seeking clearance from Delhi delivery (121.95 MHz). Aircraft was accorded start up clearance by Delhi ground (121.75 Mhz) at 0800 IST.ATC cleared the aircraft to line up on runway 11 and was finally cleared for takeoff at 0821 IST. After takeoff, aircraft changed over to Delhi radar control from tower frequency for further departure instructions. Aircraft was initially cleared by Radar control to climb to FL090 and was given straight routing to Aligarh with final clearance to climb to FL130. Thereafter, aircraft changed to Delhi area control for further instructions. While at approximately 45 Nm from Aligarh, VT-AVV made contact with Aligarh (personnel of M/s Pioneer Flying Club manning radio) on 122.625 MHz. Ground R/T operator informed “wind 100/2-3 Kts, QNH 1005, Runway 11 in use” and that flying of Pioneer Flying Club is in progress. Further, he instructed crew to contact when at 10 Nm inbound. After obtaining initial information from ground R/T operator, VT-AVV requested Delhi area control for descent. The aircraft was cleared for initial descent to FL110 and then further to FL080. On reaching FL080, aircraft was instructed by Delhi area control to change over to Aligarh for further descent instruction in coordination with destination. At approx 10 Nm, VT-AVV contacted ground R/T operator on 122.625 MHz and requested for long finals for runway 11. In turn, ground R/T operator asked crew to report when at 5 Nm inbound. As per PIC, after reaching 5 Nm inbounds, Aligarh cleared VTAVV to descend to circuit altitude and land on runway 11. Aircraft had commenced approach at 5 Nm at an altitude of 2200 ft. Approach and landing checks briefing including wind, runway in use were carried out by PIC. During visual approach, Co-pilot called out to PIC “Slightly low on profile”. As per PIC, Co-pilot call out was duly acknowledged and ROD was corrected. Thereafter, PIC was visual with runway and took over controls on manual. Co-pilot was monitoring instruments and parameters. While PIC was focused on landing, a loud bang from left side of the aircraft was heard by PIC when the aircraft was below 100 feet AGL. Aircraft started pulling towards left and impacted the ground short of runway 11 threshold. After impact, aircraft veered off the runway and its left wing caught fire. The aircraft stopped short of airfield boundary wall. Crew carried out emergency evacuation. Co-pilot opened main exit door from inside of the aircraft for evacuation of passengers. Aircraft was destroyed due to post crash fire. The fire tender reached the crash site after 45 Minutes.", "probable_cause": "While landing on runway 11, aircraft main landing gears got entangled in the powerline crossing extended portion of runway , due to which aircraft banked towards left and crash landed on extended portion of runway 11.\r\nContributory factors:\r\n- It appears that there was a lack of proper pre-flight briefing, planning, preparation and assessment of risk factors.\r\n- Non-Adherence to SOP.\r\n- Sense of complacency seems to have prevailed."}