{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3d-spernall", "date": "Jan 1, 1953 at 1100 LT", "type": "Douglas DC-3", "operator": "Aer%20Lingus-1", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Dublin – Birmingham", "msn": "42957", "yom": 1946, "flight_number": null, "city": "Spernall", "zone": "Warwickshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 22, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7303, "captain_hours_type": 3369, "copilot_hours": 3599, "copilot_hours_type": 2668, "aircraft_hours": 10968, "circumstances": "Christened 'St Kieran', the aircraft left Dublin at 0936LT Bound for Birmingham, carrying 22 passengers and a crew of three. While cruising at an altitude of 5,000 feet, both engines lost power. The crew decided to make an emergency landing and the aircraft came to rest in a field located in Spernall. It was damaged beyond repair while all 25 occupants were evacuated safely, except for the copilot who was injured. ", "probable_cause": "The primary cause of the accident was loss of engine power due to fuel starvation. The Inquiry found that this was caused by selecting the port engine to the right main tank to which the starboard engine was also selected. The loss of engine power alone was the sole cause of the accident, which could have been avoided had the crew diagnosed the cause of the trouble and changed the fuel feed to another tank. The failure to diagnose fuel starvation was probably due to the circumstances: i.e. first, the lack of coordinated effort by the Captain and First Officer after the engines cut; second, the knowledge of the crew that ample fuel for the flight was on board and their belief that the engines were drawing from their respective main tanks. The actual forced landing of the aircraft in conditions of low cloud, poor forward visibility and unfavorable terrain was skilfully executed and resulted in the passengers escaping unharmed. "}