{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-99a-airliner-prince-albert", "date": "Apr 23, 2003 at 1802 LT", "type": "Beechcraft 99 Airliner", "operator": "Transwest%20Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Saskatoon – Prince Albert", "msn": "U-110", "yom": 1969, "flight_number": "TW602", "city": "Prince Albert", "zone": "Saskatchewan", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a scheduled flight from Saskatoon, Saskatchewan, to Prince Albert, Saskatchewan, with two pilots and four passengers on board. The aircraft was approximately 4000 feet above sea level when the crew selected the flaps for the approach to Prince Albert. A bang was heard from the rear of the fuselage. The aircraft commenced an uncommanded pitch-up to a near-vertical attitude, then stalled, nosed over, and began a spin to the left. The crew countered the spin but the aircraft continued to descend in a near-vertical dive. Through the application of full-up elevator and the manipulation of power settings, the pilots were able to bring the aircraft to a near-horizontal attitude. The crew extended the landing gear and issued a Mayday call, indicating that they were conducting a forced landing. The aircraft struck a knoll, tearing away the belly cargo pod and the landing gear. The aircraft bounced into the air and travelled approximately 180 metres, then contacted a barbed-wire fence and slid to a stop approximately 600 metres from the initial impact point. The crew and passengers suffered serious but non-life-threatening injuries. All of the occupants exited through the main cabin door at the rear of the aircraft. The accident occurred during daylight hours at 1802 central standard time.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. During flight, the horizontal stabilizer trim actuator worked free of the mounting structure, and as a result, the flight crew lost pitch control of the aircraft.\r\n2. During replacement of the horizontal stabilizer trim actuator, the upper attachment bolts were inserted through the airframe structure but did not pass through the upper mounting lugs of the \r\ntrim actuator.\r\n3. The improperly installed bolts trapped the actuator mounting lug assemblies, suspending the weight of the actuator and giving the false impression that the bolts had been correctly installed. \r\n4. Dual inspections, ground testing, and flight testing did not reveal the faulty attachment. \r\nFindings as to Risk:\r\n1. The nature of the installation presents a risk that qualified persons may inadvertently install Beech 99 and Beech 100 horizontal stabilizer trim actuators incorrectly. There are no published warnings to advise installers that there is a potential to install the actuator incorrectly."}