{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-orakei-korako-1-killed", "date": "Sep 20, 1961 at 1330 LT", "type": "Fletcher FU-24", "operator": "James-Aviation", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Te Waro - Te Waro", "msn": "54", "yom": 1958, "flight_number": null, "city": "Orakei Korako", "zone": "Waikato Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1260, "captain_hours_type": 31, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was a former member of the Royal Canadian Air Force where he had logged 1,260 hours flying in both single and multi-engined aircraft. He had come to New Zealand with the intention of working as an agricultural pilot. He had been employed by James Aviation as a trainee topdressing pilot and had completed 22 hours of supervised productive flying at the time of his death. His total flying in the FU24 was 31 hours. At 1315 on the day of the accident he took over ZK-BOB from another trainee, making three satisfactory sorties without incident and then departed on a fourth. Shortly afterwards the absence of engine noise was noticed by those on the airstrip and the supervising instructor took off immediately on an aerial search and located ZK-BOB, crashed and burning, about 400 metres outside the sowing area. The crash site was 92 metres below the level of the area being topdressed. The plane had cartwheeled, rotating about its normal axis and finishing up 12 metres beyond a decapitated pine sapling. The port outer wing section was found 29 metres from the main wreckage, its tip showing evidence of a severe ground impact at the leading edge. The port inner wing displayed a deep indentation at the leading edge just inboard of the outer wing joint. This indentation extended back to the rear spar. The rear spar had become distorted and had jammed the aileron pulley in a way that would sustain a steep left turn in flight. The entire central portion of the fuselage, including the cockpit, had been consumed by fire. The engine was embedded almost vertically in the ground to a depth of 600 mm. The pilot's body had been thrown from the cockpit by the force of the impact with the ground and was found a short distance away. It was noted immediately at the beginning of the crash investigation that the wreckage lay some 90 metres below the level of the dressing area, and in a place that the aircraft would not have crossed in the course of its sowing operation. Attention was then focused on the deep indentation in the leading edge of the port wing and the associated jamming of the aileron control pulley in a position that would sustain a left turn. There was no object in the wide area around the crash site that could account for this damage. It was established that the pine sapling close to the wreck had been sheared through by the aircraft's propeller. It was suspected that, when flying in the sowing area, the aircraft had hit some obstruction, the damage from which had forced the plane into an irrecoverable steep left turn, or locked the plane into such a turn if it was making the manoeuvre at the time of collision. An intensive search was made in the sowing area to locate some object that could have caused the deep indentation to the port inner wing section. No completely reliable evidence was found, but two trees on the edge of the sowing area showed the sort of damage that an aircraft might inflict. Furthermore, there were trails of superphosphate leading up to those trees and leading away from them in the direction of the valley below. A flying trial showed that a Fletcher making a steep left-hand turn over those trees would pass directly over the crash site. However, no evidence in the form of wreckage or paint particles was found in the trees. \nSource: https://aviation-safety.net/wikibase/wiki.php?id=63267", "probable_cause": "The investigators concluded that there was evidence to suggest that the aileron controls were jammed through collision with some object while the aircraft was in flight and that jamming resulted in a steep left turn from which a recovery could not be made. "}