{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-45-dk-pastaza-9-killed", "date": "Sep 16, 1965 at 1102 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Transportes%20Aereos%20Oriental", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Coca – Pastaza", "msn": "17009/34272", "yom": 1945, "flight_number": null, "city": "Pastaza", "zone": "Pastaza", "country": "Ecuador", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 8, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 4946, "captain_hours_type": null, "copilot_hours": 330, "copilot_hours_type": null, "aircraft_hours": 10982, "circumstances": "The aircraft took off from Coca Airport at 1020 hours local time on a scheduled domestic flight to Pastaza, a distance of 100 miles. The flight was to take approximately 45 minutes. At 1052 hours the pilot reported over Arajuno, approximately 12 minutes before its ETA at Pastaza, indicating that he was flying at 4 500 ft, mainly IFR. Thereafter the weather conditions further deteriorated and the aircraft finally entered a poor weather zone with continuous rain. At approximately 1102 hours it collided with trees and then crashed. Two passengers survived while 9 other occupants were killed, among them all three crew members. ", "probable_cause": "The accident was due to adverse weather conditions and imprudence on the part of the pilot who changed from VFR to IFR flight without having the requisite navigation aids for the type of flight he was carrying out. Among the contributing causes were the following: failure to consult the weather report and errors in the airline office, possible overconfidence on the part of the pilot in that he carried out the flight knowing that the radio beacon was inoperative, and presumed negligence on the part of the airport commandant, who failed to declare the aerodrome closed when conditions were below the meteorological minima."}