{"url": "https://www.baaa-acro.com/crash/crash-atr42-500-lahore", "date": "Aug 31, 2012 at 1510 LT", "type": "ATR42-500", "operator": "Pakistan%20International%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Islamabad - Lahore", "msn": "657", "yom": 2006, "flight_number": "PK653", "city": "Lahore", "zone": "Punjab (پنجاب)", "country": "Pakistan", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 42, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Islamabad, the crew started the descent to runway 36R in marginal weather conditions. Upon touchdown on a wet runway, the right main gear collapsed. The aircraft slid for about 1,700 feet before exiting the runway to the right and coming to rest 60 feet further on. All 46 occupants were unhurt while the aircraft was considered as damaged beyond repair. Five minutes after the accident, the weather briefing was as follow: OPLA 311015Z 16009KT 3000 RA BKN040 OVC100 29/24 Q1003. But ten minutes prior to the crash, the weather briefing was as follow: OPLA 311000Z 33008KT 4000 -RA SCT040 BKN100 32/24 Q1002 TEMPO 31030KT 2000 TSRA FEW030CB. Thus, the conditions were considered as marginal with turbulences, wind to 30 knots and CB's at 3,000 feet. On 11SEP2012, the French BEA reported that the aircraft touched down just at the beginning of the paved surface (undershoot area) to the right of the extended runway 36R centerline, causing the right main gear to collapse. It was reported that the aircraft was unstable on short final and that the crew failed to initiate a go-around procedure while the aircraft was too low on the glide. ", "probable_cause": null}