{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-seldovia-1-killed", "date": "Jul 19, 2019 at 1010 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Rust%27s%20Flying%20Service-2", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Seldovia – Anchorage", "msn": "1254", "yom": 1958, "flight_number": null, "city": "Seldovia", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2689, "captain_hours_type": 150, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 29448, "circumstances": "The pilot stated that, during takeoff in the float-equipped airplane, he saw the left float begin to move into his peripheral vision from the left cockpit window and the airplane began to yaw to the left. The left wing subsequently impacted the water and the airplane nosed over, separating the right wing from the fuselage. The passengers consistently reported choppy water conditions at the time of the accident; one passenger reported that white caps were visible on the ocean waves in the distance. The passengers said that, during the takeoff, the airplane impacted a swell or wave and nosed over abruptly, and the cabin rapidly filled with water. Examination of the float assembly revealed fractures in the left front flying wire attachment fitting and the right rear flying wire attachment strap and hole elongation in the left rear flying wire attachment fitting. Additionally, the bolts attaching the two left flying wire attachment fittings to the left float were bent, and the two flying wires that had been attached to the fractured attachment fitting and attachment strap were buckled. While some areas of corrosion were observed on the fractured left forward fitting, the total area of corrosion was a small percentage of the total cross-section, and the remainder of the fracture and associated deformation of the lug was consistent with ductile overstress fracture. Similar areas of corrosion were also observed on each of the intact flying wire attachment fittings. Post-accident testing completed by the float manufacturer revealed that buckling of flying wires similar to that observed on the accident airplane was only reproduced at strap and fitting failure loads above 9,000 pounds force; the design specification load was 3,453 pounds of force. This indicates that the small amount of corrosion present on the fractured flying wire attachment fitting did not reduce its loadcarrying capability below the design specification load of 3,453 pounds of force, and that both the flying wire attachment fitting and flying wire attachment strap fractured due to overload. Therefore, it is likely that the accident airplane floats were subject to forces that exceeded their design limitations, resulting in overload of the flying wires attached to the left float. It is also likely that, given the lack of damage on either float, the force was due to impact with an ocean wave or swell and not by striking an object.", "probable_cause": "The airplane's floats impact with an ocean wave or swell, which exceeded the design load specifications of the flying wire assemblies and resulted in a partial separation of the float assemblies.\n"}