{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-jacksonville", "date": "Sep 16, 2020 at 1340 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Drive Line", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jacksonville - Jacksonville", "msn": "46-36637", "yom": 2014, "flight_number": null, "city": "Jacksonville-Cherokee County", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": 1141, "copilot_hours": 534, "copilot_hours_type": 9, "aircraft_hours": 629, "circumstances": "The instructor pilot reported that while practicing an engine-out landing in the traffic pattern, the pilot-rated student overshot the turn from base leg to final rolling out to the right of the runway centerline. The student pilot attempted to turn back toward the runway and then saw that the airplane’s airspeed was rapidly decreasing. The instructor reported that when he realized the severity of the situation it was too late to do anything. The student attempted to add power for a go-around but was unable to recover. The airplane stalled about 10 ft above the ground, impacted the ground right of the runway, and skidded onto the runway where it came to rest. Both wings and the forward fuselage were substantially damaged. Both pilots stated there were no preaccident mechanical failures or malfunctions with the airplane that would have precluded normal operation. ", "probable_cause": "The student pilot’s failure to maintain control of the airplane during the landing approach and the exceedance of the airplane’s critical angle of attack at low altitude resulting in an aerodynamic stall. Contributing was the instructor pilot’s failure to adequately monitor the student pilot’s actions during the approach."}