{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-newton-2-killed", "date": "Feb 16, 1998 at 0936 LT", "type": "Beechcraft 90 King Air", "operator": "WVUF", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Mountains", "schedule": "Morgantown - Charleston", "msn": "LJ-635", "yom": 1974, "flight_number": null, "city": "Newton", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 12700, "captain_hours_type": 6155, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7523, "circumstances": "The airplane was flown from Morgantown to Charleston to drop off passengers. Once there, the pilot called the mechanic who was scheduled to replace the right transfer pump, and told him the right boost pump was also inoperative. The mechanic told the pilot, he would replace both pumps the next morning in Charleston. Adding that de-fueling the airplane would take longer than changing the pumps. The mechanic recalled that the pilot was concerned about the amount of time necessary for the repair. The airplane was then repositioned back to Morgantown for another flight the next day to Charleston. The morning of the accident, the airplane departed Morgantown, and was being vectored for the ILS approach to Charleston when the copilot declared an emergency. He then announced that they had 'a dual engine failure, two souls onboard and zero fuel.' Examination of the wreckage and both engines revealed no pre-impact failures or malfunctions. With the right transfer pump inoperative. 28 gallons of fuel in the right wing would be unusable. In addition, the flight manual states that 'both boost pumps must be operable prior to take-off.'", "probable_cause": "The pilot inadequate management of the fuel system which resulted in fuel starvation to both engines. Factors in the accident were the pilot's concern about maintenance being completed prior to executing a scheduled flight later in the day, and operating the airplane with known deficiencies. "}