{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-troyes", "date": "Sep 19, 1993 at 1240 LT", "type": "Swearingen SA227 Metro III", "operator": "Airlec-2", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Troyes - Biggin Hill", "msn": "AC-458", "yom": 1981, "flight_number": null, "city": "Troyes", "zone": "Aube", "country": "France", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 17, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2400, "captain_hours_type": 200, "copilot_hours": 640, "copilot_hours_type": 220, "aircraft_hours": 13436, "circumstances": "The aircraft has been chartered to transfer to Biggin Hill, UK, 17 people who suffered a bus accident two days ago. During the takeoff roll from Troyes-Barberey Airport, after a course of 1,100 metres, at a speed of about 100 knots, the right engine power dropped from 93% to 40%. In the meantime, the temperature of the right engine increased. As the aircraft was veered to the right, the captain decided to abort and started an emergency braking procedure. Unable to stop within the remaining distance, the aircraft overran, rolled for about 150 metres, went through a fence and eventually collided with the localizer antenna. All 19 occupants escaped uninjured while the aircraft was written off. ", "probable_cause": "The accident appears to be due to a combination of a positioning error of the Speed Levers at the time of take-off, leading to the overheating of both engines, which forced the take-off to stop, and to the preparation and insufficient management of the take-off, leading to an underestimation of the acceleration-stop distance and a late decision to reject the take-off.\r\nThe following contributing factors were reported:\r\n- The fouling of the brakes, which reduced their performance,\r\n- The failure to update the aircraft's base weight in the operations manual,\r\n- The crew's very limited experience on type of aircraft,\r\n- The aircraft total weight was 300 kg above MTOW."}