{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-55f-quito-53-killed", "date": "Sep 18, 1984 at 1104 LT", "type": "Douglas DC-8", "operator": "AECA-Carga", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Miami – Quito – Guayaquil", "msn": "45754", "yom": 1965, "flight_number": "2A103", "city": "Quito-Mariscal Sucre (City)", "zone": "Pichincha", "country": "Ecuador", "region": "South America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 49, "total_fatalities": 53, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 60070, "circumstances": "The DC-8 landed at Quito at 06:52 after a flight from Miami. Shortly after scheduled departure time of 09:00 members of the Ecuadorian Federation of Aircrews (FEDTA) requested and were granted permission to board the aircraft and discuss subjects relating to the aircrews' strike. The four Aeroservicios Ecuatorianos crew members didn't comply with the strike, after consulting AECA management. After a delay of about two hours, the n°4 engine was started. The crew then ordered the aircraft to be towed to the runway, perhaps in order to hasten the departure. The other engines were started during the towing operation. Pre-takeoff checks were not (or improperly) carried out. This caused the 0.5° horizontal stabilizer nose-up to go undetected, while 8° nose-up is required for takeoff. The DC-8 thus barely climbed after a ground run, extended to 48 meters beyond the runway end. The horizontal stabilizer struck the wooden structure of the ILS aerial, 83 meters past the runway 35 end. The aircraft then crashed into houses, 460 meters past the runway end and 35 meters to the right of the extended centreline. A total of 25 houses were demolished. All four crew members as well as 49 people on the ground were killed. At least 50 other people on the ground were injured, some of them seriously. ", "probable_cause": "The incorrect position of the horizontal stabilizer in relation to the aircraft's centre of gravity, which prevented the aircraft from reaching rotation and lift-off speed within the runway distance available. The following contributing factors were reported: \r\n- Clearance of the aircraft from Quito was done incorrectly, since the MTOW permissible for the existing runway, wind and temperature conditions, the real take-off weight, the useful load distribution and the position of the aircraft's centre of gravity were not determined,\r\n- The crew's state of mind may have been a contributing factor in the accident. It is assumed that it prevented the crew from concentrating on all aspects of the operation they were performing."}