{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130j-30-super-hercules-shank-afb", "date": "May 19, 2013 at 1420 LT", "type": "Lockheed C-130 Hercules", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kandahar – Shank AFB", "msn": "5560", "yom": 2004, "flight_number": null, "city": "Shank AFB", "zone": "Logar", "country": "Afghanistan", "region": "Asia", "crew_on_board": 11, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": 904, "copilot_hours": null, "copilot_hours_type": 252, "aircraft_hours": null, "circumstances": "On 19 May 2013, at approximately 0950 Zulu (1420 local), a C-130J, tail number (T/N) 04-3144, assigned to the 41st Airlift Squadron, 19th Airlift Wing, Little Rock Air Force Base (AFB), Arkansas, ran off the end of a runway at Forward Operating Base (FOB) Shank, Northeast, Afghanistan, struck a ditch which collapsed the nose gear and eventually ripped the right main landing gear from the fuselage. The right outboard engine struck the ground, pressurized fuel and oil lines were broken, fluid was sprayed over the cracked engine casing, and the right wing caught fire. The mishap aircraft (MA) came to a full stop at approximately 544 feet (ft) off the end of the paved runway surface. The mishap crew (MC), Aeromedical Evacuation (AE) crew and two ambulatory patients safely evacuated the aircraft through the top flight-deck emergency escape hatch meeting 600 ft off the nose of the aircraft. There were no fatalities, significant injuries or damage to civilian property. The total estimated loss is $73,990,265. The MA was on an AE mission and included five active duty C-130J crewmembers from the 772nd Expeditionary Airlift Squadron (19th Airlift Wing deployed), Kandahar Air Base (AB), Afghanistan. Additionally, the MA had aboard six reserve AE crewmembers from the 651st Expeditionary Aeromedical Evacuation Squadron (349th Air Mobility Wing and 433rd Airlift Wing deployed), Kandahar AB, Afghanistan. The mishap sortie happened on the third of five planned legs that day to an airfield that was at 6,809 ft Mean Sea Level (MSL) and experiencing winds varying from 200 to 250 degrees gusting from 6 to 28 knots. On the second attempted landing, the MA touched down approximately 1,500 ft down the runway but was 27 knots indicated airspeed (KIAS) faster than computed touchdown landing speed leading to the aircraft going off the end of the runway at approximately 49 KIAS. ", "probable_cause": "On the second landing attempt at a high altitude airfield (6,809 ft MSL), poor CRM coupled with a late power reduction by MP1 caused the MA to touchdown 27 KIAS faster than computed touchdown landing speed leading to the aircraft going off the end of the runway at approximately 49 KIAS. Because of unique aircraft performance characteristics when operating into and out of high altitude airfields, there was no way that the MA could perform a 50% flap landing (in accordance with T.O. 1C-130(C)J-1-1 landing assumptions, nose wheel landing gear speed restrictions and power level transition speed restrictions) at FOB Shank and land 27 KIAS fast. The MA’s actual landing speed simply overtasked the aircrafts capability to stop within the runway available. \r\nSeveral factors substantially contributed to this mishap, including:\r\n- Channelized attention,\r\n- Risk assessment during operation,\r\n- Delayed necessary action,\r\n- Response set,\r\n- Procedural error."}