{"url": "https://www.baaa-acro.com/crash/crash-vickers-417-wellington-iii-appleton-le-moors-3-killed", "date": "Jul 26, 1946 at 1420 LT", "type": "Vickers 417 Wellington III", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "City", "schedule": "Leconfield - Leconfield", "msn": null, "yom": null, "flight_number": null, "city": "Appleton-le-Moors", "zone": "North Yorkshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 26th July 1946 110 (City of York) ATC Squadron were holding their annual summer camp at the Central Gunnery School (CGS) at Leconfield. As part of their camp the Cadets were being allowed to be taken as passengers on training flights the CGS were undertaking. There is a suggestion that more than one Wellington was being used for this but if this was so then the take-off times were staggered and their flights did not interrupt or engage with each other. The Wellington concerned in this incident had suffered an engine malfunction prior to take-off and the two cadets already down to have a flight on this aircraft were allocated to a different aircraft to have their trip. The faulty aircraft was soon repaired and two further cadets would be allowed to go up in this original aircraft for what become the ill-fated flight. The ill-fated flight finally took off with a pilot and two cadets on board at around 1400LT, they flew northwards and towards the North Yorkshire Moors. The pilot of the Wellington carried out a Bomber Affiliation training exercise with other aircraft, the Wellington was being subjected to a number of dummy attacks by two Spitfires. It was during one of these attacks and twenty five minutes into the flight that tragedy struck at 1420LT; one of the Spitfires was making a head-on attack on the Wellington when the pilot of the Spitfire misjudged the distance between the two aircraft. The two aircraft collided head on more or less directly over the village of Appleton-le-Moors. The Wellington partly broke up in the air, with parts being scattered across the main street in Appleton le Moors and on houses in the village. Both aircraft, including the main section of this Wellington came down in flames on and near the village football field. There would be no survivors. At the inquest to their deaths, the Coroner, Mr R K Smith gave a verdict of \"death by misadventure\".\r\nCrew:\r\nW/O Henryk Szwedowski, pilot.\r\nPassengers:\r\nCadet William Anthony Lain,\r\nCadet Robert Hall.\r\nSource:\r\nhttp://www.yorkshire-aircraft.co.uk/aircraft/planes/46-50/bj884.html", "probable_cause": "Misjudge of the distance between both aircraft on the part of the Spitfire pilot."}