{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-247-casper", "date": "Mar 31, 1975 at 0743 LT", "type": "Boeing 737-200", "operator": "Western%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Denver - Casper - Minneapolis", "msn": "20131/165", "yom": 1969, "flight_number": "WA470", "city": "Casper-Natrona County", "zone": "Wyoming", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 93, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6698, "captain_hours_type": 2000, "copilot_hours": 8900, "copilot_hours_type": 2000, "aircraft_hours": 14076, "circumstances": "Western Air Lines flight 470 to Casper and Minneapolis departed Denver at 07:03 in the morning. The airplane, on an IFR flight plan, climbed to its cruising altitude of FL220. At 07:36, following a descent to 12,000 feet, the flight crew contacted Casper approach control and advised that the flight was about 12 miles south of the Evansville Intersection. At that time, the controller cleared the flight to use the localizer back course approach for runway 25, to circle to runway 3, or to land straight in. The weather reported to the crew indicated poor visibility with light snow falling and wind 040° at 9 knots. One minute later, the approach controller advised that \"runway 7/25 has been plowed. There's about a 1/4-inch of powder snow on it. Braking action reported, Convair 580, as poor. Runway 3/21 is being plowed at this time.\" At 07:51, Flight 470 reported at the Henning Intersection and was cleared to contact the Casper Tower. The tower controller cleared the flight to land on runway 25 and gave the wind as 030° at 8 knots. The flight was also advised by the controller that a disabled snow blower was \"just west of the intersection runway 21, left side runway 25, on the edge ....\" At 07:41:42, the first officer called out \"thousand to go to the field.\" At 07:42:09, the first officer called \"approaching minimums,\" and 12 seconds later, he called \"just about at minimums.\" The aircraft then flew level for a few moments a t the minimum descent altitude (MDA). At 07:42:25, the first officer called the runway in sight directly below the aircraft. At that time airspeed was 150 knots and the flaps were at 25°. The first office then set the flaps at 30° as the captain initiated the final descent. The aircraft crossed the threshold at reference speed +15 knots. The aircraft touched down 2,375 feet from the departure end of the runway, about 6,306 feet from the approach end of the runway. The aircraft went off the departure end of the runway to the right of the centerline. After striking several metal stanchions in the first row of terminal bar lights, which were located 200 feet off the end of the runway, the aircraft struck a shallow irrigation ditch 280 feet off the runway end. The aircraft veered farther to the right and stopped about 800 feet beyond the departure end of the runway.", "probable_cause": "The failure of the pilot-in-command to exercise good judgment when he failed to execute a missed approach and continued a non-precision approach to a landing without adequately assessing the aircraft's position relative to the runway threshold. Contributing to the accident were the excessive height and speed at which he crossed the approach end of the runway and the failure of other flight crew members to provide him with required callouts."}