{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-g18-taylorville-1-killed", "date": "Aug 11, 2012 at 1124 LT", "type": "Beechcraft G18S", "operator": "Barron%20Aviation", "flight_phase": "Flight", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "City", "schedule": "Taylorville - Taylorville", "msn": "BA-468", "yom": 1959, "flight_number": null, "city": "Taylorville", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1429, "captain_hours_type": 7, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13833, "circumstances": "The airplane was substantially damaged when it impacted terrain in a residential neighborhood in Taylorville, Illinois. The commercial pilot sustained fatal injuries. Twelve parachutists on-board the airplane exited and were not injured. No persons on the ground were injured. The airplane was registered to Barron Aviation, LLC; Perry, Missouri, and operated by Barron Aviation Private Flight Services, LLC; Hannibal, Missouri, under the provisions of 14 Code of Federal Regulations Part 91, as a sport parachuting flight. Day visual meteorological conditions prevailed and no flight plan was filed. The local flight originated from Taylorville Municipal Airport (TAZ), Taylorville, Illinois, about 1100. The airplane had climbed to an altitude of about 11,000 feet mean sea level (msl) and the parachutists were seated inside the airplane on two rear facing \"straddle benches\". As the airplane arrived at the planned drop location, the parachutists stood up, opened the door, and moved further aft in the airplane in preparation for their jump. Five of the parachutists were positioned hanging on to the outside of the airplane with several others standing in the door and the remainder were standing in the cabin forward of the door. Several parachutists reported that they were almost ready to jump when they heard the sounds of the airplane's stall warning system. The airplane then suddenly rolled and all twelve parachutists quickly exited the airplane. Several of those who were last to exit reported that the airplane was inverted or partially inverted as they went out the door. The pilot, seated in the left front cockpit seat, did not exit the airplane. Several witnesses reported seeing the airplane turning and descending in an inverted attitude when the airplane appeared to briefly recover, but then entered a nearly vertical dive. The airplane impacted a tree and terrain in the back yard of an occupied residence. Emergency personnel who first responded to the accident scene reported a strong smell of gasoline and ordered the evacuation of several nearby homes. There was no post impact fire.", "probable_cause": "The pilot's failure to maintain adequate airspeed and use the appropriate flaps setting during sport-parachuting operations, which resulted in an aerodynamic stall/spin and a subsequent loss of control. Contributing to the accident was the pilot’s failure to follow company guidance by allowing more than four passengers in the door area during exit, which shifted the airplane’s center of gravity aft."}