{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-340-59-sao-paulo-37-killed", "date": "May 3, 1963 at 1940 LT", "type": "Convair CV-340", "operator": "Cruzeiro-do-Sul-11", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "São Paulo – Rio de Janeiro", "msn": "159", "yom": 1954, "flight_number": null, "city": "São Paulo-Congonhas", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 5, "crew_fatalities": 4, "pax_on_board": 45, "pax_fatalities": 33, "other_fatalities": 0, "total_fatalities": 37, "captain_hours": 11997, "captain_hours_type": 8010, "copilot_hours": 2536, "copilot_hours_type": 800, "aircraft_hours": 17960, "circumstances": "The aircraft was on scheduled domestic flight from São Paulo to Rio de Janeiro with 5 crew and 45 passengers aboard. Following an eight-minute delay due to heavy traffic, the flight was cleared to take off from São Paulo-Congonhas Airport. One minute after takeoff the pilot-in-command reported to the tower that the aircraft's n°2 engine was on fire, and he would return to the airport. A left turn was begun, and it is presumed that the pilot feathered n°2 propeller. He began the downwind leg to runway 16 and asked the tower operators whether anything abnormal could be seen regarding the aircraft's n°2 engine. The tower operators, from whom n°2 engine was hidden by the fuselage, reported that they could not see anything abnormal. Presumably the pilot unfeathered the propeller which started windmilling. Approximately abeam the tower, the aircraft began to lose altitude and when it started the final turn its altitude was very low. The aircraft was probably nosed up and stalled with a bank of 45°; it first struck a house with its nose and left wing, then hit the ground (elevation 800 meters) and made a 260° turn on its left wing. The accident occurred at night in a well illuminated, densely populated area. The aircraft was destroyed upon impact and 4 crew members and 33 passengers were killed, 13 other occupants being injured. ", "probable_cause": "For unknown reasons, the alarm bell, which indicated overheating, rang immediately after takeoff. The pilot-in-command, believing n°2 engine was on fire, presumably feathered n°2 propeller. As the flight entered the downwind leg, it was unfeathered, but the shut-off valve was not re-opened, and the propeller began windmilling. Although the engine n°1 was still operating at takeoff power, the altitude could not be maintained. When entering the last turn to base leg, the aircraft was very low, and the pilot presumably tried to lift the nose to avoid striking buildings near the airport. This caused the aircraft to stall. At this time, one of the crew probably used the flaps. Shortly thereafter the aircraft banked 45°, struck a house and crashed to the ground. It is highly probable that if the pilot had refeathered n°2 engine when he started losing altitude, he could have maintained altitude and landed safely. In conclusion, the probable primary cause of the accident was a pilot error and improper procedure on unfeathering n°2 engine. The probable secondary cause of the accident is a probable material failure of one or both engines overheating. "}