{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130j-30-super-hercules-near-kiruna-5-killed", "date": "Mar 15, 2012 at 1457 LT", "type": "Lockheed C-130 Hercules", "operator": "Royal-Norwegian-Air-Force-31", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Mountains", "schedule": "Harstad - Kiruna", "msn": "5630", "yom": 2010, "flight_number": "HAZE 01", "city": "Kiruna", "zone": "Norrbotten", "country": "Sweden", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 6153, "captain_hours_type": 5937, "copilot_hours": 3285, "copilot_hours_type": 243, "aircraft_hours": 856, "circumstances": "The accident occurred during a Norwegian military transport flight from Harstad/Narvik Airport (Evenes) in Norway to Kiruna Airport in Sweden. The flight was performed as a part of the Norwegian-led military exercise Cold Response. The aircraft, which was of the model C-130J-30 Super Hercules, had the call sign HAZE 01. HAZE 01 took off with a crew of four and one passenger on board. The aircraft climbed to Flight Level 130 and assumed a holding pattern south of Evenes. After one hour, the flight continued towards Kiruna Airport. The Norwegian air traffic control had radar contact and handed over the aircraft to the air traffic control on the Swedish side. Swedish air traffic control cleared HAZE 01 to descend to Flight Level 100 “when ready” and instructed the crew to contact Kiruna Tower. The crew acknowledged the clearance and directly thereafter, the aircraft left Flight Level 130 towards Flight Level 100. The lower limit of controlled airspace at the location in question is Flight Level 125. HAZE 01 informed Kiruna Tower that the aircraft was 50 nautical miles (NM) west of Kiruna and requested a visual approach when approaching. Kiruna Tower cleared HAZE 01, which was then in uncontrolled airspace, to Flight Level 70, and the aircraft continued to descend towards the cleared flight level. Neither ACC Stockholm nor Kiruna Tower had any radar contact with the aircraft during the sequence of events because the Swedish air navigation services do not have radar coverage at the altitudes at which HAZE 01 was situated. HAZE 01 levelled out at Flight Level 70 at 14.57 hrs. Half a minute later, the aircraft collided with the terrain between the north and south peaks on the west side of Kebnekaise. Data from the aircraft's recording equipment (CVR and DFDR) showed that HAZE 01 was flying in level flight at a ground speed of approximately 280 knots prior to the moment of collision and that the crew was not aware of the imminent danger of underlying terrain. The remaining distance to Kiruna Airport was 42 NM (77 km). Everyone on board received fatal injuries. Accidents in complex systems are rarely caused by a single factor, but there are often several circumstances that must coincide for an accident to occur. The analysis of the investigation deals with the circumstances which are deemed to have influenced the sequence of events and the barriers which are intended to prevent dangerous conditions from arising. In summary, the investigation indicates that latent weaknesses have existed both at the Norwegian Air Force and at LFV. It is these weaknesses and not the mistakes of individual persons that are assessed to be the root cause of the accident. On the part of flight operations, the investigation has found shortcomings with respect to procedures for planning and following up a flight. Together with a probably high confidence in air traffic control, this has led to the crew not noticing that the clearance entailed an altitude that did not allow for adequate terrain separation.  In terms of the air traffic services, the investigation demonstrates that the aircraft was not issued clearances and flight information in accordance with applicable regulations. This is due to it not having been ensured that the air traffic controllers in question had sufficient experience and knowledge to guide air traffic from the west in towards Kiruna Airport in a safe manner under the present circumstances. The lack of radar coverage reduced the opportunities for air traffic control to monitor and guide air traffic. The aircraft's Ground Collision Avoidance System is the last barrier and is intended to be activated and provide warning upon the risk of obstacles in the aircraft's flight path. The investigation has shown that with the terrain profile in question and the settings in question, the criteria for a warning were not fulfilled. No technical malfunction on the aircraft has caused or contributed to the occurrence of the accident. The rescue operation was characterized by very good access to resources from both Sweden and abroad. The operations lasted for a relatively long time and were carried out under extreme weather conditions in difficult alpine terrain. The investigation of the rescue operation demonstrates the importance of further developing management, collaboration and training in several areas.", "probable_cause": "The accident was caused by the crew on HAZE 01 not noticing to the shortcomings in the clearances issued by the air traffic controllers and to the risks of following these clearances, which resulted in the aircraft coming to leave controlled airspace and be flown at an altitude that was lower than the surrounding terrain.  \r\nThe accident was rendered possible by the following organizational shortcomings in safety:  \r\n- The Norwegian Air Force has not ensured that the crews have had sufficiently safe working methods for preventing the aircraft from being flown below the minimum safe flight level on the route. \r\n- LFV has not had sufficiently safe working methods for ensuring, partly, that clearances are only issued within controlled airspace during flight under IFR unless the pilot specifically requests otherwise and, partly, that relevant flight information is provided. \n"}