{"url": "https://www.baaa-acro.com/crash/crash-aero-c3a-jevicko-7-killed", "date": "May 26, 1949 at 2323 LT", "type": "Aero C-3A", "operator": "Czech%20Air%20Force-2_0", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Plain, Valley", "schedule": "Prostějov – Chrudim", "msn": "350", "yom": null, "flight_number": null, "city": "Jevíčko", "zone": "Pardubice Region (Pardubický kraj)", "country": "Czech Republic", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew completed several maneuvers during the day, taking part to a training mission combined with a second Czech Air Force Aero C.3 registered S-11 and carrying a crew of seven as well. In the afternoon, both crew were instructed to stay at Prostějov due to poor weather conditions. At 2230LT, the headquarter informed both crew they were able to fly back to Chrudim as the weather improved. En route, both airplanes went out of control and crashed in the same time. S-11 crashed in a field northwest of Jaroměřice while S-15 crashed in a wooded area located on km southwest of Jevíčko. All 14 crew members on both aircraft were killed. \nCrew:\nJiři Kolař,\nJan Pavliček, \nFrantišek Hoffmann,\nJan Machalek, \nFrantišek Kral,\nBartolomiew Jurec,\nZděnek Kolaček.", "probable_cause": "At the time of the accident, weather conditions were marginal with the presence of a cold front. Both aircraft went out of control at the same time, apparently due to downdraft, turbulences or weather factors. According to the Czech Authorities, it seems unlikely that the fall of both aircraft is the consequence of a collision in flight. Analysis on S-15 revealed that the aircraft hit the ground at high speed, nose first (angle down to 75°) without its left wing."}