{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-53d-do-cleveland-2-killed", "date": "Nov 11, 1946 at 0330 LT", "type": "Douglas C-53 Skytrooper (DC-3)", "operator": "United-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago – Cleveland", "msn": "4873", "yom": 1942, "flight_number": "UA404", "city": "Cleveland", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 18, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8340, "captain_hours_type": 967, "copilot_hours": 2268, "copilot_hours_type": 116, "aircraft_hours": 11684, "circumstances": "The aircraft was heard southwest of the airport at 0327 and at this time Cleveland Tower cleared the flight to land on Runway 36-Left. At 0328 the air-craft was observed over the airport at an altitude of between 200 and 400 feet flying In a northeasterly direction. When approximately over the north boundary, the aircraft disappeared from view in what appeared to be a low cloud formation. At this time Cleveland Tower advised the flight that It was cleared to use Runway 36-Left, Runway 36-Right, or Runway 31, at the captain's discretion. The aircraft was next seen re-approaching the airport from the northeast in a right turn, during which turn the landing lights were switched on. In the latter part of the turn, a descent was established and this descent was continued in a northwesterly direction toward the dark, undeveloped area north of the airport. With the exception of the fact that the aircraft was heading toward an area not within the boundary of the airport, its appearance was that of an aircraft in a normal landing approach. When at an altitude of approximately 30 feet, the aircraft banked slightly to the left and, immediately thereafter it struck trees and high tension lines paralleling the north boundary of the airport. The aircraft veered sharply to the right and dived into the ground, coming to rest approximately 550 feet beyond the point of initial contact.", "probable_cause": "On the basis of the foregoing, the Board determines that the probable cause of this accident was the error of the pilot in establishing an approach toward an area not cleared for landing as a result of having mistaken the end markers of Runway 23 for those of Runway 31. A contributing factor was the failure of the pilot to abandon his attempt to land at Cleveland Airport when confronted with weather conditions below the minimums prescribed for that airport."}