{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-grain-valley", "date": "Aug 17, 2006 at 1551 LT", "type": "Swearingen SA227 Metro III", "operator": "Sierra%20West%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tuscaloosa - Grain Valley", "msn": "AC-533", "yom": 1982, "flight_number": "PKW321", "city": "Grain Valley", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1379, "captain_hours_type": 188, "copilot_hours": 1127, "copilot_hours_type": 165, "aircraft_hours": 22504, "circumstances": "The airplane impacted a fence and terrain on short final during a visual approach to runway 27. The airplane was operated as a cargo airplane with two flight crewmembers by a commercial operator certificated under 14 CFR Part 135. The flightcrew worked approximately 18.75 hours within a 24-hour period leading up to the accident performing flights listed by the operator as either 14 CFR Part 91 or 14 CFR Part 135, all of which were in the conduct of company business. Of this total, 5.9 hours involved flying conducted under 14 CFR Part 135. The flight to the accident airport was for the purposes of picking up repair parts for another company airplane that received minor damage in which the flight crew was previously piloting in the 24- hour period. They were then going to fly back to the operator's home base on the same day, which would have had an estimated flying time of 2:45 hours. The captain said he was tired and that he and the first officer had not slept at any of the stops made during the period. The captain said that the company likes for the airplanes to return to their home base. The captain said that the company prefers an option for pilots to stay overnight if tired and he has stayed overnight on previous trips but only due to maintenance related reasons. The Aeronautical Information Manual states that acute fatigue affects timing and perceptional field performance.", "probable_cause": "The pilot not maintaining clearance from the fence. Contributing factors were the pilot's fatigue and the fence."}