{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-26-islander-monkey-mountain", "date": "Jul 6, 2014 at 0950 LT", "type": "Britten-Norman Islander", "operator": "Domestic Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ogle – Omai – Mahdia – Monkey Mountain", "msn": "470", "yom": 1975, "flight_number": null, "city": "Monkey Mountain", "zone": "Potaro-Siparuni", "country": "Guyana", "region": "South America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Authority said the aircraft left the Ogle International Airport earlier in the day and made stops at Omai and Mahdia before heading at Monkey Mountain Airfield with several goods on board. On approach to Monkey Mountain, the plane circled the airstrip several times before landing. Shortly after setting down, it was claimed the aircraft veered off the runway, hit few obstacles and came to rest. While both occupants were uninjured, the aircraft was damaged beyond repair. It appears that weather was poor at the time of the accident with rain and winds and low clouds.", "probable_cause": "Guyana Civil Aviation Authority (GCAA) Director General Zulficar Mohamed disclosed that an initial investigation revealed that the Pilot involved in the Monkey Mountain mishap landed short of the runway. As a result, the landing gear of the plane was damaged and from there on, it was difficult to control the 10-seater Islander aircraft. The aircraft subsequently veered off the airstrip causing extensive damage. Mr. Mohamed further stated that the wrecked aircraft is beyond repair, but he was unsure if the operators will attempt to salvage what is left. The aircraft, owned by Domestic Airways, was piloted by Captain Orlando Charles."}