{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-near-okeechobee-10-killed", "date": "Jan 5, 1994 at 1829 LT", "type": "Beechcraft 90 King Air", "operator": "Kimura International", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Kissimmee - Miami", "msn": "LJ-445", "yom": 1969, "flight_number": null, "city": "Okeechobee", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 12000, "captain_hours_type": 130, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7072, "circumstances": "The pilot (or pilot-rated passenger) reported an 'indication' problem and said they intended to land at Okeechobee, but couldn't find the airport. They then reported engine trouble and said that they would try to land on a road. They circled the area and approached a dirt road with landing lights on. A car was proceeding on the road in the opposite direction. The plane began to climb, and it entered a left turn. It then rolled into a steep right bank, descended nose down, crashed and was consumed by fire. An exam revealed indications that both engines were operating at high rpm. A teardown revealed a right engine fuel control bearing had failed, which would have allowed improper movement of the fuel control drive shaft. The plane was last inspected on 11/25/92 and was 13 hours over a required 150 hour inspection. A service bulletin for maintenance of the fuel control bearings had not been complied with. The owner/pilot had not completed formal ground school instruction on the airplane systems and operation. The plane had 9 seats; 10 occupants were aboard. ", "probable_cause": "The pilot's improper remedial action concerning a right engine power anomaly, and his failure to maintain adequate airspeed during go-around from an aborted precautionary landing, which resulted in a loss of aircraft control and an uncontrolled descent. Factors related to the accident were: failure of the owner/operator/pilot to assure proper maintenance inspection of the aircraft, failure to comply with a service bulletin concerning the engine fuel controls, subsequent bearing failure in the right engine fuel control, and the pilot's lack of familiarity with this make and model of aircraft."}