{"url": "https://www.baaa-acro.com/crash/crash-aerospatiale-sn601-corvette-portland", "date": "Mar 19, 1998 at 0918 LT", "type": "Aérospatiale SN.601 Corvette", "operator": "R. L. Riemenschneider Enterprises", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Portland - Redmond", "msn": "36", "yom": 1977, "flight_number": null, "city": "Portland-Intl", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4500, "captain_hours_type": 125, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2306, "circumstances": "The cockpit voice recorder (CVR) recording indicated that the pilot was unable to start the right engine before takeoff, and elected to attempt takeoff with the right engine inoperative. Witnesses reported that the airplane's nose lifted off about 4,100 feet down the runway and that it then became airborne with its wings rocking, attaining a maximum altitude of 5 to 10 feet above the ground before settling back to the ground, departing the right side of the runway and entering an upright slide for about 1/2 mile. Investigators removed the right engine starter-generator from the engine after the accident and found the starter-generator drive shaft to be fractured. The aircraft has a minimum crew requirement of two, consisting of pilot and copilot; the copilot's seat occupant, a private pilot-rated passenger, did not hold a multiengine rating and thus was not qualified to act as second-in-command of the aircraft.", "probable_cause": "The pilot-in-command's decision to attempt takeoff with the right engine inoperative, resulting in his failure to maintain directional control or attain adequate airspeed during the takeoff attempt. Factors included a fractured right engine starter-generator drive shaft, resulting in an inability to perform a normal engine start on the ground. "}