{"url": "https://www.baaa-acro.com/crash/crash-piaggio-p180-avanti-ii-flint", "date": "Nov 16, 2011 at 0940 LT", "type": "Piaggio P.180 Avanti", "operator": "Avantair", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Detroit - West Bend", "msn": "1139", "yom": 2007, "flight_number": "VNR168", "city": "Flint-Bishop", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3851, "captain_hours_type": 2023, "copilot_hours": 3957, "copilot_hours_type": 259, "aircraft_hours": 4422, "circumstances": "During climb to cruise, the captain increased left engine power and the engine power lever became jammed in the full forward position. This condition resulted in an engine overtorque and overtemperture condition, and the captain shut down the left engine. After the engine shutdown, both primary flight display screens went blank. The captain reset the right generator and the flight displays regained power and display. Due to the engine shutdown, the captain diverted to a nearby airport and attempted a single-engine precautionary landing in visual flight rules conditions. Based on wind conditions at the airport (290 degrees at 18 knots), runway 27 was being used for operations. During the descent, the crew became confused as to their true heading and were only able to identify runway 27 about a minute before touching down due to a 50-degree difference in heading indications displayed to the crew as a result of the instrument gyros having been reset. Accurate heading information would have been available to the crew had they referenced the airplane’s compass. Having declared an emergency, the crew was cleared to land on any runway and chose to land on runway 18. After touchdown, the captain applied reverse thrust on the right engine and the airplane veered to the right. The airplane flight manual’s single-engine approach and landing checklist indicates that after landing braking and reverse thrust are to be used as required to maintain airplane control. The airplane continued to the right, departed the runway surface, impacted terrain, flipped over, and came to rest inverted. At the point of touchdown, there was about 5,000 feet of runway remaining for the landing roll. The loss of directional control was likely initiated when the captain applied reverse thrust shortly after touchdown, and was likely aggravated by the strong crosswind. Postaccident examination of the airplane showed a clevis pin incorrectly installed by unknown maintenance personnel that resulted in a jammed left engine power lever. No additional anomalies were noted with the airplane or engines that would have precluded normal operation.\n", "probable_cause": "The captain's failure to maintain directional control during landing with one engine inoperative. Contributing to the accident was an improperly installed clevis pin in the left engine power lever, the crew’s delay in accurately identifying their heading, and their subsequent selection of a runway with a strong crosswind.\n"}