{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-500b-chicago-1-killed", "date": "Nov 18, 2014 at 0245 LT", "type": "Rockwell Aero Commander 500", "operator": "Central%20Air%20Southwest", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Chicago - Columbus", "msn": "500-1453-160", "yom": 1964, "flight_number": "CTL62", "city": "Chicago-Midway", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1339, "captain_hours_type": 34, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 26280, "circumstances": "The commercial pilot was conducting an on-demand cargo charter flight. Shortly after takeoff, the pilot informed the tower controller that he wanted to \"come back and land\" because he was \"having trouble with the left engine.\" The pilot chose to fly a left traffic pattern and return for landing. No further transmissions were received from the pilot. The accident site was located about 0.50 mile southeast of the runway's displaced threshold. GPS data revealed that, after takeoff, the airplane entered a left turn to a southeasterly course and reached a maximum GPS altitude of 959 ft (about 342 ft above ground level [agl]). The airplane then entered another left turn that appeared to continue until the final data point. The altitude associated with the final data point was 890 ft (about 273 ft agl). The final GPS data point was located about 135 ft northeast of the accident site. Based on GPS data and the prevailing surface winds, the airspeed was about 45 knots during the turn. According to the airplane flight manual, the stall speed in level flight with the wing flaps extended was 59 knots. Postaccident examination and testing of the airframe, engines, and related components did not reveal any preimpact mechanical failures or malfunctions that would have precluded normal operation; therefore, the nature of any issue related to the left engine could not be determined. Based on the evidence, the pilot failed to maintain adequate airspeed while turning the airplane back toward the airport, which resulted in an aerodynamic stall/spin.", "probable_cause": "The pilot's failure to maintain airspeed while attempting to return to the airport after a reported engine problem, which resulted in an aerodynamic stall/spin."}