{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1a-bandeirante-kaduna", "date": "Mar 17, 2000 at 1047 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Sky%20Power%20Express%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Abuja - Jos", "msn": "110-446", "yom": 1984, "flight_number": null, "city": "Kaduna-Intl", "zone": "Kaduna", "country": "Nigeria", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8733, "captain_hours_type": 1008, "copilot_hours": 3100, "copilot_hours_type": 200, "aircraft_hours": 10926, "circumstances": "On the day of the accident, the aircraft was engaged in a charter operation for the Central Bank of Nigeria. The first segment of the flight (Lagos - Abuja) was flown by the Commander. The aircraft departed Lagos about 0630 hours UTC and initially at cruise, the crew had a momentary problem setting power on the starboard engine after which the flight continued normally to Abuja. The aircraft which departed Abuja for Jos at 0900 hours UTC had 6 souls on board, 5 hours endurance with the first officer at the controls. At FL 90 and about 30NM from Abuja, the crew again had problems with the cruise power setting on the starboard engine. The torque remained at 1400. The crew retarded the right power lever to the minimum with the aim of achieving a cruise setting of 1300 but the gear warning came on. The Commander at this stage took over the controls from the first officer. At 0923 hours UTC, the aircraft contacted Kaduna Tower that it would be diverting to Kaduna as against its scheduled destination giving its flight level as 90 at a distance of 61 miles and estimating TMA at 24 miles, 'KC' at 41 miles, 6 souls on board and 5 hours endurance at departure. The tower then gave the aircraft an inbound clearance to 'KC' locator maintaining FL 90 and to expect no delay for a locator approach runway 05. Weather report at 0900 hours UTC was also passed to the aircraft as wind 090/05 knots, QNH 1014 and temperature 30°c. At 0928 hours UTC the airplane at about 42 miles, speed between 150-160 kts, requested descent and was cleared to 4,500H, QNH 1014. At about 0935 hours UTC, the pilots contacted tower that they would make a single engine approach because they were having problems controlling power on the starboard engine and it would be shut down. The tower in response, asked whether they would need fire coverage on landing to which the pilots affirmed. The commander then reviewed the single engine approach with the first officer estimating 4,500 ft at 8NM. Approaching 4,500 ft at 11 NM, the crew initiated right engine shut down after which the speed was decayed from 150 to 140 kts. At 0946 hours UTC, the pilot reported 6nm final and field in sight while the tower requested hire to report 4 miles final. Shortly, the controller reported having the aircraft in sight and subsequently cleared it to land on runway 05 giving wind as north easterly 06 knots. Descending at 500ft/min, the commander requested for 25% of flap when the first officer selected full flap. Shortly, the speed started decaying and bleeding faster. When the aircraft was at 2,700 ft high, the speed had already decayed to between 100 - 110 kts. The crew applied full power on the port engine to arrest the speed decay but to no avail . The pilot was trying to correct the descent rate, speed decay and the asymmetry when the stall warning came on. At this juncture, all effort by the controller to establish further contact with the airplane proved abortive. Suddenly, the controller observed a gust of dust in the atmosphere which gave him an indication that the aircraft had crashed. The aircraft crashed into the new VOR/DME site being constructed about 1175m from the threshold of runway 05. Time of accident was 0947 hours UTC.", "probable_cause": "The probable cause of this accident was the poor handling by the crew of the one-engine inoperative approach.\r\nThe following findings were identified:\r\n- The aircraft was properly registered and certified in accordance with the Civil Aviation Regulations of Nigeria.\r\n- The commander of the aircraft was certified and qualified to take the flight while the first officer did not have a licence on board on the clay of the accident. The licence had expired and yet to he renewed.\r\n- The proficiency check attended by the GWW was Without some critical manoeuvres such as simulated single engine approach and stalls.\r\n- The aircraft on departure from Abuja was to land at Jos but diverted to Kaduna. \r\n- The crew informed Kaduna Control Tower that they were doing to make a single engine (port) approach since they were having problems controlling power of the starboard engine.\r\n- The pilots did not adhere to the laid down procedures for a one-engine inoperative approach.\r\n- Crew coordination was practically lacking in this flight.\r\n- The Control Tower lost contact with the aircraft at about 4NM to the airfield.\r\n- The Landing Configuration of the aircraft was full flaps, gear up with power only on the poet engine.\r\n- The starboard engine propeller was not feathered.\r\n- The aircraft crashed into the new VOR/DME site being constructed about Urn from the threshold of runway 05.\r\n- The final resting position of the aircraft was about 68m from the first point of impact and almost turning 180° from its initial direction (flight path).\r\n- There was power on the port engine as there was severe flexural damage to the propeller blades (tips chip off). "}