{"url": "https://www.baaa-acro.com/crash/crash-sud-aviation-se-210-caravelle-iii-hong-kong-24-killed", "date": "Jun 30, 1967 at 1610 LT", "type": "Sud-Aviation SE-210 Caravelle", "operator": "Thai-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Tokyo – Taipei – Hong Kong – Bangkok", "msn": "25", "yom": 1960, "flight_number": "TG601", "city": "Hong Kong-Kai Tak", "zone": "Hong Kong", "country": "China", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 73, "pax_fatalities": 24, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": 7800, "captain_hours_type": 3700, "copilot_hours": 18400, "copilot_hours_type": 2300, "aircraft_hours": 17350, "circumstances": "Thai Airways International Flight 601, a scheduled passenger service from Taipei International Airport, Formosa, to Hong Kong International Airport, departed from Taipei at 0540 hours with an estimated enroute time of 1 hour 27 minutes, and an endurance of 4 hours 19 minutes. The flight was made at flight level 260 and was entirely normal except that, because of turbulence expected from a severe tropical storm, the passenger seat belts were on for the majority of the flight. No turbulence of any importance was in fact experienced. At 0638 hours, when approximately 170 miles from Hong Kong, Flight 601 made contact with Hong Kong airways control and received clearance to descend to flight level 70. At 0658 hours they contacted Hong Kong approach control, which later cleared them to descend to 2 500 feet using an altimeter setting (QNH) of 999 mb, and informed them that there was a heavy rain shower at Hong Kong and that the visibility was very reduced to 2 km. The co-pilot flew the aircraft manually from the right-hand seat, whilst the Captain monitored the approach from the left hand seat and handled the R/T communications, the third pilot, who was acting as the system operator, also monitored the flight instruments. Rhe approach controller provided radar guidance to position the aircraft for an ILS approach to runway 31 and when it was at about 8 miles from touchdown, cleared the pilots to contact the precision controller. This controller cleared them to continue their ILS approach, informed them that there was heavy rain at the field and told them the overshoot procedure to be adopted should this become necessary. The aircraft remained well within the approach safety funnel 2° either side of the localiser centerline and 1/2° above or below the glide slope, until 3 miles from touchdown, the PAR controller having provided information on weather, overshoot instructions and distance from touchdown as shown on the R/T transcript at Appendix C. In his 3 miles distance advisory, the PAR controller informed the pilot that he was just a little to the right; this appeared to be corrected and the aircraft returned to the centre line. At about 2 3/4 miles, the aircraft descended momentarily below the glide slope safety funnel but returned quickly towards the glide slope before the PAR controller had made any advisory comment. At 1 1/2 mile the aircraft was again a little right of centre line and at this time also interference from the heavy rain began to obscure PAR reception, firstly in elevation and, shortly after one mile, also in azimuth. Correlation of the flight recorder readout and the R/T transcript indicates that-approximately 2 seconds after receiving the 1 1/2 mile advisory that he was a little to the right, the co-pilot made a left turn of 14°. Eight seconds later, the PAR controller advised him that he was coming back to the centre line and almost immediately he began a right turn of similar dimensions. Five seconds after this, the PAR controller save the 1 mile advisory and the information that the aircraft was going left of centre after which the aircraft increased its rate of turn to the right. On hearing the 1 mile advisory, the captain reinforced it by telling the co-pilot to move to the right and a moment or two later, when looking across the cockpit, saw the sea about 100 ft below through the copilot's side window. He immediately attempted to make a pull-up, but the aircraft struck the surface, bounced slightly, and settled on the water about 3 925 ft before the ILS reference point of runway 31 and about 100 ft left of the ILS centre line. According to the survivors the impact was not unduly greater than that of a heavy landing but the starboard wing and undercarriage broke away, the latter ripping open the underside of the fuselage; in addition, the rear end of the fuselage broke open. As a result of this damage the aircraft sank very rapidly and 14 of the passengers did not escape from the fuselage and were drowned, 6 were dead on arrival at hospital, 4 were missing and later found drowned. The remaining passengers and the crew were rescued by nearby surface vessels and a helicopter.", "probable_cause": "The causes of the accident were: \r\n- The pilots did not adhere to the Thai Airways procedure for a 'Captain monitored' approach in bad visibility, \r\n- The captain did not monitor the approach adequately,\r\n- The copilot mishandled the aircraft after descending below minimum altitude,\r\n- Downdraughts may have contributed to the height loss which resulted from this mishandling."}