{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-321b-cove-neck-73-killed", "date": "Jan 25, 1990 at 2134 LT", "type": "Boeing 707", "operator": "Avianca-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Bogotá – Medellín – New York", "msn": "19276/592", "yom": 1967, "flight_number": "AV052", "city": "Cove Neck", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 9, "crew_fatalities": 8, "pax_on_board": 149, "pax_fatalities": 65, "other_fatalities": 0, "total_fatalities": 73, "captain_hours": 16787, "captain_hours_type": 1534, "copilot_hours": 1837, "copilot_hours_type": 64, "aircraft_hours": 61764, "circumstances": "Avianca flight 052 (AV052), a Boeing 707-321B with Colombian registration HK-2016, crashed in a wooded residential area in Cove Neck, Long Island, NY. AV052 was a scheduled international passenger flight from Bogotá, Colombia, to New York-JFK Intl Airport, NY, with an intermediate stop at Jose Maria Cordova Airport, near Medellín, Columbia. Of the 158 persons aboard, 73 were fatally injured. Because of poor weather conditions in the northeastern part of the United States, the flightcrew was placed in holding 3 times by ATC for a total of about 1 hour and 17 minutes. During the 3rd period of holding, the flightcrew reported that the aircraft could not hold longer than 5 minutes, that it was running out of fuel, and that it could not reach its alternate airport, Boston-Logan Intl. Subsequently, the flightcrew executed a missed approach to JFK Intl Airport. While trying to return to the airport, the aircraft experienced a loss of power to all 4 engines and crashed approximately 21 miles northeast of JFK Airport. ", "probable_cause": "The failure of the flightcrew to adequately manage the airplane's fuel load, and their failure to communicate an emergency fuel situation to air traffic control before fuel exhaustion occurred. Contributing to the accident was the flightcrew's failure to use an airline operational control dispatch system to assist them during the international flight into a high-density airport in poor weather. Also contributing to the accident was inadequate traffic flow management by the faa and the lack of standardized understandable terminology for pilots and controllers for minimum and emergency fuel states. The safety board also determines that windshear, crew fatigue and stress were factors that led to the unsuccessful completion of the first approach and thus contributed to the accident."}