{"url": "https://www.baaa-acro.com/crash/crash-havilland-dhc-3-turbo-otter-yellowknife", "date": "Jun 24, 2005 at 1912 LT", "type": "De Havilland DHC-3 Otter", "operator": "Air%20Tindi", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Yellowknife - Blachford Lake", "msn": "142", "yom": 1956, "flight_number": null, "city": "Yellowknife", "zone": "Northwest Territories", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Air Tindi Ltd. de Havilland DHC-3T (Turbo) Otter (registration C-FXUY, serial number 142) water taxied from the Air Tindi dock at Yellowknife, Northwest Territories, for a charter flight to Blachford Lake. The aircraft was loaded with two crew members, seven passengers, and 840 pounds of cargo. Before the flight, the pilot conducted a preflight passenger briefing, which included information about the location of life preservers and emergency exits. During the take-off run, at about 1912 mountain daylight time, the aircraft performed normally. It became airborne at about 55 mph, which is lower than the normal take-off speed of 60 mph. The pilot applied forward control column to counter the pitch-up tendency, but there was no response. He then trimmed the nose forward, but the aircraft continued to pitch up until it stalled at about 50 feet above the water and the left wing dropped. The aircraft struck the water in the East Bay in a nose-down, 45/ left bank attitude. On impact, the left wing and left float detached from the aircraft, and the aircraft came to rest on its left side. The crew was able to evacuate the passengers before the aircraft submerged, and local boaters assisted in the rescue. There were no serious injuries to the crew or passengers. The aircraft suffered substantial damage.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The aircraft was loaded in such a manner that the C of G was beyond the rearward limit. This resulted in the aircraft’s aerodynamic pitch control limitation being exceeded.\r\n2. A weight and balance report was not completed by the pilot prior to departure and, as a consequence, he was unaware of the severity of the aft C of G position.\r\nFinding as to Risk:\r\n1. The weight of the passengers was underestimated due to the use of standard weights. This increased the potential of inadvertently loading the aircraft in excess of its maximum certified take-off weight. "}