{"url": "https://www.baaa-acro.com/crash/crash-cessna-414a-chancellor-hayden-2-killed", "date": "Feb 19, 2012 at 1525 LT", "type": "Cessna 414 Chancellor", "operator": "Scott A. Humpal", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dalhart - Hayden", "msn": "414-0095", "yom": 1978, "flight_number": null, "city": "Hayden-Yampa Valley", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot performed an instrument approach to the runway with an approaching winter storm. A review of on-board global positioning system (GPS) data indicated that the airplane flew through the approach course several times during the approach and was consistently below the glideslope path. The airplane continued below the published decision height altitude and drifted to the right of the runway’s extended centerline. The GPS recorded the pilot’s attempt to perform a missed approach, a rapid decrease in ground speed, and then the airplane descend to the ground, consistent with an aerodynamic stall. Further, the airplane owner, who was also a passenger on the flight, stated that, after the pilot made the two “left turning circles” and had begun a third circle, he perceived that the airplane “just stalled.” An examination of the airframe and engine did not detect any preimpact anomalies that would have precluded normal operation. The airplane’s anti-ice and propeller anti-ice switches were found in the “off” position. A review of weather information revealed that the airplane was operating in an area with the potential for moderate icing and snow. Based on the GPS data and weather information, it is likely that the airframe collected ice during the descent and approach, which affected the airplane’s performance and led to an aerodynamic stall during the climb.\n", "probable_cause": "The pilot’s inadvertent stall during a missed approach. Contributing to the accident was the pilot’s operation of the airplane in forecasted icing conditions without using all of its anti-ice systems.\n"}