{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-12-near-marga-13-killed", "date": "Jul 21, 1949 at 1135 LT", "type": "Ilyushin II-12", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Moscow – Krasnoyarsk – Irkutsk – Khabarovsk", "msn": "8 301 28 11", "yom": 28, "flight_number": "SU005", "city": "Marga", "zone": "Irkutsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 5, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was performing a flight from Moscow to Khabarovsk with intermediate stops in Krasnoyarsk and Irkutsk with a load consisting of 2,204 kilos of various goods and 115 kilos of mail. En route to Irkutsk, at an altitude of 3,000 meters, the left engine caught fire. The crew was able to extinguish the fire but the captain decided to divert to Nizhneudinsk Airport for a safe landing. As the crew was unable to maintain a safe altitude, the passengers jettisoned the mail bags. While at a height of some 40-60 meters with only the right engine running, the aircraft hit the tops of several larches, stalled and crashed in flames in a grain field located 5 km southeast of the Sheberta rail station, northeast of Marga. One crew member was injured while 13 other occupants were killed. The aircraft was destroyed. ", "probable_cause": "The fire on the left engine was the consequence of the failure of the piston #12 that broke in flight as a result of the defect of the upper part of the rod. Following this, the bolt broke and the fuel leaked into the engine and ignited while in contact with high temperature elements. It was reported that the piston failure was due to a bore default during the construction. Also, experts blamed the crew who did not take the decision to land immediately rather than trying to reach Nizhneudinsk Airport that was situated 60 kilometers from their position."}