{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-ii-charlotte-amalie-2-killed", "date": "Feb 8, 1997 at 1932 LT", "type": "Cessna 402", "operator": "Air%20Sunshine", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Christiansted – Charlotte Amalie", "msn": "402C-0318", "yom": 1980, "flight_number": "YI319", "city": "Charlotte Amalie-Cyril E. King (ex Harry S. Truman)", "zone": "All US Virgin Islands", "country": "US Virgin Islands", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 13000, "captain_hours_type": 9000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16085, "circumstances": "As the flight made a visual approach to the airport from the south over the sea, at night, the pilot changed his navigation radio from the VOR to the ILS system for runway 10 and lost DME reading from the VOR located on a hill north of the localizer course. The localizer showed the flight was south of the localizer course, and without DME from the VOR the pilot believed he was much closer to the island and the airport than the aircraft actually was. As the pilot attempted to make visual contact with the airport and maintain clearance from the hills he allowed the aircraft to descend and crash into the sea about 3 miles southwest of the airport. The pilot had not filed a FAA flight plan for the scheduled commuter flight. The pilot had been flying the route for 5 days and had no previous experience in the area. The pilot reported he had no mechanical malfunctions with the aircraft systems, flight controls, or engines. No FAA Operations inspectors had conducted surveillance on the company's flight operations in the Caribbean since service had begun in December 1996.", "probable_cause": "The failure of the pilot to maintain altitude while making a visual approach at night over water in black hole conditions resulting in the aircraft descending and crashing into the sea. Contributing to the accident was the failure of the pilot and operator to use all available air traffic control and navigational facilities, and the FAA Principle Operations Inspector's inadequate surveillance of the operation. "}