{"url": "https://www.baaa-acro.com/crash/crash-yakovlev-yak-40-ust-kut-7-killed", "date": "Dec 17, 1976 at 1940 LT", "type": "Yakovlev Yak-40", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Ust-Kut - Kirensk", "msn": "9 63 13 49", "yom": 1976, "flight_number": null, "city": "Ust-Kut", "zone": "Irkutsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 327, "circumstances": "The aircraft was engaged in a cargo flight from Ust-Kut to Kirensk, carrying a crew of three, two technicians of the company and two people in charge of the 1,200 kg of cargo. The crew failed to prepare the flight properly, expedited taxi and departure. The airplane took off from runway 30 at a speed of 155 km/h and with an angle of attack of 15°. After rotation, while in initial climb at a height of 120 metres at a speed of 210 km/h, the pilot raised the flaps when the airplane lost height and descended until it struck trees and crashed in flames 1,500 metres past the runway end. The copilot was seriously injured while all six other occupants were killed. Few hours later, the copilot died from his injuries.", "probable_cause": "It was determined that the crew precipitated the takeoff procedure and failed to follow the pre-departure checklist. The following contributing factors were reported:\r\n- Poor flight preparation, \r\n- The cabin was not heated prior to departure, \r\n- The left altimeter was erroneously set with a value 10 mm Hg higher than prescribed (wrong altimeter setting),\r\n- Stabilizers were set at -6° instead of the required -3,6° angle,\r\n- The rotation was completed prematurely, \r\n- During initial climb, flaps were raised at a speed of 210-220 km/h, 20 km/h below the speed mentioned in the Flight Manual,\r\n- Lack of visibility,\r\n- Lack of ground visual references. "}