{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-mirage-hollywood", "date": "Apr 7, 1991 at 1919 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Igor Paskhover", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Las Vegas – Santa Monica", "msn": "46-8608044", "yom": 1986, "flight_number": null, "city": "Hollywood-Burbank (Bob Hope)", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 398, "captain_hours_type": 45, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A Piper PA-46-310P loss engine power and collided with a telephone pole during the forced landing. The pilot contacted the tracon and informed the facility he had a partial power loss. The airplane was about two miles east of the airport at about 3,500 feet msl heading in a southwesterly direction. The tracon instructed the pilot to turn 150° for radar vectors to runway 33. The pilot did not turn to the 150° heading, but continued on a southwesterly course. The airplane flew past the approach ends of two runways. The airplane continued westbound and crashed 2.5 miles west of the airport. The pilot indicated the airplane had 300 pounds (about 50 gallons) of fuel on board at takeoff. The pilot operating handbook for the Piper PA-34-310P is about 16 gallons per hour. The duration of the flight was about one hour. There was no evidence of fuel in the airplane's fuel system or any evidence of fuel spillage from either of the wings after the accident.", "probable_cause": "The pilot-in-command's poor preflight planning, inadequate fuel consumption calculations which resulted in a loss of engine power due to fuel exhaustion, and the pilot-in-command's failure to follow air traffic control verbal instructions which would have guided him to a probable safe landing at an airport."}