{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-i-winfield-4-killed", "date": "Oct 13, 2016 at 2136 LT", "type": "Cessna 500 Citation", "operator": "Norjet", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Kelowna – Calgary", "msn": "500-0169", "yom": 1974, "flight_number": null, "city": "Kelowna", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3912, "captain_hours_type": 525, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8649, "circumstances": "The pilot and 3 passengers boarded the aircraft. At 2126, the pilot obtained an IFR clearance from the CYLW ground controller for the KELOWNA SEVEN DEP standard instrument departure (SID) procedure for Runway 34. The instructions for the runway 34 KELOWNA SEVEN DEP SID were to climb to 9000 feet ASL, or to an altitude assigned by air traffic control (ATC), and to contact the Vancouver Area Control Centre (ACC) after passing through 4000 feet ASL. The aircraft was then to climb and track 330° magnetic (M) inbound to the Kelowna non-directional beacon (LW). From LW, the aircraft was to climb and track 330°M outbound for vectors to the filed or assigned route. At 2127, C-GTNG began to taxi toward Runway 34. At 2131, the CYLW tower controller cleared the aircraft to take off from the intersection of Runway 34 and Taxiway D. The pilot acknowledged the clearance and began the take-off roll on Runway 34 about 1 minute later. Radar data showed that, at 2133:41, the aircraft was 0.5 nautical miles (nm) beyond the departure end of the runway and was climbing at more than 4000 feet per minute (fpm) through 2800 feet ASL, at a climb angle of approximately 16°. In that time, it had deviated laterally by about 3° to the right of the 330°M track associated with the SID. At 2134:01, when the aircraft was 1.2 nm beyond the runway, it had climbed through 3800 feet ASL and deviated further to the right of the intended routing. The aircraft’s rate of climb decreased to about 1600 fpm, and its ground speed was 150 knots. A short time later, the aircraft’s rate of climb decreased to 600 fpm, its climb angle decreased to 2°, and its ground speed had increased to 160 knots. At 2134:22, the aircraft was 2.1 nm beyond the departure end of the runway, and it was climbing through approximately 4800 feet ASL. The aircraft had deviated about 13° to the right of the intended track, and its rate of climb reached its maximum value of approximately  000 fpm, 3 with a climb angle of about 22°. The ground speed was roughly 145 knots. At 2134:39, the aircraft was 2.7 nm beyond the departure end of the runway, passing through 5800 feet ASL, and had deviated about 20° to the right of the intended routing. The rate of climb was approximately 2000 fpm, with a climb angle of about 7°. According to the SID, the pilot was to make initial contact with the ACC after the aircraft had passed through 4000 feet ASL.Initial contact was made when the aircraft was passing through 6000 feet ASL, at 2134:42. At 2134:46, the ACC acknowledged the communication and indicated that the aircraft had been identified on radar. The aircraft was then cleared for a right turn direct to the MENBO waypoint once it was at a safe altitude, or once it was climbing through 8000 feet ASL. The aircraft was also cleared to follow the flight-planned route and climb to 10 000 feet ASL. At 2134:55, the pilot read back the clearance as the aircraft climbed through 6400 feet ASL, with a rate of climb of approximately 2400 fpm. The aircraft was tracking about 348°M at a ground  speed of about 170 knots. At 2135:34, the aircraft began a turn to the right, which was consistent with the instruction from the ACC. Flying directly to the MENBO waypoint required the aircraft to be on a heading of 066°M, requiring a right turn of about 50°. At this point, the aircraft was still climbing and was passing through 8300 feet ASL. The rate of climb was about 3000 fpm. The aircraft continued the right turn and was tracking through 085°M. After reaching a peak altitude of approximately 8600 feet ASL, the aircraft entered a steep descending turn to the right, consistent with the characteristics of a spiral dive. At 2135:47, the ACC controller cleared C-GTNG to climb to FL 250. The lack of radar returns and radio communications from the aircraft prompted the controller to initiate search activities. At 2151, NAV CANADA notified first responders, who located the accident site in forested terrain at about midnight. The aircraft had been destroyed, and all of the occupants had been fatally injured.", "probable_cause": "The aircraft departed controlled flight, for reasons that could not be determined, and collided with terrain."}