{"url": "https://www.baaa-acro.com/crash/crash-saab-340a-near-prahuaniyeu-22-killed", "date": "May 18, 2011 at 2050 LT", "type": "Saab 340", "operator": "SOL%20Lineas%20Aereas", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Rosario – Córdoba – Mendoza –    Neuquén – Comodoro Rivadavia", "msn": "25", "yom": 1985, "flight_number": "OSL5428", "city": "Prahuaniyeu", "zone": "Río Negro", "country": "Argentina", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 19, "pax_fatalities": 19, "other_fatalities": 0, "total_fatalities": 22, "captain_hours": 6133, "captain_hours_type": 2187, "copilot_hours": 1342, "copilot_hours_type": 288, "aircraft_hours": 41422, "circumstances": "On 18 May 2011, the pilot in command (PIC) and the crew - composed of the copilot (COP) and cabin crew members (CCM) - initiated the flight OSL5428 from Rosario International Airport (ROS) in the province of Santa Fe at 20:35, the final destination being the Comodoro Rivadavia International Airport (CRD), in the province of Chubut. The flight had scheduled intermediate stopovers at Córdoba International Airport (COR), Mendoza (MDZ), and Neuquén (NQN), according to the company's plans. The company designated aircraft Saab 340A, with registration number LV-CEJ, for the flight. After having made the intermediate stopovers in Córdoba (COR) and Mendoza (MDZ), the pilot landed the aircraft at the airport in Neuquén at 22:20. After refuelling and carrying out the planned dispatch, the crew and 19 passengers (18 adults and one minor) on board, prepared to make the last leg of the flight OSL5428, from Neuquén Airport (NQN) to the final destination: Comodoro Rivadavia International Airport (CRD). The flight took off at 23:05. After the take-off, the aircraft started to climb AWY T 105, to reach FL190, in accordance with the flight plan. After flying for 24 minutes, the pilot levelled the aircraft at 17,800 feet, and remained at this level for approximately 9 minutes. Due to the fact that the meteorological conditions at this level caused icing, the technical crew descended to FL (flight level) 140. Shifting to FL140 took five minutes. During this stage of the flight the icing conditions steadily worsened. By the time the aircraft had reached FL140, the icing conditions were severe. The aircraft flew for approximately two minutes with a straight and level flight attitude, increasing the accumulation of ice. Then the aircraft completely lost lift, which resulted in a loss of control, and the subsequent entry into abnormal flight attitude. The aircraft plunged towards the earth and impacted the ground, which resulted in a fire. Everyone on board perished and the aircraft was destroyed. The accident happened at night under IMC conditions.", "probable_cause": "During a commercial, domestic passenger flight, while cruising, the crew lost control of the aircraft, which uncontrollably impacted the ground due to severe ice formation caused by the following factors:\r\n- Entering an area with icing conditions without adequately monitoring the warning signals from the external environment (temperature, cloudiness, precipitation and ice accumulation) or the internal (speed, angle of attack), which allowed for prolonged operations in icing conditions to take place.\r\n- Receiving a forecast for slight icing - given that the aircraft encountered sever icing conditions - which led to a lack of understanding regarding the specific meteorological danger.\r\n- Inadequately evaluating the risks, which led to mitigating measures such as adequate briefing (distribution of tasks in the cockpit, review of the de-icing systems, limitations, use of power, use of autopilot, diversion strategy etc.) not being adopted.\r\n- Levels of stress increasing, due to operations not having the expected effects, which led the crew to lose focus on other issues.\r\n- Icing conditions that surpassed the aircraft's ice protection systems, which were certified for the aircraft (FAR 25 Appendix C).\r\n- Inadequate use of speed, by maintaining the speed close to stall speed during flight in icing conditions.\r\n- Inadequate use of the autopilot, by not selecting the IAS mode when flying in icing conditions.\r\n- Partially carrying out the procedures established in the Flight Manual and the Operations Manual, when entering into areas with severe icing conditions.\r\n- Realizing late that the aircraft had started to stall, because the buffeting that foretells a stall was confused with the vibrations that signify ice contamination on the propellers.\r\n- Activation of the Stick Shaker and Stall Warning at a lower speed than expected in icing conditions.\r\n- Using a stall recovery technique which prioritized the reduction of the angle of attack at the expense of altitude loss, and which was inappropriate for the flight conditions.\r\n- The aileron flight controls reacting in an unusual manner when the aircraft lost control, probably due to the accumulation of ice in the surfaces of these, which made it impossible for the aircraft to recover. The increasingly stressful situation of the crew, which affected its operational decision-making."}