{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-long-haul-lake-1-killed", "date": "Jun 25, 1999 at 1320 LT", "type": "De Havilland DHC-3 Otter", "operator": "Blue%20Water%20Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "Yes", "site": "Plain, Valley", "schedule": null, "msn": "73", "yom": 1955, "flight_number": null, "city": "Long Haul Lake", "zone": "Manitoba", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 23960, "circumstances": "The Blue Water Aviation Services seaplane departed from Long Haul Lake, Manitoba, with a pilot and an aviation maintenance engineer on board. Shortly after take-off, at 1320 central daylight savings time, the aircraft's engine abruptly lost power. The pilot's attempts to restart the engine were unsuccessful, and the aircraft descended into a stand of trees and struck the ground. The engineer suffered fatal injuries, and the pilot was seriously injured. The aircraft was destroyed by impact forces.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The most likely accident scenario during the second take-off is that water contamination migrated from the centre fuel tank to the engine, resulting in a loss of engine power.\r\n2. The engine stopped at a point from which there was insufficient time for the engine to restart, nor from which a safe landing could be made.\r\n3. Indications of water contamination were found in the fuel system after the occurrence; however, the source(s) of the water contamination could not be identified.\r\nOther Findings:\r\n1. Examination of the aircraft and testing of the engine and components did not identify any pre-occurrence structural, mechanical, or electrical defects or malfunctions that would have\r\ncontributed to this occurrence.\r\n2. The post-crash fire in the carburettor most likely resulted from uncontaminated fuel brought forward by the windmilling engine and the pilot's efforts to clear contamination from the fuel\r\nsystem.\r\n3. The pilot's use of his shoulder harness likely prevented more serious injuries during the impact sequence.\r\n4. The engineer's injuries likely would have been less severe had he been using both his seat belt and shoulder harness.\r\n5. The pilot was certified and qualified for the flight.\r\n6. The aircraft's weight and centre of gravity were within approved limits.\r\n7. The aircraft's records indicated that the aircraft had been certified and maintained in accordance with existing regulations.\r\n8. The aircraft's engine power loss during the first attempted take-off was likely due to water contamination in the fuel."}