{"url": "https://www.baaa-acro.com/crash/crash-short-s23-empire-flying-boat-atlantic-ocean-3-killed", "date": "Jan 21, 1939 at 1309 LT", "type": "Short S.23 Empire Flying Boat", "operator": "Imperial%20Airways-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Port Washington – Hamilton – Southampton", "msn": "S.812", "yom": 1936, "flight_number": null, "city": "Atlantic Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 5, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The seaplane named 'Cavalier' departed Port Washington Seaplane Base in Long Island at 1038LT on a transatlantic flight to Southampton with an intermediate stop in Hamilton, Bermuda. About two hours later, the crew encountered poor weather conditions and decided to modify his route to avoid a cumulonimbus area. Doing so, the aircraft lost height and while cruising in poor weather with low temperature, the pilot decided to return to his initial route when both inner engines stopped while both outboard engines lost power. In such situation, the captain decided to ditch the aircraft some 285 miles southeast of Port Washington. The radio operator was able to report his position and the aircraft sank about 15 minutes after ditching. The tanker named 'Esso Baytown' arrived on scene aroung midnight and his crew was able to evacuated 10 injured people while three others were killed, among them one crew member.  \r\nCrew:\r\nM. R. Alderson, pilot,\r\nNeil Richardson, copilot.", "probable_cause": "The fact of the descent was entirely due to complete loss of power in the case of the two inner engines and partial loss of power in the outboard engines owing to carburetor icing trouble. The sea conditions were such that a safe landing was impossible and, as a result of damage to the hull, the machine sank in about fifteen minutes after breaking in half."}