{"url": "https://www.baaa-acro.com/crash/crash-cessna-s550-citation-ii-poughkeepsie", "date": "Feb 27, 1989 at 0808 LT", "type": "Cessna 550 Citation II", "operator": "Nynex_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "White Plains - Poughkeepsie", "msn": "550-0096", "yom": 1986, "flight_number": null, "city": "Poughkeepsie-Hudson Valley (ex Dutchess County)", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6135, "captain_hours_type": 635, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 703, "circumstances": "Witnesses reported aircraft was high during approach and landed nosewheel 1st about 1,600 feet beyond threshold, then became airborne and bounced 2 times. Pilot stated that before touchdown, he started to 'spool up' engines, but noted lack of response, then retarded throttles and landed. He said he applied brakes and selected 'full reverse' and noted no response. Reportedly, nosewheel 'skipped into air' while aircraft still had flying speed. With insufficient runway remaining to stop, he elected to stow reversers and began go-around. He noted no response from engines, tho aircraft had became airborne. Aircraft then settled beyond departure end of runway and crashed on rough terrain. Examination revealed engines had ingested twigs, grass and dirt. Reverse load limiters (l/l) on both engines were found in tripped position. Flight man stated that to avoid actuation of l/l, do not advance primary throttle after returning reverse thrust lever to stow until unlock light is out; maint required to reset actuated l/l. L/l was incorporated on thrust reverser to reduce engine power to idle, if inadvertently deployed in flight. During post-accident check, both engines were operated to 85% after l/l reset.", "probable_cause": "The pilot's improper use of the powerplant controls, which resulted in actuation (tripping) of the reverse load limiters on the thrust reversers and subsequent reduction of available power in both engines. Factors related to the accident were: the pilot's misjudgement of distance, excessive airspeed, and improper flare during the landing."}