{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130e-hercules-san-miguel-de-tucuman-6-killed", "date": "Aug 28, 1975 at 1305 LT", "type": "Lockheed C-130 Hercules", "operator": "Fuerza%20Aerea%20Argentina-3", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Miguel de Tucumán – La Rioja – San Juan – El Palomar", "msn": "4309", "yom": 1968, "flight_number": null, "city": "San Miguel de Tucumán-Teniente Benjamin Matienzo", "zone": "Tucumán", "country": "Argentina", "region": "South America", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 114, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane was flying back to El Palomar Airbase in Buenos Aires with intermediate stops in La Rioja and San Juan, carrying 114 policemen (Argentine Federal Police) who were returning to their base after an intervention in the Tucumán Province. During the takeoff roll, after a course of 800 meters and at a speed of 200 km/h, the pilot started the rotation when an explosion occurred on the runway surface approximately 100 meters in front of him. While climbing to a height of some 12-15 meters, the aircraft was hit by debris and the denotation. Control was lost and the airplane crashed in flames 400 meters further. 115 occupants were evacuated, 29 of them were injured. Six policemen were killed and the aircraft was destroyed. ", "probable_cause": "Loss of control during takeoff following a bomb explosion that was placed on the runway pavement. Investigations determined that a plan was to set off an explosive charge in the form of a conical tip placed below the runway when the C-130 was to be at full throttle during takeoff. Named 'Operation Gardel', the action was planned by the Peronist guerilla organization 'Montoneros'. Near the middle of the runway some 1,100 meters away from the northern end and 1,000 from the southern, a disused sewer led to a storm drain. A cable was laid through the 250 meter tunnel, emerging from the storm drain and connecting the charge to the 12V battery of a parked vehicle. The switch would be activated from a nearby pit."}