{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-049-constellation-peak-genoa-85-killed", "date": "Mar 1, 1964 at 1129 LT", "type": "Lockheed L-049 Constellation", "operator": "Paradise%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Oakland – San José – Salinas – South Lake Tahoe", "msn": "2025", "yom": 1946, "flight_number": "PD901A", "city": "Genoa Peak", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 81, "pax_fatalities": 81, "other_fatalities": 0, "total_fatalities": 85, "captain_hours": 15391, "captain_hours_type": 3266, "copilot_hours": 3553, "copilot_hours_type": 1353, "aircraft_hours": 45629, "circumstances": "The Paradise Airlines Lockheed Constellation operated Flight 901A from Oakland (OAK) to Tahoe-Valley Airport (TVL) via Salinas (SNS) and San Jose (SJC). The aircraft departed Oakland at 08:43 and was ferried to Salinas, arriving at 09:11. The flight departed at 09:27 with 18 passengers and arrived at San Jose at 09:46. The Constellation departed was airborne again at 10:40 on a VFR flight plan. After becoming airborne, the crew requested and received an IFR clearance via airways Victor 6 South to Sacramento, Victor 6 to the Lake Tahoe VOR, to maintain 11,000 feet. The company prepared flight plan then called for a VFR flight to the Tahoe Valley Airport because there was no approved IFR approach procedure for the destination. At 10:57 Flight 901A was in radio communication with Paradise Flight 802 which was outbound from the Tahoe Valley Airport. The captain of Flight 802 advised the crew of Flight 901 that he had encountered \"...icing at 12,000 (feet) ... there were snow showers over the lake and clouds topping mountains in the vicinity ...\". Flight 901A then climbed to a cruising altitude of 15000 feet. The crew of Flight 901A contacted the Paradise Airlines passenger agent at the Tahoe Valley Airport at 11:27. At this time he gave them the 11:00 Tahoe Valley weather which was: Estimated ceiling 2,000 feet overcast; 3 miles visibility; snow showers; temperature 32°; dewpoint 32°; wind from 210°; 10 knots, gusts to 15 knots; altimeter 29.97. He also asked the crew to call the company if they decided to land at Reno, Nevada rather than Tahoe Valley. The crew acknowledged this transmission with \"will do.\" The crew apparently decided to abandon the approach. They took up a heading which took them towards the high terrain east of the lake. It is very likely that from their position over the Tahoe VOR they were able to observe the VFR conditions that existed east of Lake Tahoe on the leeward side of the mountains. Additionally, investigators assumed that the first officer was aware of the existence of Daggett Pass and considered it an access to VFR conditions beyond the pass. An altitude of 9,000 feet would provide about 1,500 feet terrain clearance through the center of the pass. Then, either because they believed they had sufficient altitude to clear the terrain or because they were unable to climb higher due to structural ice, the aircraft leveled off. At that time the aircraft struck several trees on the west slope of a ridge of Genoa Peak at approximately 8,675 ft, slightly right-wing-low in a nearly level flight attitude. The airplane broke up, killing all aboard.", "probable_cause": "The Board determines that the probable cause of this accident was the pilot's deviation from prescribed VFR flight procedures in attempting a visual landing approach in adverse weather conditions. This resulted in an abandoned approach and geographical disorientation while flying below the minimum altitude prescribed or operations in mountainous areas."}