{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-alpine", "date": "Aug 28, 1999 at 1021 LT", "type": "Cessna 414 Chancellor", "operator": "Mack Ponder", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Alpine - Lajitas", "msn": "414-0066", "yom": 1970, "flight_number": null, "city": "Alpine-Casparis", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 383, "captain_hours_type": 24, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5581, "circumstances": "The pilot had the main and auxiliary fuel tanks filled and performed an abbreviated preflight prior to departing the Alpine Airport. The pilot did not perform an engine run-up prior to takeoff. The pilot stated that while the airplane was climbing through 100 feet agl, the left engine 'started to surge.' The pilot reported that he knew the airplane would not be able to climb at field elevation with one engine inoperative. The pilot switched the left engine's boost pump from low to high; however, the left engine continued to surge while the airplane lost altitude. The pilot initiated a forced landing with the landing gear and flaps retracted and the left propeller unfeathered. The airplane impacted the ground left wing tip first and a fire erupted, which damaged the left wing and left side of the fuselage. The left engine's spark plugs were found covered with thick black soot. The left engine's magnetos were rotated using an electric hand-held drill, and the left magneto did not produce any spark and the right magneto produced a spark in three of its six distributor cap posts. The left magneto's primary winding resistance and capacitor leakage were found to be beyond the manufacturer's specified limits. The internal components of both magnetos were covered in a dark oil and debris. The maximum takeoff weight for the accident airplane was 6,350 pounds; however, the takeoff weight at the time of the accident was calculated to be 6,509 pounds. The aircraft's single engine performance charts indicated that the airplane would obtain a 29 fpm climb at maximum gross weight with the inoperative engine feathered. The pilot operating handbook's supplement section indicated that the auxiliary fuel pump should only be used when the engine-driven fuel pump failed. A caution statement states in bold print, 'If the auxiliary fuel pump switches are placed in the HIGH position with the engine-driven fuel pump(s) operating normally, total loss of engine power may occur.'", "probable_cause": "The pilot's improper use of the emergency fuel boost pump, which resulted in excessive fuel flow to the engine and subsequent total loss of left engine power. Factor's were the high density altitude, the pilot exceeding the airplane's weight and balance, the partial loss of left engine power as a result of the faulty magnetos, and the pilot's inadequate preflight inspection  by not performing an engine run-up. "}