{"url": "https://www.baaa-acro.com/crash/crash-avro-694-lincoln-amberley-16-killed", "date": "Feb 19, 1948 at 1745 LT", "type": "Avro 694 Lincoln", "operator": "Royal-Australian-Air-Force-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Laverton-Amberley", "msn": null, "yom": null, "flight_number": null, "city": "Amberley", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 12, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Laverton at 1415LT for Amberley. Aeradio position reports were received normally through out the flight, until 1734LT, when clearance was obtained to descend from 8000 feet preparatory to the landing at Amberley. A short time later Amberley Flight Control cleared the aircraft for a straight-in approach RWY 05 at an angle of 45 degrees, turn right to align itself with the runway and commence to lose height on the approach - which appeared to be lower and faster that usual. The aircraft touched down in a tail high attitude, approximately 300 feet after crossing the threshold. After travelling a short distance, the aircraft then left the ground, rising to about five feet. From eyewitness reports, attempts were then made by the crew to force the aircraft onto the runway but this only resulted in three more bounces. When about 600 feet from the upwind end of the runway, engine power was applied to make a go around. It is estimated by ground observers that, by this stage, the airspeed of the Lincoln had decreased to approximately 80-85 knots. The Lincoln was then seen to climb slightly, level out at 100 feet, after which the nose of the aircraft rose sharply to place the aircraft in a climbing attitude of 40 degrees. After a further few seconds, the attitude changed abruptly to a climb of 80 degrees. With all engines roaring presumably under full power, the aircraft attained an altitude of approximately 500 feet AGL when, with no forward speed, the port wing slowly dropped and the aircraft steadily accelerated until the port main plane struck the ground in a vertical position. By this time the fuselage was parallel with the ground. The aircraft caught fire immediately and, although the fire tender arrived shortly after the crash, the fire could not be sufficiently controlled to extricate the crew or passengers. The crash site was 400 yards from the end of RWY 05 and displaced approximately 100 yards left of the runway. \r\nSource: http://www.adf-gallery.com.au/", "probable_cause": "The accident was caused by a bad load distribution of freight and passengers for the landing, which resulted in the C of G being placed outside the aft limit. This situation occurred principally through the carriage of freight in an aircraft not designed for such a purpose. It was possible for the aircraft to take off at Laverton and fly to Amberley with the C of G outside the aft limit of 66 inches. It is probable also, that with cruising power, the aircraft could be trimmed for level flight, albeit abnormally tail heavy. "}