{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-boyne-falls-2-killed", "date": "Mar 23, 1986 at 1643 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Richard H. Turner", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Detroit – Boyne Falls", "msn": "46-8508007", "yom": 1985, "flight_number": null, "city": "Boyne Falls-Boyne Mountain", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1168, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After the pilot was cleared for an RNAV-B approach, the aircraft crashed on hilly terrain approximately 3 miles southeast of the airport at an elevation of 750 feet msl. Impact occurred after the aircraft had turned to the south-southeast and was descending. Minimum descent altitude (MDA) for the approach was 1,680 feet. No preimpact mechanical problems were found. Approximately 4 hours before takeoff, FSS personnel provided a weather briefing. There was no weather reporting station at the destination, but the area forecast was for marginal VMC with isolated visibilities of 3 to 5 miles in light snow showers. Pellston (approximately 25 miles away) was forecast for a chance of 1,200 feet overcast and 3 miles visibility with light snow showers, but this info was not given to the pilot. Later, when the pilot filed an IFR flight plan, he did not update his weather briefing. While en route, he checked the Pellston and Traverse City weather and was advised they had indefinite or obscured ceilings of 1,500 feet or less with gusty winds and light snow squalls. According to witnesses, there were snow showers or squalls in the accident area with 1/4 to 3/4 miles visibility. The missed approach procedure called for: right climbing turn to 3,000 feet, proceed to the IAF (8 miles south of airport) and hold. Both occupants were killed. ", "probable_cause": "Occurrence #1: in flight encounter with weather\r\nPhase of operation: approach - faf/outer marker to threshold (ifr)\r\nFindings\r\n1. (f) preflight planning/preparation - inadequate - pilot in command\r\n2. (f) preflight briefing service - inadequate - atc personnel (fss)\r\n3. (f) weather condition - low ceiling\r\n4. (f) weather condition - snow\r\n5. (f) weather condition - high wind\r\n6. (f) weather condition - gusts\r\n7. (f) weather condition - obscuration\r\n8. (f) weather condition - below approach/landing minimums\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: approach\r\nFindings\r\n9. (c) ifr procedure - not followed - pilot in command\r\n10. (c) minimum descent altitude - not maintained - pilot in command\r\n11. (c) descent - not corrected - pilot in command "}