{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-mexia", "date": "Sep 21, 2005 at 1930 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Sky Lifts", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Mexia – La Porte", "msn": "61-0484-196", "yom": 1978, "flight_number": null, "city": "Mexia", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 700, "captain_hours_type": 48, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The 700-hour private pilot flying the twin-engine airplane with four passengers aboard used approximately three-quarters of runway 18 before becoming airborne. After establishing a positive rate of climb, the pilot retracted the landing gear and pitched the airplane for a 92 knot climb. Shortly thereafter the rate of climb decreased and the airplane's control authority began to decay. The pilot responded by applying full throttle to both engines and reduced the angle of attack in an attempt to regain airspeed. The pilot was able to arrest the airplane's decaying airspeed and descent; however, the airplane collided with a barn and then a grassy field before coming to rest in an upright position. The pilot and passengers were able to egress the airplane unassisted and the airplane was engulfed in flames a few minutes later. About 23 minutes after the mishap the weather reporting station 24 miles north of the accident site reported, the wind from 230 degrees at 6 knots, the temperature 84 degrees Fahrenheit, and dew point of 60 degrees Fahrenheit. Runway 18 was reported as a 4,002-foot long by 60-foot wide asphalt runway with trees near the departure end. The field elevation at the airport was reported at 544 feet and the density altitude was calculated at 1,860 feet. The estimated weight of the airplane at the time of departure was near its maximum gross weight of 6,000 pounds. The pilot reported that he had not performed a weight and balance check, calculated density altitude, and was not sure of how much fuel was onboard the airplane prior to departure. The pilot further reported that there were no apparent anomalies with the airplane.", "probable_cause": "The pilot's failure to maintain clearance from the barn. Contributing factors were the pilot's inadequate preflight planning/preparation and the high-density altitude."}