{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-rantoul-3-killed", "date": "Jul 24, 2011 at 0920 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Jon Buerkett", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Rantoul – Sarasota", "msn": "46-22071", "yom": 1989, "flight_number": null, "city": "Rantoul", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1850, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2560, "circumstances": "On July 24, 2011, about 0920 central daylight time, a Piper PA-46-350P, N46TW, owned and operated by a private pilot, sustained substantial damage when it impacted powerlines and terrain during takeoff from runway 27 at the Rantoul National Aviation Center Airport-Frank Elliott Field (TIP), near Rantoul, Illinois. A post impact ground fire occurred. The personal flight was operating under 14 Code of Federal Regulations Part 91. Visual meteorological conditions prevailed at the time of the accident. An instrument flight rules (IFR) flight plan was on file. The pilot and two passengers sustained fatal injuries. The flight was originating from TIP at the time of the accident and was destined for Sarasota/Bradenton International Airport (SRQ), near Sarasota, Florida. A witness, who worked at the fixed base operator, stated that the pilot performed the preflight inspection of the airplane in a hangar. An estimated 80 pounds. of luggage was loaded behind the airplane's rear seat. The witness said that the pilot's wife told the pilot that she had to use the restroom. The pilot reportedly replied to her to \"hurry because a storm front was coming.\" The witness said that the engine start was normal and that both passengers were sitting in the rear forward-facing seats when the airplane taxied out. A witness at the airport, who was a commercial pilot, reported that he observed the airplane takeoff from runway 27 and then it started to turn to the south. He indicated that the landing gear was up when the airplane was about 500 feet above the ground. The witness stated that a weather front was arriving at the airport and that the strong winds from the northwest appeared to \"push the tail of the plane up and the nose down.\" The airplane descended and impacted powerlines and terrain where the airplane subsequently caught on fire. The witness indicated that the airplane's engine was producing power until impact.", "probable_cause": "The pilot did not maintain airplane control during takeoff with approaching thunderstorms. Contributing to the accident was the pilot's decision to depart into adverse weather conditions."}