{"url": "https://www.baaa-acro.com/crash/crash-antonov-74tk-100-sao-tome", "date": "Jul 29, 2017 at 0905 LT", "type": "Antonov AN-74", "operator": "Cavok-Air", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "São Tomé – Accra", "msn": "470 95 905", "yom": 1992, "flight_number": "CVK7087", "city": "São Tomé", "zone": "Água Grande", "country": "São Tomé and Principe", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12847, "captain_hours_type": 986, "copilot_hours": 5389, "copilot_hours_type": 618, "aircraft_hours": 5104, "circumstances": "On 29th July, 2017 at about 0905hrs, an Antonov aircraft Model AN-74TK-100, flight CVK7087, registration UR-CKC, owned by SWIFT SOLUTION FZC and operated by CAVOK Airlines LLC was departing Sao Tome International Airport to Kotoka International Airport, Accra, for positioning with six crew on board. The flight was on an Instrument Flight Rule (IFR) flight plan and Visual Meteorological Conditions prevailed. The aircraft exited runway 29 during a rejected take off. The Flight Navigator sustained an injury and the aircraft was destroyed. On 28th July, 2017 at 0225hrs the aircraft arrived Sao Tome International Airport from Stavanger (Norway), via Luxemburg and Ghardaia (Algeria) as a Cargo flight. On 29th July, 2017 at about 0800hrs, the crew of CVK 7087 comprising the Captain, the First Officer, the Flight Engineer, the Flight Navigator and 2 Maintenance Engineers arrived the airport and commenced the flight preparation; pre-flight inspection, determination of weight and balance, computation of performance and take-off speeds. The crew received flight briefing/weather information and refuelled the aircraft with an uplift of 5,700kg. At 0850hrs, the crew requested engine start-up clearance from Sao Tome Tower and it was approved. After completing the engine start procedures, engine parameter indications on both engines were normal. Appropriate checklist was completed and taxi clearance was requested by the crew. Sao Tome Tower initially cleared CVK 7087 to taxi on runway (RWY) 11 as favoured by the prevailing wind. However, the crew requested RWY 29 for departure. This request was approved by the Tower and the aircraft re-cleared to taxi to RWY 29 for departure. Sao Tome Tower did not provide the flight crew with the information about possible presence of birds at the aerodrome, in particular, on the runway. At 0905hrs, the aircraft began the take-off roll. The First Officer was the Pilot Flying (PF) while the Captain was the Pilot Monitoring (PM). The engines and systems parameters were reported to be normal. According to the Captain, \"In the first half of the take-off run from the runway, from five to six eagles got off the ground of the runway and flew dangerously close to the aircraft\". He then requested the Flight Engineer to check if the flood lights were ON and to monitor the engine parameters. The crew asserted that they observed a rising and narrowing runway as the aircarft accelerated to a speed of 180 km/hr. They stated further: \"At a speed of 180 km/hr, ahead, a flock of eagles, which were not seen before this moment began to get off the ground from the runway.\" The Captain took control of the aircraft and decided, after assessing the situation within 4 seconds that the best option for the crew was to discontinue the take-off. At that moment, the crew heard a bang, which they suggested could be a bird strike. This was followed by aural and visual indications on the annunciator panel such as “Left Engine Failure”, “Dangerous Vibration”, and “Take-off is prohibited” and the Captain immediately initiated a rejected take-off and instructed the Flight Engineer to deploy thrust reversers. The rejected takeoff was initiated about 5 seconds after sighting the birds, at a speed of 220km/h. According to the Captain, his decision was necessitated by the consideration of losing multiple engines due to bird strike if the take-off continued. The Captain said he pressed the brake pedals completely immediately after initiating the rejected take-off, subsequently he assessed the braking action as not effective and he used the emergency braking at a speed of about 130 km/h. On realizing that the aircraft would not stop within the remaining available runway length (about 272.3m) coupled with the presence of a ravine at the end, the captain intentionally veered to the right in order to extend the runway stopping distance and also avoid the ravine. The aircraft exited the runway at a speed of approximately 76 km/h. As the aircraft’s speed decayed to 60 km/h and just before the aircraft exited the runway, the Captain instructed the Flight Engineer to close the fuel emergency shutoff cock. The aircraft travelled a distance of about 95m from the exit point before plunging into the ravine. In the process, the forward fuselage separated from the bulkhead located immediately after the cockpit section. The aircraft came to rest at a location with coordinates: N002° 2' 51'' and E006° 42' 07''. The accident occurred in daylight at about 0905hrs.", "probable_cause": "The investigation determines that the cause of this accident as:\r\nDue to the presence of birds on the runway, the take-off was rejected at a speed above decision speed V1, which is inconsistent with CAVOK’s Standard Operating Procedures (SOP).\r\nContributory factors:\r\nThe contributory factors to this accident include but are not limited to the following:\r\n- Failure of the crew to deploy interceptors (speed brakes/spoilers).\r\n- Inadequate flight crew training on details of rejected take-off procedure scenarios.\r\n- The omission of the take-off briefing in CAVOK’s Normal Operations checklist.\r\n- Poor Crew Resource Management (CRM), especially in a multi-crew flight operation."}