{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-228b-rio-de-janeiro", "date": "Dec 2, 1985 at 0634 LT", "type": "Boeing 747-200", "operator": "Air-France-31", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris – Rio de Janeiro – Buenos Aires – Santiago de Chile", "msn": "22427", "yom": 1980, "flight_number": "AF091", "city": "Rio de Janeiro-Galeão", "zone": "Rio de Janeiro", "country": "Brazil", "region": "South America", "crew_on_board": 17, "crew_fatalities": 0, "pax_on_board": 265, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16139, "captain_hours_type": 979, "copilot_hours": 6148, "copilot_hours_type": 513, "aircraft_hours": 22762, "circumstances": "Air France flight 091 was involved in runway excursion accident at Rio de Janeiro-Galeão International Airport, Brazil. The aircraft, a Boeing 747-200, took off from Paris-Charles de Gaulle Airport, France at 21:30 UTC on a flight to Santiago, Chile with en route stops at Rio de Janeiro and Buenos Aires, Argentina. The flight to Rio de Janeiro took about eleven hours and was uneventful. At 08:34 UTC the aircraft touched down on runway 14, 400 meters from the threshold. After reversers were set, the aircraft deviated from the runway heading and at 2,000 meters from the threshold it veered off the right side of the runway. The aircraft ran over the grass for 765 meters, until passing over a drainage ditch and the load apron concrete step, where the landing gears folded aft with the left wing gear completely separating. On the load apron concrete the aircraft spun around for 275 meters until stopping, after the left outboard wing section struck an illumination stand. For a few seconds engines 2, 3 and 4 kept running at maximum reverse thrust, while engine number one run operated at full forward thrust. After the engines were shut down, the passengers evacuated using three of the aircraft's left hand side escape slides. The fire that started on the area near engines number 2 and 3 was extinguished by the airport fire fighters. It appeared that the n°1 engine throttle cable had broken, making it impossible for the flight crew to control engine power. The engine had accelerated to an unusually high level of (forward) thrust (above takeoff power). ", "probable_cause": "The following findings were reported:\r\n(1) Human Factor:\r\nPhysiological Aspect - The crewmembers physical conditions (fatigue) might have contributed to their delay in perceiving the engine failure and to the inadequate reactions during the emergency.\r\n(2) Material Factor:\r\na) The hydraulic pump ripple of the CF6-50E engine caused considerable vibration on the pulley support region, which worked as a dynamic source to produce cable oscillation and relative movement between cable and pulley.\r\nb) Pulley bracket design deficiency, possibly related to the reduced contact area between cable and pulley, allowing for the wearing of these components in the presence of abrasive agents, in association with the vibration on that area, knowing that there is localized contact between both (at the same points) in an almost permanent way (93% of the engine operating time in cruise range).\r\nc) The tests performed by the Manufacturer confirmed the existing relative movement between cable and pulley, even after the introduction of modifications.\r\n(3) Maintenance Deficiency:\r\na) The use of an aluminum pulley, not authorized by the manufacturer as a substitution to the recommended phenolic pulley, made possible the formation of the abrasive agent (alumina).\r\nb) The inadequate fixation of the pulley bracket due to the use, by the operator, of a screw of insufficient length for an additional washer, left loose the support side brace, allowing for the increase of the relative movement. already existing at that region, between cable and pulley.\r\n(4) Flight Manual Deficiency:\r\na) The B747 AFM instructions allow the pilot flying to apply reverse thrust before knowing the effective transit of reversers.\r\nb) The B747 AFM has no instruction regarding a failure of reverser deployment associated with an engine runaway forward thrust. The lack of instructions on this specific kind of abnormality, contributed to the crew not noticing that the failure had occurred.\r\n(5) Training Requirement Deficiency:\r\na) The lack of simulator training requirement for this type of emergency contributed to the control loss.\r\n(6) Crewmember Factor due to Operational Error:\r\na) The captain did not observe the AFM instructions about the reverse levers and manual brake use.\r\nb) The FIE did not observe the AFM instructions about the correct engine instrument monitoring during the reverse operation."}