{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2-ekimchan-1-killed", "date": "Nov 7, 2017 at 0825 LT", "type": "PZL-Mielec AN-2", "operator": "DalTransAero", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ekimchan - Udskoye", "msn": "1G240-07", "yom": 1990, "flight_number": "SHA9001", "city": "Ekimchan", "zone": "Amur oblast", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5253, "captain_hours_type": 2500, "copilot_hours": 13550, "copilot_hours_type": 10000, "aircraft_hours": 2483, "circumstances": "The single engine airplane depart Ekimchan Airport at 0834LT on a cargo flight to Udskoye, carrying two pilots and a load of 1,199 kilos of various goods. Six minutes after takeoff, while climbing to an altitude of 1,600 metres, the crew noticed a strong smell of fuel in the cockpit and decided to return. During the descent, flames came out from the engine that started to rough and eventually stopped on short final. The airplane stalled, impacted a birch tree and crashed in a wooded area located 132 metres short of runway 06, bursting into flames. The copilot was killed and the captain was seriously injured. The aircraft was totally destroyed by a post crash fire. ", "probable_cause": "The crash of An-2 RA-02305 aircraft occurred during the forced landing. The necessity of the forced landing was caused by the engine stopping in flight due to the destruction of the cylinder head No.1 of the ASH62-IR engine No.K16509153. The destruction of cylinder head No. 1 is of fatigue nature and occurred due to exhaustion of fatigue life of the cylinder head material and reaching its limit state. Most likely, during the last repair of the engine the crack in the cylinder head was present, but was not through and was not revealed during the inspection. The most likely contributing factor to stopping the engine in flight was the impoverishment of the fuel-air mixture due to icing of the BAC filter mesh and the presence of a rubber plug on the filter flange of the corrector."}