{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-ruidoso-5-killed", "date": "Aug 5, 2007 at 2141 LT", "type": "Beechcraft 90 King Air", "operator": "Southwest%20Medevac", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Ruidoso - Albuquerque", "msn": "LW-162", "yom": 1976, "flight_number": null, "city": "Ruidoso", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 2775, "captain_hours_type": 23, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10358, "circumstances": "The emergency medical services (EMS) airplane took off toward the east in dark night visual conditions. The purpose of the Part 135 commercial air ambulance flight was to transport a 15-month-old patient from one hospital to another. Immediately following the takeoff from an airport elevation of 6,814 feet above mean sea level (msl), witnesses observed the airplane initiate a left turn to the north and disappear. Satellite tracking detected the airplane a shortly after departure, when the airplane was flying at an altitude of 6,811 feet msl, an airspeed of 115 knots, and a course of 072 degrees. The airplane impacted terrain at an elevation of 6,860 msl feet shortly thereafter, about 4 miles southeast of the departure airport. The pilot, flight nurse, paramedic, patient, and patient's mother were fatally injured. When the airplane failed to arrive at its destination, authorities initiated a search and the wreckage was located the next morning. Documentation and analysis of the accident site by the NTSB revealed that debris path indicated a heading away from the destination airport. Initial impact with trees occurred at an elevation of 6,860 feet. Fragmented wreckage was strewn for 1,100 feet down a 4.5-degree graded hill on a magnetic heading of 141 degrees. The aircraft's descent angle was computed to be 13 degrees, and the angle of impact was computed to be 8.5 degrees. There was evidence of a post-impact flash fire. Both engine and propeller assemblies were recovered and examined; the assemblies bore signatures consistent with engine power in a mid to high power range. The flaps and landing gear were retracted, indicating that the pilot did not attempt to land the airplane at the time of the accident. Flight control continuity was established, and control cable and push rods breaks exhibited signatures consistent with overload failures. There was no evidence of any pre-impact mechanical malfunction found during examination of the available evidence. The pilot had logged 2,775 total flight hours, of which 23 hours were in the accident airplane. Toxicology testing detected chlorpheniramine (an over-the-counter antihistamine that results in impairment at typical doses) and acetaminophen (an over-the-counter pain reliever and fever reducer often known by the trade name Tylenol and frequently combined with chlorpheniramine). No blood was available for tox testing, so it is not possible to accurately estimate the time of last use, nor determine if the level of impairment that these substances would have incurred during the flight. The airplane was not equipped with either a flight data recorder or a cockpit voice recorder, nor were they required by Federal Aviation Regulation (FAR). The impact damage to the aircraft, presence of dark night conditions,  experience level of the pilot, and anomalous flight path are consistent with spatial disorientation.", "probable_cause": "Failure to maintain clearance from terrain due to spatial disorientation."}