{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3a-367-hollywood-3-killed", "date": "Apr 24, 1946 at 0157 LT", "type": "Douglas DC-3", "operator": "Western%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Hollywood - Hollywood", "msn": "3286", "yom": 1941, "flight_number": null, "city": "Hollywood", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2802, "captain_hours_type": 2442, "copilot_hours": 3300, "copilot_hours_type": 1315, "aircraft_hours": 13354, "circumstances": "The crew was conducting a test flight after the left engine has been replaced. Few minutes after takeoff, a failure occurred on the 8th cylinder in the left engine and the crew shut off this engine and returned to Hollywood-Lockheed Air Terminal Airport. Due to low visibility caused by foggy conditions, the crew was unable to locate the runway and decided to go around. During the second attempt to land, the captain decided to reduce his altitude to establish a visual contact with the ground when the aircraft hit an eucalyptus and crashed near Lorne Street, North Hollywood. The aircraft was destroyed by impact forces and a post crash fire and all three crew members were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the action of the pilot in descending to an excessively low altitude in an attempt to remain contact after encountering ground fog during an approach for an emergency landing. A contributing factor was failure of the left engine due to excessive oil accumulation in the No. 8 cylinder prior to starting the engine. A further contributing factor was the failure of maintenance personnel to take proper precaution for drainage of oil accumulation prior to starting the engine."}