{"url": "https://www.baaa-acro.com/crash/crash-vickers-952-vanguard-hochwald-108-killed", "date": "Apr 10, 1973 at 1013 LT", "type": "Vickers Vanguard", "operator": "Invicta%20International", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Bristol - Basel", "msn": "745", "yom": 1962, "flight_number": "IM435", "city": "Hochwald", "zone": "Solothurn", "country": "Switzerland", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 4, "pax_on_board": 139, "pax_fatalities": 104, "other_fatalities": 0, "total_fatalities": 108, "captain_hours": 1205, "captain_hours_type": 1088, "copilot_hours": 3144, "copilot_hours_type": 1256, "aircraft_hours": 16367, "circumstances": "The Invicta International Airlines Vickers Vanguard was operating on a charter flight from Bristol (BRS) to Basel-Mulhouse (BSL). After entering the Basel Mulhouse terminal area, the flight was cleared to continue to the BN NDB. Weather was poor at that time: cloud base at 120 m (390 feet) and a reported runway visual range of 700 (2,300 feet) and 1,300 m (4,250 feet). On arrival at the BN beacon the crew were cleared to descend to 2,500 feet and were asked to report over the MN beacon before making a 90° left hand turn to finals for runway 16. At 09:56 the crew reported at 2,500 feet, followed by a position report of the MN beacon at 09:57:40. When on finals over the BN beacon, the crew reported turning outbound and said they would report at the MN beacon again for another approach. When the crew reported overhead the BN beacon again, the plane was in fact overhead the airfield, flying parallel to the ILS localizer beam. After 1,5 minute the aircraft began to overshoot, correctly making an initial turn to the west. The crew, now flying well south of the field, were instructed to report back over the MN beacon. When reporting over the MN beacon again, before it would have to turn left for finals, the plane was in fact overhead the BS beacon, a beacon located to the south of runway 16. At 10:11:25 the crew reported over the BN beacon on finals and was cleared to land. In fact the plane was now flying 3 miles South of the field and 1 mile west of the extended centerline. Two miles further on Basle ATC asked the crew \"Are you sure you are over the BN?\". The captain replied \"I think I've got a spurious indication. We are on the LO... on the ILS now, sir\". Half a minute later the captain radioed \"BN is established on localizer and glide path; the ADF's all over the place in this weather.\" Last radio contact was when the captain reported at 1,400 feet, to which ATC replied that the flight was probably to the south of the airport. At 10:13 the plane brushed against a wooded range of hills and crashed 15 km southeast from the airport. The aircraft disintegrated, except for the tail section, were most of the survivors were found. Two stewardess and 35 passengers survived while 108 other occupants were killed. ", "probable_cause": "A loss of orientation during two ILS approaches carried out under instrument flight conditions. The following factors contributed to the occurrence of the accident:\r\n- Inadequate navigation, above all imprecise initiation of final approach as regards height and approach centerline,\r\n- Confusion of aids,\r\n- Insufficient checking and comparison of navigational aids and instrument readings (cross and double checks).\r\nThe poor reception of ht medium wave beacons and technical defects in LOC receiver No.1 and glide slope receiver no.2 made the crew’s navigational work more difficult."}