{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-1-dk-tiruchirapalli", "date": "Dec 21, 1949 at 1330 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Air%20Ceylon", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jaffna – Tiruchirapalli", "msn": "11927", "yom": 1943, "flight_number": null, "city": "Tiruchirappalli", "zone": "Tamil Nadu", "country": "India", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 21, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Somewhere between KKS and Trichy, the hitherto even tenor of Sunetra Devi's flight seemingly began to go amiss. According to press reports following the crash, a passenger claimed that one of the engines \"gave trouble soon after the plane took off from Jaffna\". This seemed to corroborate Capt. Kotelawala's subsequent statement that \"the engine stalled just before the plane was to land\". Whatever the cause, as Sunetra Devi commenced its descent into Trichy around 1.30 p.m., it was obvious that all was not right with the DC-3. Another passenger, Dr. G. Wignarajah, a regular traveller on that route, noticed that the plane was being flown erratically. He watched in consternation as the aircraft narrowly escaped collision with Trichy Rock, a landmark some 7 miles from the airport. At Trichy airfield itself, some observers said the DC-3 appeared to come in too fast. Others noted that the left wing was tilted downwards, and not in a level altitude. But all eyewitnesses agreed that the plane touched down heavily, then bounced before crashing nose first onto the grass surrounding the runway. The left landing gear also slammed into the ground with a fearsome thud, the wheel collapsing under the force of impact. Missing one of its two main wheels, the lopsided Dakota careered along the grass until the drooping left wing dug in and spun the plane around in a sharp left-hand turn through 180 degrees. Meanwhile, the left propeller had broken away. Now, as the crippled aircraft swung around, the right wheel and engine too were wrenched off and flung some distance from the fuselage. Finally, after what seemed an eternity, a battered and broken Sunetra Devi slowed to a halt. A small fire broke out but was quickly extinguished by the airport fire brigade. The second heavy impact had inflicted horrendous damage on the nose section and cockpit area. Rescuers rushing up to the wreck expected the worst. But, mercifully, the crew were alive. Dixon Kotelawala had superficial injuries to his head, chin and ribs, although Simon Rasiah, the co-pilot, was not so lucky. He had suffered a fractured skull and broken a forearm. Back in the passenger cabin, stewardess Ranee Ranawake sustained a broken collarbone when she unwisely unbuckled her seatbelt after the first bounce to look out at what was happening, and was thrown on her side. Also injured was passenger C.V. Ramaswamy Reddiar, who fractured his nasal bone.\r\nSource: Roger Thiedeman", "probable_cause": null}