{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-ii-clayton-station-1-killed", "date": "Aug 30, 1972 at 1750 LT", "type": "Fletcher FU-24", "operator": "Mount%20Cook%20Air%20Services", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": null, "msn": "98", "yom": 1963, "flight_number": null, "city": "Clayton Station", "zone": "Canterbury Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Late in the afternoon of 30/8/72 two aircraft were conducting an aerial topdressing operation at Clayton Station. One of the pilots observed the other aircraft operating normally. When he looked again moments later he saw smoke and flames on the side of a ridge in the working area. Realizing that there had been an accident he immediately flew back to the airstrip and raised the alarm. ZK-CFQ had struck the ground with its port wingtip while making a 180 degree RH turn within the confines of a valley. Physical evidence showed that the plane was banked at an angle of 68 degrees when the wingtip touched the slope. The aircraft was destroyed by impact forces and fuel from a ruptured tank ignited completing the destruction. Evidence also showed that the engine was producing high power at the moment of impact. The all-up weight and C of G were found to be well within the permitted limits. The other pilot reported seeing an interruption in the flow of fertilizer in the final sowing run, but there was no sign of a blockage in the hopper outlet. The hopper was empty. The weather was perfect for aerial topdressing, CAVU and still air. An autopsy revealed that the 34-year-old pilot had received no fatal injuries in the impact, but there was evidence of coronary occlusion due to arteriosclerosis heart disease. It was concluded that the pilot had died from a heart attack and traumatic hypoxia. It was not clear if the heart attack occurred before or at the time of impact. It would appear however, from the steep angle of bank so close to the ground, that pilot had become incapacitated and had lost control of his aircraft. \r\nSource: ASN", "probable_cause": "Loss of control at low height for undetermined reason. "}