{"url": "https://www.baaa-acro.com/crash/crash-raytheon-390-premier-i-annemasse-2-killed", "date": "Mar 4, 2013 at 0839 LT", "type": "Raytheon 390 Premier I", "operator": "Global-Jet-Luxembourg", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Annemasse - Geneva", "msn": "RB-202", "yom": 2007, "flight_number": null, "city": "Annemasse", "zone": "Haute-Savoie", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7050, "captain_hours_type": 1386, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1388, "circumstances": "On Monday 4 March 2013, the pilot and two passengers arrived at Annemasse aerodrome (France) at about 7 h 00. They planned to make a private flight of about five minutes to Geneva airport on board the Beechcraft Premier 1A, registered VP-CAZ. The temperature was -2°C and the humidity was 98% with low clouds. The aeroplane had been parked on the parking area of the aerodrome since the previous evening. At 7 h 28, the Geneva ATC service gave the departure clearance for an initial climb towards 6,000 ft with QNH 1018 hPa towards the Chambéry VOR (CBY). At about 7 h 30, when the CVR recording of the accident flight started, the engines had already been started up. At about 7 h 34, the pilot called out the following speeds that would be used during the takeoff roll:\r\n- V1 : 101 kt\r\n- VR : 107 kt\r\n- V2 : 120 kt.\r\nAt about 7 h 35, the pilot performed the pre-taxiing check-list. During these checks, he called out “anti-ice ON”, correct operation of the flight controls, and the position of the flaps on 10°.\r\nTaxiing towards runway 12 began at 7 h 36. At 7 h 37 min 43, the pilot called out the end of the takeoff briefing, then activation of the engine anti-icing system. At 7 h 38 min 03, the pilot called out the start of the takeoff roll. Fifteen seconds later, the engines reached takeoff thrust. The aeroplane lifted off at 7 h 38 min 37. Several witnesses stated that it adopted a high pitch-up attitude, with a low rate of climb. At 7 h 38 min 40, the first GPWS “Bank angle - Bank angle” warning was recorded on the CVR. It indicated excessive bank. A second and a half later, the pilot showed his surprise by an interjection. It was followed by the aural stall warning that lasted more than a second and a further GPWS “Bank angle - Bank angle” warning. At about 7 h 38 min 44, the aeroplane was detected by the Dole and Geneva radars at a height of about 80 ft above the ground. Other “Bank Angle” warnings and stall warnings were recorded on the CVR on several occasions. Several witnesses saw the aeroplane bank sharply to the right, then to the left. At 7 h 38 min 49 the aeroplane was detected by the radars at a height of about 150 ft above the ground. At 07 h 38 min 52, the main landing gear struck the roof of a first house. The aeroplane then collided with the ground. During the impact sequence, the three landing gears and the left wing separated from the rest of the aeroplane. The aeroplane slid along the ground for a distance of about 100 m before colliding with a garden shed, a wall and some trees in the garden of a second house. The aeroplane caught fire and came to a stop. The pilot and the passenger seated to his right were killed. The female passenger seated at the rear was seriously injured. According to the NTSB and BEA, the airplane was owned by Chakibel Associates Limited n Tortola and operated by Global Jet Luxembourg.", "probable_cause": "The pilot’s insufficient appreciation of the risks associated with ground-ice led him to take off with contamination of the critical airframe surfaces. This contaminant deposit then caused the aerodynamic stall of the aeroplane and the loss of control shortly after lift-off."}