{"url": "https://www.baaa-acro.com/crash/crash-cessna-421a-golden-eagle-i-reno", "date": "Nov 1, 1994 at 1306 LT", "type": "Cessna 421A Golden Eagle I", "operator": "Keys Family LLC", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Portland – Reno – Palm Springs", "msn": "421A-0099", "yom": 1968, "flight_number": null, "city": "Reno-Tahoe (ex Cannon)", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7000, "captain_hours_type": 65, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was completing the first leg of an IFR flight in a multi-engine airplane. As the airplane was established on final approach, about 5 miles from the airport, the pilot encountered visual meteorological conditions and canceled his IFR flight plan. Moments later, the right engine began to sputter and then lost power. The pilot said that he switched the fuel selector valves to various positions and positioned the fuel boost pump to high-flow; however, during this time, the left engine also lost power. The pilot attempted to start both engines, but without success. During a forced landing, the airplane struck a pole, then crashed into a condominium. A fire erupted, but all 4 occupants survived the accident. Two occupants in the condominium received minor injuries. The pilot believed that he had moved the fuel selector valves to the auxiliary position for about 1 hour during flight; however, the passengers did not see him move the fuel selectors until after the engine(s) lost power. The right fuel selector handle was found between the right main tank and off positions. The left fuel selector was destroyed by post-impact fire.", "probable_cause": "The pilot's improper use of the fuel selector and subsequent fuel starvation."}