{"url": "https://www.baaa-acro.com/crash/crash-cessna-414a-chancellor-destin-1-killed", "date": "Aug 2, 2016 at 2030 LT", "type": "Cessna 414 Chancellor", "operator": "Cessna 414 LLC", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Destin – Abbeville", "msn": "414A-0463", "yom": 1980, "flight_number": null, "city": "Destin-Executive", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 15000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6202, "circumstances": "The instrument-rated commercial pilot departed from an airport adjacent to the Gulf of Mexico with an instrument flight rules clearance for a cross-country flight in dark night, visual\r\nmeteorological conditions. The flight continued in a south-southwesterly direction, climbing to about 900 ft over the gulf, where it entered a steep right turn. The airplane then descended at a steep rate and impacted the water in a nose-low attitude. Post accident examination of the recovered wreckage, including flight controls, engines, and propellers revealed no evidence of preimpact failure or malfunction. While the outlet fuel line from the left auxiliary fuel pump was found separated and there was evidence that the B-nut was loose and had been only secured by the first 2 threads, recorded data from the engine monitor for the flight revealed no loss of power from either engine. Therefore, the final separation likely occurred during the impact sequence. Although the accident pilot was instrument rated and had recently completed instrument currency training, the dark night conditions present at the time of the accident combined with a further lack of visual references due to the airplane's location over a large body of water, presented a situation conducive to the development of spatial disorientation. The pilot had been instructed by air traffic control to turn southwest after takeoff; however, the continuation of the turn past the intended course and the airplane's steep bank angle and excessive rate of descent are consistent with a loss of control due to spatial disorientation. ", "probable_cause": "The pilot's loss of control due to spatial disorientation shortly after takeoff, while maneuvering over water during dark night conditions."}