{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-g18s-metlakatla", "date": "Mar 3, 2017 at 0815 LT", "type": "Beechcraft G18S", "operator": "Point to Point", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Klawock – Ketchikan", "msn": "BA-526", "yom": 1960, "flight_number": null, "city": "Metlakatla", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10308, "captain_hours_type": 330, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17646, "circumstances": "The pilot of the twin-engine airplane and the pilot-rated passenger reported that, during a missed approach in instrument meteorological conditions, at 2,000 ft mean sea level, the right engine seized. The pilot attempted to feather the right engine by pulling the propeller control to the feather position; however, the engine did not feather. The airplane would not maintain level flight, so the pilot navigated to a known airport, and the passenger made emergency communications with air traffic control. The pilot was unable to maintain visual reference with the ground until the airplane descended through about 100 to 200 ft and the visibility was 1 statute mile. The pilot stated that he was forced to ditch the airplane in the water about 5 miles short of the airport. The pilot and passenger egressed the airplane and swam ashore before it sank in about 89 ft of water. Both the pilot and passenger reported that there was postimpact fire on the surface of the water. The airplane was not recovered, which precluded a postaccident examination. Thus, the reason for the loss of engine power could not be determined.", "probable_cause": "An engine power loss for reasons that could not be determined because the airplane was not recovered."}