{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690a-cortez-1-killed", "date": "Jan 3, 2004 at 1212 LT", "type": "Rockwell Grand Commander 690", "operator": "Air%20West", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Mesa – Cortez", "msn": "690-11164", "yom": 1974, "flight_number": null, "city": "Cortez", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1872, "captain_hours_type": 91, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7506, "circumstances": "The pilot executed the VOR approach to runway 21. He was heard to report passing the VORTAC outbound for the procedure turn, and crossing the VORTAC (final approach fix) inbound. Witnesses said they saw the airplane emerge from the overcast slightly high and fast. They said the airplane entered a steep left bank and turned about 90 degrees before disappearing in a snow shower northeast of the airport. They heard no unusual engine noises. Another witness near the accident site saw the airplane in a steep bank and at low altitude, \"just above the power lines.\" Based on the witness location, the airplane had turned about 270 degrees. The witness said the wings \"wobbled\" and the nose \"dipped,\" then the left wing dropped and the airplane descended to the ground \"almost vertically.\" Members of the County Sheriff's Posse, who were at a gunnery range just north of the airport, reported hearing an airplane pass over at low altitude. One posse member said he heard \"an engine pitch change.\" He did not see the airplane because it was \"snowing heavily,\" nor did he hear the impact. An examination of the airplane revealed no anomalies. At the time of the accident, the weather at the destination airport was few clouds 300 feet, 900 feet broken, 3,200 feet overcast; visibility, 1/2 statute and snow; temperature, 32 degrees F.; dew point, 32 degrees F.; wind, 290 degrees at 10 knots, gusting to 15 knots; altimeter, 29.71 inches. ", "probable_cause": "The pilot's inadequate planned approach and his failure to maintain airspeed which resulted in a stall. Contributing factors were low altitude flight maneuvering in an attempt to lose excessive altitude and realign the airplane for landing, and his failure to perform a missed approach, and the snow fall."}