{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-680e-lakeland-1-killed", "date": "Sep 9, 1996 at 2010 LT", "type": "Rockwell Grand Commander 680", "operator": "Robert D. Simpson", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Lakeland - Winter Haven", "msn": "680-745-38", "yom": 1959, "flight_number": null, "city": "Lakeland", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6893, "captain_hours_type": 22, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5284, "circumstances": "After takeoff, the pilot transmitted to ATC controllers that he had lost power in an engine. He made a steep turn to the left back toward the airport, then a right turn toward the runway. The aircraft's nose dropped in the right turn, and the aircraft crashed nose first on a taxiway. Post crash examination of the aircraft structure and flight control systems revealed no preimpact failure or malfunction. The left propeller was found in the feathered position, and the right propeller was found in a high blade angle. The right propeller had damage consistent with the engine operating. Teardown examination of the engines and propellers showed no findings that would have resulted in engine or propeller malfunction or failure. At the time the aircraft was purchased by the pilot in March 1996, he had not flown for about 10 years. Since purchasing the aircraft, he had logged 2.5 hours of transition/checkout in the airplane and had flown it for a total of about 22 hours, mostly on 'sightseeing flights.' ", "probable_cause": "Failure of the pilot to maintain minimum control speed, while returning to the airport for a precautionary landing, following a reported loss of power in one engine, which resulted in a loss of aircraft control and an uncontrolled collision with the terrain. Factors relating to the accident were: loss of power in the left engine for undetermined reason(s), and the pilot's apparent lack of familiarity with single engine operation in the make and model of aircraft. "}