{"url": "https://www.baaa-acro.com/crash/crash-fairchild-f27b-gambell-10-killed", "date": "Aug 30, 1975 at 1357 LT", "type": "Fairchild F27", "operator": "Wien%20Air%20Alaska", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nome – Savoonga – Gambell", "msn": "21", "yom": 1958, "flight_number": "WC099", "city": "Gambell", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 28, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 6607, "captain_hours_type": 4626, "copilot_hours": 2738, "copilot_hours_type": 470, "aircraft_hours": 26068, "circumstances": "Wien Air Alaska Flight 99, a Fairchild F27B , was a regularly scheduled passenger and cargo flight from Nome, Alaska, to Savoonga and Gambell, two villages on St. Lawrence Island, Alaska. The captain's IFR flight plan, as filed with the Nome Flight Service Station (FSS), indicated a route of flight from Nome to Savoonga, via Island Intersection, then to Gambell, with a return to Nome via Island Intersection. The requested altitude was 12,000 feet and the listed alternate airports were Galena and Nome. At 1216, Flight 99 departed Nome and landed at Savoonga at 1306. The aircraft departed Savoonga at 1327 with an estimated time en route of 15 minutes to Gambell. There were 32 persons on board, 28 passengers and 4 crewmembers. When the Wien agent at Gambell heard Flight 99's radio transmissions after takeoff from Savoonga, she activated the Gambell Non Directional Beacon (NDB) . According to the cockpit voice recorder (CVR) transcript, the crew identified the Gambell NDB shortly after departing Savoonga and contacted the Wien agent at Gambell. The crew gave their estimated time of arrival and requested the weather. The agent replied, \"Our current weather is partial obscured sky. Visibility 1 to 1/2 miles ... 1 mile to 1/2 mile with ... and fog, Temperature is 47°, wind is calm, altimeter 29.70.\" Soon thereafter, Flight 99 questioned the visibility; the agent replied that it was, \"sometimes about 5 miles, it's very hard to tell...\" When the flight arrived in the Gambell area, the captain, who was flying the aircraft, remarked to the first officer that fog appeared to be a problem. He also stated, \"We'll take a shot from this way and if we can't make it, we'll come around and hit it from that side. If we can't make it from there, we'll turn out and (come in underneath it).\" The pilot then made several attempts to land. According to some surviving passengers, the aircraft descended to a low altitude over the tundra to the south of the airport during one of the approaches. During another of the approaches, ground witnesses saw the aircraft make a low pass down the runway and then a right turn out to sea before it disappeared into the fog. Some of the survivors, including the flight attendant, believed that the aircraft touched down on this approach. The CVR indicates that the crew had the runway in sight but decided to execute a missed approach because they were too far down the runway to land safely. Flight data recorder (FDR) information shows that the aircraft descended to within a few feet of the surface. According to correlated CVR/FDR information, the aircraft then turned right, flew north, and make a relatively steep turn to the right. During this turn, the first officer said that a 155° heading inbound would be perfect. Cockpit conversations during the rollout indicated that the flight passed the NDB while on a heading of 140°. The captain then called for final flaps and landing gear. When last observed by ground witnesses, the aircraft was heading southeast. It flew over a beach and near boat racks located about 240 yards northeast of the NDB. It continued its course and passed over the eastern end of some newly constructed houses just north of Troutman Lake, which is located between the runway and Sevuokuk Mountain. Ground witnesses stated that the landing gear was lowered before they saw the aircraft disappear into the fog. Ground witnesses and survivors of the crash generally agreed that there was a considerable amount of patchy fog in the area and that visibility ranged from 1/4 to 1 1/2 miles. A heading of 140° was maintained for about 28 seconds until the aircraft struck Sevuokuk Mountain at an altitude of 424 feet. Several of the passengers could see the ground and were aware of their position relative to the village of Gambell. Some of them realized that the aircraft was going to hit the mountain and braced themselves. Shortly after the aircraft entered the fog and just before impact, some witnesses and survivors heard an increase in engine sound. The aircraft was destroyed upon impact and three crew members and seven passengers were killed. All other occupants were injured. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was the flight crew's failure to adhere to prescribed company instrument approach procedures while attempting to land in adverse weather conditions. The following findings were reported:\r\n- Weather in the area of the flight was below authorized minimums for an approach,\r\n- The crew did not comply with approved instrument approach procedures during several attempts to land in instrument flight conditions, \r\n- The runway rotating light beacon was no operating. "}