{"url": "https://www.baaa-acro.com/crash/crash-dornier-do28a-1-vernier-2-killed", "date": "Jan 11, 1975 at 0905 LT", "type": "Dornier DO.28A/B", "operator": "Real Aero Club de Barcelona", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Geneva - Sion", "msn": "3030", "yom": 1962, "flight_number": null, "city": "Vernier", "zone": "Geneva", "country": "Switzerland", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3381, "captain_hours_type": 1, "copilot_hours": 2990, "copilot_hours_type": 1400, "aircraft_hours": 2530, "circumstances": "The twin engine airplane departed runway 23 at Geneva-Cointrin Airport at 0903LT. During initial climb in limited visibility due to foggy conditions, the crew encountered technical problems with instruments and the airplane completed several turns at a height between 10 and 40 meters. The crew spotted a building of nine floors and elected to make an evasive manoeuvre when the airplane stalled and crashed on a railway track located in Vernier, about three km from the airport. The accident occurred about two minutes after takeoff. At the time of the accident, the horizontal visibility was 500 meters, the vertical visibility 65 meters with a runway visual range of 750 meters for runway 23. ", "probable_cause": "Investigations determined that after departure, the pilots were confronted with various technical issues on several instruments. Indeed, the crew had started the flight under instrument flight rules but was forced to continue under VFR mode, which was impossible due to the lack of visibility caused by the presence of fog. The aircraft maintenance did not comply with the published requirements due to corrosion detected on the bearings of the electrical turn indicator that led to the assumption that this instrument was not working at takeoff, and probably for a long time. In addition, the artificial horizon was blocked at the time of impact and investigators believe that this instrument was partially deficient at the time of departure. The pilot-in-command accumulated 3,381 flight hours in total but had only 45 minutes of experience on this type of aircraft. The copilot had a total of 2,990 flying hours including 1,400 on type. Given the presence of fog, the pilot's lack of experience and the malfunctioning of two vital instruments, the crew should not have started the flight, especially since neither pilot had a valid license under IFR mode."}