{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-328c-mt-la-soufriere-63-killed", "date": "Mar 5, 1968 at 2032 LT", "type": "Boeing 707", "operator": "Air-France-31", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Santiago de Chile – Caracas – Pointe-à-Pitre – Lisbon – Paris", "msn": "19724", "yom": 1968, "flight_number": "AF212", "city": "Mt La Soufrière", "zone": "Guadeloupe", "country": "Guadeloupe", "region": "Central America", "crew_on_board": 11, "crew_fatalities": 11, "pax_on_board": 52, "pax_fatalities": 52, "other_fatalities": 0, "total_fatalities": 63, "captain_hours": 18215, "captain_hours_type": 4415, "copilot_hours": 4737, "copilot_hours_type": 1842, "aircraft_hours": 46, "circumstances": "Air France Flight 212 was a scheduled service from Santiago (Chile) to Paris (France) with en route stops at Quito (Ecuador), Caracas (Venezuela), Pointe-à-Pitre (Guadeloupe) and Lisbon (Portugal). The flight was operated by a brand new Boeing 707, named \"Château de Lavoûte-Polignac\", which had just been delivered to Air France a month and a half before the accident. The aircraft took off from Caracas at 19:27 for an estimated one hour and eight-minute flight to Pointe-à-Pitre on the French Caribbean island of Guadeloupe. The aircraft climbed to a cruising altitude of FL330 and the flight crew contacted the Piarco FIR controller at approximately 19:53 hours. They reported flying at FL330 and estimating over Piarco at 20:00, over the OA reporting point at 20:09 and reaching Pointe-à-Pitre at 20:32. At approximately 20:09 the flight reported over OA and requested authorization to descend in five minutes time. Piarco cleared the flight to the Guadeloupe radio beacon at FL90 and asked it to report when leaving FL330 and when reaching FL150. At 20:14, three minutes sooner than planned, the crew reported leaving FL330. Seven minutes later they reported passing FL150. It was then cleared to contact the Guadeloupe ACC and was advised that an aircraft proceeding from Martinique to Guadeloupe was flying at FL80 and estimating Guadeloupe at 20:44 hours. About 20:24 the flight reached the cleared altitude of FL90. After several unsuccessful attempts the flight established radio contact with Pointe-à-Pitre Tower at 20:29. It was again cleared to FL90, given a QNH of 1016 mb and requested to report at FL90, or runway in sight. Following a different route than normal, the airplane passed a brightly lit town (Basse Terre) on the coast of Guadeloupe. The pilot-in-command probably erroneously believed that it was Pointe-à-Pitre and that he would reach Le Raizet Airport in approximately one minute.  At 20:29:35 the crew replied that the aircraft was at FL90 and they estimated they would be over the airport in approximately 1-1,5 minute. Less than one minute later they reported seeing the airport and were cleared for a visual approach to runway 11.  The aircraft then descended over mountainous terrain and passed Saint Claude at an altitude of approximately 4,400 ft. Flight 212 was observed to impact on the southern slope of La Découverte, the peak of the La Soufrière Volcano, at an elevation of 1,200 m (3,937 ft).", "probable_cause": "The accident resulted from a visual approach procedure at night in which the descent as begun from a point which was incorrectly identified. For lack of sufficient evidence (flight recorder was not recovered, condition and location of wreckage), the Commission was not able to establish the sequence of events which led to this crew error."}