{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-coffs-harbour-3-killed", "date": "Apr 7, 1988 at 2113 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Oxley%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Brisbane – Coolangatta – Coffs Harbour – Port Macquarie", "msn": "31-7552013", "yom": 1975, "flight_number": null, "city": "Coffs Harbour", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was operating a scheduled service from Brisbane to Port Macquarie with planned intermediate stops at Coolangatta and Coffs Harbour. Weather conditions over the route were influenced by a widespread unstable airmass. The terminal forecast for Coffs Harbour indicated a surface wind of 360/15, visibility in excess of 10 km, 5 octas stratus at 1000 ft, 5 octas cumulus at 2000 ft. Thunderstorms, associated with visibility reduced to 2000 metres were also forecast for periods of up to 30 minutes. The actual weather conditions at Coffs Harbour were generally consistent with the terminal forecast. Runway 03 was in use throughout the evening. Coffs Harbour airport was equipped with NDB, VOR and domestic DME radio navigation aids. A VOR/DME procedure was published for runway 03 approaches. For aircraft not equipped with DME, a VOR or NDB approach was available using common tracking and minimum altitude criteria. Runway 03 was also equipped with a 6 stage T-VASIS and 3 stage runway lighting. All facilities were reported as functioning normally, with the exception of the VOR which was experiencing intermittent power failures due to the effects of heavy rain. The VOR was able to be reset manually from the Coffs Harbour control tower. Although the tower was scheduled to be unmanned before the arrival of VH-HOX, the duty air traffic controller elected to man the tower until the aircraft had landed. The controller also called out a technician to attend to the VOR. The aircraft was equipped with dual ILS/VOR and ADF receivers, plus International DME. Domestic DME equipment was not fitted to the aircraft, although required by ANO 20.8. After descending in the VOR/NDB holding pattern, the aircraft was cleared for an instrument approach. The pilot had been told of the intermittent operation of the VOR and had said he would revert to the NDB. At that time the weather conditions were fluctuating about the circling minima of 950 feet (QNH) and five km visibility. The controller advised the aircraft of a heavy shower to the south of the field. The aircraft subsequently completed the approach and the pilot reported \"visual\". The controller said he saw the lights of the aircraft in a position consistent with a right downwind leg for a landing on runway 03. The aircraft was then cleared to land. Shortly after, the controller saw the lights of the aircraft disappear briefly, consistent with the aircraft passing through a localised area of rain/cloud. The lights then reappeared briefly, as though the aircraft was turning onto finals, before disappearing. This was immediately followed by short series of \"clicks\" on the tower frequency. The aircraft was called immediately but failed to respond to any calls. The accident site was located about 1070 metres short of the landing threshold, and about 750 metres to the right of the extended runway centreline. The aircraft was found to have initially struck a nine metre high tree in a nose low attitude, steeply banked to the right, on a track of 050 degrees. After striking the tree with the outboard section of the right wing, the aircraft struck other trees before hitting the ground and overturning. A fire broke out shortly after the aircraft came to rest. As a result of his remaining on duty, the controller was able to provide immediate notification of the accident to the emergency services. This action facilitated the rescue of survivors.", "probable_cause": "A subsequent examination of the aircraft structure, systems and components, found no evidence of any pre-existing defect or malfunction which could have contributed to the accident. The pilot was properly licenced and qualified to conduct the flight. Evidence was provided to show that the pilot had probably flown a total of 930 hours in the previous 365 days, thereby exceeding the ANO 48 limitation of 900 hours. Other breaches of Flight and Duty Limitations were found to have occurred during the previous 12 months, however, during the three months prior to the accident no significant breaches of ANO 48 were found which could have contributed to the accident. Specialist medical advice considered the 30 hour exceedence of the 900 hour limitation was not significant in this accident. Other specialist advice was obtained concerning the possibility of the aircraft being affected by low level windshear or a microburst during the final stage of the night circling approach. It was considered this was not a factor in the accident. Considerable evidence was presented during a subsequent Coroners' Inquest concerning allegations of irregular operating practices by the operator over a period of several years prior to the accident. Much of this evidence was only provided after the granting to witnesses of immunity from prosecution. Despite this, no new evidence was presented which related to the accident flight. The investigation concluded that, on the evidence available, the aircraft was turning onto a short right base leg when it entered  a localised area of rain and low cloud. The pilot was required to look out of the right cockpit window to enable him to maintain visual reference with the approach end of the runway. It is considered probable that the pilot briefly diverted his attention from the flight instruments while attempting to maintain that visual reference as the aircraft passed through an area of reduced visibility. During that period the aircraft continued to roll to the right, resulting in an inadvertent loss of height. The pilot was unable to effect a recovery before the aircraft struck trees.\r\nThe following factors were considered relevant to the development of the accident: \r\n1. Low cloudbase, with localised rain squalls and reduced visibility.\r\n2. Low level, right hand, night circling approach.\r\n3. Pilot lost visual reference at a critical stage of the approach.\r\n4. Pilot did not initiate missed approach.\r\n5. Pilot probably diverted attention from the flight instruments. "}