{"url": "https://www.baaa-acro.com/crash/crash-bae-146-300-khark", "date": "Jun 19, 2016 at 1335 LT", "type": "BAe 146", "operator": "Mahan-Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ahwaz – Khark", "msn": "E3149", "yom": 1989, "flight_number": "IRM4525", "city": "Khark", "zone": "Bushehr", "country": "Iran", "region": "Asia", "crew_on_board": 10, "crew_fatalities": 0, "pax_on_board": 79, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5494, "captain_hours_type": 1270, "copilot_hours": 300, "copilot_hours_type": 110, "aircraft_hours": null, "circumstances": "On June 19, 2016, Mahan Air flight IRM 4525 was a scheduled passenger flight which took off from Ahwaz Airport at 1257 LMT (0827 UTC) to destination and landed at Khark Island Airport at 1335 LMT (0905 UTC).  After delivery of the flight from BUZ approach to Khark tower, the flight was cleared to land on RWY 31 via visual approach. At 10 NM on final the pilot has asked weather information of the destination so, the captain requested to perform a visual approach for RWY 13. Finally the pilot in command accomplished an un-stabilized approach and landed on the runway after passing long distance of the Runway. Regarding to the length of the runway (7,657 feet) the aircraft overran the end of runway and made runway excursion on runway 13 and came to rest on the unpaved surface after 54 meters past the runway end. The nose landing gear strut has broken and collapsed. The captain instructed the cabin crew to evacuate the aircraft. No unusual occurrences were noticed during departure, en-route and descent.", "probable_cause": "The main cause of this accident is wrong behavior of the pilot which descripted as:\r\n- Decision to make a landing on short field RWY 13 with tailwind.\r\n- Un stabilized landing against on normal flight profile\r\n- Weak, obviously, CRM in cockpit.\r\n- Poor judgment and not accomplishing a go around while performing a unstabilized approach.\r\n- Improper calculating of landing speed without focusing on the tailwind component\r\nContributing factors:\r\n- Anti-skid failures of RH landing gear causing prolong landing distance.\r\n- Instantaneous variable wind condition on aerodrome traffic pattern.\r\n- Late activating of airbrakes and spoilers (especially airbrakes) with tailwind cause to increase the landing roll distance.\n"}