{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-90-dl-pittsburgh-10-killed", "date": "Dec 22, 1954 at 2300 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Johnson-Flying-Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Newark – Pittsburgh – Colorado Springs – Monterey – Seattle", "msn": "20197", "yom": 1944, "flight_number": "JFS4844C", "city": "Pittsburgh-Allegheny County", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 1, "pax_on_board": 23, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 7600, "captain_hours_type": 1500, "copilot_hours": 2450, "copilot_hours_type": 800, "aircraft_hours": 5738, "circumstances": "Johnson Flying Service's Plight 4844-C, December 22, 1954, was a CAM (civil air movement of military personnel) flight from Newark, New Jersey, to Tacoma, Washington, with planned intermediate stops among which were Pittsburgh, Pennsylvania; Colorado Springs, Colorado; Monterey, California; and Tacoma, Washington. The crew consisted of Captain Harold A. Poe., Captain Joseph J. Grekowicz, and Copilots Clarence E. Chapman and Charles R. Carter, Captain Robert P. Walker, the fifth crew member, was employed by the company as cabin attendant prior to the departure from Newark. The aircraft was serviced with 170 gallons of 100 octane fuel which was placed in the two main tanks in equal amounts, making a total of 225 gallons according to the weight and balance manifest. A preflight inspection of the aircraft was performed by Captain Grekowicz with no discrepancies found. According to the company's Weight and Balance Manifest the aircraft at the time of departure weighed 25,317 pounds, which was within the allowable gross weight of 25,346 pounds; the load was distributed within the prescribed limits with respect to the center of gravity of the aircraft. Prior to departing Newark, Captain Poe filled with the CAA by telephone a flight plan indicating a flight to be made in accordance with visual flight rules (VFR) to the Allegheny County Airport, Pittsburgh, Pennsylvania. The route to be followed was via Amber 7, Green 3, and Red 21 Airways. 2 The flying time to Pittsburgh was estimated to be one hour and forty minutes, at an airspeed of 155 knots 3 with two hours and forty minutes of available fuel. The flight departed Newark at 2038 with 23 passengers on board. Routine en route position reports were made and at 2206 the flight reported over Philipsburg, Pennsylvania, VFR, estimating Westover, Pennsylvania, at 2219. At approximately 2220, the Pittsburgh combined CAA station/center (INSAC and Air Route Traffic Control) heard the flight calling Altoona, Pennsylvania, radio (INSAC) on the radio frequency of 126.7 mc. As several calls to Altoona were unanswered, Pittsburgh radio attempted to contact the aircraft but was unsuccessful. Two minutes later, at 2222, Pittsburgh radio heard N 24320 calling Westover on 126.7 mc. Since Westover is a radio beacon and has no voice facilities, Pittsburgh radio again tried to contact the aircraft, but was unsuccessful. At 2225 the flight reported to Brookville, Pennsylvania, radio that it was over Westover at 2220, VFR, estimating Pittsburgh at 2252. Pittsburgh radio received a call from the flight at 2238 asking if fuel was available at \"Johnson Marker.\" Pittsburgh interpreted this to mean Johnstown, Pennsylvania, and replied \"Reference fuel at Johnstown, they do have 91/96 octane and lower and we're attempting to contact Allegheny Airlines at Johnstown now to see if they would be open at this time of night. The Air Guide doesn't list any hours that they are open. You'll have enough fuel to land at Allegheny County, original destination, won't you, over?\" The pilot advised he was not sure, and then requested that the runway lights at the Johnstown Airport be turned on. Pittsburgh radio attempted to contact the Johnstown Airport by telephone and inter phone without success and advised the flight that they were unable to contact them at this time but would continue trying. At 2244, N 24320 called Pittsburgh radio and advised that it was over the Johnstown Airport. The pilot was asked to stand by and as soon as it was determined that Johnstown could not be contacted, Pittsburgh radio so advised. N 24320, at 2247, told Pittsburgh radio that it had passed Johnstown and was continuing to the Allegheny County Airport. Two minutes later Pittsburgh again asked the flight if it wished them to continue attempting to contact the Johnstown Airport. The pilot then said he would continue to Pittsburgh and asked for information on other fields where he might land. This was answered, \"Douglas 4320 Pittsburgh radio. Nothing for a DC-3 Douglas 4320, it's either Greater Pittsburgh or Allegheny County, over.\" At 2251, Pittsburgh gave the flight the current Allegheny County weather as: Clear, temperature 20, dew-point 10, wind south-southwest 9. When asked his altitude the pilot answered 3,200 feet. He was then given the winds aloft at 3,000 feet as being 260 degrees 10 knots. A minute later the flight advised that it was 7 miles east of the Allegheny County Airport and could see it; that it was crossing the river and could see the field lights. Pittsburgh radio then called the Allegheny County tower and advised that N 24320, a DC-3, was approximately 10 miles east, low on fuel, and was landing at that airport. The tower requested that the aircraft change to tower frequency. Pittsburgh radio called the flight at 2254, and asked it to contact the tower on 121.3 mc. In reply the pilot said that he did not have 121.3 mc. but would contact the tower on 126.18 mc. He was advised that frequency was satisfactory. The flight immediately called the tower and requested landing information. It was then cleared for a straight-in approach to runway 27 and asked to report when 3 miles out. The weather was given as: Wind southwest variable south, calm to 10, altimeter 29.84. At 2256, the flight reported it was 3 miles east on final approach; it was then cleared to land. At 2257, the flight reported that it was out of gas. At this time the tower observed the aircraft to be approximately 2 miles from the airport on final approach. The tower immediately asked if the pilot believed he could make the field. The pilot replied, \"I doubt it very much. We have both engines feathered, we are coming down over the red lights. I don't know if we'll make it or not. We are 2,000 feet.\" At 2258 the pilot advised, \"We are going to set it down.\" The tower observed the aircraft make a left turn and head toward the south. It then disappeared from the controller's view below the hills southeast of the airport. Necessary calls pertaining to the emergency were Immediately effected. The aircraft, heading in a southerly direction, was ditched wheels up in the Monongahela River at approximately 2300. The captain, Harold A. Poe, who was flying the aircraft, and nine passengers were drowned.", "probable_cause": "The Board determines that the probable cause of this accident was fuel exhaustion brought about by inadequate flight planning. Contributing factors were inadequate crew supervision and training. The following findings were reported: \r\n- The company did not properly check the competency of the crew in accordance with their operations manual prior to flight assignment,\r\n- The aircraft was overloaded at time of takeoff,\r\n- The flight was improperly planned, and was not conducted in accordance with the company's operations manual,\r\n- The captain, contrary to the company's operations manual, passed a suitable refueling facility after being advised that if the flight continued to its destination it would be necessary to use reserve fuel,\r\n- Weather along the route was good and approximately as forecast,\r\n- The aircraft was ditched in the Monongahela River, two miles from its destination because of fuel exhaustion."}