{"url": "https://www.baaa-acro.com/crash/crash-atr42-320-lubbock", "date": "Jan 27, 2009 at 0437 LT", "type": "ATR42-300", "operator": "FedEx", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Worth - Lubbock", "msn": "175", "yom": 1990, "flight_number": "FX8284", "city": "Lubbock", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13935, "captain_hours_type": 2052, "copilot_hours": 2109, "copilot_hours_type": 130, "aircraft_hours": 28768, "circumstances": "Aircraft was on an instrument approach when it crashed short of the runway at Lubbock Preston Smith International Airport, Lubbock, Texas. The captain sustained serious injuries, and the first officer sustained minor injuries. The airplane was substantially damaged. The airplane was registered to FedEx Corporation and operated by Empire Airlines, Inc., as a 14 Code of Federal Regulations Part 121 supplemental cargo flight. The flight departed from Fort Worth Alliance Airport, Fort Worth, Texas, about 0313. Instrument meteorological conditions prevailed, and an instrument flight rules flight plan was filed.", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was the flight crew’s failure to monitor and maintain a minimum safe airspeed while executing an instrument approach in icing conditions, which resulted in an aerodynamic stall at low altitude. \r\nContributing to the accident were: \r\n-the flight crew’s failure to follow published standard operating procedures in response to a flap anomaly,\r\n-the captain’s decision to continue with the unstabilized approach\r\n-the flight crew’s poor crew resource management,\r\n-fatigue due to the time of day in which the accident occurred and a cumulative sleep debt which likely impaired the captain’s performance. "}