{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-le-havre-aux-maisons-7-killed", "date": "Mar 29, 2016 at 1230 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Aero-Teknic", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Montreal - Le Havre-aux-Maisons", "msn": "1552", "yom": 1982, "flight_number": null, "city": "Le Havre-aux-Maisons (Magdalen Islands)", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 2500, "captain_hours_type": 125, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11758, "circumstances": "The twin engine aircraft left Montreal-Saint-Hubert Airport at 0930LT for a two hours flight to Le Havre-aux-Maisons, on Magdalen Islands. Upon arrival, weather conditions were marginal with low ceiling, visibility up to two miles, rain and wind gusting to 30 knots. During the final approach to Runway 07, when the aircraft was 1.4 nautical miles west-southwest of the airport, it deviated south of the approach path. At approximately 1230 Atlantic Daylight Time, aircraft control was lost, resulting in the aircraft striking the ground in a near-level attitude. The aircraft was destroyed and all seven occupants were killed, among them Jean Lapierre, political commentator and former Liberal federal cabinet minister of Transport. All passengers were flying to Magdalen Islands to the funeral of Lapierre's father, who died last Friday. The captain, Pascal Gosselin, was the founder and owner of Aéro Teknic.\r\nCrew:\r\nPascal Gosselin, pilot.\r\nPassengers:\r\nFabrice Labourel, acting as a copilot,\r\nJean Lapierre,\r\nNicole Beaulieu, Jean Lapierre's wife,\r\nMartine Lapierre, Jean Lapierre's sister, \r\nMarc Lapierre, Jean Lapierre's brother,\r\nLouis Lapierre, Jean Lapierre's brother.", "probable_cause": "Findings as to causes and contributing factors:\r\n1. The pilot’s inability to effectively manage the aircraft’s energy condition led to an unstable approach.\r\n2. The pilot “got behind” the aircraft by allowing events to control his actions, and cognitive biases led him to continue the unstable approach.\r\n3. A loss of control occurred when the pilot rapidly added full power at low airspeed while at low altitude, which caused a power-induced upset and resulted in the aircraft rolling sharply to the right and descending rapidly.\r\n4. It is likely that the pilot was not prepared for the resulting power-induced upset and, although he managed to level the wings, the aircraft was too low to recover before striking the ground.\r\n5. The pilot’s high workload and reduced time available resulted in a task-saturated condition, which decreased his situational awareness and impaired his decision making.\r\n6. It is unlikely that the pilot’s flight skills and procedures were sufficiently practised to ensure his proficiency as the pilot-in-command for single-pilot operation on the MU2B for the conditions experienced during the occurrence flight.\n\r\nFindings as to risk:\r\n1. If the weight of an aircraft exceeds the certified maximum take-off weight, there is a risk of aircraft performance being degraded, which may jeopardize the safety of the flight.\r\n2. If pilots engage in non-essential communication during critical phases of flight, there is an increased risk that they will be distracted, which reduces the time available to complete cockpit activities and increases their workload.\r\n3. If flight, cockpit, or image/video data recordings are not available to an investigation, the identification and communication of safety deficiencies to advance transportation safety may be precluded.\r\n4. If pilots do not recognize that changing circumstances require a new plan, then plan continuation bias may lead them to continue with their original plan even though it may not be safe to do so.\r\n5. If pilots do not apply stable-approach criteria, there is a risk that they will continue an unstable approach to a landing, which can lead to an approach-and-landing accident.\r\n6. If pilots are not prepared to conduct a go-around on every approach, they risk not responding appropriately to situations that require one.\r\n7. If a flight plan does not contain search-and-rescue supplementary information, and if that information is not transmitted or readily available, there is a risk that first responders will not have the information they need to respond adequately.\n\r\nOther findings:\r\n1. Transport Canada does not monitor or track the number of days foreign-registered aircraft are in Canada during a given 12-month period.\r\n2. Turbulence and icing were not considered factors in this occurrence.\r\n3. Transport Canada considers that the discretionary installation of an angle-of-attack system on normal-category, type-certificated, Canadian-registered aircraft is a major modification that requires a supplemental type certificate approval.\r\n4. Although the aircraft was not in compliance with Airworthiness Directive 2006-17-05 at the time of the occurrence, there was no indication that it was operating outside of the directive’s specifications.\r\n5. Although not required by regulation, the installation and use of a lightweight flight recording system during the occurrence flight, as well as the successful retrieval of its data during the investigation, permitted a greater understanding of this accident."}