{"url": "https://www.baaa-acro.com/crash/crash-boeing-767-281-shimoji-shima", "date": "Jun 26, 2002 at 1254 LT", "type": "Boeing 767-200", "operator": "All%20Nippon%20Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Shimoji-shima - Shimoji-shima", "msn": "23433", "yom": 1987, "flight_number": "NH8254", "city": "Shimoji-shima", "zone": "Okinawa", "country": "Japan", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10375, "captain_hours_type": 6654, "copilot_hours": 259, "copilot_hours_type": 5, "aircraft_hours": 35347, "circumstances": "On June 26, 2002, a Boeing 767-200 of All Nippon Airways, registration JA8254, took off from Shimoji-Shima Airport at around 11:32 on a flight for takeoff and landing training. The flight plan of the aircraft submitted to the Shimoji-Shima Airport Office of the Japan Civil Aviation Bureau (CAB) was as follows: FLIGHT RULES: VFR, AERODROME of DEPARTURE: Shimoji-Shima Airport, TIME: 11:20, CRUISING SPEED: 250kt, LEVEL: VFR, ROUTE: Traffic Pattern, DESTINATION AERODROME: Shimoji-Shima Airport, FLIGHT PURPOSE: Training Flight, TOTAL EET: 1 hour 40 minutes, ENDURANCE: 6 hrs 32 minutes, PERSONS ON BOARD: 3. The three persons on board were in the cockpit at the time of the accident: A pilot undergoing training for promotion to First Officer (Trainee Pilot-A) occupying the left pilot’s seat, the Captain acting as instructor occupying the right pilot’s seat, and another pilot undergoing training for promotion to First Officer (Trainee Pilot-B) occupying the left observer’s seat. First, Trainee Pilot-B made seven landings on runway 17 from the left pilot’s seat, including two landings with one engine simulated inoperative, and a go-around with both engines operative. He then changed places with Trainee Pilot-A. At around that time, the wind direction changed from the south to the west, and the aerodrome control tower instructed a change to runway 35. Trainee Pilot-A then made two landings on runway 35 with both engines operative, and training then switched to landing with one engine simulated inoperative. The first landing was made with the left engine simulated inoperative. After that, during a landing with the right engine simulated inoperative, the touchdown was late and Trainee Pilot-A attempted to go-around with go-around thrust on the left engine only. A few seconds later the instructor increased power on the right engine to go-around thrust, but at that time even though the left engine thrust had started to increase the right engine was still at minimum idle thrust. As a result, a thrust imbalance occurred between the left and right engines while right rudder was\r\nbeing applied, and the aircraft rolled and yawed to the right (East). Although Trainee Pilot-A and the instructor attempted to correct the attitude changes, the aircraft veered off the runway into a grass field on east side of the runway and came to a stop around 1,990m from the point it had first touched down. The accident occurred at runway 35 of Shimoji-Shima Airport at around 12:54. ", "probable_cause": "It is estimated that the accident was caused as follows:\r\nThe aircraft was being operated on a training flight at Shimoji-Shima Airport, and was making a one-engine-out touch-and-go landing with the right engine simulated inoperative. The touchdown was late and beyond the normal aim point, and on the direction of the instructor, the trainee pilot attempted to go around on only the left engine. However, the trainee mishandled the aircraft, and then, seeing the instructor advance the right engine’s thrust lever, he applied right rudder pedal mechanically. This coincided with an increase in the rotation speed of the left engine, and the aircraft’s attitude suddenly changed towards the right. Because the trainee pilot could not fully correct this and the instructor was late in taking over control, the aircraft veered off the east side of the runway into a grass area and was damaged. Moreover, it is estimated that the following causal factors contributed to the accident: \r\n1) The instructor did not take over when he directed the trainee to go around, or at an earlier stage, because he thought to allow the trainee pilot to handle the aircraft as much as possible, and because he did not sufficiently recognize that a go-around with one-engine simulated inoperative is a difficult maneuver for an inexperienced pilot. \r\n2) Regarding the instructor’s intent to allow the trainee pilot to handle the aircraft as much as possible, the company’s instructional guidelines contained statements meaning that a judgment to go around should be made by the trainee pilot, and that during simulated one-engine-out touch-and-go training landings, the go-around after landing should continue with one engine simulated inoperative.\r\n3) Regarding the instructor’s insufficient recognition of the difficulty of a go-around with one engine simulated inoperative for an inexperienced pilot, the instructor had not been trained to deal with the situation encountered in the accident, and the company’s regulations and manuals did not describe considerations on the difficulty of executing a go-around with one-engine simulated inoperative for an inexperienced pilot or on the effects of the wind on such maneuvers.\r\n4) Regarding the delay in the instructor taking over control of the aircraft, the instructor was not following with his hands on the control wheel and was not in a position to take over immediately if necessary, and when the instructor had changed from being a simulator instructor to a flight instructor, he had not received sufficient training on cautionary matters regarding training in actual aircraft."}