{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c-45-expeditor-bradburn-lake", "date": "Jun 5, 1995 at 1040 LT", "type": "Beechcraft C-45 Expeditor", "operator": "Selkirk%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Bradburn Lake - Selkirk", "msn": "5840", "yom": 1943, "flight_number": null, "city": "Bradburn Lake", "zone": "Manitoba", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9000, "captain_hours_type": 700, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15748, "circumstances": "The Beech 18 seaplane was departing a fishing camp at Bradburn Lake, Manitoba, for its third flight of the day en route to the operator's base at Selkirk. After boarding the passengers and loading the baggage for the flight, the pilot taxied the aircraft to a position near the southwest shore of the lake and started the take-off run on an approximate heading of 015° true. During the take-off run, after the aircraft was \"on the step,\" the pilot noticed a yaw to the left. He corrected the yaw with the aircraft's rudders and with differential engine power. Shortly thereafter, at about 60 miles per hour (mph), the yaw recurred and worsened. The left float separated from the aircraft and the left wing struck the water. The aircraft turned sharply to the left, stopped in the water, and came to rest on its left wing tip in about 15 feet of water. The pilot and the six passengers were not injured; they exited the sinking aircraft and swam to shore. The accident occurred at 1040 central daylight saving time (CDT) during daylight hours at latitude 51°55'N and longitude 95°35'W.", "probable_cause": "The left front swivel fitting attachment bolt probably moved out of position because the securing nut was either not installed or came off in service. A series of failures ensued, culminating in the separation of the left float from the aircraft."}