{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-580-columbus-3-killed", "date": "Sep 1, 2008 at 1206 LT", "type": "Convair CV-580", "operator": "Air%20Tahoma", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Columbus - Mansfield", "msn": "361", "yom": 1956, "flight_number": "HMA587", "city": "Columbus-Rickenbacker (Lockbourne AFB)", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 16087, "captain_hours_type": null, "copilot_hours": 19285, "copilot_hours_type": null, "aircraft_hours": 71965, "circumstances": "The accident flight was the first flight following maintenance that included flight control cable rigging. The flight was also intended to provide cockpit familiarization for the first officer and the pilot observer, and as a training flight for the first officer. About one minute after takeoff, the first officer contacted the tower and stated that they needed to return to land. The airplane impacted a cornfield about one mile southwest of the approach end of the runway, and 2 minutes 40 seconds after the initiation of the takeoff roll. The cockpit voice recorder (CVR) indicated that, during the flight, neither the captain nor the first officer called for the landing gear to be raised, the flaps to be retracted, or the power levers to be reduced from full power. From the time the first officer called \"rotate\" until the impact, the captain repeated the word \"pull\" about 27 times. When the observer pilot asked, \"Come back on the trim?\" the captain responded, \"There's nothing anymore on the trim.\" The inspection of the airplane revealed that the elevator trim cables were rigged improperly, which resulted in the trim cables being reversed. As a result, when the pilot applied nose-up trim, the elevator trim system actually applied nose-down trim. The flight crew was briefed on the maintenance work that had been performed on the airplane; therefore, when the captain’s nose-up trim inputs were affecting his ability to control the airplane, at a minimum, he should have stopped making additional inputs and returned the airplane to the configuration it was in before the problem worsened. An examination of the maintenance instruction cards used to conduct the last inspection revealed that the inspector's block on numerous checks were not signed off by the Required Inspection Item (RII) inspector. The RII inspector did not sign the item that stated: \"Connect elevator servo trim tab cables and rig in accordance with Allison Convair [maintenance manual]...” The item had been signed off by the mechanic, but not by the RII inspector. The card also contained a NOTE, which stated in bold type, \"A complete inspection of all elevator controls must be accomplished and signed off by an RII qualified inspector and a logbook entry made to this effect.\" The RII inspector block was not signed off.", "probable_cause": "The improper (reverse) rigging of the elevator trim cables by company maintenance personnel, and their subsequent failure to discover the misrigging during required post-maintenance checks. Contributing to the accident was the captain’s inadequate post-maintenance preflight check and the flight crew’s improper response to the trim problem.\n"}