{"url": "https://www.baaa-acro.com/crash/crash-saab-340a-hibbing", "date": "Jan 2, 1993 at 1942 LT", "type": "Saab 340", "operator": "Express Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Minneapolis - Hibbing", "msn": "147", "yom": 1989, "flight_number": null, "city": "Hibbing-Range (Chisholm)", "zone": "Minnesota", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 28, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6500, "captain_hours_type": 2800, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During the approach, the 1st officer (FO) asked the captain if he wanted to '...pop the boots?' to remove ice off the wings. The capt responded '...it's going to the hangar. I'll run'em on the ground...' The FO retarded power over the threshold and the sink rate increased; the capt observed 900 fpm. The FO applied additional back pressure on the yoke, but it was inadequate to arrest the high sink rate. Additional back pressure was applied, and the stall horn sounded followed shortly thereafter by the captain stating 'I got it.' During the hard landing the right main landing gear broke, the fuel tank ruptured, and the right wing rear spar bent upward. Aprx 18 hrs after the accident, 3/16 inch of rime mixed with clear ice was observed on the leading edges of the wing, horizontal stab, and vertical stab. The ice had finger-like protrusions positioned vertically to the wing surfaces. The company's line ops manual does not discuss flight characteristics or landing techniques specific to wing ice. Neither pilot had received company's current crm training.\n", "probable_cause": "The first officer's failure to maintain a proper descent rate during the landing, and the captain's inadequate supervision by not taking timely action to ensure a safe landing. Factors which contributed to the accident were: the company's failure to provide adequate training on the airplane's flight characteristics and/or handling techniques under conditions of wing ice contamination, the company's failure to assure that both pilots had received the current crew resource management (crm) training, and the existing weather conditions which resulted in an accumulation of ice on the airplane's wing."}