{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-nandawar-1-killed", "date": "Oct 31, 1988 at 0824 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Clarry McCarthy", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Nandawar - Nandawar", "msn": "137", "yom": 1951, "flight_number": null, "city": "Nandawar", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot had been conducting superphosphate spreading operations in the area two days prior to the accident and had completed approximately 60 trips during that operation. On the morning of the accident, he had just completed the sixth load when the outboard section of the right wing struck powerlines. The right wing was torn from its attachment points and separated from the aircraft. The aircraft then impacted the ground in a steep nose down attitude and came to rest 169 metres from the powerlines. ", "probable_cause": "A detailed examination of the aircraft and its systems failed to reveal any defect which could have contributed to the accident. The engine was operating at high power at the time of the impact. It is probable that the pilot forgot about the presence of the powerlines. It was noted that the pilot was not wearing a shoulder harness and that an unapproved modification had been made to the lap harness. The toggle fitted to the lap harness was a type approved for 9 to 12g applications only and therefore was not suitable for agricultural operations, which require equipment capable of withstanding 25g loads.\r\nThe following factor was considered relevant to the development of the accident:\r\n1. The pilot did not see or avoid the powerline. \n"}