{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-waipu-1-killed", "date": "Feb 5, 1961 at 1015 LT", "type": "Fletcher FU-24", "operator": "Aircraft-Service", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": null, "site": "Plain, Valley", "schedule": "Waipu - Waipu", "msn": "8", "yom": 1954, "flight_number": null, "city": "Waipu", "zone": "Northland Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was engaged in an aerial work operation, spreading superphosphate. On landing after the 35th sortie of the day the pilot reported to his loader driver that the elevator was sticking and tending to jam when the control column was pulled back to near the stop. The loader driver crawled into the rear interior of the fuselage, making a visual check of the elevator cables and pulleys as the pilot operated the elevator control. A small curl of 16-gauge metal, about 1/4 inch high, was found in the lower elevator pulley and removed. The pilot confirmed the operation of the elevator was now satisfactory and flying was resumed. At 10:15 the loader driver noticed that the noise of the aircraft had ceased and looking around saw the Fletcher lying wrecked on the summit of a ridge. The aircraft had dived into the ground at an attitude that was slightly over the vertical. All the wreckage, with the exception of the nose wheel, was confined to the immediate area of the point of impact. A witness mark on the dial of the ASI showed that the impact with the ground had occurred at a speed of 127 mph. There was no fire. The pilot Trevor Robert Wilson was killed. \nSource: https://aviation-safety.net/wikibase/wiki.php?id=63318", "probable_cause": "The integrity of the rudder and aileron systems was established. The upper elevator cable was intact but the lower cable was severed 12 inches from the eyebolt attachment to the counterbalance. The investigation found that a loose No. 6 PK screw had found its way into the lower elevator pulley groove when the plane was in a slight nose down attitude. When the pilot applied back pressure on the control column to raise the nose the screw had become jammed between the cable and the pulley guard pin. This had caused the elevator to lock, and the pilot's attempt to recover from the steepening dive had easily generated sufficient pressure for the sharp edge of the head of the screw to sever the cable. "}