{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-40-solitaire-bunnell-2-killed", "date": "Aug 25, 2006 at 1308 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Drug & Laboratory Disposal Inc.", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Kalamazoo – Bloomington – Governor’s Harbour", "msn": "431", "yom": 1980, "flight_number": null, "city": "Bunnell", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3800, "captain_hours_type": 1700, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3802, "circumstances": "The pilot had received an outlook briefing during the morning hours before the accident. The briefing included information regarding widely scattered thunderstorms and rain showers along portions of the pilot's planned route of flight. At the time of the accident, a convective weather significant to the safety of all aircraft (convective SIGMET) was in effect for the pilot's route of flight, and the information about the convective SIGMET was broadcast to the pilot by air traffic control (ATC). Several airplanes in the vicinity of the accident airplane were deviating around weather. Conversations between the accident pilot and the ATC controller were consistent with the accident airplane's weather radar functioning, and the possibility that the accident airplane's weather radar was providing more information than the ATC weather radar. Although the pilot initially declined a deviation query by ATC, he later accepted one. Shortly after, the pilot was unable to maintain his assigned altitude of 28,000 feet msl (FL 280), and the airplane impacted terrain consistent with a vertical descent. At the time of the accident, at FL 280, weak to moderate weather radar echoes existed. Very strong to intense weather radar echoes were seen about FL 200. The ATC facility was equipped with NEXRAD derived weather displays. The weather displays had four settings: below FL 240, between FL 240 and FL 330, above FL 330, and from sea level to FL 600. At the time of the accident, the ATC controller's weather display indicated weak to moderate echoes above FL240. Very strong to intense weather radar echoes existed about FL200; however, the ATC controller did not have his weather display set to that altitude as he was not controlling traffic at that altitude. The investigation could not determine if the pilot was aware of the stronger intensity echoes below his altitude, or if the airplane's weather radar was depicting the stronger echoes. Examination of the wreckage did not reveal any preimpact mechanical malfunctions.", "probable_cause": "The pilot's inadvertent encounter with thunderstorms."}