{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-500tp-malibu-meridian-albuquerque-3-killed", "date": "Mar 7, 2003 at 1918 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Richard W. Fuller", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Scottsdale – Albuquerque", "msn": "46-97119", "yom": 2001, "flight_number": null, "city": "Albuquerque-Double Eagle II", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1200, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 365, "circumstances": "The pilot was performing a night, VFR traffic pattern, to a full stop at a non-towered airport in a turboprop aircraft. He entered the traffic pattern (6,800 feet; 1,000 feet AGL) on an extended downwind; radar data indicated that his ground-speed was 205 knots. Over the next 3 nautical miles on down wind, radar data indicated that he slowed to a ground-speed of 171 knots, lost approximately 500 feet of altitude, and reduced his parallel distance from the runway from 4,775 feet to 2,775 feet. Witnesses said that his radio transmissions on CTAF appeared normal. The two witnesses observed a bright blue flash, followed by a loss of contact with the airplane. Rescue personnel found a broken and downed static wire from a system of three sets of power transmission wires. The dark night precluded ground rescue personnel from locating the downed aircraft; a police helicopter found the airplane approximately 2 hours after the accident. The pilot had recently completed his factory approved annual flight training. His flight instructor said that the pilot was taught to fly a VFR traffic pattern at 1,500 feet AGL (or 500 feet above piston powered aircraft), enter the downwind leg from a 45 degree leg, and fly parallel to the downwind approximately 1 to 1.5 nautical miles separation from it. His speed on downwind should have been 145 to 150 knots indicated, with 90 to 95 knots on final for a stabilized approach. The flight instructor said that the base turn should be at a maximum bank angle of 30 degrees. Radar data indicates that the pilot was in a maximum descent, while turning base to final, of 1,800 to 1,900 feet per minute with an airspeed on final of 145 to 150 knots. His maximum bank angle during this turn was calculated to have been more than 70 degrees. The separated static wire was located 8,266.5 feet from the runway threshold, and was approximately 30 feet higher than the threshold. Post-accident examinations of the airplane and its engine revealed no anomalies which would have precluded normal operations prior to impact. ", "probable_cause": "The pilot's unstabilized approach and his failure to maintain obstacle clearance. Contributing factors were the dark night light condition, and the static wires."}