{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-ushuaia-12-killed", "date": "May 15, 1984 at 1700 LT", "type": "Learjet 35", "operator": "TDF", "flight_phase": "Landing (descent or approach)", "flight_type": "Government", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Buenos Aires – Río Grande – Ushuaia", "msn": "35-478", "yom": 1982, "flight_number": null, "city": "Ushuaia", "zone": "Tierra del Fuego", "country": "Argentina", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Buenos Aires-Aeroparque-Jorge Newbery Airport on a flight to Ushuaia with an intermediate stop in Río Grande, carrying two pilots and 10 passengers, among them the Governor of the Province of Tierra del Fuego.  Following a stop at Río Grande Airport where two passengers disembarked and two others boarded, the aircraft took off at 1638LT on the last leg to Ushuaia. On approach to Ushuaia Airport, the crew encountered limited visibility due to snow falls. On final in IMC conditions, the captain decided to continue under VFR mode but failed to realize his altitude was too low when the airplane struck the water surface and crashed in the Beagle Canal, about 9 km east of the airport. The aircraft sank and all 12 occupants were killed. \r\nCrew:\r\nMario Marconcini, pilot, \r\nRodolfo Pourrain, copilot. \r\nPassengers: \r\nRamón Alberto Trejo Noel, Governor of the Province of Tierra del Fuego, \r\nMrs Ofelia Olga Lisa, Mr. Noel spouse, \r\nDr. Ernesto Julio Löffler,\r\nRoberto Luis Campanella, Minister of Public Health and Social Action, \r\nFernando Diego García, Minister of Economy, \r\nRicardo Luis Sica, Private secretary of the Governor, \r\nGuillermo Marcilese, General Secretary, \r\nCarlos Alberto Lisa, Assessor, \r\nNora Ormiston, Assessor, \r\nPedro Alberto Altuna.", "probable_cause": "It is believed that the pilot-in-command may suffered an optical illusion on final approach and continued the descent below MDA in marginal weather conditions until impact with water. "}