{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-destin-2-killed", "date": "Jan 1, 1994 at 1420 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "George M. Batsche", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Naples - Destin", "msn": "46-8508089", "yom": 1985, "flight_number": null, "city": "Destin-Fort Walton Beach", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4000, "captain_hours_type": 1262, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1262, "circumstances": "The pilot was executing an ASR approach to runway 32 and 9 seconds after the approach controller advised the pilot that the flight was over the missed approach point, the pilot advised the controller that the airport was in sight and he would be circling to land. The controller acknowledged this and witnesses observed the airplane flying northwesterly west of runway 32 about 150-200 feet above ground level. They then observed the airplane enter a left bank between 60-80 degrees and the airplane pitched nose down and collided with trees then a fence and the ground. There was a small post crash fire which was extinguished by the fire department. Examination of the airframe revealed no evidence of preimpact failure or malfunction of the flight controls. The engine was removed and placed on a test bench and after replacement of several components which were impact damaged, the engine started and operated normally. The passenger was seated in the furthest aft right seat and the lap belt attach point on the right side of this seat failed due to overload. ", "probable_cause": "Airspeed not maintained, inadvertent stall/mush, and altitude inadequate for recovery from the inflight loss of control by the pilot-in-command while circling for landing."}