{"url": "https://www.baaa-acro.com/crash/crash-avro-652-anson-i-near-keswick-5-killed-0", "date": "Apr 8, 1943 at 1640 LT", "type": "Avro 652 Anson", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Mountains", "schedule": "Jurby - Jurby", "msn": null, "yom": null, "flight_number": null, "city": "Keswick", "zone": "Cumbria", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 8th April 1943 the crew of this aircraft were undertaking a cross country navigation training flight and took off from Jurby on the Isle of Man at 1419LT. Because of poor weather and low cloud the crew became lost. It was thought that the aircraft was flying much further south than the crew believed they were. Instead of being over low ground to the west of Carlisle they were actually they were flying some twelve miles south of their assumed position which was over cloud-covered high ground. At 1640LT the crew attempted to obtain their position by transmitting a message to their base but nothing else was heard from the aircraft. Possible strong up and down air currents were thought to have affected the control of the aircraft and it descended over high ground it had crashed. The aircraft failed to return to base and was recorded as missing. The wreckage was spotted two days later on 10th April 1943 and it had crashed to the west of Bassenthwaite Lake, in the area of Lord Seat. At 2145LT a rescue party were dispatched the crash site arriving at around 2300LT. It was thought at the time that four members of the five man crew had died instantly as a result of the crash. One member of the crew was found alive but suffering from serious injuries and by this stage also suffering from exposure. A team brought him down from the crash site and he was admitted to the Mary Hewetson Cottage Hospital in Keswick. Sadly his injuries were so severe that he died there on 11th April 1943.\r\nCrew (2nd AFU):\r\nSgt Harold Motby, pilot,\r\nP/O Maurice Herbert Finbow, navigator,\r\nP/O Robert Alexander Duff, navigator, \r\nSgt James Cooney, wireless operator and air gunner,\r\nSgt William Frederick Marshall, wireless operator and air gunner.\r\nSource: http://www.yorkshire-aircraft.co.uk/aircraft/eg361.html", "probable_cause": "Possible strong up and down air currents were thought to have affected the control of the aircraft and it descended over high ground it had crashed. "}