{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-port-macquarie", "date": "Apr 13, 1985 at 1550 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Oxley%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Port Macquarie – Coffs Harbour", "msn": "31-7852049", "yom": 1978, "flight_number": null, "city": "Port Macquarie", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot reported that shortly after the aircraft became airborne, he noted a substantial change in propeller pitch noise and an associated loss of performance. Insufficient runway remained to permit a landing straight ahead. The pilot raised the landing gear and flap, however the aircraft failed to climb and the airspeed decayed to below the safe single engine speed. The take-off attempt was abandoned and a forced landing was carried out off the end of the runway. The rear fuselage impacted heavily on a dirt bank 78 metres beyond the runway threshold, following which the aircraft passed through a fence and slid for a further 78 metres before coming to rest. All nine occupants escaped uninjured.", "probable_cause": "No fault was subsequently found with the engines or systems of the aircraft which might have explained the reported loss of performance. Calculations indicated that the weight of the aircraft at the time of take-off was close to the maximum allowable, but the centre of gravity was aft of the rear limit. Several of the passengers indicated that the aircraft rotated sharply to an unusually high nose attitude as it became airborne. The pilot's action in raising the flap when he perceived the power loss was contrary to the emergency procedures for the type, and probably resulted in sink and a further reduction in airspeed."}