{"url": "https://www.baaa-acro.com/crash/crash-bristol-175-britannia-314-honolulu-27-killed", "date": "Jul 22, 1962 at 2319 LT", "type": "Bristol Britannia", "operator": "CP%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Vancouver – Honolulu – Nadi – Auckland – Sydney", "msn": "13394", "yom": 1958, "flight_number": "CP301", "city": "Honolulu", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 11, "crew_fatalities": 7, "pax_on_board": 29, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 27, "captain_hours": 13250, "captain_hours_type": 920, "copilot_hours": 16073, "copilot_hours_type": 1628, "aircraft_hours": null, "circumstances": "The aircraft had arrived in Honolulu at 0507 hours Hawaiian standard time on 21 July as CPA Flight 323 from Vancouver, British Columbia, Canada. It was departing, the evening of 22 July, as Empress Flight 301 on a scheduled international flight for Nadi (Fiji Islands), Auckland (New Zealand) and Sydney (Australia). The night takeoff was commenced at 22:38 hours local time and approximately two minutes after becoming airborne and during the climbout a fire warning indication for No 1 engine was received in the cockpit. The No. 1 propeller was feathered and the tower controller was advised that the aircraft was returning to Honolulu. As an over-gross landing weight condition existed, fuel jettisoning in the amount of 35000 lb was carried out The jettisoning operation was completed at 23:06 hours following which the flight was vectored west of the outer marker to Intercept the ILS final approach course for runway 08. The three-engine landing approach appeared normal until the aircraft had proceeded beyond the runway threshold and had commenced its landing flare at an altitude of approximately 20 feet above the runway centreline. A go-around was attempted from this position, and the aircraft banked and veered sharply to the left. Initial ground contact was made by the left wing tip approximately 550 feet to the left of the runway centreline and approximately 700 feet beyond the threshold of the runway. The aircraft progressively disintegrated as it moved across the ground, then struck heavy earth-moving equipment parked approximately 970 feet from the runway centreline.", "probable_cause": "The attempted three-engine go-around, when the aircraft was in a full landing configuration, at insufficient airspeed and altitude to maintain control."}