{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-chippewa-falls-2-killed", "date": "Feb 14, 1995 at 2250 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Air Excursions", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ithaca - Eau Claire", "msn": "46-08043", "yom": 1986, "flight_number": null, "city": "Eau Claire-Chippewa Valley", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2200, "captain_hours_type": 120, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1248, "circumstances": "The single engine airplane departed with two pilots, two passengers, baggage and equipment. At takeoff, the airplane was 955 pounds over the maximum allowable gross weight, and 2 inches beyond the aft c.g. Limit. After 4 hours of flying, the pilot elected to divert to another airport, due to icing conditions. During the descending left turn from base leg to final approach to runway 22, the airplane dropped, struck the ground, and slid 250 feet. The wings were separated from the airplane during the ground slide by two trees. A satisfactory postaccident engine run was completed. The airplane was calculated to be about 600 pounds over the maximum landing weight, and 2 inches beyond the aft c.g. Limit. The air induction lever was in the primary position, and not the required alternate position for icing conditions. The propeller and stall warning heat switches were off. The airplane had been flying in light freezing rain, which the poh stated should be avoided. Severe mixed icing was reported 25 miles northwest of the airport. Winds at the airport were from 150 degrees at 10 knots, gusting to 16 knots. Both pilots were killed and both passengers were seriously injured.", "probable_cause": "The pilot's improper decision to depart into known adverse weather conditions, and the subsequent encounter with freezing drizzle, resulting in an inadvertent stall and collision with the terrain during an approach to land. Also causal to the accident was the pilot's failure to adhere to the airplane's weight and balance limitations, resulting in an overweight and out of balance flight condition, and his failure to comply with published procedures for flight into icing conditions."}