{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-ottawa", "date": "Jun 13, 1997 at 1248 LT", "type": "Swearingen SA226 Metro II", "operator": "North American Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hamilton - Ottawa", "msn": "TC-294", "yom": 1979, "flight_number": null, "city": "Ottawa-Macdonald-Cartier", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2240, "captain_hours_type": 1930, "copilot_hours": 500, "copilot_hours_type": 55, "aircraft_hours": null, "circumstances": "The flight crew were properly licensed and certified to conduct the flight. The pilot had a total flying time of approximately 2,240 hours, of which 1,930 were on the occurrence aircraft type. The co-pilot received his commercial pilots license in 1988 and had approximately 500 hours total flying time. He completed his instrument rating on 15 December 1996 and his initial training on the SA226-TC was completed in March 1997 in British Columbia with a different company. He had not flown for 44 days at the time his recurrent training was completed on 09 June 1997. This was the co-pilot=s third day of operational flying for the company; he had accumulated approximately 55 hours total time on the aircraft type. The co-pilot was flying the aircraft for a radar-vectored, localizer/back-course approach to runway 25 of the Ottawa/Macdonald-Cartier airport. Descending out of 10,000 feet above sea level, the crew completed a briefing for the approach. The weather conditions at the time did not necessitate a full instrument approach briefing because the crew expected to fly the approach in visual conditions. Air traffic control requested that the crew fly the aircraft at a speed of 180 knots or better to the Ottawa non-directional beacon (NDB), which is also the final approach fix (FAF) for the approach to runway 25. At approximately eight nautical miles from the airport the aircraft was clear of cloud and the crew could see the runway. In order to conduct some instrument approach practice, the pilot, who was also the company training pilot, placed a map against the co-pilot=s windscreen to temporarily restrict his forward view outside the aircraft. The approach briefing was not amended to reflect the simulated instrument conditions for the approach. The co-pilot accurately flew the aircraft on the localizer to the FAF, at which point, he began to slow the aircraft to approximately 140 knots and requested that the pilot set 2 flap, which he did. Once past the FAF, the copilot=s workload increased, and he had difficulty flying the simulated approach. On short final to runway 25, the pilot removed the map from the co-pilot=s windscreen. The co-pilot noted that the aircraft was faster and higher than normal and he tried to regain the proper approach profile. By the time the aircraft reached the threshold of the runway 25, it was approximately 500 feet above ground, and at a relatively high speed, so the pilot took control of the aircraft for the landing. The pilot attempted to descend and slow the aircraft as it proceeded down the length  of the runway and stated that he had just initiated an overshoot when he heard the first sounds of impact. Runway 25 is 8,000 feet long. The first signs of impact on the runway were made by the propellers, with propeller marks beginning about 4,590 feet from the threshold of runway 25. The aircraft came to rest about 6,770 feet from the threshold, and a fire broke out in the area of the right engine. The co-pilot opened the main door of the aircraft while the pilot shut down the aircraft systems, and both exited the aircraft uninjured. The maximum speed for extending the landing gear on this aircraft is 176 knots, and the company standard operating procedures (SOPs) for a normal instrument approach stipulate that the aircraft should cross the final approach fix at a speed of 140 knots, with a 2-flap setting, and with the landing gear lowered. The company SOPs require that all checklist items, from the after start checks through to the after landing checks inclusive, be actioned through a challenge and response method with each item called individually. The first item of the before landing checks is a landing gear .....Down/3 [email protected] The co-pilot did not recall being challenged for the landing gear check, and the pilot could not remember selecting the landing gear switch to the down position. Neither pilot checked for the three green lights prior to the occurrence. The pilot stated that it was his habit to check if the landing lights were on prior to landing because it was his habit to turn them on only after the landing gear had been extended. He remembered checking to see that the landing lights were on and so was satisfied that the gear was down. The co-pilot assumed that, because the aircraft had passed the NDB, the before landing checks had been completed; they are normally completed before or at that point during an approach. Neither pilot recalled hearing a gear warning horn prior to the impact. When the aircraft systems were inspected, the landing gear selector was found in the up position. Tests were conducted on the landing gear warning system which revealed that the gear warning horn did not function. A closer examination of the system revealed a faulty diode. The diode was replaced and when the warning system was checked again, it functioned properly. The pilot stated that the gear warning horn on the aircraft had functioned properly during the training for the co-pilot one week earlier.", "probable_cause": "The aircraft was landed with the landing gear retracted because the flight crew did not follow the standard operating procedures and extend the landing gear. Contributing to the occurrence were the lack of planning, coordination, and communication on the part of the crew; and the failure of the landing gear warning system."}