{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-500-phenom-100-angra-dos-reis", "date": "Oct 12, 2009 at 1310 LT", "type": "Embraer EMB-500 Phenom 100", "operator": "SAVE Comercial e Importadora", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Campo de Marte – Angra dos Reis", "msn": "500-00049", "yom": 2009, "flight_number": null, "city": "Angra dos Reis", "zone": "Rio de Janeiro", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7200, "captain_hours_type": 39, "copilot_hours": 1400, "copilot_hours_type": 39, "aircraft_hours": 14, "circumstances": "Following an uneventful flight from Campo de Marte, the crew initiated the approach to runway 10 which is 961 metres long. After touchdown, the crew started the braking procedure but the aircraft skidded on runway and cartwheeled. It overran, lost its both main gears and came to rest six metres further. Both pilots escaped uninjured and the aircraft was damaged beyond repair. ", "probable_cause": "The following findings were identified:\r\n- The crew considered the operation at Angra dos Reis Airport as unsafe, but operated the aircraft at that airport several times due to pressures from the aircraft's owner, \r\n- The landing was completed with a tailwind component and a high aircraft weight, without considering the possibility to use runway 28, which demonstrated a poor assessment of the existing landing conditions,\r\n- The relative short landing distance available, less than one km,\r\n- The possible pressure exerted by the owner to carry out the flights, as well as the need to maintain the job or the professional image, may have contributed to the complacency behavior of the crew on the issues that lead to the operation of aircraft under conditions below acceptable safety standards,\r\n- Poor flight planning, \r\n- The relative low experience of the crew on this type of aircraft."}