{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6-rome-16-killed", "date": "Jan 14, 1954 at 1150 LT", "type": "Douglas DC-6", "operator": "Philippine%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Manila – Bangkok – Karachi – Beirut – Rome – Zurich – Hamburg – London", "msn": "42902", "yom": 1947, "flight_number": null, "city": "Rome-Ciampino", "zone": "Lazio", "country": "Italy", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On final approach to Rome-Ciampino Airport, the crew encountered marginal weather conditions. While descending through clouds at an altitude of 6,500 feet, the crew informed ground about fire on right engine. It is believed that both right engines were on fire at this time. The pilot-in-command reduced his altitude in an attempt to make an emergency landing when, at a height of 650 feet, the airplane plunged into the earth and crashed in a huge explosion in a field located about six km east of Ciampino Airfield. The four engine aircraft disintegrated on impact and all 16 occupants have been killed. A crater was seen at the point of impact and debris were scattered on a wide area. ", "probable_cause": "Technical issues or fire on both right engines was not confirmed by investigations. However, some unforeseen fact to which the aircraft was subjected, as a result of which, being no longer under control, it went into a steep dive, probably on account of wing drop in the clouds, and crashed to the ground after an uncompleted pull-out. The Committee, although unable to affirm that wing drop could have been caused by atmospheric conditions, wishes to point out that there was pronounced turbulence in the area."}