{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-76td-khartoum-4-killed", "date": "Jun 30, 2008 at 0700 LT", "type": "Ilyushin II-76", "operator": "Ababeel%20Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Khartoum – Juba", "msn": "10034 99994", "yom": 1990, "flight_number": "BBE700", "city": "Khartoum", "zone": "Khartoum (الخرطوم)", "country": "Sudan", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 15634, "captain_hours_type": 4794, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was cleared for takeoff and began its departure roll with flaps retracted, according to flight data recorder. The aircraft rotated at 280 kph (151 knots) and became airborne at 288 kph (155 knots) at an angle of attack of about 8-9 degrees. Tyre marks on the runway showed, that the aircraft had gone past the end of the runway, the main tyres had impacted runway end lights and the tyre tracks continued past the paved surface of the stopway. Climbing through 15 feet the pilot flying commanded the gear up and increased the pitch angle, the angle of attack increased to more than 10 degrees while the gear doors opened for gear retraction increasing the drag of the aircraft, which began to slow, the speed reduced to 305 kph (164 knots), stall speed for the takeoff weight, and the left wing began to stall, the angle of attack increased to 17 degrees, the aircraft at a height of 5-7 meters/15-23 feet. The pilot flying tried to counteract the roll to the left by fully applying left aileron which also deployed the right wing spoilers, right rudder input was provided. The pilot flying instructed the flight engineer to NOT retract flaps indicative neither pilot was aware the flaps were up. Following that instruction the flight engineer selected the flaps down, the aircraft speed was 300 kph (162 knots) and the aircraft in an unrecoverable stall with no height left. The left hand wing struck a high voltage mast about 1200 meters past the runway end at a height of 5.4 meters (18 feet) shearing off the left wing tip, contacted the flag post at the entrance of the Green Square, the left wing contacted the stem of a tree at a height of about 40 cm (1.3 feet) separating the ailerons and causing fuel spilling from the left wing, the aircraft broke through the eastern brick wall of Green Square, collided with two more electric poles causing engine #4 to separate 1504 meters from the end of the runway and impacted ground at 30 degrees nose down, 30 degrees left bank. Debris was distributed over a length of more than 500 meters, the aircraft burst into flames. All 4 crew perished in the crash, 4 people on the ground received serious, 3 more received minor injuries.", "probable_cause": "The following findings were identified:\r\n- From the CVR recording it appeared that no checklist had been used during all phases from engine start up, taxiing and take off,\r\n- Ababeel company does not keep any records or files regarding the crew flying experience. They joined the company about four months before the accident,\r\n- Engine n°1 showed only 96.2% N1 and thus delivered less thrust than the other three engines, \r\n- Engine n°4 showed a 30° higher EGT than the other engines indicating that the engine was not in a satisfactory condition requiring the temperature limiter to be switched off to enable the engine to deliver the thrust needed,\r\n- According to the FCOM the aircraft would need 2,850 meters takeoff distance at 188 tons takeoff weight with flaps at 30° and slats at 14°. As the crew did not use the checklists, either they were used to extend the flaps and slats after the aircraft gained certain speed and their attention was being drawn by monitoring the engine which the navigator asked about or another serious defect or they forgot to extend the flaps due to fatigue caused by alcohol consumption by the flight engineer and short periods of rest for the first officer. The clean aircraft lift off after rolling for a distance of 2,380 meters for take off which was a very short distance for such weight and temperature of 27°. Retracting of landing gear immediately within lift-off increased drag before the aircraft gained positive lift,\r\n- the aircraft never climbed above 7 meters (23 feet) above ground,\r\n- the aircraft had an automatic configuration warning which would activate at 70 +/- 15 kph, if the flaps were not extended. This system however could be switched off, or might have been malfunctioning, it did not activate during the takeoff run."}