{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-beaufort-2-killed", "date": "Nov 30, 1987 at 0946 LT", "type": "Beechcraft 90 King Air", "operator": "Joseph R. Leon", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Savannah - Philadelphia", "msn": "LJ-633", "yom": 1974, "flight_number": null, "city": "Beaufort", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 14000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2092, "circumstances": "At 0938, while climbing thru 9,000 feet, the pilot was cleared to climb to FL210. Approximately 10 minutes later, the ATC controller noted the aircraft's mode C return wasn't being displayed on his scope. He tried to advise the pilot, but couldn't establish radio contact. The aircraft broke up in flight and the wreckage was found submerged in a creek and on marshland. A large piece of the right outboard wing panel was found about 2 miles east of the main wreckage. The right engine was found approximately 800 feet to 1,200 feet northeast of the main wreckage in 4 feet of water. There was evidence the right outboard wing had failed from upward and aft overload. No pre-accident mechanical failure or malfunction was found that would have resulted in an in-flight break-up. Radar data showed the aircraft was climbing at 115 knots and 1,100 feet/minute; at approximately 16,000 feet msl, rate of climb slowed to approximately 750 feet/minute, then increased to 1,200 feet/minute. Peak altitude was approximately 18,200 feet. Aircraft then entered a steep descent and crashed. At the approximately time and place of peak altitude, primary targets appeared on radar and remained for several minutes. Organic material was found on left engine inlet screen, but source was not determined. Accident occurred along bird flyway. Both occupants were killed. ", "probable_cause": "Occurrence #1: airframe/component/system failure/malfunction\r\nPhase of operation: climb\r\nFindings\r\n1. (c) reason for occurrence undetermined\r\n2. Design stress limits of aircraft - exceeded\r\n3. Wing - overload\r\n4. Wing - separation\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled\r\nFindings\r\n5. Terrain condition - water"}