{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-b-englewood-1-killed", "date": "May 1, 1991 at 0653 LT", "type": "Piper PA-31-310 Navajo", "operator": "John Westbrook", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Englewood - Des Moines", "msn": "31-790", "yom": 1972, "flight_number": null, "city": "Englewood", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6200, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after takeoff, while climbing to cruise altitude, the pilot reported the left engine cowl assembly had come off. Witnesses observed the airplane at low altitude and noted that it was 'yawing, sputtering, and rocking back and forth.' They indicated the left engine was not running and that the airplane banked sharply to the right and disappeared behind trees before crashing. An investigation revealed the left propeller had not been feathered. The left engine cowling was found 1.8 miles from the accident site. The three primary (eyebolt) cowl fasteners on the outboard side of the left upper cowl were found unlocked & seven other cowl attaching studs (screws) were missing. The cowling had been removed 16 days before the accident to install an oil/air separator. This was the first flight since that work was performed. The mechanic, who did the work, said he noted several cowl stud fasteners were missing and that he had notified the pilot. The pilot was reported to have replied that he had some fasteners and would take care of the problem. The pilot, sole on board, was killed. ", "probable_cause": "In-flight separation of the left engine cowl assembly that was not properly latched, and failure of the pilot to maintain minimum control speed, which resulted in his loss of aircraft control. Factors related to the accident were: an inadequate preflight inspection, inadequate markings/alignment indications to assure that the cowl fasteners were locked, and an insufficiently defined procedure in the flight manual for checking the cowl fasteners."}