{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-san-antonio", "date": "Aug 16, 1999 at 1733 LT", "type": "Swearingen SA227 Metro III", "operator": "Merlin%20Express", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Antonio - San Antonio", "msn": "AC-437", "yom": 1981, "flight_number": null, "city": "San Antonio", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3400, "captain_hours_type": 490, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 19317, "circumstances": "The airplane landed wheels up after the instructor pilot failed to lower the landing gear. The instructor told the student to execute 'a no flap landing due to a simulated hydraulic pump failure.' The student established the airplane on the approach and called for the 'Emergency Gear Extension Checklist.' The instructor delayed extending the gear in accordance with the operator's flight standards manual, which stated that the landing gear should not be extended until the landing was assured. Later in the approach, when the gear warning horn stopped sounding, due to the student's movement of the power levers forward, the instructor removed his hand from the gear handle without extending the gear. The instructor stated that 'because [the student] had already called for the [Emergency Gear Extension] checklist once before, in a split second thought process, [he] mistakenly thought it had been completed.' Following the accident, the landing gear system was tested and found to operate normally. Review of the maintenance records revealed no uncorrected discrepancies. At the time of the accident, the instructor pilot was completing a 9-hour work day, and did not have a lunch break.", "probable_cause": "The instructor pilot's failure to complete the Emergency Gear Extension Checklist, resulting in the inadvertent wheels-up landing. A factor was the instructor pilot's fatigued condition. "}