{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-229c-charleroi", "date": "Apr 4, 1978 at 1807 LT", "type": "Boeing 737-200", "operator": "Sabena.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Charleroi - Charleroi", "msn": "20914/396", "yom": 1975, "flight_number": null, "city": "Charleroi-Brussels South (Gosselies)", "zone": "Hainaut", "country": "Belgium", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6983, "circumstances": "The aircraft was engaged in a local training flight at Charleroi-Gosselies Airport and was carrying a crew of three (one instructor and two student pilots) who just landed from Brussels. Both students were going to practice ILS approaches to runway 25 at Charleroi-Gosselies Airport (CRL) followed by a touch-and-go. The initial six approaches were uneventful. The students then changed seats. The second student's first approach and touch-and-go were uneventful. During the second touch-and-go a flock of birds (ring doves) were observed crossing the runway. Several birds were ingested as the airplane was rotating. The instructor took over control and attempted to continue takeoff. The airplane failed to respond to his control inputs and seemed to decelerate. He then decided to abort the takeoff. There was insufficient runway length available so the Boeing overran, struck localiser antennas and skidded. It lost its undercarriage and came to rest in flames on a road located about 320 meters past the runway end. All three occupants evacuated safely while the aircraft was destroyed by fire. ", "probable_cause": "The probable cause of the accident was the interruption of the takeoff maneuver at the time of the impact of birds, followed by a stop for undetermined reasons. The deceleration due to braking prevented the aircraft to respond to the action of the pilot-instructor using the ailerons. The takeoff was interrupted while the remaining runway length was insufficient to stop the aircraft."}