{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-ii-sao-francisco-do-sul-3-killed", "date": "Oct 30, 1998 at 2036 LT", "type": "Piper PA-31 Cheyenne", "operator": "Busscar", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Rio de Janeiro – Joinville", "msn": "31-7920077", "yom": 1979, "flight_number": null, "city": "São Francisco do Sul", "zone": "Santa Catarina", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2420, "captain_hours_type": 603, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Rio de Janeiro-Santos Dumont Airport, the pilot started the descent to Joinville Airport by night and marginal weather conditions. He was informed about the visibility at destination being 2 km with ceiling at 650 feet. At 2032LT, he initiated the approach and reported to ATC that if it was raining, he would divert to Curitiba. Four minutes later, on final approach, the twin engine aircraft struck trees and crashed about 15 km southeast of runway 33 threshold. The aircraft was destroyed by impact forces and a post crash fire and all three occupants were killed. ", "probable_cause": "The following findings were identified:\r\n- There was the participation of psychological variables at individual level, related to the profile of the pilot, such as excessive self-confidence in assuming that he always reached his destination, the knowledge of the region and probably the self-induced pressures by the situation in the cabin, combined with the prevailing meteorological condition, as well as the fact that he made a mistake with the procedure he was performing, demonstrating the adoption of an inadequate decision, excessive motivation for landing and lack of attention to the correct procedure.\r\n- It was not possible to perform an effective analysis on the parts and instruments of the aircraft, in view of their degree of destruction, thus the contribution of this factor to the accident could not be determined.\r\n- Weather conditions at destination were fickle and deteriorated during the execution of the descent procedure of the aircraft, contributing to the accident.\r\n- The pilot failed to comply with the planned descent profile in use.\r\n- Despite being aware of the meteorological conditions at destination, the pilot did not adequately plan the accomplishment of the procedure of descent by instruments, coming to throw out of the established profile, suggesting that he did not undertake the briefing of descent.\r\n- The performance of the procedure outside the foreseen profile and in instrument flight conditions, determine the participation of this aspect in the occurrence."}