{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-231-bangalore-92-killed", "date": "Feb 14, 1990 at 1303 LT", "type": "Airbus A320", "operator": "Indian%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bombay - Bangalore", "msn": "79", "yom": 1989, "flight_number": "IC605", "city": "Bangalore-Hindustan", "zone": "Karnataka", "country": "India", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 4, "pax_on_board": 139, "pax_fatalities": 88, "other_fatalities": 0, "total_fatalities": 92, "captain_hours": 10339, "captain_hours_type": 212, "copilot_hours": 9307, "copilot_hours_type": 68, "aircraft_hours": 370, "circumstances": "Indian Airlines Flight 605 took off from Mumbai, India, at 11:58 for a domestic flight to Bangalore. At 12:25 Bangalore approach was contacted and prevailing weather was passed on to the crew (wind variable 5 knots, visibility 10 km, clouds 2 octa 2,000 feet, temperature 27° C, QNH 1018). At 12:44 the aircraft was cleared to descend to FL110. Reaching FL110, vectors were given for a visual runway 09 approach. On final approach, the aircraft descended well below the normal approach profile and kept descending until it struck the boundaries of the Karnataka Golf Club (2,300 feet short of the runway and 200 feet right of the extended centerline. The aircraft rolled for 80 feet and lifted off again for about 230 feet and came down again on the 17th green of the golf course. The landing gear wheels dug into the ground and the aircraft impacted a 12 feet high embankment, causing the gears and engines to be sheared off. The aircraft continued over the embankment and came to rest in a grassy, marshy and rocky area.", "probable_cause": "Failure of the pilots to realize the gravity of the situation and respond immediately towards proper action of moving the throttles, even after the radio altitude call-outs of \"Four hundred\", \"Three hundred\" and \"Two hundred\" feet, in spite of knowing that the plane was in idle/open descent mode. However, identification of the cause for the engagement of idle/open descent mode in short final approach during the crucial period of the flight is not possible."}