{"url": "https://www.baaa-acro.com/crash/crash-lockheed-p-3v-1-orion-near-chico-3-killed", "date": "Apr 20, 2005 at 1850 LT", "type": "Lockheed P-3 Orion", "operator": "Aero%20Union.gif", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Mountains", "schedule": "Chico - Chico", "msn": "185-5171", "yom": 1963, "flight_number": null, "city": "Chico", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4937, "captain_hours_type": 2915, "copilot_hours": 4317, "copilot_hours_type": 192, "aircraft_hours": 15614, "circumstances": "Prior to the accident flight, the air tanker airplane had flown 9 times on the day of the accident, for a total flight time of 5 hours and 46 minutes. The purpose of the flights was to provide recurrent training for pilots scheduled to conduct fire-fighting operations for the United States Department of Agriculture Forest Service (USFS) during the upcoming fire season. Pilots aboard the airplane during the earlier flights reported no mechanical problems with the airplane. As was the mission for other flights that day, the accident flight, the tenth flight, was a training flight to conduct practice drops of water over an area of rugged mountainous terrain located north of the airport. Aboard the flight were the captain, the copilot, and the company's Chief Pilot, who was providing flight instruction. The Chief Pilot had been on board all the flights that day. Radar data indicated that the flight departed the airport and proceeded about 10.5 nautical miles to the north where it began maneuvering in a manner consistent with the conduct of practice water drops. The data showed the airplane entering and then following a right-hand racetrack pattern oriented northeast-southwest, during which it appeared that practice drops were being made on the southwest leg. During the last minute of the flight, the airplane was on the northeast leg of the racetrack pattern, flying up a valley that was oriented northeast-southwest with uphill being to the northeast. The airplane's flight path was initially near the middle of the valley. During the last 36 seconds of the flight, the airplane's flight path began to deviate towards the rising terrain on the eastern side of the valley. The last two radar hits show the airplane at an altitude of less than 100 feet above ground level. The airplane had completed approximately 1.75 circuits of the racetrack when the data ended with the airplane at 2,900 feet msl, heading northeast. The initial impact point was located about 2,150 feet northwest of the last radar data point at an elevation of about 2,450 feet msl, indicating the airplane entered a left descending turn and completed about 90 degrees of turn between the last radar hit and the impact. No distress calls were received from the airplane. According to local authorities, witnesses observed a \"fire ball\" at the time of the accident. Examination of the wreckage site revealed that the airplane impacted on about a 304 degree magnetic heading in a 40 degree left bank with the left wingtip striking the ground first. The airplane was severely fragmented and a severe post crash fire burned most of the structure and surrounding vegetation. Remnants of the entire airplane were accounted for at the wreckage site. There was no evidence of pre-existing structural failures or impact with foreign objects in any of the  wreckage. All four of the engines and propellers were found at the wreckage site. The engines did not have any indications of an uncontainment, case rupture, or pre-impact in-flight fire. All four engines had damage to the compressor and/or turbine rotors that was consistent with engine operation. The cockpit engine instrumentation gages indicate that all four engines were running at about 2,200 shaft horsepower at impact. Review of the airplane's maintenance records did not reveal any chronic issues with the airplane nor any system/component anomalies that would have contributed to the accident. The airplane was equipped with neither a cockpit voice recorder (CVR) nor a flight data recorder (FDR) and Federal Aviation Regulations did not require the airplane to be so equipped. The reason for the in-flight collision with terrain could not be determined.", "probable_cause": "Terrain clearance was not maintained while maneuvering for undetermined reasons. Mountainous terrain was a factor.\n"}