{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227at-merlin-ivc-spokane-1-killed", "date": "Nov 29, 2003 at 0801 LT", "type": "Swearingen SA227AT Merlin IVC", "operator": "Ameriflight2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Seattle – Spokane", "msn": "AT-439B", "yom": 1981, "flight_number": "AMF1996", "city": "Spokane-Felts Field", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6253, "captain_hours_type": 4406, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15126, "circumstances": "The pilot, who had more than 3,340 hours of pilot-in-command time in the make/model of the accident aircraft, and was very familiar with the destination airport and its ILS approach procedure, departed on a cargo flight in the SA227 turboprop aircraft. The aircraft was dispatched with the primary (NAV 1) ILS receiver having been deferred (out of service) due to unreliable performance the evening before the accident, thus leaving the aircraft with the secondary (NAV 2) ILS receiver for ILS use. The pilot arrived in the destination terminal area and was given vectors to intercept the ILS localizer, and radar data showed the aircraft intercepting and tracking the localizer accurately throughout the approach. Mode C altitude readouts showed the aircraft approaching from below the glideslope at the required intercept altitude of 4,100 feet, passing through and above the glideslope and then initiating a relatively constant descent, the angle of which exceeded the glideslope angle of -3.5 degrees. Weather at the destination airport was 400 foot overcast and the decision height for the ILS/DME runway 21R approach was 270 feet. The aircraft passed through the tops of trees in level flight about 530 feet above the airport elevation and slightly under 3 nautical miles from the runway threshold. The pilot was given a low altitude alert by the tower and acknowledged, reporting that he was descending through 2,800 feet, which was confirmed on the mode C radar readout. At that point the aircraft was well below the ILS glideslope and about 13 seconds from impacting the trees. Post crash examination of information captured from the left and right HSI units and an RMI revealed that the NAV 1 receiver was most likely set on the ILS frequency, and the NAV 2 receiver was most likely set on Spokane VORTAC, a terminal navigation facility located very slightly right of the nose of the aircraft and 14 nautical miles southwest of the destination airport.", "probable_cause": "The pilot-in-command's failure to maintain proper glidepath alignment during an ILS approach in poor weather resulting in collision with trees and terrain. Contributing factors were the unreliable status of the primary (NAV 1) ILS receiver (leaving the pilot with only the secondary (NAV 2) ILS receiver), the low ceilings and trees. "}