{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-2f9-kaduna-11-killed", "date": "Nov 13, 1995 at 0853 LT", "type": "Boeing 737-200", "operator": "Nigeria%20Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yola – Jos – Kaduna – Lagos", "msn": "22985", "yom": 1982, "flight_number": "WT357", "city": "Kaduna-Intl", "zone": "Kaduna", "country": "Nigeria", "region": "Africa", "crew_on_board": 14, "crew_fatalities": 0, "pax_on_board": 124, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 22375, "circumstances": "Nigeria Airways flight WT357 departed Yola (YOL) at 07:00 en route to Lagos (LOS). Intermediate stops were planned at Jos (JOS) and Kaduna (KAD). The Boeing 737 landed at Jos at 07:40 and departed fifty minutes later. The flight to Kaduna was uneventful. Kaduna ATC gave the aircraft an inbound clearance with no delay for a locator approach to runway 05. Though, the initial landing clearance was for runway 05, the captain requested to land on runway 23. He was reminded by the controller that the wind was from 090 magnetic, but he still insisted on using the 23 approach. At 08:42, the aircraft commenced its initial descent at 48 miles on the ILS/DME to 4,500 ft. At 08:49 UTC, it was cleared to 3,500 ft at 10 miles out and was later descended to 500 ft. The aircraft turned left from the track 310 to align with runway 23 and the aircraft was still in the turn when the threshold was sighted just 1.5 miles to the left of the aircraft. The first officer asked the captain \"Can you make it to land from that position?\". The observer in the jump seat also suggested going on the downwind, presumably to re-position the aircraft for landing on runway 05. There was no response at all from the captain and the approach was continued for runway 23. The left turn was very steep and it took the aircraft to the left of the runway centreline and a right correction was applied. The observer shouted \"Watch the wing\" as the wings could have struck the ground on the final approach. By this time, the aircraft crossed the threshold with the flying pilot still struggling to maintain directional control for runway centreline alignment. The aircraft touched down 7820 feet down the runway, leaving just 2020 ft (615.85 m) of runway length. The captain was reported to have used 1.8 and 1.6 EPR on the reversers. When a runway overrun became inevitable, the captain turned the aircraft to the left with the intention to take advantage of the last rapid exit intersection to avoid the runway end lights. At this juncture, the aircraft entered an uncontrollable skid. The right wing hit the ground, thus rupturing the fuel tanks and a huge fire erupted. The aircraft was destroyed by the fire.", "probable_cause": "The probable cause of the accident is the continuation of a highly unstabilized approach when the option of a missed approach could have been taken. The contributing factor was the turn off at 76 knots into the high speed intersection when an overrun into the extended runway end should have been maintained."}