{"url": "https://www.baaa-acro.com/crash/crash-canadair-cl-44d4-6-near-yerevan-4-killed", "date": "Jul 18, 1981 at 1544 LT", "type": "Canadair CL-44", "operator": "Transporte Aereo Rioplatense", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Tehran - Larnaca", "msn": "34", "yom": 1962, "flight_number": null, "city": "Yerevan", "zone": "Yerevan", "country": "Armenia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After completing two round-flights from Tel Aviv to Tehran via Larnaca (Cyprus), the aircraft was returning to Cyprus after having delivered the third tranche of cargo to Iran (a load of tank spare parts and ammunition). On its return flight from Tehran to Cyprus on its third trip, while on a 300° heading to the Turkish border, the crew was instructed to turn left heading 240° direct to Cyprus. For unknown reasons, the plane went off course to the north and crossed the Azerbaijan border without any clearance. Few minutes later, a Soviet Sukhoi Su-15 fighter was dispatched to intercept the CL-44. According to Soviet accounts at that time the crew failed to respond to radio calls as well as signals from the fighter pilot flying close to the CL-44's nose. The cargo plane, while probably making the procedure turn to the left, tried to get away. In unclear circumstances, both aircraft collided. They went out of control and entered a dive before crashing about 50 km from Yerevan. All four crew people on board the CL-44 were killed while the fighter pilot was able to bail out and was found alive. It is unclear whether the collision was intentional, the Soviet pilot said it was a deliberate attempt to down the enemy aircraft, while Western aviation experts examining his account believed he misjudged a turn and subsequently invented a story of self-sacrifice.", "probable_cause": "In-flight collision with a Soviet Sukhoi Su-15 fighter in unknown circumstances. "}