{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-60-duke-carp-lake-5-killed", "date": "Dec 14, 1985 at 1538 LT", "type": "Beechcraft 60 Duke", "operator": "Commander Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Pontiac – Pellston", "msn": "P-329", "yom": 1975, "flight_number": null, "city": "Carp Lake", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 910, "captain_hours_type": 9, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2684, "circumstances": "During arrival, the pilot reported a problem with his #1 nav, but said he would try to make an ILS approach. He said he would return to Pontiac, if his ILS did not work. ARTCC cleared him for the ILS runway 32 approach and instructed him to contact Pellston radio (FSS). At 1525, he called the FSS and reported he was 20 miles south. At approximately 1534, the FSS specialist heard an aircraft fly over, but did not know if it was N24RT. He asked the pilot if he was making a missed approach. The pilot gave a negative reply and reported he was picking up the glide slope, then said he was having trouble with his #1 nav. A witness about 6 miles north and west of the airport saw the aircraft on a northerly heading at about 200 feet agl. About one minute later, the aircraft collided with trees, crashed and burned approximately 8 miles from the airport at an approximately elevation of 900 feet. The airport elevation was 720 feet. The nav equipment was too badly damaged during the accident to be tested. According to the aircraft radio log, the last VOR check was on 9/10/83. The pilot had logged 5.4 hours of instrument time during the previous 6 months, but had not logged any approaches. All five occupants were killed.  ", "probable_cause": "Occurrence #1: in flight collision with object\r\nPhase of operation: approach\r\nFindings\r\n1. (f) comm/nav equipment - erratic\r\n2. (f) operation with known deficiencies in equipment - continued - pilot in command\r\n3. (f) in-flight planning/decision - improper - pilot in command\r\n4. (f) lack of recent instrument time - pilot in command\r\n5. (f) weather condition - low ceiling\r\n6. (f) weather condition - snow\r\n7. (c) ifr procedure - not followed - pilot in command\r\n8. (c) missed approach - not performed - pilot in command\r\n9. (f) object - tree(s)\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled"}