{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-412f-halifax", "date": "Nov 7, 2018 at 0506 LT", "type": "Boeing 747-400", "operator": "SkyLease-Cargo.png", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago – Halifax", "msn": "28026/1105", "yom": 1997, "flight_number": "KYE4854", "city": "Halifax-Stanfield", "zone": "Nova Scotia", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 21134, "captain_hours_type": 166, "copilot_hours": 7404, "copilot_hours_type": 1239, "aircraft_hours": 92471, "circumstances": "The Sky Lease Cargo Boeing 747-412F aircraft (U.S. registration N908AR, serial number 28026) was conducting flight 4854 (KYE4854) from Chicago/O’Hare International Airport, Illinois, U.S., to Halifax/Stanfield International Airport, Nova Scotia, with 3 crew members, 1 passenger, and no cargo on board. The crew conducted the Runway 14 instrument landing system approach. When the aircraft was 1 minute and 21 seconds from the threshold, the crew realized that there was a tailwind; however, they did not recalculate the performance data to confirm that the landing distance available was still acceptable, likely because of the limited amount of time available before landing. The unexpected tailwind resulted in a greater landing distance required, but this distance did not exceed the length of the runway. The aircraft touched down firmly at approximately 0506 Atlantic Standard Time, during the hours of darkness. After the firm touchdown, for undetermined reasons, the engine No. 1 thrust lever was moved forward of the idle position, causing the speed brakes to retract and the autobrake system to disengage, increasing the distance required to bring the aircraft to a stop. In addition, the right crab angle (4.5°) on initial touchdown, combined with the crosswind component and asymmetric reverser selection, caused the aircraft to deviate to the right of the runway centreline. During the landing roll, the pilot monitoring’s attention was focused on the lateral drift and, as a result, the required callouts regarding the position of the deceleration devices were not made. Although manual brake application began 8 seconds after touchdown, maximum braking effort did not occur until 15 seconds later, when the aircraft was 800 feet from the end of the runway. At this position, it was not possible for the aircraft to stop on the runway and, 5 seconds later, the aircraft departed the end of the runway at a speed of 77 knots and came to a stop 270 m (885 feet) past the end. The aircraft struck the approach light stanchions and the localizer antenna array. The No. 2 engine detached from its pylon during the impact sequence and came to rest under the left horizontal stabilizer, causing a fire in the tail section following the impact. The emergency locator transmitter activated. Aircraft rescue and firefighting personnel responded. All 3 crew members received minor injuries and were taken to the hospital. The passenger was not injured. During the overrun, the aircraft crossed a significant drop of 2.8 m (9 feet) approximately 166 m (544 feet) past the end of the runway and was damaged beyond repair. ", "probable_cause": "Findings as to causes and contributing factors:\r\nThese are conditions, acts or safety deficiencies that were found to have caused or contributed to this occurrence.\r\n1. The ineffective presentation style and sequence of the NOTAMs available to the crew and flight dispatch led them to interpret that Runway 23 was not available for landing at Halifax/Stanfield International Airport.\r\n2. The crew was unaware that the aircraft did not meet the pre-departure landing weight requirements using flaps 25 for Runway 14.\r\n3. Due to the timing of the flight during the nighttime circadian trough and because the crew had had insufficient restorative sleep in the previous 24 hours, the crew was experiencing sleep-related fatigue that degraded their performance and cognitive functioning during the approach and landing.\r\n4. Using unfactored (actual) landing distance charts may have given the crew the impression that landing on Runway 14 would have had a considerable runway safety margin, influencing their decision to continue the landing in the presence of a tailwind.\r\n5. When planning the approach, the crew calculated a faster approach speed of reference speed + 10 knots instead of the recommended reference speed + 5 knots, because they misinterpreted that a wind additive was required for the existing conditions.\r\n6. New information regarding a change of active runway was not communicated by air traffic control directly to the crew, although it was contained within the automatic terminal information service broadcast; as a result, the crew continued to believe that the approach and landing to Runway 14 was the only option available.\r\n7. For the approach, the crew selected the typical flap setting of flaps 25 rather than flaps 30, because they believed they had a sufficient safety margin. This setting increased the landing distance required by 494 feet.\r\n8. The crew were operating in a cognitive context of fatigue and biases that encouraged anchoring to and confirming information that aligned with continuing the initial plan, increasing the likelihood that they would continue the approach.\r\n9. The crew recognized the presence of a tailwind on approach 1 minute and 21 seconds from the threshold; likely due to this limited amount of time, the crew did not recalculate the performance data to confirm that the runway safety margin was still acceptable.\r\n10. An elevated level of stress and workload on short final approach likely exacerbated the performance-impairing effects of fatigue to limit the crew’s ability to determine the effect of the tailwind, influencing their decision to continue the approach.\r\n11. The higher aircraft approach speed, the presence of a tailwind component, and the slight deviation above the glideslope increased the landing distance required to a distance greater than the runway length available.\r\n12. After the firm touchdown, for undetermined reasons, the engine No. 1 thrust lever was moved forward of the idle position, causing the speed brakes to retract and the autobrake system to disengage, increasing the distance required to bring the aircraft to a stop.\r\n13. The right crab angle (4.5°) on initial touchdown, combined with the crosswind component and asymmetric reverser selection, caused the aircraft to deviate to the right of the runway centreline.\r\n14. During the landing roll, the pilot monitoring’s attention was focused on the lateral drift and, as a result, the required callouts regarding the position of the deceleration devices were not made.\r\n15. The pilot flying focused on controlling the lateral deviation and, without the benefit of the landing rollout callouts, did not recognize that all of the deceleration devices were not fully deployed and that the autobrake was disengaged.\r\n16. Although manual brake application began 8 seconds after touchdown, maximum braking effort did not occur until 15 seconds later, when the aircraft was 800 feet from the end of the runway. At this position, it was not possible for the aircraft to stop on the runway and, 5 seconds later, the aircraft departed the end of the runway at a speed of 77 knots and came to a stop 270 m (885 feet) past the end of the runway.\r\n17. During the overrun, the aircraft crossed a significant drop of 2.8 m (9 feet) approximately 166 m (544 feet) past the end of the runway and was damaged beyond repair. While this uneven terrain was beyond the 150 m (492 feet) runway end safety area proposed by Transport Canada, it was within the recommended International Civil Aviation Organization runway end safety area of 300 m (984 feet).\n\r\nFindings as to risk:\r\nThese are conditions, unsafe acts or safety deficiencies that were found not to be a factor in this occurrence but could have adverse consequences in future occurrences.\r\n1. If the pilot monitoring does not call out approach conditions or approach speed increases, the pilot flying might not make corrections, increasing the risk of a runway overrun.\n\r\nOther findings:\r\nThese items could enhance safety, resolve an issue of controversy, or provide a data point for future safety studies.\r\n1. The investigation concluded that there was no reverted rubber hydroplaning and almost certainly no dynamic hydroplaning during this occurrence. \r\n2. Although viscous hydroplaning can be expected on all wet runways, the investigation found that when maximum braking effort was applied, the aircraft braking was consistent with the expected braking on Runway 14 under the existing wet runway conditions."}