{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-602p-mt-okanagan-4-killed", "date": "Dec 31, 2000 at 1205 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "Skyline Ranch Investment Company", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Salt Lake City – Penticton", "msn": "62-0862-8165003", "yom": 1981, "flight_number": null, "city": "Mt Okanagan", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 2500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3052, "circumstances": "The Piper Aerostar 602P aircraft, registration N88AT, serial number 62P08628165003, with the pilot, who was also the owner, three passengers, and two dogs on board, took off from the Salt Lake City Airport, Utah, on an instrument flight rules flight to Penticton, British Columbia. At 1149 Pacific standard time, the Kamloops/Castlegar sector controller of Vancouver Centre passed N88AT a special weather observation for Penticton: Awinds calm; visibility : mile in snow; sky obscured; vertical visibility 700 feet; remarks snow eight [8/8 of the sky covered]; temperature zero; 1900 [1100 Pacific standard time] altimeter [email protected] When approaching Penticton, the pilot requested the localizer distance-measuring equipment B (LOC DME-B) approach to runway 16. When the pilot confirmed that he could complete the procedure turn within 13 miles of the Penticton airport, the controller issued an approach clearance for the LOC DME-B approach, with a restriction to complete the procedure turn within 13 miles of the Penticton airport. This restriction was to prevent possible conflicts between N88AT and aircraft taking off or carrying out missed approaches from runway 15 at Kelowna. The pilot reported to the Penticton Flight Service Station at 1203 Pacific standard time that he was by the Penticton non-directional beacon (NDB) outbound on the localizer, and he was given the latest runway condition report. When the aircraft then failed to respond to numerous radio calls from the Penticton Flight Service Station and Vancouver Centre, search and rescue staff were notified and a search initiated. The wreckage was found two days later, near the summit of Okanagan Mountain, in a wooded area, at an elevation of about 5100 feet above sea level. There were no survivors. The aircraft was destroyed but did not catch fire.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. For reasons not determined, the pilot did not adhere to the procedures depicted for the LOC DME-B approach to runway 16 at Penticton. As a result, the aircraft did not remain within the confines of protected airspace, was below the minimum safe altitude for the procedure turn, and struck the tower.\r\nFindings as to Risk:\r\n1. The approach was flown in weather conditions that virtually precluded the pilot from completing a landing.\r\nOther Findings:\r\n1. The pilot's flight medical certificate had expired one month prior to the accident, and no information could be found that he had submitted to an FAA medical during that time."}