{"url": "https://www.baaa-acro.com/crash/crash-cessna-dmi-falcon-402-bazaruto-island", "date": "Jan 2, 2018 at 1145 LT", "type": "Cessna (DMI) Falcon 402", "operator": "HRH Holdings", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bazaruto Island - Vilanculos", "msn": "402B-0207", "yom": 1972, "flight_number": null, "city": "Bazaruto Island", "zone": "Inhambane", "country": "Mozambique", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3291, "captain_hours_type": 215, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1068, "circumstances": "The single engine airplane was departing Bazaruto Island on a flight to Vilanculos, carrying six passengers and one pilot. During the takeoff roll on runway 20, after a course of about 400 metres, the aircraft started to veer to the left, departed the runway despite successive attempt to correct the flight trajectory. The aircraft crashed into bushed and came to rest in the opposite direction of the takeoff, some 60 metres from the runway centerline. ", "probable_cause": "The most likely cause of this accident was human failure. The following contributing factors were identified:\r\n- The fact that the pilot has exceeded the aircraft's capacity from 8 (1+7) to 10 (1+9), associated with prevailing meteorological conditions, may have influenced the attitude of the aircraft during take-off.\r\n- The fact that the pilot did not properly follow the pre-flight procedures, given the hurry he showed at departure and being distracted at the time of the pre-flight inspection may have contributed to forgetting to remove the lock) of the Vertical Stabilizer.\r\n- The fact that the pilot probably did not remove the Lock of the Vertical Stabilizer caused it to remain fixed in its position and could not give the directional control to the aircraft."}