{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-5b-galaxy-dover-afb", "date": "Apr 3, 2006 at 0642 LT", "type": "Lockheed C-5 Galaxy", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dover – Ramstein – Koweït City", "msn": "500-0083", "yom": 1986, "flight_number": null, "city": "Dover AFB", "zone": "Delaware", "country": "United States of America", "region": "North America", "crew_on_board": 14, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine aircraft departed Dover AFB at 0621LT on a flight to Kuwait City with an intermediate stop at Ramstein Airbase, Germany, carrying 17 people, three passengers and 14 crew members. Ten minutes into the flight, the copilot informed ATC about technical problems and was cleared for an immediate return. On final approach to runway 32, the aircraft descended below the glide and impacted ground few hundred metres short of runway. It came to rest in a prairie, broken in three. All 17 occupants were injured. ", "probable_cause": "      Based on clear and convincing evidence, the Board President determined the primary cause of the mishap was the pilots' and flight engineers' failure to use the number three, fully operational, engine; the instructor's and primary flight engineer's failure to brief, and the pilots' failure to consider or utilize a 62.5 or 40% flap setting (instead of a 100% flap setting); and the pilots' attempt at a visual approach to runway 32, descending well below a normal glidepath for an instrument-aided approach or the normal VFR pattern altitude of 1,800 ft. There is substantial evidence that a contributing factor to this mishap was MP1's failure to give a complete approach briefing, in that, nonstandard factors, configuration, landing distance, and missed approach intentions were not addressed."}