{"url": "https://www.baaa-acro.com/crash/crash-antonov-12b-batagay", "date": "May 25, 1971 at 1301 LT", "type": "Antonov AN-12", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yakutsk - Batagay", "msn": "7 3 448 09", "yom": 1967, "flight_number": null, "city": "Batagay", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5532, "circumstances": "The airplane was completing a cargo flight from Yakutsk to Batagay, carrying a crew of six, two passengers and a load of pipes for a total weight of 11,350 kilos. Following an uneventful flight and approach, the crew completed the landing in good conditions. According to the crew and eyewitnesses, the touchdown was smooth about 74 meters past the runway threshold at a speed of 250 km/h. After a course of 105 meters, a loud sound was heard on the right side of the aircraft. While decelerating, the aircraft deviated to the right when, at a speed of 210 km/h, the engine n°4 struck the ground. The airplane veered off runway to the right, struck an earth mound then trees, pivoted on itself before coming to rest in flames 710 meters after the initial impact and 30 meters to the right of the runway. All eight occupants evacuated safely while the aircraft was damaged beyond repair. ", "probable_cause": "The right main landing gear leg broke shortly after touchdown, probably due to fatigue fracture. Investigations were unable to accurately define the landing parameters because the aircraft was not equipped with the latest generation of FDR systems. The failure of the right main gear could be explained by a prolonged operation of the aircraft under very low temperatures with a large number of landings completed with a total weight at the limit of tolerances. Also, the fact that the flaps were deployed at 25° upon landing resulted in a speed increase of approximately 20 km/h compared to a landing configuration with flaps extended at 35°, which could also be considered as a contributing factor."}