{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-dillingham-5-killed", "date": "Jul 30, 1992 at 1100 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Bristol%20Bay%20Lodge", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Bristol Bay Lodge - Togiak River", "msn": "900", "yom": 1956, "flight_number": null, "city": "Dillingham", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 8842, "captain_hours_type": 550, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7892, "circumstances": "The destination camp is located about 50 miles southwest of the departure lodge, and is separated by mountains with some peaks over 4,000 feet asl. The general area weather included low ceilings. The operator stated that shortly before the accident he observed the youth creek weather 'better than 400 feet...', and told the pilot that it appeared good enough to make the flight. The pilot stated that as he flew up youth creek he could see that the pass was closed by low clouds and attempted to reverse direction. The pilot stated he 'made a hard steep turn, and the airplane stalled...' the pilot said the weather was about 800 feet ceiling and visibility of 1 mile. When the pilot was admitted into the hospital immediately following the accident, he was diagnosed as having an insulin dependent diabetic condition. His medical records contain no evidence of, and the pilot denied any knowledge of, any pre-accident diabetic condition. Five passengers were killed while the pilot and a passenger were seriously injured. A day later, the survivor passenger died from his injuries. ", "probable_cause": "The pilot's delayed decision in reversing course and his failure to maintain airspeed during the maneuver. Factors related to the accident were: mountainous terrain and a low ceiling."}