{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90gt-king-air-paraty-5-killed", "date": "Jan 19, 2017 at 1244 LT", "type": "Beechcraft 90 King Air", "operator": "Hotel-Emiliano.png", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Campo de Marte - Paraty", "msn": "LJ-1809", "yom": 2007, "flight_number": null, "city": "Paraty", "zone": "Rio de Janeiro", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 7464, "captain_hours_type": 2924, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Campo de Marte Airport at 1301LT bound for Paraty. With a distance of about 200 km, the flight should take half an hour. The approach to Paraty Airport was completed in poor weather conditions with heavy rain falls reducing the visibility to 1,500 metres. While descending to Paraty, the pilot lost visual contact with the airport and initiated a go-around. Few minutes later, while completing a second approach, he lost visual references with the environement then lost control of the aircraft that crashed in the sea near the island of Rasa, about 4 km short of runway 28. Quickly on site, rescuers found a passenger alive but it was impossible to enter the cabin that was submerged. The aircraft quickly sank by a depth of few metres and all five occupants were killed, among them Carlos Alberto, founder of Hotel Emiliano and the Supreme Court Justice Teori Zavascki who had a central role overseeing a massive corruption investigation about the Brazilian oil Group Petrobras.", "probable_cause": "Contributing factors:\r\n- Adverse meteorological conditions - a contributor\r\nAt the moment of the impact of the aircraft, there was rain with rainfall potential of 25mm/h, covering the Paraty Bay region, and the horizontal visibility was 1,500m. Such horizontal visibility was below the minimum required for VFR landing and take-off operations. Since the SDTK aerodrome allowed only operations under VFR flight rules, the weather conditions proved to be impeding the operation within the required minimum safety limits.\r\n- Decision-making process - a contributor\r\nThe weather conditions present in SDTK resulted in visibility restrictions that were impeding flight under VFR rules. In this context, the accomplishment of two attempts to approach and land procedures denoted an inadequate evaluation of the minimum conditions required for the operation at the Aerodrome.\r\n- Disorientation - undetermined\r\nThe conditions of low visibility, of low height curve on the water, added to the pilot stress and also to the conditions of the wreckage, which did not show any fault that could have compromised the performance and/or controllability of the aircraft, indicate that the pilot most likely had a spatial disorientation that caused the loss of control of the aircraft. \r\n- Emotional state - undetermined\r\nThrough the analysis of voice, speech and language parameters, variations in the emotional state of the pilot were identified that showed evidence of stress in the final moments of the flight. The pilot's high level of anxiety may have influenced his decision to make another attempt of landing even under adverse weather conditions and may have contributed to his disorientation.\r\n- Tasks characteristics - undetermined\r\nThe operations in Paraty, RJ, demanded that pilots adapt to the routine of the operators, which was characteristic of the executive aviation. In addition, among operators, possibly because of the lack of minimum operational requirements in SDTK, the pilots who landed even in adverse weather conditions were recognized and valued by the others. Although there were no indications of external pressure on the part of the operator, these characteristics present in the operation in Paraty, RJ, may have favored the pilot's self-imposed pressure, leading him to operate with reduced safety margins.\r\n- Visual illusions - undetermined\r\nThe flight conditions faced by the pilot favored the occurrence of the vestibular illusion due to the excess of \"G\" and the visual illusion of homogeneous terrain. Such illusions probably had, consequently, the pilot's sense that the bank angle was decreasing and that he was at a height above the real. These sensations may have led the pilot to erroneously correct the conditions he was experiencing. Thus, the great bank angle and the downward movement, observed at the moment of the impact of the aircraft, are probably a consequence of the phenomena of illusions.\r\n- Work-group culture - a contributor\r\nAmong the members of the pilot group that performed routine flights to the region of Paraty, RJ, there was a culture of recognition and appreciation of those operating under adverse conditions, to the detriment of the requirements established for the VFR operation. These shared values promoted the adherence to informal practices and interfered in the perception and the adequate analysis of the risks present in the operation in SDTK."}