{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-200-near-pudasjarvi", "date": "Feb 5, 1973 at 1004 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Kar-Air-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Oulu - Kuusamo", "msn": "166", "yom": 1968, "flight_number": "KR482", "city": "Pudasjärvi", "zone": "Northern Ostrobothnia", "country": "Finland", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 15, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3128, "circumstances": "Kar-Air flight KR482 took off from Oulu Airport, Finland on a scheduled domestic service to Kuusamo. The aircraft climbed to FL70 and initially flew above the cloud layer. Before the aircraft started descent, it had been informed on the radio of the prevailing weather at Kuusamo Airport: surface wind 160°, 6 KT occasionally 10 KT, visibility 10 km, clouds 8/8 1000 feet, temperature -7°C, QNH 989 mb. After the aircraft had left its cruising level at approximately 07:24 GMT it entered icing conditions in clouds between 6000 and 5000 feet. When approaching 3000 feet, the right engine of the aircraft suddenly lost its power. The crew immediately feathered the right-hand propeller, changed to single-engine flight and turned back in the direction of Oulu while informing Kuusamo Airport ATC about the incident. Kuusamo ATC cleared the aircraft to FL 60 for the return flight to Oulu. The crew reported that the flight back to Oulu would last one hour and at the same time stated that the climbing performance of the aircraft did not permit a climb to the planned FL 60. The crew asked for FL 30 as its flight altitude and was cleared to that level by the ATC. After the engine failure the pilot-in-command had intended to climb to FL 60, where flight in clear air and without the danger of icing had been possible. Because of the icing of the aircraft, its climbing performance when flying on one engine had, however, not been sufficient for a climb to FL 60. The aircraft had been able to climb about 700 feet to reach an altitude of appr. 3700 feet but was incapable of increasing the altitude above that level. The aircraft had continued its flight in the direction of Oulu but began to continually lose altitude because of increased icing in spite of the engine power being used in the left engine exceeding the maximum continuous thrust values. The aircraft had at the end of the flight been given an estimation of the altitude of the prevailing cloudbase in the region, which was reported to be 300-500 feet. As the loss of height continued, the crew had hoped that they would get below the cloudbase and the ice formed on the aircraft would fall off or that they would be able to make a landing in the terrain choosing a suitable place for emergency landing. However, the weather in the region had been such that there was practically no clearance between the clouds and the terrain. The aircraft had lost so much height by the time it had arrived at the area of Naamanka village in Pudasjarvi parish that the first landmark the co-pilot had seen had been a trigonometric tower which the aircraft passed over by only a few metres. About three kilometres after the passing of the tower, while the pilot-in-command was trying to pick out a landing place and having difficulties to control the aircraft, it had at 08:04 GMT struck the trees and hit the ground in a swampy, sparsely wooded area 5 km north of Linattijarvi. As a result of the impact three persons were quite badly injured while the others received only minor injuries, contusions, and bruises, and the aircraft was destroyed beyond repair.\r\nSource: ASN", "probable_cause": "The main reason for the aircraft accident has been the sudden breakdown of the turbine of the right engine so that the engine has lost its power and flight on one engine in icing conditions has become inevitable. The icing on the wet surfaces of the aircraft which lacked de-icing and anti-icing equipment and the consequent deterioration in the performance of the aircraft was decisively contributory to the accident. The performance of the aircraft when flying on one engine has been insufficient after the icing had taken place considering the weight of the aircraft at the time of the accident."}