{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-fort-myers-2-killed", "date": "Jun 26, 2003 at 1251 LT", "type": "Cessna 414 Chancellor", "operator": "Osprey Air Services", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "West Palm Beach – Fort Myers", "msn": "414-0049", "yom": 1970, "flight_number": null, "city": "Fort Myers", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 972, "captain_hours_type": 1, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1710, "circumstances": "The pilot reported visually checking the main fuel tanks during his preflight inspection of the airplane and later reported there was enough fuel for the intended flight which would be less than 1 hour, plus a 45-minute reserve amount of fuel. He estimated the fuel level in the main fuel tanks was 2-3 inches from the top. He also reported that before the accident flight he had never flown the accident make and model airplane, and that he had not had any flight training in the airplane. The passengers were boarded, the flight departed and climbed to between 4,500 and 6,500 feet msl. He leaned the mixture during cruise, and the flight continued. He began descending when the flight was 12 miles from the destination airport, and he performed the pre landing checks when the flight was 3 miles from the destination airport. The flight entered left downwind where he lowered the landing gear and turned on the fuel pumps. When abeam the landing point he reduced power, lowered the flaps 10 degrees, and turned onto base leg. During the base leg while rolling out of the turn and flying at 600 feet, \"the right engine suddenly came to a stop....\" He banked to the left to maintain zero sideslip, pushed the mixture, propeller, and throttle controls full forward, and identified the right engine had failed. He reportedly pulled the right propeller control to the feather position but during the postaccident investigation, the right propeller blades were not in the feather position and there was no evidence of preimpact failure or malfunction of the propeller. The pilot further reported that while pulling the right propeller control to the feather position, the airplane, \"began to yaw right and simultaneously bank right....\" He moved the left throttle control to idle, and they were on the ground in a span of 6 seconds from the time the right engine quit. No fuel leakage was noted at the scene, and no fuel contamination was noted in a nearby pond. Additionally, only residual fuel was noted in the fuel lines in each engine compartment. A total of 4.0 and 1.5 gallons of fuel were drained from the left and right auxiliary fuel tanks, respectively. No evidence of preimpact flight control failure or malfunction was noted. Neither propeller was at or near the feather range at the time of impact. Both engines were removed from the airplane, placed on a test stand with a \"club\" propeller, and both engines were noted to operate normally during the engine run. Examination of the right seat in the third row of the airplane revealed the seat frame was bent down on the left side, and all seat feet were in position but distorted; no fracture of the seat feet were noted. Examination of the seat of the  passenger who sustained minor injuries (left seat in the third row) revealed the seatpan was compressed down, and the lapbelt was unbuckled. The inboard arm rest was bent inward, and the outboard arm rest was bent outward. The seat frame indicated displacement to the left. The seat back was twisted counter clockwise, and the left forward seat foot was in place. The seat and attach structure was certificated for a maximum forward g loading of 9 g's, and a maximum sideward g loading of 1.5 g's. This does not include a 1.33 margin of safety factor. The seat and attach structure was tested to ultimate loads in a combined forward, sideward, and upward directions in accordance with CAR 3.390-2. The same loads were also applied in a downward direction by itself. The empennage was separated just aft of the aft pressure bulkhead but remained secured by flight control cables. According to personnel from the airplane manufacturer, the tested load (150 percent limit) for the empennage in negative shear translates to 14.0 g loading. Based on Cessna Engineering rough calculations, they believe the empennage is capable of sustaining an additional 30 percent beyond what it was tested to, or an estimated 18.2 g's in negative shear loading.", "probable_cause": "The failure of the pilot to maintain airspeed (Vs) following a total loss of engine power from the right engine due to fuel starvation, resulting in an inadvertent stall, uncontrolled descent, and in-flight collision with trees and terrain. Factors in the accident was the failure pilot to feather the right propeller following the total loss of engine power, and his lack of total experience in the accident make/model of aircraft."}