{"url": "https://www.baaa-acro.com/crash/crash-pac-cresco-08-600-near-gisborne-1-killed", "date": "Jun 14, 2001 at 1145 LT", "type": "PAC Cresco 08-600 (08-750)", "operator": "Fieldair", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": null, "msn": "012", "yom": 1996, "flight_number": null, "city": "Gisborne", "zone": "Gisborne District Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7300, "captain_hours_type": 261, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5466, "circumstances": "On 13 June 2001, Cresco ZK-TMO arrived at Te Aroha Station, 25 km west of Gisborne, to carry out topdressing of that property. Before operations started, the property owner briefed the pilot,  and two observation flights over the areas to be sown were made. The owner also cautioned the pilot against turning left after take-off from the airstrip. Spreading commenced at 1600 hours, and 14 flights with 1800 kg loads were completed that day. The loader driver reported that no difficulties were experienced during those operations. Spreading recommenced at 0720 hours on 14 June 2001, again with 1800 kg loads, in an area to the left (east) of the airstrip. On the third flight after a refuel later in the morning, the loader driver noticed that the pilot made a partial load jettison after take-off; this resulted in a reduced duration of that sortie. However, on return, the pilot did not indicate to the loader driver that he required a reduced load. About 1145 hours, the aircraft was reloaded and commenced take-off. The loader driver watched about half the take-off roll, then continued preparing for the next load. He did not sight the aircraft again before a  pall of black smoke attracted his attention. After making a radio call to the aircraft and hearing no response, the loader driver ran towards the smoke, which was to the left of and below the elevated strip. On reaching the site he found the aircraft inverted in a small stream and burning fiercely. The loader driver could see the pilot inside the aircraft but he and the property owner were unable to reach him because of the intense heat of the fire. The accident occurred in daylight, at approximately 1145 hours NZST, at Te Aroha Station; latitude S 38° 38.0' longitude E 177° 41.8', at an elevation of approximately 770 feet.", "probable_cause": "The following findings were identified:\r\n- The pilot was appropriately licensed, rated and fit for the flights being undertaken.\r\n- The aircraft had a valid airworthiness certificate and had been maintained in accordance with current requirements.\r\n- No pre-accident defect was found with the aircraft.\r\n- The pilot had turned left after take-off from the strip, against the advice of the property owner.\r\n- The advice was given in light of a previous accident in virtually identical circumstances. \r\n- There was insufficient space available after take-off for the aeroplane to accelerate to a speed at which the bank angle necessary to clear the terrain could be sustained in level flight or a climb.\r\n- The accident was not survivable. "}