{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-188af-electra-chalkhill-4-killed", "date": "May 30, 1984 at 0144 LT", "type": "Lockheed L-188 Electra", "operator": "Zantop_0", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Baltimore - Detroit", "msn": "1034", "yom": 1959, "flight_number": "VK931", "city": "Chalkhill", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 10047, "captain_hours_type": 7173, "copilot_hours": 3534, "copilot_hours_type": 2558, "aircraft_hours": 35668, "circumstances": "Zantop ground personnel completed the loading of Flight 931 at 00:40. All cargo was bulk loaded and tied down on the right side of the airplane for the full length of the cargo compartment. Flight 931 departed the gate at Baltimore/Washington International Airport at 01:05 and took off on runway 28 at 01:10. At 01:11:42, Flight 931 contacted Baltimore departure control and was cleared to 13,000 feet. After switching to Washington ARTCC, the flight was cleared further FL220. At 01:32 a no. 2 gyro malfunction made the crew select the no. 1 gyro to drive both approach horizons and the problem appeared resolved. At 01:43:09, Cleveland ARTCC cleared Flight 931 direct to the Dryer VOR. After the turn to the Dryer VOR, the first officer’s approach horizon may have displayed incorrect pitch and roll information. The flightcrew may have received conflicting pitch and roll information from the two approach horizons as they attempted to recover from an unusual attitude. The flightcrew overstressed the airplane in an attempt to recover from the unusual attitude as the aircraft spiralled down. The Electra broke up and falling wreckage damaged some houses; however, most of the wreckage fell in uninhabited, wooded areas.", "probable_cause": "The aircraft's entry into an unusual attitude and the inability of the flight crew to analyse the flight condition before there was a complete loss of control. Although the precise reason for the loss of control was not identified, an undetermined failure of a component in the No.2 vertical gyro system, perhaps involving the amplifier and associated circuitry, probably contributed to the cause of the accident by incorrectly processing data to the co-pilot's approach horizon. The in-flight structural failure of the aircraft was due to overload."}