{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-33a-surabaya", "date": "Feb 21, 2007 at 1525 LT", "type": "Boeing 737-300", "operator": "Adamair_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jakarta - Surabaya", "msn": "27284/2606", "yom": 1994, "flight_number": "DHI172", "city": "Surabaya-Juanda", "zone": "East Java", "country": "Indonesia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 148, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 37936, "circumstances": "The aircraft was on a scheduled passenger flight from Soekarno-Hatta Airport, Jakarta to Juanda Airport, Surabaya, East Java. There were 155 persons on board, consist of 7 crew and 148 passengers. During the flight there was no abnormality declare by the flight crew. Weather condition at Surabaya was thunderstorm and rain, wind 240/7 knots with visibility 8,000 meters. The CVR revealed that there was conversation in the cockpit that was not related to the progress of the flight, the conversation was relating to the company fuel policy and training program until 2000 feet. The CVR did not reveal approach briefing and any checklist reading. On final approach of runway 28 passing 800 feet approach light insight and landing clearance was received. Prior to touchdown, control of the aircraft was transferred from co-pilot to PIC. The CVR recorded that the Ground Proximity Warning Systems (GPWS) warned “Sink Rate” and “Pull Up”. The right wheel track was found out of the runway for about 4 meter away and return to the runway. The aircraft stopped for about 100 meters from taxiway N3. After aircraft touched down, the fuselage aft of passenger seat row 16 was bended down. The passengers were panic. Flight attendants evacuated the passengers via all exits available and door slides were inflated. The two passengers were minor injured, and the aircraft suffered severe damage. ", "probable_cause": "From the findings, it is concluded that the aircraft experienced excessive sink rate upon the touch-down. The aircraft was in unstable approach even at below 200 feet. The high vertical acceleration caused severe damage to the aircraft structure. The flight crew did not comply to several procedures published by the Boeing company. The flight crew did not respond to the GPWS alert and warnings. "}