{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-taunton-1-killed", "date": "Jul 14, 1988 at 1929 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Vadala Management Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Beverly - Taunton", "msn": "421C-0079", "yom": 1976, "flight_number": null, "city": "Taunton", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 780, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Before reaching his descent, the pilot advised approach control that his right engine was 'blowing some smoke' and losing oil pressure. Vectors were provided for a visual approach, but there were low clouds in the area and visibility was restricted due to haze. After reaching the vicinity of the airport, the pilot said it was in sight and he was entering a downwind for runway 30. Witnesses saw the aircraft on a left downwind, but said the aircraft overshot the 1st turn to final approach. Subsequently, while maneuvering to land, the aircraft crashed approximately 2,500 feet northeast of the runway in a wooded area. Witnesses agreed the aircraft was slow and in a steep right turn with the gear extended before it crashed in a steep descent and burned. An examination revealed evidence the starter on the right engine had backed off; 3 starter bolts had fractured thru the threaded area with signs of fatigue cracking; wear marks on the starter gear and engine gear ring indicated the starter motor had shifted aprx 3/4' rearward. Also, there was evidence the torsional damper was loose on its shaft before the accident and that both props were operating at low pitch during initial impact.", "probable_cause": "Occurrence #1: loss of engine power (partial) - mech failure/malf\r\nPhase of operation: cruise\r\nFindings\r\n1. 1 engine\r\n2. (f) engine accessories - fatigue\r\n3. (f) engine accessories, engine starter - loose\r\n4. (f) lubricating system, oil seal - loss, partial\r\n5. (f) fluid, oil - leak\r\n----------\r\nOccurrence #2: loss of control - in flight\r\nPhase of operation: maneuvering\r\nFindings\r\n6. (f) propeller feathering - not performed - pilot in command\r\n7. (f) planned approach - improper - pilot in command\r\n8. (c) airspeed (vmc) - not maintained - pilot in command\r\n9. (c) aircraft control - not maintained - pilot in command\r\n----------\r\nOccurrence #3: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled"}