{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-321b-pago-pago-97-killed", "date": "Jan 30, 1974 at 2341 LT", "type": "Boeing 707", "operator": "Pan%20Am.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Auckland - Pago Pago - Honolulu - Los Angeles", "msn": "19376/661", "yom": 1967, "flight_number": "PA806", "city": "Pago Pago", "zone": "All American Samoa", "country": "American Samoa", "region": "Oceania", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 91, "pax_fatalities": 87, "other_fatalities": 0, "total_fatalities": 97, "captain_hours": 17414, "captain_hours_type": 7416, "copilot_hours": 5107, "copilot_hours_type": 5107, "aircraft_hours": 21625, "circumstances": "On January 30, 1974, Pan Am Flight 806, Boeing 707-321B 'Clipper Radiant' operated as a scheduled flight from Auckland, New Zealand, to Los Angeles, California. En route stops included Pago Pago, American Samoa, and Honolulu, Hawaii. Flight 806 departed Auckland at 2014. It was cleared to Pago Pago on an IFR flight plan. At 2311, Flight 806 contacted Pago Pago Approach Control and reported its position 160 miles south of the Pago Pago airport. Approach control responded, \"Clipper eight zero six, roger, and Pago weather, estimated ceiling one thousand six hundred broken, four thousand broken, the visibility - correction, one thousand overcast. The visibility one zero, light rain shower, temperature seven eight, wind three five zero degrees, one five, and altimeter's two nine eight five.\" At 2313, Pago Pago Approach Control cleared the flight to the Pago Pago VORTAC. Flight 806 reported leaving FL330 three minutes later and leaving FL200 at 2324. Pago Pago Approach Control cleared the flight at 2324: \"Clipper eight zero six, you're cleared-for the ILS DME runway five approach - via the two zero mile arc south-southwest. Report the arc, and leaving five thousand.\" At 2333, the flight requested the direction and velocity of the Pago Pago winds and was told that they were 360 degrees variable from 020 degrees at 10 to 15 knots. At 2334, the flight reported out of 5,500 feet and that they had intercepted the 226 degree radial of the Pago Pago VOR. The approach controller responded, \"Eight oh six, right. Understand inbound on the localizer. Report about three out. No other reported traffic. Winds zero one zero degrees at one five gusting two zero.\" At 2338, approach control said, \"Clipper eight oh six, appears that we've had power failure at the airport. \" The first officer replied, \"Eight oh six, we're still getting your VOR, the ILS and the lights are showing.\" Approach control then asked, \"See the runway lights?\" The flight responded, \"That's Charlie.\" The approach controller then said, \" ...we have a bad rain shower here. I can't see them from my position here.\" \"We're five DME now and they still look bright,\" the first officer responded. Approach Control replied, \"´kay, no other reported traffic. The wind is zero three zero degrees at two zero, gusting two five. Advise clear of the runway.\" At 23:39:41, the flight replied, \"Eight zero six, wilco.\" This was the last radio transmission from the flight. On the flight deck the windshield wipers were turned on and the flaps were set at the 50° position, which completed the checklists for landing. At 23:40:22, the first officer stated, \"You're a little high.\" The radio altimeter warning tone then sounded twice and the first officer said \"You're at minimums.\" He reported the field in sight and said that they were at 140 kts. At 23:40:42, the aircraft crashed into trees at an elevation of 113 feet, and about 3,865 feet short of the runway threshold. The first impact with the ground was about 236 feet farther along the crash path. The aircraft continued through the jungle vegetation, struck a 3-foot-high lava rock wall, and stopped about 3,090 feet from the runway threshold. Of the 101 occupants of the aircraft, 9 passengers and 1 crew member survived the crash and fire. One passenger died the next day; the crew member and three passengers died 3 days after the accident. One passenger died of his injuries 9 days after the accident. Thus only four passengers survived the crash. ", "probable_cause": "The flight crew's late recognition, and failure to correct in a timely manner, an excessive descent rate which developed as a result of the aircraft's penetration through destabilizing wind changes. The winds consisted of horizontal and vertical components produced by a heavy rainstorm and influenced by uneven terrain close to the aircraft's approach path. The captain's recognition was hampered by restricted visibility, the illusory effects of a \"black hole\" approach, inadequate monitoring of flight instruments, and the failure of the crew to call out descent rate during the last 15 seconds of flight."}