{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-southend", "date": "Oct 4, 1974 at 2001 LT", "type": "Douglas DC-6", "operator": "Delta%20Air%20Transport", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Southend - Antwerp", "msn": "43830/352", "yom": 1953, "flight_number": null, "city": "Southend-on-Sea", "zone": "Essex", "country": "United Kingdom", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 99, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 21000, "captain_hours_type": 2000, "copilot_hours": 12000, "copilot_hours_type": 3000, "aircraft_hours": 43017, "circumstances": "The aircraft landed at Southend (SEN) from Antwerp (ANR) at 07:50 hrs on a day excursion. Following a 9 hour rest period, the crew reported for duty at 18:30 to prepare for the return flight. Start up and taxiing out were normal, and a limited power check was completed before takeoff. The Captain, had given a full pre-takeoff briefing before the aircraft left Antwerp that morning, and on this occasion only called for a 'standard briefing', but emphasized that the full abort procedures would be as given during his previous instruction. The First Officer was handling the aircraft from the right hand seat, and gave a shortened takeoff briefing which included the actions required for engine failure before and after V1. Both pilots were wearing headsets, (not fitted with boom microphones) but were not using these for flight deck intercommunication purposes; the Flight Engineer was not wearing a headset. The Captain, who controlled the only source of nose-wheel steering, lined up the aircraft at the beginning of runway 24. Brakes were released and, after stabilizing all four engines at 30 inches of manifold pressure, the First Officer advanced all the right hand throttle levers to takeoff power. The Flight Engineer followed this movement with his left hand on the left-hand group of throttle levers and, when takeoff power was achieved, held the throttle friction lever with his right hand. The captain 's left hand was on the nose steering wheel. At about 75-80 knots, shortly before V1, the captain instructed the Flight Engineer to adjust the power on engines 1 and 2 which were overboosting slightly. The Flight Engineer made this adjustment coincident with the captain calling V1 at about 88 knots, and very shortly afterwards the captain saw the red 'gear unsafe' warning light illuminate. Unknown to the captain or the First Officer the Flight Engineer had made an UP selection of the landing gear selector lever. He stated subsequently that he thought the captain had instructed him to do so shortly after calling V1. The pilots maintain that no such order was given and that nothing additional to the normal procedural calls was said by either of them. The aircraft subsided on to its nose and its propellers struck the runway; throttles were closed and the captain attempted to maintain directional control by use of rudder. The aircraft came to rest 3 metres from the end of the runway with its nose on the ground and with the main landing gear still extended. As soon as the aircraft came to rest the Flight Engineer, having closed the mixture controls to idle cut off and pulled the 'ganged switches' bar, left the aircraft through the right front exit door. On seeing exhaust fires in Nos. 2 and 3 engines he returned to the flight deck and carried out the appropriate engine fire drills. However Nor 3 engine continued to burn, and he extinguished this fire with a portable CO2 appliance. During this period, evacuation drills were initiated, and the passengers left the aircraft in an expeditious and reasonably orderly manner, mostly through the front exit, but some by chute from the rear exit, and a few from an overwing emergency exit.", "probable_cause": "The accident was caused by the Flight Engineer's action in selecting landing gear UP before the aircraft was airborne. He did this in the mistaken belief that the Captain had ordered him to do so."}