{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-440-0-metropolitan-bremen-46-killed", "date": "Jan 28, 1966 at 1750 LT", "type": "Convair CV-440 Metropolitan", "operator": "Lufthansa-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Frankfurt - Bremen - Hamburg", "msn": "464", "yom": 1958, "flight_number": "LH005", "city": "Bremen-Neuenland", "zone": "Bremen", "country": "Germany", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 42, "pax_fatalities": 42, "other_fatalities": 0, "total_fatalities": 46, "captain_hours": 5093, "captain_hours_type": 1187, "copilot_hours": 793, "copilot_hours_type": 533, "aircraft_hours": 13871, "circumstances": "The aircraft was operating a scheduled service of Deutsche Lufthansa on the route Frankfurt - Bremen - Hamburg under flight number LH 005. Scheduled time of departure in Frankfurt: 1625 hours GMT, scheduled time of arrival at Bremen: 1745 hours GMT. Actually, the aircraft took off at 1641 hours GMT. The last phase of the flight can be roughly reconstructed from the tape recordings, the evidence given by the witnesses and the position of the wreckage as follows: \r\n17.41 GMT Descending from flight level 60 and clearance for ILS approach to runway 27 at Bremen. \r\n17.44 GMT Passing of radio beacon Bremen outbound. \r\n17.48 GMT Passing of radio beacon Bremen inbound on final approach. \r\n17.49.37 GMT The aircraft was seen for the first time by witnesses about 1 000 m approximately before the threshold of runway 27 near the middle marker; later it was observed by the control tower with its landing gear extended and the landing lights turned on. \r\n17.50.15 GMT About 1 200 m after the threshold of runway 27, close to the intersec- approximately tion of runways 27/09 and 32/14, the aircraft went round again at an altitude of about 30 ft above ground with a compass course of about 2700. \r\n17.50.40 GMT With a pitch of about 300 to 600 and the left wing forward the aircraft approximately crashed on the ground in the opposite direction to runway 27, about 385 m west of the end of runway 27 and about 380 m south of the runway centre line. \r\nThe aircraft was totally destroyed and none of the 46 occupants survived. ", "probable_cause": "While approaching to land, the aircraft overshot and stalled during the execution of the missed approach. The overshoot on approach to land was probably caused by the fact that - possibly on account of a malfunction of one of the flight director instruments - the pilot was not in a position to remain on the glide path and that he made a wrong assessment of the height above ground after transition to visual flight. The stall was probably induced by wrong activation of controls. Such activation was possibly caused by sudden occurrence of a physical disorder of one of the pilots. After the aircraft had stalled, the pilot could not control the further progress of the flight on account of the rather poor stall performance of the aircraft type, the extraordinary difficulties to control a stall during instrument flight conditions, and the insufficient height available for transition from stall to a normal attitude after the aircraft had sheared off. Other factors may have contributed to the accident, such as: \r\n- Insufficient engine power, \r\n- Insufficient altitude to recovery,\r\n- Inadequate pitch,\r\n- Unfavorable weather conditions. "}