{"url": "https://www.baaa-acro.com/crash/crash-antonov-26-100-talodi-32-killed", "date": "Aug 19, 2012 at 0800 LT", "type": "Antonov AN-26", "operator": "Alfa-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Government", "survivors": "No", "site": "Mountains", "schedule": "Khartoum - Talodi", "msn": "26 06", "yom": 1975, "flight_number": null, "city": "Talodi", "zone": "South Kordofan (جنوب كردفان)", "country": "Sudan", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 26, "pax_fatalities": 26, "other_fatalities": 0, "total_fatalities": 32, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was performing a flight from Khartoum to Talodi with a delegation of 26 members of the Sudanese Government, among them several Ministers, Generals and politicians. On approach to Talodi Airport in poor weather conditions due to a sand storm, the crew initiated a go-around procedure when the aircraft impacted the slope of Mt Hagar al Nar (244 metres high) located 1,500 metres south of the airport. The aircraft was destroyed by impact forces and a post crash fire and all 32 occupants were killed.\r\nThe official list of the passengers and crew, all of whom died in the crash, is as follows:\r\nGuidance and Religious Endowments Minister Ghazi al-Sadiq Abdel Rahim,\r\nJustice Party chairman Makki Ali Balayil,\r\nState minister at the Youth and Sports Ministry Mahjub Abdel Rahim Tutu,\r\nState minister at the Ministry of Tourism, Antiquities and Wildlife Issa Daifallah,\r\nMaj. Gen. Salah Ismail – Air Forces\r\nMaj. Gen. Ahmed Musa Ahmed – the Police Forces\r\nMaj. Gen. Ahmed Al-Tayeb Abu-Guroon – Security and Intelligence Organ\r\nBrigadier Lugman Omer – Second Commander of the People's Defence Forces\r\nAl-Saddiq Abdul-Majid Al-Makkawi – the People's Defence Forces\r\nAwadal-Karim Siral-Khatim – Deputy Coordinator of the People's Defence Forces\r\nWaeez Salaha Omer – Headquarters of the People's Defence Forces\r\nOmer Mahjoub Ahmed – Deputy Coordinator of the People's Defence Forces\r\nSalah-Eddin Mustafa – People's Defence Forces – Jabal Aulia Locality\r\nSeveral officials from Khartoum (including Hamid Al-Aghbash – the National Assembly)\r\nFive media representatives\r\nSix crew members.", "probable_cause": "Despite the fact that rebels announced officially two days later they shot down the aircraft, the Sudanese Government confirmed that visibility was low at the time of the accident with clouds at low height and poor weather conditions. As a result, officials said the accident was the consequence of a controlled flight into terrain (CFIT) after the crew descended too low on final. "}