{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-novoternovskiy-2-killed", "date": "Jun 7, 2008 at 0950 LT", "type": "PZL-Mielec AN-2", "operator": "Vassili Sklyar", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Plain, Valley", "schedule": null, "msn": "1G193-38", "yom": 1981, "flight_number": null, "city": "Novoternovskiy", "zone": "Stavropol Krai", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "In the early morning, the crew took off with this aircraft that was not airworthy for a survey mission (fire fighting). The crew did not file any flight plan and continued the mission without any contact with ATC. Approaching Novoternovskiy, weather conditions worsened and the horizontal visibility dropped to 10 metres due to thick fog. The crew reduced his altitude to 5 metres in an attempt to establish a visual contact with the ground when the pilot saw a the structure of an irrigation complex. At a height of 5 metres, he made a steep turn to the left at an angle of 45° to avoid the collision when the aircraft plunged to the earth and crashed in a field, bursting into flames. The aircraft was totally destroyed and both occupants were killed. ", "probable_cause": "The accident was the result of the combination of the following factors: \r\n- The pilots decided to carry out the mission without filing any flight plan, without authorization from ATC and without information related to the weather conditions,\r\n- The aircraft was operated with documents which were not up to date although its certificate of airworthiness had expired since October 2000 and it was no longer on the Russian Federation Civil Aircraft Registry, \r\n- The pilot-in-command was not authorized to fly as a captain and was flying for the first time following a long haul period. "}