{"url": "https://www.baaa-acro.com/crash/crash-sncac-nc211-cormoran-velizy-villacoublay-5-killed", "date": "Jul 20, 1948", "type": "SNCAC NC.211 Cormoran", "operator": "SNCAC - Société Nationale de Constructions Aéronautiques du Centre", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Toussus-le-Noble – Vélizy-Villacoublay", "msn": "01", "yom": 1948, "flight_number": null, "city": "Vélizy-Villacoublay", "zone": "Yvelines", "country": "France", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 4000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was engaged in a test flight on this first prototype and was completing a short flight from Toussus-le-Noble to his main base in Vélizy-Villacoublay. On final approach, at an altitude of 250 meters, the four engine aircraft nosed down and crashed in a huge explosion in the wood of Verrières located less than two km from the runway threshold. The aircraft was destroyed by impact forces and a post crash fire and all five crew members were killed. \r\nCrew:\r\nLouis Bertrand, pilot,\r\nAbel Nicolle, flight engineer, \r\nRobert Facomprez, radio operator, \r\nMaurice Itasse, mechanic, \r\nMarcel Constum, mechanic. ", "probable_cause": "The hypothesis of a false maneuver made by a highly skilled crew was excluded, as well as any act of sabotage or inadvertent movement of the 1,5 ton of ballast present in the cargo compartment. In all likelihood, the loss of control was caused by an excessive deployment of flaps. During the final approach, the crew selected flaps down activating the electric flaps control systems. For unknown reason, the flaps deployed to an excessive angle of 40°, causing the plane to stall and to crash."}