{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-134-mt-el-cumbal-94-killed", "date": "Jan 28, 2002 at 1024 LT", "type": "Boeing 727-100", "operator": "TAME", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Quito - Tulcán - Cali", "msn": "19692", "yom": 1967, "flight_number": "EQ120", "city": "Mt El Cumbal", "zone": "Nariño", "country": "Colombia", "region": "South America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 87, "pax_fatalities": 87, "other_fatalities": 0, "total_fatalities": 94, "captain_hours": 12091, "captain_hours_type": 8263, "copilot_hours": 7058, "copilot_hours_type": 3457, "aircraft_hours": 64001, "circumstances": "The aircraft departed Quito-Mariscal Sucre Airport runway 17 at 1001LT on a flight to Cali with an intermediate stop in Tulcán, carrying 87 passengers and 7 crew members. The flight was completed at an altitude of 18,000 feet on airway G-675 towards Ipiales, south Colombia. At a distance of 29 NM from Tulcán, the crew was cleared to descend to 14,000 feet and was briefed about the last weather conditions at destination. For unknown reasons, the crew failed to comply with the company SOP's and started the descent at an excessive speed of 230 knots while the approach procedure called for a speed of 180 knots. Also, the crew was not following the proper approach track for the Tulcán-Teniente Coronel Luis A. Mantilla Airport. In poor visibility due to clouds, at an altitude of 14,700 feet, the aircraft struck the slope of Mt El Cumbal located about 30 km northwest of Ipiales. The aircraft disintegrated on impact and all 94 occupants were killed. The wreckage was found 1,400 feet below the summit.", "probable_cause": "The probable cause was:\r\n- The decision of the instructor captain and his crew to initiate and continue the operation towards Tulcán Airport below minima weather conditions as established in the company's SOPs.\r\n- Inadequate navigation and operation of the aircraft by the pilot-in-command and directed by the instructor captain, consisting of entering the holding pattern of the Tulcán radio beacon with a speed of 230 knots (IAS) and with a banking of 15° exceeding the maximum stipulated speed limit of 180 knots during the entire procedure including the holding pattern and using a banking below the recommended range of 25° to 30°, thus exceeding the lateral navigation and obstacle protection limits of the holding pattern, leading this operation to the collision with Mt El Cumbal."}