{"url": "https://www.baaa-acro.com/crash/crash-volpar-turboliner-18-baltimore-1-killed", "date": "Dec 10, 1992 at 1535 LT", "type": "Volpar Turboliner 18", "operator": "Kalitta", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dayton - Baltimore", "msn": "AF-320", "yom": 1951, "flight_number": null, "city": "Baltimore", "zone": "Maryland", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2658, "captain_hours_type": 657, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 26436, "circumstances": "The pilot supervised the loading of the airplane. According to info from a person that helped load the plane, the bill of loading, and actual weights and measurements of the cargo after the accident, the plane was loaded to a gross weight of 11,979 lbs with the cg 2.7 inches behind the aft limit. At the destination, the flight was vectored for an ILS runway 10 approach. About 3 miles from the runway, the pilot was told to make a missed approach due to inadequate separation from traffic. The pilot acknowledged, but soon thereafter, radar contact with the plane was lost. Witnesses saw the plane descend from a low cloud layer before it crashed. One witness said its wings were moving from side to side and the plane was falling faster than it was moving forward. There was evidence the plane had impacted in a flat attitude with little forward movement. Four cargo straps were found loose with no sign of tensile overload; 3 others and a restraining board were found loose as if they had not been used. No preimpact mechanical problem was found. The wind was from 090° at 21 gusting 32 kts. The pilot, sole on board, was killed. ", "probable_cause": "Failure of the pilot to properly secure the cargo, which allowed a shift in the center of gravity during a missed approach maneuver and resulted in subsequent loss of aircraft control and flying speed. A factor related to the accident was failure of the pilot to assure the airplane was loaded within its proper weight and balance limitations."}