{"url": "https://www.baaa-acro.com/crash/crash-lockheed-ra-29-lo-hudson-near-windsor-locks-6-killed", "date": "Feb 11, 1942 at 1555 LT", "type": "Lockheed L-414 Hudson", "operator": "USAAF", "flight_phase": "Flight", "flight_type": "Aerial photography", "survivors": "No", "site": "Plain, Valley", "schedule": "Windsor Locks - Windsor Locks", "msn": "414-6157", "yom": 1941, "flight_number": null, "city": "Windsor Locks-Bradley", "zone": "Connecticut", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew departed Windsor Locks-Bradley Airport on an aerial photography on behalf of the 1st Mapping Squadron. While cruising at an altitude of 28,000 feet over the area of Windsor Locks, the airplane suffered a catastrophic failure, apparently lost its tail, entered a dive and crashed near East Granby, west of the airport. All six crew members were killed. \r\nCrew (1st Mapping Squadron):\r\n1st Lt Melvin W. Schoephoester, pilot, \r\n2nd Lt Walter C. Boyle,\r\nS/Sgt Michael M. Kaufman,\r\nSgt Gordon Johnson,\r\nSgt Thomas F. Quinn,\r\nSgt John T. Howey Jr.", "probable_cause": "The exact cause of the accident could not be determined because the airplane was totally destroyed by impact forces. Nevertheless, it is possible that the accident was caused by a failure of the automatic pilot system. The following elements were identified:\r\n- Both engine switches were cut, the throttles to the right engine were completely closed, while the throttles to the left engine were completely open, and the fuel selector valve for the right engine was turned off;\r\n- The right propeller appeared to have been feathered, and experts concluded that it was feathered at the time of impact;\r\n- The committee has found no evidence to indicate failure of the wings, it is more likely that the tail break away in flight."}