{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-winnipeg-1-killed", "date": "Jun 11, 2002 at 0920 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Keystone%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "City", "schedule": "Gunisao Lake - Winnipeg", "msn": "31-7305093", "yom": 1973, "flight_number": null, "city": "Winnipeg", "zone": "Manitoba", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on an instrument flight rules flight from Gunisao Lake, Manitoba, to Winnipeg. One pilot and six passengers were on board. At 0913 central daylight time, KEE208 began an instrument landing system approach to Runway 13 at Winnipeg International Airport. The captain flew the approach at a higher-than-normal approach airspeed and well above the glide path. When the aircraft broke out of the cloud layer, it was not in position to land safely on the remaining runway. The captain executed a missed approach at 0916 and, after switching to the approach frequency from tower frequency, requested an expedited return to the airport. The approach controller issued instructions for a turn back to the airport. Almost immediately, at 0918, the captain declared a 'Mayday' for an engine failure. Less than 20 seconds later the captain transmitted that the aircraft had experienced a double engine failure. The aircraft crashed at a major traffic intersection at 0920, striking traffic signals and several vehicles. All seven of the aircraft passengers and several of the vehicle occupants were seriously injured; one passenger subsequently died of his injuries. The aircraft experienced extensive structural damage, with the wings and engines tearing off along the wreckage trail. There was a small post-crash fire in the right wing and engine area.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The pilot did not correctly calculate the amount of fuel required to accomplish the flight from Winnipeg to Gunisao Lake and return, and did not ensure that the aircraft carried sufficient fuel for the flight.\r\n2. The ILS approach was flown above the glideslope and beyond the missed approach point, which reduced the possibility of a safe landing at Winnipeg, and increased the risk of collision with terrain.\r\n3. During the missed approach, the aircraft's engines lost power as a result of fuel exhaustion, and the pilot conducted a forced landing at a major city intersection.\r\n4. The pilot did not ensure that the aircraft was equipped with an autopilot as specified by CARs. \r\nFindings as to Risk:\r\n1. The company did not provide an adequate level of supervision and allowed the flight to depart without an autopilot.\r\n2. The company operations manual did not reflect current company procedures.\r\n3. The company did not provide an adequate level of supervision and allowed the flight to depart without adequate fuel reserves. The company did not have a safety system in place to prevent a fuel exhaustion situation developing.\r\nOther Findings:\r\n1. The pilot did not advise air traffic control of his critical situation in a timely fashion."}