{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh89a-dragon-rapide-liverpool-8-killed", "date": "Nov 12, 1948 at 1815 LT", "type": "De Havilland DH.89 Dragon Rapide", "operator": "Mannin Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Dublin – Douglas", "msn": "6538", "yom": 1947, "flight_number": null, "city": "Liverpool-John Lennon (ex Speke)", "zone": "Merseyside", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 15000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On approach to Douglas-Ronaldsway Airport, the crew encountered poor weather conditions and was unable to land. In thick fog, the pilot made several attempts to land, without success. As the weather conditions were better in Liverpool, he decided to divert. While descending to Speke Airport, both engines stopped simultaneously. The pilot elected to make an emergency landing but the aircraft crashed into the Mersey, about 3 miles north of the airport. A passenger was rescued while eight other occupants were killed. The aircraft sank and was lost. \r\nCrew:\r\nJohn Higgins, pilot,\r\nNoel Clucas, radio operator. ", "probable_cause": "It was determined that both engines failed on approach to Liverpool-Speke Airport because the fuel tanks were empty. The crew positioned that day from Douglas to Dublin to pick up passengers but failed to refuel prior to departure from Dublin. After several unsuccessful attempts to land in Douglas-Ronaldsway Airport, a divert to Liverpool and one approach, the fuel tanks were empty and both engines failed as the fuel quantity was insufficient. It was then considered that the crew misjudged the situation. The pilot was very experienced with over 15,000 flying hours and more than 5,000 flights between Liverpool and the Isle of Man. "}