{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-markham-bay-2-killed", "date": "Aug 12, 1996 at 1347 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "First%20Air.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Iqaluit - Markham Bay - Lake Harbour", "msn": "427", "yom": 1974, "flight_number": "7F064", "city": "Markham Bay", "zone": "Northwest Territories", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3813, "captain_hours_type": 2028, "copilot_hours": 2724, "copilot_hours_type": 1000, "aircraft_hours": null, "circumstances": "First Air 064, a DHC-6 Twin Otter (Serial No. 427), took off from Iqaluit, Northwest Territories (NWT), at 1258 Coordinated Universal Time (UTC) on a charter flight to Markham Bay, Lake Harbour, and back to Iqaluit. The aircraft was carrying six barrels of Jet B fuel to be delivered to Markham Bay, an off-strip landing site. At 1300, just after he took off, the captain told the Iqaluit Flight Service Station (FSS) specialist that the estimated time of arrival (ETA) for Markham Bay would be 1335. At approximately 1345, the crew informed First Air dispatch that they were landing at Markham Bay. After touching down, the pilot attempted an overshoot. During the attempt, the aircraft struck the ground about 200 metres past the end of the landing area, got airborne again, cleared a ridge, then crashed onto a rocky beach. A helicopter located the airplane 629 metres from the beginning of the landing area, partially submerged in water. The two pilots, the only occupants, received fatal injuries in the crash.", "probable_cause": "For unknown reasons, a decision was made to overshoot even though insufficient runway remained for acceleration, take-off, and climb. Likely contributing directly to the decision to overshoot was the difficulty in controlling the aircraft on touchdown."}