{"url": "https://www.baaa-acro.com/crash/crash-eclipse-ea500-leadville", "date": "Dec 13, 2020 at 2000 LT", "type": "Eclipse EA500", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Diego – Leadville", "msn": "221", "yom": 2008, "flight_number": null, "city": "Leadville", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5300, "captain_hours_type": 31, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1740, "circumstances": "The pilot reported that, while conducting a night landing on a runway contaminated with ice and patchy packed snow, the airplane overshot the touchdown zone. The pilot tried to fly the airplane onto the runway to avoid floating. The airplane touched down firm and the pilot applied moderate braking, but the airplane did not decelerate normally. The airplane went off the end of the runway and collided with several Runway End Identifier Lights (REILs) and a tree. The airplane sustained substantial damage to the left and right wings. The pilot reported that he did not feel modulation in the anti-lock braking system (ABS) and felt that might have contributed to the accident. An examination of fault codes from the airplane’s diagnostic storage unit indicated no ABS malfunctions or failures. An airport employee reported that he saw the airplane unusually high on the final approach and during the landing the airplane floated or stayed in ground effect before it touched down beyond the midpoint of the runway. The airplane’s long touchdown was captured by an airport surveillance video, which is included in the report docket.", "probable_cause": "The pilot’s failure to maintain proper control of the airplane, which led to an unstabilized approach and a long landing on a runway contaminated with ice and patchy packed snow resulting in a runway excursion."}