{"url": "https://www.baaa-acro.com/crash/crash-bae-atp-sao-jorge-island-35-killed", "date": "Dec 10, 1999 at 1018 LT", "type": "BAe ATP", "operator": "SATA-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Ponta Delgada - Horta", "msn": "2030", "yom": 1990, "flight_number": "SP530", "city": "São Jorge Island", "zone": "Azores Islands", "country": "Portugal", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 31, "pax_fatalities": 31, "other_fatalities": 0, "total_fatalities": 35, "captain_hours": 19721, "captain_hours_type": 2652, "copilot_hours": 5827, "copilot_hours_type": 514, "aircraft_hours": 11305, "circumstances": "The aircraft departed Ponta Delgada Airport at 0930LT on a schedule flight to Horta, carrying 31 passengers and a crew of four. The weather en route was affected by a frontal system with scattered cumulonimbus, heavy showers, turbulence and strong winds from the southwest. The crew decided to alter their flight plan, opting for a route that included approach descent over the channel between Pico and São Jorge islands to intercept the 250 degree VOR/VFL Horta radial. Horta tower initially cleared the flight to FL100. The crew then requested and were cleared to descent to 5,000 feet with the instruction of maintaining visual contact with Pico Island. During the descent heavy rain and turbulence were encountered. Seven minutes after initiating the descent, while in IMC conditions, the airplane impacted the northern hillside of Pico da Esperança (1067 metres high) located on São Jorge Island. It was later reported that the GPWS alarm sounded 17 seconds before impact. The aircraft disintegrated on impact and all 35 occupants were killed. ", "probable_cause": "Controlled flight into terrain after the crew failed to maintain the proper altitude. The following factors were identified:\r\n- Inaccurate navigation configuration on part of the crew, \r\n- The crew failed to properly use the weather radar, \r\n- The crew failed to pay sufficient attention to the radio altimeter settings,\r\n- The aircraft was not equipped with a modern and autonomous navigation system which may allow the crew to know their position with more precision,\r\n- Lack of visibility due to poor weather conditions."}