{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-134a-near-zolochiv-79-killed", "date": "May 3, 1985 at 1213 LT", "type": "Tupolev TU-134", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Tallin – Lviv – Chisinau", "msn": "23253", "yom": 1975, "flight_number": "SU8381", "city": "Zolochiv", "zone": "Lviv Oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 72, "pax_fatalities": 72, "other_fatalities": 0, "total_fatalities": 79, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 18548, "circumstances": "Following an uneventful flight from Tallin, the aircraft entered the TMA of Lviv and was cleared to descend from 4,800 meters to 4,200 meters. The crew was informed about the presence of an Antonov AN-26 that took off from Lviv-Sknyliv Airport at 1202LT and was climbing to 3,900 meters. En route to Moscow, the AN-26 was carrying 15 people, most of them officers from the Carpathian Military contingent. At 1212LT, the crew of the TU-134 was cleared to continue to descend below 4,200 meters. One minute later, while cruising in clouds at an altitude of 3,900 meters, both aircraft collided, entered a dive and crashed in an open field located near the city of Zolochiv, about 60 km east of Lviv. Both aircraft were totally destroyed and all 94 occupants were killed. ", "probable_cause": "It was determined that the accident was the consequence of a poor radar coverage by ATC who failed to properly coordinate control and assistance to both planes. ATC in charge of the sector where the collision occurred cleared the crew of the TU-134 to continue to descend when he actually had no idea of the exact position of both planes. This caused the Tupolev to descend too low and to cut the Antonov trajectory. The supervisor in charge of the sector was also blamed insofar he failed to pay sufficient attention to the operations and was unable to identify in time a possible conflict and thus, was unable to initiate any corrective action and to assist his colleague. "}