{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-1-palm-springs", "date": "Feb 13, 1958 at 1345 LT", "type": "Convair CV-240", "operator": "Western%20Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Las Vegas – Palm Springs – San Diego", "msn": "22", "yom": 1948, "flight_number": "WA019", "city": "Palm Springs", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 18, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9845, "captain_hours_type": 3547, "copilot_hours": 5240, "copilot_hours_type": 785, "aircraft_hours": 22516, "circumstances": "About 1342 Flight 19 took off from runway 31. The takeoff appeared normal, and the aircraft climbed to approximately 500 feet above the ground. At this time several ground witnesses saw two or more silvery pieces separate from the aircraft. Most witnesses said the pieces seemingly separated from the area of the right wing. Almost simultaneously the aircraft was observed to nose down sharply and descend at a steep angle. As it neared the ground it leveled off considerably but continued to descend. It contacted the ground raising a large cloud of dust and then disappeared from the view of the observers behind intervening higher terrain. Seconds later large columns of smoke were seen rising from the accident site. During the ground roll the aircraft struck large boulders in its path and fire occurred which consumed the major portion of the aircraft. There were no fatalities but serious injuries resulted to 5 of the 18 passengers and minor injuries to most of the others. The crew of three received minor or slight injuries.", "probable_cause": "The Board determines that the probable cause of this accident was the failure of a mechanic to secure properly the right wing leading edge section as a result of which the unit separated in flight. This improper installation was undetected because of inadequate inspection. The following findings were reported:\r\n- During the departure from Palm Springs the right wing leading edge separated in flight,\r\n- Separation of the component resulted in severe control difficulty and buffeting of the aircraft,\r\n- A gear-down emergency landing was made in the boulder-strewn desert about four miles north-northwest of the airport,\r\n- During the ground roll impacts with the boulders caused severe damage and breakup of the aircraft, and a fire in the left wing spread rapidly and destroyed the aircraft,\r\n- N8405H received a No. 3, areas 1 and 3, heavy maintenance check about two hours of flying time before the accident,\r\n- During the maintenance a mechanic assigned to close and secure the right leading edge forgot to install the retaining screws,\r\n- The gap straps were properly installed,\r\n- An inadequate inspection of the aircraft by the lead mechanic resulted in his failure to detect the omission,\r\n- The gap straps held the leading edge in place until the Palm Springs departure when they failed from loads beyond their design strength."}