{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-near-bigfork-2-killed", "date": "Apr 11, 1998 at 0221 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "CMSystems", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Mountains", "schedule": "Bismarck – Kalispell", "msn": "46-22168", "yom": 1994, "flight_number": null, "city": "Bigfork", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 11450, "captain_hours_type": 920, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft disappeared from ATC radar immediately after being cleared to descend from 12,000 feet to 10,000 feet. ATC radar data showed the aircraft at 11,900 to 12,000 feet for approximately the last 6 minutes prior to the disappearance, with the last Mode C altitude and discrete transponder code 2402 (at 0221:03) reported as 11,800 feet. The last three returns, 12,000, 11,900, and 11,800, are consistent with the start of a descent from 12,000 feet. Due to construction at the radar antenna site, the area where the aircraft disappeared was blocked from radar coverage. Subsequent attempts by the controller to contact the aircraft were unsuccessful. A 7,000- to 7,500-foot overcast was reported at the destination, along with lower clouds and precipitation. Documentation at the accident site indicated an approximate level flight path from the broken treetops to the area of ground impact into a northwest-facing 60-degree mountain slope at approximately the 5,600-foot level. The wreckage was not located for approximately two months. Post-accident examinations of the aircraft's Bendix/King KEA130A (United Instruments 5035PB-P57) encoding altimeter revealed needle impressions on the indicator face and pointers consistent with an altitude indication of 12,620 feet. The internal components of the unit were severely damaged and a functional test was not possible. The aircraft was equipped with a copilot's altimeter. Only the faceplate was recovered and examined. One impression on the main faceplate revealed a needle impression by the 100-foot pointer consistent with 560 feet. The position of the 1,000-foot pointer could not be determined. The pilot's 4-day activity history showed that he was returning from a demanding 3-day work assignment, that his recent sleeping schedule was irregular, and that he had been awake about 20 hours at the time of the accident. There was no evidence found of a mechanical failure or malfunction at the time of the accident.", "probable_cause": "The pilot's failure to maintain terrain clearance for undetermined reasons. Contributing factors were the mountainous terrain, trees, dark night conditions, clouds and pilot fatigue."}