{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-mt-alcazaba-80-killed", "date": "Oct 2, 1964 at 0545 LT", "type": "Douglas DC-6", "operator": "UTA", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Paris – Marseille – Palma de Majorque – Nouadhibou – Nouakchott", "msn": "44062", "yom": 1953, "flight_number": null, "city": "Mt Alcazaba", "zone": "Andalusia", "country": "Spain", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 73, "pax_fatalities": 73, "other_fatalities": 0, "total_fatalities": 80, "captain_hours": 10964, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 29620, "circumstances": "The aircraft was flying a scheduled international passenger flight from Paris to Marseilles, Palma de Mallorca and Port-Etienne. The trip to Palma was uneventful and, following receipt of the latest meteorological information available, the aircraft took off from runway 27 for Port-Etienne at 0314 hours GMT. According to its flight plan the air- craft was to check with the following while en route: area control centres at Barcelona, Seville, Casablanca and Dakar and the control tower at Port-Etienne. At 0339 hours, it advised Palma control tower that it was over Ibiza. It reported to Barcelona FIR that it had crossed the FIR boundary at 0401 hours at flight level 100. At 0353 hours, it reported to Seville FIR that it was estimating the FIR boundary at 0401 at flight level 100 and Los Alcazares at 0415 hours. At 0420 hours, it reported having passed Los Alcazares in clear skies at 0415 hours, estimating abeam Malaga at 0500 hours, overhead Tanger at 0524, and Port-Etienne at 1020 hours. This was the last communication from the flight. Seville FIR tried subsequently, without success, to contact the aircraft. The aircraft hit a mountain at 0445 hours.", "probable_cause": "At the time of last contact with the aircraft it was flying in clear skies. The aircraft deviated from the flight plan but flew at altitudes within the established safety margin, then struck a mountain. The reason for the deviation from the planned route could not be determined. It is believed that after Los Alcazares (0415 hours), the aircraft headed for Tanger, deviating slightly from the planned route which was 25 km away from the scene of the accident and at altitudes which were within the established safety margin. The difference between the Los Alcazares - Tanger route and the Los Alcazares - site of the accident route, exceeds 5°. Since the automatic pilot error is plus or minus 1°, the remaining 4° may have been caused by wind or some other undiscovered error."}