{"url": "https://www.baaa-acro.com/crash/crash-rockwell-500u-shrike-commander-mt-barren-jack-2-killed", "date": "Nov 18, 1989 at 1241 LT", "type": "Rockwell Shrike Commander 500", "operator": "Australian%20Government_0", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Mountains", "schedule": "Canberra – Dalby", "msn": "500-1754-45", "yom": 1968, "flight_number": null, "city": "Mt Barren Jack (Burrinjuck)", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "When the survey aircraft failed to arrive at the destination, and on expiry of the SAR time, a search was commenced. Wreckage of the aircraft was subsequently found on the eastern slope of Mt  Barren Jack, to the north west of the mouth of Carrolls Creek, and on the planned track for the survey operation. Observers at the Burrinjuck reservoir near the mouth of Carrolls Creek described the weather in the accident area at the time as black clouds spilling over and obscuring the mountain tops. The aircraft collided with trees on the side of the mountain, while banked steeply to the right and in a tail low attitude. The pilot was thrown from the aircraft during the impact sequence. Medical opinion held that there was no evidence of body trauma consistent with the seat belt  being fastened at the time of impact. The flight was completed on behalf of the Bureau of Mineral Resources (BMR) and both occupants were killed. ", "probable_cause": "Because of the destruction of the aircraft by the ensuing fire the status of the seat belt assemblies were unable to be determined. The investigation revealed that both engines were operating at high power at the time of impact. No malfunction or defect could be found with the aircraft which could have contributed to the accident. The survey task required the pilot to adhere strictly to a particular track and the target height for the flight was 500 feet above ground level while maintaining visual contact with the ground at all times. The pilot was suitably qualified to act as pilot in command of survey operations down to a height of 200 feet above ground level. The investigation concluded that the aircraft was being operated at a height substantially lower that 500 feet  above ground level prior to the accident. Impact marks, wreckage and mechanical evidence suggest that the aircraft impacted terrain at a time when the pilot was attempting to carry out an evasive manoeuvre to remain clear of terrain. The reason why the aircraft was being operated at such a height and why the pilot delayed turning away from the steeply rising terrain could not be determined. \r\nThe following factors were reported:\r\n- The pilot continued the flight into adverse weather conditions.\r\n- The pilot flew the aircraft towards steeply rising terrain at a height substantially lower that 500 feet above ground level. "}