{"url": "https://www.baaa-acro.com/crash/crash-cessna-207-skywagon-47-mile-creek-1-killed", "date": "Sep 20, 2000 at 0615 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Inland%20Aviation%20Services", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "47 Mile Creek – Aniak", "msn": "207-0148", "yom": 1970, "flight_number": null, "city": "47 Mile Creek", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1788, "captain_hours_type": 900, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The air taxi pilot had flown to a remote airstrip and lodge in a company airplane to go hunting. He was scheduled the next morning for a flight from his company's base of operations, his original departure airport. According to a hunting guide at the lodge, the pilot departed the lodge's airstrip about 0608, with a load of revenue cargo. A few minutes later, the guide heard the sound of an airplane, and then a loud impact. The guide could not see the wreckage because it was too dark outside. He departed in his own airplane, but entered clouds shortly after takeoff, and had to return. The guide commented he thought the accident pilot was trying to return to the lodge airstrip because of the poor weather and darkness. The wreckage was located on a nearby mountain in daylight hours after the cloud cover had dissipated. Post accident inspection disclosed no evidence of any preimpact mechanical anomalies with the airplane. Official sunrise was 0813; official civil twilight was 0730. The time of the accident was approximately 0615.", "probable_cause": "The pilot's decision to initiate visual flight into dark night instrument meteorological conditions. Factors associated with the accident are a low ceiling, a dark night, the pilot's failure to follow regulatory procedures and directives, and his self-induced pressure to return to base to take another flight."}