{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-sydney-1-killed", "date": "Apr 9, 2008 at 2327 LT", "type": "Swearingen SA227 Metro III", "operator": "Airtex%20Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Sydney – Brisbane", "msn": "AC-600", "yom": 1984, "flight_number": null, "city": "Sydney", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4873, "captain_hours_type": 175, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 32339, "circumstances": "On 9 April 2008, at 2325 Eastern Standard Time, a Fairchild Industries Inc. SA227-AC (Metro III) aircraft, registered VH-OZA, departed Sydney Airport, New South Wales on a freight charter flight to Brisbane, Queensland with one pilot on board. The aircraft was subsequently observed on radar to be turning right, contrary to air traffic control instructions to turn left to an easterly heading. The pilot reported that he had a ‘slight technical fault’ and no other transmissions were heard from the pilot. Recorded radar data showed the aircraft turning right and then left, followed by a descent and climb, a second right turn and a second descent before radar returns were lost when the aircraft was at an altitude of 3,740 ft above mean sea level and descending at over 10,000 ft/min. Air traffic control initiated search actions and search vessels later recovered a small amount of aircraft wreckage floating in the ocean, south of the last recorded radar position. The pilot was presumed to be fatally injured and the aircraft was destroyed. Both of the aircraft’s on-board flight recorders were subsequently recovered from the ocean floor. They contained data from a number of previous flights, but not for the accident flight. There was no evidence of a midair breakup of the aircraft. ", "probable_cause": "Contributing Safety Factors:\r\n- It was very likely that the aircraft’s alternating current electrical power system was not energised at any time during the flight.\r\n- It was very likely that the aircraft became airborne without a functioning primary attitude reference or autopilot that, combined with the added workload of managing the ‘slight technical fault’, led to pilot spatial disorientation and subsequent loss of control.\r\nOther Safety Factors:\r\n- The pilot’s Metro III endorsement training was not conducted in accordance with the operator’s approved training and checking manual, with the result that the pilot’s competence and ultimately, safety of the operation could not be assured. [Significant safety issue].\r\n- The chief pilot was performing the duties and responsibilities of several key positions in the operator’s organisational structure, increasing the risk of omissions in the operator’s training and checking requirements.\r\n- The conduct of the flight single-pilot increased the risk of errors of omission, such as not turning on or noticing the failure of aircraft items and systems, or complying with directions."}