{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90a-king-air-houston", "date": "Jun 25, 2014 at 0750 LT", "type": "Beechcraft 90 King Air", "operator": "BECS LLC", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Memphis - Houston", "msn": "LJ-1460", "yom": 1997, "flight_number": null, "city": "Houston-Municipal", "zone": "Mississippi", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2105, "captain_hours_type": 223, "copilot_hours": 12000, "copilot_hours_type": 700, "aircraft_hours": 2708, "circumstances": "On June 25, 2014, about 0750 central daylight time, a Raytheon Aircraft Company C90A, N800MK, was substantially damaged following a runway excursion during an attempted go-around at Houston, Mississippi (M44). The commercial-rated pilot, co-pilot, and two passengers were not injured, while one passenger received minor injuries. The airplane was\r\noperated by BECS, LLC under the provisions of 14 CFR Part 91, and an instrument flight rules flight plan was filed. Day, visual meteorological conditions prevailed for corporate flight that originated at Memphis, Tennessee (MEM). According to the pilot, who was seated in the left, cockpit seat, he was at the controls and was performing a visual approach to runway 21. Just prior to touchdown, while at 90 knots and with approach flaps extended, the right wing \"rose severely and tried to put the airplane into a severe left bank.\" He recalled that the co-pilot called \"wind shear\" and \"go around.\" As he applied power, the airplane rolled left again, so he retarded the throttles and allowed the airplane to settle into the grass on the left side of runway 21. The airplane struck a ditch, spun around, and came to rest in the grass, upright. A post-crash fire ensued in the left engine area. The pilot and passengers exited the airplane using the main entry door. The pilot reported no mechanical anomalies with the airplane prior to the accident. The co-pilot reported the following. As they turned onto final, he noticed that the wind \"picked up\" a little by the wind sock. The final approach was stable, and as the pilot began to flare, he noticed the vertical speed indicator \"pegged out.\" The airplane encountered an unexpected wind shear just above the runway. He called out for a go around. The pilot was doing everything he could to maintain control of the airplane. It was a \"jarring\" effect when they hit the shear. It felt like the wind was trying to lift the tail and cartwheel them over. He felt that the pilot did a good job of keeping the airplane from flipping over. In his 30,000-plus hours flying airplanes, he has never experienced anything quite like what they experienced with this shear. He has instructed on the King Air and does not feel that the pilot could have done anything different to avoid the accident.", "probable_cause": "The National Transportation Safety Board determines the probable cause(s) of this accident to be: The pilot’s failure to maintain a stabilized approach and his subsequent failure to maintain airplane control during the landing flare, which resulted in touchdown off the side of the runway and collision with a ditch. "}