{"url": "https://www.baaa-acro.com/crash/crash-vickers-808-viscount-bristol", "date": "Sep 21, 1967 at 0859 LT", "type": "Vickers Viscount", "operator": "Aer%20Lingus-1", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dublin - Bristol", "msn": "422", "yom": 1959, "flight_number": null, "city": "Bristol-Lulsgate", "zone": "Somerset", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 17, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5005, "captain_hours_type": 1300, "copilot_hours": 2200, "copilot_hours_type": 592, "aircraft_hours": 18375, "circumstances": "Before leaving Dublin no landing forecast for Lulsgate was available but the forecast conditions for Filton, 10 miles north of Lulsgate, were well above the company minima of 260 ft critical height and 800 rn RVR. About 25 minutes before commencing the approach to land and whilst the aircraft was on the airway near Strumble, the latest weather conditions for Lulsgate obtained by radio from air traffic control, showed that there was 3/8 cloud at 1 000 ft, visibility was 1 500 m with the sun tending to disperse cloud and mist. After leaving the airway, the aircraft was positioned by Lulsgate radar for an approach to runway 28 on a right-hand base leg. At 0752 hours GMT before the final approach was commenced, the latest weather conditions were passed by the Lulsgate rabar controller who was also the approach controller, these conditions showed a surface wind northerly 8 to 10 kt, QFE 979, QNH 1 001, visibility in mist 1 800 m. During the final turn on to the approach at 6 miles, the aircraft drifted to the left of the extended centre line which was regained closing from left to right during the final descent. At five miles from touchdown, still to the left of the centre line, a descent from 1 500 ft (QFE) was commenced at a rate of 300 ft per mile with advisory altitudes being passed every half mile. The air was calm and the commander was able to achieve a high degree of precision during the approach; heights were accurately flown during the descent and the aircraft's track, cow verging on the centre line, was steady, When the aircraft was between 3 and 34 miles from touchdown, the controller informed it that visibility had deteriorated to 1 200 m. At two miles, when steering 2950, the aircraft intercepted the approach centre line and its heading was corrected to 290°; at one and a half miles at 500 ft, a further heading correction was made on to 287°. A drift to the right, away from the centre line, became apparent when the aircraft was between 1 and 12 miles from touchdown and the controller gave further corrections to the left to 285° and 280°. At one mile from touchdown at 350 feet, a further left correction to 275° was given but the aircraft continued to track to the right of the centre line. At half a mile from touchdown, when the talk-down was complete, the controller informed the aircraft it was well to the right of the centre line and that it should overshoot if the runway was not in sight. Shortly afterwards the aircraft was seen, by a controller, heading towards the control tower before commencing its corrective turn to the left. The commander, who was at the controls of the aircraft, said it was possible to refer to the ground and natural horizon until passing through about 650 ft when a thin layer of cloud followed by misty conditions required the remainder of the approach to be made on instruments. Whilst descending through 300 ft, the commander asked the co-pilot if he could see anything but just as he replied in the negative the commander saw the approach lights ahead and to his left and he promptly commenced an 'St turn to line up with them. As he did so he called for 400 of flap and less power in order to reduce the airspeed from 130 kt to about 112 kt. During this phase, he lost contact with the lights \"for some seconds\" but he elected to continue the approach because the last reported visibility was 1 200 rn and he was confident the runway lights would shortly appear ahead. When they came into view the aircraft was over the left-hand side of the runway and not properly aligned with it; the commander said he attempted to turn on to the runway centre line as he flared out for the landing. During this manoeuvre, although he was not aware of it, the starboard wing tip and No. 4 propeller struck the runway; the aircraft then touched down on all its wheels with considerable port drift. The commander took overshoot action, applying full power, calling for 20° of flap and the undercarriage to be raised; the airspeed had, in the meanwhile, fallen below 100 kt. The commander realised that the aircraft was not accelerating normally and saw that it was headed towards buildings on the northern perimeter of the aerodrome; rather than risk flying into these obstructions, he flew the aircraft on to the ground with its undercarriagi retracting. The aircraft touched down starboard wing first, ground-looped tb the right as it slid along the remaining section of the adjacent runway, then crashed tail first through a fence. Ten of the occupants of the passenger cabin were injured, three of them seriously; fire did not break out; rescue and fire vehicles arrived promptly on the scene. The accident occurred at 0759 hours. ", "probable_cause": "The accident was caused by an attempt to align the aircraft with the runway at too low a height following the commander's incorrect decision to continue the approach when visual guidance became obscured below critical height. A crash landing became necessary during an attempted overshoot after the aircraft had touched the ground and sustained damage during a turn at a low height."}