{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-jacksonville-13-killed", "date": "Dec 6, 1984 at 1814 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "PBA-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Jacksonville - Tampa", "msn": "110-365", "yom": 1981, "flight_number": "PT1039", "city": "Jacksonville-Intl", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": 10000, "captain_hours_type": 400, "copilot_hours": 3000, "copilot_hours_type": 500, "aircraft_hours": 5662, "circumstances": "At 18:12, flight 1039 was cleared for takeoff from runway 31. At 18:13, while over the departure end of the runway and climbing through 600 feet, the crew acknowledged a frequency change. Thirty seconds later, the airplane was seen in a steep a descent near the extended centerline of the runway. The Bandeirante struck the ground 7,800 feet beyond the departure end of runway 31 and 85 feet to the right of the extended runway centerline in an inverted nose down attitude, after which it caught fire and burned. Before ground impact, the horizontal stabilizer, including bulkhead No. 36, had separated from the fuselage. Both elevators and elevator tips, the tail cone assembly, and the aft portion of the ventral fin also had separated in flight. All 13 occupants were killed. ", "probable_cause": "A malfunction of either the elevator control system or elevator trim system, which resulted in an airplane pitch control problem. The reaction of the flight crew to correct the pitch control problem overstressed the left elevator control rod, which resulted in asymmetrical elevator deflection and overstress failure of the horizontal stabilizer attachment structure. The Safety Board was not able to determine the precise problem with the pitch control system."}