{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh114-heron-2d-near-palma-de-majorca-4-killed", "date": "Nov 15, 1957 at 2008 LT", "type": "De Havilland DH.114 Heron", "operator": "Aviaco-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Barcelona – Palma de Majorque", "msn": "14117", "yom": 1957, "flight_number": null, "city": "Palma de Mallorca", "zone": "Balearic Islands", "country": "Spain", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1912, "captain_hours_type": 95, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 465, "circumstances": "The aircraft was on a scheduled passenger transport flight between Barcelona and Palma, Majorca. It took off from Barcelona at 1919LT. At 2002LT it reported to the Palma, Majorca Area Control Centre that it was above the MJ radio beacon at flight level 60. It was cleared by the Centre for an ADF approach to the Son Bonet Airport and at 2008LT it hit a mountain located 14.5 km from the airport. The 2 crew members and the 2 passengers were killed, and the aircraft was completely destroyed. ", "probable_cause": "The exact cause of the accident could not be determined with certainty. However, ADF approach to Son Bonet Airport was cleared by Control Centre as no other aircraft was in flight at the time, and the aircraft was asked to report on starting its procedure turn, i. e. after 4 minutes on the outbound track. If the aircraft did actually reach flight level 60 above MJ, since it did not carry out the holding procedure it is impossible to determine its rate of descent during let-down. To perform such a manoeuvre - once the radio compass has indicated passage over the radio beacon - the pilot should adjust his directional gyro to the heading of 195\" indicated on the aerodrome chart (see Figure 3). In other words, he should have placed his aircraft on the outbound track toward Palma Bay and maintained this heading during three minutes after which he should have taken a 240° heading during one minute and then reported his procedure turn to Control. Now if a line is drawn from the radio beacon MJ to the site of the accident, it will be seen that the direction of the line is 295°, i. e. that it forms an angle of 100° with the let-down heading (195°). It is possible, therefore, that in setting the directional gyro the pilot mistakenly added 100 degrees. The distance of 14.5 km corresponds approximately to the distance from the beacon of a procedure turn. The possibility of a 14-knot wind causing such a displacement in the track of the aircraft within such a short period of time must be ruled out. Poor weather conditions and the rainfall prevailing at the time of the accident, coupled with the turbulence reported to EC-AHI on the Barcelona-Palma route might have influenced a pilot whose experience was limited. "}