{"url": "https://www.baaa-acro.com/crash/crash-cessna-414a-chancellor-statesboro-1-killed", "date": "Apr 27, 1993 at 2003 LT", "type": "Cessna 414 Chancellor", "operator": "Arkansas Aircraft", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hilton Head – Statesboro", "msn": "414A-0235", "yom": 1979, "flight_number": null, "city": "Statesboro-Bulloch County", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4650, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A student pilot in American AA-1A, N9317L, was on an approach to land on runway 05 of the uncontrolled airport, as a commercial pilot in Cessna 414A, N47WD, was on an approach to land on runway 14. The two runways intersected near their approach ends. The two aircraft collided as they were about to touch down at dusk over the intersection. Witnesses on the ground stated that they observed lights on the Cessna, but did not observe any lights on the American. Witnesses in other aircraft in the area stated that they heard the pilot of the american announcing his position in the traffic pattern and landing intentions, but did not hear the pilot of the Cessna on the Unicom frequency. The pilot of the Cessna stated that he announced his intention to land on runway 14 over Unicom frequency 123.0. The published Unicom frequency for the Statesboro Airport was 122.8.", "probable_cause": "Inadequate visual lookout by the pilots of both aircraft. Factors related to the accident were: failure of the pilot of N9317L to illuminate his aircraft navigation lights, and improper radio communications by the pilot of N47WD by selecting the wrong unicom frequency to monitor and announce his landing intentions and position.\n"}