{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46p-350-malibu-mirage-des-moines", "date": "Nov 27, 1989 at 1726 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Paramount Leasing Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Omaha - Des Moines", "msn": "46-22076", "yom": 1989, "flight_number": null, "city": "Des Moines", "zone": "Iowa", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2278, "captain_hours_type": 832, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 65, "circumstances": "The aircraft was on an ILS approach at dusk in IMC and icing conditions with the alternate air on. According to the pilot, he had just descended below an overcast, on final approach, when the engine lost power and would not respond to throttle application. A forced landing was made in a wooded area short of the runway and the aircraft was extensively damaged. During an exam of the engine, the turbocharger and wastegate transition pipes were found separated at the flange. Carbonaceous residue was found in the area of separation, but no heat damage was noted. The gasket, bolts, washers and self-locking nuts (for holding the pipes together) were not found. Later, the engine ran successfully during an operational check. During the investigation, 3 similar cases of pipe separation were identified, which involved another aircraft; these resulted in only partial losses of power. The right front seat passenger reported seeing a trace of ice on the wings as the aircraft was descending thru clouds. The pitot heat, stall warning heat, and ice light switch were fnd in the 'off' position. At 1650 cst, the temperature and dew point at the surface were 36° and 35° respectively. All three occupants were seriously injured. ", "probable_cause": "Loss of engine power for undetermined reason(s). The light conditions (dusk) and trees in in the emergency landing area were considered to be contributing factors."}