{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-kukaklek-lake", "date": "Jun 27, 2010 at 1730 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Royal%20Wolf%20Lodge", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Kukaklek Lake - Kukaklek Lake", "msn": "1095", "yom": 1957, "flight_number": null, "city": "Kukaklek Lake", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5000, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The commercial pilot was taking off on a passenger flight in conjunction with a remote lodge operation under Title 14, CFR Part 91. The pilot said he picked up passengers in the float-equipped airplane on a beach, and water-taxied out into the lake for takeoff. He said he taxied out about 1,200 feet, reversed course into the wind, and initiated a takeoff. He said when the airplane reached his predetermined abort point, the airplane was still on the water, and might not lift off in time to avoid the terrain ahead. The pilot said rather than abort the takeoff he elected to apply full power and continue the takeoff. He said the airplane collided with the bank, and nosed over. The pilot said there were no preaccident mechanical anomalies with the airplane. The owner of the company said the lake was about 1 mile wide where the pilot elected to takeoff. He said the airplane received substantial damage to the wings and fuselage. He also said the passengers related to him that the engine sounded fine, but they did not think the pilot taxied out very far into the lake.\n", "probable_cause": "The pilot's decision to use only a portion of the available takeoff area, which resulted in a collision with terrain during takeoff.\n"}