{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-81-yuma", "date": "Jun 19, 1980 at 1849 LT", "type": "McDonnell Douglas MD-81", "operator": "McDonnell%20Douglas", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yuma-Yuma", "msn": "48001", "yom": 1979, "flight_number": null, "city": "Yuma", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": null, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8200, "captain_hours_type": 150, "copilot_hours": 3199, "copilot_hours_type": 223, "aircraft_hours": 6, "circumstances": "The airplane skidded off the right side of runway 21R while attempting a simulated hydraulic-systems-inoperative landing at the Yuma International Airport, Yuma, Arizona. The aircraft came to rest about 6,700 feet beyond the landing threshold of the runway. Although the aircraft was damaged substantially the three flightcrew members were not injured. There were no passengers. The weather was clear and the runway was dry. The aircraft was on an FAA certification test flight to demonstrate compliance with a special condition to 14 CFR Part 25. The purpose of the flight was to show that the aircraft could be controlled adequately and landed safely with a complete failure of its hydraulic systems. The aircraft landed about 1,735 feet beyond the threshold of runway 21R, and the pilot deployed the thrust reverses and applied reverse thrust before the nosewheel touched down. The aircraft began to yaw, continued to yaw after the nosewheel touched down, it then ground looped to the right, and slid off the right side of the runway. All three crew members were slightly injured and the aircraft was damaged beyond repair. ", "probable_cause": "Inadequate procedures established for certification test flight, and the pilot's mismanagement of thrust following the initial loss of directional control."}