{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2p-near-kherpuchi-13-killed", "date": "Jun 16, 1995 at 1415 LT", "type": "PZL-Mielec AN-2", "operator": "Nikolayevski Aviation Enterprise", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Poliny Osipenko – Kherpuchi – Oktyabrsky – Nikolayevsk-on-Amur", "msn": "1G159-18", "yom": 1974, "flight_number": null, "city": "Kherpuchi", "zone": "Khabarovsk Krai", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 12, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was completing a flight from Poliny Osipenko to Nikolayevsk-on-Amur with intermediate stops in Kherpuchi and Oktyabrsky. Nine minutes after his departure from Kherpuchi Airport, the crew encountered poor weather conditions with low clouds. While cruising at an altitude of 400 metres, the aircraft struck tree tops, stalled and crashed in a wooded area located 21,5 km from Kherpuchi, bursting into flames. A passenger was seriously injured while 13 other occupants were killed. ", "probable_cause": "It was determined that the accident was the consequence of a controlled flight into terrain. The following contributing factors were reported: \r\n- The crew continued the flight at the altitude of 400 metres while the minimum safe altitude for the area was fixed at 800 metres, \r\n- Poor visibility due to low clouds (600 to 1,500 metres),\r\n- The crew failed to return to the departure point when weather conditions deteriorated,\r\n- Loss of visual contact with the ground after the crew decided to continue under VFR in IMC conditions, \r\n- The crew did not receive the emergency radio station and signal devices before departure, as well as the fact that on that day the dispatch microphone at the Kherpuchi Airport was not turned on, which made it impossible to establish the actual instructions of the flight director. In such conditions, the flight was not monitored."}