{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-portage-lake-2-killed", "date": "Sep 30, 1996", "type": "De Havilland DHC-2 Beaver", "operator": "Castle Rock Exploration Corporation", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Ugly Lake - Goose Bay", "msn": "19", "yom": 1949, "flight_number": null, "city": "Portage Lake", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 894, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot of C-FFHF, a float-equipped de Havilland DHC-2 Beaver, departed the company camp at Ugly Lake, Labrador, en route to Goose Bay. Prior to arriving at Goose Bay, the pilot contacted an overflying Air Labrador flight and advised them that he had landed on a pond and that he needed the SAR (search and rescue) time extended on his flight plan. The pilot also said that he would be departing the pond shortly, en route to Goose Bay. When C-FFHF did not arrive at the destination by the SAR time of 2030 Atlantic daylight saving time (ADT), a search was commenced. Seven days later, an oil slick and a paddle with the company name on it were identified on a pond about 66 nautical miles (nm) north of Goose Bay. Divers located the aircraft wreckage in 120 feet of water. The aircraft was destroyed and the bodies of the pilot and passenger were located inside the wreckage.", "probable_cause": "It is probable that the pilot was unable to maintain visual reference with the surface sometime after take-off from the pond. The aircraft struck the water either during the pilot's attempt to regain visual reference or because the pilot lost control of the aircraft in reduced visibility."}