{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-680s-mt-ruapehu-6-killed", "date": "Nov 21, 1961 at 1155 LT", "type": "Rockwell Grand Commander 680", "operator": "Bay-of-Plenty-Airways", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Wellington – Rotorua", "msn": "680-437-109", "yom": 1958, "flight_number": "92", "city": "Mt Ruapehu", "zone": "Manawatu-Wanganui (Horizons Regional Council)", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 4300, "captain_hours_type": 3000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5040, "circumstances": "At 1117LT flight 92 departed Wellington Airport on a scheduled flight to Rotorua. The flight cleared Wellington Control Zone and later reported its position at Foxton and east of Ohakea. No further messages ware received from the aircraft, and no distress calls were heard. At 1155LT the aircraft was sighted over the northeast slopes of Mount Ruapehu. A few seconds later the starboard wing, complete with engine, separated from the fuselage. As the rest of the structure plunged towards the ground an explosion occurred, and the fuselage burst into flames. The aircraft crashed on the face of the mountain, and the pilot and five passengers died instantly. The accident occurred at an altitude of 7 300 ft amsl, 1 276 yd from Te Heu Heu Peak.\r\nCrew:\r\nCpt Alf Bartlett, pilot.\r\nPassengers:\r\nMarlene Boynton, \r\nNicholas Crook   2 children\r\nIrvine Down.", "probable_cause": "The cause of the accident was the detachment of the starboard mainplane in flight. A contributory cause was the decision of the pilot to fly close to the summit of the mountain in an aircraft in which, unknown to him, the starboard wing structure had been appreciably weakened by a combination of spar cap fractures and fatigue cracking derived from a past incident. Severe turbulence or some pilot manoeuvre caused the starboard propeller to strike a part of the mountain and the resultant vibrational loads, together with the effects of violent turbulence encountered thereafter, imposed stresses which the weakened wing structure was incapable of withstanding."}