{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-32-toronto-2-killed", "date": "Jun 26, 1978 at 0808 LT", "type": "Douglas DC-9", "operator": "Air%20Canada.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ottawa - Toronto - Winnipeg - Vancouver", "msn": "47197", "yom": 1968, "flight_number": "AC189", "city": "Toronto-Lester Bowles Pearson", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 102, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 25476, "circumstances": "During the takeoff roll on runway 23L, at a speed of 145 knots, the crew heard a thumping noise and felt vibrations. In a meantime, the right engine power dropped and a warning light coupled to the right main gear illuminated. The copilot informed the captain about the fact that the right main gear was unsafe. At a speed of 149 knots, the captain decided to abandon the takeoff procedure and initiated an emergency braking maneuver. He deployed the spoilers and activated the thrust reversers systems. The airplane was unable to stop within the 1,219 meters remaining, overran at a speed of 70 knots, rolled on a distance of 139 meters then went down a 15 meters high embankment and eventually came to rest, broken in three. Two passengers were killed while 55 others were injured and 50 unhurt. ", "probable_cause": "It was determined that the tire n°3 located on the right main gear burst during takeoff, probably due to wear. Few rubber debris damaged various elements of the main gear while other rubber debris were thrown into the right engine, causing it to lose power and the thrust reverser system to malfunction. The decision of the captain to abandon the takeoff procedure was correct but taken too late, more than four seconds after the warning light illuminated in the cockpit. A lack of crew training in emergency situations and a lack of increased monitoring of tire wear were considered as contributing factors. It was also determined that a period of 65,7 seconds elapsed between the brake release and the immobilization of the aircraft."}