{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-2b7-abuja-96-killed", "date": "Oct 29, 2006 at 1130 LT", "type": "Boeing 737-200", "operator": "ADC%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Abuja – Sokoto", "msn": "22891", "yom": 1983, "flight_number": "ADK053", "city": "Abuja", "zone": "Abuja Federal Capital Territory", "country": "Nigeria", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 4, "pax_on_board": 100, "pax_fatalities": 92, "other_fatalities": 0, "total_fatalities": 96, "captain_hours": 8545, "captain_hours_type": 353, "copilot_hours": 6497, "copilot_hours_type": null, "aircraft_hours": 56411, "circumstances": "The B737-200 aircraft which night-stopped at Calabar on Saturday the 28th of October, 2006, departed for Lagos in the morning of the 29th of October, 2006, and landed in Lagos at 0825 hrs. While on ground in Lagos, it uplifted some fuel. There was only cabin crew change. The aircraft departed Lagos on scheduled passenger service as ADK 063 at 0929 hrs and landed in Abuja at 1020 hrs. The aircraft uplifted 5000 litres of fuel and had 11000kg fuel for departure as ADK 053, a scheduled service to Sokoto. After boarding, it started raining and this compelled the crew to close the aircraft doors. Shortly after the rain had subsided, the doors were opened for the ground personnel to disembark. The crew then requested for start-up clearance. At 1115 hrs the aircraft was given a start up clearance for Sokoto. At 1121 hrs, the aircraft was given taxi clearance to holding position Runway 22. The pilot immediately requested for the wind, which was given as “210 variable at 8 kts”. Shortly after, the Control Tower transmitted the wind as south-westerly at 15 kts. While taxiing, the control tower advised Flight ADK 053 of gusty wind. The wind was initially given as 35 kts and then changed to 28 kts within 1 minute. At 1125 hrs while the aircraft was at the holding point, the crew was again advised of South-Westerly wind at 15 kts. At this juncture, the pilot of Virgin Nigeria 042 was heard on the radio saying “it looks like 35 kts to me” and then stated that he was going to wait for improvement in the weather, which he did. Thereafter, the ADK 053 crew requested for takeoff clearance and was cleared with right turn-out on course. Flight ADK 053 was airborne at 1129 hrs and was transferred to the Approach Control on 119.8MHZ but there was no acknowledgement from the crew. After three unsuccessful attempts to contact the aircraft, the Tower advised the Approach Control to call ADK 053. Other aircraft on the apron (Virgin Nigeria 042 and Trade Wings 2401), which were on that frequency were also asked to assist in contacting the aircraft but all attempts were unsuccessful. Kano and Lagos Area Controls were requested to contact ADK 053, but there was no response from the aircraft. Abuja Flight Communication Centre was then advised to inform National Emergency Management Agency (NEMA) in Kano about the loss of contact with the aircraft. At 1138 hrs, Flight Communication Centre called the Control Tower that someone came from a nearby village (Tungar Madaki) near the radar site and reported that a plane had crashed in their village. A search party from the airport was dispatched and they found and confirmed that the plane had crashed shortly after takeoff. The accident resulted in 96 fatalities out of 105 persons on board (POB). The accident occured at latitude N 08 59.691’ longitude E 007 14.772’ on an elevation of 1123 ft (ASL). The time of the accident was 1130 hrs during daylight and in rain.", "probable_cause": "Causal Factor:\r\nThe pilot’s decision to take-off in known adverse weather conditions and failure to execute the proper windshear recovery procedure resulted in operating the aircraft outside the safe flight regime, causing the aircraft to stall very close to the ground from which recovery was not possible.\r\nContributory Factors:\r\n1) Inability of the flight crew to apply windshear recovery procedures and the use of inappropriate equipment for windshear recovery procedure during simulator recurrency. Lack of company Standard Operating Procedures (SOP) for flight operations in adverse weather conditions.\r\n2) The coordination of responsibilities between the pilot-flying (PF) and pilot not flying(PNF) during their encounter with adverse weather situation was inconsistent with Standard Operating Procedures (SOP) for the duties of the pilot-flying (PF) and pilot not flying(PNF) resulting in the inadequate control of the aircraft."}