{"url": "https://www.baaa-acro.com/crash/crash-cessna-208-caravan-i-green-island", "date": "Feb 8, 2004 at 1610 LT", "type": "Cessna 208A Caravan", "operator": "Cape%20York%20Air", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Cairns - Cairns", "msn": "208-0108", "yom": 1986, "flight_number": null, "city": "Green Island", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5333, "captain_hours_type": 211, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft, with two pilots on board, was being operated for pilot type endorsement training. Air Traffic Control (ATC) had cleared the pilots to conduct upper level air work between 4,000 and 5,000 ft above mean sea level (AMSL) within a 5 NM radius of Green Island, Queensland. Following the upper level air work, the crew requested, and were granted a clearance for, a simulated engine failure and descent to 2,000 ft. The pilot in command (PIC) reported that while completing the simulated engine failure training, he had retarded the power lever to the FLIGHT IDLE stop and the fuel condition lever to the LOW IDLE range, setting a value of 55% engine gas generator speed (Ng). The pilot under training then set the glide attitude at the best glide speed (for the operating weight) of about 79 knots indicated airspeed (KIAS). The PIC then instructed the pilot under training to place the propeller into the feathered position, and maintain best glide speed. The PIC reported that he instructed the pilot under training to advance the emergency power lever (EPL) to simulate manual introduction of fuel to the engine. According to the PIC, he then noticed that there was no engine torque increase, with the engine inter-turbine temperature (ITT or T5) and Ng rapidly decreasing, and a strong smell of fuel in the cockpit. While the pilot under training flew the aircraft, the PIC placed the ignition switch to the ON position and also selected START on the engine starter switch. He then reportedly placed the EPL to the CLOSED position, the propeller to the UNFEATHERED position and the fuel condition lever to the IDLE CUTOFF position to clear the excess fuel from the engine. The PIC reported that they then increased the aircraft airspeed to 120 KIAS, at which point he reintroduced fuel into the engine by advancing the fuel condition lever. He reported that following these actions, the strong fuel smell persisted. As the aircraft approached 1,500 ft, the PIC broadcast a MAYDAY, informing ATC that they had a 'flameout' of the engine and that they were going to complete a forced landing water ditching near Green Island. While the pilot under training flew the aircraft, the PIC placed the propeller into the feathered position, closed the fuel condition lever to the IDLE CUTOFF position and turned off the starter and ignition switches. They then completed a successful landing in a depth of about 2 m of water near Green Island. The pilots evacuated the aircraft without injury. The aircraft, which sustained minor damage during the ditching, but subsequent substantial damage due to salt water immersion, was recovered to the mainland. Following examination of all connections and control linkages, the engine was removed for examination under the supervision of the Australian Transport Safety Bureau (ATSB) at the engine manufacturer's overhaul facility. The engine trend monitoring (ETM) data logger was also removed from the aircraft for examination.", "probable_cause": "The following factors were identified:\r\n1. The pilots of CYC were conducting in-flight familiarization training using the emergency power lever. That procedure was not contained in the aircraft manufacturer's pilot operating handbook.\r\n2. The engine manufacturer's documentation contained information on the use of the emergency power lever, which did not preclude the use of the emergency power lever for in-flight familiarization training.\r\n3. The engine sustained a flameout at an altitude above mean sea level from which reignition of the engine was not successfully completed.\r\n4. Erosion of the first-stage compressor blades would have reduced the aerodynamic efficiency of the compressor blades."}