{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c99-airliner-moosonee-1-killed", "date": "Apr 30, 1990 at 2138 LT", "type": "Beechcraft 99 Airliner", "operator": "Frontier%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Timmins - Moosonee", "msn": "U-197", "yom": 1982, "flight_number": "4F1602", "city": "Moosonee", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2423, "captain_hours_type": 298, "copilot_hours": 1038, "copilot_hours_type": 102, "aircraft_hours": 14766, "circumstances": "At 2043 eastern daylight time (EDT), Frontier Air Flight 1602, C-GFAW, a Beechcraft C99 Airliner, took off from Timmins, Ontario, on a scheduled domestic flight to Moosonee, Ontario. The aircraft carried a two-pilot crew, two passengers, and approximately 60 pounds of freight and baggage. The flight proceeded, via airways, to Moosonee at 7,000 feet above sea level. At 2121 EDT, the flight was cleared for an approach at Moosonee with a temporary altitude restriction of 5,000 feet. The crew elected to fly the very high frequency omnidirectional range (VOR) runway 24 approach. At 2129 EDT, the crew reported on the 061° radial of the VOR at five nautical miles (nm) outbound. Shortly after intercepting the 061° radial inbound, the crew initiated a descent to the 440-foot minimum descent altitude (MDA). While in the descent, the aircraft broke through the lowest cloud layer at 900 feet asl, approximately 9.2 nm from the VOR. At this point, both pilots had the runway lights in sight, and the captain decided to change to a visual approach and proceed inbound at 700 feet asl. Shortly after advising the co-pilot of his intentions, the captain initiated the before-landing cockpit check and selected the landing gear lever to the DOWN position. Immediately thereafter, the aircraft struck trees and crashed seven miles east-northeast of the Moosonee Airport. One of the pilot was killed while three other occupants were injured. ", "probable_cause": "It was determined that the captain inadvertently flew the aircraft into trees, during a condition of visual illusion, as a result of inadequate crew coordination in that neither pilot effectively monitored the altimeter. Contributing to the occurrence were the absence of approach lighting, the lack of company crew pairing policy, the captain’s unfamiliarity with black-hole illusion and the seating position of the captain."}