{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130e-i-hercules-near-dien-bien-phu-11-killed", "date": "Dec 29, 1967", "type": "Lockheed C-130 Hercules", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Mountains", "schedule": "Nha Trang - Nha Trang", "msn": "4040", "yom": 1965, "flight_number": null, "city": "Lai Châu", "zone": "Lai Châu Province", "country": "Vietnam", "region": "Asia", "crew_on_board": 11, "crew_fatalities": 11, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after midnight on the 28th a Combat talon C-130E-I, flown by crew S-01, took off from Nha Trang and headed at low-level towards Hanoi on a special operations mission. The aircraft was to make a leaflet drop west of the city followed by a diversionary resupply drop in the Song Da Valley in North Vietnam. Diversionary drops were sometimes made by the Combat Talon aircraft to fool the enemy into thinking that a clandestine team was working in a particular area. The aircraft made a radio transmission about four hours later indicating that the mission was progressing normally. After that message there was no further radio contact and the aircraft was posted as missing on the morning of the 29th. It was presumed that the aircraft had either been shot down by ground fire over North Vietnam or had flown into the ground as it was returning at low-level in the dark. A two-week search along the aircraft's planned route failed to reveal any sightings of wreckage. Investigations at a crash site in mountain in the Lai Châu province of North Vietnam in 1992 and 9913 failed to provide conclusive evidence of human remains. The aircraft had crashed about 51 km northeast of Điện Biên Phủ and the site had already been scavenged by villagers. However a subsequent investigation did discover some scant remains but these are still awaiting positive identification. The wreckage was found just below the summit of a high karst cliff indicating that the aircraft had probably flown into high ground as it was returning from its mission. \r\nCrew:\r\nCpt Edwin Nelms Osborne,\r\nCpt Gerald Gordon Van Buren,\r\nMaj Charles Peter Claxton,\r\nMaj Donald Ellis Fisher,\r\nCpt Frank Claveloux Parker,\r\nCpt Gordon James Wenaas,\r\nT/Sgt Jack McCrary,\r\nS/Sgt Wayne Alvin Eckley,\r\nS/Sgt Gean Preston Clapper,\r\nA1C Edward Joseph Darcy,\r\nA1C James Randall Williams.\r\nSource: Chris Hobson", "probable_cause": null}