{"url": "https://www.baaa-acro.com/crash/crash-cessna-t303-crusader-aldeburgh", "date": "Sep 19, 2006 at 1328 LT", "type": "Cessna 303 Crusader", "operator": "Aerowest-Flugcenter-2", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Braunschweig – Oxford", "msn": "303-00244", "yom": 1983, "flight_number": null, "city": "Aldeburgh", "zone": "Suffolk", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 24000, "captain_hours_type": 6000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Whilst on a cargo flight from Braunschweig, Germany, to Oxford, England, when approximately 30 nm from the English coast, the right engine started to run roughly. On checking the fuel gauges, the pilot observed that they were indicating in the ‘red sector’. The right engine subsequently stopped, shortly followed by the left engine. The aircraft then glided from FL100 towards the Suffolk coast and ditched in the sea approximately 9.5 nm southeast of Aldeburgh. The pilot was able to abandon the aircraft, which sank quickly. He was rescued from the sea some 18 minutes later by a Royal Air Force Search and Rescue helicopter and taken to hospital, where he was found to have suffered a fractured a vertebra. The investigation determined that the aircraft had run out of fuel, due to insufficient fuel for the intended journey being on-board the aircraft at the start of the flight.", "probable_cause": "The accident occurred as a result of the aircraft running out of fuel approximately 160 nm short of its destination. Although the wreckage of the aircraft was not recovered, all the evidence suggests that this occurred due to insufficient fuel being on-board the aircraft prior to departure, rather than because of a technical problem. The pilot’s lack of awareness of the fuel quantity and the actual weight of the cargo on board D-IAFC prior to takeoff, are considered to have been significant causal factors in the accident. A contributory factor was that the pilot did not monitor the reportedly ‘unreliable’ fuel gauges, thus missing a chance to notice the aircraft’s low fuel state and divert to a suitable airfield before the situation became critical."}