{"url": "https://www.baaa-acro.com/crash/crash-iai-1124-westwind-panama-city-7-killed", "date": "Jul 2, 2004 at 1338 LT", "type": "IAI 1124 Westwind", "operator": "Air%20Ambulance%20by%20Air%20Trek", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Quito – Panama City – Washington DC – Milan", "msn": "247", "yom": 1979, "flight_number": null, "city": "Panama City-Tocumen", "zone": "Panamá", "country": "Panama", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 1, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On July 2, 2004, at 1338 eastern standard time, a U.S. registered Westwind model 1124 corporate jet, N280AT, operated by Air Trek, Inc., as a Part 135 commercial air ambulance flight, impacted terrain and crashed into a building after departing from the Tocumen International Airport (MPTY), Tocumen, Panama. The airplane was destroyed by impact forces and post-crash fire. All six occupants on the airplane were fatally injured. A seventh person was also fatally injured on the ground. Visual meteorological conditions prevailed, and an instrument flight rules (IFR) flight plan was filed. The flight originated from Quito, Ecuador, and stopped in Tocumen for fuel. The flight was destined for Milan, Italy, via another fuel and crew-change stop at the Dulles International Airport, near Washington, DC. According to the operator, the airplane was flown with the two pilots and two flight nurses from Punta Gorda, Florida, to Guayaquil, Ecuador, on July 1, 2004. The airplane was refueled with 450 gallons of Jet A upon arrival, and remained overnight. On July 2, 2004, the airplane was fueled with an additional 150 gallons of Jet A, and subsequently departed for Quito, Ecuador. Upon arriving in Quito, two passengers were boarded, and the flight departed for Panama, where it would be refueled. The airplane was not fueled during the stop in Quito. According to the Panama Autoridad Aeronautica Civil, the flight landed in Panama uneventfully, and proceeded to the north ramp at the main terminal. The flightcrew requested from ground service personnel that the airplane be refueled with 600 gallons of Jet A. The flightcrew specifically requested that 500 gallons of fuel be added utilizing the pressure point fueling station, and 100 gallons be added to the auxiliary tank, utilizing a gravity filler port. After refueling, the airplane was started and taxied to runway 03L. An air traffic controller observed the airplane as it began to takeoff. He recalled that, \"It pitched up vertically, the nose then lowered, and the wings rocked side to side. The airplane then veered to the right and descended out of view.\" A witness, who was located north of the accident site, observed the airplane veering to the right, before descending from his view. The airplane impacted the ground on taxiway Hotel, north of taxiway Bravo, and a fire ensued. The right wing and right engine separated from the fuselage and fragmented into multiple pieces. The vertical stabilizer impacted the ground, and separated from the fuselage. The main fuselage, left wing, and left engine continued across a grass field, where it struck an airport worker, and impacted a concrete wall. The airplane continued through the wall, and came to rest inverted inside a building. Airport crash fire and rescue responded to the accident, and contained the post crash fire within 3 minutes. The wreckage path was oriented on a heading of about 80 degrees. Ground scars on the taxiway were consistent with the right wing tip tank impacting the taxiway surface with the airplane in a nose high attitude, banked 90 degrees to the horizon. The scars continued forward, with the airplane rolling onto its back, collapsing the vertical stabilizer. About 35 feet beyond the vertical stabilizer impact point, scars were observed from the left tip tank. Debris from the cockpit and forward cabin area was observed in the grass area along the wreckage path. Airport personnel tested the fuel truck used to refuel the airplane for contamination after the accident. No abnormalities were noted. The cockpit voice recorder (CVR) was forwarded to the National Transportation Safety Board, Washington, D.C. for further review. The left and right engines, the horizontal stabilizer trim actuator, and the airplane's annunciator warning panel, were also retained for further examination.", "probable_cause": null}