{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47-dl-near-ward-3-killed", "date": "Jan 21, 1948 at 1630 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "FAA", "flight_phase": "Flight", "flight_type": "Calibration", "survivors": "No", "site": "Mountains", "schedule": "Denver – Grand Junction", "msn": "4776", "yom": 1942, "flight_number": null, "city": "Ward", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3662, "captain_hours_type": 872, "copilot_hours": 1403, "copilot_hours_type": 53, "aircraft_hours": 4000, "circumstances": "The aircraft departed Denver at 1602 for Grand Junction. The crew, all employees of the Civil Aeronautics Administration, consisted of Fred L. Snavely, pilot; Warren L. Lungstrum, copilot; and Ross C. Brown, observer. Over the route to Grand Junction a check was to be made by these men of the VHF (very high frequency) airway facilities to determine whether they were operating normally. According to the flight plan, the flight was to proceed over Red Airway 6 at an air speed of 150 mph. Though only 2 hours were required for the trip, 8 hours supply of fuel was carried. Information supplied to Copilot Lungstrum at the Denver United States Weather Bureau Office was to the effect that clear weather conditions existed generally over the intended route. Over Fraser, Colorado, located approximately 50 miles west northwest of Denver, however, broken clouds were reported. Since this layer of clouds was only 2,000 feet in depth, with tops at 13,500 feet above sea level, it appeared that a cruising altitude of 14,000 or 15,000 feet would be high enough for the flight. Winds at that altitude were from the northwest at 50 mph. Weather Bureau personnel advised that these winds would result in considerable turbulence. Take-off was accomplished at 1602. Twenty-two minutes later, at 1624, the CAA communication station at Denver received a position report from the flight that it was at an altitude of 14,500 feet, 500 feet over the top of clouds, and 20 miles west of Denver. The flight also reported that they were experiencing severe turbulence. Since the flight plan specified that the trip would be made in accordance with visual flight rules, and since the position report indicated that the aircraft was being flown over the top of clouds, the flight was requested at the termination of their 1624 position to verify whether they were actually proceeding in accordance with visual flight rules. A response in the affirmative was received. About one minute after the 1624 report the CAA communicator at Cheyenne, Wyoming, called NC206 and asked for a check of his station’s radio transmission. NC206 responded, “Read Cheyenne Radio loud and clear.” The communicator then asked for a position report from NC206, and the flight replied, “We are approximately. . . .” The remainder of this message, received shortly after 1625, was garbled and faded. The Cheyenne communicator attempted to contact the flight again but was unable to do so. Since interference to radio transmission could have resulted from the mountain ranges between Cheyenne and the aircraft, and since the Cheyenne communicator had overheard the report of severe turbulence, he presumed that the crew was completely occupied in flying the aircraft, and that either they had not heard the last transmission or were too busy at the time to acknowledge. Accordingly, he placed no significance on the failure of the flight to reply. A request had previously been made by the communication station at Eagle, Colorado, for the flight to check the radio transmission of that station. Since Eagle Radio did not receive any calls from NC206, the station called the flight at 1645. No reply was received. Repeated calls were made by the communicator at Eagle on all available frequencies at three-minute intervals until 1735. Then the station requested information concerning the flight from Grand Junction Radio, but neither Grand Junction Radio nor any other radio station on the route had received a call from NC206 since 1625. At 1825, 23 minutes after the estimated arrival time of NC206 at Grand Junction, an emergency was declared.", "probable_cause": "The Board determines that the probable cause of this accident was an excessive loss of altitude resulting from a downdraft in an area of severe turbulence."}