{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-8-islander-kralendijk-1-killed", "date": "Oct 22, 2009 at 1017 LT", "type": "Britten-Norman Islander", "operator": "Divi%20Divi%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Willemstad – Kralendijk", "msn": "377", "yom": 1973, "flight_number": "DVR014", "city": "Kralendijk", "zone": "Dutch Antilles", "country": "Dutch Antilles", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1738, "captain_hours_type": 565, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16670, "circumstances": "On 22 October the pilot concerned got up at 05.00 and drove towards the airport at about 05.30. After preparing the aircraft, with registration PJ-SUN, he piloted two return flights from Curaçao International Airport (hereinafter to be referred to as Hato airport) to Bonaire International Airport (hereinafter to be referred to as Flamingo airport). No problems occurred during these four flights. The departure for the next flight, “DVR014”, was planned at 09.30. The nine passengers booked for this flight, who had already had their luggage weighed, had to wait before they could board because the pilot had ordered the aircraft to be refuelled prior to this flight. The refuelling invoice of flight DVR014 specifies that fuel was taken up between 09.28 and 09.38. The luggage of these passengers and some additional cargo consisting of a few boxes had already been loaded on to the aircraft. The passengers were welcomed by the pilot when they boarded. The pilot informed them they should keep their waist belts fastened during the flight and that the safety cards were located in the seat pockets. From the passenger statements it can be deduced that these instructions were not heard by all of the passengers. The pilot and the passenger seated next to him fastened their waist and shoulder belts. Approximately ten minutes after the estimated time of departure, after having received the required approval from the Hato Tower air traffic control tower (hereinafter to be referred to as Hato Tower) via the on-board radio the engines were started without any problems. The flight manual engine ground checks were not extensively performed because these are part of the first flight of the day engine checks in accordance with the General Operating Manual. Around 09.47 the PJ-SUN took off for a flight with visual flight rules (VFR) to Bonaire. After take-off the aircraft climbed to flight level 035 (FL035). Some of the passengers had flown for some years, several times in a week with Divi Divi Air. From the passenger statements it can be deduced that the pilot brought the aircraft into level flight at FL035 and reduced the power from climb power to cruise power. The passenger next to the pilot stated that engine power ceased the moment that the pilot was adjusting (one of) the levers on the throttle quadrant. Some passengers reported they felt a jolt that moment. Some passengers reported the engine sputtered shortly before it ceased. No sound from which a mechanical problem was heard and no smoke was detected. Passengers stated that the pilot increased the left engine power, feathered the right propeller and trimmed away the forces to the rudder pedals due to the failure of the right engine. They also reported that the pilot attempted to restart the right engine two or three times but to no avail. Around 09.52 the pilot reported to the Hato Tower controller: Divi 014 requesting to switch to Flamingo, priority landing with Flamingo, have lost one of the engines. The controller acknowledged this message. The pilot continued the flight to Bonaire flying with the left engine running and contacted Flamingo Tower air traffic control (hereinafter to be referred to as Flamingo Tower) at 09.57 and reported: 014, Islander inbound from Curaçao, showing, I got one engine out, so we are landing with one engine, no emergency at this stage, I’m maintaining altitude at, 3000 feet, we request priority to landing runway 10, currently 24 miles out, estimating at, 18. The Flamingo Tower controller authorized the approach to runway 10. The air traffic controller requested the pilot to report when he left 3000 feet altitude, which he immediately did. The radar data shows that the PJ-SUN descended approximately 140 feet per minute on average from the moment the engine failed up to the emergency landing. According to the statements of a few of the passengers, the aircraft pitch attitude increased during the descent of the aircraft and it was higher than usual. The indicated airspeed on the airspeed indicator was lower than when flying with two working engines. The pilot did not inform the passengers regarding the failure of the right engine or his intentions. A few passengers were concerned and started to put on the life jackets having retrieved them from under their seats. The passenger next to the pilot could not find his life jacket, while others had some trouble opening the plastic bags of the life jackets. They also agreed on a course of action for leaving the aircraft in case of an emergency landing in the water. At 10.08 the pilot informed the Flamingo Tower that he was approaching and was ten nautical miles away, flying at 1000 feet and expected to land in ten minutes. At 10.12 the pilot reported the distance to be eight nautical miles and that he was having trouble with the altitude which was 600 feet at that moment. The traffic controller authorized the landing. At 10.14 the pilot reported to be six nautical miles away and flying at an altitude of 300 feet. During the last radio contact at 10.15 the pilot indicated to be at five nautical miles distance flying at 200 feet and that he was still losing altitude. The pilot was going to perform an emergency landing near Klein Bonaire. The aircraft subsequently turned a little to the left towards Klein Bonaire. According to a few passengers, the pilot turned around towards them and indicated with hand signals that the aircraft was about to land and he gave a thumbs-up signal to ask whether everyone was ready for the approaching emergency landing. There were life jackets for all people on-board. The pilot, the passenger seated next to him and two passengers seated in the back row did not have their life jackets on. The passengers in rows two through to four had put on their life jackets. One passenger had put on his life jacket back to front. According to the statements of the passengers, the stall warning (loud tone) was activated on and off during this last part of the flight. A short time before the emergency landing until the moment of impact with the water the stall warning was continuously audible. From the statements of the passengers it follows the all cabin doors were closed throughout the descent and the landing. The passenger’ statements differ in describing the last part of the flight until the impact of the aircraft with the water surface. One passenger stated that the aircraft fell down from a low height and impacted the water with a blow. Other passengers mentioned a high or low aircraft pitch attitude during impact. Most of the passengers stated that during impact the left wing was slightly down. The aircraft hit the water at 10.17 at a distance of approximately 0.7 nautical miles from Klein Bonaire and 3.5 nautical miles west of Bonaire. The left front door broke off from the cabin and other parts of the aircraft on impact. The aircraft was lying horizontally in the water. The height of the waves was estimated 0.5 meter by one of the passengers. The cabin soon filled with water because the left front door had broken off and the windscreen had shattered. The passenger behind the pilot was trapped, but was able to free herself from this position. All nine passengers were able to leave the aircraft without assistance using the left front door opening and the emergency exits. A few passengers sat for a short time on the wings before the aircraft sank. The passengers formed a circle in the water. The passengers who were not wearing life jackets kept afloat by holding onto the other passengers. One passenger reported that the pilot hit his head on the vertical door/window frame in the cockpit or the instrument panel at impact causing him to lose consciousness and may even have been wounded. The attempts of one or two passengers to free the pilot from his seat were unsuccessful. A few minutes after the accident, the aircraft sank with the pilot still on-board. Approximately five minutes after the emergency landing, two boats with recreational divers who were nearby arrived on the scene. Divers from the first boat tried to localise the sunken aircraft based on indications from the passengers. The people on the other boat took nine passengers out of the water and set course to Kralendijk where they arrived at approximately 10.37. The police and other emergency services personnel were awaiting the passengers on the quay. Six passengers were transported to the hospital where they were discharged after an examination. The other three went their own way.", "probable_cause": " The following factors were identified:\r\n1. After one of the two engines failed, the flight continued to Bonaire. By not returning to the nearby situated departure airport, the safest flight operation was not chosen.\r\n- Continuing to fly after engine failure was contrary to the general principle for twin-engine aircraft as set down in the CARNA, that is, to land at the nearest suitable airport.\r\n2. The aircraft could not maintain horizontal flight when it continued with the flight and an emergency landing at sea became unavoidable.\r\n- The aircraft departed with an overload of 9% when compared to the maximum structural take-off weight of 6600 lb. The pilot who was himself responsible (self-dispatch and release) for the loading of the aircraft was aware of the overloading or could have been aware of this. A non-acceptable risk was taken by continuing the flight under these conditions where the aircraft could not maintain altitude due to the overloading.\r\n3. The pilot did not act as could be expected when executing the flight and preparing for the emergency landing.\r\n- The landing was executed with flaps up and, therefore, the aircraft had a higher landing speed.\r\n- The pilot ensured insufficiently that the passengers had understood the safety instructions after boarding.\r\n- The pilot undertook insufficient attempts to inform passengers about the approaching emergency landing at sea after the engine failure and, therefore, they could not prepare themselves sufficiently.\n\r\nContributing factors:\r\nDivi Divi Air\r\n4. Divi Divi Air management paid insufficient supervision to the safety of amongst others the flight operation with the Britten-Norman Islanders. This resulted in insufficient attention to the risks of overloading.\r\nFindings:\r\n- The maximum structural take-off weight of 6600 lb was used as limit during the flight operation. Although this was accepted by the oversight authority, formal consent was not\r\ngranted for this.\r\n- A standard average passenger weight of 160 lb was used on the load and balance sheet while the actual average passenger weight was significantly higher. This meant that passenger weight was often lower on paper than was the case in reality.\r\n- A take-off weight of exactly 6600 lb completed on the load and balance sheet occurred in 32% of the investigated flights. This is a strong indication that the luggage and fuel weights completed were incorrect in these cases and that, in reality, the maximum structural take-off weight of 6600 lb was exceeded.\r\n- Exceedances of the maximum structural landing weight of 6300 lb occurred in 61% of the investigated flights.\r\n- The exceedance of the maximum allowed take-off weight took place on all three of the Britten-Norman Islander aircraft in use and with different pilots.\r\n- Insufficient attention was paid to aircraft weight limitations during training.\r\n- Lack of internal supervision with regard to the load and balance programme.\r\n- Combining management tasks at Divi Divi Air, which may have meant that insufficient details were defined regarding the related responsibilities.\r\n5. The safety equipment and instructions on-board the Britten-Norman Islander aircraft currently being used were not in order.\r\nFindings:\r\n- Due to the high noise level in the cabin during the flight it is difficult to communicate with the passengers during an emergency situation.\r\n- The safety instruction cards did not include an illustration of the pouches under the seats nor instructions on how to open these pouches. The life jacket was shown with two and not a single waist belt and the life jackets had a different back than the actual life jackets on-board.\r\nDirectorate of Civil Aviation Netherlands Antilles (currently the Curaçao Civil Aviation Authority)\r\n6. The Directorate of Civil Aviation’s oversight on the operational management of Divi Divi Air was insufficient in relation to the air operator certificate involving the Britten-Norman Islander aircraft in use.\r\nFindings:\r\n- The operational restrictions that formed the basis for using 6600 lb were missing in the air operator certificate, in the certificate of airworthiness of the PJ-SUN and in the approved General Operating Manual of Divi Divi Air. The restrictions entail that flying is only allowed during daylight, under visual meteorological conditions, and when a route is flown from where a safe emergency landing can be executed in case of engine failure.\r\n- The required (demonstrable) relation with the actual average passenger weight was missing in relation to the used standard passenger weight for drawing up the load and balance sheet.\r\n- The failure of Divi Divi Air’s internal supervision system for the load and balance programme.\r\n- Not noticing deviations between the (approved) safety instruction cards and the life jackets on-board during annual inspections.\r\n- The standard average passenger weight of 176 lb set after the accident offers insufficient security that the exceedance of the maximum allowed take-off weight of flights with Antillean airline companies that fly with the Britten-Norman Islander will not occur.\n\r\nOther factors:\r\nRecording system of radio communication with Hato Tower\r\n7. The recording system used for the radio communication with Hato Tower cannot be used to record the actual time. This means that the timeline related to the radio communication with Hato Tower cannot be exactly determined.\r\nThe alerting and the emergency services on Bonaire\r\n8. There was limited coordination between the different emergency services and, therefore, they did not operate optimally.\r\nFindings:\r\n- The incident site command (Copi) that should have taken charge of the emergency services in accordance with the Bonaire island territory crisis plan was not formed.\r\n- Insufficient multidisciplinary drills have been organized and assessed for executive officials who have a task to perform in accordance with the Bonaire island territory crisis plan and the airport aircraft accident crisis response plan in controlling disasters and serious accidents. They were, therefore, insufficiently prepared for their task.\r\n9. The fire service and police boats could not be deployed for a longer period of time."}