{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-25-dk-near-da-nang-27-killed", "date": "Nov 10, 1962 at 1437 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Air%20Vietnam", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Huế – Đà Nẵng", "msn": "16074/32822", "yom": 1945, "flight_number": null, "city": "Đà Nẵng", "zone": "Đà Nẵng City District", "country": "Vietnam", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 24, "pax_fatalities": 24, "other_fatalities": 0, "total_fatalities": 27, "captain_hours": 5711, "captain_hours_type": 4080, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Air Vietnam DC-3, XV-NID, was on a scheduled domestic flight from Huế to Đà Nẵng. It took off from Huế at 1420LT with 3 crew and 24 passengers aboard. The air route from Huế to Đà Nẵng is over the sea and requires alterations of course along the route. After take-off XV-NID headed out to sea and at 1423LT it took the first course at an altitude of about 300 meters (1,000 feet). At 1426LT the aircraft requested and obtained permission from Huế ATC to change to the Đà Nẵng ATC frequency 113.1 Mc/s. Difficulty in establishing radio communications between the aircraft and Đà Nẵng was experienced up 1436LT. At that time XV-NId requested the weather conditions and the runway in use at Đà Nẵng. Đà Nẵng transmitted the information which was acknowledged by the aircraft with the statement that it would call when on the downwind leg of runway 35. Đà Nẵng then requested the aircraft's position and estimated time of arrival but received no reply. Further attempts to contact XV-NID were unsuccessful. The accident occurred at approximately 1437LT. On 13 November the wreckage of the aircraft was located on a mountain at an elevation of 550 meters (1,800 feet), 19,6 km north northwest of Đà Nẵng Airport. All 27 occupants have been killed. ", "probable_cause": "The accident probably resulted from a navigational error in adverse meteorological conditions."}