{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690b-konawa-1-killed", "date": "Jun 25, 1992 at 0833 LT", "type": "Rockwell Grand Commander 690", "operator": "Aircraft Sales International", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Plain, Valley", "schedule": "Norman - Fort Lauderdale", "msn": "690-11479", "yom": 1978, "flight_number": null, "city": "Konawa", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 8857, "captain_hours_type": 98, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3355, "circumstances": "As the airplane was deviating around low intensity weather returns, and passing through 20,500 feet during climb out, it departed controlled flight and entered a right spiral. Descent rates exceeded 16,600 fpm during the descent from 18,300 feet to 3,900 feet and then slowed. Witnesses stated they saw the airplane descend from the clouds in a right flap spin. The empennage had separated from the airplane in pieces. Pieces of the wreckage were found up to 1.5 mile from the primary impact point. Both wings remained attached. The right engine was flamed out, and the propeller was feathered at impact. No mechanical reason for the flameout could be determined. At no time did the pilot indicate he was having difficulties. The NTSB weather study indicated that moderate turbulence was present in the area. The pilot's toxicology tests found 0.151 ug/ml of chlorpheniramine in the blood; normal therapeutic concentration is 0.01 to 0.04. Effects of overdosage include sedation, diminished mental alertness, and cardiovascular collapse to stimulation. The pilot, sole on board, was killed. ", "probable_cause": "The pilot's failure to maintain control of the airplane which resulted in an inadvertent spiral and subsequent rapid descent. The design stress limits of the airframe were exceeded resulting in an overload failure of the empennage. Factors related to the accident were: turbulence and the pilot's physical impairment due to drugs."}