{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-63cf-stockton", "date": "Oct 16, 1969 at 1545 LT", "type": "Douglas DC-8", "operator": "Seaboard%20World%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Oakland - Stockton - Oakland", "msn": "46021/424", "yom": 1968, "flight_number": null, "city": "Stockton", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 19308, "captain_hours_type": 1747, "copilot_hours": 4210, "copilot_hours_type": 725, "aircraft_hours": 3441, "circumstances": "The aircraft overran the departure end of runway 29R at Stockton Metropolitan Airport, California, during the performance of a crew training flight. The aircraft struck a roadway thereby collapsing the left main and nose landing gears. The aircraft came to rest 792 feet beyond the end of the runway. The aircraft was destroyed by fire. The five crewmembers aboard were uninjured. The flight was scheduled for use for recurrent training and annual proficiency checks of first officers in DC-8 equipment. The flight originated at the Oakland International Airport (OAK) and was to terminate at OAK. Training maneuvers were to be conducted in the Stockton area, with landing and takeoff practice to be performed at the Stockton Metropolitan Airport. During a touch-and-go landing on Runway 29R at the Stockton Metropolitan Airport, the captain rejected the takeoff because of the sounding of a takeoff warning hob and the activation of a ground spoiler extend light. The crew was not able to stop the aircraft on the remaining runway. ", "probable_cause": "A false ground spoiler position indication during the takeoff portion of a touch and go landing that induced the captain to discontinue the takeoff at a point too far down the runway to permit him to stop the aircraft on the runway."}