{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-17e-flying-fortress-kauai-island-1-killed", "date": "Dec 27, 1941 at 2355 LT", "type": "Boeing B-17 Flying Fortress", "operator": "USAAF", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Hickam - Hickam", "msn": "2213", "yom": 1941, "flight_number": null, "city": "Kauai Island", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 10, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane departed Hickam AFB on a maritime patrol flight with a crew of 10 on board, looking for the Japanese invasion fleet which was expected after the December 7th attack. Just after their inbound turn the navigator discovered that there were some inconsistencies with their ‘known’ position and his estimated position. This pattern was repeating itself each time he took a sextant sighting. After reporting this to the pilot, he began a step by step check of all contributing factors and found the problem was the aircraft compass. It had not been recalibrated after the 0.50 caliber machine gun had been installed nearby. Therefore the compass was not reliable. The crew asked for a radio and heading check with Pearl Harbor. The heading they received was mixed up with another aircraft thus heading the B-17E out to sea - not to land. With no land in sight, it was getting dark and they were low on fuel. The pilot began a controlled ditching in the open sea about midnight, forty miles south of Kauai Island. With the nose up, the aircraft hit the water; the tail section up to just aft of the wings broke off and drifted away. Water came rushing into the compartments and everyone got out as best they could. In the water, they found only two 2-man rafts had deployed and were upside down. The other expected rafts did not launch when the aircraft hit the water. While clinging to the rafts, they began a crew count. One crew member was missing. It was dark and hard to see anything. Climbing onto the upside down rafts, they began calling for him. They heard a faint voice in the distance and began to move in that direction. They found the crew man riding, cowboy style, on the tail section, in front of the vertical stabilizer bruised but unhurt. Now they were all together, cold, wet, a long way from base, and a long night ahead. After three days and nights afloat, they were located by a PBY-5 Catalina which landed in heavy seas to rescue them, damaging the hull in the swell. Returning to Pearl Harbor, because of the damage to the PBY hull during the water landing, the PBY had to make a high speed run and fly up the sea plane ramp. The pilots nosed the PBY up the ramp and it skidded across the tarmac, came to a halt and slowly rocked onto one wing float. There were a lot of people waiting for them - Army, Navy, Medics. The nine crew were back at Pearl and on the way to the hospital.\r\nSource: www.joebaugher.com", "probable_cause": "Technical issues with a compass. "}