{"url": "https://www.baaa-acro.com/crash/crash-bae-jetstream-31-wilkes-barre-19-killed", "date": "May 21, 2000 at 1148 LT", "type": "BAe Jetstream 31", "operator": "Executive%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Atlantic City – Wilkes-Barre", "msn": "834", "yom": 1988, "flight_number": null, "city": "Wilkes-Barre", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 17, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 19, "captain_hours": 8500, "captain_hours_type": 1874, "copilot_hours": 1282, "copilot_hours_type": 742, "aircraft_hours": 13972, "circumstances": "On May 21, 2000, about 1128 eastern daylight time (EDT), a British Aerospace Jetstream 3101, N16EJ, operated by East Coast Aviation Services (doing business as Executive Airlines) crashed\r\nabout 11 miles south of Wilkes-Barre/Scranton International Airport (AVP), Wilkes-Barre, Pennsylvania. The airplane was destroyed by impact and a post crash fire, and 17 passengers and two flight crewmembers were killed. The flight was being conducted under 14 Code of Federal Regulations (CFR) Part 135 as an on-demand charter flight for Caesar’s Palace Casino in Atlantic City, New Jersey. An instrument flight rules (IFR) flight plan had been filed for the flight from Atlantic City International Airport (ACY) to AVP. The captain checked in for duty about 0800 at Republic Airport (FRG) in Farmingdale, New York, on the day of the accident. The airplane was originally scheduled to depart FRG at 0900 for ACY and to remain in ACY until 1900, when it was scheduled to return to FRG. While the pilots were conducting preflight inspections, they received a telephone call from Executive Airlines’ owner and chief executive officer (CEO) advising them that they had been assigned an additional flight from ACY to AVP with a return flight to ACY later in the day, instead of the scheduled break in ACY. Fuel records at FRG indicated that 90 gallons of fuel were added to the accident airplane’s tanks before departure to ACY. According to Federal Aviation Administration (FAA) air traffic control (ATC) records, the flight departed at 0921 (with 12 passengers on board) and arrived in ACY at 0949. According to passenger statements, the captain was the pilot flying from FRG to ACY. After arrival in ACY, the flight crew checked the weather for AVP and filed an IFR flight plan. Fuel facility records at ACY indicated that no additional fuel was added. The accident flight to AVP, which departed ACY about 1030, had been chartered by Caesar’s Palace. According to ATC records, the flight to AVP was never cleared to fly above 5,000 feet mean sea level (msl). According to ATC transcripts, the pilots first contacted AVP approach controllers at 1057 and were vectored for an instrument landing system (ILS) approach to runway 4. The flight was cleared for approach at 1102:07, and the approach controller advised the pilots that they were 5 nautical miles (nm) from Crystal Lake, which is the initial approach fix (IAF) for the ILS approach to runway 4. The pilots were told to maintain 4,000 feet until established on the localizer. At 1104:16, the approach controller advised that a “previous landing…aircraft picked up the airport at minimums [decision altitude].” The pilots were instructed to contact the AVP local (tower) controller at 1105:09, which they did 3 seconds later. The airplane then descended to about 2,200 feet, flew level at 2,200 feet for about 20 seconds, and began to climb again about 2.2 nm from the runway threshold when a missed approach was executed (see the Airplane Performance section for more information).  At 1107:26 the captain reported executing the missed approach but provided no explanation to air traffic controllers. The tower controller informed the North Radar approach controllers of the missed approach and then instructed the accident flight crew to fly runway heading, climb to 4,000 feet, and contact approach control on frequency 124.5 (the procedure published on the approach chart). The pilots reestablished contact with the approach controllers at 1108:04 as they climbed through 3,500 feet to 4,000 feet and requested another ILS approach to runway 4. The flight was vectored for another ILS approach, and at 1110:07 the approach controller advised the pilots of traffic 2 nm miles away at 5,000 feet. The captain responded that they were in the clouds. At 1014:38, the controller directed the pilots to reduce speed to follow a Cessna 172 on approach to the airport, and the captain responded, “ok we’re slowing.” The flight was cleared for a second approach at 1120:45 and advised to maintain 4,000 feet until the airplane was established on the localizer. At 1123:49 the captain transmitted, “for uh one six echo juliet we’d like to declare an emergency.” At 1123:53, the approach controller asked the nature of the problem, and the captain responded, “engine failure.” The approach controller acknowledged the information, informed the pilots that the airplane appeared to be south of the localizer (off course to the right), and asked if they wanted a vector back to the localizer course. The flight crew accepted, and at 1124:10 the controller directed a left turn to heading 010, which the captain acknowledged. At 1124:33, the controller asked for verification that the airplane was turning left. The captain responded, “we’re trying six echo juliet.” At 1124:38, the controller asked if a right turn would be better. The captain asked the controller to “stand by.” At 1125:07, the controller advised the pilots that the minimum vectoring altitude (MVA) in the area was 3,300 feet. At 1125:12, the captain transmitted, “standby for six echo juliet tell them we lost both engines for six echo juliet.” At that time, ATC radar data indicated that the airplane was descending through 3,000 feet. The controller immediately issued the weather conditions in the vicinity of the airport and informed the flight crew about the location of nearby highways. At 1126:17, the captain asked, “how’s the altitude look for where we’re at.” The controller responded that he was not showing an altitude readout from the airplane and issued the visibility (2.5 miles) and altimeter setting. At 1126:43, the captain transmitted, “just give us a vector back to the airport please.” The controller cleared the accident flight to fly heading 340, advised the flight crew that radar contact was lost, and asked the pilots to verify their altitude. The captain responded that they were “level at 2,000.” At 1126:54, the controller again advised the flight crew of the 3,300-foot MVA and suggested a 330° heading to bring the airplane back to the localizer. At 1127:14 the controller asked, “do you have any engines,” and the captain responded that they appeared to have gotten back “the left engine now.” At 1127:23, the controller informed the pilots that he saw them on radar at 2,000 feet and that there was a ridgeline between them and the airport. The captain responded, “that’s us” and “we’re at 2,000 feet over the trees.” The controller instructed the pilots to fly a 360° heading and advised them of high antennas about 2 nm west of their position. At 1127:46, the captain transmitted, “we’re losing both engines.” Two seconds later the controller advised that the Pennsylvania Turnpike was right below the airplane and instructed the flight crew to “let me know if you can get your engines back.” There was no further radio contact with the accident airplane. The ATC supervisor initiated emergency notification procedures. A Pennsylvania State Police helicopter located the wreckage about 1236, and emergency rescue units arrived at the accident site about 1306. The accident occurred in daylight instrument meteorological conditions (IMC). The location of the accident was 41° 9 minutes, 23 seconds north latitude, 75° 45 minutes, 53 seconds west longitude, about 11 miles south of the airport at an elevation of 1,755 feet msl.", "probable_cause": "The flight crew’s failure to ensure an adequate fuel supply for the flight, which led to the stoppage of the right engine due to fuel exhaustion and the intermittent stoppage of the left engine due to fuel starvation. Contributing to the accident were the flight crew's failure to monitor the airplane’s fuel state and the flight crew's failure to maintain directional control after the initial engine stoppage."}