{"url": "https://www.baaa-acro.com/crash/crash-fokker-f28-fellowship-4000-new-york-27-killed", "date": "Mar 22, 1992 at 2135 LT", "type": "Fokker F28 Fellowship", "operator": "US%20Airways2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jacksonville – New York – Cleveland", "msn": "11235", "yom": 1986, "flight_number": "US405", "city": "New York-LaGuardia", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 47, "pax_fatalities": 25, "other_fatalities": 0, "total_fatalities": 27, "captain_hours": 9820, "captain_hours_type": 2200, "copilot_hours": 4507, "copilot_hours_type": 29, "aircraft_hours": 12462, "circumstances": "USAir flight 405 was scheduled to depart Jacksonville, FL (JAX) at 16:35 but was given a ground delay because of poor weather in the New-York-LaGuardia (LGA) area and was further delayed in order to remove the baggage of a passenger who chose to deplane. The Fokker F-28 jet departed Jacksonville at 17:15 and was cleared into the LaGuardia area without significant additional delays. The first officer accomplished an ILS approach to LaGuardia's runway 04 to minimums and initiated braking on the landing roll. Ramp congestion delayed taxiing to the parking gate. The airplane was parked at Gate 1 at approximately 19:49, 1 hour and 6 minutes behind schedule. After the airplane was parked at Gate 1, the line mechanic who met the flight was advised by the captain that the aircraft was \"good to go.\" The captain left the cockpit and the first officer prepared for the next leg to Cleveland , OH (CLE) that had originally been scheduled to depart at 19:20. Snow was falling as the F-28 was prepared for departure. The airplane was de-iced with Type I fluid with a 50/50 water/glycol mixture, using two trucks. After the de-icing, about 20:26, one of the trucks experienced mechanical problems and was immobilized behind the airplane, resulting in a pushback delay of about 20 minutes. The captain then requested a second de-icing of the airplane. The airplane was pushed away from the gate to facilitate de-icing by one de-icing truck. The second de-icing was completed at approximately 21:00. At 21:05:37, the first officer contacted the LaGuardia ground controller and requested taxi clearance. The airplane was cleared to taxi to runway 13. At 21:07:12, the flightcrew switched to the LaGuardia ground sequence controller, which they continued to monitor until changing to the tower frequency at 21:25:42. The before-takeoff checklist was completed during the taxi. Engine anti-ice was selected for both engines during taxi. The captain announced that the flaps would remain up during taxi, and he placed an empty coffee cup on the flap handle as a reminder. The captain announced they would use US Air's contaminated runway procedures that included the use of 18 degrees flaps. They would use a reduced V1 speed of 110 knots. The first officer used the ice (wing) inspection light to examine the right wing a couple of times. He did not see any contamination on the wing or on the black strip and therefore did not consider a third de-icing. Flight 405 was cleared into the takeoff and hold position on runway 13 at 21:33:50. The airplane was cleared for takeoff at 21:34:51. The takeoff was initiated and the first officer made a callout of 80 knots, and, at 21:35:25, made a V1 callout. At 21:35:26, the first officer made a VR callout. Approximately 2.2 seconds after the VR callout, the nose landing gear left the ground. Approximately 4.8 seconds later, the sound of stick shaker began. Six stall warnings sounded. The airplane began rolling to the left. As the captain leveled the wings, they headed toward the blackness over the water. The crew used right rudder to maneuver the airplane back toward the ground and avoid the water. They continued to try to hold the nose up to impact in a flat attitude. The airplane came to rest partially inverted at the edge of Flushing Bay, and parts of the fuselage and cockpit were submerged in water. After the airplane came to rest, several small residual fires broke out on the water and on the wreckage debris.", "probable_cause": "The failure of the airline industry and the Federal Aviation Administration to provide flight crews with procedures, requirements, and criteria compatible with departure delays in conditions conducive to airframe icing and the decision by the flight crew to take off without positive assurance that the airplane's wings were free of ice accumulation after 35 minutes of exposure to precipitation following de-icing. The ice contamination on the wings resulted in an aerodynamic stall and loss of control after lift-off. Contributing to the cause of the accident were the inappropriate procedures used by, and inadequate coordination between, the flight crew that led to a takeoff rotation at a lower than prescribed air speed."}