{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-des-moines", "date": "Aug 19, 1997 at 2221 LT", "type": "Swearingen SA226 Metro II", "operator": "Superior%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Wichita - Des Moines", "msn": "TC-227", "yom": 1977, "flight_number": null, "city": "Des Moines", "zone": "Iowa", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2436, "captain_hours_type": 93, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 51119, "circumstances": "During a landing approach, the pilot noted that the right engine remained at a high power setting, when he moved the power levers to reduce power. He executed a missed approach and had difficulty keeping the airplane straight and level. The pilot maneuvered for a second approach to land. After landing, he could not maintain directional control of the airplane and tried to go around, but the airplane went off the end of the runway and impacted the localizer antenna. The pilot did not advise ATC of the problem nor did he declare an emergency. The Pilot's Operating Handbook stated that for a power plant control malfunction, the affected engine should be shut down, and a single engine landing should be made. The power control cable was found disconnected from the anchoring point. A safety tab was broken off the housing, allowing it to unscrew. About one month before the accident, maintenance had been performed on the right engine to correct a discrepancy about the right engine power lever being stiff. The mechanic re-rigged the right engine power cable. ", "probable_cause": "The pilot's improper in-flight planning/decision and failure to perform the emergency procedure for shut-down of the right engine. Factors relating to the accident were: the power lever cable became disconnected from the fuel control unit, due to improper maintenance; and reduced directional control of the airplane, when one engine remained at a high power setting. "}