{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6-elizabeth-33-killed", "date": "Feb 11, 1952 at 0020 LT", "type": "Douglas DC-6", "operator": "National-Airlines-4", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "City", "schedule": "Newark – Miami", "msn": "43055", "yom": 1947, "flight_number": "NA101", "city": "Elizabeth", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 59, "pax_fatalities": 26, "other_fatalities": 4, "total_fatalities": 33, "captain_hours": 11901, "captain_hours_type": 1059, "copilot_hours": 3804, "copilot_hours_type": 941, "aircraft_hours": null, "circumstances": "The aircraft involved arrived at New York International Airport, 2 New York, at 2233, February 10, 1952, as Flight 402 from Miami, Florida This flight was routine, with stops at West Palm Beach, Florida, and Washington, D C. A turn-around inspection at Idlewild performed, and 1911 gallons of 100/130 grade fuel added, bringing the total fuel aboard to 2,700 gallons Also, sufficient oil was added to bring the quantity of each tank to 30 gallons. At 2322 the aircraft departed Idlewild on a ferry flight to Newark with a new crew consisting of Captain W. G. Foster, First Officer C E. St. Clair, flight Engineer I. R. Shea, and Stewardess Nancy J. Taylor. The aircraft arrived at Newark Airport at 2335, from which point it was scheduled to depart at 2359 as Flight 101, non-stop to Miami, Florida. A second inspection was accomplished at Newark and the aircraft was loaded with 2,953 pounds of mail, baggage, air express, air freight, and 59 passengers, including one infant The computed take-off gross weight was 83,437  pounds, or 6,463 pounds less than the allowable gross of 89,900 pounds This weight was so distributed that the center of gravity was within the approved limits. No fuel was added at Newark. The flight was given an instrument clearance from Newark to Miami, with West Palm Beach as alternate. To this clearance was attached the pertinent weather reports which indicated, among other things, that at Newark the ceiling was 20,000 feet, thin overcast, with the entire en route weather generally clear with ceilings of 30,000 feet at Palm Beach and Miami. At 0013, February 11, Newark Control Tower gave the flight taxi clearance to Runway 24, stating the wind was south, variable at six m p.h., and altimeter 29 92. At approximately 0017 the flight advised the tower that it was ready for takeoff Take-off clearance was issued, and the controller observed the aircraft taxi into take-off position and proceed down the runway in a normal manner, becoming airborne at 0018 after a roll of approximately 3,200 feet. The climb-out appeared normal until the aircraft passed the vicinity of the Newark Range Station. Here it was observed by Control Tower personnel to lose altitude suddenly and veer slightly to the right. This sudden loss of altitude and the movement to the right are supported by statements of surviving passengers and ground witnesses. The controller then called the flight and asked if everything was all right, to which he received the following reply, \"I lost an engine and am returning to the field.\" The time was established as 0019. The flight was immediately cleared to land on Runway 6, which clearance was at once amended to land on any runway desired No further radio contacts were made with flight. During the last radio transmission the controller observed the aircraft continue to veer to the right at a low altitude and then disappear from sight. At 0020 cower personnel observed a fire in the vicinity of Elizabeth New Jersey. It was later established that Flight 101 had crashed in Elizabeth near the intersection of Scotland Road and Westminster Avenue. The aircraft was totally destroyed by impact forces and three crew members, 26 passengers and four people on the ground were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the reversal in flight of No. 3 propeller with relatively high power and the subsequent feathering of No. 4 propeller resulting in a descent at an altitude too low to effect recovery. The following findings were pointed out:\r\n- Mechanical difficulty developed during climb shortly after takeoff from Runway 24,\r\n- No. 3 propeller reversed in flight, and No. 4 propeller was feathered,\r\n- Under these conditions the aircraft did not maintain altitude and settled rapidly."}