{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-montlucon-4-killed", "date": "Nov 18, 1988 at 0631 LT", "type": "Swearingen SA226 Metro II", "operator": "Air%20Littoral", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Montluçon - Paris", "msn": "TC-334E", "yom": 1980, "flight_number": "FU440", "city": "Montluçon-Guéret", "zone": "Allier", "country": "France", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10346, "circumstances": "Following a night takeoff at Montluçon-Guéret Airport, while in initial climb, the aircraft nosed down and struck the ground 600 meters past the runway end. It slid for few dozen meters, collided with bushes and eventually came to rest, bursting into flames. All four occupants were killed. It appears that the Stall Avoidance System (SAS) had activated, resulting in the stick pusher activation at a critical altitude. The Metro's SAS system, as well as the SAS system on this particular aircraft, had a history of problems. These problems resulted in several NTSB Safety Recommendations (A-84-66, A-88-154). The copilot was at controls at the time of the accident. \r\nCrew:\r\nGérard Van Der Veecken, pilot,\r\nChristian Rémondon, copilot.\r\nPassengers:\r\nRobert Aupetit,\r\nPatrick Desdoit.", "probable_cause": "The accident resulted from a reduction in the attitude of the airplane causing a downward trajectory in the moments that followed the takeoff. It is likely that this decrease in attitude is due to an untimely triggering of the stick pusher. The absence of a recorder and the complete destruction of the SAS (apart from angle of attack vane and its transmitter) did not prove this hypothesis. With or without inadvertent triggering of the stick pusher, the imprecision of the right horizon and the absence of external visual references played an important role in this accident."}