{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-houston-7-killed", "date": "Mar 21, 1980 at 1949 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Eagle Commuter Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Houston - Brownwood", "msn": "31-7552046", "yom": 1975, "flight_number": null, "city": "Houston-William P. Hobby", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 8, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 4313, "captain_hours_type": 813, "copilot_hours": 3250, "copilot_hours_type": null, "aircraft_hours": 5545, "circumstances": "The flight from William P. Hobby Airport, Houston, Texas, to Brownwood, Texas, was scheduled to depart Hobby Airport at 1915. Two intermediate stops were scheduled. It was operating behind schedule because of delays in the first three flights of the day which were flown by the same captain who was readying Flight 108. The aircraft had been on the ground for 31 minutes between the time it landed and the time it taxied for takeoff. Two crewmembers and eight passengers were on board Flight 108. At 1941, the ground controller cleared Flight 108 to taxi to runway 22. At 1943:40 the captain reported that Flight 108 was ''ready to go on 22,\" and at 1945:10 transmitted \"Eagle Air 108 is No. 1 for 22.\" At 1945:55, Flight 108 was cleared to taxi into position and to hold on runway 22. A pilot of an aircraft in the runup area adjacent to runway 22 stated that Flight 108 did not use the runup area, nor did he see the crew conduct an engine runup while awaiting takeoff clearance. At 1947:50, Flight 108 was cleared for takeoff, and at 1948:35, the tower air traffic controller inquired if Flight 108 would be making a right turn away from the airport. Flight 108 responded, \"Eagle 108 just lost the right engine.\" The controller stated that when this transmission was made the aircraft was about 4,300 ft from the start of its takeoff roll and about 100 ft above the runway. A pilot witness on the ground stated that the aircraft was between 100 and 200 ft above the runway when the crew reported the loss of the right engine. An Eagle Airlines employee identified the person who made the transmission as a company employee--a pilot-in-command trainee who was in the copilot seat. The aircraft maintained runway heading for about 10 sec more before it began a right turn and a shallow descent. The rate of turn, the angle of bank to the right, and the rate of descent continued to increase as the aircraft turned 90° away from the runway heading. The angle of bank also increased as the aircraft descended, but the crew managed to level the wings just before impact. A passenger who was seated two seats behind the captain stated that when the aircraft was about 50 ft in the air he heard an engine \"sputter\" which continued until impact. The aircraft dropped, veered left, then right, and down.\" He recalled that a crewmember said, \"What's next or what do we do now.\" A passenger on the right side, four seats back, heard a \"popping or thudding\" noise after the aircraft left the runway and veered to the right. He recalled that someone said, 'What do I do?\". The third survivor was seated in the left rear seat. He heard an engine go \"pop-pop like a backfire.\" He saw the captain pull back the \"left red controls and the right pilot reach and turn things.\" None of the survivors could tell who was flying the aircraft. The aircraft crashed on a concrete airport parking ramp in a nearly level pitch attitude, with the right wing slightly lowered, about 1,000 ft from the runway. It then slid 200 ft on the ramp and hit two aircraft, four cars, and finally a hangar. A fire broke out when the aircraft hit the cars and the hangar. The accident occurred during hours of darkness. ", "probable_cause": "The probable cause of the accident was a power loss in the right engine for undetermined reasons at a critical point in the takeoff phase, the aircraft's marginal single-engine performance capability, and the captain's immediate landing on the remaining runway, or to configure the aircraft properly for the engine-out incorrect emergency response to the engine power loss when he failed either to land condition."}