{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-bathurst-4-killed", "date": "Nov 7, 2008 at 2024 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Timothy O’Brien", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Melbourne – Bathurst – Port Macquarie", "msn": "31-7952082", "yom": 1979, "flight_number": null, "city": "Bathurst", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 2061, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11000, "circumstances": "On 7 November 2008, a Piper Aircraft Corp. PA-31-350 Chieftain, registered VH-OPC, was being operated on a private flight under the instrument flight rules (IFR) from Moorabbin Airport, Vic. to Port Macquarie via Bathurst, NSW. On board the aircraft were the owner-pilot and three passengers. The aircraft departed Moorabbin Airport at about 1725 Eastern Daylight-saving Time and arrived at Bathurst Airport at about 1930. The pilot added 355 L of aviation gasoline (Avgas) to the aircraft from a self-service bowser and spent some time with the passengers in the airport terminal. Recorded information at Bathurst Airport indicated that, at about 2012 (12 minutes after civil twilight), the engines were started and at 2016 the aircraft was taxied for the holding point of runway 35. The aircraft was at the holding point for about 3 minutes, reportedly at high engine power. At 2020, the pilot broadcast that he was entering and backtracking runway 35 and at 2022:08 the pilot broadcast on the common traffic advisory frequency that he was departing (airborne) runway 35. At 2023:30, the pilot transmitted to air traffic control that he was airborne at Bathurst  and to standby for departure details. There was no record or reports of any further radio transmissions from the pilot. At about 2024, a number of residents of Forest Grove, a settlement to the north of Bathurst Airport, heard a sudden loud noise from an aircraft at a relatively low height overhead, followed shortly after by the sound of an explosion and the glow of a fire. A witness located about 550 m to the south-west of the accident site, reported seeing two bright lights that were shining in a constant direction and ‘wobbling’. There was engine noise that was described by one witness as getting very loud and ‘rattling’ or ‘grinding’ abnormally before the aircraft crashed. At 2024:51, the first 000 telephone call was received from witnesses and shortly after, emergency services were notified. The aircraft was seriously damaged by impact forces and fire, and the four occupants were fatally injured.", "probable_cause": "From the evidence available, the following findings are made with respect to the collision with terrain involving Piper Aircraft Corp. PA-31-35 Chieftain, registered VH-OPC, 3 km north of Bathurst Airport on 7 November 2008 and should not be read as apportioning blame or liability to any particular organisation or individual. \r\nContributing safety factors:\r\n• The aircraft descended at a steep angle before impacting the ground at high speed, consistent with uncontrolled flight into terrain.\r\nOther key findings:\r\n• Based on analysis of the available information, an airworthiness issue was considered unlikely to be a contributing factor to this accident.\r\n• The investigation was unable to establish why the aircraft collided with terrain; however, pilot spatial disorientation or pilot incapacitation could not be discounted."}