{"url": "https://www.baaa-acro.com/crash/crash-boeing-tb-17h-flying-fortress-lerwick", "date": "Jan 3, 1947", "type": "Boeing B-17 Flying Fortress", "operator": "USAAF", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Keflavik - Keflavik", "msn": "34212", "yom": null, "flight_number": null, "city": "Lerwick", "zone": "Shetland (Zetland)", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 1430LT on 2nd January 1947 an SB-17 belonging to 1386th AAF Base Unit Air Sea Rescue took off from Keflavik airfield, Iceland on a local flight expected to last 2 to 3 hours, however approx 1 hour after leaving the field a snow storm developed and the crew now on instruments and were given instructions by ATC to fly to Prestwick as the visibility at Keflavik was too bad, and so a flight plan was arranged and radioed to the pilot. Expecting this to be just a local flight, the navigator was without proper charts, they had no Wireless Op on board, and little fuel for any marginal error. Drift readings were taken and bearings using the astro compass and radio compass were taken, though stronger than forecast headwinds slowed the aircraft down and it took much longer to reach their turning over Scotland, also heavy cloud hindered any visual contact, but eventually an island, that of Shetland was spotted and it was estimated that they should reach the Scottish mainland within 30 minutes, however, as they continued past their ETA, no land was sited and the Navigator suggested they do a 180 degree turn and head back to the Island, this they did and back over Shetland at approx midnight, they flew a few miles off shore, jettisoned the lifeboat, circled a number of times firing off flares, then with an estimated guess of less than an hours fuel left,the pilot gave the order to abandon the aircraft, then putting it on a SW course on autopilot, he left the aircraft himself. Three of the crew landed on the Shetland mainland itself, one came down on a tiny island in Braewick Voe, and another landed in the sea and struggled to unhitch his chute, but fortunately the wind blew him towards the shore. After a long night with the Co-Pilot suffering a sprained knee, and the Pilot suffering exposure, all were eventually found and taken to hospital where they were given hot drinks and blankets, and treated for their injuries. The Fortress went down in the sea somewhere to the West of the Shetland mainland at a location yet to be discovered. Maybe one day a fishing boat will pull up a piece of wreckage identified as coming off a Flying Fortress and the last resting place of 44-83771 will be known.\r\nCrew (1386 BU):\r\n1/Lt W. E. Dee, pilot, \r\n1/Lt M. H. Craven Jr., copilot, \r\n1/Lt W. L. Pilcher, navigator,  \r\nH. E. Shields, flight engineer, \r\nR. M. Gessert, flight engineer.\r\nSource: http://www.aviation-safety.net/wikibase/wiki.php?id=99049", "probable_cause": null}