{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-lerwick", "date": "Sep 6, 1999 at 1034 LT", "type": "Cessna 208B Grand Caravan", "operator": "Hangar 5 Airservices", "flight_phase": "Landing (descent or approach)", "flight_type": "Postal (mail)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kirkwall - Lerwick", "msn": "208B-0302", "yom": 1992, "flight_number": null, "city": "Sumburgh", "zone": "Shetland (Zetland)", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1780, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The operating company were involved in a Royal Mail contract to deliver mail from Aberdeen to Shetland Islands each day. The crew involved in the accident had flown LN-PBB from Stauning Airport in Denmark to Aberdeen in preparation for a two week period of duty delivering the mail; they arrived at Aberdeen at 1700 hrs on 5 September 1999. The next morning, the crew arrived for duty at approximately 0540 hrs and completed their normal checks of LN-PBB. Shortly after this, the mail arrived and was escorted to the aircraft by the company ground crew. The mail bags were sorted and loaded into the aircraft by the flight and ground crew under the supervision of the commander; the mail had been weighed by Royal Mail  and the commander was given written confirmation of the total weight of 1,196 kg. At the completion of the loading, the commander was satisfied that the load was secure and correctly distributed. Prior to departure for Sumburgh Airport, the commander had checked the weather and was aware that it was 'poor' at Sumburgh but the indications were that it would improve; additionally, the weather at Kirkwall Airport was clear if they needed to divert. The aircraft appeared fully serviceable during start, taxi and take off from Aberdeen at 0640 hrs; for the flight to Sumburgh, the commander was the handling pilot. Cruise was at Flight Level (FL)90and, about half way to Sumburgh, ATC advised the crew of the latest weather at Sumburgh which indicated that they would not be able to land there. However, there was a preceding aircraft heading for the same destination and the commander elected to continue towards Sumburgh. Then, once the preceding aircraft crew had declared that they were diverting to Aberdeen, the commander decided to divert to Kirkwall. The diversion was uneventful and the aircraft landed at 0807 hrs. At Kirkwall, the crew uplifted sufficient fuel to bring the total up to the same with which they had left Aberdeen (1,200lb) and waited for a weather improvement at Sumburgh. By approximately 0930hrs, the crew were advised by Kirkwall ATC that the weather had improved at Sumburgh and they prepared the aircraft for departure. Take off was at 0950 hrs with the co-pilot as handling pilot. Cruise was at FL 70 and was uneventful up to the approach and landing. The airport was using Runway 27 as that is the only runway with full ILS. The ATIS information at 1020 hrs was broadcasting the following information: surface wind 340°/07 kt; 9,000 metres in rain; cloud few at 300 feet, scattered at 1,000 feet and broken at 1,600 feet; temperature 12°, dew point 12°; tempo cloud broken 1,500 feet with a wet runway. In accordance with ATC instructions, the crew commenced their descent to 2,000 feet amsl where they were instructed to intercept the ILS from a heading of 300°. Once fully established on the ILS, the commander noted that the co-pilot was having a little difficulty maintaining the aircraft on both the localizer and glide slope. The co-pilot was not sure of the height at which they broke cloud but the commander estimated that they were at 500 feet agl. At this point, the co-pilot considered that they were slightly high and fast; subsequently, the commander estimated the aircraft airspeed as 140 kt as they became visual with the runway. During the final approach, the air traffic controller gave three separate wind reports of 010°/11 kt, 010°/11 kt and010°/10 kt; these reports were based on the two minute mean surface winds. As the aircraft crossed the runway threshold, the co-pilot called out that he had too much speed and that \"it wasn't going to work\". With no reply from the commander, the co-pilot took this lack of response as an indication that the commander was content. For his part, the commander was concentrating on the runway aspect and, although he heard a comment from the co-pilot, did not make any response. The crew considered that touchdown was approximately halfway down the runway and the co-pilot was aware of the aircraft bouncing before a second touchdown; neither pilot could recall the speed at touchdown. Both pilots applied full foot braking but with little apparent result in retardation. Then, as the aircraft approached the end of the runway, the commander took control and applied full power; this was because he was aware of the concrete blocks positioned off the end of the runway as a sea defence and wished to clear them. The aircraft was now yawed slightly left and positioned to the left of the runway centreline. It left the runway surface, travelled across grass and a public road and came to rest on the concrete blocks. ", "probable_cause": "The aircraft overran the end of Runway 27 at Sumburgh following a touchdown which was too fast and well down the runway. There was insufficient runway remaining for the aircraft to stop. The landing resulted from a poor approach and no apparent co-operation between the crew. A positive decision from the co-pilot, or better monitoring and an active input from the commander, should have resulted in a go-around and a further approach or a diversion. While this crew may be unusual, it would be appropriate for the operating company to review their procedures to ensure that their crews are operating in a safe manner. The investigation also reviewed the rules under which the flight was conducted. Examination of the weather information available to the crew indicate doubts as to whether the flight could have been completed within the limitations contained within company manuals. Additionally, Article 32A of the UK ANO is not clear; it could be interpreted as only prohibiting flights when the weather conditions are not met at all of the relevant aerodromes. It would be appropriate for the CAA to review the content of Article 32A to ensure that the intent is clear. "}