{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-32-near-sarroch-31-killed", "date": "Sep 14, 1979 at 0047 LT", "type": "Douglas DC-9", "operator": "Aero%20Trasporti%20Italiani-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Alghero - Cagliari", "msn": "47667/776", "yom": 1975, "flight_number": "BM012", "city": "Sarroch", "zone": "Sardinia", "country": "Italy", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 27, "pax_fatalities": 27, "other_fatalities": 0, "total_fatalities": 31, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10000, "circumstances": "The airplane departed Alghero Airport at 0010LT on a short schedule service (BM012) to Cagliari-Elmas Airport, carrying 27 passengers and a crew of four. While descending to Cagliari, the crew was informed that runway 14 was in use with thunderstorm activity and rain falls south of the airport. After contacting the Cagliari Tower controller at 0026LT, the flight was cleared to descend to the transition altitude of 6,000 feet. Having in front of them a consistent formation of Cumulonimbus clouds, the first officer radioed their intention to make a 360° turn to further lower the altitude and thus avoid the cloud formations. The controller, not having traffic in the area, authorized the manoeuvre, and first officer then announced the intention to leave at 7,500 feet for 3,000 feet. The controller then asked the flight if they had visual contact with the ground, but this was not the case. The clearance was amended to go down to 6,000 feet instead of 3,000 feet. At 0030LT the flight reported that it was in visual contact with the ground, and that it was about to leave 6,000 ft for 3,000 ft. The controller confirmed this, adding that it had started to rain at the airport in the meantime. The aircraft however did not complete the planned 360° turn, thus finding itself with a different heading from that initially planned. After reaching 3,000 feet, the flight was cleared for the approach. The first officer confirmed this and announced that they would start the final approach with a slight deviation to the right of the beacon. At 0034LT the first officer asked the controller to confirm that the ILS system was inoperative, which it was. At this stage of the flight the crew became unaware of their position. The captain believed he was flying over the sea, further south than the actual position of the aircraft, while the first officer rightly believed he was flying over the mountainous terrain of southern Sardinia. In the last minute and a half of the flight, the captain asked the first officer to lower the undercarriage and continued the descent. At an altitude of 2,000 feet (610 m) the DC-9 hit the rocky mountainside of Conca d'Oru with the lower part of the fuselage, causing the aircraft to break up. A fire erupted. The point of impact was 18 km south-west of the airport. All 31 occupants were killed. \r\nSource: ASN", "probable_cause": "The accident was the consequence of a controlled flight into terrain caused by a wrong approach configuration on part of the flying crew and a misinterpretation of ATC instructions. "}