{"url": "https://www.baaa-acro.com/crash/crash-convair-b-36b-10-cf-peacemaker-fairchild-afb-15-killed", "date": "Apr 15, 1952 at 0345 LT", "type": "Convair B-36 Peacemaker", "operator": "United%20States%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fairchild - Fairchild", "msn": "47", "yom": 1946, "flight_number": null, "city": "Fairchild AFB (Spokane)", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 17, "crew_fatalities": 15, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was engaged in a routine training flight and the plane was scheduled to conduct seven practice bomb runs at the Yakima Firing Center in Yakima County. During the takeoff roll from runway 23, the six engine aircraft encountered difficulties to rotate, overran and eventually rotated 520 feet past the runway end. The airplane climbed to a height of 50 feet then nosed down and crashed in a huge explosion in a field 3,314 feet past the runway end and 75 feet on the right of the extended center line. Two crew members were seriously injured while 15 others were killed. The aircraft was totally destroyed. The pilot was also in command of another  B-36 registered 44-92080 that crashed at Fairchild AFB last January 29.\nCrew:\nCpt Cecil F. Alldredge, pilot, †\nCpt John Q. Boyd, †\nT/Sgt Francis J. Brozowski, †\nS/Sgt Martin Gordon Cohn, †\nCpt John E. Daly, †\nS/Sgt Earl K. Davis, †\n1st Lt Melvin H. Emley, †\nS/Sgt John C. Gafford, †\nCpt Arthur L. Hulshizer, †\n2nd Lt John J. Knaub, †\nA2c Wilbur W. Knox Jr., †\n1st Lt Herbert D. Merman, †\nCpt Albert E. Nelson, †\nCpt Earl G. Soderbeck, †\nA1c Charles E. Sykora Jr., †\nA2c James Breedlove,\nM/Sgt Walter L. Campbell.", "probable_cause": "The Air Force Board of Inquiry determined the crash was caused by pilot error. During the maximum-weight takeoff, the pilots apparently discovered that the elevator trim was set incorrectly, keeping the plane’s nose down. Rather than abort, Captain Cecil F. Alldredge, the aircraft commander, made the decision to continue, confident the trim could be corrected during the takeoff roll. The corrective action, however, came too late, and the pilots lost control. The plane continued on the ground 520 feet past the end of runway 23 before becoming briefly airborne. After reaching an altitude of approximately 50 feet, the aircraft struck the ground 75 feet to the right and 3,314 feet past the end of the runway and tore through the airfield perimeter fence, coming to rest 450 feet off the base. The debris field extended an additional 1,000 feet."}