{"url": "https://www.baaa-acro.com/crash/crash-canadair-regionaljet-crj-100er-byers-3-killed", "date": "Jul 26, 1993 at 1352 LT", "type": "Canadair RegionalJet CRJ-100", "operator": "Bombardier", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Wichita - Wichita", "msn": "7001", "yom": 1991, "flight_number": null, "city": "Byers", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3836, "captain_hours_type": 875, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 771, "circumstances": "The crew was performing a lateral and directional stability test. Changes from earlier tests combined new leading edge fairing, new flap setting, lower reference airspeed, and trial settings for the stall protection system (shaker and pusher). Engineers had briefed the crew data would be sufficient if the steady heading sideslip (shss) maneuver ended at a 15° sideslip, or at onset of stall warning; crew agreed to end at stall warning. During the test the capt continued past stall warning to 21° sideslip at full rudder. The airplane rolled rapidly through 360 deg° and entered a deep stall. The copilot attempted to deploy the anti-spin chute. However, all the chute system cockpit switches were not properly preset; instead of assisting recovery, the chute parted from the airplane. Full control was not regained before impact. The chute system design allowed deployment of the chute even when the hyd lock switch was in the unlocked position and the hooks clasping the chute shackle to the airframe were open. System tested ok before flight. All three crew members were killed. ", "probable_cause": "The captain's failure to adhere to the agreed upon flight test plan for ending the test maneuver at the onset of prestall stick shaker, and the flightcrew's failure to assure that all required switches were properly positioned for anti-spin chute deployment. A factor which contributed to the accident was the inadequate design of the anti-spin chute system which allowed deployment of the chute with the hydraulic lock switch in the unlocked position. (When in the unlocked position, the hooks clasping the chute shackle to the airframe are open)."}