{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-602p-north-las-vegas", "date": "Jan 2, 2013 at 1515 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "Managed Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "North Las Vegas - North Las Vegas", "msn": "60-8365-018", "yom": 1983, "flight_number": null, "city": "North Las Vegas", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3900, "captain_hours_type": 1700, "copilot_hours": 11535, "copilot_hours_type": 60, "aircraft_hours": 3259, "circumstances": "The pilot receiving instruction conducted three full-stop landings without incident. After the fourth takeoff, the flight instructor simulated a prearranged left engine failure about 600 ft above ground level (agl). The pilot followed emergency procedures, used the checklist, and prepared to land. The pilot reported that, when the airplane was about 50 to 100 ft agl on final approach, he thought that it was a little too high, so he chose to initiate a go-around. He moved the throttle levers full forward, but neither engine responded. The flight instructor pushed the airplane's nose down, and the pilot continued the approach. On touchdown, the right main and nose landing gear collapsed. A postimpact fire ensued, which consumed most of the airplane. Postaccident examination of the landing gear revealed that it collapsed due to bending overload consistent with a hard landing. The reason for the failure of both engines to respond to power inputs could not be determined because of the postcrash fire damage.", "probable_cause": "The pilot's failure to maintain an adequate descent rate while on final approach, which resulted in a hard landing and landing gear collapse due to overload following the failure of both engines to respond to power inputs during an attempted go-around for reasons that could not be determined due to postcrash fire damage. "}