{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-049e-46-constellation-charleston-2-killed", "date": "May 12, 1959 at 1520 LT", "type": "Lockheed L-049 Constellation", "operator": "Capital-Airlines3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Washington DC – Rochester – Buffalo – New York – Pittsburgh – Charleston – Atlanta", "msn": "1978", "yom": 1946, "flight_number": "CA983", "city": "Charleston-Yaeger (Kanawha)", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 1, "pax_on_board": 38, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4966, "captain_hours_type": 408, "copilot_hours": 2321, "copilot_hours_type": 822, "aircraft_hours": 29589, "circumstances": "Capital Airlines Flight 983 of May 12, 1959, a Constellation model L-049, N 2735A, following a landing at 1529 e.s.t., on a wet runway, was intentionally ground looped and during the maneuver skidded and slid down a steep embankment beyond the boundary of the airport at Charleston, West Virginia. One of the 38 passengers and one of the six crew members died in the fire which followed; one passenger was seriously burned amd all others on board the aircraft escaped with little or no injury; the aircraft was destroyed. The aircraft was landed within the first third of the runway and the captain said that finding braking to be ineffective, he chose to ground loop the aircraft rather than risk going down a sharp declivity at the far end of the runway. The aircraft left the runway about 600 feet from the far end. Investigation revealed operational deficiencies in the conduct of the approach and touchdown, and that crew coordination throughout the emergency was poor. Because of crew statements, the brakes were believed to have been capable of functioning in a normal manner; however, water on the runway would have permitted the aircraft to aquaplane and thus make them ineffective.", "probable_cause": "The Board determines that the probable cause of this accident was the pilot's action of landing the aircraft too fast on the wet runway under conditions conducive to aquaplaning, making early deceleration impossible. An additional factor was the poor coordination of the crew throughout the approach and landing."}