{"url": "https://www.baaa-acro.com/crash/crash-antonov-70-veliky-lis-7-killed", "date": "Feb 10, 1995 at 1609 LT", "type": "Antonov AN-70", "operator": "Antonov%20Design%20Bureau", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Kiev - Kiev", "msn": "01 01", "yom": 1994, "flight_number": null, "city": "Veliky Lis", "zone": "Kiev oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3, "circumstances": "The aircraft, first prototype of this model AN-70, departed Kiev-Gostomel Airport on a test flight with seven crew members on board. The goal of the flight was to test the stability and controllability of the airplane for the certification program. An Antonov AN-72 registered UR-72966 and also operated by Antonov Design Bureau departed the same airport to take part to the same control flight. While cruising at an altitude of 3,200 metres, the crew of the AN-70 elected to approach the AN-72 but misjudged the distance, causing both airplanes to collided. The tail of the AN-70 struck the fuselage of the AN-72. The crew of the AN-72 was able to return to Kiev-Gostomel Airport and to complete a safe landing. All crew members were uninjured but the aircraft was damaged beyond repair due to severe structural damages. Upon impact, the AN-70 lost its left stabiliser and also a part of the tail. Out of control, it entered a dive and crashed in a wooded area located in Veliky Lis, about 45 km northwest of Kiev-Gostomel Airport. All seven occupants were killed. ", "probable_cause": "It was determined that the collision was the consequence of errors on part of the AN-70 crew who misjudged the distance between both aircraft and initiated a hazardous maneuver without knowing the exact position of the second aircraft. The following contributing factors were reported: \r\n- The collision occurred while both aircraft were facing sun, \r\n- Both crew did not use appropriate radio communications, \r\n- Loss of situational awareness, \r\n- Loss of the left horizontal stabiliser as well as part of the tail, failure of all four hydraulic systems, loss of controllability. "}