{"url": "https://www.baaa-acro.com/crash/crash-saab-2000-unalaska-1-killed", "date": "Oct 17, 2019 at 1740 LT", "type": "Saab 2000", "operator": "PenAir-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Anchorage - Unalaska", "msn": "017", "yom": 1995, "flight_number": "AS3296", "city": "Unalaska-Tom Madsen", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 39, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 14761, "captain_hours_type": 131, "copilot_hours": 1447, "copilot_hours_type": 138, "aircraft_hours": 12617, "circumstances": "On October 17, 2019, a Saab SA-2000 airplane, operated by Peninsula Aviation Services Inc. d.b.a. PenAir flight 3296, overran the end of runway 13 at Unalaska Airport (DUT), Unalaska, Alaska. The flight crew executed a go-around during the first approach to runway 13; the airplane then entered the traffic pattern for a second landing attempt on the same runway. Shortly before landing, the flight crew learned that the wind at midfield was from 300° at 24 knots, indicating that a significant tailwind would be present during the landing. Because an airplane requires more runway length to decelerate and stop when a tailwind is present during landing, a landing in the opposite direction (on runway 31) would have favored the wind at the time. However, the flight crew continued with the plan to land on runway 13. Our postaccident calculations showed that, when the airplane touched down on the runway, the tailwind was 15 knots. The captain reported after the accident that the initial braking action after touchdown was normal but that, as the airplane traveled down the runway, the airplane had “zero braking” despite the application of maximum brakes. The airplane subsequently overran the end of the runway and the adjacent 300-ft runway safety area (RSA), which was designed to reduce airplane damage during an overrun, and came to rest beyond the airport property. The airplane was substantially damaged during the runway overrun; as a result, of the 3 crewmembers and 39 passengers aboard, 1 passenger sustained fatal injuries, and 1 passenger sustained serious injuries. Eight passengers sustained minor injuries, most of which occurred during the evacuation. The crewmembers and 29 passengers were not injured.", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was the landing gear manufacturer’s incorrect wiring of the wheel speed transducer harnesses on the left main landing gear during overhaul. The incorrect wiring caused the antiskid system not to function as intended, resulting in the failure of the left outboard tire and a significant loss of the airplane’s braking ability, which led to the runway overrun.\r\nContributing to the accident were \r\n1) Saab’s design of the wheel speed transducer wire harnesses, which did not consider and protect against human error during maintenance; \r\n2) the Federal Aviation Administration’s lack of consideration of the runway safety area dimensions at Unalaska Airport during the authorization process that allowed the Saab 2000 to operate at the airport; and \r\n3) the flight crewmembers’ inappropriate decision, due to their plan continuation bias, to land on a runway with a reported tailwind that exceeded the airplane manufacturer’s limit. The safety margin was further reduced because of PenAir’s failure to correctly apply its company-designated pilot-incommand airport qualification policy, which allowed the accident captain to operate at one of the most challenging airports in PenAir’s route system with limited experience at the airport and in the Saab 2000 airplane."}