{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-hilo-1-killed", "date": "Aug 25, 2000 at 1735 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Big%20Island%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Kona – Kona", "msn": "31-8252024", "yom": 1982, "flight_number": "BIA057", "city": "Hilo", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2067, "captain_hours_type": 465, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3492, "circumstances": "The pilot ditched the twin engine airplane in the Pacific ocean after experiencing a loss of engine power and an in-flight engine fire while in cruise flight. The flight was operating at 1,000 feet msl, when the pilot noticed a loss of engine power in the right engine. At the same time the pilot was noticing the power loss, passengers noted a fire coming from the right engine cowling. The pilot secured the right engine and feathered the propeller. He attempted to land the airplane at a nearby airport; however, when he realized that the airplane was unable to maintain altitude he elected to ditch the airplane in the ocean. Prior to executing the forced landing, the pilot instructed the passengers to don their life jackets and assume the crash position. After touchdown, all but one passenger exited the airplane through the main cabin and pilot doors. It was reported that the remaining passenger was frightened, and could not swim. One survivor saw the remaining passenger sitting in the seat with the seat belt still secured and the life vest inflated. The pilot and passengers were then rescued from the ocean via rescue helicopter and boat. Postaccident examination of the airplane revealed that the right engine's oil converter plate gasket had deteriorated and extruded from behind the converter plate, allowing oil to spray in the accessory section and resulting in the subsequent engine fire. The engine manufacturer had previously issued a mandatory service bulletin (MSB) requiring inspection of the gasket every 50 hours for evidence of gasket extrusion around the cover plate or oil leakage. Maintenance records revealed that the inspection had been conducted 18.3 hours prior to the accident. At the time of the accident, the right engine had accumulated 386.8 hours since its last overhaul, and gasket replacement. The MSB was issued one month prior to the accident, after the manufacturer received reports of certain oil filter converter plate gaskets extruding around the oil filter converter plate. The protruding or swelling of the gasket allowed oil to leak and spray from between the plate and the accessory housing. A series of tests were conducted on exemplar gaskets by submerging them in engine oil heated to 245 degrees F; after about 290 hours, the gasket material displayed signs of deterioration similar to that of the accident gasket. A subsequent investigation revealed that the engine manufacturer had recently changed gasket suppliers, which resulted in a shipment of gaskets getting into the supply chain that did not meet specifications. As a result of this accident, the engine manufacturer revised the MSB to require the replacement of the gasket every 50 hours. The FAA followed suit and issued an airworthiness directive to mandate the replacement of the gasket every 50 hours.", "probable_cause": "Deterioration and failure of the oil filter converter plate gasket, which resulted in a loss of engine power and a subsequent in-flight fire."}