{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-0-springfield-13-killed", "date": "Mar 20, 1955 at 2236 LT", "type": "Convair CV-240", "operator": "American-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Newark – Chicago – Saint Louis – Springfield – Tulsa", "msn": "66", "yom": 1948, "flight_number": "AA711", "city": "Springfield", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 32, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": 9670, "captain_hours_type": 1324, "copilot_hours": 1922, "copilot_hours_type": 2, "aircraft_hours": 13383, "circumstances": "American 711 reported en route to the company that it was over Vichy (a position along Victor Airway 14 about 100 miles from Springfield) and estimated it would reach the Springfield VOR station at 2233. Initial radio contact with Springfield Approach Control was established at 2218 and the flight gave it the same Springfield estimate. The approach controller transmitted the 2208 weather observation to the flight. Reported conditions were: Ceiling 400 feet overcast; visibility 10 miles; wind west 12; altimeter 29.68. In response to the controller’s question the flight then indicated it intended to land at Springfield. Immediately thereafter clearance was issued for a standard range approach, instructing flight 711 to report over the range station and when starting the procedure turn. Shortly thereafter the flight asked clearance to descend. There being no other traffic the controller cleared the flight for an approach and to descend whenever it wished. At 2229 the latest weather observation for the airport, completed at 2228, was transmitted to the flight. Conditions given were: Ceiling 500 feet overcast; visibility 8 miles, very light drizzle; wind west 10. The flight informed the controller it would make a circling approach to runway 31, the active runway. At 2234 the flight reported, “American 711, over the Omni at 34, proceeding to the field.” Approximately two minutes later an explosion was seen and heard north-northwest of the airport and attempts to contact the flight thereafter failed. The aircraft crashed about 0,25 miles short of runway 31 and was destroyed. Both pilots and 11 passengers were killed. A weather observation immediately following the accident was: Ceiling 500 feet overcast; visibility 5 miles, very light drizzle; wind northwest 8; altimeter 29.66.", "probable_cause": "The Board determines that the probable cause of this accident was a descent to the ground while approaching the airport caused by the crew’s inattention to their flight instruments and a possible sensory illusion giving them an erroneous impression of the attitude of the aircraft. The following findings were reported:\r\n- Weather conditions at Springfield were above the minimums for an American Airlines Convair aircraft to make a VOR instrument approach and to circle for the landing,\r\n- The flight did not execute the CAA approved VOR instrument approach procedure but proceeded directly from the station toward the airport,\r\n- Analysis of the existing weather conditions indicates that before the aircraft turned toward the airport visual reference with the ground was possible but not probable at the required altitude,\r\n- While approaching the airport the aircraft was nearly on the 193-degree inbound radial required by the VOR instrument approach procedure and was flown visually below the overcast for several miles,\r\n- The aircraft descended until it struck the ground approximately 1-1/14 miles north-northwest of the airport,\r\n- There was no evidence found indicating malfunction or failure of the aircraft and there was no indication of an emergency aboard the aircraft."}