{"url": "https://www.baaa-acro.com/crash/crash-canadair-cl-604-challenger-birmingham-5-killed", "date": "Jan 4, 2002 at 1207 LT", "type": "Canadair CL-604 Challenger", "operator": "EPPS", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Birmingham - Bangor - Duluth", "msn": "5414", "yom": 1999, "flight_number": null, "city": "Birmingham", "zone": "West Midlands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 10000, "captain_hours_type": 800, "copilot_hours": 20000, "copilot_hours_type": 800, "aircraft_hours": 1594, "circumstances": "Following ATC clearance, engine start was at 1156 hrs and N90AG was cleared to taxi at 1201 hrs. All radio calls during the accident flight were made by the commander, seated in the right cockpit seat. During taxi, the crew completed their normal Before Takeoff Checks; these included confirmation that the control checks had been completed and that anti-ice might be required immediately after takeoff. Flap 20 had been selected for takeoff and the following speeds had been calculated and briefed by the pilots: V1 137 kt; VR 140 kt; V2 147 kt. By 1206 hrs, the aircraft was cleared to line up on Runway 15. At 1207 hrs, N90AG was cleared for takeoff with a surface wind of 140°/8 kt. The pilot in the left seat was handling the controls. Takeoff appeared normal up to lift-off. Rotation was started at about 146 kt with the elevator position being increased to 8°, in the aircraft nose up sense, resulting in an initial pitch rate of around 4°/second. Lift-off occurred 2 seconds later, at about 153 kt and with a pitch attitude of about 8° nose-up. Once airborne, the elevator position was reduced to 3° aircraft nose-up whilst the pitch rate increased to about 5°/second. Immediately after lift-off, the aircraft started to bank to the left. The rate of bank increased rapidly and 2 seconds after lift-off the bank angle had reached 50°. At that point, the aircraft heading had diverged about 10° to the left. Opposite aileron, followed closely by right rudder, was applied as the aircraft started banking; full right aileron and full right rudder had been applied within 1 second and were maintained until the end of the recording. As the bank angle continued to increase, progressively more aircraft nose-up elevator was applied. Stick-shaker operation initiated 3.5 seconds after lift-off and the recorders ceased 2 seconds later. The aircraft struck the ground, inverted, adjacent to the runway. The last recorded aircraft attitude was approximately 111° left bank and 13° nose-down pitch; the final recorded heading was about 114° (M). The aircraft was destroyed by impact forces and a post crash fire and all five occupants were killed, among them John Shumejda, President of the Massey-Ferguson Group and Ed Swingle, Vice President. The aircraft was leased by AGCO Massey-Ferguson. ", "probable_cause": "Causal factors:\r\n1. The crew did not ensure that N90AG’s wings were clear of frost prior to takeoff.\r\n2. Reduction of the wing stall angle of attack, due to the surface roughness associated with frost contamination, to below that at which the stall protection system was effective.\r\n3. Possible impairment of crew performance by the combined effects of a non-prescription drug, jet-lag and fatigue."}