{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-aurora", "date": "Feb 6, 2019 at 1530 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Vivid%20Hosting", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Aurora - Aurora", "msn": "46-36126", "yom": 1997, "flight_number": null, "city": "Aurora-State", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 970, "captain_hours_type": 23, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2670, "circumstances": "On February 6, 2019, about 1530 Pacific standard time, a Piper PA 46-350P, N997MA, was substantially damaged when it was involved in an accident near Aurora, Oregon. The private pilot and flight instructor were seriously injured. The airplane was operated as a Title 14 Code of Federal Regulations Part 91 instructional flight. The pilot reported that the purpose of the flight was to practice commercial pilot maneuvers. After practicing slow flight, chandelles, lazy eights, and eights on pylons, they returned to the airport and discussed how to conduct a practice a power-off 180° landing as they entered the traffic pattern. When the airplane was abeam the 1,000-foot runway markings, the pilot reduced the power to idle and started a left turn toward the runway. He stated that he realized that the airplane was “probably not going to make the runway” and that the airplane was “not on final course.” He recalled the airplane turning sharply to the left as he was pulled up on the control yoke and added right rudder. He could not recall whether he applied power. The pilot did not report any mechanical malfunctions or anomalies with the airplane. A video of the event showed the airplane in a left turn as it descended toward the runway. The airplane’s left bank decreased to a wings-level attitude before the airplane entered a steeper left bank, followed immediately by a right bank as the airplane descended into the ground short of the runway. The airplane’s right wing and fuselage sustained substantial damage.", "probable_cause": null}