{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu24-950-frogmore-1-killed", "date": "Nov 29, 1989 at 1150 LT", "type": "Fletcher FU-24", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Frogmore - Frogmore", "msn": "174", "yom": 1971, "flight_number": null, "city": "Frogmore", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was engaged in superphosphate spreading operations. An aerial survey of the property had been conducted by the pilot in company with the property owner. Power poles in the valley ahead and to the left of the airstrip were marked. When operations started the wind was a light north-easterly and ambient temperature was 16° Celsius. By the time the aircraft had refuelled and was ready for the thirty-sixth flight of the day, the ambient temperature had increased to 28° Celsius and the wind direction had changed to a south-westerly. Shortly after takeoff, the aircraft was observed to sink after overflying the high-voltage power lines between the marked poles. On the next flight the aircraft was observed to make a tight left turn and fly down the valley adjacent to the left marked powerpole. On the next and final flight, the aircraft was apparently attempting to follow the track of the previous flight. While crossing the power lines south-west of the marked power pole, the aircraft's landing gear and left wing tip struck the powerlines. With the broken powerline jammed behind the left aileron washout plate, the aircraft impacted the ground 100 metres beyond the powerpole. Ground impact forces destroyed the aircraft and reduced the cockpit area to non-survivable dimensions. ", "probable_cause": "On-site examination of the aircraft and subsequent laboratory examination and testing of components did not reveal any pre-existing mechanical defects or abnormalities which could be considered as factors in, or contributory to, this accident. Powerline impact marks on the aircraft were consistent with the aircraft being in a left banked attitude when it struck the wire. The investigation revealed that the loader driver's truck bucket load gauge had no conversion/calibration chart, and that the aircraft was being operated in excess of the maximum allowable weight for takeoff. It is considered probable that the pilot had elected to fly down the valley, (thus taking advantage of the downslope), to compensate for a degradation of aircraft performance whilst operating overweight in the changed ambient conditions. The absence of a superphosphate trail before wire impact indicates that the pilot did not dump any of the load and was either unaware\r\nof, or had forgotten about, the existence of powerlines to the south-west of the marked powerpole.\r\nThe following factors were considered relevant to the development of the accident:\r\n1. The aircraft was being operated in an overweight configuration for takeoff.\r\n2. The pilot did not adjust the takeoff weight of the aircraft to give an acceptable climb performance.\r\n3. The pilot was unaware of, or had forgotten about, the powerlines to the south-west of the marked pole; or,\r\n4. the pilot misjudged the clearance between the powerlines and the aircraft whilst trying to overfly them. "}