{"url": "https://www.baaa-acro.com/crash/crash-cessna-207-skywagon-chuathbaluk-1-killed", "date": "Nov 29, 2011 at 1925 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Inland%20Aviation%20Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Aniak - Chuathbaluk", "msn": "207-0273", "yom": 1974, "flight_number": null, "city": "Chuathbaluk", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16889, "circumstances": "The pilot departed on a positioning flight during dark night, marginal visual meteorological conditions. A witness, who was waiting for the airplane at the destination airport, stated that shortly after the pilot-controlled airport lighting activated, a snow squall passed over the airport, greatly reducing the visibility. The accident airplane never arrived at its destination, and a search was initiated. The airplane’s fragmented wreckage was discovered early the next morning in a wooded area, about 2 miles from its destination. A review of archived automatic dependent surveillance-broadcast (ADS-B) data received from the accident airplane showed that the pilot departed, and the airplane climbed to about 700 feet above ground level. The airplane remained at about 700 feet for about 3 minutes, and then entered a shallow right-hand descending turn, until it impacted terrain. On-site examination of the airplane and engine revealed no preaccident mechanical anomalies that would have precluded normal operation. The cockpit area was extensively fragmented, thus the validity of any postaccident cockpit and instrument findings was unreliable. Likewise, structural damage to the airframe precluded the determination of flight control continuity. A postaccident examination of the engine and recovered components did not disclose any evidence of a mechanical malfunction. Given the witness account of worsening weather conditions at the airport just before the accident and the lack of mechanical anomalies with the airplane, it is likely that the accident pilot encountered heavy snow and instrument meteorological conditions while approaching the airport. It is also likely that the pilot became spatially disoriented during the unexpected weather encounter and subsequently collided with terrain.", "probable_cause": "The pilot’s loss of situational awareness after an inadvertent encounter with instrument meteorological conditions, which resulted in an in-flight collision with tree-covered terrain.\n"}