{"url": "https://www.baaa-acro.com/crash/crash-bae-125-700a-akron-9-killed", "date": "Nov 10, 2015 at 1453 LT", "type": "BAe 125", "operator": "Execuflight", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "City", "schedule": "Dayton – Akron", "msn": "257072", "yom": 1979, "flight_number": "EFT1526", "city": "Akron-Canton", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 6170, "captain_hours_type": 1020, "copilot_hours": 4382, "copilot_hours_type": 482, "aircraft_hours": 14948, "circumstances": "The aircraft departed controlled flight while on a non precision localizer approach to runway 25 at Akron Fulton International Airport (AKR) and impacted a four-unit apartment building in Akron, Ohio. The captain, first officer, and seven passengers died; no one on the ground was injured. The airplane was destroyed by impact forces and post crash fire. The airplane was registered to Rais Group International NC LLC and operated by Execuflight under the provisions of 14 Code of Federal Regulations (CFR) Part 135 as an on-demand charter flight. Instrument meteorological conditions prevailed, and an instrument flight rules flight plan was filed. The flight departed from Dayton-Wright Brothers Airport, Dayton, Ohio, about 1413 and was destined for AKR. Contrary to Execuflight’s informal practice of the captain acting as pilot flying on flights carrying revenue passengers, the first officer was the pilot flying, and the captain was the pilot monitoring. While en route, the flight crew began preparing for the approach into AKR. Although company standard operating procedures (SOPs) specified that the pilot flying was to brief the approach, the captain agreed to the first officer’s request that the captain brief the approach. The ensuing approach briefing was unstructured, inconsistent, and incomplete, and the approach checklist was not completed. As a result, the captain and first officer did not have a shared understanding of how the approach was to be conducted. As the airplane neared AKR, the approach controller instructed the flight to reduce speed because it was following a slower airplane on the approach. To reduce speed, the first officer began configuring the airplane for landing, lowering the landing gear and likely extending the flaps to 25° (the airplane was not equipped with a flight data recorder, nor was it required to be). When the flight was about 4 nautical miles from the final approach fix (FAF), the approach controller cleared the flight for the localizer 25 approach and instructed the flight to maintain 3,000 ft mean sea level (msl) until established on the localizer. The airplane was already established on the localizer when the approach clearance was issued and could have descended to the FAF minimum crossing altitude of 2,300 ft msl. However, the first officer did not initiate a descent, the captain failed to notice, and the airplane remained level at 3,000 ft msl. As the first officer continued to slow the airplane from about 150 to 125 knots, the captain made several comments about the decaying speed, which was well below the proper approach speed with 25° flaps of 144 knots. The first officer’s speed reduction placed the airplane in danger of an aerodynamic stall if the speed continued to decay, but the first officer apparently did not realize it. The first officer’s lack of awareness and his difficulty flying the airplane to standards should have prompted the captain to take control of the airplane or call for a missed approach, but he did not do so. Before the airplane reached the FAF, the first officer requested 45° flaps and reduced power, and the airplane began to descend. The first officer’s use of flaps 45° was contrary to Execuflight’s Hawker 700A non precision approach profile, which required the airplane to be flown at flaps 25° until after descending to the minimum descent altitude (MDA) and landing was assured; however, the captain did not question the first officer’s decision to conduct the approach with flaps 45°. The airplane crossed the FAF at an altitude of about 2,700 ft msl, which was 400 ft higher than the published minimum crossing altitude of 2,300 ft msl. Because the airplane was high on the approach, it was out of position to use a normal descent rate of 1,000 feet per minute (fpm) to the MDA. The airplane’s rate of descent quickly increased to 2,000 fpm, likely due to the first officer attempting to salvage the approach by increasing the rate of descent, exacerbated by the increased drag resulting from the improper flaps 45° configuration. The captain instructed the first officer not to descend so rapidly but did not attempt to take control of the airplane even though he was responsible for safety of the flight. As the airplane continued to descend on the approach, the captain did not make the required callouts regarding approaching and reaching the MDA, and the first officer did not arrest the descent at the MDA. When the airplane reached the MDA, which was about 500 ft above the touchdown zone elevation, the point at which Execuflight’s procedures dictated that the approach must be stabilized, the airspeed was 11 knots below the minimum required airspeed of 124 knots, and the airplane was improperly configured with 45° flaps. The captain should have determined that the approach was unstabilized and initiated a missed approach, but he did not do so. About 14 seconds after the airplane descended below the MDA, the captain instructed the first officer to level off. As a result of the increased drag due to the improper flaps 45° configuration and the low airspeed, the airplane entered a stalled condition when the first officer attempted to arrest the descent. About 7 seconds after the captain’s instruction to level off, the cockpit voice recorder (CVR) recorded the first sounds of impact.", "probable_cause": "The National Transportation Safety Board determines that the probable cause of this accident was the flight crew’s mismanagement of the approach and multiple deviations from company standard operating procedures, which placed the airplane in an unsafe situation and led to an unstabilized approach, a descent below minimum descent altitude without visual contact with the runway environment, and an aerodynamic stall. Contributing to the accident were Execuflight’s casual attitude toward compliance with standards; its inadequate hiring, training, and operational oversight of the flight crew; the company’s lack of a formal safety program; and the Federal Aviation Administration’s insufficient oversight of the company’s training program and flight operations."}