{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-2-115b-kosti-2-killed", "date": "Aug 29, 1952 at 2105 LT", "type": "Douglas DC-2", "operator": "Phoenix Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Johannesburg – Bulawayo – Lusaka – Tabora – Juba – Wadi Halfa – Khartoum – Cairo – Southend", "msn": "1322", "yom": 1934, "flight_number": null, "city": "Kosti", "zone": "White Nile (النيل الأبيض)", "country": "Sudan", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off on a cargo flight from Rand Airport in Jo'burg to Southend, England, with a crew of four, two passengers and a load of Karakul pelts. The passengers left the aircraft at Bulawayo, deciding not to complete their journey. The aircraft started in company with another of the same operator which also crashed en route. On attempting a diversion landing at Kosti at night without suitable ground aids, the aircraft ran off the runway and collided with a steel support for a windsock and afterwards with trees causing major damage. Two crew were killed and two were injured. The aircraft was destroyed.", "probable_cause": "The primary cause of the accident was that extremely bad weather forced the Captain of the airplane to divert from his original destination. No proper preparation had been made for a possible landing at an alternate airfield prior to commencement of flight. The secondary cause was due to the Captain's attempt to execute a landing at Kosti aerodrome which was not equipped with night landing facilities. The Captain landed on the runway but was unable to align himself with the centre line and in consequence ran off the runway and struck a steel windsock support and thereafter struck various obstructions such as trees which lay in the path. \r\nThe following factors were considered as contributory:\r\n- Because of radio interference due to a storm, proper use could not be made of the radio navigational facilities carried on the aircraft,\r\n- The lack of appreciation by the Captain of his final responsibility for the operational control of the aircraft, which includes diversionary action, and his apparent failure to appreciate the purely advisory responsibility of Khartoum as a flight information centre."}