{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-62m-berlin-21-killed", "date": "Jun 17, 1989 at 0628 LT", "type": "Ilyushin II-62", "operator": "Interflug-2_0", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Berlin - Moscow", "msn": "2850324", "yom": 1988, "flight_number": "IF102", "city": "Berlin-Schönefeld", "zone": "Berlin", "country": "Germany", "region": "Europe", "crew_on_board": 10, "crew_fatalities": 0, "pax_on_board": 103, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": 7796, "captain_hours_type": null, "copilot_hours": 8947, "copilot_hours_type": null, "aircraft_hours": 1939, "circumstances": "Interflug flight 102, an Ilyushin Il-62M, was destroyed following a runway excursion accident on takeoff from Berlin-Schönefeld Airport, East Germany. Of the 113 occupants, 21 were killed. At 06:20 hours local time the engines were started. Immediately thereafter, the flight control surfaces were unlocked, a process which, according to the cockpit voice recorder, was not completed. The crew did not carry out the necessary check of the warning panel on the condition of the elevator. While taxiing for departure, the captain checked for the second time the movement of the elevators but failed to notice they were locked. The aircraft was cleared for takeoff from runway 25L and the engines were adjusted to rated power due to the low take-off mass of 113 tons. At 06:28:05 the aircraft reached VR. The captain pulled the control column during VR, but the aircraft did not respond. Four seconds later he called out to abort the takeoff. At this time the aircraft had attained a speed of 293 km/h. Instead of using reverse thrust, the flight engineer shut down all four engines. The speed at this time was 303 km/h and the remaining distance to the end of the runway was about 940 meters. The aircraft rolled over the end of the runway at a speed of 262 km/h and slightly to the left of the centerline. During the emergency braking five tires of the main landing gear had been destroyed. The airaft crossed an excavation pit of 40 cm deep, causing the the right main landing gear to collapse. It then collided with a water tank, concrete piles of the airport fence, a road embankment and six trees. At 06:28:37 the aircraft came to rest and burst into flames. Within two minutes, 82 passengers could be rescued alive from the fuselage, which had been broken into three parts. All 10 crew members survived.", "probable_cause": "Investigations were unable to determine the exact cause of the accident. A technical problem with rudder controls or components could not be excluded and an error on part of the flying crew could not be proven."}