{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-new-bedford-3-killed", "date": "Feb 2, 2007 at 1940 LT", "type": "Socata TBM-700", "operator": "PK Leasing", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Boston - New Bedford", "msn": "206", "yom": 2001, "flight_number": null, "city": "New Bedford", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1037, "captain_hours_type": 65, "copilot_hours": 300, "copilot_hours_type": 80, "aircraft_hours": 479, "circumstances": "During the flight, the private pilot/operator was most likely seated in the left seat. He obtained his instrument rating about 7 months prior to the accident, and had accumulated approximately 300 hours of flight experience; of which, about 80 hours were in the accident airplane. The commercial pilot/company pilot was most likely seated in the right seat. He had accumulated approximately 1,000 hours of flight experience; of which, about 125 hours were actual instrument experience, and 80 hours were in the accident airplane. The commercial pilot had filed a flight plan to the wrong airport, received a weather briefing for the wrong airport, and therefore was not aware of the NOTAM in effect for an out of service approach lighting system at the destination airport. When the commercial pilot realized his error, he changed the flight plan, but did not request another weather briefing. According to radar information, the airplane flew the instrument landing system runway 5 approach fast, performed a steep missed approach to 1,000 feet, and then disappeared from radar, consistent with a loss of control during the missed approach. No preimpact mechanical malfunctions were identified with the airplane during the investigation. The reported weather at the accident airport included an overcast ceiling at 200 feet, visibility 1 mile in light rain and mist, and wind from 160 degrees at 4 knots. The investigation could not determine which pilot was flying the airplane at the time of the accident.", "probable_cause": "Both pilots' failure to maintain aircraft control during a missed approach."}