{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a90-king-air-pitt-meadows", "date": "Aug 3, 2008 at 1524 LT", "type": "Beechcraft 90 King Air", "operator": "Flanagan Enterprises - USA", "flight_phase": "Landing (descent or approach)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pitt Meadows - Pitt Meadows", "msn": "LJ-164", "yom": 1966, "flight_number": null, "city": "Pitt Meadows", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4800, "captain_hours_type": 1290, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13257, "circumstances": "The Bill Dause Beech 65-A90 King Air (United States registration N17SA, aircraft serial number LJ-164) took off from Pitt Meadows Airport, British Columbia, with the pilot and seven parachutists for a local sky diving flight. At 1521 Pacific daylight time, as the aircraft was climbing through 3900 feet above sea level, the pilot reported an engine failure and turned back towards Pitt Meadows Airport for a landing on Runway 08R. The airport could not be reached and a forced landing was carried out in a cranberry field, 400 metres west of the airport. On touchdown, the aircraft struck an earthen berm, bounced, and struck the terrain again. On its second impact, the left wing dug into the soft peat, spinning the aircraft 180 degrees. Four of the parachutists received serious injuries and the aircraft was substantially damaged. There was no fire and the occupants were evacuated. The emergency locator transmitter functioned at impact and was turned off by first responders.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The general condition of the aircraft, the engine time before overhaul (TBO) over-run and the missed inspection items demonstrated inadequate maintenance that was not detected by regulatory oversight.\r\n2. The TBO over-run and missed inspections resulted in excessive spline wear in the left engine-driven fuel pump going undetected.\r\n3. The left engine lost power due to mechanical failure of the engine fuel pump drive splines.\r\n4. The horizontal engine instrument arrangement and the lack of recent emergency training made quick engine malfunction identification difficult. This resulted in the pilot shutting down the wrong engine, causing a dual-engine power loss and a forced landing.\r\n5. Not using the restraint devices contributed to the seriousness of injuries to some passengers.\r\nFinding as to Risk:\r\n1. There is a risk to passengers if Transport Canada does not verify that holders of Canadian Foreign Air Operator Certificates-Free Trade Agreement meet airworthiness and operational requirements. "}