{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-1245-butte-14-killed", "date": "Mar 22, 2009 at 1430 LT", "type": "Pilatus PC-12", "operator": "Eagle Cap Leasing", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Oroville - Bozeman", "msn": "403", "yom": 2001, "flight_number": null, "city": "Butte", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 13, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 8840, "captain_hours_type": 1760, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1916, "circumstances": "On March 22, 2009, about 1432 mountain daylight time, a Pilatus PC-12/45, N128CM, was diverting to Bert Mooney Airport (BTM), Butte, Montana, when it crashed about 2,100 feet west of runway 33 at BTM. The pilot and the 13 airplane passengers were fatally injured, and the airplane was substantially damaged by impact forces and a post crash fire. The airplane was owned by Eagle Cap Leasing of Enterprise, Oregon, and was operating as a personal flight under the provisions of 14 Code of Federal Regulations Part 91. The flight departed Oroville Municipal Airport, Oroville, California, on an instrument flight rules flight plan with a destination of Gallatin Field, Bozeman, Montana. Visual meteorological conditions prevailed at the time of the accident. ", "probable_cause": "(1) the pilot’s failure to ensure that a fuel system icing inhibitor was added to the fuel before the flights on the day of the accident; \r\n(2) his failure to take appropriate remedial actions after a low fuel pressure state (resulting from icing within the fuel system) and a lateral fuel imbalance developed, including diverting to a suitable airport before the fuel imbalance became extreme; and \r\n(3) a loss of control while the pilot was maneuvering the left-wing-heavy airplane near the approach end of the runway. "}