{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-near-chignik-1-killed", "date": "May 1, 2017 at 1350 LT", "type": "Cessna 208B Grand Caravan", "operator": "Grant%20Aviation-2_0", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Port Heiden - Perryville", "msn": "208B-0321", "yom": 1992, "flight_number": "GV341", "city": "Chignik", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4989, "captain_hours_type": 904, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17990, "circumstances": "The airline transport pilot was conducting a commercial visual flight rules (VFR) flight. A passenger who was on the first segment stated that the pilot flew the airplane lower than usual for that route, and that the airplane flew through clouds during the flight. The passenger disembarked and the pilot departed on the second segment of the flight with a load of mail. The route included flight across a peninsula of mountainous terrain to a remote coastal airport that lacked official weather reporting or instrument approach procedures. About 28 minutes after departure, an emergency locator transmitter (ELT) signal from the airplane was received and a search and rescue operation was initiated. The wreckage was located about 24 miles from the destination in deep snow on the side of a steep, featureless mountain at an elevation about 3,000 ft mean sea level. The accident site displayed signatures consistent with impact during a left turn. Examination of the airplane revealed no evidence of mechanical malfunctions or anomalies that would have precluded normal operation. The airplane was not equipped with any recording or flight tracking devices, nor was it required to be; therefore, the airplane's flight track before the accident could not be determined. The airplane was certified for instrument flight and flight in icing conditions and was equipped with a terrain avoidance warning system (TAWS) which was not inhibited during the accident. Although the TAWS should have provided the pilot with alerts as the airplane neared the terrain, it could not be determined if this occurred or if the pilot heeded the alerts. A review of nearby weather camera images revealed complete mountain obscuration conditions with likely rain shower activity in the vicinity of the accident site. Visible and infrared satellite imagery indicated overcast cloud cover over the accident site at the time of the accident. The graphical forecast products that were available to the pilot before the flight indicated marginal VFR conditions for the entire route. There was no evidence that the pilot obtained an official weather briefing, and what weather information he may have accessed before the flight could not be determined. Additionally, the cloud conditions and snow-covered terrain present in the area likely resulted in flat light conditions, which would have hindered the pilot's ability to perceive terrain features and closure rates. Based on the weather camera, surface, and upper air observations, it is likely that the pilot encountered instrument meteorological conditions inflight, after which he performed a left turn to return to visual meteorological conditions and did not recognize his proximity to the mountain due to the flat light conditions. The pilot and the dispatch agent signed a company flight risk assessment form before the flight, which showed that the weather conditions for the flight were within the company's acceptable risk parameters. Although the village agents at the departure and destination airports stated that the weather at those coastal locations was good, the weather assessment for the accident flight was based on hours-old observations provided by a village agent who was not trained in weather observation and did not include en route weather information, the area forecast, or the AIRMET for mountain obscuration effective during the dispatch time and at the time of the accident. Since acquiring the accident route from another operator years earlier, the company had not performed a risk assessment of the route and its associated hazards. Multiple company pilots described the accident route of flight as hazardous and considered it an undesirable route due to the terrain, rapidly changing weather, and lack of weather reporting infrastructure; however, the company did not address or attempt to mitigate these known hazards through its risk assessment processes. The company's controlled-flight-into-terrain (CFIT)-avoidance program stated that each pilot shall have one classroom training session and one CFIT-avoidance training session in an aviation training device (ATD) each year; however, the pilot's training records indicated that his most recent ATD session was 15 months prior. More recent CFIT avoidance training may have resulted in the pilot recognizing and responding to the reduced visibility and flat light conditions sooner.", "probable_cause": "The pilot's continued visual flight rules flight into an area of mountainous terrain and instrument meteorological conditions, which resulted in controlled flight into terrain (CFIT). Contributing to the accident was the company's failure to provide the pilot with CFIT-avoidance recurrent simulator training as required by their CFIT avoidance program and the company's inadequate flight risk assessment processes, which did not account for the known weather hazards relevant to the accident route of flight."}