{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950-otangiwai-1-killed", "date": "Mar 2, 1981 at 1025 LT", "type": "Fletcher FU-24", "operator": "Robertson%20Air%20Service", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Otangiwai - Otangiwai", "msn": "195", "yom": 1971, "flight_number": null, "city": "Otangiwai", "zone": "Manawatu-Wanganui (Horizons Regional Council)", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10898, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "An aerial topdressing operation was being carried out from an airstrip near Otangiwai. The sowing area was on an adjacent farm property. The pilot commenced sowing over the higher ground in the area, but as the morning progressed turbulence became significant in the lee of the hills and the highly experienced pilot ( 10,898 flying hours ) decided to turn his attention to the lower part of the farm. Accordingly a sortie was carried out over the northeastern corner of the property. At 10:20 the pilot took off to make another series of sowing runs over the same area. The Fletcher did not come back from this sortie and at about 11:00 the wreckage of ZK-DUI was found. Fire had not occurred.The pilot was dead. The crash site was on a level river flat.The aircraft had dived into the ground at an angle of at least 60 degrees to the horizontal and probably near vertically. The propeller was separated from the engine and buried 1 metre in the soil. Compression damage had severed the fuselage at the middle of the cockpit and the remainder of the aircraft had rebounded and came to rest on the main wheels some 8 metres from the forward fuselage. The rear fuselage was folded in half behind the wing. No fertilizer was in the hopper and there was none in the vicinity of the wreck.The left outer wing panel was found about 100 metres from the rest of the plane. Its leading edge section was missing. Cable marks showed that the LE section had been sheared off from the main spar by a wire cable. The investigation found that the aircraft had collided in flight with a single 11,000 volt conductor, or wire, at roughly the center of the 500 metre span between two poles. The collision was at a height of about 220 feet AGL and about 600 metres from the crash site. The wire was strung across the valley as part of a 4-kilometre-long electrical supply line installed by the local power authority only about five weeks before.", "probable_cause": "The accident investigator concluded that this accident was probably caused by a loss of control of the aircraft after it was substantially damaged in a collision with a power conductor."}