{"url": "https://www.baaa-acro.com/crash/crash-boeing-377-10-19-stratocruiser-pacific-ocean-44-killed", "date": "Nov 8, 1957 at 0127 LT", "type": "Boeing 377 Stratocruiser", "operator": "Pan%20Am.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "San Francisco – Honolulu", "msn": "15960", "yom": 30, "flight_number": "PA007", "city": "Pacific Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 36, "pax_fatalities": 36, "other_fatalities": 0, "total_fatalities": 44, "captain_hours": 11314, "captain_hours_type": 674, "copilot_hours": 7355, "copilot_hours_type": 4018, "aircraft_hours": 23690, "circumstances": "Clipper 944, 1 a regularly scheduled around-the-world flight, originated at San Francisco with its first stop scheduled at Honolulu. It departed San Francisco at 1951 2 on November 8 estimating arrival at Honolulu at 0550, November 9. There were 36 passengers and a crew consisting of Captain Gordon H. Brown, First Officer William P. Wygant, Second Officer William H. Fortenberry, Flight Engineer Albert F. Pinataro, Purser Oliver E. Crosthwaite, Stewardesses Yvonne L. Alexander and Marie L. McGrath, and Flight Service Supervisor John E. King. The flight plan specified a cruising altitude of 10,000 feet and an airspeed of 226 knots. Gross weight at departure was 147,000 pounds, the maximum allowable, and the weight included fuel for approximately 13 hours. Good weather was forecast for the duration of the flight. All required position reports were made and Clipper 944 reported to Ocean Station vessel \"November\" at 0030; its position was fixed by radar as 10 miles east of the vessel. The last position report, at 0104, was routine with no indication of anything unusual. The next scheduled position report, due at 0204, was not received and 30 minutes thereafter the flight was designated unreported. Five days later, nine bodies and some debris were find about 147 miles northeast of the estimated point of impact. There were no survivors among the 44 occupants. ", "probable_cause": "The Board has insufficient tangible evidence at this time to determine the cause of the accident. Further research and investigation is in process concerning the significance of evidence of carbon monoxide in body tissue of the aircraft occupants. The following findings were reported:\r\n- The gross weight of the aircraft at the time of takeoff was 147.000 pounds, the maximum allowable,\r\n- Progress of the flight and position reports were normal and routine for wore than half of the planned flight distance,\r\n- Shortly after the last routine report an emergency of undetermined nature occurred,\r\n- This was followed by a descent from 10.000 feet,\r\n- No emergency message was received from the aircraft,\r\n- Some preparation for ditching was accomplished,¨\r\n- The aircraft broke up on impact,\r\n- A surface fire then occurred,\r\n- Weather was not a factor,\r\n- Exposure of the crew to carbon monoxide was indicated but incapacitation could not be definitely established,\r\n- No evidence of foul play or sabotage was found,\r\n- Irregularities of maintenance practices and/or procedures disclosed during the investigation could not be linked to the accident."}