{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-25-dk-brandywine-2-killed", "date": "Jan 6, 1949 at 0720 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Coastal Cargo", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Miami – West Palm Beach – Raleigh – Boston", "msn": "13777", "yom": 1944, "flight_number": null, "city": "Brandywine", "zone": "Maryland", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3605, "captain_hours_type": 3100, "copilot_hours": 360, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight departed from Miami, Fla., for Boston, Mass., at approximately 1610, January, 1949, with a crew consisting of Stuart L. Morrill, pilot, and Theodore Catz, copilot. A landing was made at Morrison Field, West Palm Beach, Fla., where 6,255 pounds of flowers were loaded. With the flowers, 3,600 pounds of fuel, 254 pounds of oil, and the crew, the airplane weighed 26,944 pounds at time of takeoff, which was 44 pounds above the allowable of 26,900 pounds. All cargo was loaded so that the center of gravity of the airplane was within the certificated limits. Departure from West Palm Beach was accomplished at approximately 1900 after which the flight proceeded without incident to its first fueling stop, Raleigh-Durham, NC. While on the Raleigh-Durham Airport the airplane was fueled to its capacity of 700 gallons, which was 100 gallons more than was on board at West Palm Beach. As a result, the airplane weighed 27,544 pounds when taking off from Raleigh, which constituted an overload of 644 pounds. Because of unfavorable weather conditions, takeoff had been delayed until 0610, January 6, 1949. The flight then continued en route to Boston following an instrument flight plan. Forty-five minutes after departure from Raleigh, at 0655, a routine position report was received by Richmond Radio that the flight was over Richmond, Va., at 9,000 feet. Washington Radio attempted to contact the flight at 0707, but no further communication was received from the flight by any CAA communication station although continuous efforts were made for a period of approximately 50 minutes. The airplane was observed at approximately 0720 over Brandywine, MD, at considerable altitude immediately underneath a cloud deck, proceeding in normal level flight in a northerly direction. Then, to those on the ground, it appeared that the airplane turned left and spun for two complete turns, losing considerable altitude. Partial recovery was made, but the airplane began spinning for a second time to the left. Again it appeared that a partial recovery was made, but again the aircraft spun to the left, losing altitude to below 3,000 feet. After this, ground observers watched the aircraft fly level but erratically for a brief period. They were able to see that the right horizontal stabilizer was deflected upward to a near vertical position, and that the right elevator was missing. The airplane then entered a diving left turn, and crashed 1,500 yards southeast of the Brandywine radio range station. Fire started shortly after impact. Both crew members were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the loss of control of the aircraft which resulted from an icing condition, turbulence, and lack of alertness on the part of the crew. As a result, the aircraft spun, and during the spins, or attempted recovery from the spins, severe airloads were encountered which failed the left horizontal stabilizer and the elevators.\r\nThe following findings were pointed out:\r\n- The aircraft was observed at considerable altitude, immediately underneath a cloud deck, in straight and level flight after which it made a series of three spins,\r\n- After the recovery from the last spin, the aircraft flew level but erratically for a brief period following which it crashed to the ground,\r\n- The left horizontal stabilizer was bent upwards by severe air loads, and it had rotated several times to a near vertical position while the aircraft was in flight,\r\n- The right elevator was bent upwards and had been separated from the stabilizer as a result of extreme air loads; and the left elevator, although not totally separated from the stabilizer, was similarly damaged,\r\n- At the time of the accident, there was an icing condition present in the layer of broken clouds at the flight’s cruising altitude of 9,000 feet, the temperature at that altitude being 32 degrees Fahrenheit or slightly below. Moderate turbulence also existed,\r\n- The aircraft was equipped with anti-icing equipment for the propellers, but it was not equipped with deicer booth for the wings and empennage,\r\n- Before taking off for the flight, the pilots had a rest period of 22 hours previous to which they had completed another flight of 20 hours and 35 minutes."}