{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-kuredu-island", "date": "Jul 2, 2015 at 1733 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Trans%20Maldivian%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Male - Kuredu Island", "msn": "435", "yom": 1974, "flight_number": null, "city": "Kuredu Island", "zone": "North Central Province", "country": "Maldivian Islands", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 11, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5075, "captain_hours_type": 4200, "copilot_hours": 988, "copilot_hours_type": 705, "aircraft_hours": 24132, "circumstances": "Flight FLT371301, a Viking Air (De Havilland) DHC-6-300 aircraft with registration mark 8Q-MAN, crashed into the sea approximately 3 km southeast of Kuredu (KUR) at 1733 hrs on 2 July 2015. The aircraft was flying under visual flight rules (VFR) on a charter flight, carrying 11 passengers from Komandoo (KOM) to Kuredu (KUR). According to the operating crew, the aircraft was on final approach, northwest bound, to land at KUR. At approximately 400 feet, on selection of flaps to the fully down position, the aircraft pitched up and the aircraft was vibrating. The pilot flying (PF) could not control the aircraft and asked the PIC to take over the controls. The aircraft was in a nose-high attitude when the PIC took over the controls. The stall warning light illuminated. The PIC applied full left rudder, moved the control column forward and put the power levers to idle to recover the aircraft. The aircraft, however, did not respond to these actions. Flaps were then moved to the fully up position. The PIC was gaining some control at this stage but the aircraft continued turning right, losing height and impacted the sea before he could regain full control of the aircraft. On initial impact the left float detached. The aircraft then bounced and landed on the right float causing the right float to also detach from the aircraft. The right float was, however, trapped between the airframe and the engine for several minutes. With both floats detached from the aircraft and the right float still trapped between the airframe and engine, the aircraft stayed afloat until all passengers and crew evacuated. At the same time the aircraft started tilting left causing water to rush inside and started sinking. All 11 passengers and three crew were able to evacuate the aircraft without injury, before the aircraft completely sank. The accident was notified to the Aircraft Accident Investigation Committee (AICC) at 1750 hrs. Investigation began on the same day. Inspectors arrived at the scene at 2300 hrs, about five and a half hours after the accident occurred.", "probable_cause": "The investigation identified the following causes:\r\na. The aircraft was operated outside the centre of gravity limitations on the sector in which the accident occurred.\r\nb. The load distribution errors went undetected because the mass and balance calculations were not carried out in accordance with the approved procedures, prior to the accident flight.\r\nc. The co-pilot (PF) was not alerted to the impending stall as she neither saw the stall warning light illuminated nor heard the aural stall warning.\r\nd. The PIC was not able to gain control of aircraft as developing stall was not recognized and incorrect recovery procedures were applied."}