{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-2r7f-near-wanli-5-killed", "date": "Dec 29, 1991 at 1505 LT", "type": "Boeing 747-200", "operator": "China-Airlines-2", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Taipei - Anchorage", "msn": "22390", "yom": 1980, "flight_number": "CI358", "city": "Wanli", "zone": "New Taipei City (新北市)", "country": "Taiwan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 45868, "circumstances": "Four minutes after takeoff from Taipei-Chiang Kai Shek Airport, while climbing to an altitude of 5,000 feet, the crew contacted ATC and declared an emergency after the engine n°3 separated from the right wing. The crew was instructed first to maintain FL050 and to initiate a left turn but the captain replied this was not possible so he was eventually cleared to turn to the right. Two minutes later, the aircraft entered an uncontrolled descent and crashed on the slope of Mt Wuzu located near Wanli, about 20 km northeast of Taipei. The aircraft disintegrated on impact and all five crew members were killed. The accident occurred six minutes after takeoff. ", "probable_cause": "It was determined that the engine n°3 detached during initial climb following the rupture of its pylon due to the presence of fatigue cracks. After the engine n°3 detached, it struck the engine n°4 that separated as well. In such conditions, the crew was unable to maintain a safe control of the aircraft. Last A-check maintenance programme was completed last December 21. It was also reported that a misunderstanding occurred between pilots and ATC who misunderstood which engine was lost, thinking that the emergency situation was reporting to a loss of engine n°2. "}