{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226t-merlin-iii-andorra", "date": "Apr 26, 2016 at 1535 LT", "type": "Swearingen SA226T Merlin III", "operator": "Medelair", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Alicante - Andorra", "msn": "T-250", "yom": 1974, "flight_number": null, "city": "Andorra-La Seu d'Urgell", "zone": "Catalonia", "country": "Spain", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4750, "captain_hours_type": 1200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine airplane departed Alicante-Mutxamel Airport at 1221LT on a private flight to Andorra, carrying four passengers and one pilot. Following an uneventful flight at an altitude of 12,500 feet, the pilot informed ATC about electrical problems then initiated the descent to Andorra. About two minutes later, the electrical system totally failed. The pilot continued the approach to Andorra-La Seu d'Urgell Airport. After touchdown on runway 21, the undercarriage collapsed. The aircraft veered off runway to the right and came to rest in a grassy area. All five occupants evacuated safely and the aircraft was damaged beyond repair. ", "probable_cause": "It is considered that the accident was caused by an error in the application of the emergency extension procedure of the landing gear following a total failure of the electrical system. \r\nContributing factors :\r\n- Start a visual flight with a deferred pending repair in the electrical system, specifically with the generator on the right side.\r\n- Lack of recent training and simulation with emergency procedures.\r\n- The versatility of the pilot and diversity of different aircraft types flown.\r\n- The non-activation of the warning light on the left-hand side of the cockpit panel when the electrical system failed about 30 minutes prior to the total exhaustion of all batteries.\n"}