{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-millington", "date": "Dec 9, 2008 at 1058 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Briggs Tobacco & Specialty Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Millington - Millington", "msn": "1533", "yom": 1981, "flight_number": null, "city": "Millington-Memphis", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5311, "captain_hours_type": 662, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6094, "circumstances": "According to the pilot, after he took off for a nearby airport he raised the landing gear but did not raise the 20-degree flaps per the “after takeoff” checklist. Shortly thereafter, when the airplane was at an altitude of about 2,400 feet, and in \"heavy rain,\" the pilot noticed that the right engine was losing power. He subsequently feathered the propeller as engine power reduced to 40 percent, but still did not raise the flaps. Weather, recorded shortly before the accident, included scattered clouds at 500 feet, and a broken cloud layer at 1,200 feet, and the pilot advised air traffic control (ATC) that he would fly an ILS (instrument landing system) approach if he could maintain altitude. After maneuvering, and advising ATC that he could not maintain altitude, the pilot descended the airplane to a right base leg where, about 1/4 nautical mile from the runway, it was approximately 300 feet above the terrain. The pilot completed the landing, with the airplane touching down about 6,200 feet down the 8,000-foot runway, heading about 20 degrees to the left. The airplane veered off the left side of the runway and subsequently went through an airport fence. The left engine was running at “high speed” when fire fighters responded to the scene. The right engine propeller was observed in the feathered position at the scene, and after subsequent examinations, the right engine was successfully run in a test cell with no noticeable loss of power. There was no determination as to why the right engine lost power in flight, although rain ingestion is a possibility. Airplane performance calculations indicated that with the landing gear up, a proper single-engine power setting and airspeed, and flaps raised, the airplane should have been able to climb about 650 feet per minute. Even with flaps at 20 degrees, it should have been able to climb at 350 feet per minute. In either case, unless the airplane was not properly configured, there was no  reason why it should not have been able to maintain the altitudes needed to position it for a stabilized approach.\n", "probable_cause": "The pilot’s improper configuration of the airplane following an engine shutdown, which resulted in a low-altitude, unstabilized approach. Contributing to the accident was a loss of engine power for undetermined reasons."}