{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b100-king-air-100-benavides-4-killed", "date": "Oct 26, 2009 at 1143 LT", "type": "Beechcraft 100 King Air", "operator": "Mazak Properties", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Uvalde - Leesburg", "msn": "BE-2", "yom": 1976, "flight_number": null, "city": "Benavides", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 550, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot obtained three weather briefings before departure. At that time, the current weather along the route of flight showed significant convective activity and a moving squall line, and the forecast predicted significant thunderstorm activity along the planned route of flight. The pilot was concerned about the weather and mentioned that he would be looking for \"holes\" in the weather to maneuver around via the use of his on-board weather radar. He decided to fly a route further south to avoid the severe weather. Radar data indicates that, after departure, the pilot flew a southerly course that was west of the severe weather before he asked air traffic control for a 150-degree heading that would direct him toward a \"hole\" in the weather. A controller, who said he also saw a \"hole\" in the weather, told the pilot to fly a 120-degree heading and proceed direct to a fix along his route of flight. The airplane flew into a line of very heavy to intense thunderstorms during cruise flight at 25,000 feet before the airplane began to lose altitude and reverse course. The airplane then entered a rapid descent, broke up in flight, and subsequently impacted terrain. Review of recorded precipitation data showed that there was substantial information available to the controller about moderate to extreme weather along the aircraft’s route of flight. While the controller stated that he saw a hole or clear area ahead of the aircraft, this is contradicted by both the recorded data and the statement of a second controller working the D-position at the time of the accident. The first controller did not advise the pilot of the severe weather that was along this new course heading and the pilot entered severe weather and began to lose altitude. The controller queried the pilot about his altitude loss and the pilot mentioned that they had gotten into some \"pretty good turbulence.\" This was the last communication from the pilot before the airplane disappeared from radar. Review of recorded precipitation data showed that there was substantial information available to the controller about moderate to extreme\r\nweather along the aircraft’s route of flight. The controller did not provide advisories to the pilot regarding the adverse weather's immediate safety hazard to the accident flight as required by Federal Aviation Administration Order 7110.65. Examination of the recovered sections of flight control surfaces revealed that all of the fractures examined exhibited signs consistent with overstress failure. There was no evidence of preexisting cracking on any of the fracture surfaces examined and no preaccident anomalies were noted with the engines.\n", "probable_cause": "The pilot's failure to avoid severe weather, and the air traffic controller's failure to provide adverse weather avoidance assistance, as required by Federal Aviation Administration directives, both of which led to the airplane's encounter with a severe thunderstorm and the subsequent loss of control and inflight breakup of the airplane.\n"}