{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-321c-lusaka-6-killed", "date": "May 14, 1977 at 1433 LT", "type": "Boeing 707", "operator": "IAS%20Cargo%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "London - Athens - Nairobi - Lusaka", "msn": "18579/332", "yom": 1963, "flight_number": null, "city": "Lusaka", "zone": "Lusaka City District", "country": "Zambia", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 6782, "captain_hours_type": 115, "copilot_hours": 13745, "copilot_hours_type": 2482, "aircraft_hours": 47621, "circumstances": "The crew was completing a cargo flight from London to Lusaka with intermediate stops in Athens and Nairobi. Following an uneventful flight from Nairobi, a clearance was given to descend further down to FL70 in 1,000 feet steps. At 09:28 the copilot reported that the airfield was in sight. Lusaka then cleared the aircraft to descend to 6,000 feet (2,221 feet above runway elevation) and moments later a clearance was given to make a visual approach for runway 10. At 09:32 flaps were selected to 50°. Suddenly, at 09:33, the complete right-hand horizontal stabilizer and elevator assembly were seen to separate in flight. The aircraft pitched rapidly nose down and dived vertically into the ground from a height of about 800 feet. The main wreckage was located 3,660 meters from the runway threshold. The aircraft was totally destroyed and all six occupants were killed. ", "probable_cause": "The accident was caused by a loss of pitch control following the in-flight separation of the right hand horizontal stabilizer and elevator as a result of a combination of metal fatigue and inadequate failsafe design in the rear spar structure. Shortcomings in design assessment, certification and inspection procedures were contributory factors."}