{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-15-urbana-25-killed", "date": "Mar 9, 1967 at 1153 LT", "type": "Douglas DC-9", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "New York – Harrisburg – Pittsburgh – Dayton – Chicago", "msn": "45777/80", "yom": 1967, "flight_number": "TW553", "city": "Urbana", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 21, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 25, "captain_hours": 9832, "captain_hours_type": 193, "copilot_hours": 1560, "copilot_hours_type": 15, "aircraft_hours": null, "circumstances": "Flight 553 was a scheduled domestic passenger flight from New York to Chicago, Illinois, with en-route stops at Harrisburg, Pittsburgh, Pennsylvania, and Dayton, Ohio. The flight departed Pittsburgh for Dayton at 1125 hours Eastern Standard Time on an IFR flight plan and was operated under radar surveillance for the duration of the flight. As the flight approached the Dayton terminal area it was cleared to descend from FL 200, its cruising altitude, to 5 000 ft, and a transfer of radar control from Indianapolis Air Route Traffic Control Centre (ARTCC) to the Dayton Radar Approach Control facility (RAPCON) was made when the flight was approximately 8 miles northeast of the Urbana Intersection on Victor Airway 12 North. The Dayton RAPCON approach controller established radio contact with the flight at 1152:36 hours. The flight was again cleared to 5 000 ft, instructed to take a heading of 240° for a vector to the final approach course (ILS) and to report leaving 6 000 ft. At 1153:22 hours, the controller cleared the flight to descend to and maintain 3 000 ft and turn left to a heading of 230'. This was correctly acknowledged by the pilot- in-command at 1153:28 hours. Immediately after the issuance of this clearance the controller observed for the first time an unidentified radar target ahead and slightly to the right of the flight and issued at 1153:32 hours the following traffic advisory: \"TWA five fifty three, roger, and traffic at twelve thirty, one mile, southbound, slow moving.\" This was acknowledged by the pilot-in-command at 1153:36 hours. Approximately 14 seconds later, the flight and the unidentified radar target merged, separated, changed shape on the radar screen and then disappeared. At 1154:02 hours the controller advised the flight that it was clear of traffic but no reply was received. Subsequent efforts to establish contact with the flight were unsuccessful. The unidentified radar return was from a Beechcraft Baron B-55 on a company business flight, en route from Detroit, Michigan, to Springfield, Ohio. The aircraft had departed Detroit City Airport at 1101 hours on a special VFR clearance to leave the control zone 5 miles from the airport. No flight plan was filed, nor was one required. Approximately two minutes after take-off, the pilot reported on top of the smoke and haze and then left the Detroit tower frequency. No record of any further communication with any FAA communication facility or air traffic control facility could be found that related to the Beechcraft, nor was such communication required. The operator of Springfield Aviation Inc., at the Springfield Airport, testified that at approximately 1154 hours the pilot of the Beechcraft established radio contact with his office and requested a courtesy car. During this conversation the pilot stated that he would be landing shortly. There was no record of any subsequent radio contact with the aircraft. The aircraft collided at 1153:50 hours, in bright daylight, approximately 25 NM northeast of the Dayton Municipal Airport at an altitude of about 4 525 ft AMSL, and both aircraft crashed. The wreckage of the DC-9 was found in a wooded area. All 26 occupants in both aircraft were killed.  ", "probable_cause": "The Board determined that the probable cause of this accident was the failure of the DC-9 crew to see and avoid the Beechcraft. Contributing to this cause were physiological and environmental conditions and the excessive speed of the DC-9 which reduced visual detection capabilities under an air traffic control system which was not designed or equipped to separate a mixture of controlled and uncontrolled traffic."}