{"url": "https://www.baaa-acro.com/crash/crash-sncase-se161-languedoc-beirut", "date": "Jan 6, 1954 at 0352 LT", "type": "SNCASE SE.161 Languedoc", "operator": "Air%20Liban", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Beirut – Kuwait City", "msn": "14", "yom": 1945, "flight_number": null, "city": "Beirut", "zone": "Beirut Governorate", "country": "Lebanon", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During the takeoff roll on runway 18, at a speed of 90 knots, the pilot-in-command encountered control difficulties while the aircraft veered to the left side of the runway. He took a corrective action but the airplane started to swerve. In such conditions, he decided to abandon the takeoff run and started an emergency braking procedure, closed the throttle and applied brakes simultaneously. The aircraft then veered off runway to the left at a speed around 50 to 60 knots and while contacting soft ground, lost its left main gear while both left engines struck the ground and came to rest in flames. All nine occupants evacuated safely while the aircraft was destroyed by fire. ", "probable_cause": "The accident was due to a loss of power followed by a sudden picking up of no. 1 engine, added to the inherent tendency of the aircraft to veer to the left. The flight engineer noticed this loss of power but did not warn the pilot before checking the instruments at his own station. Having noticed that his instruments read normally, and finding, on turning back to the pilot's panel, that the engine had picked up, he did not consider it necessary to report the loss of power to the pilot-in-command. The pilot-in-command must have presumed the swerving of the aircraft to be normal and have corrected the motion of the aircraft on that basis. Owing to the complexity of the flight engineer's duties on take-off and to the fact that he had to stand, thus being subject to inertia and centrifugal forces, he was hampered and delayed in his motions. The aircraft was destroyed as a result of the fact that, in running over sandy ground its left wheel sank into a soft spot causing the left attachment fitting of the left landing gear to break. In collapsing, the landing-gear caused no. 1 and, no. 2 engines to come into contact with the ground. The fuel cocks and the cut-off valves were not closed. Fire broke out on the left wing, and destroyed the aircraft."}