{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-delaware-1-killed", "date": "Mar 17, 2019 at 1745 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Classic Solutions Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Dayton - Delaware", "msn": "421B-0816", "yom": 1974, "flight_number": null, "city": "Delaware", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3000, "captain_hours_type": 48, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8339, "circumstances": "The pilot departed on a short cross-country flight in the twin-engine airplane. Instrument meteorological conditions (IMC) were present at the time. While en route at an altitude of 3,000 ft mean sea level, the pilot reported that the airplane was \"picking up icing\" and that he needed to \"pick up speed.\" The controller then cleared the pilot to descend, then to climb, in order to exit the icing conditions; shortly thereafter, the controller issued a low altitude alert. The pilot indicated that he was climbing; radar and radio contact with the airplane were lost shortly thereafter. The airplane impacted a field about 7 miles short of the destination airport. Examination of the airplane was limited due to the fragmentation of the wreckage; however, no pre-impact anomalies were noted during the airframe and engine examinations. Extensive damage to the pitot static and deicing systems precluded functional testing of the two systems. A review of data recorded from onboard avionics units indicated that, about the time the pilot reported to the controller that the airplane was accumulating ice, the airplane's indicated airspeed had begun to diverge from its ground speed as calculated by position data. However, several minutes later, the indicated airspeed was zero while the ground speed remained fairly constant. It is likely that this airspeed indication was the result of icing of the airplane's pitot probe. During the final 2 minutes of flight, the airplane was in a left turn and the pilot received several \"SINK RATE\" and \"PULL UP PULL UP\" annunciations as the airplane conducted a series of climbs and descents during which its ground speed (and likely, airspeed) reached and/or exceeded the airplane's maneuvering and maximum structural cruising speeds. It is likely that the pilot became distracted by the erroneous airspeed indication due to icing of the pitot probe and subsequently lost control while maneuvering.", "probable_cause": "A loss of airspeed indication due to icing of the airplane's pitot probe, and the pilot's loss of control while maneuvering."}