{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2b-27-islander-durban", "date": "Aug 21, 2005 at 1300 LT", "type": "Britten-Norman Islander", "operator": "B. D. Bandall", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "City", "schedule": "Manzengwenya – Durban", "msn": "869", "yom": 1978, "flight_number": null, "city": "Durban-Virginia", "zone": "KwaZulu-Natal", "country": "South Africa", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 950, "captain_hours_type": 6, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7670, "circumstances": "The pilot accompanied by five passengers took off from Manzengwenya Aerodrome on a chartered flight to Virginia Aerodrome, (FAVG). The pilot reported that although it was drizzling, visibility was good. He reported his position to the FAVG Air Traffic Controller and requested joining instructions to FAVG. The ATC cleared the pilot to land on Runway 05. When he was on short finals, the tower noticed that the aircraft was drifting away from the runway centerline and called the pilot. The pilot stated that he is experiencing an engine problems and he is initiating a go around. The aircraft turned out to the left and away from the runway centerline, and the pilot allowed the aircraft to continue flying over the nearby “M4” highway and then towards a residential area. The aircraft then impacted the roof of a private residential property, (house) with its left wing first and the nose section. It came to rest in a tail high and inverted position. Although the wreckage was still fairly intact, both the aircraft and the residential property were extensively damaged. The aircraft’s left wing failed outboard of the engine on impact. The nose of the aircraft as well as the cabin instrumentation area was crushed towards the front seated passengers. Both main wing spars, the nose wheel, the engine mounts, the propellers, and the fuselage were also damaged. The aircraft had a valid Certificate of Airworthiness which was issued on 17 September 2004 with an expiry date of 16 September 2005. The last Mandatory Periodic Inspection was certified on 03 September 2004 at 7594.2 airframe hours and he aircraft had accumulated a further 75.8 hours since the last MPI was certified. The aircraft was recovered to an Approved AMO for further investigation. Both flight and engine controls were found satisfactory. Ground run test were conducted with both engines still installed to the aircraft, and both engines performed satisfactorily during these performance tests. The Aircraft Maintenance Organisation was audited in the last two years and the last audit was on 01 July 2005.", "probable_cause": "The pilot employed a incorrect go-around technique and took inappropriate actions during the emergency situation, which aggravated the situation.\r\nContributory Factors: \r\n- Prevalent carburettor icing probability conditions for any power setting.\r\n- Lack of experience of the pilot on the aircraft type."}