{"url": "https://www.baaa-acro.com/crash/crash-boeing-kc-135a-bn-stratotanker-loring-afb-5-killed", "date": "Nov 25, 1958 at 0727 LT", "type": "Boeing KC-135 Stratotanker", "operator": "United%20States%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Loring - Loring", "msn": "17347", "yom": 17, "flight_number": null, "city": "Loring AFB", "zone": "Maine", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off at 0445 on an \"Operation Headstart\" refueling mission. Headstart was the 42nd Bomb Wing's operation that \"proved\" the concept of airborne nuclear alert with B-52 aircraft for SAC. Before take-off, the crew was notified of a no-notice Standardization Board evaluation, so in addition to the crew of 4, there was an Instructor Pilot, Instructor Navigator, and Instructor Boom Operator aboard. Upon returning to the Loring AFB area, the aircraft was cleared to make a GCA approach from the south for a touch and go landing. The aircraft touched down about 2500 feet down the runway, applied power and became airborne at about the 7000 foot mark. Because of the aircraft's weight, air temperature and the forces involved in a touch and go landing, the Pilot got the tanker airborne in a condition where there was a 35 knot gap between adequate lift for take-off and adequate airflow over the ailerons for roll authority. The aircraft rolled to the right, striking the Number 4 engine which failed due to fuel control unit damage and jamming the right aileron in a 5 degree up position. The aircraft entered a nose high, right wing low attitude and cartwheeled into the woods about 1000 feet from the runway. It broke into several major sections and burned. The Instructor Navigator and Instructor Boom Operator were able to egress the burning wreckage but the Instructor Navigator died several weeks later as a result of his burns. \r\nCrew (42th Air Refueling Squadron):\r\nCpt John Eifollla, pilot, †\r\n1st Lt Donald Gladding, copilot, †\r\nMaj John Brown, navigator, †\r\nCpt Bernard Morgan, instructor pilot, †\r\nCpt Herman Dosenbach, instructor navigator, †\r\nT/Sgt Ronald Champion, boom operator,\r\nT/Sgt Charles Holsclaw, instructor boom operator.\r\nSource: http://www.mewreckchasers.com/KC1351958.html", "probable_cause": "The investigation cited issues with the KC-135A Flight Manual that did not address the \"window\" in which the aircraft could become airborne in a touch and go without roll control, the Pilot's inability to take proper action to deal with the loss of Number 4 engine thrust, and the Instructor Pilot not occupying a front seat, with access to controls, during a touch and go landing as required by SAC regulations. \n"}