{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90b-king-air-rocksprings-1-killed", "date": "Dec 14, 2008 at 1500 LT", "type": "Beechcraft 90 King Air", "operator": "Western%20Wings", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Plain, Valley", "schedule": "Hondo – Goodyear", "msn": "LJ-1345", "yom": 1993, "flight_number": null, "city": "Rocksprings", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3500, "captain_hours_type": 250, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3725, "circumstances": "The pilot was cleared to 17,000 feet approximately 7 minutes after takeoff. After arriving at 17,000 feet, radar showed the airplane in a meandering flight path increasingly off course that continued through the end of the flight, even after several prompts from the controller. The pilot was cleared to flight level 240 (24,000 feet) after about 6 minutes at 17,000 feet, and about 2 minutes later, while passing through about 18,000 feet, he made his last radio transmission, acknowledging a corrected heading. About 6 minutes later, the airplane arrived at 24,000 feet and the pilot did not make any intelligible responses to controller inquiries for the remainder of the flight. At 1456, radar showed the airplane in a descent to 21,000 feet before beginning a rapid descent and continuing to impact. The airplane was substantially damaged by the impact forces and the pilot, who was the only occupant, was fatally injured. During the review of the air traffic control recordings, it was determined that none of the voice transmissions from N43KM sounded as if the pilot was speaking through an oxygen mask microphone. At the accident scene both bleed air switches were observed to be in the closed position and the airplane pressurization switch on the console was observed to be in the dump position. No other preimpact anomalies were observed that would have prevented the normal operation of the airplane.", "probable_cause": "The pilot's failure to properly configure the pressurization controls, resulting in his impairment and subsequent incapacitation due to hypoxia."}