{"url": "https://www.baaa-acro.com/crash/crash-short-s23-empire-flying-boat-port-moresby-13-killed", "date": "Apr 22, 1943 at 2000 LT", "type": "Short S.23 Empire Flying Boat", "operator": "Qantas2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Townsville – Port Moresby", "msn": "S.844", "yom": 1937, "flight_number": null, "city": "Port Moresby", "zone": "National Capital District", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 27, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6500, "circumstances": "At 1250LT, the engines were started and the seaplane christened 'Camilla' took off from Townsville. Aboard with twenty seven passengers including 22 from the Royal Australian Air Force and 5 from the USAAF. The weather reports before departing and radio reports en route were favorable. After climbing to 2,000 feet, Camilla flew northward towards New Guinea. At 1600LT, Koch heard reports from other aircraft that Port Moresby was experiencing light rain with a ceiling of 1,000' and visibility of 2,000 yards. Despite the bad weather, he elected to proceed believing it was only localized weather that would pass. As he neared the southern coast of New Guinea clouds were increasing and he took a sun sight bearing twenty minutes off Hood Point before receiving reports that the weather was deteriorating, with a ceiling of 600' and visibility of 1,100 yards. While over Hood Point, Camilla received another weather report that conditions were improving with 1,000' ceiling and 2,000 yards visibility. Flying westward, the weather over Bootless Bay appeared to be clear, but Koch opted not to land there fearing the presence of mines and proceed toward Basilisk Light at the edge of the Basilisk Passage on Natera Reef off Port Moresby but flew into light rain showers and dense overcast. By radio, Camilla was advised to wait to land until a flare path was laid in Fairfax Harbor. While waiting, Camilla circled Basilisk Light twice at 500'. Due to fatigue from circling on instruments, Koch opted to fly to the northwest but found the weather was no better and returned to Basilisk Light, but conditions had further deteriorated and Koch opted to fly to the northwest toward Yule Island in hopes of landing there, but was unable to find the island or see the coastline due to poor weather conditions and climbed to 4,700'. Another radio message stated the flare path was still being laid. Koch ordered the crew to instruct the passengers about the possibility of an emergency landing and for everyone to don their life jackets and prepare to use the life rafts. At 1727LT, Camilla's radio operator asked Port Moresby to turn on their radio direction finding station, but it was not functioning, but a USAAF beacon was on as of 1700LT and a RAAF beacon was turned on at 1730LT. Flying eastward again, Camilla returned toward Port Moresby using the radio direction finding beacons. Radio messages stated the flare path was still being laid and weather conditions were not improving. By 1820LT, the RAAF marine section had laid a flare path on Fairfax Harbor but was having problems keeping them lit due to heavy rain. At 1855LT, Koch requested that search lights be turned on. At 1910LT, three searchlights were on converging at 4,000' and the flare path was reported as laid but visibility was nil. Due to the poor weather, Koch decided to attempt to land at sea south of Port Moresby towards the southeast towards Hood Point but the sea proved to be too rough and the landing was aborted and Camilla returned to Port Moresby using the radio beacon signals. Flying southward at 3,000' the sea was less rough and Camilla turned northward towards Port Moresby but were unable to observe the flare path, but were able to briefly see searchlights at 5 Mile Drome and 7 Mile Drome. Airborne for roughly seven hours, Camilla had only 90 gallons of fuel aboard and Koch prepared to make an emergency landing then taxi into Fairfax Harbor and radioed at 1955LT that he was going to land at sea. Flying south of Port Moresby and descending to 1,500' before landing with quarter flaps descending at 200' per minute at approximately 105 mph with the engines throttled back to a quarter power and the autopilot on. Before landing, purser Barley served cold drinks to the pilots to quench their thirst. During the descent, clouds were observed outside even at 100' altitude before the sea was visible. Before landing at altimeter reading of zero, the autopilot was disengaged and nose elevated to decease the speed further. Realizing they were still above the sea, the throttles were increased but the right engine did not immediately respond and the left engine throttle was closed as Camilla nosed down descending at 400' per minute and altitude of -30' before impacting the surface of the sea.\r\nCrew:\r\nCpt Albert Aubrey Koch, pilot,\r\nF/O Sydney William John Peak, copilot,\r\nP/O Theo J. Phillips, radio operator, †\r\nP/O Walter R. Bartley, purser. †\r\nPassengers:\r\nAC1 Alan R. Stephens, †\r\nSgt Ernest John Grady, †\r\nSgt Ernest Alfred Flanagan, †\r\nAC1 James A. Harris, †\r\nLAC Alfred J. Ellis, †\r\nAC1 Vincent E. Grogan, †\r\nCpl Donald W. Nicholson, †\r\nAC1 Jack S. Sherwin,\r\nPvt John F. Walters, †\r\nPfc Clyde Dobbs Jr., †\r\n1st Lt Norman B. Slote, †\r\nSgt Frederick A. Burness Jr, †\r\nT/Sgt O'Dell  14.\r\nSource: http://www.pacificwrecks.com/aircraft/short/camilla.html", "probable_cause": null}