{"url": "https://www.baaa-acro.com/crash/crash-cessna-425-conquest-i-butler-1-killed", "date": "Jun 10, 2019 at 1020 LT", "type": "Cessna 425 Conquest", "operator": "Santa Fe Investments", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Vero Beach - Olathe", "msn": "425-0187", "yom": 1983, "flight_number": null, "city": "Butler", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3457, "captain_hours_type": 1891, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6092, "circumstances": "During a cross-country flight, the pilot initiated a descent to his intended destination. During the descent, the pilot informed air traffic control (ATC) that he could not retard power on the right engine. Later in the descent, the pilot decided to shut down the right engine. The pilot communicated his desire to land at the nearest airport to ATC, and ATC provided the pilot with the clearance to divert. Radar data showed the airplane in a steady descent toward the airport. When the airplane was at an altitude of about 2,500 ft mean sea level, the pilot contacted ATC and stated that he was trying to get the airplane under control; radar data showed the airplane in a 360° right turn at the time. The pilot contacted ATC again and stated that he was going to land on a highway. No further transmissions were received from the pilot. After the right turn, the airplane continued in a descent through 1,300 ft mean sea level, at which point radar contact was lost. A witness saw the airplane and stated that the airplane was low and slow but appeared to be in stable flight with both propellers spinning. She did not see any smoke coming from the airplane. She saw the airplane flying northeast to southwest when it suddenly descended nose first into the ground. The airplane impacted a gravel road adjacent to a 100-fttall grain silo about 1 mile from the highway and about 3.3 miles from the airport.", "probable_cause": "The pilot’s loss of airplane control during a descent to a diversion airport with only the left engine operating. Contributing to the accident was a malfunction of the right engine throttle, the cause of which could not be determined."}