{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-mcminville", "date": "May 13, 2013 at 1245 LT", "type": "Learjet 35", "operator": "Evergreen-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Grand Junction - McMinville", "msn": "209", "yom": 1978, "flight_number": null, "city": "McMinnville", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17563, "captain_hours_type": 996, "copilot_hours": 2553, "copilot_hours_type": 94, "aircraft_hours": 15047, "circumstances": "The crew of the twinjet reported that the positioning flight after maintenance was uneventful. However, during the landing roll at their home base, the thrust reversers, steering, and braking systems did not respond. As the airplane approached the end of the runway, the pilot activated the emergency braking system; however, the airplane overran the end of the runway, coming to rest in a ditch. None of the three occupants were injured, but the airplane sustained substantial damage to both wings and the fuselage. Two squat switches provided redundancy within the airplane’s electrical system and were configured to prevent inadvertent activation of the thrust reversers and nosewheel steering during flight and to prevent the airplane from landing with the brakes already applied. Because postaccident examination revealed that the squat switch assemblies on the left and right landing gear struts were partially detached from their mounting pads such that both switches were deactivated, all of these systems were inoperative as the airplane landed. The switch assemblies were undamaged, and did not show evidence of being detached for a long period of time. The brakes and steering were working during taxi before departure, but this was most likely because either one or both of the switches were making partial contact at that time. Therefore, it was most likely that the squat switch assemblies were manipulated on purpose during maintenance in an effort to set the airplane’s systems to “air mode.” Examination of the maintenance records did not reveal any recent procedures that required setting the airplane to air mode, and all mechanics involved in the maintenance denied disabling the switches. Mechanics did, however, miss two opportunities to identify the anomaly, both during the return-to-service check and the predelivery aircraft and equipment status check. The anomaly was also missed by the airplane operator’s mechanic and flight crew who performed the preflight inspection. The airplane’s emergency braking system was independent of the squat switches and appeared to operate normally during a postaccident test. Prior to testing, it was noted that the emergency brake gauge indicated a full charge; therefore, although evidence suggests that the emergency brake handle was used, it was not activated with enough force by the pilot. The pilot later conceded this fact and further stated that he should have used the emergency braking system earlier during the landing roll. The airplane was equipped with a cockpit voice recorder (CVR), which captured the entire accident sequence. Analysis revealed that the airplane took just over 60 seconds to reach the runway end following touchdown, and, during that time, two attempts were made by the pilot to activate the thrust reversers. The pilot stated that as the airplane approached the runway end, the copilot made a third attempt to activate the thrust reversers, which increased the engine thrust, and thereby caused the airplane to accelerate. Audio captured on the CVR corroborated this statement.", "probable_cause": "Failure of maintenance personnel to reattach the landing gear squat switches following maintenance, which rendered the airplane's steering, braking, and thrust reverser systems inoperative during landing. Contributing to the accident were the failure of both the maintenance facility mechanics and the airplane operator's mechanic and flight crew to identify the error during postmaintenance checks, a failure of the airplane's pilot to apply the emergency brakes in a timely manner, and the copilot's decision to attempt to engage the thrust reversers as the airplane approached the runway end despite multiple indications that they were inoperative and producing partial forward, rather than reverse, thrust."}