{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-goldsby-1-killed", "date": "Apr 27, 1999 at 0916 LT", "type": "Cessna 402", "operator": "Texas Air Charters", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Dallas - Oklahoma City", "msn": "402C-0423", "yom": 1980, "flight_number": "TXT818", "city": "Goldsby", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1754, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 20457, "circumstances": "The twin-engine airplane impacted the ground in an uncontrolled descent following the inflight separation of the right wing during a normal descent. The airplane had accumulated a total time of 20,457 hours and had been flown 52 hours since the most recent annual inspection, which was performed by the current operator 3 weeks prior to the accident. Available maintenance records indicated that since 1988, maintenance personnel had made numerous repairs to the right wing, including repairing skin cracks, working rivets, wing stub spar straps, and the right main landing gear. Metallurgical examination revealed that the right wing's front spar failed due to fatigue that started at an area of mechanical damage and rough machining marks. The presence of primer covering the mechanical damage strongly suggests that the damage was produced during the manufacturing process. It could not be determined whether the mechanical damage or the machining, acting alone, could have caused the fatigue cracking to initiate. Fatigue cracking found on the rear spar and the forward auxiliary spar is most likely secondary fatigue due to load shedding as the crack grew in the front spar. ", "probable_cause": "The fatigue failure of the right wing spar as a result of inadequate quality control during manufacture of the spar. A factor was the inadequate inspection of the right wing by maintenance personnel, which failed to detect the crack. "}