{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-21-islander-near-keflavik", "date": "Mar 17, 1996 at 1212 LT", "type": "Britten-Norman Islander", "operator": "Wagner Foundation", "flight_phase": "Landing (descent or approach)", "flight_type": "Delivery", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Reykjavik - Narsarsuaq", "msn": "904", "yom": 1981, "flight_number": null, "city": "Keflavik", "zone": "Southern Peninsula (Suðurnes)", "country": "Iceland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot, sole on board, was completing a delivery flight from Europe to the US via Iceland and Greenland. Eight minutes after her departure from Reykjavik Airport, outbound to Narsarsuaq, the pilot informed ATC that her portable GPS fell on the ground and was not able to locate it. It such conditions, she decided to divert to Keflavik Airport when less than five minutes later, while descending, the right engine failed. For unknown reasons, she did not feather the propeller and did not elected to restart the engine. Due to drag and a loss of speed, the aircraft lost altitude and crashed near the village of Njarðvík, about 5 km east of Keflavik Airport. The aircraft was destroyed and the pilot was seriously injured.  ", "probable_cause": "It was determined that the loss of power on the right engine was caused by the pilot who probably inadvertently reduced the mix ratio of the right engine while trying to find the portable GPS. For unknown reasons, she did not feather the propeller which increased drag and reduced speed and lift. A the time of the accident, the total weight of the aircraft was 297 kilos above MTOW, which was considered as a contributing factor. "}