{"url": "https://www.baaa-acro.com/crash/crash-bae-125-700b-dakar-7-killed", "date": "Sep 5, 2015 at 1812 LT", "type": "BAe 125", "operator": "Senegalair", "flight_phase": "Flight", "flight_type": "Ambulance", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Ouagadougou - Dakar", "msn": "257062", "yom": 1979, "flight_number": null, "city": "Atlantic Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 7658, "captain_hours_type": 2158, "copilot_hours": 3339, "copilot_hours_type": null, "aircraft_hours": 13279, "circumstances": "The airplane departed Ouagadougou Airport at the end of the afternoon on an ambulance flight to Dakar-Léopold Sédar Senghor Airport with one patient, one doctor, two nurses and three crew members on board. After entering in contact with Dakar Control, the crew was cleared to FL340, an altitude that was confirmed by the crew at 1801LT. But the airplane continued and climbed to FL350. At 1812LT, the aircraft collided with a Boeing 737-8FB operated by Ceiba Intercontinental. Registered 3C-LLY, the B737 was operating the flight CEL071 Dakar - Cotonou - Malabo with 104 passengers and 8 crew members on board. Immediately after the collision, the BAe 125 entered an uncontrolled descent and crashed in the Atlantic Ocean about 111 km off Dakar. The pilot of the Boeing 737 informed ATC about a possible collision and continued to Malabo without further problem. Nevertheless, the top of the right winglet of the Boeing 737 was missing. SAR operations were suspended after a week and no trace of the BAe 125 nor the 7 occupants was ever found. ", "probable_cause": "The collision was the consequence of an error on part of the crew of the BAe 125 who failed to follow his assigned altitude at FL340 and continued to FL350 which was the assigned altitude for the Boeing 737. The captain of the B737 confirmed that he have seen the aircraft descending to him. Only the flight recorders could have helped to determine how such a situation could have occurred; Unfortunately they disappeared with the plane. There was a difference of 1,000 feet in the indications of both captain/copilot altimeters."}