{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-i-near-la-grande-4", "date": "Jan 21, 2007 at 1212 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Propair2", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": null, "msn": "400", "yom": 1952, "flight_number": null, "city": "La Grande-4", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1200, "captain_hours_type": 400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The ski-equipped aircraft took off around 1130 eastern standard time from Mirage Outfitter, located 60 miles east of La Grande-4 Airport, Quebec, with a pilot and four passengers on board, to locate caribou herds. About 40 minutes after departure, the engine stopped as a result of fuel starvation. The pilot was not able to regain power and made a forced landing on rugged ground. The aircraft was heavily damaged and two passengers were seriously injured. The pilot used a satellite telephone to request assistance. First-aid assistance arrived by helicopter about 1 hour 30 minutes after the occurrence. The aircraft fuel system had been modified after the installation of wings made by Advanced Wing Technologies Corporation. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The engine stopped as a result of fuel starvation; the amount of fuel in the wings was less than the amount estimated by the pilot, the fuel senders gave an incorrect reading, and the low fuel pressure warning light could illuminate randomly.\r\n2. The engine stopped at low altitude, which reduced the time needed to complete the emergency procedure. The pilot was unable to glide to the lake and made a forced landing on an unsuitable terrain, causing significant damage to the aircraft and injuries to the occupants.\r\nFindings as to Risk:\r\n1. The wing tank selection system was subject to icing in cold weather, and the pilots adopted the practice to place the wing tank selector in the middle position, which is contrary to the aircraft flight manual supplement instructions and a placard posted on the instrument panel.\r\n2. When the change to the type design was approved through issuance of the Supplementary Type Certificate (STC), Transport Canada did not notice the fact that the fuel senders and triple fuel level gauge did not meet airworthiness standards; Transport Canada issued an STC that contained several deficiencies. 3. Storage of the shoulder harnesses underneath the aircraft interior covering made them inaccessible; since the pilot and the front seat passenger did not wear their shoulder harness, their protection was reduced. "}