{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227tt-merlin-iiic-bristol-4-killed", "date": "Apr 1, 1993 at 2128 LT", "type": "Swearingen SA226T Merlin III", "operator": "Eastern Foods", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Knoxville - Bristol", "msn": "TT-527", "yom": 1983, "flight_number": null, "city": "Bristol-Tri-Cities", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 19105, "captain_hours_type": 235, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2294, "circumstances": "N500AK encountered icing in flight before start of ILS approach. Radar data showed that before reaching outer marker, it slowed in a manner that was consistent with a power reduction (or partial loss of power), then it entered a steep descent and crashed. Examination revealed engines were not operating at impact and that propellers had been feathered. No preimpact part failure or malfunction of engines, propellers or anti-ice system was found. There was evidence that engine inlet anti-ice annunciator lights and stability augmentation system (SAS) fault warning light were illuminated during impact. The engine manufacturer reported that flameouts had occurred in other aircraft, during or following operation in icing conditions, sometimes after descent into warmer air. Flight manual noted that if icing was encountered with anti-ice system off, select continuous ignition and then select engine and propeller heat (1 engine at a time, ensuring first engine was operating satisfactorily before selecting second engine) and engage sas heat. All four occupants were killed. ", "probable_cause": "Failure of the pilot to follow procedures concerning use of the engine inlet anti-ice system and/or continuous ignition while operating in icing conditions, which resulted in probable ice ingestion and loss of engine power; and the pilot's failure to maintain sufficient airspeed while coping with the engine problem, which resulted in a stall. Factors related to the accident were: darkness, icing conditions, and engine inlet (nacelle) ice."}