{"url": "https://www.baaa-acro.com/crash/crash-cessna-560-citation-encore-upland-1-killed", "date": "Jun 24, 2006 at 2226 LT", "type": "Cessna 560 Citation Encore", "operator": "Aero Charter Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Diego - Upland", "msn": "560-0580", "yom": 2001, "flight_number": null, "city": "Upland", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2951, "captain_hours_type": 268, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2513, "circumstances": "The airplane touched down at night about 1,400 feet down the 3,864-foot runway and overran the runway surface, coming to rest about 851 feet beyond the departure end. The pilot was operating the airplane using a single-pilot waiver that he obtained two months prior to the accident. The airplane was certified by the Federal Aviation Administration with a flight crew of two. The pilot was returning from a personal event with his family, and landing at his home airport when the accident occurred. Witnesses stated that the pilot’s approach into the airport was not consistent with previous approaches in which the airplane would touch down directly on the runway numbers. They also stated that they heard the thrust reversers deploy, and then return to the stowed position. The airplane flight manual states that once the thrust reversers have been deployed, a pilot should not attempt to restow the thrust reversers and take off. Two sink rate warnings were issued during the approach to landing which should have alerted the pilot of the unstabilized approach. Performance calculations showed that the airplane would have required an additional 765 to 2,217 feet of runway for a full stop landing. ", "probable_cause": "The pilot's unstabilized approach to the runway and failure to obtain the proper touchdown point, which resulted in a runway overrun."}