{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-500tp-malibu-meridian-vasteras", "date": "Feb 13, 2015 at 1203 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Volando Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Västerås – Prague", "msn": "46-97064", "yom": 2001, "flight_number": null, "city": "Västerås", "zone": "Västmanland", "country": "Sweden", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 674, "captain_hours_type": 184, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2767, "circumstances": "The aircraft, a Piper PA46-500TP Malibu Meridian, should carry out a private flight from Västeras airport to Prague. On board were a pilot and two passengers. Shortly after take-off an engine failure occurred and the pilot decided to make an emergency landing on Björnö Island, situated slightly to the right in the flight direction. The aircraft hit the ground with the left wing first and then rolled a number of times before it came to a final stop. During the accident both wings and parts of the tail separated from the aircraft. The fuselage remained relatively undamaged during the crash course. All three occupants escaped with minor injuries. A special study of the sequence of events shows that the impact, with the left wing first, caused the airplane's wings to act as shock absorbers, which greatly contributed to that the occupants only received minor injuries. During the accident - which occurred next to a secondary protection zone for water supply to the city of Västerås – a significant amount of fuel leaked out from the wreckage. The accident site was decontaminated after the accident. Examination undertaken in the area after the accident has not showed any trace of residual contamination in the soil.", "probable_cause": "The engine failure was caused by damage to the engine's power turbine section. Most likely, the damage has been initiated in a labyrinth seal to the power turbine. The cause of the initial damage of the seal has not been established. The technical failure can not be assessed to be in a risk category where the risk of repeated failures of the same type is high. The accident was caused by damage to the power turbine which occurred over time, and that could not be identified by the engine's maintenance program."}