{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm700-kennesaw-1-killed", "date": "Jul 15, 2008 at 1457 LT", "type": "Socata TBM-700", "operator": "Flying Max", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Albany - Kennesaw", "msn": "333", "yom": 2005, "flight_number": null, "city": "Kennesaw", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 975, "captain_hours_type": 44, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 398, "circumstances": "During approach to runway 9, the tower controller instructed the pilot to perform an “S” turn 3 miles from the runway. The pilot initiated the “S” turn to the left, and after turning back to the right towards the runway to complete the other half of the turn, the controller advised the pilot that he did not need to finish the maneuver, and could turn onto final approach. The last recorded ground speed was 89 knots when the pilot banked the airplane sharply to the left at this time, witnesses stated that the airplane seemed to do a wing over onto its back and go straight down. Flight simulation tests revealed that while making a steep turn and not adding power, as the bank angle increased the airspeed would decrease and the airplane would enter an aerodynamic stall. Toxicology testing indicated that the pilot had been using tramadol, a prescription painkiller with potentially impairing effects. The pilot had not reported its use on his most recent application for airman medical certificate approximately 20 months prior to the accident. It is unclear what role, if any, the medication or the condition for which it might have been used played in the accident. ", "probable_cause": "The pilot’s failure to maintain airspeed during final approach resulting in an aerodynamic stall."}