{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2tp-near-sangar", "date": "Nov 18, 2005 at 1407 LT", "type": "PZL-Mielec AN-2", "operator": "Polyarnye%20Avialinii", "flight_phase": "Flight", "flight_type": "Ambulance", "survivors": "Yes", "site": "Mountains", "schedule": "Sangar – Segyan-Kyuel – Sangar", "msn": "1G234-06", "yom": 1989, "flight_number": null, "city": "Sangar", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was engaged in an ambulance flight from Sangar to Segyan-Kyuel and back. Because of poor weather the flight was delayed a couple of hours. At ETD, weather conditions at Sangar Airport was as follows: visibility more than 10 km, scattered clouds at 800 metres, overcast at 3,000 metres, temperature -22° C, dewpoint -23° C, pressure 765 mm Hg. Weather forecast en route included a few stratocumulus clouds between 1,400 and 1,700 metres, significant altostratus clouds between 2,700 and 3,500 metres. The mountainous area over which the Antonov was to fly moderate orographic turbulence was present in the layer from 900 to 1,700 meters, and possible downdrafts on the lee side of ridge in the same altitude range. These conditions were not reported to the crew. Then medical equipment with a weight of 400 kg and passengers arrived at the airport by ambulances. The captain expected seven passengers, but three additional passengers had arrived, without having tickets. The names were added to the passenger list and the copilot arranged the payment of the fare. No seats were available for two passengers, so they had to sit on some hand luggage in the aisle. At 04:46 UTC the aircraft departed from Sangar and climbed towards the mountainous terrain. The highest point along the route was at an elevation of 1,976 metres. The minimum safe altitude was 2,515 metres. The pilot climbed VFR and maintained visual separation from the snow-covered mountains. At an altitude of 1,300 metres the Antonov entered an area with strong turbulence. The aircraft was caught in a downdraft. In an attempt to stop the plane from descending further, power was added to nominal, then to the takeoff power. With rising terrain it was impossible to continue. The pilot decided to carry out a 180° turn to the left over downsloping terrain. This brought the plane downwind with a 30° bank instead of the recommended 20°. As a result, the rate of descent increased and after it rolled to an angle of 120°, the left lower wing contacted a cliff. The aircraft lost speed and crashed on the snow covered mountain. All 12 occupants were rescued, among them four were seriously injured. The aircraft was destroyed. ", "probable_cause": "The following findings were identified:\r\n- The crew carried out a flight at a height lower than the minimum safe altitude,\r\n- Incorrect estimation by the crew of the prevailing situation, which led to a late decision to return to the airport of departure under the conditions of orographic turbulence and airspace limited by mountains,\r\n- Deficiencies in the flight instructions at the airport Of Sangar, due to the absence a.o. of an altitude diagram of the route of flight, which would have shown that it was impossible for the airplane, according to its technical flight characteristics, to gain enough height within 10 km after takeoff,\r\n- The incorrect weather forecast along the flight course, in which the orographic turbulence was not provided,\r\n- The erroneous actions of the crew in the process of the downwind turn with a bank angle of 30° while carrying out the delayed decision to return to the airport of departure, leading to an increase in the vertical rate of descent."}