{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-near-cleveland-6-killed", "date": "Dec 21, 1995 at 1442 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Insured Titles of Tuscaloosa", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Tulsa - Aspen", "msn": "421C-1236", "yom": 1982, "flight_number": null, "city": "Cleveland", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 1320, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 1350 cst, a McAlester FSS specialist gave a preflight briefing to a Cessna 421 pilot concerning IMC (instrument meteorological conditions) along the route & advised that VFR flight was not recommended. Cloud tops were at 12,000', & freezing level was at 1,600'. A PIREP at 1416 cst reported light mixed icing from 6,400' to 9,000' at Oklahoma City. At 1424 cst, the pilot departed Tulsa (VFR), then radar service was terminated. No further communication was received from the airplane. Radar data showed that it climbed westerly, reaching 9,800' at 1440 cst; during the next 88 seconds, its heading & altitude deviated until it descended through 3,200'. Ground witnesses saw the airplane descend out of low clouds in a 'flat spin' & crash. No preimpact mechanical failure was found. The airplane's gross weight was about 150 lbs over its maximum limit. In November 1995, the pilot received 10 hrs of Cessna 421 simulator training; his instructor noted in training records that he met minimum standards for VFR, but 'under IMC conditions,' he 'could not maintain altitude within 1,300 feet or heading within 40 degrees.' Postmortem toxicology tests showed 0.079 mcg/ml Nordiazepam (metabolite of Valium) in kidney fluid, 0.044 mcg/ml Desipramine (metabolite of Imipramine, an antidepressant) in spleen fluid, 0.733 mcg/ml Diphenhydramine (Benadryl) in spleen fluid, & 0.353 mcg/ml Diphenhydramine in lung fluid. These medications are not approved by the FAA for use while flying. The airplane was equipped for flight in icing & IFR\r\nconditions.", "probable_cause": "The pilot's continued VFR flight into instrument meteorological conditions (IMC), and his failure to maintain control of the airplane after encountering adverse weather conditions, which resulted in a stall/spin. Factors relating to the accident were: pilot impairment due to a medication that was not approved by the FAA for use while flying, the adverse weather conditions, and the pilot's lack of instrument proficiency in the Cessna 421 airplane. "}