{"url": "https://www.baaa-acro.com/crash/crash-fairchild-c-123k-provider-near-oudom-4-killed", "date": "Dec 27, 1971", "type": "Fairchild C-123 Provider", "operator": "Air%20America.gif", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Udon Thani – Ban Xieng Lom", "msn": "20303", "yom": 1957, "flight_number": null, "city": "Oudom", "zone": "Oudômxai Province", "country": "Laos", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The C-123K transport plane departed Udon Thani RTAFB (UTH), Thailand on a so called Peppergrinder flight, which consisted of loading and dispatching mixed ordnance for use in Laos. Destination was Ban Xieng Lom Airstrip (LS-69). The airplane was loaded with 12,892 pounds of mixed ordnance, including 75 mm shells, 81 mm rounds, 222 caliber small arms ammunition and white phosphorus smoke rounds. Based on the computed crosswinds at 8,500 feet, 293's reported altitude, it was likely that 293 was to the right of his desired track enroute out of Udon Than and at a higher than normal ground speed. The pilot though supposedly well familiar with the route, was likely flying an inadequate cross-wind correction heading in and out of cloud bases. This could have placed him to the right of L-23 and, later, well to the right and beyond LS-62 since no navigational aids were available. A valley, similar to that of LS-62, is present just to the northeast of LS-62 and close to Route 46. Had the captain been to the northeast of his reported position at LS-62 and initiated a descending left turn towards LS-69, the enemy reaction over Route 46 would be immediate and violent. Large anti-aircraft guns were only 15 miles north of LS-62.\r\nSource: ASN", "probable_cause": "Although the cause of the disappearance of 293 must be listed as undetermined, the aircraft probably strayed from course and, over exceedingly hostile country, was hit by enemy fire and rapidly destroyed."}