{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-11f-tokyo-2-killed", "date": "Mar 23, 2009 at 0649 LT", "type": "McDonnell Douglas MD-11", "operator": "FedEx", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Guangzhou - Tokyo", "msn": "48600/560", "yom": 1993, "flight_number": "FDX080", "city": "Tokyo-Narita", "zone": "Kantō", "country": "Japan", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8132, "captain_hours_type": 3648, "copilot_hours": 5248, "copilot_hours_type": 879, "aircraft_hours": 40767, "circumstances": "Aircraft bounced repeatedly during landing on Runway 34L at Narita International Airport. During the course of bouncing, its left wing was broken and separated from the fuselage attaching point  and the airplane caught fire. The airplane rolled over to the left being engulfed in flames, swerved off the runway to the left and came to rest inverted in a grass area. The Pilot in Command (PIC) and the First Officer (FO) were on board the airplane, and both of them suffered fatal injuries. The airplane was destroyed and the post-crash fire consumed most parts. \n", "probable_cause": "In this accident, when the airplane landed on Runway 34L at Narita International Airport, it fell into porpoising. It is highly probable that the left wing fractured as the load transferred from the left MLG to the left wing structure on the third touchdown surpassed the design limit (ultimate load). It is highly probable that a fire broke out as the fuel spillage from the left wing caught fire, and the airplane swerved left off the runway rolling to the left and came to rest inverted on the grass area. The direct causes which the airplane fell into the porpoise phenomenon are as follows: \r\na. Large nose-down elevator input at the first touchdown resulted in a rapid nose down motion during the first bounce, followed by the second touchdown on the NLG with negative pitch attitude. Then the pitch angle rapidly increased by the ground reaction force, causing the larger second bounce, and \r\nb. The PF‘s large elevator input in an attempt to control the airplane without thrust during the second bounce. In addition, the indirect causes are as follows: \r\na. Fluctuating airspeed, pitch attitude due to gusty wind resulted in an approach with a large sink rate, \r\nb. Late flare with large nose-up elevator input resulted in the first bounce and \r\nc. Large pitch attitude change during the bounce possibly made it difficult for the crewmembers to judge airplane pitch attitude and airplane height relative to the ground (MLG height above the runway). \r\nd. The PM‘s advice, override and takeover were not conducted adequately. It is somewhat likely that, if the fuse pin in the MLG support structure had failed and the MLG had been separated in the overload condition in which the vertical load is the primary component, the damage to the fuel tanks would have been reduced to prevent the fire from developing rapidly. It is probable that the fuse pin did not fail because the failure mode was not assumed under an overload condition in which the vertical load is the primary component due to the interpretation of the requirement at the time of type certification for the MD-11 series airplanes. "}