{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-749-79-34-constellation-mt-naiguata-25-killed", "date": "Nov 27, 1956 at 0815 LT", "type": "Lockheed L-749 Constellation", "operator": "Aeropostal-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "New York – Caracas", "msn": "2560", "yom": 1947, "flight_number": "LV253", "city": "Mt Naiguatá", "zone": "Miranda", "country": "Venezuela", "region": "South America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 18, "pax_fatalities": 18, "other_fatalities": 0, "total_fatalities": 25, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "YV-C-AMA, on scheduled flight 253, took off from Idlewild Airport, NY, for Maiquetía, Venezuela, on 26 November with 7 crew and 18 passengers aboard. The flight plan gave an altitude of 17 000 ft, and the duration of the flight was estimated at 9 hours 48 minutes, with Barcelona and Curaçao as alternate airports. The pilot transmitted two position reports, the first, 75 miles northwest of Maiquetía, at 17 500 ft at 0751 hours, and the second, 14 minutes later, 35 miles northwest of Maiquetía at 7 000 ft. No further communication was received from YV-C-AMA after it had been cleared to change to tower frequency. Following the failure to report to the control tower, the aircraft was repeatedly called on all Maiquetía Control Centre frequencies at 0815 hours, with negative results. A state of emergency was declared at 0835 hours, and it was later established that the aircraft struck the western slope of peak El Avila located in the El Avila National Park at an altitude of 6 702 ft, killing all 25 occupants. ", "probable_cause": "The instrument flight training manuals show that the Linea Aeropostal Venezolana has approved a procedure for entering Maiquetía in semi-IFR conditions. This procedure consists in maintaining a minimum flight level of 10 000 ft as far as the station (Miq 292.5), then turning north over this point and continuing on a 360° heading for 4 minutes followed by a standard let-down to 1 200 ft above sea level until contact is established, and a return to the aerodrome under VFR. It is obvious that the pilot -in-command did not fully comply with this procedure, and, after accumulating errors in estimating his speed, endeavored to make a direct approach which proved fatal because his altitude at the time of his last report was insufficient to cross the Avila mountain range against which the impact occurred. "}