{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-akureyri-2-killed", "date": "Aug 5, 2013 at 1329 LT", "type": "Beechcraft 200 Super King Air", "operator": "Myflug-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Reykjavik - Akureyri", "msn": "BB-1136", "yom": 1983, "flight_number": null, "city": "Akureyri", "zone": "Northeastern Region (Norðurland eystra)", "country": "Iceland", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2600, "captain_hours_type": 1700, "copilot_hours": 2200, "copilot_hours_type": 1100, "aircraft_hours": 15247, "circumstances": "On 4th of August 2013 the air ambulance operator Mýflug, received a request for an ambulance flight from Höfn (BIHN) to Reykjavík Airport (BIRK). This was a F4 priority request and the operator, in co-operation with the emergency services, planned the flight the next morning. The plan was for the flight crew and the paramedic to meet at the airport at 09:30 AM on the 5th of August. A flight plan was filed from Akureyri (BIAR) to BIHN (positioning flight), then from BIHN to BIRK (ambulance flight) and from BIRK back to BIAR (positioning flight). The planned departure from BIAR was at 10:20. The flight crew consisted of a commander and a co-pilot. In addition to the flight crew was a paramedic, who was listed as a passenger. Around 09:50 on the 5th of August, the flight crew and the paramedic met at the operator’s home base at BIAR. The flight crew prepared the flight and performed a standard pre-flight inspection. There were no findings to the aircraft during the pre-flight inspection. The pre-flight inspection was finished at approximately 10:10. The departure from BIAR was at 10:21 and the flight to BIHN was uneventful. The aircraft landed at BIHN at 11:01. The commander was the pilot flying from BIAR to BIHN. The operator’s common procedure is that the commander and the co-pilot switch every other flight, as the pilot flying. The co-pilot was the pilot flying from BIHN to BIRK and the commander was the pilot flying from BIRK to BIAR, i.e. during the accident flight. The aircraft departed BIHN at 11:18, for the ambulance flight and landed at BIRK at 12:12. At BIRK the aircraft was refueled and departed at 12:44. According to flight radar, the flight from BIRK to BIAR was flown at FL 170. Figure 4 shows the radar  track of the aircraft as recorded by Reykjavík Control. There is no radar coverage by Reykjavík Control below 5000 feet, in the area around BIAR. During cruise, the flight crew discussed the commander’s wish to deviate from the planned route to BIAR, in order to fly over a racetrack area near the airport. At the racetrack, a race was about to start at that time. The commander had planned to visit the racetrack area after landing. The aircraft approached BIAR from the south and at 10.5 DME the flight crew cancelled IFR. When passing KN locator (KRISTNES), see Figure 6, the flight crew made a request to BIAR tower to overfly the town of Akureyri, before landing. The request was approved by the tower and the flight crew was informed that a Fokker 50 was ready for departure on RWY 01. The flight crew of TF-MYX responded and informed that they would keep west of the airfield. After passing KN, the altitude was approximately 800’ (MSL), according to the co-pilot’s statement. The co-pilot mentioned to the commander that they were a bit low and recommended a higher altitude. The altitude was then momentarily increased to 1000’. When approaching the racetrack area, the aircraft entered a steep left turn. During the turn, the altitude dropped until the aircraft hit the racetrack.", "probable_cause": "The commander was familiar with the racetrack where a race event was going on and he wanted to perform a flyby over the area. The flyby was made at a low altitude. When approaching the racetrack area, the aircraft’s calculated track indicated that the commander’s intention of the flyby was to line up with the racetrack. In order to do that, the commander turned the aircraft to such a bank angle that it was not possible for the aircraft to maintain altitude. The ITSB believes that during the turn, the commander most probably pulled back on the controls instead of levelling the wings. This caused the aircraft to enter a spiral down and increased the loss of altitude. The investigation revealed that the manoeuvre was insufficiently planned and outside the scope of the operator manuals and handbooks. The low-pass was made at such a low altitude and steep bank that a correction was not possible in due time and the aircraft collided with the racetrack. The ITSB believes that human factor played a major role in this accident. Inadequate collaboration and planning of the flyover amongst the flight crew indicates a failure of CRM. This made the flight crew less able to make timely corrections. The commander’s focus was most likely on lining up with the racetrack, resulting in misjudging the approach for the low pass and performing an overly steep turn. The overly steep turn caused the aircraft to lose altitude and collide with the ground. The co-pilot was unable to effectively monitor the flyover/low-pass and react because of failure in CRM i.e. insufficient planning and communication. A contributing factor is considered to be that the flight path of the aircraft was made further west of the airfield, due to traffic, resulting in a steeper turn. The investigation revealed that flight crews were known to deviate occasionally from flight plans. \r\nCausal factors:\r\n- A breakdown in CRM occurred.\r\n- A steep bank angle was needed to line up with the racetrack.\r\n- The discussed flyby was executed as a low pass.\r\n- The maximum calculated bank angle during last phase of flight was 72.9°, which is outside the aircraft manoeuvring limit.\r\n- ITSB believes that the commander’s focus on a flyby that he had not planned thoroughly resulted in a low-pass with a steep bank, causing the aircraft to lose altitude and collide with the ground.\r\nContributory factors:\r\n- The commander’s attention to the activity at the race club area, and his association with the club was most probably a source of distraction for him and most likely motivated him to execute an unsafe maneuver.\r\n- Deviations from normal procedures were seen to be acceptable by some flight crews.\r\n- A flyby was discussed between the pilots but not planned in details.\r\n- The flight crew reacted to the departing traffic from BIAR by bringing their flight path further west of the airport.\r\n- The approach to the low pass was misjudged.\r\n- The steep turn was most probably made due to the commander’s intention to line up with the race track. "}