{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-76td-irkutsk", "date": "Jul 26, 1999 at 1346 LT", "type": "Ilyushin II-76", "operator": "Elf Air", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tianjin – Irkutsk – Perm – Moscow", "msn": "10134 09274", "yom": 1991, "flight_number": null, "city": "Irkutsk-Intl", "zone": "Irkutsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2882, "circumstances": "The aircraft departed Tianjin on a cargo flight to Moscow with intermediate stops in Irkutsk and Perm, carrying a load of 49,750 kilos of various goods and seven crew members. At Irkutsk-Intl Airport, 38 tons of fuel were uplifted and the crew calculated 30,040 kilos for the cargo, giving a total weight of 170 tons, about 4 tons below the MTOW. During the takeoff roll, after a course of 2,000 metres, at a speed of 225 km/h, the captain started the rotation. The aircraft lifted up and flew for about 4 seconds when the captain requested gear up. At a speed of 250 km/h, the aircraft passed the runway end and adopted a 16° angle of attack. Then the aircraft' speed decreased when the flight engineer reduced the power on all four engines and activated the thrust reverser systems on both left engines n°1 and 2. The aircraft rolled to the left, collided with a building containing an electrical transformer and came to rest 1,476 metres past the runway end, bursting into flames. All seven occupants were injured, two seriously. The aircraft was destroyed. ", "probable_cause": "It was determined that the total weight of the aircraft at the time of the accident was 198-200 tons which means 24-26 tons above MTOW. The cargo manifest showed a total weight of 49,750 kilos of various goods upon departure from Tianjin Airport but only 30,040 kilos upon departure from Irkutsk Airport while no cargo was unloaded. The following contributing factors were identified: \r\n- A miscalculation of the mass and balance,\r\n- Poor flight planning, \r\n- Poor crew coordination."}