{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-25-marquise-owasso-1-killed", "date": "Nov 10, 2013 at 1546 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Anasazi Winds", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Salina - Tulsa", "msn": "306", "yom": 1974, "flight_number": null, "city": "Owasso", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2874, "captain_hours_type": 12, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6581, "circumstances": "Radar and air traffic control communications indicated that the Mitsubishi MU-2B-25 was operating normally and flew a nominal flightpath from takeoff through the beginning of the approach until the airplane overshot the extended centerline of the landing runway, tracking to the east and left of course by about 0.2 nautical mile then briefly tracking back toward the centerline. The airplane then entered a 360-degree turn to the left, east of the centerline and at an altitude far below what would be expected for a nominal flightpath and intentional maneuvering flight given the airplane's distance from the airport, which was about 5 miles. As the airplane was in its sustained left turn tracking away from the airport, the controller queried the pilot, who stated that he had a \"control problem\" and subsequently stated he had a \"left engine shutdown.\" This was the last communication received from the pilot. Witnesses saw the airplane spiral toward the ground and disappear from view. Examination of the wreckage revealed that the landing gear was in the extended position, the flaps were extended 20 degrees, and the left engine propeller blades were in the feathered position. Examination of the left engine showed the fuel shutoff valve was in the closed position, consistent with the engine being in an inoperative condition. As examined, the airplane was not configured in accordance with the airplane flight manual engine shutdown and single-engine landing procedures, which state that the airplane should remain in a clean configuration with flaps set to 5 degrees at the beginning of the final approach descent and the landing gear retracted until landing is assured. Thermal damage to the cockpit instrumentation precluded determining the preimpact position of fuel control and engine switches. The investigation found that the airplane was properly certified, equipped, and maintained in accordance with federal regulations and that the recovered airplane components showed no evidence of any preimpact structural, engine, or system failures. The investigation also determined that the pilot was properly certificated and qualified in accordance with applicable federal regulations, including Special Federal Aviation Regulation (SFAR) No. 108, which is required for MU-2B pilots and adequate for the operation of MU-2B series airplanes. The pilot had recently completed the SFAR No. 108 training in Kansas and was returning to Tulsa. At the time of the accident, he had about 12 hours total time in the airplane make and model, and the flight was the first time he operated the airplane as a solo pilot. The investigation found no evidence indicating any preexisting medical or behavioral conditions that might have adversely affected the pilot's performance on the day of the accident. Based on aircraft performance calculations, the airplane should have been flyable in a one engine-inoperative condition; the day visual meteorological conditions at the time of the accident do not support a loss of control due to spatial disorientation. Therefore, the available evidence indicates that the pilot did not appropriately manage a one-engine-inoperative condition, leading to a loss of control from which he did not recover. The airplane was not equipped, and was not required to be equipped, with any type of crash resistant recorder. Although radar data and air traffic control voice communications were available during the investigation to determine the airplane's altitude and flight path and estimate its motions (pitch, bank, yaw attitudes), the exact movements and trim state of the airplane are unknown, and other details of the airplane's performance (such as power settings) can only be estimated. In addition, because the airplane was not equipped with any type of recording device, the pilot's control and system inputs and other actions are unknown. The lack of available data significantly increased the difficulty of determining the specific causes that led to this accident, and it was not possible to determine the reasons for the left engine shutdown or evaluate the pilot's recognition of and response to an engine problem. Recorded video images from the accident flight would possibly have shown where the pilot's attention was directed during the reported problems, his interaction with the airplane controls and systems, and the status of many cockpit switches and instruments. Recorded flight data would have provided information about the engines' operating parameters and the airplane's motions. Previous NTSB recommendations have addressed the need for recording  information on airplane types such as the one involved in this accident. Recorders can help investigators identify safety issues that might otherwise be undetectable, which is critical to the prevention of future accidents.", "probable_cause": "The pilot's loss of airplane control during a known one-engine-inoperative condition. The reasons for the loss of control and engine shutdown could not be determined because the airplane was not equipped with a crash-resistant recorder and postaccident examination and testing did not reveal evidence of any malfunction that would have precluded normal operation."}