{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-tacoma-1-killed", "date": "Jan 25, 2006 at 1344 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Sugar Financial Inc.", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Scottsdale - Tacoma", "msn": "421C-0440", "yom": 1977, "flight_number": null, "city": "Carson", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 400, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5363, "circumstances": "During a cross country flight, the pilot was informed by air traffic control that adverse weather was along his route of flight for terrain obscurement in clouds, precipitation, fog or mist. Turbulence was reported below 12,000 feet and occasional moderate rime or mixed icing was reported from the freezing level to 14,000 feet. Further along the route, the pilot reported to another controller that he was at 13,000 feet and descending. The controller inquired if the pilot was aware of the center weather advisory and the reports of severe rime ice in the direction that he was heading. The pilot acknowledged the controller by reporting that he was aware of the weather and that the aircraft was \"equipped.\" The controller continued to inform the pilot of pilot reports from commercial aircraft flight crews of the reports of icing conditions, however, the pilot continued on his routing and again reported that the aircraft was \"equipped.\" During the last transmissions from the pilot, he reported that he was \"turning on (de-ice) equipment now.\" The controller recommended to the pilot to stay clear of the clouds. The pilot responded, \"roger.\" The controller then asked the pilot if he was \"going to orbit there for awhile.\" The pilot responded, \"yes,\" followed by a partially unintelligible transmission of \"getting some weather here.\" The pilot's last transmissions were \"Ah, I'm in a little trouble,\" followed by \"Ah, standby 9KM.\" Radar tracking indicated that the aircraft had been cruising at 16,500 feet before starting a gradual descent. The aircraft descended to 12,700 feet and it began a turn to the right. During this turn, the aircraft's altitude changed rapidly beginning with an increase, followed by a rapid loss of altitude from 8,000 feet per minute descent to 10,600 feet per minute descent before radar contact was lost. The aircraft was found 6 months later in an area of mountainous terrain. On site evidence indicated that the aircraft collided with trees and terrain in a nose low attitude with the majority of the wreckage contained in a large deep crater.", "probable_cause": "The pilot's failure to maintain aircraft control while maneuvering. Icing conditions, clouds and the pilot's continued flight into known adverse weather were factors."}