{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-25-dk-manila-1-killed", "date": "Oct 20, 1965 at 1033 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Philippine%20Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Manila – Legaspi – Calbayog – Tacloban", "msn": "13403", "yom": 1944, "flight_number": "PR741", "city": "Manila", "zone": "Metro Manila", "country": "Philippines", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 34, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5146, "captain_hours_type": null, "copilot_hours": 2843, "copilot_hours_type": 420, "aircraft_hours": 28139, "circumstances": "Flight 741 was a scheduled domestic flight from Manila to Tacloban with stopovers at Legaspi and Calbayog. The aircraft took off from runway 13 at Manila at 1032 hours Philippines local time with the co-pilot flying the aircraft from the right hand seat. When airborne he ordered the pilot-in-command to raise the landing gear. After having done so the pilot-in-command noticed that the aircraft was veering slightly to the left although the indications of the engine instruments were normal. The co-pilot stated that the right rudder seemed to be jammed. The pilot-in-command then took over the controls. At this time the aircraft was continuously and gradually turning and banking to the left. The pilot-in-command then ordered the co-pilot to check the engine instruments again, and their indications were found to be normal. Both engines were at MET0 power setting and the airspeed was 110 mph. When the aircraft reached 150 ft above the ground, at a heading of 050° and an airspeed of 85 to 90 mph, the left bank and turn were momentarily checked and the right rudder pedal was then forward. The co-pilot attempted to call the control tower, but the transmission was garbled. The aircraft then went back to its left bank attitude in spite of the effort of the pilot-in-command to control the turn. When he noticed that the airspeed had dropped to between 85 to 90 mph he pushed the control yoke to gain airspeed but there was no reaction. At this time the pilot-in- command felt that the left wing had hit something. He tried in vain to control and keep the aircraft in the air. The plane crashed on barracks. A passenger was killed while 10 other people were injured, among them five people on the ground. All other occupants were unhurt. ", "probable_cause": "The Board determined that the probable cause of this accident was the failure of the pilot to set the rudder trim tab to the proper position before take-off and during the flight. The continuous left turn and bank of the aircraft which resulted in this accident was due to the undetected deflection of the rudder trim tab. The Board further determined that the overload of 68 lb over and above the allowable take-off gross weight of 26 900 lb at Manila was a contributory factor to this accident."}