{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-602p-kokomo-1-killed", "date": "Oct 5, 2019 at 1637 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "Indiana%20Paging%20Network", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Kokomo - Kokomo", "msn": "60-0869-8165008", "yom": 1981, "flight_number": null, "city": "Kokomo", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3002, "circumstances": "The airline transport pilot arrived at the departure airport in the reciprocating engine-powered airplane where it was fueled with Jet A jet fuel by an airport employee/line service technician. A witness stated that she saw a \"low flying\" airplane flying from north to south. The airplane made a \"sharp left turn\" to the east. The left wing \"dipped low\" and she then lost sight of the airplane, but when she approached the intersection near the accident site, she saw the airplane on the ground. The airplane impacted a field that had dry, level, and hard features conducive for an off-airport landing, and the airplane was destroyed. The wreckage path length and impact damage to the airplane were consistent with an accelerated stall. Postaccident examination of the airplane found Jet A jet fuel in the airplane fuel system and evidence of detonation in both engines from the use of Jet A and not the required 100 low lead fuel. Use of Jet A rather than 100 low lead fuel in an engine would result in detonation in the cylinders and lead to damage and a catastrophic engine failure. According to the Airplane Flying Handbook, the pilot should witness refueling to ensure that the correct fuel and quantity is dispensed into the airplane and that any caps and cowls are properly secured after refueling.", "probable_cause": "The pilot's exceedance of the airplane’s critical angle of attack following a dual engine power loss caused by the line service technician fueling the airplane with the wrong fuel, which  resulted in an aerodynamic stall and subsequent loss of control. Contributing was the pilot's inadequate supervision of the fuel servicing."}