{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-i-billings-1-killed", "date": "Apr 20, 2020 at 0950 LT", "type": "Piper PA-31 Cheyenne", "operator": "FMR Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Billings - Billings", "msn": "31-8004046", "yom": 1980, "flight_number": null, "city": "Billings-Logan", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 12955, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4696, "circumstances": "Air traffic control communications revealed that the pilot requested to take off from the departure runway so that he could perform traffic pattern work and return for a landing on the left adjacent runway. Shortly after takeoff and while departing to the west, the pilot was instructed twice to enter the left traffic pattern, with no response. Radar data showed the airplane departing the runway and remaining on runway centerline heading for the length of the flight. The airplane climbed to about 100 ft above ground level and the airplane’s groundspeed increased to 81 knots soon after departure then decreased to 70 knots before dropping off radar. Witnesses reported seeing the airplane depart the airport at a low climb rate and slow airspeed. Shortly after, the airplane flew out of view and a column of smoke was seen on the horizon. Accident site documentation identified symmetrical propeller strikes on the ground consistent with the airplane impacting the ground in a shallow, nose-up, wings level attitude. Examination of the airframe and both engines did not reveal any evidence of a preaccident mechanical failure or malfunction that would have precluded normal performance to allow for sufficient airspeed and climb rate after takeoff. Both the engines exhibited damage signatures consistent with the engines producing symmetrical power at impact. The pilot’s most recent flight in the accident airplane was 2 months before the accident. The pilot was reported to have problems with understanding the accident airplane’s avionics system; however, it is unknown if he was having these problems during the accident flight. Review of the pilot’s medical history revealed no significant medical concerns or conditions that could pose a hazard to flight. ", "probable_cause": "The degraded airplane performance after takeoff for reasons that could not be determined from available evidence. "}