{"url": "https://www.baaa-acro.com/crash/crash-cessna-340-halfpenny-green", "date": "May 30, 1996 at 1603 LT", "type": "Cessna 340", "operator": "G Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Halfpenny Green - Halfpenny Green", "msn": "340-0045", "yom": 1972, "flight_number": null, "city": "Halfpenny Green", "zone": "Staffordshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 605, "captain_hours_type": 289, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot carried out extensive pre-flight checks of G-KINK which had been little used during the preceding six months. During these checks he established visually that the left main (tip) fuel tank was 30% full and the right main fuel tank was 40% full(the tanks can each hold 51 US gallons which equates to approximately 306 lb per side). Both wing (auxiliary) tanks were full but the locker tanks were empty. At 1539 hrs the aircraft departed Halfpenny Green in CAVOK weather conditions for a brief local flight to the west of the airfield. After climbing to an altitude of 2,500 feet and establishing cruise power conditions, the pilot changed the fuel valve selectors from main to auxiliary tanks on both engines. A few minutes later,he set course for a return to Halfpenny Green and changed the fuel selectors back to main tanks on both engines. At this stage the left tank indicated 50 lb remaining and the right tank indicated 70 lb remaining but the pilot had established during his pre-flight checks that these tank gauges were over-reading. About 13 nm from the airport the pilot lowered one stage of flapand obtained 'clearance' from Halfpenny Green Information foran overhead join for landing on Runway 16 from a left-hand circuit. The aircraft overflew the airport and after reducing engine power to 20 inches manifold pressure and 2,200 RPM, the pilot manoeuvred to the west of Runway 16 where he descended on the 'dead side' in preparation for the downwind leg. In his report to the AAIB, the pilot stated that on throttling back, both engines faltered whereupon he checked that all thethrottle, pitch and mixture levers were fully forward, the fuel pumps were switched on and that main tanks were selected on both engines. He then declared an emergency on the AFIS frequency and requested an immediate left orbit with the intention of landing on Runway 16. Initially power was restored on both engines and the pilot lowered the landing gear in preparation for a shortfield landing on Runway 16. However, at approximately 300 ft agl, whilst still travelling downwind, the left engine stopped. There was no time to feather the propeller but the pilot applied right rudder and, with the aircraft descending rapidly, he decided to force-land straight  ahead into a field of standing crop to the north west of the airfield. Unfortunately, whilst manoeuvring to avoid farm buildings, the aircraft's left wing tip struck electricity power lines. During the subsequent crash landing the aircraft slid about 50 yards and latterly it 'cartwheeled' in the standing crop and came to rest upside down. There was no fire and all three occupants remained suspended by their seat harnesses. The pilot noticed a strong smell of fuel which was dripping from the region of the fuel valve selectors. He switched off the battery master and engine magneto switches; he also attempted to select both fuel valves to the OFF position but initially he was unsuccessful. After some difficulty, probably due to the weight of the now inverted boarding steps, the pilot succeeded in opening the main cabin door and together with his passengers, he vacated the aircraft and moved to a safe distance to await the arrival of the emergency services. However, before long, when he was convinced there was no longer any danger of fire, he returned to the aircraft to recover documents and valuables. At the same time he confirmed that the electrical switches were off and he succeeded in turning the left engine fuel valve selector to OFF. However, the right fuel valve selector could not be moved to the OFF position. ", "probable_cause": "Post accident checks of the wreckage revealed that both propellers were bent rearwards in a manner consistent with low power or windmilling. All the fuel tanks were disrupted and it was not possible to reconstruct the disposition of fuel in the various tanks. Nevertheless,there was fuel between the flow divider and the fuel injectors of the right engine but no fuel in the corresponding locations on the left engine indicating that it had stopped due to fuel starvation. The aircraft maintenance organisation which recovered the wreckage stated that the fuel valves on the Cessna 340 must be operated with great care. The selectors have indicating bands which maybe wider than the selectable range and the valves must be carefully placed in the correct detent by feel as well as by sight. Moreover,during an investigation into a similar accident to Cessna 340A,GXGBE reported in AAIB Bulletin 11/93, it was noted that both valve selectors are positioned athwartships whichever of the two main tanks is selected. Therefore, it is possible inadvertently to run both engines off the same main fuel tank resulting in near simultaneous engine failure when the fuel in the tank is exhausted. The senior fireman who attended the accident scene also attempted to move the right engine fuel valve selector to the OFF position without success. He reported that the selector was stuck and would not move in either direction. He remembered, although he could not be absolutely certain, that the selector was pointing to the \"9 o'clock\" position when viewed from the normal aspect which corresponds to selecting the right engine to feed from the left main tank. If this was indeed the case, and the left main tank ran dry, it is likely that the left engine would stop slightly before the right engine because its fuel lines from the left tank are shorter. This sequence of events is consistent with the sum of the evidence. "}