{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-12-kazan-6-killed", "date": "Jan 23, 1953 at 2037 LT", "type": "Ilyushin II-12", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Novosibirsk – Kazan – Moscow", "msn": "30267", "yom": 31, "flight_number": "SU022", "city": "Kazan", "zone": "Republic of Tatarstan", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1288, "circumstances": "The crew was completing the cargo flight SU022 from Novosibirsk to Moscow with an intermediate stop in Kazan, carrying a crew of six and a load of wire coils, electric engines and radio components. Shortly after takeoff from Kazan Airport, while climbing to a height of 150 meters, the aircraft was hit on its empannage by the left engine of an Aeroflot Lisunov LI-2 that was trying to land at Kazan Airport. On a cargo flight from Leningrad to Sverdlovsk with intermediate stops in Moscow-Bykovo Airport and Kazan, the Lisunov LI-2 was registered CCCP-L4582 and was was carrying a crew of five and a load of six brass panels weighing 155 kilos each and a batch of capacitors. Following the collision, both aircraft dove into the ground and crashed in a snow covered field located three km southwest of the airport. Both aircraft were destroyed and all eleven crew members were killed.", "probable_cause": "It was determined that the collision was the result of a series of omissions on part of the ATC based at Kazan Airport who failed to coordinate properly the radar coverage and failed to assist the crew adequately. The ATC in charge of the approach instructed the crew of the Lisunov to descend to 300 meters instead of the 900 meters as mentioned in the approach procedures. Due to poor weather conditions that reduced the visibility below minimas, it would be more appropriate that ATC postponed the departure of the Ilyushin II-12 or instructed the crew of the Lisunov LI-2 to follow a holding circuit or to divert to another airport. It was confirmed that both flying crew did not bear any responsibilities in this tragedy."}