{"url": "https://www.baaa-acro.com/crash/crash-bae-3102-jetstream-31-wick", "date": "Sep 17, 2003 at 1447 LT", "type": "BAe Jetstream 31", "operator": "Eastern%20Airways.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Aberdeen – Wick", "msn": "781", "yom": 1987, "flight_number": null, "city": "Wick", "zone": "Caithness", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7885, "captain_hours_type": 1195, "copilot_hours": 6800, "copilot_hours_type": 1000, "aircraft_hours": 17845, "circumstances": "The aircraft was landing on Runway 31 at Wick Airport. It crossed the threshold at 130 kt which was 21 kt faster than the correct threshold speed. After the co-pilot closed the power levers the aircraft floated about six feet above the runway surface. The aircraft touched down and bounced before touching down a second time more heavily, cracking a wing spar and flexing the aircraft structure sufficient to allow the right propeller to contact the runway. The aircraft bounced again before touching down for the third and final time. The investigation determined that just before the first touchdown, one or both power levers were moved aft of the flight idle position. It was concluded that both the commander and co-pilot were making inputs on the flying controls from that moment onwards until after the second, heavy touchdown. There was no evidence of any technical fault on the aircraft and the weather conditions were well within the limitations set for the aircraft. No safety recommendations were made. ", "probable_cause": "It is reasonable to conclude that the manoeuvres conducted by G-EEST during the landing were the result of combined control inputs made by the commander and co-pilot. The evidence indicates that this period of combined control started at least 0.28 seconds before the first touchdown and finished at some stage after the second and damaging touchdown. After the first touchdown the aircraft became airborne in a high-drag, low-lift configuration which was intended for ground operation only and a 5.6g impact ensued on the second touchdown. There was no evidence of any technical fault on the aircraft that could have been a factor and the meteorological conditions were within the limitations set for the aircraft. A more complete understanding of the accident might have been possible with additional flight data parameters such as engine performance, aircraft pitch, and power lever position. "}