{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-321b-near-kem-2-killed", "date": "Apr 20, 1978 at 2217 LT", "type": "Boeing 707", "operator": "Korean%20Air-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Paris - Anchorage - Seoul", "msn": "19363", "yom": 1967, "flight_number": "KE902", "city": "Kem", "zone": "Republic of Karelia", "country": "Russia", "region": "Asia", "crew_on_board": 12, "crew_fatalities": 0, "pax_on_board": 97, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Flight KE902 departed Paris-Orly Airport at 1339LT on a flight to Seoul with an intermediate stop in Anchorage. After passing the North Magnetic Pole, while approaching Ellesmere Island, Canada, the airplane initiated a turn to the right by 150° instead continuing straight-in to North Canada and Alaska. This caused the airplane to fly to the southeast, over the Barents Sea and then into Soviet airspace, reaching the Soviet coast approximately three hours and 2,400 km after its right turn. The aircraft was intercepted by a Soviet Air Force Sukhoi SU-15TM and was forced to land. For reasons undetermined, the Korean crew did not respond to multiple requests and initiated a turn when the Soviet pilot was instructed to shoot down the Boeing 707. One of the air/air missile struck the left wing and four meters were torn off. The missile also punctured the fuselage, causing rapid decompression and jamming one of the plane's four turbines. From an altitude of 30,000 feet, the crew initiated a rapid descent and eventually completed an emergency landing on the frozen Korpijärvi Lake located in the region of Kem, Republic of Karelia. Two passengers were killed during the attack while all other occupants were evacuated, 13 were injured. Both pilots and the navigator were arrested but released on April 29. ", "probable_cause": "It is believed that the airplane deviated from the prescribed flight plan directly after it passed over the North Magnetic Pole, causing major disturbance of the aircraft's magnetic compass-based navigation systems. For the Soviet Authorities, the deviation was the consequence of a navigation error on part of the flying crew. "}