{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-331c-atlantic-city-5-killed", "date": "Jul 26, 1969 at 1233 LT", "type": "Boeing 707", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "New York - Atlantic City", "msn": "18712/373", "yom": 1964, "flight_number": "TW5787", "city": "Atlantic City", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 27436, "captain_hours_type": 4330, "copilot_hours": 6080, "copilot_hours_type": 1314, "aircraft_hours": 17590, "circumstances": "The flight departed New York-JFK to carry out training and proficiency check manoeuvres at the National Aviation Facilities Experimental Center (NAFEC) at the Atlantic City Airport. The first captain to receive the proficiency check occupied the left seat. The instructor-pilot occupied the right seat, and a flight engineer occupied the flight engineer's position. The other two captains occupied the flight deck as observers while awaiting their turn at the controls. Flight 5787 landed on runway 13 then requested, and the tower approved, clearance to taxi to the end of the runway, execute a 180 degrees turn, and take off on runway 31. Prior to takeoff, the instructor pilot briefed the captain to expect a simulated engine failure after V1, to execute a three-engine climbout, and to request vectors for a precision ILS approach to runway 13, using the aircraft's flight director system. Take off was initiated at 12:20 and instructor pilot retarded the No. 4 engine to training idle thrust after V1 had been reached. The takeoff was continued and emergency procedures were executed in accordance with the TWA engine failure emergency checklist. The aircraft was leveled off at 1,500 feet and vectored to intercept the ILS course in the vicinity of the outer marker. The No. 4 engine remained in idle thrust and the instructor pilot directed the captain to execute a simulated three-engine ILS approach, and to expect a missed approach at the decision height. The landing gear was extended and after the aircraft passed the outer marker, flaps were placed full down (50deg). The tower cleared TWA 5787 to land. At the decision height, a missed approach was announced. The captain advanced power on engines 1, 2, and 3, and called for \"25 Flaps,\" \"Takeoff Power,\" \"Up Gear.\" However, neither the flaps nor the landing gear moved from their previous positions. The aircraft was accelerated to 130 knots and a missed-approach climb was instituted. Approximately 16 t o 18 seconds after the start of the missed-approach procedure, one of the observer pilots commented, \"Oh! Oh! Your hydraulic system's zeroed.\" At 300 feet agl and an airspeed of 127 knots all hydraulic pumps were shutdown, but power on the no. 4 engine was not restored. Directional control was lost and the aircraft struck the ground in a right-wing low nose down attitude. The Boeing 707 broke up and caught fire.", "probable_cause": "The probable cause of this accident was a loss of directional control, which resulted from the intentional shutdown of the pumps supplying hydraulic pressure to the rudder without a concurrent restoration of power on the No.4 engine. A contributing factor was the inadequacy of the hydraulic fluid loss emergency procedure when applied against the operating configuration of the aircraft."}