{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90b-king-air-jundiai-1-killed", "date": "Apr 20, 2012 at 1430 LT", "type": "Beechcraft 90 King Air", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Jundiaí - Jundiaí", "msn": "LJ-1676", "yom": 2002, "flight_number": null, "city": "Jundiaí", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot, sole aboard, was completing a local flight from Jundiaí-Comandante Rolim Adolfo Amaro Airport. Shortly after takeoff from runway 36, the pilot reported to ATC that the engine lost power and that he was not able to maintain a safe altitude. He was cleared for an immediate return and completed a circuit. On final approach to runway 18, he lost control of the airplane that crashed 180 metres short of runway and came to rest upside down, bursting into flames. The aircraft was totally destroyed and the pilot was killed. ", "probable_cause": "The following factors were identified:\r\n- Upon intercepting the final leg for landing, the aircraft crossed the approach axis, and the pilot, in an attempt to make the aircraft join the approach axis again, may have depressed the rudder pedal in an inadequate manner, inadvertently making the aircraft enter a Cross Control Stall.\r\n- The pilot, intentionally, violated a number of aeronautical regulations in force in order to fly an aircraft for which he had no training and was not qualified.\r\n- The short experience of the pilot in the aircraft model hindered the correct identification of the situation and the adoption of the necessary corrective measures.\r\n- The DCERTA’s vulnerability allowed a non-qualified pilot to file a flight notification by making use of the code of a qualified pilot. Thus, the last barrier capable of preventing the accident flight to be initiated was easily thrown down, by making it difficult to implement a more effective supervisory action."}