{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-600-new-bern-3-killed", "date": "Nov 9, 1996 at 1139 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "James H. Doering", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "New Bern - New Bern", "msn": "60-0643-7961204", "yom": 1979, "flight_number": null, "city": "New Bern", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 382, "captain_hours_type": 5, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1888, "circumstances": "The airplane was over gross weight at takeoff but within Weight and Balance at the time of the accident. Witnesses observed the airplane flying low with the landing gear retracted over a wooded area then observed the airplane bank to the left and pitch down. The airplane then pitched nose up and entered what was described as a flat spin to the left. The airplane descended and impacted the ground upright with the landing gear retracted and the flaps symmetrically extended 6 degrees. Examination of the flight control systems, and engines revealed no evidence of preimpact failure or malfunction. A cabin door ajar indicating light was not illuminated at impact but the gear warning light was illuminated at impact. The pilot recently purchased the aircraft and only accumulated a total of 1 hour 23 minutes during 6 training flights. He accumulated an additional 3 hours 37 minutes after completion of the training flights while flying with other qualified pilots. The accident flight was the first flight in the make and model while flying with no other multiengine-rated pilot aboard.", "probable_cause": "The pilot's failure to maintain airspeed (VMC). Contributing to the accident was his lack of total experience in kind of aircraft. "}