{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-3b5-agana-228-killed", "date": "Aug 6, 1997 at 0142 LT", "type": "Boeing 747-300", "operator": "Korean%20Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Seoul - Agana", "msn": "22487", "yom": 1984, "flight_number": "KE801", "city": "Agana-Antonio Borja Won Pat", "zone": "All Guam Island", "country": "Guam Island", "region": "Asia", "crew_on_board": 17, "crew_fatalities": 14, "pax_on_board": 237, "pax_fatalities": 214, "other_fatalities": 0, "total_fatalities": 228, "captain_hours": 8932, "captain_hours_type": 1718, "copilot_hours": 4066, "copilot_hours_type": 1560, "aircraft_hours": 50105, "circumstances": "Korean Air Flight 801 was a regular flight from Seoul to Guam. The Boeing 747-300 departed the gate about 21:27 and was airborne about 21:53. The captain was pilot-flying. Upon arrival to the Guam area, the first officer made initial contact with the Guam Combined Center/Radar Approach Control (CERAP) controller about 01:03, when the airplane was level at 41,000 feet and about 240 nm northwest of the NIMITZ VOR/DME. The CERAP controller told flight 801 to expect to land on runway 06L. About 01:10, the controller instructed flight 801 to \"...descend at your discretion maintain two thousand six hundred.\" The first officer responded, \"...descend two thousand six hundred pilot discretion.\" The captain then began briefing the first officer and the flight engineer about the approach and landing at Guam: \"I will give you a short briefing...ILS is one one zero three...NIMITZ VOR is one one five three, the course zero six three, since the visibility is six, when we are in the visual approach, as I said before, set the VOR on number two and maintain the VOR for the TOD [top of descent], I will add three miles from the VOR, and start descent when we're about one hundred fifty five miles out. I will add some more speed above the target speed. Well, everything else is all right. In case of go-around, since it is VFR, while staying visual and turning to the right...request a radar vector...if not, we have to go to FLAKE...since the localizer glideslope is out, MDA is five hundred sixty feet and HAT [height above touchdown] is three hundred four feet....\" About 01:13 the captain said, \"we better start descent;\" shortly thereafter, the first officer advised the controller that flight 801 was \"leaving four one zero for two thousand six hundred.\" During the descent it appeared that the weather at Guam was worsening. At 01:24 requested a deviation 10 miles to the left to avoid severe weather. At 01:31 the first officer reported to the CERAP controller that the airplane was clear of cumulonimbus clouds and requested \"radar vectors for runway six left.\" The controller instructed the flight crew to fly a heading of 120°. After this transmission, the flight crew performed the approach checklist and verified the radio frequency for the ILS to runway 06L. About 01:38 the CERAP controller instructed flight 801 to \"...turn left heading zero nine zero join localizer;\" the first officer acknowledged this transmission. At that time, flight 801 was descending through 2,800 feet msl with the flaps extended 10° and the landing gear up. One minute later the controller stated, \"Korean Air eight zero one cleared for ILS runway six left approach...glideslope unusable.\" The first officer responded, \"Korean eight zero one roger...cleared ILS runway six left;\" his response did not acknowledge that the glideslope was unusable. The flight engineer asked, \"is the glideslope working? glideslope? yeh?\" One second later, the captain responded, \"yes, yes, it's working.\" About 01:40, an unidentified voice in the cockpit stated, \"check the glideslope if working?\" This statement was followed 1 second later by an unidentified voice in the cockpit asking, \"why is it working?\" The first officer responded, \"not useable.\" The altitude alert system chime sounded and the airplane began to descend from an altitude of 2,640 feet msl at a point approximately 9 nm from the runway 06L threshold. About 01:40:22, an unidentified voice in the cockpit said, \"glideslope is incorrect.\" As the airplane was descending through 2,400 feet msl, the first officer stated, \"approaching fourteen hundred.\" About 4 seconds later, when the airplane was about 8 nm from the runway 06L threshold, the captain stated, \"since today's glideslope condition is not good, we need to maintain one thousand four hundred forty. please set it.\" An unidentified voice in the cockpit then responded, \"yes.\" About 01:40:42, the CERAP controller instructed flight 801 to contact the Agana control tower. The first officer contacted the Agana tower: \"Korean air eight zero one intercept the localizer six left.\" The airplane was descending below 2,000 feet msl at a point 6.8 nm from the runway threshold (3.5 nm from the VOR). About 01:41:01, the Agana tower controller cleared flight 801 to land. About 01:41:14, as the airplane was descending through 1,800 feet msl, the first officer acknowledged the landing clearance, and the captain requested 30° of flaps. The first officer called for the landing checklist and at 01:41:33, the captain said, \"look carefully\" and \"set five hundred sixty feet\" (the published MDA). The first officer replied \"set,\" the captain called for the landing checklist, and the flight engineer began reading the landing checklist. About 01:41:42, as the airplane descended through 1,400 feet msl, the ground proximity warning system (GPWS) sounded with the radio altitude callout \"one thousand [feet].\" One second later, the captain stated, \"no flags gear and flaps,\" to which the flight engineer responded, \"no flags gear and flaps.\" About 01:41:46, the captain asked, \"isn't glideslope working?\" The captain then stated, \"wiper on.\" About 01:41:53, the first officer again called for the landing checklist, and the flight engineer resumed reading the checklist items. About 01:41:59, when the airplane was descending through 1,100 feet msl at a point about 4.6 nm from the runway 06L threshold (approximately 1.3 nm from the VOR), the first officer stated \"not in sight?\" One second later, the GPWS radio altitude callout sounded: \"five hundred [feet].\" About 01:42:14, as the airplane was descending through 840 feet msl and the flight crew was performing the landing checklist, the GPWS issued a \"minimums minimums\" annunciation followed by a \"sink rate\" alert about 3 seconds later. The first officer responded, \"sink rate okay\". At that time the airplane was descending 1,400 feet per minute. About 01:42:19, as the airplane descended through 730 feet msl, the flight engineer stated, \"two hundred [feet],\" and the first officer said, \"let's make a missed approach.\" About one second later, the flight engineer stated, \"not in sight,\" and the first officer said, \"not in sight, missed approach.\" About 01:42:22, as the airplane descended through approximately 680 feet msl, the nose began to pitch up and the flight engineer stated, \"go around.\" When the captain stated \"go around\" power was added and airspeed began to increase. As the airplane descended through 670 feet msl, the autopilot disconnect warning sounded. The GPWS radio altitude callouts continued: \"one hundred...fifty...forty...thirty...twenty [feet].\" About 01:42:26, the airplane impacted hilly terrain at Nimitz Hill, Guam, about 660 feet msl and about 3.3 nm from the runway 06L -threshold. It struck trees and slid through dense vegetation before coming to rest. A post-impact fire broke out. It was established a.o. that the software fix for the Minimum Safe Altitude Warning (MSAW) system at Agana Center Radar Approach Control (CERAP) had rendered the program useless. A software patch had been installed since there had been complaints of the high rate of false MSAW alarms at Guam. This made KAL801's descent below MDA go undetected at the Agana CERAP.", "probable_cause": "The captain's failure to adequately brief and execute the nonprecision approach and the first officer's and flight engineer's failure to effectively monitor and cross-check the captain's execution of the approach. Contributing to these failures were the captain's fatigue and Korean Air's inadequate flight crew training. Contributing to the accident was the Federal Aviation Administration's intentional inhibition of the minimum safe altitude warning system and the agency's failure to adequately to manage the system."}