{"url": "https://www.baaa-acro.com/crash/crash-atr72-212-mumbai", "date": "Nov 10, 2009 at 1640 LT", "type": "ATR72-200", "operator": "Kingfisher%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bhavnagar - Mumbai", "msn": "729", "yom": 2006, "flight_number": "IT4124", "city": "Mumbai-Chhatrapati Shivaji (Santa Cruz)", "zone": "Maharashtra", "country": "India", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 38, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7160, "captain_hours_type": 2241, "copilot_hours": 973, "copilot_hours_type": 613, "aircraft_hours": 9318, "circumstances": "As per the NOTAM, Runway 14/32 was under permanent maintenance on every Tuesdays since 10/11/2009 runway 27 was available only after runway intersection as runway 27A. To carry out operations on this reduced runway 27 a NOTAM ‘G’ No. G 0128/08 was issued by AAI on the same day of accident i.e. 10-11-2009 and designated as runway 27A for visual approach only. As per the NOTAM Landing Distance Available (LDA)/take off Distance available (TODA) was 1703 m. The weather conditions prevailing at the time of accident was winds 070/07 knots visibility 2800 m with feeble rain. Prior to Kingfisher aircraft, Air India aircraft IC-164, Airbus 319 had landed and reported to ATC that it had aquaplaned and broken two runway edge lights. The ATC acknowledged it and sent runway inspection vehicle to inspect the runway. The ATC person was not familiar with the terminology of ‘aquaplaning’ and not realizing the seriousness of it, cleared kingfisher aircraft for landing. At the time of accident there were water patches on the runway. ATC also did not transmit to the Kingfisher aircraft the information regarding aquaplaning reported by the previous aircraft. The DFDR readout revealed that kingfisher aircraft was not on profile as per localizer procedure laid down in NOTAM ‘G’ and was high and fast. The aircraft landed late on the runway and the runway length available was around 1000 m from the touchdown point. In the prevailing weather conditions this runway length was just sufficient to stop the aircraft on the runway. During landing the kingfisher aircraft aquaplaned and did not decelerate even though reversers and full manual braking was applied by both the cockpit crew. The aircraft started skidding toward the left of center line. On nearing the runway end, the pilot initiated a 45 ° right turn, after crossing ‘N 10’ Taxi track, the aircraft rolled into unpaved wet area. Aircraft rolled over drainage pipes & finally came to a stop near open drain. There was no fire. All the passenger safely deplaned after the accident.", "probable_cause": "The accident occurred due to an unstabilized approach and decision of crew not to carry out a ‘Go-around’.\r\nContributory Factors: \r\ni) Water patches on the runway 27\r\nii) Inability of the ATCO to communicate the aircraft about aquaplaning of the previous aircraft \r\niii) Lack of input from the copilot."}