{"url": "https://www.baaa-acro.com/crash/crash-antonov-12-bryansk", "date": "Nov 8, 1997", "type": "Antonov AN-12", "operator": "Aviaobshchemash", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Istanbul - Bryansk", "msn": "1400104", "yom": 1961, "flight_number": null, "city": "Bryansk", "zone": "Bryansk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was completing a cargo flight from Istanbul to Bryansk, carrying one passenger, eight crew members and a load of various goods. On approach to Bryansk Airport, the crew encountered poor weather conditions with fog. The horizontal visibility was estimated to be 450 metres, the vertical visibility 80 metres with a RVR of 1,000 metres. On final approach, the pilot-in-command was unable to establish a visual contact with the runway so he decided to initiate a go-around procedure. Few minutes later, the crew attempted a second approach in similar weather conditions. Nevertheless, the crew continued the approach when the aircraft landed hard. Out of control, it veered off runway and came to rest. All nine occupants were injured and the aircraft was damaged beyond repair. ", "probable_cause": "The following contributing factors were identified:\r\n- The crew was tired following an over 20 hours duty period without any rest time, \r\n- The crew decided to leave Istanbul without any rest time period, \r\n- Information transmitted to the crew concerning weather forecast for Bryansk Airport were inaccurate, \r\n- The crew decided to continue the approach and to descent below the MDA without any visual contact with the runway lights until the aircraft impacted the ground. "}