{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-15f-saltillo-1-killed", "date": "Jul 6, 2008 at 0113 LT", "type": "Douglas DC-9", "operator": "USA%20Jet%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hamilton – Shreveport – Saltillo", "msn": "47153/185", "yom": 1967, "flight_number": "JUS199", "city": "Saltillo", "zone": "Coahuila", "country": "Mexico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7146, "captain_hours_type": 2587, "copilot_hours": 6842, "copilot_hours_type": 88, "aircraft_hours": 54141, "circumstances": "The aircraft departed Hamilton, Ontario, on a cargo flight to Saltillo, Coahuila, with an intermediate stop in Shreveport, LA, carrying two pilots and a load consisting of 4 tons of auto parts. The aircraft arrived in Shreveport at 2319LT and departed at 2348LT. On approach to Saltillo-Plan de Guadalupe Airport, the crew encountered low visibility due to poor weather conditions and dark night. On final approach to runway 17, as the captain was unable to establish a visual contact with the runway, he decided to abandon the approach and initiated a go-around procedure. Nine seconds later, the aircraft stuck the ground and crashed 550 metres to the east of the runway 17 threshold, bursting into flames. The aircraft was totally destroyed, the captain was killed and the copilot was seriously injured. ", "probable_cause": "The continuation of an unstable final approach without having the runway in sight and the consequent loss of control at low altitude in view of the imminent impact.\r\nThe following contributing factors were identified: \r\n- Weather conditions at the airport,\r\n- Unstabilized approach,\r\n- Crew fatigue,\r\n- Lack of experience of the copilot,\r\n- Failure to follow proper procedures,\r\n- Lack of operational procedures,\r\n- Not following proper Saltillo tower controller procedures,\r\n- Lack of supervision by the authority,\r\n- The coincidence of factors that individually would not represent a substantial increase in the risk of the operations, but that in this case were added, that is; late night flight, little experience of the co-pilot, omission of briefing by the captain, a single Jeppesen for two pilots, DME #2 inoperative, captain command bars inoperative, DME arc, ILS/DME approach, omission of fog bank report and finally saturation in the communications with the Monterrey Control Center."}