{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1049g-82-super-constellation-mt-alto-del-cedro-23-killed", "date": "Oct 14, 1958 at 0023 LT", "type": "Lockheed L-1049 Super Constellation", "operator": "Aeropostal-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Panama City – Maracaibo", "msn": "4575", "yom": 1955, "flight_number": null, "city": "Mt Alto del Cedro (Serranía de Perijá)", "zone": "Zulia", "country": "Venezuela", "region": "South America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 17, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 23, "captain_hours": null, "captain_hours_type": 2134, "copilot_hours": 1069, "copilot_hours_type": 469, "aircraft_hours": null, "circumstances": "The aircraft was on a flight between Panama City and Maracaibo, carrying a crew of 6 and 17 passengers. The crew reported over the Riohacha intersection at 2351LT at an altitude of 15,000 feet and estimated his arrival at Maracaibo-Grano de Oro Airport at 0030LT. At 0015LT the crew reported he was 35 miles out at an altitude of 10,000 feet. The last contact with the aircraft was at 0022LT. It crashed on Alto del Cedro Mountain in the Serranía de Perijá, killing all 23 persons aboard. ", "probable_cause": "The accident occurred owing to premature descent caused by the pilot's failure to allow himself a suitable margin for: \r\n- altered flight course and \r\n- shortage of navigational facilities in the area. \r\nIt was also reported that the pilot turned northwest on reaching position Tango/2, instead of turning at Barranquilla, and flew towards a wrong position 45 miles from the Riohacha intersection, having failed to take this discrepancy into account in calculating his distance from Maracaibo. It is very likely that the pilot, when reporting 35 miles from Maracaibo, had seen the Carrasquero lights and the surrounding gas flares, through a thin layer of cloud below and believed they were the lights of Maracaibo. The pilot had no way of definitely determining his position in the area, and, therefore, ought to have taken greater precaution against descent at a mistaken location. His best alternative should have been to remain at a safer altitude until (1) he sighted the Maracaibo lights (not the glare), or (2) obtained oscillation of the radio compass needle over Maracaibo. "}