{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-uberlandia", "date": "Mar 15, 1991 at 2107 LT", "type": "Learjet 35", "operator": "Lider", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "São Paulo – Uberlândia", "msn": "35-433", "yom": 1981, "flight_number": null, "city": "Uberlândia", "zone": "Minas Gerais", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3850, "captain_hours_type": 550, "copilot_hours": 15175, "copilot_hours_type": 525, "aircraft_hours": null, "circumstances": "The aircraft departed São Paulo-Congonhas Airport on an ambulance flight to Uberlândia, carrying two doctors and two pilots who should pick-up a patient. The copilot was pilot flying. This was his first flight on a Learjet without an instructor. This was against regulations since the copilot was not fully qualified yet and the captain was not qualified to act as an instructor. Upon arrival at Uberlândia, weather conditions were poor with a low ceiling at 100 meters (clouds 8/8), fog and an horizontal visibility less than 200 meters (below minimums weather conditions). The crew abandoned the approach and initiated a go-around procedure. Few minutes later, a second approach was also abandoned. Rather than diverting to the alternate airport, the crew attempted a third approach when the aircraft struck the ground and crashed short of runway threshold. All four occupants were seriously injured and the aircraft was destroyed.  ", "probable_cause": "The accident was the consequence of the combination of the following factors:\r\n- Poor flight preparation and planning, \r\n- Poor approach planning, \r\n- Wrong approach configuration, \r\n- Poor crew coordination, \r\n- Lack of visibility due to the night associated to below minimums weather conditions, \r\n- The crew failed to initiate a go-around and to divert to the alternate airport, \r\n- Poor crew resources management, \r\n- Non observation of operational procedures, \r\n- Lack of supervision on part of the captain,\r\n- Poor operational organization on part of the operator. "}