{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-hurricane", "date": "Oct 21, 2018 at 1500 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Keystone Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hurricane - Salt Lake City", "msn": "46-36413", "yom": 2007, "flight_number": null, "city": "Hurricane", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7000, "captain_hours_type": 1500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1088, "circumstances": "Shortly after takeoff, the pilot smelled smoke. As he began to turn the airplane back to the airport, the engine lost total power. He conducted a forced landing in a field just short of the airport, during which the airplane struck a metal fence and pipe. All occupants egressed, and the pilot then noticed that a fire had erupted under the airplane's engine cowling. Postaccident examination revealed that the airplane sustained fire damage to the roof and forward end of the baggage compartment along with the engine accessory area between the firewall and aft air baffles. Further examination revealed that one of the engine exhaust crossover pipe assemblies was misaligned at the slip joint. An engine manufacturer service bulletin (SB) called for inspections of the exhaust system slip and flange joints to identify misaligned exhaust components. The last maintenance event occurred about 7 1/2 flight hours before the accident, during which the SB was performed and resulted in the replacement of crossover pipes. The mechanic who had performed the most recent maintenance did not follow the correct procedures for reinstallation of the crossover pipe, and the inspector who reviewed his work did not examine the installation as it progressed but instead inspected the pipes after they were installed and essentially hidden from view by their protective heat shield. As a result of the misaligned engine exhaust crossover pipe, hot exhaust gases escaped into the engine compartment and started a fire, which compromised critical engine fuel and oil lines, and resulted in the loss of engine power.", "probable_cause": "The mechanic's failure to properly align the engine exhaust crossover pipe during replacement, and his supervisor's failure to properly inspect the installation, which resulted in an in-flight fire and the loss of engine power.\n"}