{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-21a-goose-penn-yan", "date": "Feb 15, 2005 at 0942 LT", "type": "Grumman G-21A Goose", "operator": "Jetcraft Corporation", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Penn Yan - Penn Yan", "msn": "1051", "yom": 1939, "flight_number": null, "city": "Penn Yan", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17573, "captain_hours_type": 46, "copilot_hours": 18347, "copilot_hours_type": 24, "aircraft_hours": 8825, "circumstances": "The purpose of the flight was for the flight instructor to provide multiengine airplane training, in a late 1930's vintage amphibious airplane, to his brother, a single engine airplane rated private pilot. No published performance data was available for the airplane, and according to the flight instructor, much of what he knew about the performance of the airplane he learned from previous flights. Just after takeoff on the accident flight, and about 600 feet above ground level (agl), and as the pilot was retracting the landing gear and starting a left turn to the crosswind leg of the traffic pattern, the flight instructor retarded the right throttle in order to simulate a failure of the right engine. The pilot executed the procedures for an in-flight engine failure and the instructor looked out of the window to check for traffic in the airport traffic pattern. The flight instructor then heard the pilot state \"I am at blue line but losing altitude.\" The flight instructor continued to scan for traffic and moved the right throttle forward to about the \"half throttle\" position. The pilot could not recall if he had adjusted either of the power controls after the initial application of power for takeoff. The airplane continued to descend, impacted the ground, and caught fire.", "probable_cause": "The flight instructor's inadequate planning/decision and his remedial action to conduct or recover from a simulated emergency procedure."}