{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-749a-constellation-near-tomas-49-killed", "date": "Apr 27, 1966 at 0805 LT", "type": "Lockheed L-749 Constellation", "operator": "LANSA%20Peru-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Lima - Cuzco", "msn": "2521", "yom": 1947, "flight_number": "LP501", "city": "Tomas", "zone": "Lima", "country": "Peru", "region": "South America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 43, "pax_fatalities": 43, "other_fatalities": 0, "total_fatalities": 49, "captain_hours": 14684, "captain_hours_type": 1692, "copilot_hours": 963, "copilot_hours_type": 875, "aircraft_hours": 47899, "circumstances": "Flight 501 was a scheduled domestic flight from Lima to Cuzco. It was instructed to take-off from runway 15 and to climb in accordance with No. 2 standard climb procedure, described as follows in the airline's route guide: climb on a heading of 190° until 9 NM southwest of the airport, then on a heading of 120°. The flight took off from Lima-Callao-Jorge Chavez International Airport at 0740LT, 10 minutes after the take-off time indicated on the flight plan. At 0757 hours it contacted Lima radio on the route frequency, 126.9 MCIS, and reported: \"Departed Lima- Callao at 1240Z, climbing, estimating Ayacucho at 1337Z. It This was the last message from the aircraft, although Lima and Cuzco repeatedly called the aircraft around 0840 hours. One witness from \"Tres Cruces\" and two witnesses from the village of San Pedro de Pilas testified that their attention was attracted between 0800 and 0805 hours by an aircraft flying unusually low over San Pedro de Pilas or Tamard; one of the witnesses stated that he had been able to read the \"LANSA\" inscription on the aircraft. They had heard on several occasions aircraft flying over the area, but these were always seen at much higher altitudes. They all concurred that the aircraft was following the gap between San Pedro de Pilas and Tamard and was flying toward the mountain range below the level of the peaks. The two witnesses from San Pedro de Pilas pointed out positions on the Huamantanga peak where they observed the aircraft evading the mountain by a slight turn to .the left and entering the gap towards the east. They did not see any smoke or signs of fire and one indicated that he was positive that all four engines were operating at the time. The wreckage of the aircraft was located on 28 April on the southeast slopes of Mount Talaula at an elevation of 12 600 ft, 61 NM from Lima-Callao Airport and 29 NM north of the normal route. All 49 occupants have been killed. ", "probable_cause": "The Commission considered that the probable cause of the accident was pilot error in that he:\r\na) Incorrectly selected the route to be flown in violation of the provisions established by the Airline for operation of flight 501;\r\nb) Incorrectly calculated the climb performance of the aircraft in relation to its total weight of takeoff. This aircraft type, with a gross takeoff weight of 90,572 lb can't within the 25 minutes of flight after takeoff attain the altitude required to fly over the peaks of the Cordillera which are encountered over the distance that can be covered in the above-indicated time along the route followed by the aircraft. Under such conditions the operation can be performed only by flying the aircraft. Under such conditions the operation can be performed only by flying the aircraft at lower levels between the mountains, in violation of the most elementary principles of flight safety;\r\nc) Erroneously estimated the elevation of the nearby peaks he had to clear along the route. The Commission considered that the critical moment of decision came in the area of the towns of Tamara and Pilas which are separated by a gap running into the Cordillera and joining in the same area another wide gap into which flows the Rio Omas and which leads to the coastal town of Asia. At this point the pilot could still have flown out to the east but this would have entailed continuing on this course, then turning to avoid Mount Huamantanga (12 600 feet), since he was flying below the elevation of the mountain so as to enter the gap and follow it up to the Cordillera even though it would have been flying below the elevation of surrounding peaks. The Tamara and Pilas gap, the entrance to which is in the area of the above mentioned villages, at a rather low elevation, is about 5 nm wide along its entire length up to the Cordillera, rises very steeply until it reaches elevations of more than 14 000 feet, which could not be cleared by the subject aircraft, considering its weight, the climb characteristics of the aircraft, the time to fly the 5nm length of the gap and the altitude of the aircraft when it entered the gap;\r\nd) In view of the flight experience of the pilot in command, who had completed 112 flights on the 501-502 route, one can only surmise that his judgment was affected by insufficient rest and his particular state of mind as a result of his assignment to perform the flight for which he was not rostered. He may have been further influenced in the selection of the direct route by the perfect weather conditions obtaining at the time;\r\ne) Finally, although there was no evidence of any mechanical failure the Commission could not definitely rule out the possibility of some 'undetermined' factor during the two minutes if flight from San Pedro de Pilas to the point of impact inside the gap. If such was the case, this would have only aggravated the situation, since it was considered that after having entered the Tamara-Pilas gap, the aircraft could not have been cleared the peaks along the route nor come back. In view of this circumstance, it was considered that an 'undetermined factor did not necessarily cause the accident."}