{"url": "https://www.baaa-acro.com/crash/crash-cessna-421a-golden-eagle-i-bernard-3-killed", "date": "Apr 29, 1996 at 1515 LT", "type": "Cessna 421A Golden Eagle I", "operator": "Monarch Aviation", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Cedar Rapids - Milwaukee", "msn": "421A-0181", "yom": 1968, "flight_number": null, "city": "Bernard", "zone": "Iowa", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 6100, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6804, "circumstances": "During flight, the pilot reported shutting down the left engine due to a loss of oil pressure. He declared an emergency and diverted toward an alternate airport. However, while diverting, radar and radio contact were lost, and the airplane crashed. The wreckage path covered a distance of approximately 60 feet; the descent angle during impact was estimated to be about 45°. Oil was found behind the left engine, on the left flap, on the bottom of the left horizontal stabilizer, and on the bottom of the fuselage. Also, fuel stains were seen in the grass around the airplane. No preimpact fire indications were found. The pilot had reported low oil pressure in the left engine before the accident flight, and purchased seven quarts of oil before departing. No indications of power at impact were seen on either engine or propeller. Numerous abnormalities existed with the left engine. No discrepancies were noted with the right engine. The farmer who found the wreckage reported that sleet was falling at the time of the accident. The pilot of another aircraft reported structural icing conditions. ", "probable_cause": "The pilot's operation of the airplane with known deficiencies, subsequent loss of oil from the left engine, and the pilot's failure to maintain minimum controllable airspeed (VMC), while diverting to an alternate airport. Factors relating to the accident were: a leak from an unknown component in the left engine oil system, and the local weather condition. "}