{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-t2-cheyenne-ii-xl-jackson-5-killed", "date": "Jun 3, 2001 at 1611 LT", "type": "Piper PA-31 Cheyenne", "operator": "Falcon Communications", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Malden – Atlanta", "msn": "31-8166003", "yom": 1981, "flight_number": null, "city": "Jackson-McKellar Sipes", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 9500, "captain_hours_type": 13, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6025, "circumstances": "About 20 minutes before the accident, the pilot reported to the air traffic controller that he had a problem with an engine and needed to shut the engine down. The flight had just leveled at 23,000 feet. The controller told the pilot that he was near Jackson, Tennessee, and that he could descend to 7,000 feet. About 10 minutes later, the pilot reported he was at 8,000 feet and requested radar vectors for the instrument landing system approach to runway 2 at the McKellar-Sipes Regional Airport, at Jackson. The pilot told the controller he had the left engine shut down. About 5 minutes later, the pilot reported he had a propeller runaway. About 1 minute later, the pilot reported he was in visual conditions and requested radar vectors direct to the airport. About 2 minutes later, the pilot reported he had a cloud layer under him and that he had the localizer frequency for runway 2 set. About 1 minute later, the pilot was told to contact the McKellar Airport control tower. The pilot acknowledged this instruction. No further transmissions were received from the flight. Examination of the left engine at the accident site showed the left propeller control was found disconnected at the point the propeller control extension bracket attaches to the propeller governor. The propeller control cable had also pulled loose from a swaged point at the control rod and was also separated further aft due to overstress. The housing for the propeller control rod was found securely attached to the engine and the control rod was securely attached to the extension bracket. The propeller governor control arm, which was disconnected from the propeller control cable and rod, was found spring loaded into the high RPM position. Examination of the fractured left propeller bracket assembly was performed by the NTSB Materials Laboratory, Washington, D.C. The bracket assembly was fractured in the area of the outermost eyehole, at the point a bolt passes through the bracket assembly and the propeller governor arm. The fracture surface contained small amounts of dirt, grease, and minor corrosion. The fracture surface features include flat areas that lie on multiple planes separated by ratchet marks, features typically left behind by the propagation of a fatigue crack. The fatigue crack emanated from multiple origins on opposite sides of the bracket. The total area of the fatigue crack occupied approximately 85 percent of the fracture surfaces. The fatigue fractures initiated on the outer edges of the surface and propagated inward toward the center. The remaining 15% of the fracture surface had features consistent with overstress separation. Near the middle of each fatigue region were microfissures suggesting that the crack propagated under high-stress conditions. The NTSB  Materials Laboratory also examined the separation point between the left propeller control flexible cable and the rigid rod that connects to the bracket assembly. The cable and the swaged part of the rigid rod were in good condition with no fractures or damage. The Piper PA-31-T2 Pilot Operating Handbook, Section 3, Emergency Procedures, does not contain a procedure for loss of propeller control. Section 3 did contain a procedure for \"Over speeding Propeller\", which stated that if a propellers speed should exceed 1,976 rpm, to place the power lever of the engine with the over speeding propeller to idle, feather the propeller, place the engine condition lever in the stop position, and complete the engine shutdown procedures. Pilot logbook records show the pilot completed a simulator training course for the accident model airplane about 9 days before the accident and had about 13 flight hours in the Piper PA-31-T2.", "probable_cause": "The pilot's shutting down the left engine following loss of control of the left propeller resulting in an in-flight loss of control of the airplane due to the windmilling propeller. Factors in the accident were the failure of the propeller control bracket assembly due to fatigue, the pilot's lack of experience in the type of airplane (turbo propeller) and the absence of a procedure for loss of propeller control in the airplane's flight manual."}