{"url": "https://www.baaa-acro.com/crash/crash-learjet-25-newark-2-killed", "date": "Mar 30, 1983 at 0514 LT", "type": "Learjet 25", "operator": "Hughes Charter Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Postal (mail)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago - Newark", "msn": "25-030", "yom": 1969, "flight_number": "CA27", "city": "Newark", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5100, "captain_hours_type": 1600, "copilot_hours": 4112, "copilot_hours_type": 1488, "aircraft_hours": 5750, "circumstances": "The aircraft was on a night check courier flight. During arrival, the indicated airspeed was well above the legal limit of 250 knots for flight below 10,000 feet. Runway 04R was selected for landing after the crew were advised that their original choice (runway 11) was noise sensitive. They were advised not to descend below 2,000 feet until on final approach. The turn to final was completed about one mile from the runway at an altitude of approximately 700 feet. A steep (5°) final approach was flown with an estimated 1,000 fpm rate of descent. On landing, the aircraft bounced, banked/turned to the right, then it hit the ground, right wing first and burned. An exam of the wreckage revealed the aircraft was configured with the gear extended, the flaps down 20° and the spoilers retracted. No evidence of a preimpact part failure or malfunction was found. The trim was set for a heavy right wing and the fuel switches were set to x-feed fuel. Toxicological checks showed that both pilots had used or been exposed to marijuana and had CO2 in their blood from smoking; use of medication (phenylpropanolamine) by copilot. Evidence of possible fatigue/stress to both. Both pilots were killed. ", "probable_cause": "The probable causes of this accident were:\r\n- Loss of control following ground contact, \r\n- An unstabilized approach, \r\n- Impairment of the flightcrew judgment, decision making, and flying abilities by a combination of physiological and psychological factors. \n"}