{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-wondai-5-killed", "date": "Jul 26, 1990 at 2248 LT", "type": "Beechcraft 90 King Air", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cairns – Wondai – Camden", "msn": "LW-255", "yom": 1978, "flight_number": null, "city": "Wondai", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 2654, "captain_hours_type": 285, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Beech E90 VH-LFH was being flown by the owner as pilot-in-command for the flight. The pilot had submitted a flight plan nominating a private category, single pilot, instrument flight rules (IFR) flight, from Cairns to Wondai and thence to Camden. VH-LFH, with six passengers on board, departed Cairns at 1830 hours EST and arrived at Wondai at 2142 hours after an uneventful flight. One passenger left the aircraft at Wondai. The aircraft was refuelled with 800 litres of aviation turbine fuel and the pilot reported taxying for Runway 36 at Wondai to Brisbane Flight Service at 2243 hours EST. The aircraft was issued an airways clearance at 2245 hours which the pilot acknowledged correctly. The last radio contact with the aircraft was at 2248 hours when the pilot reported airborne. Witnesses observed the aircraft take-off and a short time later heard the sound of impact. The aircraft struck a line of small trees slightly left of the runway extended centreline and 600 metres from the end of the runway in a wings level attitude and in a very shallow descent. Forty-eight metres beyond this point, the aircraft impacted the ground and began to break up. It then contacted a number of large trees and caught fire, finally coming to rest 90 metres further on. A passenger was seriously injured while five other occupants were killed. ", "probable_cause": "The circumstances leading to the development of this accident could not be established conclusively. However, the evidence supports the following as probable factors:\r\n- The pilot might not have been aware of the human factors aspects associated with dark night take-offs.\r\n- The pilot could have been influenced by stress and/or fatigue.\r\n- The aircraft was taking off towards dark textureless terrain and no visible horizon.\r\n- By transmitting his airborne call very soon after lift-off, the pilot was not devoting his full attention to flying the aircraft.\r\n- The pilot became disoriented and placed the aircraft in a shallow descent as it accelerated after take-off.\n"}