{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-340-70-miami", "date": "Dec 4, 2004 at 0851 LT", "type": "Convair CV-340", "operator": "Miami-Air-Lease", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Miami – Nassau", "msn": "274", "yom": 1955, "flight_number": null, "city": "Miami", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3100, "captain_hours_type": 2400, "copilot_hours": 9169, "copilot_hours_type": 964, "aircraft_hours": 18465, "circumstances": "The pilot stated that when the airplane was 3 miles east of the shoreline, at 3,000 feet, he felt a short tremor in the left engine followed by loss of power from the left engine. The pilot elected to return to the departure airport while declaring an emergency to air traffic control. During the process of securing the left engine the pilot noticed the propeller did not feathered and the airplane was descending quickly. He maneuvered the airplane and ditched in a lake. On September 26, 2003 engine s/n: 34592 was removed from the accident airplane due to high oil consumption with 1,225 hours of time in service. It was reportedly preserved and stored at the operator's warehouse. The mechanic who reportedly preserved the engine stated he followed the steps in the manual that was provided by the operator. On October 27, 2004 the left engine, s/n: NK510332, which was producing metal for months, was removed and engine s/n: 34592 was taken out of preservation and installed in the left position on the accident airplane with a new overhauled propeller assembly. On November 06, 2004, the left engine's, s/n: 34592, propeller governor was replaced due to the left propeller slow to response to power setting. During the post accident engine examination, the engine's main oil screen was observed with deposits of metal flakes and fragments, the oil scavenge pump would not rotate and had deposits of metal fragments internally; the engine was seized and wound not rotate. Catastrophic damage was observed to the accessories drive gears, oil transfer tube, and protection covers in the front accessory area. It was observed during a visual inspection of the crankshaft and bearings, including the front journal and front crankpin had damaged and sections of their respective bearings missing. The master rod bearing had incurred a catastrophic failure. Several cylinders skirts were found with impact marks from piston rods. Before removing the propeller assembly from the engine, the propeller feather system was flush with fresh oil and pressured with a feathering pump; the propeller blades were observed moving toward the feather position. Examination of the propeller assembly revealed metal contamination throughout the system; the propeller's governor screen gasket was clogged with metal contamination. The maintenance manual provided by the operator used for the engine preservation details several tasks required to be accomplished to the engine for proper engine preservation (i.e. thrust bear, cylinder, and propeller shaft treatments), which the mechanic did not mention he performed. No documentation for inspection and condition status of the dehydrator plugs were available. Documentation for flushing of contamination from the metal  producing engine, s/n NK510332, was not available nor knowledge by the operator if since a process was preformed to the left engine's oil tank and its system before installation of engine s/n: 34592. An FAA review of the cargo manifest discovered two different manifest weights. The cargo manifest obtained at the accident scene showed a total of 267 pieces of cargo annotated at a total weight of 10, 837 lbs. The sealed cargo manifest package showed a total of 267 pieces of cargo annotated at a total weight of 14,182 lbs. The maximum payload weight for the accident airplane is 13,586 lbs.", "probable_cause": "The improper maintenance of the left engine by company maintenance personnel (failure to flush metal from the oil system and failure to properly preserve the engine for storage) resulting in a total failure of the master rod bearing and contamination of the engine oil system with metal, which prevented the left propeller from feathering. This resulted in the airplane being unable to maintain altitude following loss of engine power and subsequent ditching in a lake. A factor in this accident is the aircraft operator and flight crew exceeding the maximum allowable takeoff weight for the airplane."}