{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-near-togiak-3-killed", "date": "Oct 2, 2016 at 1157 LT", "type": "Cessna 208B Grand Caravan", "operator": "Hageland-Aviation-Services-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Quinhagak – Togiak", "msn": "208B-0491", "yom": 1995, "flight_number": "HAG3153", "city": "Togiak", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 6481, "captain_hours_type": 781, "copilot_hours": 273, "copilot_hours_type": 84, "aircraft_hours": 20562, "circumstances": "On October 2, 2016, about 1157 Alaska daylight time, Ravn Connect flight 3153, a turbine powered Cessna 208B Grand Caravan airplane, N208SD, collided with steep, mountainous terrain about 10 nautical miles northwest of Togiak Airport (PATG), Togiak, Alaska. The two commercial pilots and the passenger were killed, and the airplane was destroyed. The scheduled commuter flight was operated under visual flight rules by Hageland Aviation Services, Inc., Anchorage, Alaska, under the provisions of Title 14 Code of Federal Regulations Part 135. Visual meteorological conditions prevailed at PATG (which had the closest weather observing station to the accident site), but a second company flight crew (whose flight departed about 2 minutes after the accident airplane and initially followed a similar route) reported that they observed unexpected fog, changing clouds, and the potential for rain along the accident route. Company flight-following procedures were in effect. The flight departed Quinhagak Airport, Quinhagak, Alaska, about 1133 and was en route to PATG.", "probable_cause": "The flight crew's decision to continue the visual flight rules flight into deteriorating visibility and their failure to perform an immediate escape maneuver after entry into instrument meteorological conditions, which resulted in controlled flight into terrain (CFIT). Contributing to the accident were:\r\n- Hageland's allowance of routine use of the terrain inhibit switch for inhibiting the terrain awareness and warning system alerts and inadequate guidance for uninhibiting the alerts, which reduced the margin of safety, particularly in deteriorating visibility;\r\n- Hageland's inadequate crew resource management (CRM) training; \r\n- The Federal Aviation Administration's failure to ensure that Hageland's approved CRM training contained all the required elements of Title 14 Code of Federal Regulations 135.330;\r\n- Hageland's CFIT avoidance ground training, which was not tailored to the company's operations and did not address current CFIT-avoidance technologies."}