{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-25-dk-shere", "date": "Nov 6, 1946 at 0845 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "KLM-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Amsterdam – Croydon", "msn": "13638", "yom": 1944, "flight_number": null, "city": "Shere", "zone": "Surrey", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 15, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft entered the London Control Zone when QBI conditions (compulsory IFR conditions) were in force. When the pilot estimated that he flew over the Croydon MF beacon, he had actually passed it two or three minutes earlier. He continued to fly on a westerly course for three or four minutes until receiving instructions that he was next to land, and that the landing direction was 120 degrees M. The aircraft then began to descend again and after receiving several QDM's the pilot turned on to the course for Croydon. The pilot levelled out at an indicated altitude of 1,200 feet and the undercarriage was lowered. Almost immediately after, whilst still flying in cloud, the aircraft struck the tops of trees and crashed. The pilot had set the altimeter to the sea level pressure instead of airfield pressure. Consequently the aircraft's height would be about 230 feet lower than that indicated by the altimeter.\r\nSource: \r\nhttp://aviation-safety.net/database/record.php?id=19461106-0", "probable_cause": "Flying into high ground in conditions of low cloud and poor visibility. This must be attributed to errors on the part of the pilot who, preparatory to landing at Croydon Airport in QBI conditions. \r\nFailed to navigate his aircraft with sufficient degree of care to avoid high ground when descending through cloud. \r\nDuring the descent misinterpreted the height of the aircraft as indicated by his altimeter."}