{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-600-camp-hill-2-killed", "date": "May 10, 2006 at 0921 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "John R. Martin", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Cornelia – Pensacola", "msn": "60-8265-023", "yom": 1982, "flight_number": null, "city": "Camp Hill", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot obtained a weather briefing from an Automated Flight Service Station (AFSS) and filed an IFR flight plan before departing on an IFR flight from Cornelia, Georgia, to Pensacola, Florida, on May 10, 2006.The flight service specialist provided information on a line of embedded thunderstorm activity along the route from Atlanta to Mobile including SIGMETs and advised that tops were forecasted to be at 41,000 to 50,000 feet. The specialist suggested that the pilot not depart immediately because of the weather, but said that it might be possible to land at an intermediate stop ahead of the weather, possibly in Pensacola or further north in the Crestview area. The pilot filed an IFR flight plan from Cornelia to Pensacola at 16,000 feet. The pilot called the AFSS again and requested an IFR clearance. The specialist responded that the clearance was on request, and that he would work on the void time and placed the pilot on hold. The specialist obtained the clearance from Atlanta Center and returned back to provide the clearance to the pilot. The pilot was not on the telephone line. The pilot departed Cornelia without an IFR clearance and contacted Atlanta Center. The controller informed the pilot on initial contact that he was not on his assigned heading, altitude, correct transponder code, and subsequently handed the pilot off to another controller. The flight was subsequently cleared direct to Panama City, Florida, and the pilot was instructed to climb to 16,000 feet. Atlanta Center broadcasted weather alerts over the radio frequency the pilot was on for Center Weather Advisory 101, SIGMETS 73C, 74C,and AIRMET Sierra between 0903 to 0913 CDT. The National Weather Service Storm Prediction Center, issued Severe Thunderstorm Watch 329 valid from 0635 CDT until 1300 CDT. The National Weather Service Aviation Weather Center issued Convective SIGMET 73C valid from 0855 CDT until 1055 CDT. The SIGMET was for a line of thunderstorms 40 nautical miles wide, and moving from 280 degrees at 35 knots. The tops of the thunderstorms were at 44,000 feet, with 2-inch hail, and possible wind gusts up to 60 knots. These weather alerts included the route of flight for the accident airplane. The controllers did not issue the pilot with severe radar-depicted weather information that was displayed on the controller's radar display. The airplane was observed on radar level at 16,000 feet at 09:19:48 CDT heading southwest. The airplane was observed to began a continuous left turn northwest bound at 15,700 feet at 09:20:38. The pilot called Atlanta center at 09:20:48 CDT and stated, \"Aero Star six eight triple nine we're going to make a reverse.\" and there was no further radio contact with the pilot. The last radar return was at 09:20:59. The airplane was  at 15, 600 feet. The wreckage was located on May 11, 2006. Examination of the wreckage revealed the right wing separated 9 feet 2 inches outboard of the wing root. The separated outboard section of the right wing was not recovered. The components were forwarded to the NTSB Laboratory for further examination. Examination of the components revealed the deformation patterns found on the fracture surfaces were consistent with upward bending overstress of the right wing.", "probable_cause": "The pilot's continued flight into known thunderstorms resulting in an in-flight break up. A factor in the accident was air traffic controller's failure to issue extreme weather radar echo intensity information displayed on the controller's radar to the pilot."}