{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-500f-saint-pierre", "date": "Dec 7, 1997 at 1818 LT", "type": "Fokker F27 Friendship", "operator": "Air%20UK", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Southampton - Saint Pierre", "msn": "10558", "yom": 1977, "flight_number": null, "city": "Saint Peter-La Villiaze", "zone": "Channel Islands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 50, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14000, "captain_hours_type": 2865, "copilot_hours": 2150, "copilot_hours_type": 320, "aircraft_hours": 44877, "circumstances": "During his pre-flight preparation the commander noted that the crosswind at Guernsey would need close monitoring throughout the day as it would be close to the aircraft's crosswind limits. The aircraft departed from Guernsey at 16:10 for the first sector to Southampton, with the first officer acting as pilot flying (PF). On departure the first officer stated that the aircraft was 'difficult to keep straight' on the runway and moderate turbulence were encountered after takeoff between 500 to 1,000 feet agl but the remainder of the flight was uneventful. The aircraft departed again from Southampton at 17:23, with 50 passengers and 2 kg of freight on board, with the commander as the PF and the first officer as the pilot not flying (PNF). During the cruise the first officer obtained the latest weather for Guernsey: surface wind as 170°/19 gusting to 32 kt, visibility 5 km in rain, cloud scattered at 600 feet, broken at 800 feet, temperature 11°C, dew point 9°C, QNH of 1004 mb with turbulence and windshear below 200 feet agl. The commander briefed the first officer that he intended to carryout a 'radar vectored' ILS approach to runway 27 using 26.5° of flap, instead of the usual 40°, for greater aileron control in the crosswind conditions during the landing. He also intended to add 10 kt to the target threshold speed (TTS). In the final stages of the approach the aircraft experienced a drift angle of 25° to 30° in turbulent conditions. The aircraft was slightly above the prescribed glide path, as it crossed the threshold and the commander stated that when over the runway it was obvious to him that the aircraft would touchdown beyond the normal landing area. He therefore decided to initiate a go-around. Full power was applied and, when established with a positive rate of climb, the landing gear was selected up and the flaps retracted to 16°. The aircraft climbed to 1,500 feet, the flaps were retracted and the crew were given radar vectors for a second ILS approach to runway 27. The commander described the second approach as being more stable and on the correct 3° glide path throughout. The drift angle this time was between 30° and 40° from the inbound track. The crew had correctly calculated the TTS as 96 kt with 40° of flap and 106 kt when using 26.5° of flap. The 40° flap TTS of 96 kt was displayed on the landing data card on the flight deck. The aircraft was cleared to land by ATC approximately three minutes before the actual touchdown. The surface wind was passed as '180°/18 kt with the runway surface wet'. Nineteen seconds before touchdown ATC transmitted the surface wind as '190°/20 kt\". The first officer stated that the indicated airspeed (IAS) had been 120 kt 'down the slope' and 110 kt as the aircraft crossed the threshold. The commander stated that the aircraft crossed the threshold, with 26.5° of flap selected, at the correct height with the projected touchdown point in the normal position. Both pilots stated that during the flare, at a height estimated by the commander to be between 10 to 15 feet above the runway, the aircraft appeared to float. The commander reduced the engine torques to zero. The aircraft then continued to descend and touched down, according to the commander, 'a little beyond the normal point, left main wheel first followed by the right and then the nose wheel'. Several fireman however, who were on standby in their vehicles at the airport fire station, saw the aircraft touch down. They described the touchdown point as being opposite the runway fire access road, i.e. with 750 meters to 900 meters of runway remaining. After touchdown the commander selected ground fine pitch on both engines but neither the first officer, the No 1 cabin attendant, who was seated at the rear of the aircraft, nor several of the passengers were aware of the normal aerodynamic braking noise from the propellers. The first officer selected the flaps up and, with the commander having called 'your stick', applied full left (into wind) aileron. It is normal for the PNF to then call '5 lights (indicating that both propellers were in ground fine pitch), TGTs (turbine gas temperatures) stable and flaps traveling'. The first officer can recall seeing five lights but stated that he did not make the normal call. The commander applied full right rudder and braking; applying maximum braking on the right side to keep the aircraft straight. The first officer described the commander as 'standing up in his seat' whilst applying full right rudder. As the aircraft traveled down the runway it felt to the crew as if it was 'skidding or floating with ineffective brakes'. The first officer did not assist with the braking. Sixteen seconds into the ground roll the aircraft started to turn uncontrollably to the left. Realizing that the aircraft would leave the paved surface the commander instructed the first officer to transmit a 'Mayday' message. The aircraft overran the end of the runway and entered the grass to the left of the extended center-line at a speed estimated by the crew to be 60 kt. It then impacted and crossed a narrow earth bank before stopping in an adjacent field.", "probable_cause": "The following causal factors were identified:\r\n- The commander decided to continue with the landing knowing that touchdown was beyond the normal point,\r\n- The commander was not aware at touchdown that the crosswind component of the surface wind affecting the aircraft exceeded the Flight Manual limit,\r\n- The commander could not apply maximum braking to both main landing gear brakes at the same time as maintaining directional control through differential braking and full rudder application."}