{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-wentworth", "date": "Oct 26, 2010 at 0708 LT", "type": "Piper PA-31-310 Navajo", "operator": "Prive1", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "31-7912069", "yom": 1979, "flight_number": null, "city": "Wentworth", "zone": "South Yorkshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7952, "captain_hours_type": 533, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was landing at a private strip at Wentworth. The runway was oriented 110/290° and had several level changes along its length which required all landings to be made in the 110° direction and all takeoffs in the 290° direction. Touchdown was required to take place on a level portion before the ground rose relatively steeply and levelled out again. The final part of the runway sloped gently down towards the end, which was bordered by a dry stone wall. The surface, from police photographs taken soon after the accident, showed it to be closely mown grass and firm, despite the indications of recent rain. The wind at the time was 220°/10 kt and the pilot reported that the approach was made directly into the setting sun, making it difficult to monitor the airspeed indicator. Touchdown was achieved on the first level portion of the runway and the brakes were applied very soon afterwards; however the pilot stated that there was no discernible braking action, despite applying firmer pressure on the brake pedals. Seeing that the stone wall at the end of the runway was approaching, he steered the aircraft to the right and towards a hedge, however he was unable to prevent the left wing striking the walland causing severe damage outboard of the engine. The pilot was uninjured and evacuated the aircraft normally. The police photographs indicate that the mainwheels were skidding on the wet grass almost throughout the landing roll of about 630 metres. Whilst the pilot acknowledged that his airspeed might have been somewhat high, he did not feel at the time of touchdown that his ground speed was unusual and he attributes the lack of braking action to the slippery runway surface.", "probable_cause": null}