{"url": "https://www.baaa-acro.com/crash/crash-dornier-do228-201-eket", "date": "Feb 26, 1992 at 1056 LT", "type": "Dornier DO228", "operator": "Pmas", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lagos - Eket", "msn": "8012", "yom": 1983, "flight_number": null, "city": "Eket", "zone": "Akwa Ibom", "country": "Nigeria", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2819, "circumstances": "The Dornier 228 originated from Lagos (LOS) at 07:00 UTC. Destination was Eket. Enroute, the captain briefed his copilot that the wind was northerly at 2 knots. He decided to use runway 19. He also briefed that they would descend to the Minimum Descent Altitude (MDA) of 500 ft. and if they did not have the field in sight by then, they would carry out a missed approach, maintain runway heading and climb to 1,500 ft. From Lagos, they were cruising at 11,000 ft. and started the descent at about 77 nm from Port Harcourt, which was close to Eket. On clearance to 5000 ft by Port Harcourt Approach Control, the crew called Eket Control who descended them to 3,500 ft. At about 10 nm from Eket the NDB frequency was picked up and the crew informed Eket that they were leaving 3500ft for 1500. When the aircraft came overhead the NDB they shot the approach. On the outbound leg of 195 they turned 45° for a right procedure turn and still maintaining 1500ft. Flap 1 was selected with the speed lever set in the high RPM position. With the runway inbound on track 105 magnetic, the landing gear was selected in the down position and the aircraft was descended to 500ft. After 90 seconds into the final approach on runway 01, the co-pilot called out \"runway-in-sight\" but the captain thought the aircraft was high, so he announced he was overshooting, whereas, while giving evidence the co-pilot said she advised the overshoot when the ADF needle swung. Another approach was attempted. They came back to the same runway 01 to maintain the MDA and the runway was sighted from about 2 miles out at 400 feet height. The co-pilot thought the aeroplane was high and called for a missed approach. Then another landing attempt was made for runway 19. At about between 600 - 700 feet height above the approach path, the captain instructed his co-pilot \"when you see the field, give me flaps 2, I am going to land\". As soon as the co-pilot sighted the runway at about 2nm out, she selected flap 2. The captain descended for the field and while they came over the threshold, the speed was between 95 and 98 knots. Height above threshold was 300ft; the co-pilot felt that the aeroplane was high, but she thought that at flap 2 the aircraft was committed to land. This time the First Officer did not warn the captain though she felt that the aircraft was high. The captain said that he descended fast from 300ft with the target aim of touching down at about the 6th centre line marking from the threshold. After the touchdown, the captain applied reverse pitch but no effect of the deceleration was felt. He then moved the throttle levers to the maximum reverse position, yet there was no deceleration effect. The next action was to go on the brakes while the aircraft still had the rolling speed of about 80 knots. The captain felt that only the right brakes were effective because-the aeroplane skidded to the right; when there was no directional control, the captain said that he then used the opposite rudder for control. The commander was still fighting with the directional control when the aeroplane overran the end of the paved way at about 40 knots with the brakes still applied. The airplane sustained damage to the wheels and propellers. The fuselage was buckled just forward of the left wing leading-edge and at the fuselage/wing rear attachment point. Also the right hand side of the fuselage had bucklings at the forward section.", "probable_cause": "The accident was probably caused by the failure of the crew to accord due considerations and proper planning to the prevailing weather conditions. This resulted in a long landing, which extended into the unsuccessful braking action. The contributory factor to the accident was the emergence of communication breakdown and non display of professional airmanship within the cockpit area. The crux of that discord is the company's recommendation to seat a trainee officer on the left seat for at least 100 flying hours. This decision was not verbally resisted by the senior trainee captain but the aura existed everywhere and this led to the animosity within the cockpit."}