{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-santee-4-killed", "date": "Dec 27, 2021 at 1914 LT", "type": "Learjet 35", "operator": "Aeromedevac", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "City", "schedule": "Santa Ana - Santee", "msn": "35A-591", "yom": 1985, "flight_number": null, "city": "Santee-Gillespie Field", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On December 27, 2021, about 1914 Pacific standard time, a Gates Learjet Corporation 35A, N880Z, was destroyed when it was involved in an accident near El Cajon, California. The 2 pilots, and 2 flight nurses were fatally injured. The airplane was operated as a Title 14 Code of Federal Regulations Part 91 repositioning flight. Earlier in the day, the flight crew had flown from Lake Havasu City Airport (HII), Lake Havasu, Arizona, to John Wayne / Orange County Airport (SNA), Santa Ana, California, for a patient transfer. They departed SNA about 1856 to reposition to their home base at Gillespie Field (SEE), El Cajon, California. Review of preliminary communication recordings revealed that at 1908:23, the pilot contacted the SEE Air Traffic Control Tower (ATCT) and reported to the controller they were on the GPS approach to runway 17. The controller issued the current wind and cleared the pilot to land on runway 17. At 1912:03, the pilot reported the airport in sight and requested to squawk VFR. The controller did not acknowledge the request to squawk VFR, however, he reissued the landing clearance for runway 17. At 1912:13, the pilot requested to land on runway 27. The controller asked the pilot if they wanted to cancel their IFR flight plan, to which the pilot replied, “yes sir.” The controller acknowledged that the IFR cancelation was received and instructed the pilot to overfly the field and enter left traffic for runway 27R and cleared them to land runway 27R. At 1912:30, the pilot requested that the runway lights for runway 27R be increased, however, the controller informed them that the lights were already at 100 percent. Preliminary Automatic Dependent Surveillance-Broadcast (ADS-B) data showed that after departure from SNA, the flight made a left turn out over the waters of the Pacific Ocean and flew generally south – southeast along the coast and ascended to a cruise barometric altitude of about 11,000 ft sea level (MSL). After the flight passed Carlsbad, California, the airplane turned left and began to descend toward SEE. As shown in figure 1, ADS-B data showed that the airplane overflew SEE at a barometric altitude of about 775 ft MSL (407 ft above ground level) and entered a left downwind for runway 27R. While on the downwind leg, the airplane descended to a barometric altitude of 700 ft MSL, then ascended to a barometric altitude of 950 ft MSL while on the base leg. The last recorded ADS-B target was at 1914:09, at a barometric altitude of 875 ft MSL. Examination of the accident site revealed that the airplane struck a set of power lines and subsequently impacted the yard of a residential home about 1.43 nautical miles east of the approach end of runway 27R. The airplane came to rest upright on a heading of about 118°, at an elevation of about 595 ft msl. The wreckage debris path was oriented on a heading of about 310° and was about 186 ft long and 90 ft wide. All major structural components of the airplane were located throughout the wreckage debris path. The wreckage was recovered to a secure location for further examination. At 1855, recorded weather data at SEE showed weather conditions were variable wind at 5 knots, visibility of 3 statute miles, mist, broken cloud layer at 2,000 ft, overcast cloud layer at 2,600 ft,  temperature of 10° C, dew point temperature of 8° C, and an altimeter setting of 29.98 inches of mercury. No precipitation was indicated. At 1955, SEE reported a variable wind of 5 knots, visibility 3 statute miles, mist, broken cloud layer at 1,100 ft, overcast cloud layer at 2,600 ft, temperature of 10°C, dew point temperature of 8°C, and an altimeter setting of 29.96 inches of mercury. No precipitation was indicated.", "probable_cause": null}