{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-75-dl-salisbury-2-killed", "date": "Nov 22, 1961 at 1102 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Rhodesian Air Services", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Salisbury - Livingstone - Elizabethville", "msn": "19351", "yom": 1943, "flight_number": null, "city": "Harare", "zone": "Harare Province", "country": "Zimbabwe", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6023, "captain_hours_type": 4620, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 18716, "circumstances": "The aircraft was on a charter flight to Livingstone to pick up United Nations troops (34 Swedish blue helmets) on leave and take them back to Elizabethville. It took off from Salisbury Airport, and shortly after take-off suddenly dipped its right wing. After a slow recovery, it climbed away to between 100 - 150 ft and then went into a turn to the left with the port propeller windmilling. This turn continued to get steeper until the aircraft rolled over and dived inverted to the ground less than 600 yd southeast of the threshold of runway 06. Fire broke out but was quickly extinguished. The pilot and co-pilot were killed as a result of the accident, and the stewardess was seriously injured. No passengers were aboard the flight. The accident occurred at 0902 hours GMT.", "probable_cause": "The accident was caused by failure of the pilot to execute a successful single engine forced landing after concluding that there had been a power loss in the port engine. Evidence indicated that a failure of the port engine did not, in fact, occur. The pre-take-off rudder trimmer check was not carried out correctly as laid down in the checklist, and the aircraft took off with full left rudder trim applied. Once airborne this was misinterpreted as port engine failure, and the port propeller was feathered. No apparent action was taken by the pilot to correct the ensuing critical speed yaw."}