{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-near-cartwright-2-killed", "date": "May 26, 2010 at 0930 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "North%20Wind%20Aviation", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Goose Bay - Cartwright - Black Tickle - Goose Bay", "msn": "31-7405233", "yom": 1974, "flight_number": null, "city": "Cartwright", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 9000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Aircraft departed on a round trip flight from Goose Bay to Cartwright and Black Tickle before returning to Goose Bay, Newfoundland and Labrador. The pilot was to deliver freight to Cartwright as well as a passenger and some freight to Black Tickle. At approximately 0905, the pilot made a radio broadcast advising that the aircraft was 60 nautical miles west of Cartwright. No further radio broadcasts were received. The aircraft did not arrive at destination and, at 1010, was reported as missing. The search for the aircraft was hampered by poor weather. On 28 May 2010, at about 2200, the aircraft wreckage was located on a plateau in the Mealy Mountains. Both occupants of the aircraft were fatally injured. The aircraft was destroyed by impact forces and a post-crash fire. There was no emergency locator transmitter on board and, as such, no signal was received. \n", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The pilot conducted a visual flight rules (VFR) flight into deteriorating weather in a mountainous region.\r\n2. The pilot lost visual reference with the ground and the aircraft struck the rising terrain in level, controlled flight. \r\nFindings as to Risk:\r\n1. When an aircraft is not equipped with a functioning emergency locator transmitter (ELT), the ability to locate the aircraft in a timely manner is hindered.\r\n2. Not applying current altimeter settings along a flight route, particularly from an area of high to low pressure, may result in reduced obstacle clearance.\r\n3. Without a requirement for terrain awareness warning systems, there will be a continued risk of accidents of this type. \n"}