{"url": "https://www.baaa-acro.com/crash/crash-cessna-404-titan-davis-monthan-afb", "date": "Nov 26, 1992 at 1915 LT", "type": "Cessna 404 Titan", "operator": "Tucson Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Davis Monthan - Davis Monthan", "msn": "404-0107", "yom": 1977, "flight_number": null, "city": "Davis-Monthan AFB", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4981, "captain_hours_type": 685, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4011, "circumstances": "During a 2 hour and 40 minute training mission, the pilot maintained a low power setting with the fuel mix at full rich. After the mission, the pilot climbed the airplane to 9,000 feet agl to clear obstacles between his location and his destination. During the descent, the pilot said he reduced power more rapidly than usual and descended faster than normal at about 180 kias. About 800 to 1,000 feet agl, in the traffic pattern, the pilot applied power. Both engines lost total power. He set up an 85 kias glide; competed emergency procedures; and retracted the landing gear. The engines did not restart. He did not feather the propellers. He extended the landing gear prior to touchdown. The pilot said he did not flare the airplane during landing which resulted in the airplane colliding with the ground. The engine manual and the poh recommend adjusting the fuel mixture for cruise. An engine manual note states long descents at low power should be avoided because the engines may cool excessively and may not accelerate satisfactorily when power is reapplied. The poh recommends feathering propellers and gliding at 120 kias for dual engine failure. Soot was noted on all spark plugs during engine exam. Both engines started and ran normally from idle to full acceleration during the exam. ", "probable_cause": "The pilot's inflight decision to deviate from the airplane's engine manual and the pilot's operating handbook by maintaining the fuel mixture at full rich throughout the mission and rapidly descending the airplane which resulted in both engine's losing total power. Factors in this accident were:\r\n1) the pilot not following the emergency procedure for both engines failing as outlined in the pilot's operating  handbook, and\r\n2) the pilot not performing a flare during the landing sequence which resulted in the airplane colliding with the terrain."}