{"url": "https://www.baaa-acro.com/crash/crash-cessna-t303-crusader-mt-piz-ault-5-killed", "date": "Feb 21, 1993 at 1037 LT", "type": "Cessna 303 Crusader", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Lugano - Bielefeld", "msn": "303-00207", "yom": 1983, "flight_number": null, "city": "Piz Ault", "zone": "Graubünden", "country": "Switzerland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 3296, "captain_hours_type": 650, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1361, "circumstances": "The twin engine aircraft departed Lugano-Agno Airport at 1037LT on a private flight to Bielefeld, carrying four passengers and one pilot. The aircraft continued to the north and climbed to the assigned altitude of 15,000 feet that was maintained until over Ambri. Then, the aircraft lost 500 feet and its speed varied between 150 and 95 knots. ATC instructed the pilot to climb to FL150 when three minutes later, the aircraft lost 800 feet then disappeared from radar screens. The wreckage was found two days later on the southern slope of Mt Piz Ault, Graubünden. The aircraft was totally destroyed by impact forces and all five occupants were killed. At the time of the accident, weather conditions were poor with a northerly wind gusting to 50 knots and a visibility reduced to 200 metres due to snow falls. Severe icing conditions were reported with significant atmospheric turbulences on airway A9. ", "probable_cause": "The accident was the consequence of the following: \r\n- Wrong estimation of weather conditions on part of the pilot actualized in the Alps area, \r\n- The pilot decided to continue the flight into weather conditions that exceeded the aircraft's power and the pilot's capabilities,\r\n- The total weight of the aircraft was 210 lbs above the maximal permissible weight,\r\n- It is possible that the pilot's attention was diverted because a non fixed GPS system was turning around in the cockpit due to turbulences. "}