{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-stancuta-1-killed", "date": "Aug 1, 2015 at 0805 LT", "type": "PZL-Mielec AN-2", "operator": "Aero%20West", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "Yes", "site": "Plain, Valley", "schedule": null, "msn": "1G197-44", "yom": 1982, "flight_number": null, "city": "Stăncuța", "zone": "Brăila", "country": "Romania", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6577, "circumstances": "The history of occurrence was established based on the witnesses’ statements. On 31.07.2015, the aircraft AN-2 registered YR-PEG was positioned on a flight field in the vicinity of the farm in Stӑncuţa commune, Brăila County, being prepared in order to perform several aviochemical flights in Giurgeni area on the following day. In the morning of 01.08.2015, the pilot and the aeronautical technical staff from his team were informed by the beneficiary of aviochemical works that, because it was raining in Giurgeni area, they will perform some aviochemical flights in Stӑncuţa area, in the vicinity of the flight field. Consequently, the aircraft was prepared for the flight in the area as follows: 200 l of gasoline were defueled from the aircraft tanks, the engine was started and the operating parameters were checked according to the specific diagram. The aircraft was supplied with chemical substances for the aerial work and after only a few minutes, the engine was started again, in order to take-off. Onboard there were the pilot and an aeronautical technician (hereinafter referred to as passenger) who occupied the pilot's seat on the right. The take-off on the S-N direction was normal in the first part. The take-off run was short – approximately 100 m, in the witnesses’ opinion – under the conditions of a gusty wind from the E direction, whose speed was gradually increasing. During the initial climb, at a height of about 15-20 m, the aircraft began to lean to the left and descend slightly. During this turn in descent, bank angle continued to increase, the aircraft flying with the left wing at very low height above the aircrafts parked towards the northern end of the flight field. Considering the aircraft evolution and observing that the pilot was not acting for correction, the passenger onboard on the right-hand pilot seat, tried instinctively to turn the aircraft control yoke to the right. According to his statement, he failed to operate the control yoke, considering that this was in a blocking state of which nature he could not specify. With the engine still running in take-off mode, the aircraft continued to descend, and after passing the parked aircrafts, it hit the ground with the propeller and the left wing tip. The impact of the wing tip determined the aircraft to pivot to the left and make a hard contact with the ground. The engine stopped because of the shock. An early fire was extinguished by witnesses arrived at the accident site. Amid the destruction of the cockpit and fuselage, the pilot was thrown out of the aircraft suffering serious injuries. The passenger, who occupied the right-hand seat, managed (after recovering from the shock) to exit the aircraft wreckage. The pilot and passenger were transported to the hospital. Later on, the pilot died due to multiple traumatic injuries, and the passenger required a long hospitalization period due to the injuries suffered. The aircraft was totally destroyed. There was no other damage in the area.", "probable_cause": "The probable causes of this accident are the following:\r\n- Temporary incapacitation of the pilot,\r\n- Use of flaps upon take-off in the conditions of deterioration/modification of weather conditions during take-off (wind direction and speed),\r\n- Aircraft operation with incomplete crew."}