{"url": "https://www.baaa-acro.com/crash/crash-learjet-60-zihuatanejo", "date": "Nov 16, 2015 at 1622 LT", "type": "Learjet 60", "operator": "Servicios%20A%C3%A9reos%20Estrella", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Toluca - Zihuatanejo", "msn": "60-202", "yom": 2001, "flight_number": null, "city": "Zihuatanejo", "zone": "Guerrero", "country": "Mexico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7673, "captain_hours_type": 1360, "copilot_hours": 9592, "copilot_hours_type": 3100, "aircraft_hours": 3676, "circumstances": "The crew departed Toluca Airport on a positioning flight to Zihuatanejo. Following an uneventful flight, the crew was cleared for a VOR approach to runway 26. Due to the formation of clouds in the vicinity of the airport, ATC changed the clearance and instructed the crew for a VOR/DME approach to runway 08. Following an unstabilized approach, the aircraft landed on a wet runway. After touchdown, the aircraft skidded and veered off runway to the left. In a grassy area, the left main gear impacted a concrete block hosting the electrical system for the runway and was torn off. Then the aircraft slid for few dozen metres before coming to rest. Both pilots evacuated safely and the aircraft was damaged beyond repair.  ", "probable_cause": "Runway excursion due to loss of directional control of the aircraft during the landing run on an unstabilized approach.\r\nThe following contributing factors were identified:\r\na) Unstabilized approach,\r\nb) Adverse atmospheric conditions in the \"W\" area of the airport,\r\nc) Change of designation of runway in use for landing,\r\nd) Lack of adherence to standard operating procedures \"SOPS\",\r\ne) Lack of adherence to the concepts of \"CRM\" resource management in the cockpit,\r\nf) Decreased situational awareness on the part of the commander of the aircraft,\r\ng) Flying the approach and descent visually, following an IFR descent within IMC conditions (Instrument Meteorological Conditions),\r\nh) Wet track,\r\ni) Lack of crew coordination,\r\nj) Poor judgement and incorrect decision,\r\nk) Existence of a concrete marker with a level of 10cms protruding above the road surface in the runway safety zone."}