{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-219-bishkek-65-killed", "date": "Aug 24, 2008 at 2044 LT", "type": "Boeing 737-200", "operator": "Itek%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bichkek - Tehran", "msn": "22088/676", "yom": 1980, "flight_number": "IRC6895", "city": "Bishkek-Manas", "zone": "Bishkek City", "country": "Kyrgyzstan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 85, "pax_fatalities": 65, "other_fatalities": 0, "total_fatalities": 65, "captain_hours": 18250, "captain_hours_type": 2337, "copilot_hours": 4531, "copilot_hours_type": 881, "aircraft_hours": 60014, "circumstances": "On 24 August, 2008 the Boeing 737-200 aircraft registered ЕХ-009 and operated by a crew including a PIC and a Co-pilot of Itek Air was flying a scheduled passenger flight IRC 6895 from Bishkek to Tehran. Also on board there was the cabin crew (3 persons) as well as 85 passengers including two service passengers: a maintenance engineer and a representative of the Iran Aseman Airlines. Flight IRC 6895 was executed in compliance with the leasing agreement No. 023/05 of 15 July, 2005 for the Boeing 737-200 ЕХ-009 between the Kyrgyz airline, Itek Air, and the Iran Aseman Airlines. The crew passed a medical examination in the ground medical office of Manas Airport. The crew did not have any complaints of their health. The crew received a complete preflight briefing. The weather at the departure airport Manas, the destination airport and at alternate aerodromes was favourable for the flight. Total fuel was 12000 kg, the takeoff weight was 48371 kg with the CG at 24,8% MAC, which was within the B737-200 AFM limitations. After the climb to approximately 3000 m the crew informed the ATC about a pressurization system fault and decided to return to the aerodrome of departure. While they were descending for visual approach the aircraft collided with the ground, was damaged on impact and burnt. As a result of the crash and the following ground fire 64 passengers died. The passenger who was transferred on 29 August, 2008 to the burn resuscitation department of the Moscow Sklifasovsky Research Institute died of burn disease complicated by pneumonia on 23 October, 2008, two months after he got burn injuries. Thus, his death is connected with the injuries received due to the accident.", "probable_cause": "The cause of the Itek Air B737-200 ЕХ-009 accident during the air-turn back due to the cabin not pressurizing (probably caused by the jamming of the left forward door seal) was that the crew allowed the aircraft to descend at night to a lower than the minimum descent altitude for visual approach which resulted in the crash with damage to the aircraft followed by the fire and fatalities. The combination of the following factors contributed to the accident:\r\n- Deviations from the Boeing 737-200 SOP and PF/PM task sharing principles;\r\n- Non-adherence to visual approach rules, as the crew did not keep visual contact with the runway and/or ground references and did not follow the prescribed procedures after they lost visual contact;\r\n- Loss of altitude control during the missed approach (which was performed because the PIC incorrectly evaluated the aircraft position in comparison with the required descent flight path when he decided to perform visual straight-in approach);\r\n- Non-adherence to the prescribed procedures after the TAWS warning was triggered. "}