{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-500b-mt-steens-2-killed", "date": "Aug 11, 2010 at 0855 LT", "type": "Rockwell Aero Commander 500", "operator": "Frank N. Vessels", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Redding - Butte", "msn": "500-1248-73", "yom": 1962, "flight_number": null, "city": "Mt Steens", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1360, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5375, "circumstances": "The evening prior to the accident, the pilot acquired a computer generated text weather briefing. On the day of the accident, the pilot acquired another computer generated text weather briefing, and then contacted the Flight Service Station (FSS) for an interactive telephonic weather briefing. The information provided in all three briefings indicated that a flight on a direct route between the pilot's point of departure and his planned destination would take him through an area of forecast rain showers, thunderstorms, and cloud tops significantly higher than his intended en route altitude. Although the FSS briefer recommended an alternate route, for which he provided weather information, after departure the pilot flew directly toward his destination airport. While en route, the pilot, who was not instrument rated, encountered instrument meteorological conditions, within which there was an 80 percent probability of icing. After entering the area of instrument meteorological conditions, the airplane was seen exiting the bottom of an overcast cloud layer with a significant portion of its left wing missing. It then made a high velocity steep descent into the terrain. A postaccident inspection of the airplane's structure did not find any evidence of an anomaly that would contribute to the separation of the wing structure, and it is most likely that the wing section separated as a result of the airplane exceeding its structural limitations after the pilot lost control in the instrument meteorological conditions.\n", "probable_cause": "The non-instrument rated pilot's improper decision to continue flight into an area of known instrument meteorological conditions and his failure to maintain control of the airplane after entering those conditions."}