{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-mccook-2-killed", "date": "Jan 26, 1994 at 1515 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Sky Harbor Air Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Denver - Columbus", "msn": "421C-0215", "yom": 1976, "flight_number": null, "city": "McCook-Ben Nelson", "zone": "Nebraska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2550, "captain_hours_type": 66, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5837, "circumstances": "The part 135 on-demand air taxi flight departed Denver, Colorado, with a destination of Columbus, Nebraska. Weather forecasts were for icing conditions along the entire route of flight. While en route, ATC advised the pilot of reported icing ahead. The pilot was cleared to climb to 19,000 feet to get on top of the clouds. The pilot reported 'some alternator problems,' and requested to divert to North Platte, Nebraska. He then elected to divert to McCook, Nebraska, due to the weather at North Platte. ATC lost communication with the pilot during the diversion. Witnesses reported the airplane circled the McCook Airport twice. According to them, the airplane entered a bank of about 45°, then stalled. Subsequently, it traveled about 190 feet through a stand of trees before coming to rest. Witnesses reported the airplane was covered with ice. One-half inch of mixed ice was found on a piece of windshield. Both alternators had one phase in the stator winding shorted.", "probable_cause": "Improper in-flight planning/decision by the pilot, and the accumulation of airframe ice, which resulted in an inadvertent stall. Factors associated with the accident were: partial failure of both alternators, which resulted in a subsequent electrical system failure and an inoperative anti-ice/de-ice system, adverse weather (icing) conditions, and airframe (wing) ice."}