{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-331c-tokyo", "date": "Oct 23, 1981 at 0019 LT", "type": "Boeing 707", "operator": "TMA%20Cargo-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tokyo - Bangkok", "msn": "19213/613", "yom": 1967, "flight_number": "MV332", "city": "Tokyo-Narita", "zone": "Kantō", "country": "Japan", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5000, "captain_hours_type": 270, "copilot_hours": 2461, "copilot_hours_type": 2262, "aircraft_hours": 37873, "circumstances": "After takeoff from Tokyo-Narita Airport while on a cargo flight to Bangkok, the crew reported technical problems with the engine n°3 after the n°6 carbon seal was worn, causing a loss of lubrication. The crew was cleared to return for an emergency landing but weather conditions were marginal and the visibility was limited. Following an approach to runway 16, the airplane was too high and passed over the threshold at a height of 500 feet. The crew continued the descent and the aircraft landed 1,700 meters past the runway threshold and bounced. After reverse thrust was applied on engine n°1, 2 and 4, the airplane veered off runway and struck a manhole, causing the nose gear to collapse. The airplane came to rest and was damaged beyond repair while all three crew members were uninjured. At the time of the accident, wind was from 210 to 350°, 11 knots gusting to 34 knots, visibility 2,200 meters, RVR 900 meters for runway 16 with heavy rain falls and fog. ", "probable_cause": "The accident was the consequence of the combination of the following factors: \r\n- Unfavorable weather conditions, \r\n- Wrong runway selection according to wind component and weather,\r\n- Wrong approach configuration, \r\n- The crew failed to initiate a go-around, \r\n- The crew misunderstood ATC instructions. "}