{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-ii-norwich-2-killed", "date": "Dec 2, 1993 at 1341 LT", "type": "Piper PA-31 Cheyenne", "operator": "Airwork - USA", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Plain, Valley", "schedule": "Easton - Des Moines - Hayward", "msn": "31-7720023", "yom": 1977, "flight_number": null, "city": "Norwich", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5200, "captain_hours_type": 3, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6685, "circumstances": "En route at FL240, the plane entered a left spiraling descent and subsequently experienced an inflight break-up at 7,000 feet with separation of outboard wings, tail sections and internal vinyl from the nose baggage door. There was no distress call. Witnesses heard the engines and an explosive sound, then they saw the plane in a spin, trailed by falling debris. Debris was strewn over a distance of about 3.5 miles. Light weight pieces including vinyl from the baggage door, wing skin, and tail skin pieces were among the 1st debris on the wreckage path. Tail sections were found about 2.5 miles from the main wreckage with evidence of overload failure; pieces of the wings were found with evidence of downward/overload separation. No preexisting airframe failure was found that would have led to loss of control, inflight breakup, loss of pressurization or hypoxia. The plane was inactive for about 2 years before being purchased 2 months before accident. Last annual inspection was on 6/8/92. Icing was forecast from 9,000 feet to 17,000 feet msl; turbulence was forecast below 8,000 feet msl. Both occupants were killed. ", "probable_cause": "the pilot's loss of aircraft control for an unknown reason, and subsequent flight that exceeded the design stress limits of the airplane, which resulted in an in-flight airframe breakup."}