{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690a-guthrie-2-killed", "date": "Feb 12, 1995 at 1721 LT", "type": "Rockwell Grand Commander 690", "operator": "Thomas M. McMullen", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Wichita - Oklahoma City", "msn": "690-11322", "yom": 1976, "flight_number": null, "city": "Guthrie", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2870, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane impacted terrain approx 14 miles from the destination during a descent. According to radar data and meteorological information, the airplane descended from 16,700 feet to 3,700 feet agl through clouds and icing conditions. During the descent, the airplane decelerated from 268 kts to 92 kts ground speed. The pilot reported to approach that he 'broke out' of the clouds at 5,400 feet. He subsequently informed approach that he had accumulated 'some clear and rime ice' during the descent. 13 seconds later the pilot made a distress call and stated, 'we're in trouble, we're going down.' The last radar track showed the airplane descending through 3,700 feet at a ground speed of 92 kts. A witness reported he observed that the airplane 'appeared to be doing tricks', and 'then headed straight down in a spin.' An airmet for icing conditions was in effect along the airplane's route of flight. Also, there were several pilot reports of icing encountered in the area of the accident. The pilot did not request a weather briefing prior to, or during the flight.", "probable_cause": "The pilot's failure to maintain adequate airspeed due to airframe ice, which resulted in a loss of control. Factors contributing to the accident were the pilot's continued flight into adverse weather, his failure to obtain weather information either before or during the flight, and the icing conditions."}