{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-54f-sainte-therese-de-blainville-118-killed", "date": "Nov 29, 1963 at 1833 LT", "type": "Douglas DC-8", "operator": "TCA", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Montreal - Toronto", "msn": "45654", "yom": 1963, "flight_number": "TCA831", "city": "Sainte-Thérèse-de-Blainville", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 111, "pax_fatalities": 111, "other_fatalities": 0, "total_fatalities": 118, "captain_hours": 17206, "captain_hours_type": 561, "copilot_hours": 8302, "copilot_hours_type": 390, "aircraft_hours": 2174, "circumstances": "The Douglas DC-8 aircraft was on a regular scheduled flight Montreal-Dorval Airport (YUL) to Toronto (YYZ), Canada, scheduled to leave Montreal at 18:10. There were some delays in the boarding of the passengers and Flight 831 started its takeoff roll on runway 06R at approximately 18:28. Weather was reported as overcast, light rain and fog, visibility 4 miles, surface wind NE at 12 mph. The flight was instructed to report passing 3000 feet and 7000 feet on the climb-out from the airport. The aircraft took off normally, reported in at 3,000 feet and acknowledged a clearance for a left turn to St. Eustache. This was the last radio contact with the flight. The aircraft then deviated from its normal flight path about 55 degrees to the right and began a quick descent. At 18:33, 16.9 miles from the airport, the DC-8 struck the ground at a speed of 470-485 knots descending at an angle of about 55 degrees (+/- 7deg). The airplane plunged into the ground and totally disintegrated upon impact. There were no survivors among the 118 occupants. ", "probable_cause": "It is concluded that the actual cause of the accident cannot be determined with certainty. It is concluded that the most probable chain of events which occasioned the crash can be identified as follows. For one of the reasons which are set forth below, the pilot applied the near maximum available Aircraft Nose Down Trim to the horizontal stabilizer. The aircraft then commenced a diving descent building up speed at such a rate that any attempted recovery was ineffective because the stabilizer hydraulic motor had stalled, thus making it impossible within the altitude available to trim the aircraft out of the extreme AND position.\r\n(a) The first reason which might have indicated to the pilot the necessity for applying, nose down trim could have been icing of the Pitot system as discussed in the Analysis of Evidence. While the experience and competency of the crew would likely have led them to recognize the fault in time to take corrective action, the possibility that this condition caused the application of AND trim cannot be dismissed.\r\n(b) The second reason could have been a failure of a vertical gyro. The evidence indicated that it was possible to have a failure of a vertical gyro without an associated warning flag. If such a failure occurred and the aircraft was being flown with reference to the associated artificial horizon instrument it is likely that the pilot would be misled by the erroneous indication and could have applied nosedown trim. Aircraft CF-TJN was equipped with a standby artificial horizon located on the Captain's instrument panel and this cross reference together with the experience and competency of the crew would likely have led them to recognize the fault in time to take corrective action. Again, the possibility that this condition caused the application of AND trim cannot be dismissed.\r\n(c) The third reason could have been an unprogrammed and unnoticed extension of the Pitch Trim Compensator. This would have had the effect of moving the control column back, the elevators up and the aircraft to a nose up condition. The pilot would likely have counteracted the pitch up force of the elevators by trimming the horizontal stabilizer to or near to the limit of the Aircraft Nose Down setting. The evidence shows that the simultaneous application of up elevator from the PTC and the application of as little as 0.5 degrees of Aircraft Nose Down trim on the horizontal stabilizer has an adverse effect on aircraft stability and can create a difficult control problem. The problems of instability and control are more serious as further AND trim is applied. In aircraft CF-TJN 2.0 degrees of AND trim was available and it appears that the pilot applied at least 1.6 degrees of the available trim. It is unlikely that the flight crew were aware of the serious stability and-control problems that we now know can result from the combination of extended PTC and AND trim, even if they had been aware that the PTC had extended. The aircraft would then be in a condition where a slight displacement from its trim point would lead to divergent oscillations. In other words, a minor change. of attitude, easily caused by the existing turbulence, would build up into large displacements. The inadequate control available to the pilot and the lack of an external horizon reference would likely result in the aircraft eventually assuming a dive attitude.\r\nIt is concluded that an unprogrammed extension of the Pitch Trim Compensator is the most probable cause for the pilot having applied Aircraft Nose Down Trim, which initiated the chain of events that culminated in the crash."}