{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mayport-2-killed", "date": "Dec 20, 2018 at 0904 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Kenneth L. Reed", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Kissimmee - Princeton", "msn": "46-36253", "yom": 2000, "flight_number": null, "city": "Mayport", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 390, "captain_hours_type": 30, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3785, "circumstances": "The aircraft impacted the Atlantic Ocean near Mayport, Florida. The private pilot and pilot-rated passenger were fatally injured. The airplane was destroyed. The airplane was privately owned and operated under the provisions of Title 14 Code of Federal Regulations Part 91. Instrument meteorological conditions prevailed at the time and the flight was operating on an instrument flight rules (IFR) flight plan. The personal flight originated from Kissimmee Gateway Airport, Orlando, Florida, about 0821, and was destined for Princeton Airport, Princeton/Rocky Hill, NJ. According to preliminary air traffic control radar and voice data provided by the Federal Aviation Administration (FAA), at 0859:02, one of the airplane's occupants contacted the Jacksonville Air Route Traffic Control Center (ZJX ARTCC) R-73 sector controller and reported passing through Flight Level (FL) 220 for FL230. The controller advised the pilot there were moderate and some heavy precipitation along the route of flight extending for 200 nautical miles. The occupant acknowledged the controller and advised they would be watching the weather. FAA radar data indicated at 0900:22 the flight reached FL227. Preliminary review of weather data revealed that this altitude was above the freezing level, and at that time the flight entered an area of weather radar returns with intensities between 10 to 30 dBZ (which equated to light to moderate precipitation). While in the weather radar-indicated precipitation, the flight climbed to FL230. At 0902:14, while at the edge of the precipitation, the airplane started a slight left turn before entering a right turn at 0902:28 at FL226. The turn had not been directed by the controller or announced by either occupant. Between 0902:28 and 0903:10, the airplane descended from FL226 to FL202. At 0903:10, the airplane was descending through FL202 when the controller attempted to contact the flight, but there was no reply. The controller attempted to communicate with the flight several more times, and at 0903:27 in response to one attempt, while at 14,500 feet mean sea level (msl), an occupant advised, \"were not ok we need help.\" The controller asked the pilot if he was declaring an emergency and \"whats going on.\" At 0903:35, while at 12,600 feet msl an occupant stated, \"I'm not sure whats happening\", followed by, \"I have anti-ice and everything.\" At 0903:40 the controller asked the flight if it could maintain altitude, an occupant responded that they could not maintain altitude. The controller provided vectors to a nearby airport west of their position, but the flight did not reply to that transmission or a subsequent query. At about 0904:32 (which was the last communication from the airplane), while at 3,300 feet msl, an occupant advised the controller that the airplane was inverted and asked for assistance. The last radar recorded position with altitude read-out of the flight was at 0904:40, at an altitude of 1,700 feet msl, and 30.40069° north latitude and -81.3844° west longitude. The U.S. Coast Guard initiated a search for the missing airplane, but the wreckage was not located and the search was suspended on December 22, 2018. A privately-funded search for the airplane was initiated and the wreckage was located and recovered on February 6, 2019. The recovered wreckage was retained for further investigation.", "probable_cause": "An in-flight loss of control following an encounter with supercooled large droplet icing conditions, which ultimately resulted in an uncontrolled descent and subsequent inflight breakup. Also causal was the pilot’s failure to maintain an appropriate airspeed for flight in icing conditions."}