{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-g18s-crosbyton", "date": "Oct 6, 1997 at 1830 LT", "type": "Beechcraft G18S", "operator": "May Air Express", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Lubbock - Dallas", "msn": "BA-550", "yom": 1960, "flight_number": "MXP1061", "city": "Crosbyton", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3222, "captain_hours_type": 1328, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17974, "circumstances": "While in cruise flight at 9,000 feet MSL, the left engine began to 'run rough and lose power.' The pilot said he interpreted the problem as carburetor icing and applied carburetor heat. With the engine still running rough, the left propeller was feathered and the left engine shut down. Restart attempts were not successful. Unable to maintain altitude, the pilot requested to land at a nearby airport. After descending through IMC weather, the pilot realized that he would not make it to the airport, and executed a forced landing to rough/uneven terrain. Examination of the engines revealed that the alternate air doors were missing on the right and left engine. The hinges for the doors were attached to both carburetors and showed no evidence of distortion or impact damage. The doors were not found at the wreckage site. A missing alternate air door would allow ambient air to enter the carburetor, rendering the carburetor heating system ineffective. According to carburetor icing probability charts, the reported temperature and dew point values would be favorable to the formation of induction system icing. ", "probable_cause": "Inadequate maintenance which resulted in diminished carburetor heat effectiveness due to missing alternate air doors. Contributing were conducive carburetor icing weather conditions, low ceilings during the emergency descent, and the lack of suitable terrain for the forced landing. "}