{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-alice-town", "date": "Jun 9, 2008 at 1401 LT", "type": "Rockwell Shrike Commander 500", "operator": "Gramar 500", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Nassau – Fort Lauderdale", "msn": "500-3224", "yom": 1974, "flight_number": null, "city": "Alice Town", "zone": "Bimini", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On June 9, 2008, about 1401 eastern daylight time, an Aero Commander 500S, N501AP, registered to and operated by Gramar 500, Inc., experienced a loss of engine power in both engines and was ditched in the Atlantic Ocean about 1/2 mile south of North Bimini, Bahamas. Visual meteorological conditions prevailed in the area and a visual flight rules flight plan was filed for the 14 Code of Federal Regulations (CFR) Part 91 personal flight from Nassau International Airport (MYNN), Nassau, Bahamas, to Ft. Lauderdale Executive Airport (FXE), Ft. Lauderdale, Florida. The airplane was destroyed due to salt water immersion, and the airline transport rated pilot, the sole occupant, was not injured. The pilot stated that when the flight was past Bimini, the right engine started running rough and losing power. He turned southeast to enter a left base for runway 09 at South Bimini Airport, and the left engine also began to run rough and lost power. The pilot ditched the aircraft, evacuated into a life raft, and was rescued by a pleasure boater. The pilot also stated that 25 gallons of fuel were added while at MYNN, for a total fuel supply of 90 gallons. Both engines were test run 8 days after the accident using a test propeller. Both engines ran to near maximum RPM. One magneto from each engine was replaced prior to the test run.", "probable_cause": null}