{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900c-1-quincy-12-killed", "date": "Nov 19, 1996 at 1701 LT", "type": "Beechcraft 1900C", "operator": "United-Express-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago – Burlington – Quincy", "msn": "UC-087", "yom": 1989, "flight_number": "UA5925", "city": "Quincy-Baldwin Field", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 4000, "captain_hours_type": 700, "copilot_hours": 1950, "copilot_hours_type": 800, "aircraft_hours": 18446, "circumstances": "The Beechcraft 1900C, N87GL, was in its landing roll on runway 13, and the Beechcraft A90, N1127D, was in its takeoff roll on runway 04. The collision occurred at the intersection of the two runways. The flight crew of the Beechcraft 1900C had made appropriate efforts to coordinate the approach and landing through radio communications and visual monitoring; however they mistook a Cherokee pilot's transmission (that he was holding for departure on runway 04) as a response from the Beechcraft A90 to their request for the Beechcraft A90's intentions, and therefore mistakenly believed that the Beechcraft A90 was not planning to take off until after the Beechcraft 1900C had cleared the runway. The failure of the Beechcraft A90 pilot to announce over the common traffic advisory frequency his intention to take off created a potential for collision between the two airplanes. ", "probable_cause": "The failure of the pilots in the King Air A90 to effectively monitor the common traffic advisory frequency or to properly scan for traffic, resulting in their commencing a takeoff roll when the Beechcraft 1900C (United Express flight 5925) was landing on an intersecting runway. Contributing to the cause of the accident was the Cherokee pilot's interrupted radio transmission, which led to the Beechcraft 1900C pilot's misunderstanding of the transmission as an indication from the King Air that it would not take off until after flight 5925 had cleared the runway. Contributing to the severity of the accident and the loss of life were the lack of adequate aircraft rescue and firefighting services and the failure of the air stair door on the Beechcraft 1900C to be opened. \n"}