{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-h18-fort-lauderdale", "date": "Sep 21, 2007 at 1328 LT", "type": "Beechcraft H18", "operator": "Monarch%20Air%20Group", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Lauderdale - Nassau", "msn": "BA-701", "yom": 1964, "flight_number": null, "city": "Fort Lauderdale-Hollywood", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3700, "captain_hours_type": 450, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13066, "circumstances": "The airplane's right engine experienced a complete loss of power immediately after takeoff and the airplane began to slow. The airplane reached an altitude of approximately 91 feet above ground level and then entered an uncontrolled descent consistent with the onset of a velocity minimum control (VMC) roll to the right. No evidence of any preimpact failures or malfunctions with either the engine or airframe was discovered, and evidence at the scene indicated that the landing gear had been retracted and the right engine propeller feathered. Examination of the cockpit revealed the right engine fuel selector was positioned between the \"60 GAL RIGHT AUX\" detent and the \"RIGHT ENG OFF\" detent. Examination of the fuel system between the selector and the right engine indicated that it was in this position prior to impact. Also, placards next to the fuel selectors stated, \"WARNING POSITION SELECTORS IN DETENTS ONLY. NO FUEL FLOW TO ENGINES BETWEEN DETENTS.\" The pilot loaded the majority of the cargo and performed the weight and balance calculations. Examination of the fuselage revealed that all six cargo bins were full. The investigation also discovered that the furthest aft bin contained 265 pounds of cargo even though placarded for a maximum of 75 pounds. All other bins were loaded considerably below their maximum weight limits. Weight and balance calculations revealed the information listed on the weight and balance form produced by the pilot was erroneous and that the actual center of gravity (CG) of the airplane was rear of the aft CG limit, which would have created instability in the handling characteristics of the airplane, especially after a loss of engine power. In addition, the aft-of-limit CG would have increased the airspeed needed to prevent the airplane from entering a VMC roll. Performance calculations indicate that with the right engine having lost power immediately after takeoff, the airplane would most likely not have been able to continue the departure on one operating engine.", "probable_cause": "A total loss of engine power due to fuel starvation as a result of the pilot's failure to place the fuel selector for the right engine in the proper position. Contributing to the accident was the improper loading of the cargo."}