{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-40-dk-coalinga-32-killed", "date": "Jan 28, 1948 at 1050 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Airline Transport Carriers", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Oakland – Imperial", "msn": "16850/33598", "yom": 1945, "flight_number": null, "city": "Coalinga", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 29, "pax_fatalities": 29, "other_fatalities": 0, "total_fatalities": 32, "captain_hours": 2850, "captain_hours_type": 2200, "copilot_hours": 4205, "copilot_hours_type": 600, "aircraft_hours": 2868, "circumstances": "The flight departed from its operating base, Burbank, California, for Oakland, California, at 0646, January, 1948. According to company instructions, the crew consisting of Francis Charles Atkinson, captain; Marion Harlow Ewing, first officer; and Mrs. Francis Charles Atkinson, stewardess, were to fly NC79055, which was certificated to carry 32 passengers, however, the crew made a mistake and departed in NC36480. This airplane was certificated to carry only 26 passengers and was 7 hours overdue for a 100-hour inspection at the time of departure from Burbank. Landing at Oakland was accomplished at 0849. The trip had been routine, and somewhere between Burbank and Oakland the pilot apparently realized that he was flying the wrong airplane for he requested his landing instructions from the Oakland tower with the appropriate airplane call numbers, 480. In Oakland, 28 Mexican Nationals and one United States Immigration official were enplaned for a flight to the Imperial County Airport, Imperial County, California. This flight was to be performed under a contract which the company had with the United States Immigration and Naturalization Service. Since NC36480 had accommodations for only 26 passengers, three of the 28 Mexican Nationals who boarded the aircraft were unable to be seated where they could be secured with safety belts. According to the statement of a United States Immigration official who assisted in the loading, three pieces of unsecured luggage were in the aisle at the time of take-off, and it as probable that the three passengers were seated on this luggage after the aircraft taxied from its parking area at the Oakland Airport for take-off. The remainder of the airplane load consisted of 375 gallons of fuel. Total weight was 67 pounds in excess of the maximum allowable. No flight plan was filed for the southbound trip since clear weather conditions prevailed over the route to the Imperial County Airport. Take-off was accomplished at approximately 0930. Before leaving the Oakland tower frequency Captain Atkinson received a message from his company, relayed through the tower, that he was to return directly to Burbank. His acknowledgment of this message was the last communication received from the flight. One hour and 35 minutes after the aircraft had departed from Oakland, it was observed over the vicinity of Coalinga, California, cruising at an estimated altitude of 5,000 feet above the ground. At this time a trail of white vapor or smoke, 150 to 200 feet long, was observed streaming from the left engine of the aircraft. Ten to 15 seconds later flames were seen flowing from the left engine over the wing and back to the empennage. Seconds later the left wing and the left engine dropped free from the rest of the aircraft; and the airplane fell out of control, crashed to the ground, and burst into flames.", "probable_cause": "The Board determines that the probable cause of this accident was the failure of the left wing in flight as a result of damage by fire which had its source in a defective left engine driven fuel pump.\r\nThe following factors were considered as contributory:\r\n- The aircraft was properly certificated, but had been flown 7 hours beyond its 100-hour inspection period at the time of its take-off from Burbank, and nine hours and 44 minutes beyond its 100-hour inspection period at the time of take-off from Oakland, \r\n- Though the aircraft was certificated to carry a crew of 3 and 26 passengers, a total of 32 persons was carried on this particular flight, and the aircraft was loaded 67 pounds in excess of the maximum allowable, \r\n- The separating gasket in the left engine fuel pump showed signs of being fractured prior to the time of the last flight. The defect was latent in character, and one which might not have been found during the course of a 100-hour inspection,\r\n- Fuel escaping from the left engine driven fuel pump was ignited while the aircraft was in flight. The fire progressed into the wing panel and burned through the main spar of the left wing,\r\n- The left wing, after its main spar burned in two, failed, and the airplane dived into the ground and was destroyed by impact and fire."}