{"url": "https://www.baaa-acro.com/crash/crash-antonov-24rv-strezhevoy-7-killed", "date": "Jul 11, 2011 at 1156 LT", "type": "Antonov AN-24", "operator": "Angara%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Tomsk - Surgut", "msn": "5 73 103 02", "yom": 1975, "flight_number": "IK9007", "city": "Strezhevoy", "zone": "Tomsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 33, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 4570, "captain_hours_type": 4064, "copilot_hours": 9476, "copilot_hours_type": 5100, "aircraft_hours": 48489, "circumstances": "The twin engine aircraft departed Tomsk Airport at 1010LT on a flight (callsign IK9007/SP5007) to Surgut, carrying 33 passengers and a crew of four. About an hour and 26 minutes into the flight, the left engine's 'chips in oil' warning light came on. About eight minutes later, a burning smell was noticed in the cockpit and the captain decided to divert to Nizhnevartovsk Airport. During the descent, the left engine caught fire. Its propeller was feathered and the crew decided to divert to Strezhevoy Airport. But as the fire could not be extinguished, the captain eventually attempted an emergency landing in the Ob River. Upon landing, the aircraft broke in two and came to rest in shallow water. Seven passengers were killed while all other occupants were rescued. ", "probable_cause": "The Interstate Aviation Committee (MAK) released their final report in Russian concluding the probable causes of the accident were:\r\nThe catastrophe of the AN-24 RA-47302 occurred when ditching became necessary due to a fire in the left hand engine's nacelle. The destruction of the aircraft and loss of life was caused by collision with underwater obstacles that the crew could not anticipate or avoid. The fire in the left hand engine nacelle was caused by the fracture of a centrifugal breather releasing an air-fuel emulsion into the engine compartment as well as a delayed reaction to shut the engine down by the crew following an magnetic chip detector indication together with indications of oil pressure fluctuations, a burning smell and a low oil pressure indication. A delay in indicating engine vibrations to the crew as result of degradation of the engine vibration sensoring equipment, most likely caused by changes of the rotor speed of the engine as result of the aft bearing failure of the compressor rotor and/or misalignment of the sensor, which probably influenced the decision of the crew to shut the engine down with a delay. Cause of the fracture of the centrifugal breather was the destruction of the impeller due to prolonged exposure to hot air-fuel emulsion due to the failure of the aft compressor rotor support bearing. It was not possible to determine the cause of the destruction of the aft compressor rotor support bearing due to significant secondary damage. Most likely the destruction was caused by misalignment such as:\r\n- Incorrect assembly of support parts mating with the compressor rotor during on-condition engine repairs,\r\n- Or deviations from required geometry of support parts mating with the compressor rotor.\r\nContributing factors were:\r\n- Psychological unpreparedness of the captain to shut the engine down due to lack of experience with the aircraft on one engine inoperative\r\n- Late detection of the fire and as a consequence late attempts to extinguish the fire, it was however not possible to establish why the fire was detected late due to lack of objective information about the performance of the fire alarm systems."}