{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-savannah-5-killed", "date": "Jan 13, 1992 at 1606 LT", "type": "Cessna 421C Golden Eagle III", "operator": "J. Meade Williamson", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Milville - Sebastian", "msn": "421C-0441", "yom": 1973, "flight_number": null, "city": "Savannah", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 3064, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 0716, the pilot received a weather brief for a proposed takeoff of 1130. The FSS briefer provided info on thunderstorms forecast in GA and FL. No info was provided about forecast lines and clusters of thunderstorms in SC coastal plains and sern GA. En route, the pilot was given info about level III thunderstorms across the projected flight path by Beaufort and Savannah approach control. ATC radar data revealed that the aircraft flew the route contained in the flight plan clearance. Radio transmissions from the aircraft indicated that onboard weather radar was being used. ATC radar data and radio communications indicated that the aircraft entered a thunderstorm, then made a 180° turn to exit the storm. Examination of the wreckage revealed plastic deformation of the wings inboard of the engines in an upward direction. Also, both wings broke off outboard of the engines in a downward direction. The horizontal stab and elevator were not recovered. There was fuselage damage which indicated that the horizontal stab separated aft and down. All five occupants were killed. ", "probable_cause": "The pilot's inadequate weather evaluation, and his continued flight into known adverse weather conditions. Factors were: the improper weather briefing by a flight service station specialist, and level iii thunderstorms."}