{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-90-dl-alcoche-4-killed", "date": "Sep 10, 1962 at 0816 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Aerolineas%20Abaroa", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Caranavi – Rurrenabaque", "msn": "20230", "yom": 1944, "flight_number": null, "city": "Alcoche", "zone": "La Paz", "country": "Bolivia", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 7692, "captain_hours_type": 5500, "copilot_hours": 398, "copilot_hours_type": 155, "aircraft_hours": null, "circumstances": "The aircraft was on a non-scheduled domestic flight from Caranavi to Rurrenabaque It took off from Caranavi at 0806/10 hours local time. The aircraft flew for 7 minutes on a true heading of approximately 320°. When it was over Alcoche, 21 km from Caranavi, at an estimated altitude of 3500 - 4000 feet, ground witnesses noticed the left engine ceased functioning and that an increase of power was applied to the other engine. The aircraft was then seen to be flying with the right wing ahead of the left and a few seconds later the aircraft started turning left towards the widest part of the valley in which the aircraft was flying. During the turn the aircraft assumed an almost inverted attitude but it recovered. From the flight path described by witnesses the nose of the aircraft went up twice before going into a 180° change of direction and before crashing into the river. The aircraft struck the surface in a level attitude with a high rate of vertical descent There was no forward movement on impact. The force of impact was so great as to flatten the lower surface of the left wing and the fuselage. The floor of the fuselage was forced to the ceiling.", "probable_cause": "The primary cause of the accident was the failure of the left engine and execution of a sharp 180° turn to the left of the original flight path. This was the only possible manoeuvre since the valley ahead narrowed and a turn to the right could not be effected, because the aircraft was close to - and below the altitude of - a mountain on that side. Furthermore, this manoeuvre was the only one permitting the aircraft to reach that part of the river, which appeared most suitable for ditching."}