{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47-dl-moline-2-killed", "date": "Aug 21, 1946 at 0419 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Trans-Luxury Airlines - TLA", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago – Omaha", "msn": "4542", "yom": 1942, "flight_number": null, "city": "Moline-Quad City", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 22, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2589, "captain_hours_type": null, "copilot_hours": 3452, "copilot_hours_type": 1500, "aircraft_hours": 4121, "circumstances": "The aircraft left Chicago Airport at 0303LT bound for Omaha on a charter flight with 22 passengers and a crew of three on board. Less than one hour into the flight, while cruising at an altitude of 4,000 feet via the route Green 3, a small explosion occurred in the left engine, forcing the crew to shut this engine down and to feather the propeller. The captain informed ATC of his situation and obtained the permission to divert to Moline Airport located 35 miles from his position. On final approach to runway 22, the captain realized that his position to the runway centerline was wrong and elected to make a go around. With undercarriage and flaps down, he made a turn to the left when the left wing tip hit the ground, causing the aircraft to crash in a field. Both pilots were killed while 23 other occupants were injured, some of them seriously. The aircraft was destroyed. ", "probable_cause": "On the basis of the foregoing, the Board determines that the probable cause of the accident was the faulty execution of an emergency single engine approach following failure of the left engine in flight. A contributing factor was the failure of the pilot to exercise sufficient caution by having, a qualified mechanic determine the reasons for oil leakage in the left engine prior to departure from Chicago. Investigations revealed that the failure of the left engine was caused by a fracture of the cylinder number 5."}