{"url": "https://www.baaa-acro.com/crash/crash-cessna-207-skywagon-near-bethel-6-killed", "date": "Dec 7, 1999 at 1300 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Grant%20Aviation-2_0", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Bethel - Nightmute", "msn": "207-0347", "yom": 1976, "flight_number": null, "city": "Bethel", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 2255, "captain_hours_type": 390, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10363, "circumstances": "The airline transport pilot departed on a CFR Part 135 scheduled passenger flight to a remote coastal village. When the flight did not return, an aerial search was initiated. The wreckage was located the following day along the pilot's intended route, about 49 miles from the departure airport. The airplane had collided with flat, featureless, snow-covered, terrain. A pilot that departed about one minute after the accident airplane's departure, had a similar route of flight. He characterized the weather conditions along the accident airplane's route as overcast, with ceilings ranging between 2,500 and 4,500 feet. He said that as he approached the area of the accident, he encountered 'a wall of weather' starting from the ground, with tops at 1,500 feet. He added that visibility was low, with fog and varied layers of cloud cover. The pilot stated that he changed his route in order to avoid the worsening weather conditions. He added that with satisfactory weather conditions, and given the intended destination of the accident airplane, the standard route of flight would be directly over the location of the accident site. No pre accident anomalies were noted with the accident airplane. ", "probable_cause": "The pilot's continued VFR flight into instrument meteorological conditions. Factors associated with the accident were low ceilings, fog, and snow-covered terrain. "}