{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-ijmuiden-21-killed", "date": "Aug 23, 1954 at 1130 LT", "type": "Douglas DC-6", "operator": "KLM-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "New York – Shannon – Amsterdam", "msn": "43556", "yom": 1952, "flight_number": "KL633", "city": "IJmuiden", "zone": "North Holland", "country": "Netherlands", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6308, "circumstances": "While approaching Amsterdam-Schiphol Airport after an uneventful flight from New York via Shannon, the crew received the permission to descend to 5,500 feet and then 4,500 feet and 3,500 feet respectively. At 1130LT, the four engine aircraft christened 'Willem Bontekoe' disappeared from the radar screens after it crashed into the sea. About five minutes after the disappearance, ATC cleared the crew to descend to 2,500 feet but did not receive any feedback. SAR operations were hampered by poor weather conditions and first debris were found at 1610LT about 37 km northwest of Ijmuiden. None of the 21 occupants survived the crash and less than 50% of the aircraft was recovered. ", "probable_cause": "Investigations were unable to determine the exact cause of the accident. Nevertheless, a number of hypothesis as to the cause of the accident were developed. Some possibilities considered were: \r\n- overheating of the electric system with heavy smoke development, \r\n- explosion of one of the high pressure bottles, \r\n- failure of a cockpit window, \r\n- failure of the automatic pilot system. \r\nHowever, no hypothesis could be formulated in which all occurrences and evidence could be made reasonably acceptable. Therefore, in November 1955, after a 15-months' period of intensive investigation, the conclusion had to be drawn that the cause of the accident could not be established."}