{"url": "https://www.baaa-acro.com/crash/crash-waco-cuc-1-dallas-2-killed", "date": "Feb 16, 1936 at 1635 LT", "type": "Waco CUC", "operator": "Culver Oil Company", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dallas – Tyler", "msn": "4285", "yom": 1935, "flight_number": null, "city": "Dallas-Love Field", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after takeoff from Dallas-Love Field Airport, while climbing, the pilot encountered controllability problems following technical issues with the right aileron. The airplane entered an uncontrolled descent and crashed, bursting into flames. Both occupants were killed, among them George L. Culver, President of the Culver Oil Company. ", "probable_cause": "An examination of the right aileron showed it to be broken at the center hinge point where the aileron control tube attaches. The rivets holding the fittings to which this tube attaches were wrenched out and one fitting was broken. The other end of the control tube, which attaches to the aileron bell crank through a ball bearing, was detached. The inner race of the ball bearing was still attached to the bolt in the bell crank but the outer race was missing. Apparently this outer race or the method of holding it in place had failed, allowing the tube to drop down and thus disconnect the right aileron control system. Failure an flight of the system controlling either the right or the left aileron would allow that aileron to flutter and thus set up a force sufficient to destroy the wing. It is the opinion of the Bureau of Air Commerce that the probable cause of the accident was a failure of the right aileron control system which resulted in a major failure of the right wing. \n"}