{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-atqasuk", "date": "Apr 11, 2018 at 0818 LT", "type": "Cessna 208B Grand Caravan", "operator": "Ravn", "flight_phase": "Landing (descent or approach)", "flight_type": "Postal (mail)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Utqiagvik – Atqasuk", "msn": "208B-0958", "yom": 2002, "flight_number": null, "city": "Atqasuk", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7713, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9778, "circumstances": "The pilot was on a visual flight rules flight transporting mail to a remote village. He reported that when he was about 15 minutes from the destination, he checked the automated weather observing system (AWOS) for updated weather information for the destination and recalled that the visibility was reported as 7 miles. However, the information he recalled was not consistent with what was actually reported by the AWOS; 18 minutes before the accident, the AWOS reported no more than 1 3/4 miles visibility. As he descended the airplane from 2,500 ft to 1,500 ft in the terminal area, he observed reduced visibility conditions that would require an instrument approach procedure. According to the pilot, while maneuvering toward the initial approach fix, he heard the autopilot disconnect, and the airplane began an uncommanded descent. He said that he remembered pulling on the control wheel and thought he had leveled off, but then the airplane impacted terrain, which resulted in substantial damage to the fuselage, vertical stabilizer, and rudder. He could not recall if he had heard terrain warnings or alerts before the impact. An airplane performance study indicated that the airplane was in a continuous descent from 2,500 ft until the final data point about 12 ft above the surface; the airplane was not leveled off at any time during the descent. In the final 15 seconds of recorded data, the rate of descent increased from about 500 fpm to about 2,300 fpm before decreasing to 1,460 fpm at the last recorded data point. Postaccident examinations of the airframe, engine, flight control, and autopilot components revealed no mechanical malfunctions or failures that would have precluded normal operation or affected flight controllability. It is likely that the unexpected instrument approach procedure increased the pilot's workload as he maneuvered to set up for the approach. Further, when the autopilot disconnected, the airplane continued to descend; although the pilot reported that he heard the autopilot disconnect, he did not arrest the airplane's descent rate. Given the low visibility conditions, it is likely that the pilot did not detect the airplane's descent, and the airplane descended into the terrain.", "probable_cause": "The pilot's decision to continue a visual flight rules flight into an area of instrument meteorological conditions and his subsequent failure to level the airplane after the autopilot disconnected, which resulted in a collision with terrain. "}