{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-taylor-mill", "date": "Feb 16, 2003 at 1520 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Kansas Air Center", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Manhattan – Cincinnati", "msn": "31-7652142", "yom": 1976, "flight_number": null, "city": "Taylor Mill", "zone": "Kentucky", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3050, "captain_hours_type": 240, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8337, "circumstances": "According to the pilot, he planned the estimated the 726 statute mile flight would take approximately 3 hours and 46 minutes, with one stop to pick up cargo. The available fuel for the flight was 182 gallons, which equaled an approximate 4 hour and 55 minutes endurance, assuming a 40 gallon per hour fuel burn. The flight proceeded uneventfully to the first stop; the airplane was not fueled, and it departed. As the flight neared the destination airport, the pilot began to get nervous because the main tanks were \"going fast.\" He switched to the auxiliary fuel tanks, to \"get all of the fuel out of them,\" and switched back to the main tanks. While executing an approach to the airport, the pilot advised the approach controller that he had lost power to the right engine, and then shortly thereafter, reported losing power to the left engine. The pilot elected to perform a forced landing to a railroad yard. After touching down, the left wing struck a four-foot high dirt mound, and separated from the main fuselage. The airplane came to rest upright on a railroad track. The pilot additionally stated that the loss of power to both engines was due to fuel exhaustion, and poor fuel planning.", "probable_cause": "The pilot's inaccurate in-flight planning and fuel consumption calculations, and his improper decision not to land and refuel."}