{"url": "https://www.baaa-acro.com/crash/crash-lockheed-18-56-lodestar-coolangatta-21-killed", "date": "Mar 10, 1949 at 0950 LT", "type": "Lockheed 18 LodeStar", "operator": "Queensland%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Coolangatta – Brisbane", "msn": "2194", "yom": 1942, "flight_number": null, "city": "Coolangatta", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 18, "pax_fatalities": 18, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": 2300, "captain_hours_type": null, "copilot_hours": 1700, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after takeoff from Coolangatta Airport, while climbing to a height of some 250 feet, the aircraft banked right and then to the left. It went out of control and crashed in flames in a swamp. The aircraft was partially destroyed by a post impact fire and all 21 occupants were killed. ", "probable_cause": "The accident was caused by the aircraft being loaded so its centre of gravity was behind the rear limit. The report also stated that incorrect setting of the elevator trim tab may have been a contributory cause. The rear limit for the centre of gravity was 39% of Mean Aerodynamic Chord. The load sheet prepared for the fatal flight indicated the centre of gravity of VH-BAG was at 39.2% of Mean Aerodynamic Chord. The load sheet was based on a load chart prepared by the Department of Civil Aviation and based on information supplied by the RAAF. During the investigation, inquiries were made with the US Civil Aeronautics Administration and this revealed an error in the load chart. The main undercarriage of the Lockheed Lodestar retracted to the rear so that retraction caused the centre of gravity to move rearwards but this was not taken into account in the design of the load chart. Other errors also came to light. The passenger seats were 1 inch (25 mm) further apart than shown on the load chart, causing the centre of gravity to be further to the rear than calculated, especially when the aircraft was fully loaded. Up to 18 kilograms (40 lb) of food and beverages for the passengers were stored at the rear of the passenger cabin but were not taken into account on the load chart. Investigation of the accident concluded that after the aircraft's undercarriage retracted, the centre of gravity would have been at about 43.4% of Mean Aerodynamic Chord. With the centre of gravity 4% of MAC behind the rear limit the aircraft would have been tail-heavy and longitudinally unstable. The aircraft had been in daily civil operations in Australia since November 1946 so the investigators assumed there must have been numerous flights with the centre of gravity significantly more than 39% of Mean Aerodynamic Chord. It was necessary for the investigators to find something unique about the fatal flight of VH-BAG that would explain its sudden climb immediately after take-off and the pilot's inability to regain control and prevent the aircraft crashing. The aircraft's tail was one of the few parts of the aircraft not destroyed by fire. The position of the elevator trim tab spool appeared to be in the normal position for landing rather than a typical position for take-off. The investigators concluded that on the final takeoff it was likely that the elevator trim tab was still set for landing. This, coupled with the aircraft being tail-heavy and longitudinally unstable after undercarriage retraction, caused the aircraft to pitch nose-up so strongly that the pilot was unable to retain control or prevent the aircraft stalling. Minister for Civil Aviation Arthur Drakeford made a public announcement that the accident had occurred because the aircraft was tail-heavy and unstable as the result of incorrect loading. The Minister said the operator had not taken adequate steps to ensure safe loading of its aircraft and he hinted that stricter regulation of the loading of aircraft was being considered."}