{"url": "https://www.baaa-acro.com/crash/crash-atr72-500-rome", "date": "Feb 2, 2013 at 2032 LT", "type": "ATR72-500", "operator": "Alitalia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pisa - Rome", "msn": "533", "yom": 1997, "flight_number": "AZ1670", "city": "Rome-Fiumicino-Leonardo da Vinci", "zone": "Lazio", "country": "Italy", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 46, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 18552, "captain_hours_type": 3351, "copilot_hours": 624, "copilot_hours_type": 14, "aircraft_hours": 24088, "circumstances": "The Rome-Fiumicino Airport Runway 25 was closed to trafic due to work in progress so the crew was vectored and cleared for a landing on runway 16L. The approach was completed in good visibility with strong crosswinds from 250° at 28 knots gusting to 41 knots and windshear. On the last segment, the aircraft lost height and impacted ground 567 metres short of runway 16L threshold. The aircraft bounced three times, lost its right main gear, slid for few dozen metres and came to rest in a grassy area some 1,780 metres past the runway threshold. All 50 occupants were rescued, among them seven were slightly injured. The aircraft was damaged beyond repair. ", "probable_cause": "The accident is due to the human factor. In particular, it was caused by an improper conduct of the aircraft by the PF (commander) during landing, not consistent with the provisions of the operator's manuals, in an environmental context characterized by the presence of significant criticality (presence of crosswind with values at the limit/excess those allowed for the ATR 72) and in the absence of an effective CRM.\r\nThe following factors may have contributed to the event:\r\n- The failure to carry out the landing briefing, which, in addition to being required by company regulations, would have been an important moment of pooling and acceptance of information fundamental to the safety of operations.\r\n- The maintenance of a V APP significantly higher than expected.\r\n- The conviction of the commander (PF), deriving from his considerable general and specific experience on the aircraft in question, to be able to conduct a safe landing in spite of the presence of critical wind conditions for the type of aircraft.\r\n- The considerable difference in experience between the commander and the first officer, which has reasonably prevented the latter from showing his critical capacity, thus rendering CRM techniques ineffective."}