{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-580-bradford-20-killed", "date": "Dec 24, 1968 at 2012 LT", "type": "Convair CV-580", "operator": "Allegheny-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Detroit – Erie – Bradford – Harrisburg – Washington DC", "msn": "410", "yom": 1957, "flight_number": "AL736", "city": "Bradford", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 3, "pax_on_board": 41, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": 6701, "captain_hours_type": 1477, "copilot_hours": 4330, "copilot_hours_type": 928, "aircraft_hours": 29173, "circumstances": "Allegheny Airlines Flight 736 departed Detroit, MI for a flight to Washington, DC with intermediate stops at Erie, Bradford and Harrisburg, PA. The Convair CV-580 took off from Erie at 19:46. At 20:06 Flight 736 reported over the VOR outbound at the beginning of the instrument approach procedure. Erie Approach Control then told the crew to contact the Bradford Flight Service Station (FSS). At 20:08:47 the flight reported that they were doing the procedure turn inbound for runway 32 and Bradford FSS told them wind was 290 degrees at 15 knots. The Convair descended in light snow showers until the aircraft contacted trees along terrain which had an average upslope of 1.5deg some 2,5 NM short of the runway. The airplane cut a swath through the trees and impacted the ground at a point 800 feet from the initial tree contact. The fuselage came to rest inverted.", "probable_cause": "The continuation of the descent from the final approach fix through the Minimum Descent Altitude and into obstructing terrain at a time when both flight crewmembers were looking outside the aircraft in an attempt to establish visual reference to the ground. Contributing factors were the minimal visual references available at night on the approaches to the Bradford Regional Airport; a small but critical navigational error during the later stages of the approach; and a rapid change in visibility conditions that was not known to the crew."}