{"url": "https://www.baaa-acro.com/crash/crash-carstedt-jet-liner-600a-near-coolidge-12-killed", "date": "May 6, 1971 at 1315 LT", "type": "Carstedt Jet Liner 600", "operator": "Apache%20Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Tucson - Phoenix", "msn": "04285", "yom": 1950, "flight_number": "33", "city": "Coolidge", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 6000, "captain_hours_type": 2500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Apache Airlines Flight 33 of May 6, 1971, was a regularly scheduled air taxi flight from Tucson to Phoenix, Arizona. The aircraft was a De Havilland Dove Model 104-7AXC (Carstedt CJ600A Conversion), N4922V. The flight departed Tucson International Airport, under visual conditions, at 1253 m.s.t. with 10 passengers and a crew of two, and with 140 gallons of fuel on board. At about 1315, ground witnesses near Coolidge, Arizona, observed the aircraft flying in a northwesterly direction. Some of these witnesses reported that they first heard loud engine noises emanating from the aircraft, and that the engine sound then ceased. According to two of the witnesses, the aircraft initially descended at a “slight angle” which steepened to a 45-to-50 degree dive angle. None of the witnesses saw smoke or fire while the aircraft was in the air, and none saw parts separate from the aircraft. According to the witnesses, there were high scattered cumulus clouds in the area. A pilot, who flew a light aircraft through that general area after the accident, reported that he encountered severe turbulence at about 4,200 feet in the Phoenix area. The 1258 surface weather observation at Phoenix was reported as, measured ceiling of 4,800 feet broken clouds, 25,000 feet overcast, visibility 40 miles, wind from 250’ at 8 knots, and an altimeter setting of 29.78 inches. The crew was current in the aircraft and qualified for the operation involved. The wreckage site, a flat plowed field, revealed two distinct craters with no impact marks between them. One crater was oriented north/south. Most of the fuselage and left wing wreckage was found north of that crater and within 200 feet of it. The other crater, which contained remains of the right wing and the right engine, was located approximately 35 feet southeast of the fuselage crater. Scattered parts of the right wing were located northeast of the crater formed by that wing. Only one piece of wreckage was found outside the immediate area of the craters. This piece, a fairing from the lower aft wing root, was located 1,160 feet northwest (downwind) of the fuselage crater. Although the entire airframe of N4922V was fragmented, the degree of fragmentation was greater on the right side of the fuselage. Both engines were recovered, still attached to portions of their wing attach structure. No evidence of any pre-existing damage was noted on the engine mounts. The engines revealed no evidence of malfunction or failure prior to impact. Neither engine was producing power at impact. Both propellers were found in the feathering range: Disassembly and examination of both fuel controls, the fuel pumps, and the propeller governors revealed no discrepancies except for impact damage. All 12 occupants were killed. ", "probable_cause": "The inflight failure and subsequent separation of the right wing. This failure was the result of a fatigue fracture in the lower main root joint fitting which propagated from an area of corrosion and fretting damage which, in turn, was caused by design deficiencies. These deficiencies remained undetected because surveillance of the supplemental type certification process and the modification programs was not adequate to assure compliance with design and inspection requirements."}