{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-hunt-1-killed", "date": "Aug 24, 2000 at 1549 LT", "type": "Cessna 421C Golden Eagle III", "operator": "NewTek Enterprise", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Pecos – San Antonio", "msn": "421C-1098", "yom": 1981, "flight_number": null, "city": "Hunt", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 18185, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4499, "circumstances": "Approximately 8 months prior to the accident, during a cross country flight, the owner shutdown the left engine due to low oil pressure and diverted from his intended destination to a nearby airport. During descent, the right alternator failed, and the owner performed the emergency gear extension procedure. Following an emergency gear extension, the landing gear of this model airplane cannot be retracted until the system has been ground serviced. A mechanic reported that about 7 months prior to the accident, with the owner present, he removed the oil filter from the left engine, found it packed with metal shavings and told the owner that the engine needed overhaul. Two other mechanics reported that approximately three weeks before the accident, they installed an oil filter on the left engine, changed the oil, and cleaned the oil pressure regulator. They ground ran both engines with no discrepancies noted. One of the mechanics reported that following the engine run, the left engine oil filter was removed, examined, and no metal was found. The landing gear was not serviced. According to the owner, the pilot was \"hired\" by one of the two mechanics to ferry the airplane with the gear extended to a location where the gear could be serviced. While en route, the pilot reported a loss of power on the left engine, that he was having trouble feathering the engine, that the airplane would not maintain altitude and he was looking for a place to land. Witnesses observed the airplane flying low, wheels down and losing altitude. They further observed it roll into a steep left bank, hit trees and a fence, catch fire, come to rest inverted on a road and burn. Post accident examination of the left engine revealed a hole in the right crankcase half over the #3 cylinder attach point. Disassembly of the left engine revealed that the #3 connecting rod was separated from the crankshaft, and the rod bolts, rod cap, and top of the rod were deformed. The #5 piston pin had one cap missing. Scoring was noted on the crankshaft journals, and the main bearings exhibited discoloration and deformation consistent with oil starvation. The cylinders exhibited deformation, scoring in the barrels, and deposits on the domes. The camshaft exhibited discoloration and scoring on the camshaft lobes. Disassembly of the left propeller revealed that it was in the vicinity of low pitch/latch position and not rotating at impact. The disassembly of the right engine and propeller did not reveal any discrepancies that would have precluded operation prior to impact. Estimates of the airplane's climb performance indicated that with the landing gear down and the left propeller stopped, it was not capable of sustained flight. ", "probable_cause": "The loss of left engine power as a result of the owner's failure to overhaul the engine before further flight after the lubrication system was found contaminated with metal. Contributing factors were the pilot's decision to fly the aircraft with a non-operating landing gear system, which resulted in a forced landing, and the lack of suitable terrain for the forced landing."}