{"url": "https://www.baaa-acro.com/crash/crash-douglas-yc-112a-do-van-nuys-3-killed", "date": "Feb 8, 1976 at 1044 LT", "type": "Douglas DC-6", "operator": "Mercer Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Burbank - Ontario", "msn": "36326", "yom": 1946, "flight_number": "MA901", "city": "Van Nuys", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 3, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 10558, "captain_hours_type": null, "copilot_hours": 6600, "copilot_hours_type": null, "aircraft_hours": 10280, "circumstances": "During acceleration, the flight engineer stated, \"Look at that warning light on No. 3.\" There was no verbal response from any other crewmember. The aircraft was accelerated normally to V1 and V2, was rotated, and was lifted off without difficulty. Shortly after the captain called for gear and flaps up, a loud noise was heard and the flight engineer announced that they had lost the No. 3 engine. The No.. 1 blade of the No. 3 propeller had and the loss of the blade caused an imbalance that caused separation, almost instantly, of the No. 3 engine from the aircraft. The propeller blade penetrated the lower fuselage of the aircraft and penetrated the lower inboard side of the No. 2 engine. As the blade passed through the fuselage, it severed pneumatic, hydraulic, and emergency airbrake lines as well as the electrical wiring for propeller controls and some engine instruments. The first officer informed the captain that the engine had separated. The aircraft continued to climb and began a right turn. An emergency was declared and the crew requested and received clearance for a landing on runway 07. Debris was discovered on the intersection of runways 07/25 and 15/23, but the pilot decided to continue the approach. The aircraft touched down near the end of runway 07. The captain called for flap retraction and for the props to be put in reverse pitch. The engine sounds increased, and the first officer advised the captain that the propellers were not going into reverse and to use the brakes. As the engine sound decreased, the captain replied that nothing was happening. Maximum power was applied and the aircraft again took off, and cleared the blast fence at the end of the runway by approximately 30 feet (9 m). At 10:39:35, the crew advised the Hollywood-Burbank Tower that they had no brakes and that they were proceeding to the Van Nuys Airport (VNY). The crew the saw that the No. 2 oil pressure was low and that there was no BMEP indication. Attempts to feather the No. 2 propeller were not successful, and the No. 2 engine stopped with the propeller blades at a positive, low pitch angle. Van Nuys cleared the flight for landing on runway 16, but the crew replied that they wouldn't make it, and requested runway 34. At 10:43:22, the Van Nuys local controller cleared the flight to land on runway 34L. While approaching the airport, the airplane was losing altitude and airspeed. The crew realized that they would not make it to the runway. The throttles were retarded and a forced landing was attempted on the Woodley Municipal Golf Course, about 1 mile south of the Van Nuys Airport. The aircraft touched down on it's main landing gear and bounced three times. The nose of the aircraft struck a 24-inch-high (61 cm) concrete foundation of a partially constructed building. The aircraft came to rest against a house trailer parked nearby and caught fire about 20 minutes after it came to rest. Three crew members were killed while three other occupants were injured.", "probable_cause": "The degraded performance of the aircraft after two engines failed. The dual failure was precipitated by the in-flight failure of the No.1 blade of the No.3 propeller assembly. The failure of the propeller blade resulted from a fatigue crack which originated in the leading edge under the deicer boot. The crack had not been detected during an improperly performed overhaul."}