{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110ej-bandeirante-sao-gabriel-da-cachoeira", "date": "May 7, 1994 at 1248 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Rico", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Santa Isabel do Rio Negro – São Gabriel da Cachoeira", "msn": "110-072", "yom": 1976, "flight_number": null, "city": "São Gabriel da Cachoeira", "zone": "Amazonas", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 14, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15000, "captain_hours_type": 5180, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew encountered poor weather conditions on approach to São Gabriel da Cachoeira Airport with low visibility due to fog. On short final, the crew failed to realize his altitude was insufficient when the aircraft collided with trees and crashed few hundred metres short of runway. All 16 occupants were injured, three seriously. The aircraft was destroyed. ", "probable_cause": "Contributing factors\r\na. Human Factor\r\n(1). Psychological Aspect\r\nIt contributed, since the pilot in command adopted an improvisational attitude through the adoption of unforeseen procedures in the face of the insistence on landing, despite the weather conditions present. A likely channeling of attention to external references may have contributed to the loss of operational performance, leading to the loss of the maintenance condition of the basic flight parameters.\r\n(2). Physiological Aspect\r\nUndetermined since the absence of interference from toxicological factors was not effectively verified.\r\nb. Material Factor\r\nDidn't contribute.\r\nc. Operational Factor\r\n(1). Deficient Instruction\r\nIt contributed since there was no periodic simulator training and also no cockpit resource management (CRM) training.\r\n(2). Deficient Supervision\r\nIt contributed since there was no adequate monitoring of the circumstances of operation by the Company's operations sector and, also, there were no defined and clear rules and specific operating routines that adequately addressed the various aspects of the operation.\r\n(3). Little Flight or Aircraft Experience\r\nIt contributed because of the small experience in the aircraft by the copilot.\r\n(4). Influence of the Environment\r\nIt contributed since visibility was limited at the time of the accident.\r\n(5). Deficient Cockpit Coordination\r\nContributed since there was no briefing to the accomplishment of the descent procedure by instruments, the copilot did not follow the execution of the procedures after the critical point since he concentrated his attention to the search of external references, thus abandoning the monitoring of the flight parameters.\r\n(6). Disabled Infrastructure\r\nIndetermined since the influence of the low accuracy of the NDB on the heading lags occurred in the descent procedure was not perfectly established and no effective test was performed.\r\n(7). Poor Planning\r\nIt contributed because there was no briefing in the procedure of descent by instrument and approach lost.\r\n(8). Deficient discipline of Flight\r\nThe pilot therefore continued the flight, without visibility, at an altitude below the minimum for this operating condition.\r\n(9). Adverse Weather Conditions\r\nIt contributed as the prevailing weather conditions were marginal, with the aerodrome closed for IFR operation."}