{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-4-1009-bogota-2-killed", "date": "Sep 22, 1966 at 0315 LT", "type": "Douglas DC-4", "operator": "Avianca-2", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bogotá - Barranquilla", "msn": "42929", "yom": 1946, "flight_number": "AV870", "city": "Bogotá-El Dorado", "zone": "Bogotá Capital District", "country": "Colombia", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 13000, "captain_hours_type": 3244, "copilot_hours": 1965, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Flight 870 was a scheduled domestic cargo flight from Bogotá-El Dorado International Airport to Barranquilla-Soledad Airport. The aircraft took off from runway 30 at 0315 hours local time. According to some witnesses it appeared to lift off with difficulty opposite the control tower and when it reached the airport boundary the crew announced that they were returning to land. The Control Tower asked why they were returning but received no reply. After the accident tower control personnel stated that during take-off the noise of the engines was louder than usual, as if more than one engine was overspeeding, and that when the aircraft started to turn they observed a sudden flash following which they lost visual contact with the aircraft. Shortly thereafter the aircraft struck some trees 400 m from the \"San Ramón\" property, in a field belonging to the \"Laguna Vieja\" estate, between the roads leading to Funza and Engativá. The aircraft was destroyed by impact forces and a post crash fire and both pilots were killed. ", "probable_cause": "Material failure consisting in fatigue failure of a number of teeth of the pinion of the governor control unit, which was jammed against the rack in the \"up\" position and therefore set for maximum rpm, thus causing the engine to overspeed. This would be in keeping with the fact that the dome ring was at maximum low pitch setting, i.e. high rpm and a runaway propeller on take-off. Was considered as a contributing factor the faulty supervision by the Company. This consisted in briefing the pilot-in-command of the aircraft to make a night flight when he was not qualified for DC-4s, since he was still undergoing training for conversion to L-759."}