{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-1-dl-boise-2-killed", "date": "Dec 9, 1996 at 1803 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "DesertAir", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Boise – Salt Lake City", "msn": "9173", "yom": 1943, "flight_number": null, "city": "Boise", "zone": "Idaho", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 15447, "captain_hours_type": 5502, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 34124, "circumstances": "The DC-3C took off on runway 10L and immediately executed a right turn followed by a left turn back toward the airport declaring a fire aboard. Dark night visual meteorological conditions existed. Witnesses observed 'flames' or an 'orange glow' coming from the right engine. A small number of aluminum fragments identified from the aft edge of the right engine accessory cowling were found along the ground just short of the ground impact site. These fragments displayed signs of heat distress but no significant melting. An examination of the right engine and accessory section revealed no evidence of a preimpact fire, and sooting and metal splatter on the leading edge of the right horizontal stabilizer was minimal. Spectral analysis of radio transmissions revealed no evidence of significant divergence of engine RPM between the two engines. Postcrash propeller examination revealed approximate blade pitch angles of 18-19° and 30-32° for the right and left propellers respectively upon impact. Propeller slash mark dimensions associated with the right propeller resulted in propeller RPM of approximately 1,750 to 2,570 over a range of 68 to 100 knots respectively. The first officer advised the PIC (broadcasting over the tower frequency) 'we're gonna stall' approximately 10 seconds before the impact. The aircraft was in a left turn back toward runways 28 left and right when the right wing struck the ground and the aircraft cartwheeled to a stop. A postcrash fire destroyed the cockpit area and inboard right wing. ", "probable_cause": "A fire within the right engine compartment of undetermined cause and the pilot-in-command's failure to maintain airspeed above the aircraft's minimum control speed. A factor contributing to the accident was the dark night environmental conditions. "}