{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-500b-rayville-3-killed", "date": "Nov 1, 2002 at 1130 LT", "type": "Rockwell Aero Commander 500", "operator": "Robin Williams", "flight_phase": "Flight", "flight_type": "Demonstration", "survivors": "No", "site": "Plain, Valley", "schedule": "Monroe - Monroe", "msn": "500-0950-16", "yom": 1960, "flight_number": null, "city": "Rayville", "zone": "Louisiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 18500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8881, "circumstances": "The twin-engine airplane was observed at a low altitude of approximately 1,000 feet agl performing power off stall maneuvers. The witness described the first stall maneuver initiation and recovery as \"good.\" During the second stall maneuver, the nose rose higher than it did during the first maneuver, the right wing dropped, followed by a steep nose down attitude. The airplane rotated about one and one half revolutions before disappearing behind trees. Prior to ground impact, the witness heard the engines rev up. The purpose of the flight was to demonstrate the airplane to a prospective buyer. A radar and aircraft performance study indicated that the accident airplane departed the airport and began a series of heading, speed and altitude changes ultimately crashing 14.6 nautical miles east of the departure airport. During several time periods, calculations of the calibrated airspeed indicated a trend towards and below published stall speeds of 63 knots flaps extended and 71 knots flaps retracted. No structural or mechanical anomalies were observed during an examination of the airplane and engine.", "probable_cause": "The pilot-in-command's failure to maintain adequate airspeed resulting in an inadvertent stall/spin."}