{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-near-wabush", "date": "Oct 22, 1995 at 1907 LT", "type": "Cessna 402", "operator": "Bowman Aviation", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Mountains", "schedule": "Auburn – Montreal – Schefferville", "msn": "402C-0410", "yom": 1980, "flight_number": null, "city": "Wabush", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Cessna 402, with five persons on board, took off from Auburn, Indiana, USA, around 0630 local time (1130 Coordinated Universal Time (UTC)) for Schefferville, Quebec, with stops en route. Their final leg was from Montreal International (Dorval) to Schefferville, with Wabush, Newfoundland, as the alternate, and they took off at 1523 EDT (1923 UTC). The flights were conducted in accordance with instrument flight rules (IFR). While in cruising flight and west of Wabush, the pilot requested the weather conditions for Schefferville and Wabush. Because of poor conditions in Schefferville, the pilot decided to fly to his alternate, Wabush. During the ILS approach for runway 01, the aircraft was too high to complete the approach, and the pilot requested and received clearance to execute another one. During the missed approach, the pilot proceeded an unknown distance outbound and turned back toward the airport. During the inbound leg, the aircraft contacted trees on the side of a mountain, at an indicated altitude of 2,460 feet asl, and decelerated over a distance of about 900 feet. The aircraft came to rest 23 nautical miles north of the airport, on the extended centre line of runway 01, on a heading of 186 degrees magnetic. The aircraft crashed probably at just after 1907 ADT (2207 UTC) during the hours of darkness. All five occupants were injured. ", "probable_cause": "The pilot did not follow the missed approach procedure as published, particularly with regard to minimum altitudes, and the aircraft crashed on the side of a mountain."}