{"url": "https://www.baaa-acro.com/crash/crash-cessna-414a-chancellor-near-calgary-1-killed", "date": "Sep 23, 2003 at 1936 LT", "type": "Cessna 414 Chancellor", "operator": "Alta%20Flights%20Charters", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Cranbrook – Calgary", "msn": "414A-0219", "yom": 1979, "flight_number": null, "city": "Calgary", "zone": "Alberta", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4375, "captain_hours_type": 2780, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8377, "circumstances": "The Alta Flights Cessna 414A (registration C-GVZE, serial number 414A0219) departed Cranbrook, British Columbia, at approximately 1910 mountain daylight time (MDT) on a visual flight rules cargo flight to Calgary, Alberta. The aircraft disappeared from the Calgary area radar at 1936 MDT, at an indicated altitude of 9000 feet above sea level (asl) in the Highwood Range mountains, approximately 49 nautical miles southwest of Calgary. The aircraft wreckage was found on a mountain ridge at 8900 feet asl some 40 hours later. The flight was in controlled descent to Calgary when the impact occurred. There was a total break-up of the aircraft, and the pilot, the lone occupant, was fatally injured. There was a brief fireball at the time of impact.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The pilot lost situational awareness most likely believing he was over lower terrain.\r\n2. The aircraft was very likely flown into cloud during a day VFR flight, which prevented the pilot from seeing and avoiding the terrain.\r\nFindings as to Risk:\r\n1. The aircraft was not required by regulation to have terrain avoidance equipment installed, leaving the pilot with no last defence for determining the aircraft's position relative to the terrain. This is a risk for all aircraft operated in similar conditions.\r\nOther Findings:\r\n1. The flight plan was prematurely closed by NAV CANADA, which caused the early stoppage of SAR activities and delayed the recommencement of those searches by two hours."}