{"url": "https://www.baaa-acro.com/crash/crash-cessna-525a-citationjet-cj2-michigan-city", "date": "Dec 27, 2017 at 0650 LT", "type": "Cessna 525 CitationJet CJ2", "operator": "Van E Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "DuPage - Michigan City", "msn": "525A-0058", "yom": 2002, "flight_number": null, "city": "Michigan City", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3200, "captain_hours_type": 300, "copilot_hours": 2020, "copilot_hours_type": 81, "aircraft_hours": 2681, "circumstances": "The pilot reported that, during the approach following a positioning flight, he saw that the runway had a light dusting of snow on it and that the airplane touched down on speed in the first 1,000 ft of the 4,100- ft-long runway. The copilot, who was the pilot flying, applied heavy braking, but there appeared to be no braking effectiveness, and the airplane did not slow down as expected. The pilot added that, when the airplane reached about two-thirds of the way down the runway, he knew that it was going to overrun the runway due to the loss of only half of its airspeed. He thought that if he aborted the landing, there was a small chance the airplane could become airborne within the remaining runway. The copilot added engine power to abort the landing, and the nose landing gear lifted off, but insufficient runway was remaining to take off. The copilot reduced the engine power to idle, and the airplane overran the runway and went through the airport fence and a guardrail, across a highway, and into a field. Postaccident examination revealed no flat spots or evidence of skidding on the landing gear tires. The flaps were found in the “ground flaps” position, which is not allowed for takeoff. No evidence of any pre-accident mechanical malfunctions or failures were found with the airplane that would have precluded normal operation. Based on an airplane weight of 11,000 lbs, the airplane’s stopping distance would have been about 4,400\r\nft. The flight crew’s improper decision to land on a snow-covered runway that was too short to accommodate the landing in such conditions led to a runway overrun and impact with obstacles.", "probable_cause": "The flight crew's improper decision to land on a snow-covered runway that had insufficient runway distance for the airplane to land with the contamination, which resulted in a runway overrun and impact with obstacles. "}