{"url": "https://www.baaa-acro.com/crash/crash-learjet-55-longhorn-fort-lauderdale", "date": "Jul 19, 2004 at 1137 LT", "type": "Learjet 55 Longhorn", "operator": "Hop-A-Jet", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Lauderdale - Fort Lauderdale", "msn": "55-112", "yom": 1984, "flight_number": null, "city": "Fort Lauderdale-Executive", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7595, "captain_hours_type": 1994, "copilot_hours": 412, "copilot_hours_type": 10, "aircraft_hours": 6318, "circumstances": "The flight was a VFR positioning flight from FLL to FXE. Transcripts of the cockpit voice recorder (CVR) showed that while waiting for takeoff from FLL the flightcrew heard the local controller reported to a Delta Airlines flight that was on a seven mile final approach to land on runway 27R that the winds were 250 degrees at 19 knots, gusting to 50 knots. The Delta Airlines flight crew then informed the controller they were making a missed approach. At 1130:05 the captain asks the first officer if \"can you see the end of the weather? If we make a hard right turn, can we stay clear of it?\" The first officer responded \"I believe so.\" At 1130:06 the local controller reported \"wind shear alert. The centerfield wind 230 at 22. Runway 27R departure 25 knot loss one mile departure.\" The captain stated to the first officer \"sweet.\" At 1132:11 the captain transmitted to the local controller \"tower, any chance of Hop-a-Jet 55 getting out of here?\" The local controller responded wind 230 at 17, right turn direct FXE approved, runway 27R cleared for takeoff. The captain responded \"cleared to go, right turn out.\" At 1133:10 the captain asks for gear up. At 1133:15 the local controller responded to a Southwest Airlines Flight waiting for takeoff \"no, don't look like anyone's gonna go.\" \"The uh, weather is due west moving rapidly to the north. It looks like a few minutes, and you all be in the clear straight out.\" At 1133:17, the captain stated to the first officer \"oh #. Think this was a bad idea.\" The first officer responded \"no airport in sight.\" At 1133:43 the sound similar to precipitation hitting the windshield is recorded. At 1133:46 the FLL local controller instructs the flight crew to contact FXE Tower. At 1133:54 the CVR records the FXE local controller transmitting \"wind 200, variable 250 at 15, altimeter 29.99. Heavy cell of weather to the west moving eastbound. Low level wind shear possible. At 1134:16, the FXE local controller transmits \"attention all aircraft, low level wind shear advisories are in effect. Use caution. Wind 240 at 10.\" At 1134:51, the first officer transmitted to the FXE local controller that the flight was over the shoreline inbound full stop. At 1135:02, the FXE local controller transmitted \"Hop-a-Jet 55, Executive tower, wind 210 variable 250 at 35, 35 knots and gusting. Winds are uh, heavy on the field. Low level wind shear advisories are in effect. Heavy rains from the west, eastbound and would you like to proceed inbound and land Executive? Say intentions.\" The first officer responded \"that's affirmative.\" The local controller responded, \"Hop-a-Jet 55 straight in runway three one if able. The winds 230 gusts, correction, winds 230 variable 210 at 25.\" At 1135:48, the local controller transmitted, \"Hop-a-Jet 55, wind 230 variable 300 at 25  gusts 35. Altimeter 30.00. Runways are wet. Traffic is exiting the runway prior to your arrival, a Dutchess. Caution standing water on runways. Low level wind shear advisories in effect, Runway 31. Cleared to land.\" The first officer responded \"cleared to land, Hop-a-Jet 55.\" At 1136:35, the local controller transmitted \"wind 230 at 25, gusts 35.\" At 1136:58, the CVR records the sound similar to precipitation on the windshield. At 1137:17, the CVR records a sound similar to the aircraft touching down on the runway. At 1137:19, the sound of a repetitive tone similar to the thrust reverser warning starts and continues to the end of the recording. At 1137:23 a loud unidentified roaring sound starts and lasts 8 seconds. At 1137:30, loud rumbling noises similar to the aircraft departing the runway start. At 1137:36, a continuous tone similar to landing gear warning signal sounds and continues to the end of the recording. The rumbling noises stop. At 1137:39 the captain states the thrust reversers didn't stow and at 1138:36, the captain states \"I went around and the # TRs stayed. The CVR recording ended. The 1132, Goes-12 infrared image depicts a rapidly developing cumulonimbus cloud between and over the FLL and FXE airports. The top of the cloud over FXE was in the range of 22,000 feet. The top of the cloud southwest of FXE was in the 39,000 feet range. The 1145, Goes-12 infrared image depicts a developing cumulonimbus cloud over FXE with the cloud top in the 42,000 feet range. Data was obtained from the Melbourne, Florida Doppler Weather Radar System, located 118 miles north-northwest of the accident site. The data showed that at FXE, between 1130 and 1145, a VIP Level 1 to 2 echo evolved into a VIP Level 5 \"intense\" echo at 1135 and a VIP Level 6 \"extreme\" echo by 1145.", "probable_cause": "The flight crew's decision to continue the approach into known area of potentially severe weather (Thunderstorm), which resulted in the flight encountering a 30 knot crosswind, heavy rain, low-level wind shear, and hydroplaning on a ungrooved contaminated runway."}