{"url": "https://www.baaa-acro.com/crash/crash-cessna-207-stationair-7-cayenne", "date": "Jan 25, 2019 at 1435 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "SIAGE", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cayenne – Maripasoula", "msn": "207-0042", "yom": 1969, "flight_number": null, "city": "Cayenne-Rochambeau-Félix Eboué", "zone": "All French Guyana", "country": "French Guyana", "region": "South America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3620, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The single engine airplane departed Cayenne-Rochambeau-Félix Eboué Airport on a cargo flight to Maripasoula, carrying a load of foods on behalf of a restaurant. The pilot was sole on board. Shortly after takeoff, while in initial climb, the engine lost power. The pilot reduced his altitude and attempted an emergency landing on a known open area located near the airport. But on short final, the aircraft struck a embankment and came to rest upside down. The pilot was seriously injured and the aircraft was destroyed. ", "probable_cause": "The flight was undertaken with an airplane whose center of gravity was beyond the rear center of gravity limits and a mass greater than the maximum take-off mass. The load was not secured. As a result, the performance of the aircraft was degraded and piloting made more difficult. The BEA investigation did not reveal any major failure that could explain a loss of power. Engine performance may have been lower than the manufacturer's standards, due in particular to improper adjustment of the mechanical fuel pump, probably resulting from unsuitable maintenance. This defect was most likely already present on previous flights. It is likely that the power required for the initial climb was greater than what the engine could deliver. This brought the aircraft into a situation where the speed gradually decreased. When the pilot turned, the stall warning sounded and the pilot sensed the engine was losing power."}