{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-buss-lakes-5-killed", "date": "Jun 30, 2011 at 1111 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Lawrence Bay Airways", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Buss Lakes - Southend", "msn": "1132", "yom": 1958, "flight_number": null, "city": "Buss Lakes", "zone": "Saskatchewan", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 4023, "captain_hours_type": 3664, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12746, "circumstances": "The Lawrence Bay Airways Ltd. float-equipped de Havilland DHC-2 (registration C-GUJX, serial number 1132) departed from a lake adjacent to a remote fishing cabin near Buss Lakes for a day visual flight rules flight to Southend, Saskatchewan, about 37 nautical miles (nm) southeast. There were 4 passengers and 1 pilot onboard. The aircraft crashed along the shoreline of another lake located about 2 nm southeast of its point of departure. The impact was severe and the 5 occupants were killed on impact. The emergency locator transmitter activated, and the aircraft was found partially submerged in shallow water with the right wing tip resting on the shore. There was no post-crash fire. The accident occurred during daylight hours at about 1111 Central Standard Time.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\nWhile manoeuvring at low level, the aircraft's critical angle of attack was likely exceeded and the aircraft stalled. The stall occurred at an altitude from which recovery was not possible.\r\nOther Findings:\r\nThe separation of the propeller blade tip likely resulted from impact forces.\r\nThe investigation could not determine whether the fuel pressure warning light was illuminated prior to the accident."}