{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-manteo", "date": "Oct 1, 2010 at 0830 LT", "type": "Cessna 550 Citation II", "operator": "Colnan Inc.", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Tampa - Manteo", "msn": "550-0291", "yom": 1981, "flight_number": null, "city": "Manteo", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9527, "captain_hours_type": 2025, "copilot_hours": 3193, "copilot_hours_type": 150, "aircraft_hours": 9643, "circumstances": "According to postaccident written statements from both pilots, the pilot-in-command (PIC) was the pilot flying and the copilot was the pilot monitoring. As the airplane approached Dare County Regional Airport (MQI), Manteo, North Carolina, the copilot obtained the current weather information. The automated weather system reported wind as 350 degrees at 4 knots, visibility at 1.5 miles in heavy rain, and a broken ceiling at 400 feet. The copilot stated that the weather had deteriorated from the previous reports at MQI. The PIC stated that they would fly one approach to take a look and that, if the airport conditions did not look good, they would divert to another airport. Both pilots indicated in phone interviews that, although they asked the Washington air route traffic control center controller for the global positioning system (GPS) runway 5 approach, they did not expect it due to airspace restrictions. They expected and received a GPS approach to runway 23 to circle-to-land on runway 5. According to the pilots' statements, the airplane was initially fast on approach to runway 23. As a result, the copilot could not deploy approach flaps when the PIC requested because the airspeed was above the flap operating range. The PIC subsequently slowed the airplane, and the copilot extended flaps to the approach setting. The PIC also overshot an intersection but quickly corrected and was on course about 1 mile prior to the initial approach fix. The airplane crossed the final approach fix on speed (Vref was 104) at the appropriate altitude, with the flaps and landing gear extended. The copilot completed the approach and landing checklist items but did not call out items because the PIC preferred that copilots complete checklists quietly. The PIC then stated that they would not circle-to-land due to the low ceiling. He added that a landing on runway 23 would be suitable because the wind was at a 90-degree angle to the runway, and there was no tailwind factor. Based on the reported weather, a tailwind component of approximately 2 knots existed at the time of the accident, and, in a subsequent statement to the Federal Aviation Administration, the pilot acknowledged there was a tailwind about 20 degrees behind the right wing. The copilot had the runway in sight about 200 feet above the minimum descent altitude, which was 440 feet above the runway. The copilot reported that he mentally prepared for a go around when the PIC stated that the airplane was high about 300 feet above the runway, but neither pilot called for one. The flight crew stated that the airplane touched down at 100 knots between the 1,000-foot marker and the runway intersection-about 1,200 feet beyond the approach end of the 4,305-foot-long runway. The speed brakes, thrust reversers, and brakes were applied immediately after the nose gear touched down and worked properly, but the airplane departed the end of the runway at about 40 knots. According to data extracted from the enhanced ground proximity warning system, the airplane touched down about 1,205 feet beyond the approach end of the 4,305-foot-long wet runway, at a ground speed of 127 knots. Data from the airplane manufacturer indicated that, for the estimated landing weight, the airplane required a landing distance of approximately 2,290 feet on a dry runway, 3,550 feet on a wet runway, or 5,625 feet for a runway with 0.125 inch of standing water. The chart also contained a note that the published limiting maximum tailwind component for the airplane is 10 knots but that landings on precipitation-covered runways with any tailwind component are not recommended. The note also indicates that if a tailwind landing cannot be avoided, the above landing distance data should be multiplied by a factor that increases the wet runway landing distance to 3,798 feet, and the landing distance for .125 inch of standing water to 6,356 feet. All distances in the performance chart are based on flying a normal approach at Vref, assume a touchdown point 840 feet from the runway threshold in no wind conditions, and include distance from the threshold to touchdown. The PIC's statement about the airplane being high at 300 feet above the runway reportedly prompted the copilot to mentally prepare for a go around, but neither pilot called for one. However, the PIC asked the copilot what he thought, and his reply was \" it's up to you.\" The pilots touched down at an excessive airspeed (23 knots above Vref), more than 1,200 feet down a wet 4,305-foot-long runway, leaving about 3,100 feet for the airplane to stop. According to manufacturer calculations, about 2,710 feet of ground roll would be required after the airplane touched down, assuming a touchdown speed at Vref; a longer ground roll would be required at higher touchdown speeds. Although a 2 knot crosswind component existed at the time of the accident, the airplane's excessive airspeed at touchdown (23 knots above Vref) had a much larger effect on the outcome of the landing. ", "probable_cause": "The pilot-in-command's failure to maintain proper airspeed and his failure to initiate a go-around, which resulted in the airplane touching down too fast on a short, wet runway and a subsequent runway overrun. Contributing to the accident was the copilot's failure to adequately monitor the approach and call for a go around and the flight crew's lack of proper crew resource management.\n"}