{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-leeds-1-killed", "date": "Oct 19, 1987 at 0616 LT", "type": "Beechcraft 200 Super King Air", "operator": "Artix", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Teesside – Leeds", "msn": "BB-1162", "yom": 1983, "flight_number": null, "city": "Leeds-Bradford", "zone": "West Yorkshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6000, "captain_hours_type": 350, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot, sole on board, was completing a positioning flight from Teesside to Leeds where passengers should embark for Alicante, Spain. On approach, the visibility was poor due to low clouds. After being cleared to descend to 3,000 feet then to land on runway 14, the aircraft descended too low and crashed on the top of a hill located 3,4 km short of runway threshold. The pilot was killed. ", "probable_cause": "At the time of the accident, QNH was 1008 and QFE was 983. Initially the commander did not read this information back to the controller, as is 'required', nor did the controller ask him to do so, as is 'recommended' by the Manual of Air Traffic Services. The laid down descent angle for a Localiser/DME approach to runway 14 at Leeds/Bradford Airport is 3.5°. Whereas a standard 3 degree descent angle can readily be calculated and flown by a pilot using a formula of 300 feet per nautical mile, it is more difficult, particularly in single pilot operations, to calculate and achieve a 3.5° descent. An aircraft on a 3.5° approach angle, on a pressure setting of 998 mb, would pass approximately 100 feet above the accident site but, a 3° approach would result in ground contact in the area of the site."}