{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46f-1-cu-commando-seattle-7-killed", "date": "Jul 19, 1949 at 2101 LT", "type": "Curtiss C-46 Commando", "operator": "Air Transport Associates", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Seattle – Chicago", "msn": "22463", "yom": 1945, "flight_number": null, "city": "Seattle-Boeing Field", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 28, "pax_fatalities": 2, "other_fatalities": 5, "total_fatalities": 7, "captain_hours": 3743, "captain_hours_type": 700, "copilot_hours": 7800, "copilot_hours_type": 200, "aircraft_hours": 255, "circumstances": "The aircraft was chartered to carry 28 US military staff to Chicago. The crew taxied the aircraft to the south end of runway 31, where they parked for a period of 13 minutes to accomplish the before takeoff check list. The engines and other components of the aircraft appeared to operate normally, so at 2058, after receiving clearance from the tower, takeoff was started. Fuel selector valves for both engines had been positioned to the front tanks which contained 91 octane gasoline. Wind was from the northeast at six miles per hour, and visibility was eight miles, under a ceiling of 8,500 feet. Power was advanced to 45 inches of manifold pressure and to 2,700 RPM’s for takeoff. The aircraft rolled approximately 3,500 feet down the runway, then became airborne at an air speed of 105 miles per hour. During the takeoff run one of the engines was heard to sputter and backfire, and an unusual amount of torching or exhaust flame was observed coming from both of the engines. Because the left engine did not seem to be developing full power, Captain Edgerton, at an altitude of about 20 feet, retarded the throttles, and the aircraft settled back to the runway. Runway 31 at Boeing Field is 7,500 feet long. At the time of the accident, the green threshold lights at the north end of the runway had been moved in 1,700 feet for runway had been moved in 1,700 feet for runway repair purposes, in effect reducing the length of the runway to 5,800 feet. However, this north portion of the runway was usable for takeoff. Captain Edgerton after touching down on the runway, approximately 4,500 feet from the start of the takeoff and 1,300 feet from the green threshold lights, did not believe that he had sufficient runway remaining to accomplish a safe stop, so he advanced the throttles to the limit of 52 inches. Both engines responded, but the left continued to misfire. After a momentary ground roll the aircraft again became airborne at an air speed of 105 miles per hour. The landing gear was retracted, air speed increased slowly to approximately 110 miles per hour, and the flight passed over the north end of the runway at about 50 feet above the ground in a nose high attitude. Sufficient altitude could not be obtained to fly over power lines and poles to the north of the airport, and 1,500 feet north of runway 31 the aircraft struck a 56-foot pole two feet below its top. The impact tore away six feet of the right horizontal stabilizer and elevator. A second pole, 1,480 feet from the first, was struck, then a third pole 200 feet from the second. As a result of striking these poles air speed and altitude were lost, and 200 feet from the third pole the aircraft crashed into a three-story frame house. The aircraft carried away the entire top story of this structure, then it plunged into and demolished a single-story brick dwelling. The aircraft came to rest on the foundation of the brick dwelling in an upright position. Many high tension lines, carrying up to 26,000 volts, had been severed. As a result, there was considerable electrical arcing which started several scattered fires in the vicinity of the accident. Fire was started in the area of the aircraft’s fuel tanks immediately after the aircraft had come to a full stop. The tail section aft of the main cabin door and the nose section forward of the flight deck were separated from the cabin portion of the fuselage. Passengers and crew were evacuated through these open ends of the cabin before fire progressed into the fuselage. Two passengers, Pvt Laurence Furio and Cpl Frank Catioca were killed as well as five people in the houses: Pete Chumos, Frank Morgan, Ralph Parker, Olavi Niemi and Ed Brightcamp.", "probable_cause": "The Board determines that the probable cause of this accident was the indecision of the pilot in continuing a takeoff after loss of power in the left engine, which loss was probably caused by the use of 91 octane fuel, necessitating the operation of the aircraft’s engines in excess of the approved operating limitations.\r\nThe following findings were noted:\r\n- Ninety-one octane fuel was used for takeoff although not authorized in the aircraft specification or in the CAA Approved Flight Manual,\r\n- During takeoff, the power settings used far exceeded the limitations of 91 octane fuel,\r\n- The aircraft, after a takeoff roll of approximately 3,500 feet, became airborne at an air speed of 105 miles per hour and climbed to an altitude of about 20 feet, at which time the left engine failed to develop full power,\r\n- Immediately following the loss of power in the left engine, throttles were retarded after which the aircraft made contact with the runway approximately 4,500 feet from the start of the takeoff run, and 1,300 feet from the green threshold lights at the north end of the runway,\r\n- Following the touchdown on the runway, throttles were advanced for the continuation of the takeoff, and the aircraft became airborne for the second time at an air speed or 105 miles per hour,\r\n- The left engine continued to misfire during the entire takeoff and climb from the airport, but there was not sufficient evidence from which to conclude or estimate the amount of power, if any, which was developed,\r\n- The aircraft struck a 56-foot pole, two feet below its top, which was located 1,500 feet north of the north end of runway 31, after which the aircraft struck other poles and power lines resulting in loss of air speed and altitude, following which the aircraft crashed in a residential area north of Boeing Field, Seattle, Wash."}