{"url": "https://www.baaa-acro.com/crash/crash-lockheed-18-56-lodestar-near-grants-4-killed", "date": "Mar 22, 1958 at 0240 LT", "type": "Lockheed 18 LodeStar", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Burbank – Tulsa – New York", "msn": "2312", "yom": 1942, "flight_number": null, "city": "Grants", "zone": "New Mexico", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 7680, "captain_hours_type": 386, "copilot_hours": 4500, "copilot_hours_type": 3500, "aircraft_hours": 3910, "circumstances": "The flight had made routine position reports from its assigned altitude of 11,000 feet until passing over Winslow, Arizona. Shortly after the last routine report at 11,000 feet a higher altitude was requested of Air Traffic Control because of encountering icing conditions. The request was granted and the aircraft reported, five minutes later, being at 13,000 feet between cloud layers. The last report was over Zuni, New Mexico, estimating Grants at 0249, 19 minutes later. Ten minutes after this report a ground explosion at an elevation of 7,200 feet m. s. 1. was observed by another flight and by ground witnesses. The wreckage of N300E was found in the area of the witnessed explosion. The right engine master rod bearing had failed in flight and the right propeller was feathered; however, complete loss of control followed and the aircraft struck the ground in a very steep angle of descent. As far as can be determined, there was no failure of the aircraft structure or controls prior to ground impact. The aircraft had anti-icing equipment installed and the pilots were experienced in Lodestar operation. There is evidence of the aircraft being considerably over its maximum allowable weight at departure and it is believed that the comparatively sudden failure of an engine at 13,000 feet created a situation, made more critical by virtue of the then existing weight, in which the pilot was unable to maintain control of the aircraft. All four occupants were killed, among them the American film producer Mike Todd, husband of Elizabeth Taylor. The twin engine airplane was christened 'The Liz'.", "probable_cause": "The Board determines that the probable cause of this accident was the loss of control of an overloaded aircraft following the failure of an engine at a cruising altitude which was critical for single-engine operation. The loss of control was aggravated by surface ice accretion."}