{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-54f-near-kaysville-3-killed", "date": "Dec 18, 1977 at 0138 LT", "type": "Douglas DC-8", "operator": "United-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "San Francisco – Salt Lake City – Chicago", "msn": "45880/275", "yom": 1966, "flight_number": "UA2860", "city": "Kaysville", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 14954, "captain_hours_type": 4148, "copilot_hours": 9905, "copilot_hours_type": 366, "aircraft_hours": 29832, "circumstances": "About 0138:28 m.s.t. on December 18, 1977, a United Airlines, Inc., DC-8F-54 cargo aircraft, operating as Flight 2860, crashed into a mountain in the Wasatch Range near Kaysville, Utah. The three flightcrew members, the only persons aboard the aircraft, were killed, and the aircraft was destroyed. Flight 2860 encountered electrical system problems during its descent and approach to the Salt Lake City Airport. The flight requested a holding clearance which was given by the approach controller and accepted by the flight crew. The flight then requested and received clearance to leave the approach control frequency for a \"little minute\" to communicate with company maintenance. Flight 2860 was absent from the Approach control frequency for 7 1/2 minutes. During that time, the flight entered an area near hazardous terrain. The approach controller recognized Flight 2860's predicament but was unable to contact the flight. When flight 2860 returned to approach control frequency, the controller told the flight that it was too close to terrain on its right and to make a left turn. After the controller repeated the instructions, the flight began a left turn and about 15 seconds later the controller told the flight to climb immediately to 8,000 feet. Eleven seconds later, the flight reported that it was climbing from 6,000 feet to 8,000 feet. The flight crashed into a 7,665-foot mountain near the 7,200-foot level. The aircraft was destroyed and all three crew members were killed. ", "probable_cause": "The approach controller's issuance and the flight crew's acceptance of an incomplete and ambiguous holding clearance in combination with the flight crew's failure to adhere to prescribed impairment-of-communications procedures and prescribed holding procedures. The controller's and flight crew's actions are attributed to probable habits of imprecise communication and of imprecise adherence to procedures developed through years of exposure to operations in a radar environment. Contributing to the accident was the failure of the aircraft's No.1 electrical system for unknown reasons."}