{"url": "https://www.baaa-acro.com/crash/crash-pac-fletcher-fu-24-950m-ngaruawahia-1-killed", "date": "Mar 30, 1994 at 1200 LT", "type": "Fletcher FU-24", "operator": "Jetspread", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Ngaruawahia - Ngaruawahia", "msn": "202", "yom": 1974, "flight_number": null, "city": "Ngaruawahia", "zone": "Waikato Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 338, "captain_hours_type": 5, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The day's operation commenced at about 06:30 with the student flying and the instructor operating the loader.The intention was to fly for two hours when a break would be taken in order to rest the trainee pilot, check the fuel state, and review the sowing operation so far. Shortly before 08:20 the trainee took off on what was about the twentieth sowing flight of the day. The Fletcher was loaded with 19 hundredweight (cwt) or 965 kg of lime in the hopper. The usual pattern was flown and the aircraft was positioned for a sowing run along a ridge face at about 100 feet AGL. However, on this run no lime was dropped and at about the usual commencement point for sowing the aircraft made a sharp turn to the left and flew out over level ground, away from the ridge. After turning through about 120 degrees the plane pitched nose-down suddenly and dived almost vertically into the ground. It bounced over a hedge and came to rest 10 metres beyond the initial point of impact. This was not a survivable crash. Despite the spillage of considerable fuel no fire broke out. The flying weather was calm with good visibility. Weather was not a factor in this accident.", "probable_cause": "No firm reason for the pilot to abandon his sowing run and make a steep turn away from the ridge could be found. It was noted that the change of heading took the plane on a course towards the sun and also a 100- feet-tall tree that may have caused the pilot to take abrupt avoiding action, causing the plane to stall and fall into an incipient spin from which control could not be regained owing to the limited height available."}