{"url": "https://www.baaa-acro.com/crash/crash-cessna-207-skywagon-tuntutuliak", "date": "Oct 13, 2006 at 1512 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Yute%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bethel - Tuntutuliak", "msn": "207-0405", "yom": 1977, "flight_number": null, "city": "Tuntutuliak", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5700, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 21781, "circumstances": "The commercial certificated pilot was attempting to land on a remote runway during a Title 14, CFR Part 135, cargo flight. The approach end of the runway is located at the edge of a river. During the pilot's fourth attempt to land, the airplane collided with the river embankment, and sustained structural damage. The director of operations for the operator reported that he interviewed several witnesses to the accident. They told him that the weather conditions in the area had been good VFR, but as the pilot was attempting to land, rain and mist moved over the area, reducing the visibility to about 1/4 mile. Within 30 minutes of the accident, the weather conditions were once again VFR. The pilot told an FAA inspector that the weather conditions consisted of a 500 foot ceiling and 2 miles of visibility. The pilot reported that he made 3 passes over the runway before attempting to land. On the last landing approach, while maintaining 80 knots airspeed, the pilot said the nose of the airplane dropped, he applied full power and tried to raise the nose, but the airplane collided with the river bank.", "probable_cause": "The pilot's misjudgment of distance/altitude during the landing approach, which resulted in an undershoot and in-flight collision with a river embankment. Factors contributing to the accident were reduced visibility due to rain and mist."}