{"url": "https://www.baaa-acro.com/crash/crash-cessna-t207a-turbo-stationair-7-page-1-killed", "date": "May 10, 2014 at 1545 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "American-Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Page - Page", "msn": "207A-0395", "yom": 1977, "flight_number": null, "city": "Page", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6850, "captain_hours_type": 48, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14883, "circumstances": "During a local sightseeing flight, the pilot noticed that the engine had lost partial power, and he initiated a turn back toward the airport while troubleshooting the loss of power. Despite the pilot's attempts, the engine would not regain full power and was surging and sputtering randomly. The pilot entered the airport's traffic pattern on the downwind leg, and, while on final approach to the runway, the airplane encountered multiple downdrafts and wind gusts. It is likely that, due to the downdrafts and the partial loss of engine power, the pilot was not able to maintain airplane control. The airplane subsequently landed hard short of the runway surface and nosed over, coming to rest inverted. The reported wind conditions around the time of the accident varied between 20 and 70 degrees right of the runway heading and were 14 knots gusting to greater than 20 knots. In addition, a company pilot who landed about 8 minutes before the accident reported that he encountered strong downdrafts and windshear while on final approach to the runway and that he would not have been able to reach the runway if he had a partial or total loss of engine power. Postaccident examination of the airframe and engine revealed no evidence of any preexisting mechanical malfunctions or failures that would have precluded normal operation. The engine was subsequently installed on a test stand and was successfully run through various power settings for several minutes. The reason for the partial loss of engine power could not be determined.", "probable_cause": "The pilot's inability to maintain aircraft control due to a partial loss of engine power and an encounter with downdrafts and gusting crosswinds while on final approach to the runway. The reason for the   partial loss of engine power could not be determined because postaccident examination revealed no mechanical malfunction or failure that would have precluded normal operation."}