{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-st-petersburg", "date": "Oct 18, 2017 at 1545 LT", "type": "Cessna 402", "operator": "Noble-Air-Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "City", "schedule": "Tampa – Sarasota", "msn": "402B-1356", "yom": 1978, "flight_number": null, "city": "Saint Petersburg-Albert Whitted", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 654, "captain_hours_type": 38, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8971, "circumstances": "The pilot departed on the non-scheduled passenger flight with one passenger onboard; the flight was the 3rd leg of a 4-leg trip. About 13 minutes after departure, he advised air traffic control that the airplane was “fuel critical” and requested vectors to the nearest airport, which was about 7 miles away. Both engines subsequently lost total power and the pilot performed a forced landing on a street about 2 miles from the airport, during which the airplane collided with two vehicles. Examination of the airplane revealed substantial damage to the fuel tanks, with evidence of a small fire near the left wingtip fuel tank. Fuel consumption calculations revealed that the airplane would have used about 100 gallons of fuel since its most recent refueling, which was the capacity of the  main (wingtip) tanks. Both fuel selectors were found in their respective main tank positions. Given the available information, it is likely that the pilot exhausted all the fuel in the main fuel tanks and starved the engines of fuel. Although the total amount of fuel on board at the start of the flight could not be determined, had all tanks been full, the airplane would have had about 63 gallons remaining in the two auxiliary tanks at the time of the accident. The auxiliary fuel tanks were breached during the accident and quantity of fuel they contained was not determined. Examination of the engines revealed no evidence of any preimpact mechanical malfunctions or failures that would have precluded normal operation. ", "probable_cause": "The pilot's mismanagement of the onboard fuel, which resulted in fuel starvation, a total loss of power to both engines, and a subsequent forced landing. "}