{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-2-210-mont-dandenong-18-killed", "date": "Oct 25, 1938 at 1345 LT", "type": "Douglas DC-2", "operator": "Australian%20National%20Airways", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Adelaide – Melbourne", "msn": "1566", "yom": 1937, "flight_number": null, "city": "Mont Dandenong", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 14, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 18, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While descending to Melbourne, the crew lost his orientation and was unable to locate the airport of Essendon. The pilot continued the descent and the aircraft named 'Kyeema' went through a thick layer of cloud when it impacted trees and crashed in a wooded and hilly terrain located in Mont Dandenong, some 40 km east of Essendon Airport. The aircraft was destroyed by impact forces and a post crash fire and all 18 occupants were killed. \r\nCrew:\r\nA. C. Webb, pilot, \r\nA. J. Steen, copilot,\r\nPhillip Pring, pilot, acting as radio operator, \r\nElva Jones, stewardess,", "probable_cause": "The following deficiencies were identified as contributing to the accident: \r\n1) The aircraft’s navigational log was either not kept or had not been properly utilized during the latter part of the flight, as required by the carrier;\r\n2) The company’s procedure for descent through an overcast into this airport was not adopted, and \r\n3) A request for a bearing from the aircraft was not received by the radio operator at the airport nor logged at any other operating station. Also noted in the investigative report was the lack in Australia of an ultra-high frequency (UHF) beacon network, and indeed, the crash of VH-UYC would prove pivotal in the development of the nation’s airway system."}