{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-lebanon-2-killed", "date": "Dec 24, 1996 at 1005 LT", "type": "Learjet 35", "operator": "Aircraft Charter Group", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Mountains", "schedule": "Bridgeport - Lebanon", "msn": "35-388", "yom": 1981, "flight_number": null, "city": "Lebanon", "zone": "New Hampshire", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4250, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6897, "circumstances": "The first officer was in the left seat, flying the airplane, and the captain was in the right seat, for the positioning flight. Approaching the destination, the crew briefed, then attempted an ILS RWY 18 approach. The captain reported not receiving the localizer, when, in fact, the airplane was actually about 5 nautical miles to the left of it. Winds at the airport, about that time, were from 190 degrees true, at 5 knots; however, area winds at 6,000 feet were from 220 degrees, in excess of 40 knots. The crew executed a missed approach, but did not follow the missed approach  procedures. The captain later requested, and received clearance for, the VOR RWY 25 approach. The captain partially briefed the approach to the first officer as the airplane neared the VOR, then subsequently \"talked through\" remaining phases of the approach as they occurred. The outbound course for the VOR RWY 25 approach was 066 degrees, and the minimum altitude outbound was 4,300 feet. After passing the VOR, the captain directed the first officer to maintain 4,700 feet. The airplane's last radar contact occurred as the airplane was proceeding outbound, 7 nautical miles northeast of the VOR, at 4,800 feet. As the airplane approached the course reversal portion of the procedure turn, the captain initially directed the first officer to turn the airplane in the wrong direction. When the proper heading was finally given, the airplane had been outbound for about 2 minutes. During the outbound portion of the course reversal, the captain told the first officer to descend the airplane to 2,900 feet, although the procedure called for the airplane to maintain a minimum of 4,300 feet until joining the inbound course to the VOR. During the inbound portion of the course reversal, the captain amended the altitude to 3,000 feet. As the airplane neared the inbound course to the VOR, the captain called out the outer marker. The first officer agreed, and the captain stated that they could descend to 2,300 feet. The first officer then noted that the VOR indications were fluctuating. The captain pointed out the VOR's continued reception, and the first officer noted, \"but it's all over the place.\" Shortly thereafter, the first officer stated that he was descending the airplane to 2,300 feet. Three seconds later, the airplane impacted trees, then terrain. The wreckage was located at the 2,300-foot level, on rising mountainous terrain, 061 degrees magnetic, 12.5 nautical miles from the VOR. It was also 10.3 nautical miles prior to where a descent to 2,300 feet was authorized. There was no evidence that the crew used available DME information. There was also no evidence of pre-impact mechanical malfunction. ", "probable_cause": "The captain's failure to maintain situational awareness, which resulted in the airplane being outside the confines of the instrument approach; and the crew's misinterpretation of a stepdown fix passage, which resulted in an early descent into rising terrain. Factors included the captain's misreading of the instrument approach procedure, the crew's rushed and incomplete instrument approach briefing, their failure to use additional, available navigational aids, and their failure to account for the winds at altitude. "}