{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-lansing-5-killed", "date": "Oct 3, 2019 at 0858 LT", "type": "Socata TBM-700", "operator": "N700AQ LLC", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Indianapolis - Lansing", "msn": "252", "yom": 2003, "flight_number": null, "city": "Lansing-Capital Region", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 1404, "captain_hours_type": 76, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3550, "circumstances": "The pilot was conducting an instrument approach at the conclusion of a cross-country flight when the airplane entered a shallow climb and left turn away from the runway heading about 0.5-mile from the intended runway. According to airspeeds calculated from automatic dependent surveillance-broadcast position data, the airplane’s calibrated airspeed was 166 knots when it crossed over the final approach fix inbound toward the runway and was about 84 knots when it was on a 0.5-mile final approach. The airplane continued to decelerate to 74 knots while it was in a shallow climb and left turn away from the runway heading. At no point during the approach did the pilot maintain the airframe manufacturer’s specified approach speed of 85 knots. The airplane impacted the ground in an open grass field located to the left of the extended runway centerline. The airplane was substantially damaged when it impacted terrain in a wings level attitude. The postaccident examination did not reveal any anomalies that would have precluded normal operation of the airplane. The altitude and airspeed trends during the final moments of the flight were consistent with the airplane entering an aerodynamic stall at a low altitude. Based on the configuration of the airplane at the accident site, the pilot likely was retracting the landing gear and flaps for a go around when the airplane entered the aerodynamic stall. The airplane was operating above the maximum landing weight, and past the aft center-of-gravity limit at the time of the accident which can render the airplane unstable and difficult to recover from an aerodynamic stall. Additionally, without a timely corrective rudder input, the airplane tends to roll left after a rapid application of thrust at airspeeds less than 70 knots, including during aerodynamic stalls. Although an increase in thrust is required for a go around, the investigation was unable to determine how rapidly the pilot increased thrust, or if a torque-roll occurred during the aerodynamic stall.", "probable_cause": "The pilot’s failure to maintain airspeed during final approach, which resulted in a loss of control and an aerodynamic stall at a low altitude, and his decision to operate the airplane outside of the approved weight and balance envelope.\n"}