{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-killarney-6-killed", "date": "Aug 19, 1994 at 1230 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Emidio Simone", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Windsor – Killarney", "msn": "46-8408035", "yom": 1984, "flight_number": null, "city": "Killarney", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 1322, "captain_hours_type": 122, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2019, "circumstances": "The flight was a private pleasure/travel flight for the purpose of transporting the pilot, his wife, and two other couples from Windsor to Killarney, Ontario, where they were to spend the weekend with friends. The flight had been planned in advance of the departure date. The pilot commenced taxiing at 1058 eastern daylight saving time (EDT), and was issued an instrument flight rules (IFR) clearance to Killarney via the routing \"Windsor, radar vectors Sarnia, direct Wiarton, direct Killarney, to maintain 3,000\" feet asl. The pilot took off at 1105. After take-off, the flight proceeded in a routine manner in accordance with the IFR clearance and was issued a final cruise altitude of 9,000 feet asl. The pilot reported level at 9,000 feet asl at 1125. At 1137, while the flight was 65 to 70 nm southwest of Wiarton, Ontario, the pilot was issued and acknowledged a clearance to fly direct to Killarney. At 1151, he requested and was issued a clearance to climb to 12,000 feet asl to get above a cloud layer, and reported level at 12,000 feet asl at 1155. The flight passed 20 nm to the west of Wiarton at 1203. At 1206, the pilot was given the Sudbury altimeter setting of 29.913 and was cleared to maintain 4,000 feet asl at his convenience. He acknowledged the clearance and commenced descent from 12,000 feet asl, 62 nm south of Killarney. Shortly after issuing the descent clearance, the air traffic services (ATS) controller advised the pilot that the IFR flight plan could be cancelled with the controller on his frequency while still airborne or with the Sault Ste. Marie flight service station (FSS) on the ground by a toll free telephone number. The ATS controller asked the flight crew of another aircraft on the same frequency to listen for an IFR cancellation from C-GSEV and to relay the cancellation to the controller. At 1221, the pilot of C-GSEV advised the ATS controller that he would be descending to 2,000 feet asl. The controller advised the pilot that the flight was in uncontrolled airspace and descent would be at the pilot's discretion. The pilot acknowledged the message, and this was the last direct controller/pilot communication (DCPC) between ATS and the aircraft. The last recorded radar position of the aircraft was at 1223:43, when it slowed to 180 knots ground speed and was descending out of 3,000 feet asl, 3 1/2 to 4 nm south of the Killarney airport. At about 1224, the flight crew from another aircraft on the frequency advised the ATS controller that C-GSEV had cancelled the IFR flight plan. There was no further communication with the flight after the pilot cancelled the IFR flight plan. The aircraft was reported missing to officials of the pilot's company the following morning by friends and family of the passengers. Search and rescue authorities were notified at approximately 0930, and the wreckage was located by search and rescue late that afternoon. The aircraft struck the rock face of a mountain at 1,321 feet asl in near level flight, on a northeast heading. The top of the mountain was 1,408 feet asl. The six occupants were fatally injured, and the aircraft was destroyed on impact. The accident occurred at about 1230 EDT during the hours of daylight, at latitude 46°02'N and longitude 081°26'W.\r\nCrew:\r\nEmidio Simone, pilot. \r\nPassengers:\r\nLaila Simone, \r\nWilliam and Lynne Bolton,\r\nDavid and Pauline Moore. ", "probable_cause": "The pilot was operating the aircraft in instrument meteorological conditions and uncontrolled airspace while below a safe terrain clearance altitude, and the aircraft struck a mountain."}