{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130-hercules-sharara-3-killed", "date": "Apr 29, 2018 at 1225 LT", "type": "Lockheed C-130 Hercules", "operator": "Libyan Air Force -  Al Quwwat Al-Jawwiya Al Libiyya", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sharara - Mitiga", "msn": "4992", "yom": 1984, "flight_number": null, "city": "Sharara Field", "zone": "Wadi al Hayaa (وادي الحياة)", "country": "Libya", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "National Oil Corporation confirms a C-130 aircraft chartered by Akakus Oil crashed during take-off, 2 km from the Sharara oil field, after delivering 18 tonnes of catering and maintenance supplies. The crash occurred at 12:25pm on Sunday, April 29, 2018. Firefighters and paramedics quickly rushed to the scene. The tragic incident resulted in the death of three crew members and the injury of one other who is being evacuated by air to receive medical treatment in Tripoli. The NOC Board of Directors cancelled all their commitments and are presently at Akakus headquarters meeting with local management and a number of emergency staff to follow up on this tragic incident. The circumstances of the crash are still being investigated. Mr. Fayez Al-Sarraj, Chairman of the Presidential Council, was briefed on the developments of the incident, and expressed his solidarity with the families of the victims, ordering the preparation of a decree commemorating the deceased as martyrs. The General Civil Aviation Authority (GCAA) was also briefed and offered its condolences to the Chief of Staff of the Air Force. The plane in question is the property of the Libyan Air Force but was chartered by Akakus Oil, who operate the Sharara field. The company was forced to charter the aircraft due to road closures and the security situation on the ground stemming from a road blockade leading to the field.", "probable_cause": null}