{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-ii-southend-1-killed", "date": "Mar 13, 1986 at 0832 LT", "type": "Piper PA-31 Cheyenne", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cologne - Southend", "msn": "31-8020007", "yom": 1980, "flight_number": null, "city": "Southend-on-Sea", "zone": "Essex", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3081, "captain_hours_type": 311, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A flight plan for the flight from Cologne to Southend was filed on the evening of 12 March 1986. The pilot obtained by telephone details of the actual weather conditions at Southend at 0650 hrs on 13 March 1986. He took off from Cologne at 0714 hrs with a company colleague as his sole passenger. The aircraft flew without incident using the airways as FL220 until cleared by ATC to descend towards Southend. At 0820 hrs the pilot established radio communications with the approach controllers. He was passed details of the existing weather conditions and said that he would try the approach. He requested and was given radar guidance to land on runway 24 at Southend. The published operating minimum for an approach using the 3 cm surveillance radar is an Obstacle Clearance Limit (OCL) of 280 feet. radar guidance for the approach terminates at half a nautical mile from touchdown. The recommended Decision Height (DH) and Runway Visual Range (RVR) published in the UK Air PIlot (RAC 4-6-13) is 380 feet and 800 meters respectively. The approach was flown accurately in azimuth, and advisory heights to maintain a 3° glide path were passed to the pilot. The aircraft's flight path was observed on the London Air Traffic Control descent profile. The radar talkdown was terminated at half a mile and the aircraft was cleared to land. when the aircraft was not sighted from the control tower at the expected time of landing the alarm was raised. Members of the airfield fire service were already positioned on the airfield at 'weather standby'. They initiated a search for the aircraft. It was learned that it had crashed close to an industrial estate which lies about half a mile from the threshold of runway 24. The aircraft had been seen on the normal approach path but at a height judged to be lower than normal. Two eye withnesses saw the aircraft bank sharply to the left before it crashed into a small field. There was a minor post-impact fire in the area of the left engine, which was quickly extinguished by those first on the scene using a hand held extinguisher. The passenger was assisted in opening the main cabin door and he was escorted from the wreckage. The pilot was killed on impact. The passenger, who had been seated in a rearwards facing seat behind the copilot's station, stated that he had glimpsed the ground shortly before the accident but could give no information indicating the cause of the accident. ", "probable_cause": null}