{"url": "https://www.baaa-acro.com/crash/mishap-beechcraft-a100-king-air-blountville", "date": "Jun 15, 2011 at 1405 LT", "type": "Beechcraft 100 King Air", "operator": "Dynamic-Aviation-2", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bridgewater - Wichita", "msn": "B-212", "yom": 1974, "flight_number": null, "city": "Blountville", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4837, "captain_hours_type": 87, "copilot_hours": 900, "copilot_hours_type": 2, "aircraft_hours": 16170, "circumstances": "The airplane was flying in instrument meteorological conditions at flight level 200 (about 20,000 feet), and a large area of thunderstorm activity was located to the northwest. About 20 miles from the thunderstorm activity, the airplane began to encounter moderate turbulence and severe icing conditions. The pilot deviated to the south; however, the turbulence increased, and the airplane entered an uncommanded left roll and dive. The autopilot disengaged, and the pilot's attitude indicator dropped. The pilot leveled the airplane at an altitude of 8,000 feet and landed without further incident. Subsequent examination revealed that one-third of the outboard left elevator separated in flight and that the empennage was substantially damaged. Meteorological and radar data revealed the airplane entered an area of rapidly intensifying convective activity, which developed along the airplane's flight path, and likely encountered convectively-induced turbulence with a high probability of significant icing. The effect of icing conditions on the initiation of the upset could not be determined; however, airframe structural icing adversely affects an airplane's performance and can result in a loss of control.", "probable_cause": "An encounter with convectively-induced turbulence and icing, which resulted in an in-flight upset and a loss of airplane control.\n"}