{"url": "https://www.baaa-acro.com/crash/crash-fairchild-f27-ibajay-14-killed", "date": "Mar 8, 1968 at 1918 LT", "type": "Fairchild F27", "operator": "Air%20Manila", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Manila - Mactan", "msn": "19", "yom": 1958, "flight_number": "UM507", "city": "Ibajay", "zone": "Aklan", "country": "Philippines", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 5709, "captain_hours_type": 158, "copilot_hours": 3300, "copilot_hours_type": 92, "aircraft_hours": 21194, "circumstances": "Flight UM507 was a scheduled domestic flight from Manila International Airport to Lapu-Lapu/Mactan International Airport. Before departure the pilot was briefed by the Air Manila dispatcher on the existence of a cold front across the route and was provided with an en-route weather forecast valid from 1200 to 2400 hours which mentioned \"Isolated thunderstorm over Eastern Visayas and generally fair elsewhere\". No information regarding thunderstorms on the route was given to the pilot. The flight took off from Manila at 1814 hours and was cleared to Mactan at FL 130 by the ATC, via Track 5, Amber 4 and Amber 1. The flight plan proposed an airspeed of 210 kt and an estimated time en route of 1 hour 45 minutes. Normal radio contact was maintained at all time between the flight and the air traffic services. At 1908 hours the flight reported over Romblon at FL 130, estimating Mactan at 1954 hours. This was the last message from the aircraft. Several residents of Ibajay, a coastal town in Aklan, stated that at approximately 1918 hours they had heard a sound similar to that of an aircraft flying at high altitude in a southeast direction along the coastline. They then heard several loud explosions and saw fireballs falling into the sea. They all agreed that the initial fire- ball they saw could not have been the result of a prolonged fire, but rather a small fire which rapidly developed into a large orange-yellow-red ball and then disappeared. After a few moments, smaller fireballs emerged from the large one, some dying out before reaching the sea, some reaching the sea and developing into a large fire. At the same time a large object resembling an airplane was seen to emerge from thick clouds and fall into the sea followed by a trail of smaller objects. Approximately one hour later two bodies were recovered from approximately 2 km offshore of Bo. Colong-Colong, Ibajay, Aklan.", "probable_cause": "The Board determined that the probable cause of the accident was an in-flight structural failure due to air loads exceeding the design strength, while flying in a thunderstorm cell. It was also determined the following:\r\n- The flight transmitted its last position report over Romblon at 1908 hours, approximately 10 minutes before the accident, and did not report any operating difficulty,\r\n- The aircraft disintegrated at a high altitude with considerable speed,\r\n- None of the aircraft parts recovered showed evidence of fatigue, or explosion due to combustible gas mixtures, or concentrated explosives such as dynamite,\r\n- Over the area at approximately the time of the accident, there were thunderstorm cells and two other flights deviated and avoided the area,\r\n- The crash location was about 10 NM right of the assigned airway,\r\n- Only two bodies were recovered; the other occupants and the rest of the wreckage could not be recovered due to the depth of the sea in the general area of the accident and their exact location is unknown. "}