{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46a-50-cu-commando-guatemala-city-2-killed", "date": "Nov 6, 1957 at 1135 LT", "type": "Curtiss C-46 Commando", "operator": "Aerovias Sud Americana", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "City", "schedule": "Guatemala City – Belize City – Saint Petersburg", "msn": "30525", "yom": 1944, "flight_number": null, "city": "Guatemala City-La Aurora", "zone": "Guatemala", "country": "Guatemala", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 2, "total_fatalities": 2, "captain_hours": 10729, "captain_hours_type": 6333, "copilot_hours": 3213, "copilot_hours_type": 710, "aircraft_hours": null, "circumstances": "The aircraft took off from Runway 01 at La Aurora Airport at 1118LT on a scheduled cargo flight to St. Petersburg, Florida via Belize City in British Honduras. It carried a crew of two and no passengers. The flight was cleared on a visual flight rules flight plan and the take-off gross weight was 44 995 lbs including 575 gallons of fuel. At 1125LT the flight advised La Aurora Airport Control Tower that it was returning for an engine check and was cleared for an approach to Runway 19 at that airport. At approximately 1135LT the aircraft was seen to crash at a point 5,029 feet above sea level in a residential area, 3.3 miles northwest of La Aurora Airport, fatally injuring one adult and one child. Three other persons on the ground and both crew members were seriously injured. The aircraft was demolished by impact and subsequent fire. ", "probable_cause": "Failure of the crankshaft on the left engine and inability of the aircraft to maintain single engine flight for reasons undetermined after failure of the other engine. The following information from a preliminary report on the crankshaft by the National Bureau of Standards, has been added at the request of the Civil Aeronautics Board, Washington: \"The crankshaft contained a large fatigue fracture that originated in the splined section in one of the spline fillets. The fatigue crack had penetrated through the crankshaft wall and progressed in both directions from the origin, initially following a spiral path at an angle of about 45 O to the axis of the shaft and then turning into a plane perpendicular to the shaft axis. The fatigue crack attained a total length of about 600 degrees before the final overload fracture occurred. This was a longitudinal break, about 2-1/2 inches long, between two loops of the spiral crack. The fillet where the fatigue crack started was poorly contoured and contained deep tool marks that evidently had contributed to the cause of the failure. In one fillet near the fracture origin the rough machining had produced an effective radius of about 0.005 inch. The drawing did not specify a minimum radius for the splines. It permitted a maximum radius of 0.015 inch. In the vicinity of the fracture the average hardness of the steel was 421 Vickers or about 43 Rockwell C. This indicates a tensile strength of about 200,000 psi. The drawing did not specify hardness or tensile strength except on case hardened surfaces, calling instead for 'Core Property P. W.A. No. 7, which presumably refers to a Pratt and Whitney heat treatment. The chemical composition of the crankshaft steel complied with the material specification in so far as specified elements were concerned. The steel contained appreciable amounts of molybdenum, chromium and copper, which were not specified, but the presence of these elements in the amounts found would not be expected to reduce the fatigue strength of the shaft. A small fatigue fracture that formed a part of a complete longitudinal break was found in the counterbalance bearing. This fracture apparently occurred because of unusually high loads imposed by the progression of the fatigue crack in the crankshaft. The hardness specified in the drawing for the counterbalance bearing was 34 to 38 Rockwell C. Vickers tests showed that the hardness in the part as submitted ranged from 279 to 354 Vickers or from about 27 to 36 Rockwell C. How- ever, the bearing showed evidence of overheating, which probably reduced the hardness in some areas. Chemical and spectrographic analyses showed that the composition of the counterbalance bearing material complied with the specification. \""}