{"url": "https://www.baaa-acro.com/crash/crash-cessna-207a-skywagon-nome-2-killed", "date": "Jun 27, 1997 at 1633 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Olson%20Air%20Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Brevig Mission - Nome", "msn": "207-0412", "yom": 1977, "flight_number": null, "city": "Nome", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1745, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12771, "circumstances": "The flight was landing under special VFR conditions. Special VFR operations are permitted with a visibility of 1 mile, and clear of clouds. The airport was the pilot's base of operations. The flight had held outside the airport surface area for 26 minutes, waiting for a special VFR clearance. While outside the airport surface area, the pilot was required to maintain 500 feet above the ground and 2 miles visibility. While holding, the weather at the airport was reported as 300 feet overcast. The visibility decreased from 4 miles to 1 mile in mist. The pilot was new to the area of operations, having worked at the company for 24 days, during which he accrued 69 hours of flight time. Four minutes after receiving clearance to enter the surface area for landing, the airplane collided with a 260 feet tall radio antenna tower at 222 feet above the ground. The tower was located 3.85 nautical miles east of the airport. The radio tower was not considered by the FAA to be an object affecting navigable airspace, but was depicted as an obstruction on the VFR sectional chart for the area. The tower was equipped with obstruction lighting for night illumination, and was painted alternating aviation orange and white for daytime marking. One minute after the collision, the overcast was reported at 200 feet, and the visibility was 5/8 mile. ", "probable_cause": "The pilot's continued VFR flight into instrument meteorological conditions, and his failure to maintain adequate clearance from an obstruction (antenna tower). Factors in the accident were low ceilings and visibility, and the pilot's lack of familiarity with the geographic area. "}