{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-159-gulfstream-i-montreal", "date": "Jul 27, 2000 at 2350 LT", "type": "Grumman G-159 Gulfstream I", "operator": "Airwave Transport", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Toronto - Montreal", "msn": "189", "yom": 1968, "flight_number": null, "city": "Montreal-Pierre-Elliott Trudeau (ex Dorval)", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Airwave flight 9806, a G-159 Gulfstream I, was flying IFR from Toronto (YYZ) to Montreal-Dorval (YUL). When it was on final for runway 06R, the pilot reported a problem with the landing gear. The crew recycled the gear and performed the emergency extension procedure unsuccessfully before trying various flight manoeuvres to free the gear. They then circled Montreal until minimum fuel was reached, declared an emergency and landed. On landing, the aircraft veered to the left and came to a halt 60 feet from the runway. Both pilots escaped uninjured and the aircraft was damaged beyond repair. ", "probable_cause": "Preliminary investigation revealed that an apprentice AME moved a line in the landing gear well prior to the flight. The work was neither scheduled nor required. The apprentice left the work unfinished when he went to do something else, then forgot that a fastener was not in place. There was no flag or note to inform the other technicians or the crew that the aircraft was not in an airworthy state. The apprentice has two years experience with this company. The management was satisfied with the quality of his work. Two other licensed AMEs were working in the hangar with the apprentice. He was the only apprentice they had to supervise. The apprentice attended a type training course for this aircraft."}