{"url": "https://www.baaa-acro.com/crash/crash-hawker-800xp-farmingdale", "date": "Dec 20, 2020 at 2035 LT", "type": "Hawker 800XP", "operator": "Talon%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Miami - Farmingdale", "msn": "258516", "yom": 2001, "flight_number": "TFF941", "city": "Farmingdale-Republic", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4188, "captain_hours_type": 2060, "copilot_hours": 10000, "copilot_hours_type": 4100, "aircraft_hours": 12731, "circumstances": "The flight crew were conducting an instrument landing system (ILS) approach in night instrument meteorological conditions when they were advised by the tower controller that the weather had deteriorated below minimums. The captain was the pilot monitoring, and the first officer was the pilot flying during the approach. Since the airplane was inside the final approach fix and stabilized, both pilots agreed to continue with the approach. Both pilots stated that they had visual contact with the runway approach lighting system at the 200 ft above ground level (agl) decision altitude, and they decided to continue the approach. The first officer said he then returned to flying the airplane via instruments. As the first officer continued the approach, the captain told him the airplane was drifting right of the runway centerline. The first officer said that he looked outside, saw that the weather had deteriorated, and was no longer comfortable with the approach. The first officer said he pressed the takeoff and go-around switch, while at the same time, the captain called for a go-around. The captain said that he called for the go-around because the airplane was not aligned with the runway. Although both pilots stated that the go-around was initiated when the airplane was about 50 to 100 ft agl, the cockpit voice recorder (CVR) recording revealed that the first officer flew an autopilot-coupled approach to 50 ft agl (per the approach procedure, a coupled approach was not authorized below 240 ft agl). As the airplane descended from 30 to 20 ft agl, the captain told the first officer three times to “flare” then informed him that the airplane was drifting to right and he needed to make a left correction to get realigned with the runway centerline. Three seconds passed before the first officer reacted by trying to initiate transfer control of the airplane to the captain. The captain did not take control of the airplane and called for a go-around. The first officer then added full power and called for the flaps to be retracted to 15º; however, the airplane impacted the ground about 5 seconds later, resulting in substantial damage to the fuselage. Data downloaded from both engines’ digital electronic engine control units revealed no anomalies. No mechanical issues with the airplane or engines were reported by either crew member or the operator. The sequence of events identified in the CVR recording revealed that the approach most likely became unstabilized after the autopilot was disconnected and when the first officer lost visual contact with the runway environment. The captain, who had the runway in sight, delayed calling for a go-around after the approach became unstabilized, and the airplane was too low to recover.", "probable_cause": "The flight crew’s delayed decision to initiate a go-around after the approach had become unstabilized, which resulted in a hard landing."}