{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-500tp-malibu-meridian-port-orange-2-killed", "date": "Dec 17, 2003 at 0933 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "BME Air Ranch", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Port Orange – Lufkin", "msn": "46-97053", "yom": 2001, "flight_number": null, "city": "Port Orange-Spruce Creek", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1914, "captain_hours_type": 36, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 30, "circumstances": "The airplane was destroyed when it impacted trees and terrain following an in-flight loss of control during climb after takeoff. Meteorological information indicates that the cloud ceilings were between 1,200 and 1,700 feet above ground level at the time of the accident. While airborne, the accident pilot reported to another pilot that the cloud ceiling was 1,500 feet. Radar data shows that the airplane flight profile became erratic once it had climbed above about 1,700 feet pressure altitude. The final flight path sequence depicted by the radar data shows a right-hand turn of decreasing radius with an associated rapid rate of descent. The last radar return coincided with the accident location. The non-instrument rated pilot had logged 7.0 hours of simulated instrument experience. The pilot had logged 35.8 hours in the same make and model as the accident airplane, of which, all but 0.3 hours was listed as crosscountry time. No records of training in the same make and model airplane were discovered. No pre-impact mechanical deficiencies were found during the post-accident examination of the wreckage.", "probable_cause": "The unqualified pilot's continued flight into known instrument meteorological conditions which resulted in spatial disorientation and subsequent loss of aircraft control. Factors were the pilot's lack of instrument flight experience and the low ceiling."}