{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh80-puss-moth-sliders-farm-2-killed", "date": "Sep 5, 1936 at 1807 LT", "type": "De Havilland DH.80 Puss Moth", "operator": "Air Taxis", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Kenley – Brighton", "msn": "2111", "yom": 1930, "flight_number": null, "city": "Danehill", "zone": "East Sussex", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the day of the fatal crash, Air Taxis Ltd had not authorized the flight, although in the past they had allowed Tonge to use the Puss Moth for his own pleasure at weekends if it wasn't required for business. The passenger, Scrase, was apparently only slightly acquainted with the pilot - which didn't stop them drinking in a pub together through the afternoon. At 16.30 the pair arrived at the hangar and Scrase was installed in the plane - Tonge then asked the mechanic if he could tell him the compass course to Brighton. They took off, but G-ADLP landed a few minutes later at Kenley where the pilot sought out a friend and, together with his passenger, they retired to a pub for over an hour. It was reported that Tonge sank two pints in that time, and Scrase three. At 17.55 hours the pilot and passenger returned to the machine and took off to continue their journey to Brighton, but before leaving the vicinity of Kenley, the pilot made several steep dives at the aerodrome buildings. The Puss Moth then departed at a height of 1500 feet. About ten minutes later the aeroplane was seen flying over Ashdown Forest at around 600 feet - it descended and circled around an open space at Wych Cross, then headed south. After two miles G-ADLP was then seen to circle a football field twice, and head south again at 500 feet. A minute later the aircraft descended towards a field which, however, was obstructed by power cables - at a height of 30 feet, the engine was 'opened up' and the Puss Moth climbed away steeply to 1000 feet. It then appeared to commence a turn whilst still climbing, and it immediately fell into a spin which continued until the aircraft plunged into some trees. The first person to reach the scene found the pilot dead with extensive head injuries. The passenger was laid over the pilot's shoulder and, in a semi conscious condition, he uttered; \"1,500 feet. 1,000 feet, we're falling: Can't you do something man! 500 feet Oh God!\". There was a very pronounced smell of alcohol in the cabin, and particularly from the passenger's breath.\r\nSource:\r\nhttp://sussexhistoryforum.co.uk/index.php?topic=892.0;wap2", "probable_cause": "The Inquiry by the Air Ministry came to three opinions in the case:\r\na) That the pilot committed an error of judgement in allowing his aircraft to stall and spin - it was also possible that the passenger (whose safety belt wasn't fastened) had interfered with the pilot in such a manner as to prevent Tonge having full use of the controls.\r\nb) That the pilot, for some reason, had tried to find a place to land but none of the grounds he approached were suitable.\r\nc) That both Tonge and Scrace were to a certain extent under the influence of alcohol."}