{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e18s-mabie-2-killed", "date": "Mar 6, 1997 at 0021 LT", "type": "Beechcraft E18", "operator": "Polaris Aviation", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Sanford - Detroit", "msn": "BA-56", "yom": 1955, "flight_number": null, "city": "Mabie", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2000, "captain_hours_type": 30, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11196, "circumstances": "The flight had been delayed due to severe weather over the departure airport. The preflight weather briefing received by the pilot included AIRMETS and SIGMETS for icing and severe thunderstorms, possible tornadoes, hail to 2 inches, and wind gusts to 70 knots near the ground. The Beech 18 was not equipped with a storm scope or weather radar. Prior to takeoff, a passenger stated to a witness that the weather was 'really really bad,' and that they would have to 'do some deviating to get around it.' After takeoff, the airplane cruised at 10,000 feet uneventfully for 1 hour and 50 minutes, when a center controller advised that radar contact was lost, which the pilot acknowledged. The next and last transmission occurred 13 minutes later when the controller received a 'Mayday' radio transmission that the airplane was 'going down.' The last radar target revealed a 6,000 foot per minute rate of descent. Training records revealed the pilot, also the company chief pilot, had flown solo 6.3 hours in the Beech 18 and credited it as dual flight instruction. He then passed a Part 135 evaluation with the FAA Principal Operations Inspector (POI), which lasted 1.6 hours. The next day the POI issued the pilot check airmen authorization for the Beech 18, all models. According to the POI, the airplane was not approved for Part 135 operations; however, the company had a bogus approval for the airplane, signed by the POI, that allowed the company to apply to Canadian Authorities for authorization to operate in Canada. The bogus approval had been used to justify the accident flight. ", "probable_cause": "The pilot's disregard of the preflight weather briefing for severe weather along his route of flight, and his departure into the known and forecasted severe weather. A factor in the accident was the inadequate FAA oversight of the operator, which fostered an attitude of rule bending. "}