{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-coatesville-2-killed", "date": "Jan 10, 2000 at 0519 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "N3193X Bonanza Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Millville – Coatesville", "msn": "61-0308-081", "yom": 1976, "flight_number": null, "city": "Coatesville-Chester County-G. O. Carlson", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 350, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While operating in IMC, the pilot was vectored to the final approach course for an ILS approach. Weather at the airport was ceiling 200 feet and visibility 3/4 mile in mist. The pilot was cleared for the approach, which he acknowledged. No other transmissions were received from the accident airplane. Radar data showed the airplane intercept the final approach course, then track inbound. The airplane crossed the outer marker 420 feet below the glide slope. The last radar return showed the airplane at 440 feet agl, 3.9 miles from the runway. The airplane impacted the ground at a shallow angle about 1 mile north of the airport on the opposite side of the missed approach procedure. The elevation of the accident site was approximately 40 feet lower than the airport. The pilot had about 350 hours of total flight\r\nexperience. No pre-impact failures were identified with the airframe, engines, flight controls, or flight instruments. ", "probable_cause": "The pilot's failure to follow the published instrument approach procedure, and his failure to establish a climb after passing the missed approach point. "}