{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-near-lutsel-ke-2-killed", "date": "Oct 4, 2011 at 1140 LT", "type": "Cessna 208B Grand Caravan", "operator": "Air%20Tindi", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Yellowknife - Lutsel K'e", "msn": "208B-0308", "yom": 1992, "flight_number": "8T200", "city": "Lutsel K'e", "zone": "Northwest Territories", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1950, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Air Tindi Ltd. Cessna 208B Caravan departed Yellowknife, Northwest Territories, at 1103 Mountain Daylight Time under visual flight rules as regularly scheduled flight Air Tindi 200 (8T200) to Lutsel K'e, Northwest Territories. When the aircraft did not arrive at its scheduled time, a search was initiated, and the aircraft was found 26 nautical miles west of Lutsel K'e, near the crest of Pehtei Peninsula. The pilot and one passenger were fatally injured, and two passengers were seriously injured. There was no post-impact fire, and no emergency locator transmitter signal was received by the Joint Rescue Coordination Centre or search aircraft.\n", "probable_cause": "Findings as to causes and contributing factors:\r\nThe aircraft was flown at low altitude into an area of low forward visibility during a day VFR flight, which prevented the pilot from seeing and avoiding terrain.\r\nThe concentrations of cannabinoids were sufficient to have caused impairment in pilot performance and decision-making on the accident flight.\r\nFindings as to risk:\r\nInstallation instructions for the ELT did not provide a means of determining the necessary degree of strap tightness to prevent the ELT from being ejected from its mount during an accident. Resultant damages to the ELT and antenna connections could preclude transmission of an effective signal, affecting search and rescue of the aircraft and occupants.\r\nFlying beyond gliding distance of land without personal floatation devices on board exposes the occupants to hypothermia and/or drowning in the event of a ditching.\r\nOther findings:\r\nEarlier on the day of the accident, the pilot flew the route from Fort Simpson to Yellowknife in cloud on a visual flight rules flight plan in controlled airspace.\r\nWith the ELT unable to transmit a useable signal, the SkyTrac system in C GATV was instrumental in locating the accident site. This reduced the search time, and allowed for timely rescue of the seriously injured survivors."}