{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-moomba-1-killed", "date": "Jun 15, 1983 at 1140 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Champion%20Air%20Adelaide", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Adelaide – Moomba – Dullingari", "msn": "31-7405425", "yom": 1974, "flight_number": null, "city": "Moomba", "zone": "South Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was engaged on a charter flight from Adelaide to Moomba and Dullingari. The flight from Adelaide to Moomba was without incident and after landing the pilot parked the aircraft adjacent to the refuelling cabinets. He then assisted the passengers from the aircraft and removed baggage from the nose locker. During this period a conversation took place between the pilot and the aircraft refueller. The exact content of that conversation could not positively be determined but it appears that the pilot did not specify the type of fuel to be placed in the aircraft, only which tanks were to be fuelled. As the refueller was fuelling the aircraft, the pilot accompanied his passengers to the airport terminal. When the fuelling was completed the pilot returned, with his passengers, to the aircraft. He signed the fuel release note which showed that 263 litres of Jet A-1 (Aviation turbine fuel) had been supplied, then completed a check of the aircraft's fuel tanks to ensure no water was present in the fuel. The pilot reported that the fuel sample taken was free of water and appeared to him to be the normal fuel used by the PA-31 aircraft, AVGAS (Aviation Gasoline). The pilot and the passengers then boarded the aircraft, the engines were started and the aircraft taxied for a DEPARTURE on runway 12. During the taxiing phase the pilot completed the pre-take-off checks, these including a check that the temperatures and pressure relevant to the operation of the engine were within limits. The pilot subsequently advised that the take-off was normal and after the landing gear was raised, engine power was reduced to the standard settings for the climb. However, at about 500 feet above ground level the pilot sensed a loss of performance and noted that the indicated airspeed was 115 knots, 5 knots lower than normal. He then noticed a further decay in airspeed, accompanied by the onset of engine surging and rough running. He was unable to diagnose the cause of the loss of performance and commenced a turn back towards the aerodrome. Shortly after entering the turn the right hand engine began to misfire and feathering action was initiated for the propeller. At about this time the indicated airspeed had reduced to 85 knots, the aircraft had developed a high rate of sink and the pilot realised that impact with the ground was imminent. The aircraft initially struck the ground with the right wing, then the nose section before the fuselage made heavy contact in a flat attitude, sliding about 45 metres before coming to rest. The aircraft caught fire during the impact sequence and was completely burnt out. The pilot and two of the passengers escaped from the wreckage but attempts to assist the third passenger were thwarted by the fire. ", "probable_cause": "The investigation established that JET-A1 fuel had been added to the fuel tanks of VH-DVX, and of the total fuel in the tank approximately 68 percent was JET-A1 fuel. The type of engine fitted to VH-DVX is not compatible with the use of JET-A1 fuel."}