{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-26-islander-baie-comeau-7-killed", "date": "Dec 7, 1998 at 1111 LT", "type": "Britten-Norman Islander", "operator": "Air%20Satellite.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Baie-Comeau – Rimouski", "msn": "2028", "yom": 1981, "flight_number": "ASJ501", "city": "Baie-Comeau", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 1000, "captain_hours_type": 400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9778, "circumstances": "Air Satellite=s Flight 501 was scheduled to fly from the airport at Baie-Comeau, Quebec, to Rimouski. After a five-hour delay because of adverse weather conditions, the Britten-Norman aircraft, serial number 2028, took off at 1109 eastern standard time. Eight passengers and two pilots were on board. The reported ceiling was 800 feet, the sky was obscured, and visibility was 0.5 statute mile in moderate snow showers. Shortly after take-off, the aircraft, which was climbing at approximately 500 feet above sea level, pitched up suddenly and became unstable when the flaps were retracted while entering the cloud layer. The pilot-in-command pushed the control column down to level the aircraft. After deciding that the aircraft could not safely continue the flight, he began turning left to return to Baie-Comeau. While turning, the aircraft rolled rapidly to the left and began to dive. The aircraft crashed into the St. Lawrence River approximately 0.5 nautical mile from shore and less than 1 nautical mile from the airport. Four passengers were fatally injured in the crash. Two passengers died while awaiting rescue, which came 98 minutes after take-off. The body of the co-pilot was carried away by the current and has not been recovered. The pilot-in-command and two passengers sustained serious injuries.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The aircraft took off with contaminated surfaces, without an inspection by the pilot-in-command. This contamination contributed to reducing the aircraft' performance and to the subsequent stall. \r\n2. At take-off, the aircraft was more than 200 pounds over the maximum allowable take-off weight. This added weight contributed to reducing the aircraft's performance.\r\n3. During the initial climbout, the pilot-in-command did not follow the recommended procedure when he entered an area of wind shear. Consequently, the aircraft lost more speed, contributing to the stall.\r\n4. Insufficient altitude was available for the pilot to recover from the stall and avoid striking the water.\r\n5. The co-pilot's shoulder harness was not installed properly. The co-pilot received serious head injuries because she was not restrained.\r\nFindings as to Risk\r\n1. The crew's lack of experience in the existing conditions was not conducive to effective decision making during the pre-flight planning and the flight.\r\n2. The stall warning system was defective and, in other circumstances, could not have alerted the crew of an impending stall.\r\n3. The crew did not transmit an emergency message after the pilot-in-command decided to return to Baie-Comeau for landing. This lack of a message delayed the rescue operation. \r\n4. The emergency signal was not received by the Mont-Joli Flight Service Station because the Baie-Comeau remote communications outlet (RCO) was not equipped with the 121.5 MHz emergency frequency. The RCO was not required to be equipped with the emergency frequency.\r\n5. The emergency locator transmitter (ELT) was not installed in accordance with Britten-Norman's instructions. The ELT's installation on the floor of the aircraft increased the risk of damage.\r\n6. Transport Canada did not comply with its established audit standards for regulatory audits of the operator, thus increasing the risk that training and operational deficiencies would not be identified.\r\n7. The emergency signal probably ceased after the ELT was ejected from its mounting plate and the antenna connection contacted the water. The ejection contributed to reducing the signal and\r\nprevented the SARSAT (search and rescue satellite-aided tracking) system from validating the \r\n8. One of the occupants might have had a greater chance of survival had lifejackets been on-board the aircraft. Existing regulations did not require life jackets to be carried on board.\r\n9. The aircraft had numerous mechanical deficiencies that should have been detected by Air Satellite's staff.\r\n10. According to the Baie-Comeau airport emergency plan, a helicopter could be used only after confirmation of a crash in water. The emergency response time was therefore longer than it could\r\nhave been. \r\n11. The configuration of the instrument panel made it difficult to read and interpret the flight instruments from the co-pilot's seat.\r\n12. Air Satellite's manual of standard operating procedures did not promote effective crew coordination.\r\n13. The pilot-in-command and the co-pilot had not taken courses in crew resource management or pilot decision making. These courses would have promoted effective crew coordination but were not required under existing regulations.\r\n14. The high turnover of flight personnel and the repeated changes in the position of company chief pilot did not allow adequate supervision of operations."}