{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-putnam-5-killed", "date": "Feb 14, 1990 at 0753 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Williams Aviation", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Midland - Dallas", "msn": "795", "yom": 1980, "flight_number": null, "city": "Putnam", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 10327, "captain_hours_type": 35, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2600, "circumstances": "Before takeoff, San Angelo AFSS briefer told the pilot computers were down in south Texas for 1.5 hours and no current weather info was available. Current weather info was available at nws at Midland and FSS's at Midland, McAlester and De Ridder, but the pilot didn't call these, nor did the briefer advise him to do so. Pilot didn't update weather in flight. About 38 minutes after takeoff, in area of potential icing, aircraft slowed from 270 to 150 knots ground speed in 4 minutes, then slowed to 100 knots in next 12 seconds. About 33 seconds before reaching 100 knots, pilot requested descent from 15,000 feet to 13,000 feet. At that time, true ground track was approximately 080° with wind aloft about 213° at 43 knots. Before ATC could clear descent, aircraft descended to 14,800 feet, then radar contact was lost after one return at 9,700 feet. Descent rate between last 2 altitudes: 12,750 fpm. No preimpact malfunction was found. IMC existed above 12,500 feet. Freezing level was forecasted at 10,000 feet to 12,000 feet. Aircraft was certified for flight in known icing conditions, but status of anti-ice/deice equipment wasn't determined due to impact/fire damage. Low levels of ethanol were found in tox samples from all occupants; however, there was evidence that the tox samples were unreliable. All five occupants were killed. ", "probable_cause": "Improper planning/decision by the pilot, which resulted in excessive accumulation of structural icing (on the aircraft's wings, stabilizers, fuselage, and/or engine inlets), and his failure to maintain adequate airspeed and aircraft control. Factors related to the accident were: the pilot's inadequate weather evaluation due to lack of available information at the automated flight service station (AFSS), his failure to obtain additional information from other weather stations (either before takeoff or during the flight), his lack of experience in this make and model of aircraft, and icing conditions at cruise altitude."}