{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-12-novosibirsk-25-killed", "date": "May 13, 1949 at 1410 LT", "type": "Ilyushin II-12", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow – Omsk – Novosibirsk – Krasnoyarsk", "msn": "93013208", "yom": 1949, "flight_number": null, "city": "Novosibirsk", "zone": "Novosibirsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 20, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 25, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 51, "circumstances": "While descending to Novosibirsk Airport, the crew encountered bad weather conditions with thunderstorm activity, low clouds, poor visibility, hail and turbulences. On approach, lightning hit the cockpit. The copilot and the flight engineer were seriously injured and lost consciousness. The copilot fell onto the control column and the captain tried to maintain a directional control. Shortly later, the aircraft banked right to 65° and then dove into the ground and crashed in flames in a field located 12 km from the airport. The aircraft was destroyed by impact forces and a post crash fire and all 25 occupants were killed. ", "probable_cause": "The loss of control on approach was caused by adverse weather conditions resulting from a violent storm consisting of hail and turbulences. Investigations revealed that lightning struck the cockpit and that two crew members were seriously injured and lost consciousness, making it difficult to continue the flight. Investigators blamed the pilots who started the approach in such weather conditions but nevertheless hold that they were not properly briefed by meteorologists. It was concluded that the crash was the combination of the following factors: unexpected weather conditions, wrong decisions on part of the flying crew, poor management on part of the flight control service, lack of communication between the different departments involved and difficulties with radio contacts. "}