{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-near-kharat-1-killed", "date": "Nov 13, 1974 at 0725 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Ulan-Ude – Krasnoyarsk - Novosibirsk – Omsk – Petropavl – Kurgan – Chelyabinsk – Ufa", "msn": "184 403 07", "yom": 1951, "flight_number": null, "city": "Kharat", "zone": "Irkutsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6945, "circumstances": "The airplane departed Ulan-Ude at 0700LT on a cargo flight to Ufa with intermediate stops in Krasnoyarsk, Novosibirsk, Omsk, Petropavl, Kurgan and Chelyabinsk, carrying five crew members, three passengers and a load of 663 kg of various goods. About 20 minutes after takeoff, while cruising at an altitude of 2,400 meters, a passenger announced to the crew that a fire erupted in the rear part of the cabin. Smoke spread in the cabin and the cockpit and as the crew was unable to extinguish the fire, the captain decided to reduce his altitude and attempted an emergency landing in a prairie. The aircraft crash landed and came to rest in flames in an open field located 4 km from the village of Kharat. All eight occupants escaped while the aircraft was partially destroyed by fire. 40 hours later, a female passenger died from her injuries. ", "probable_cause": "The aircraft was carrying several wooden crates containing bottles of 20 liters of flammable products placed on a carpet of wood chips. It is believed that these boxes had been used many times in the past but had not been cleaned and the wood chips were soaked with flammable products, maybe because some of the bottles were not properly sealed. In flight, the hot air pulsed into the cabin via the heating system caused the wood chips to burn and the fire could not be extinguished by the crew."}