{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-thornton-peak-4-killed", "date": "Apr 10, 2001 at 0725 LT", "type": "Rockwell Shrike Commander 500", "operator": "Reefwatch%20Air%20Tours", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Cairns - Hicks Island", "msn": "500-3152", "yom": 1973, "flight_number": null, "city": "Thornton Peak", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 9680, "captain_hours_type": 2402, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Cairns airport at 0707 Eastern Standard Time (EST) on a charter flight to Hicks Island. The aircraft was being operated under the Instrument Flight Rules (IFR) and the expected flight time was 2 hours. Shortly after takeoff the pilot requested an amended altitude of 4,000 ft. He indicated that he was able to continue flight with visual reference to the ground or water. Air Traffic Services (ATS) issued the amended altitude as requested. The IFR Lowest Safe Altitude for the initial route sector to be flown was 6,000 ft Above Mean Sea Level (AMSL). Data recorded by ATS indicated that approximately 13 minutes after departure, the aircraft disappeared from radar at a position 46NM north of Cairns. At the last known radar position the aircraft was cruising at a ground speed of 180 kts and at an altitude of 4,000 ft AMSL. An extensive search located the wreckage the following afternoon at a location consistent with the last known radar position, on the north-western side of Thornton Peak at an altitude of approximately 4,000 ft (1219 metres) AMSL. The aircraft was destroyed by impact forces and post-impact fire. The pilot and three passengers received fatal injuries. Thornton Peak is the third highest mountain in Queensland and is marked on topographic maps as 4,507 ft (1,374 metres) in elevation. Local residents reported that the mountain was covered by cloud and swept by strong winds for most of the year. The aircraft had been observed by witnesses approximately two minutes prior to impact cruising at high speed, on a constant north-westerly heading, in a wings level attitude and with flaps and landing gear retracted. They stated that the engines appeared to sound normal.", "probable_cause": "Radar data recorded by Air Traffic Services and witness reports indicated that the aircraft was flying straight and level and maintaining a constant airspeed. Therefore, it is unlikely that the aircraft was experiencing any instrumentation or engine problems. Why the pilot continued flight into marginal weather conditions at an altitude that was insufficient to ensure terrain clearance, could not be established. The aircraft was flown at an altitude that was insufficient to ensure terrain clearance."}