{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-21a-goose-unalaska", "date": "Apr 9, 2008 at 1630 LT", "type": "Grumman G-21A Goose", "operator": "PenAir-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Akutan - Unalaska", "msn": "B097", "yom": 1944, "flight_number": null, "city": "Unalaska", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7040, "captain_hours_type": 320, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12228, "circumstances": "The airline transport pilot was on an approach to land on Runway 30 at the conclusion of a visual flight rules (VFR)scheduled commuter flight. Through a series of radio microphone clicks, he activated threshold warning lights for vehicle traffic on a roadway that passes in front of the threshold of Runway 30. Gates that were supposed to work in concert with the lights and block the runway from vehicle traffic were not operative. On final approach, the pilot, who was aware that the gates were not working, noticed a large truck and trailer stopped adjacent to the landing threshold. As he neared the runway, he realized that the truck was moving in front of the threshold area. The pilot attempted to go around, but the airplane's belly struck the top of the trailer and the airplane descended out of control to the runway, sustaining structural damage. The truck driver reported that, as he approached the runway threshold, he saw the flashing red warning lights, but that the gates were not closed. He waited for about 45 seconds and looked for any landing traffic and, seeing none, drove onto the road in front of the threshold. As he did so, he felt the airplane impact the trailer, and saw it hit the runway. The accident truck's trailer is about 45 feet long and 13 feet tall. The Federal Aviation Administration (FAA) Facility Directory/Alaska Supplement recommends that pilots maintain a 25-foot minimum threshold crossing height. The NTSB's investigation revealed that the gate system had been out of service for more than a year due to budgetary constraints, and that there was no Notice to Airman (NOTAM) issued concerning the inoperative gate system. The FAA certificated airport is owned and operated by the State of Alaska. According to the Airport Certification Manual, the airport manager is responsible to inspect, maintain, and repair airport facilities to ensure safe operations. Additionally, the airport manager is responsible for publishing NOTAM's concerning hazardous conditions. A 10-year review of annual FAA certification and compliance inspection forms revealed no discrepancy listed for the inoperative gates until 16 days after the accident.", "probable_cause": "The pilot's failure to maintain clearance from a truck while landing, and the vehicle operator's decision to ignore runway warning signals. Contributing to the accident was an inoperative vehicle gate system and the failure of airport management to adequately maintain the gate system and issue a NOTAM."}