{"url": "https://www.baaa-acro.com/crash/crash-quest-kodiak-100-pskov", "date": "Jul 6, 2015 at 1618 LT", "type": "Quest Kodiak 100", "operator": "Viridian", "flight_phase": "Takeoff (climb)", "flight_type": "Delivery", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Riga – Pskov – Krutitsy", "msn": "100-0104", "yom": 2013, "flight_number": null, "city": "Pskov AFB", "zone": "Pskov oblast", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 470, "captain_hours_type": 52, "copilot_hours": 1041, "copilot_hours_type": 10, "aircraft_hours": 391, "circumstances": "On 03.07.2015 at 15:05, Kodiak-100 N642RM airplane, which had left Riga AP (Latvia), performed a landing at Pskov AD (RF). The airplane was performing a ferry flight from USA (where it was bought) to Krutitsy landing site, which is 80 km to the Southeast from Ryazan (RF). After the landing, flight crewmembers and passengers passed a border and customs control successfully. The aircraft was kept at Pskov AD from July 3 till July 6 under custody of AASS of Pskovavia (JSC). On 06.07.2015 at 08:00, the flight crew – PIC and FO – arrived to Pskov AD with a view to the ferry flight resumption. PIC was planning to fly the aircraft from Pskov AD to Krutitsy landing site on 06.07.2015. In violation of FAP MA CA and FAP-128 requirements, PIC and FO didn't pass a preflight medical check in spite of the fact that Pskovavia medical service was available at the aerodrome. Before the takeoff, two flight crewmembers were in the cockpit: PIC occupying a left seat, and FO occupying a right seat. Both were secured with safety belts. At 13:15:30, PIC performed a takeoff from Pskov AD with MH=190°. According to the flight crew explanatory reports, during the climbing with left turn, they had the engine troubles. Therefore, the flight crew put the airplane into gliding. They failed to re-start the engine in flight. Before the emergency landing, they cut the fuel off and de-energized the aircraft. The landing was performed at 13:18 to a marshy area with some bushes and individual trees around. The aircraft received significant damage during the landing. There was no fire: neither in flight nor on the ground. At 13:21:21, FO reported the forced landing to ATC controller, using the aircraft radio station. Pskov First-Aid Station suggested the help, but the flight crewmembers refused because they did not have any injuries.", "probable_cause": "The accident with Kodiak 100 N642RM aircraft occurred when performing a forced landing to the forest. According to the flight crewmembers explanations, the need of this forced landing was caused by the engine power loss in flight. Conducted examinations of engine, rotor and fuel system did not reveal any issue that can cause the power plant loss of power. Because FDIS SD data card from the central display, which storages all recorded power plant flight parameters was lost, it was not possible to access the engine operability and the flight crewmembers' actions in full."}