{"url": "https://www.baaa-acro.com/crash/crash-junkers-ju523mg4e-piz-segnas-20-killed", "date": "Aug 4, 2018 at 1657 LT", "type": "Junkers JU.52", "operator": "JU-Air", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Locarno - Dübendorf", "msn": "6595", "yom": 1939, "flight_number": null, "city": "Piz Segnas", "zone": "Glarus", "country": "Switzerland", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 17, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": 20714, "captain_hours_type": 297, "copilot_hours": 19751, "copilot_hours_type": 945, "aircraft_hours": 10189, "circumstances": "At 16:14 on 4 August 2018, the historic Junkers Ju 52/3m g4e commercial aircraft, registered as HB-HOT and operated by Ju-Air, took off from Locarno Aerodrome (LSZL) for a commercial VFR flight to Dübendorf (LSMD). On this flight, pilot A was sitting in the left-hand seat in the cockpit and piloting the aircraft as the commander, while pilot B was assisting him as the co-pilot sitting on the right. Following take-off from concrete runway 26R westwards and a 180-degree turn over Lake Maggiore, the flight led into the Blenio valley via Bellinzona and Biasca. HB-HOT steadily gained altitude in the process. North of Olivone, the aircraft turned into the valley of the Lago di Luzzone reservoir and thus into the Adula/Greina/Medels/Vals countryside preservation quiet zone. This zone was crossed at between 120 and 300 m above ground and at times with a minimal lateral separation from the terrain. At 16:45, as the aircraft was flying over Alp Nadels, the ISP sent a text message to a friend in Ruschein (municipality of Ilanz) to say that the Ju 52 was approaching the area. The flight subsequently continued eastwards into the Surselva region at approximately 2,500 m AMSL. At 16:51, the aircraft crossed the Vorderrhein valley in the region of Ilanz on a north-easterly heading and initially made a relatively tight left turn, taking it over Ruschein. The flight path then led generally northwards past the Crap Sogn Gion mountain and towards the basin south-west of Piz Segnas. At first, the aircraft approached this basin on the left-hand, western side of the valley. HB-HOT was climbing at this time, and reached an altitude of 2,833 m AMSL in the Nagens region. The aircraft made a slight right turn when flying past the Berghaus Nagens lodge (see figure 2). During this phase, at 16:55, one of the pilots informed the passengers of the scenery over the speakers in the cabin and through the passengers’ personal headphones. To start with, the aircraft was flying at a ground speed of 165 km/h during this phase. By point F2, the ground speed had decreased to 135 km/h, and roughly remained so until shortly before point F3. Towards point F3, the aircraft’s altitude dropped slightly and the ground speed briefly increased by around 65 km/h to approximately 200 km/h. During this time, its pitch attitude3 was 5 to 7 degrees. Towards the end of this phase, just before point F4, the flight path angle4 changed from -3 degrees to approximately -1 degree and the speed of each of the three engines decreased steadily by approximately 20 revolutions per minute (rpm). At point F4, the aircraft was at an altitude of 2,742 m AMSL. At 16:56:02, shortly after point F4, the speed of each of the three engines increased by approximately 40 rpm. At 16:56:09, HB-HOT entered the basin southwest of Piz Segnas at an altitude of 2,755 m AMSL (point F5, see also figure 14) and was therefore approximately 130 m above the elevation of the Segnes pass. The flight crew then navigated the aircraft on a north-north-easterly heading almost in the centre of the valley. HB-HOT climbed slightly during this phase and its flight path angle was approximately 2 degrees; its pitch angle remained at 5 to 7 degrees. At 16:56:17, the aircraft reached an altitude of 2,767 m AMSL at point F7 and was therefore approximately 140 m above the elevation of the Segnes pass. HB-HOT flew past the Tschingelhörner mountain peaks and began to reduce in altitude, dropping more than 15 m in approximately 6 seconds. During this phase, the power of the engines was rapidly reduced by 30 to 50 rpm, which meant that the engines were increasingly running at a similar speed5 . During this process, the pitch angle increased and the flight path angle continuously became more negative. When the aircraft was approximately abeam the Martinsloch and at an altitude of approximately 2,766 m AMSL (point F8), the flight crew initiated a right turn during their descent and then made a left turn (point F109, see figure 5). The ground speed was approximately 170 km/h and the difference between the aircraft’s pitch and flight path angles increased to approximately 15 degrees during the right turn. When transitioning into the left turn (between points F9 and F10), the pitch angle was approximately 11 degrees and the flight path angle was around -10 degrees. At this time, the aircraft was flying at approximately 125 m above the elevation of the Segnes pass (see figure 3). During roughly the next 4 seconds, the aircraft descended by 25 m and the already negative flight path angle became even more negative, which is clearly apparent when comparing figures 3 and 4 as well as in figure 5. After point F13, the roll to the left increased steadily and did not decrease even when a significant aileron deflection to the right was made. The ailerons were then brought into a neutral position and temporarily deflected into a position for a left turn. At the same time, the pitch attitude began to decrease and the flight path ran increasingly steeper downwards whilst the left bank attitude constantly increased (see figure 6). During this last flight phase, the aircraft experienced low-frequency vibrations. Ultimately, when the aircraft was 108 m above ground (point F16, see figures 6 and 7), its longitudinal axis was pointing downwards by 68 degrees from horizontal. By this time, the elevator had deflected upwards by approximately 13 degrees and the rudder was pointing 2 degrees to the right. The speeds of the three engines had increased slightly compared to the beginning of the downward spiral trajectory and were between 1,720 and 1,750 rpm shortly before impact. The roll to the left accelerated significantly during this phase. Shortly after 16:57, the aircraft hit the ground in a vertical flight attitude with an almost vertical flight path and at a speed of approximately 200 km/h (see figure 8). All 20 people on board the aircraft lost their lives in the accident. The aircraft was destroyed. Fire did not break out. Reconstructions revealed that, at the time of the accident, HB-HOT’s centre of gravity was at 2.071 m behind the wing’s leading edge (see annex A1.6). In the images and video footage available that had been captured from inside HB-HOT, there was no evidence of anyone moving within the aircraft or not sitting in their seat between the period when the aeroplane entered the basin south-west of Piz Segnas and up to the beginning of its downward spiral trajectory. A detailed description of the reconstruction of the flight path and an illustration of the relevant parameters between position F1 and the site of the accident can be found in section 1.11.2. More information regarding the background and history of the flight can be found in annex A1.1.", "probable_cause": "Direct cause:\r\nThe accident is attributable to the fact that after losing control of the aircraft there was insufficient space to regain control, thus the aircraft collided with the terrain.\r\nThe investigation identified the following direct causal factors of the accident:\r\n- The flight crew piloted the aircraft in a very high-risk manner by navigating it into a narrow valley at low altitude and with no possibility of an alternative flight path.\r\n- The flight crew chose a dangerously low airspeed as regard to the flight path. Both factors meant that the turbulence which was to be expected in such circumstances was able to lead not only to a short-term stall with loss of control but also to an unrectifiable situation.\r\nDirectly contributory factors:\r\nThe investigation identified the following factors as directly contributing to the accident:\r\n- The flight crew was accustomed to not complying with recognized rules for safe flight operations and taking high risks.\r\n- The aircraft involved in the accident was operated with a centre of gravity position that was beyond the rear limit. This situation facilitated the loss of control.\r\nSystemic cause:\r\nThe investigation identified the following systemic cause of the accident:\r\n- The requirements for operating the aircraft in commercial air transport operations with regard to the legal basis applicable at the time of the accident were\r\nnot met.\r\nSystemically contributory factors:\r\nThe investigation identified the following factors as systemically contributing to the accident:\r\n- Due to the air operator’s inadequate working equipment, it was not possible to calculate the accurate mass and centre of gravity of its Ju 52 aircraft.\r\n- In particular, the air operator’s flight crews who were trained as Air Force pilots seemed to be accustomed to systematically failing to comply with generally recognized aviation rules and to taking high risks when flying Ju 52 aircraft.\r\n- The air operator failed to identify or prevent both the deficits and risks which occurred during operations and the frequent violation of rules by its flight crews.\r\n- Numerous incidents, including several serious incidents, were not reported to the competent bodies and authorities. This meant that they were unable to take\r\nmeasures to improve safety.\r\n- The supervisory authority failed to some extent to identify the numerous operational shortcomings and risks or to take effective, corrective action. \r\nOther risks:\r\nThe investigation identified the following factors to risk, which had no or no demonstrable effect on the occurrence of the accident, but which should nevertheless be eliminated in order to improve aviation safety:\r\n- The aircraft was in poor technical condition.\r\n- The aircraft was no longer able to achieve the originally demonstrated flight performance.\r\n- The maintenance of the air operator’s aircraft was not organized in a manner that was conducive to the objective.\r\n- The training of flight crews with regard to the specific requirements for flight operations and crew resource management was inadequate.\r\n- The flight crews had not been familiarized with all critical situations regarding the behavior of the aircraft in the event of a stall.\r\n- The supervisory authority failed to identify numerous technical shortcomings or to take corrective action.\r\n- The expertise of the individuals employed by the air operator, maintenance companies and the supervisory authority was in parts insufficient."}