{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2t-islander-kiunga-12-killed", "date": "Apr 13, 2016 at 1420 LT", "type": "Britten-Norman Islander", "operator": "Sunbird-Aviation.png", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Oksapmin – Kiunga", "msn": "3010", "yom": 1983, "flight_number": null, "city": "Kiunga", "zone": "Western (Fly)", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 4705, "captain_hours_type": 254, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2407, "circumstances": "On the afternoon of 13 April 2016, a Pilatus Britten Norman Turbine Islander (BN-2T) aircraft, registered P2-SBC, operated by Sunbird Aviation Ltd, departed from Tekin, West Sepik Province for Kiunga, Western Province, as a charter flight under the visual flight rules. On board were the pilot-in-command (PIC) and 11 passengers (eight adults and three children). The aircraft was also carrying vegetables. The pilot reported departing Oksapmin at 13:56. The pilot had flight planned, Kiunga to Oksapmin to Kiunga. However, the evidence revealed that without advising Air Traffic Services, the pilot flew from Oksapmin to Tekin. On departure from Tekin the pilot transmitted departure details to ATS, stating departure from Oksapmin. The recorded High Frequency radio transmissions were significantly affected by static and hash. The weather at Kiunga was reported to be fine. As the aircraft entered the Kiunga circuit area, the pilot cancelled SARWATCH with Air Traffic Services (ATS). The pilot did not report an emergency to indicate a safety concern. Witnesses reported that during its final approach, the aircraft suddenly pitched up almost to the vertical, the right wing dropped, and the aircraft rolled inverted and rapidly “fell to the ground”. It impacted the terrain about 1,200 metres west of the threshold of runway 07. The impact was vertical, with almost no forward motion. The aircraft was destroyed, and all occupants were fatally injured.  ", "probable_cause": "The aircraft’s centre of gravity was significantly aft of the aft limit. When landing flap was set, full nose-down elevator and elevator trim was likely to have had no effect in lowering the nose of the aircraft. Unless the flaps had been retracted immediately, the nose-up pitch may also have resulted in tail plane stall, exacerbating the pitch up. The wings stalled, followed immediately by the right wing dropping. Recovery from the stall at such a low height was not considered possible.\r\nOther factors:\r\nOther factors is used for safety deficiencies or concerns that are identified during the course of the investigation, that while not causal to the accident, nevertheless should be addressed with the\r\naim of accident and serious incident prevention, and the safety of the travelling public. \r\na) Following the reweighing of SBC, the operator did not make adjustments to account for the shift of the moment arm as a result of the reweighing. Specifically, a reduction of allowable maximum weight in the baggage compartment. \r\nb) The pilot, although signing the flight manifest on previous flights attesting that the aircraft was loaded within c of g limits, had not computed the c of g. No documentation was available to confirm that the pilot had computed the c of g for the accident flight, or any recent flights.\r\nc) All of the High Frequency radio transmissions between Air Traffic Services and SBC were significantly affected by static interference and a lot of hash, making reception difficult, and many transmissions unclear and unreadable. This is a safety concern to be addressed to ensure that vital operational radio transmissions are not missed for the safety of aircraft operations, and the travelling public. "}