{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-bird-cay-2-killed", "date": "Apr 10, 2007 at 1703 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Ernest M. Kollmann", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Fort Lauderdale – Nassau", "msn": "46-8608014", "yom": 1986, "flight_number": null, "city": "Bird Cay", "zone": "Berry Islands", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 9818, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6912, "circumstances": "The pilot obtained two data user access terminal service (DUATS) preflight weather briefings for the intended flight from the U.S. to Nassau, Bahamas; the briefings included information that thunderstorms were forecasted. The pilot did not request a weather briefing with DUATS or Lockheed Martin flight service station before departure on the return accident flight. Although there was no way to tell whether he received a preflight weather briefing with Nassau Flight Service Station before departure on the accident flight, thunderstorms with associated severe turbulence were forecasted for the accident area well in advance of the aircraft's departure, and would have been available had the pilot requested/obtained a preflight weather briefing. After takeoff, and while in contact with Nassau terminal radar approach control, which had inoperative primary radar, the flight climbed to approximately 8,000 feet mean sea level and proceeded on a northwesterly heading with little deviation. The airplane, which was equipped with color weather radar and a stormscope, penetrated level 6 radar returns with numerous lightning strikes in the area, and began a steep descent. Prior to that there was no request by the pilot to air traffic control for weather avoidance assistance or weather deviation. Radar and radio communications were lost, and the wreckage and occupants were not recovered.", "probable_cause": "The pilot's poor in-flight weather evaluation, which resulted in flight into a level 6 thunderstorm."}