{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-near-port-alberni-3-killed", "date": "Jan 21, 2006 at 1420 LT", "type": "Cessna 208B Grand Caravan", "operator": "Sonicblue%20Airways", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Tofino – Vancouver", "msn": "208B-0469", "yom": 1995, "flight_number": "RXX604", "city": "Port Alberni", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2480, "captain_hours_type": 750, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Cessna 208B aircraft (registration C-GRXZ, serial number 208B0469) was en route at 9000 feet above sea level, from Tofino, British Columbia, to Vancouver International Airport, British Columbia, when the engine failed. The pilot began a glide in the direction of the Port Alberni Regional Airport before attempting an emergency landing on a logging road. The aircraft struck trees during a steep right-hand turn and crashed. The accident occurred at about 1420 Pacific standard time, approximately 11 nm south-southeast of the Port Alberni Regional Airport. Five passengers survived with serious injuries; the pilot and the other two passengers were fatally injured. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The engine lost power when a compressor turbine blade failed as a result of the overstress extension of a fatigue-generated crack. The fracture initiated at a metallurgical anomaly in the parent blade material and progressed, eventually resulting in blade failure due to overstress rupture.\r\n2. The combination of aircraft position at the time of the engine failure, the lack of equipment enabling the pilot to locate and identify high terrain, and the resultant manoeuvring required to avoid entering instrument flight conditions likely prevented the pilot from attempting to glide to the nearest airfield.\r\nFindings as to Risk:\r\n1. Single-engine instrument flight rules (SEIFR) operations in designated mountainous regions have unique obstacle risks in the event of an engine failure. Canadian equipment requirements for such operations do not currently include independent terrain mapping, such as terrain awareness and warning systems (TAWS).\r\n2. Airline operators are not currently required to conduct any additional route evaluation or structuring to ensure that the risk of an off-field landing is minimized during SEIFR operations.\r\n3. Pilots involved in commercial SEIFR operations do not receive training in how to conduct a forced landing under instrument flight conditions; such training would likely improve a pilotís ability to respond to an engine failure when operating in instrument meteorological conditions (IMC).\r\n4. Mean time between failure (MTBF) calculations do not take into account In Flight Shut Downs (IFSDs) not directly attributable to the engine itself; it may be more appropriate to monitor all IFSD events. \r\n5. The design of the Cessna 208B Caravan fuel shutoff valves increases the risk that the valves will open on impact, allowing fuel spillage and increasing the potential for fire.\r\nOther Finding:\r\n1. Sonicblue Airways was not providing downloaded engine parameter data for engine condition trend monitoring (ECTM) evaluation at appropriate intervals. "}