{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-3y0-kaliningrad", "date": "Oct 1, 2008 at 2318 LT", "type": "Boeing 737-300", "operator": "Kaliningradavia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Barcelona - Kaliningrad", "msn": "23812/1511", "yom": 1988, "flight_number": "KNI794", "city": "Kaliningrad", "zone": "Kaliningrad oblast", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 138, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5372, "captain_hours_type": 1258, "copilot_hours": 1010, "copilot_hours_type": 1010, "aircraft_hours": 48514, "circumstances": "The accident aircraft Boeing 737-3Y0 EI-DON, was operated by KD Avia on a flight from Kaliningrad, Russia to Barcelona, Spain and return. Flight KD793 to Barcelona was uneventful. The return flight, KD794, departed at 16:18 with 138 passengers and six crew members on board. The copilot was Pilot Flying, the captain was Pilot Monitoring. The en route part of the flight was uneventful. As the flight was descending to Kaliningrad at night in heavy rains and with gusty crosswind. During the descent flaps were first selected at 1° and thereafter to 5°. As the flaps were transitioning to this position, a flap asymmetry warning caught the attention of the crew. At 19:00 hours the captain took over control and selected flaps to 2°, the position at which there was no asymmetry warning. The crew then contacted the controller at Kaliningrad and reported that they had flap problems. As the descent was continued, the copilot performed the necessary calculations for a landing with flaps at 2°. At 19:09 the cabin crew was warned to prepare for a high-speed landing. Using the QRH to work the flap issue, the co-pilot activated the 'flap inhibit' and 'gear inhibit' switches. This \"incorrect\" action effectively disconnected the ground-proximity warning system (GPWS). At 19:11 it was established that the landing speed would be Vref +30, leading to a planned landing speed of 161 knots. At 19:14 the Landing Gear Warning Horn sounded due to the combination of power and flaps setting with the fact that the landing gear had not been selected down. This warning was cancelled by the crew. When the engine power was reduced to idle, the Landing Gear Warning Horn sounded again. This time the crew did not pay attention to the warning and continued to land. The airplane performed a gear up landing, sliding for 1440 m before coming to rest on the runway. The flap asymmetry issue was caused by a faulty Flap Position Transmitter. The flaps had extended to the commanded position, but the system incorrectly detected an asymmetry issue. This issue had occurred previously on EI-DON. The sensor had been replaced prior to departure from Kaliningrad that same day.", "probable_cause": "The crash was caused by aircraft landing with not extended landing gear that resulted in aircraft structure and engines damage and it was caused by combination of the following adverse factors: \r\n- Erroneous deactivation of GPWS gear warning (voice) system that was caused by failure to perform QRH recommendations on flaps warning deactivation during their asymmetrical extension;   \r\n- Presence of QRH manual on board of Boeing-737-300 EI-DON aircraft containing in Additional Deferred Item clause of Trailing Edge Flap Asymmetry chapter recommendation to the crew which are not specialized for the board configuration; \r\n- Violation of the \"Crew operating procedure of Boeing-737-300 aircraft\" and non-compliance with QRH recommendations («LANDING CHECKLIST» section) with the result that the crew did not extend landing gear and did not monitor their position; \r\n- Stereotyping on actuation of Landing Gear Warning Horn aural warning during approach as a result of which the crew deactivated it repeatedly without monitoring of landing gear position; \r\n- Inadequate coordination of the crew resulted in lack of monitoring of compliance with FCOM and QRH requirements at occurrence and development of abnormal situation; \r\n Appropriate safety recommendations based on the investigation results were developed. \r\nFollowing this accident, both pilots lost their licence and KD Avia's AOC was revoked by Russian authorities in September 2009. The same month, KD Avia bankrupted."}