{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-abitibi-canyon-10-killed", "date": "Sep 4, 1976 at 1337 LT", "type": "De Havilland DHC-3 Otter", "operator": "Austin%20Airways", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Moosonee - Timmins", "msn": "372", "yom": 1960, "flight_number": null, "city": "Abitibi Canyon", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11573, "circumstances": "On Saturday 4th September '76 at approximately 12:00 hours, the pilot while preparing Otter MIT for flight, called the local company radio operator to request weather information for his VFR flight to Timmins. The operator transmitted the 11:23 terminal forecast for Timmins, the 10:00 observation for Moosonee and the 11:18 special observation for Timmins. The terminal reports for Moosonee and Timmins were much better than forecast and acceptable for VFR flight. At about 12:10 the radio operator at Moosonee received a special weather observation for Timmins which indicated deteriorating weather but did not pass this vital information to the pilot at that time. The Otter departed at 12:30 and shortly after take off the pilot advised the company operator at Moosonee that his estimated time of arrival at the South Porcupine seaplane base was 14:30. A few minutes later the radio operator attempted several times to contact the aircraft, to pass the new weather information,but without success. No other radio transmission was heard from the Otter. Because the flight was operating under VFR rules and because some of his passengers had limited time to make airline connections at Timmins, the pilot elected for the direct route, a distance of 165 nautical miles between the Moosonee and Timmins NDBs. To follow this route, the pilot would have used his ADF radio equipment and / or map reading techniques. Considering the cloud ceilings were at about one thousand feet and some terrain in the area rises to 950 feet, the deteriorating conditions would have induced the pilot to divert from the planned track. Since the accident site was 28 miles west of the direct track, it is probable that he diverted westward toward lower terrain to go around poor weather. Arriving at the Abitibi River, he followed the river southward to the accident site near the Abitibi Canyon Dam. The valley narrows and the terrain rises at this site of the power dam. It is believed that the pilot found the visibility decreasing rapidly in dense upslope fog in this vicinity. At 13:37 hours the aircraft struck the high tension electrical cables near the generating station and crashed to the ground. After impact a fire developed and consumed the aircraft, which had 11,573 hours on the airframe at the time. From the geometry of the wirestrike, it is probably that the pilot saw the wires and commenced a climbing turn to try and get over them, but had insufficient time to avoid the collision. The airplane has been chartered for the Royal Commission on Electric Power Planning for Ontario.\r\nSource: http://www.dhc-3archive.com & Karl E. Hayes.", "probable_cause": "The pilot continued VFR flight into adverse weather conditions. "}