{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-61-tokyo-24-killed", "date": "Feb 9, 1982 at 0844 LT", "type": "Douglas DC-8", "operator": "Japan%20Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Fukuoka - Tokyo", "msn": "45889/291", "yom": 1967, "flight_number": "JL350", "city": "Tokyo-Haneda", "zone": "Kantō", "country": "Japan", "region": "Asia", "crew_on_board": 11, "crew_fatalities": 0, "pax_on_board": 166, "pax_fatalities": 24, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 36955, "circumstances": "JAL Flight 350 took off from Fukuoka (FUK) runway 16 at 07:34 for a regular flight to Tokyo-Haneda (HND). The aircraft climbed to the cruising altitude of FL290. At 08:22 the crew started their descend to FL160. After reaching that altitude, they were cleared to descend down to 3000 feet. The aircraft was cleared for a runway 33R ILS approach and 5° of flaps were selected at 08:35, followed by 25 degrees of flaps one minute later. The landing gear was lowered at 08:39 and 50 degrees of flaps were selected two minutes after that. At 08:42 the aircraft descended through 1000 feet at an airspeed of 135 knots with wind from a direction of 360deg at 20 knots. The co-pilot called out \"500 feet\" at 08:43:25 but the captain did not make the \"stabilized\" call-out as specified by JAL operational regulations. The airspeed decreased to 133 knots as the aircraft descended through 300 feet at 08:43:50 and the co-pilot warned the captain that the aircraft was approaching the decision height. At 08:43:56 the radio altimeter warning sounded, followed by the flight engineer calling out \"200 feet\", which was the decision height, three seconds later . At 08:44:01 the aircraft descended through 164 feet at 130 KIAS. At that moment the captain cancelled autopilot, pushed his controls forward and retarded the throttles to idle. The co-pilot tried to regain control but the aircraft crashed into the shallow water of Tokyo Bay, 510 m short of the runway 33R threshold. The nose and the right hand wing separated from the fuselage. The captain had recently suffered a psychosomatic disorder; preliminary reports suggested that the captain experienced some form of a mental aberration. He had been off duty from November 1980 to November 1981 for these reasons.", "probable_cause": "Collision with approach lights during an unstabilized approach. Poor crew coordination and wrong approach configuration on part of the captain. "}