{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-500tp-malibu-meridian-dunkeswell", "date": "Dec 31, 2002 at 1749 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Blackbrook Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chambéry – Dunkeswell", "msn": "46-97122", "yom": 2002, "flight_number": null, "city": "Dunkeswell", "zone": "Devonshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8899, "captain_hours_type": 2095, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was carrying out an IFR flight from Chambery in France to Dunkeswell Aerodrome using Exeter Airport as his diversion. Before departure from Chambery he had checked the weather conditions at Exeter and other airfields in its vicinity from the available TAFs and METARs covering the period of the flight and he was satisfied that conditions were suitable. He had also contacted a friend who was also a commercial pilot at about 1530 hrs. This friend lived near Dunkeswell Aerodrome and had estimated the cloud base to be approximately 1,500 feet. The aircraft departed Chambery at 1605 hrs and, apart from some airframe icing on departure, it had an uneventful transit at FL270. Approaching the south coast of England, the aircraft was descended to FL60 and it left controlled airspace at Southampton in good VMC with the lights along the south coast clearly visible. The weather at Exeter at 1720 hrs was: surface wind 130°/08 kt, varying between 110° and 170°; visibility 6,000 metres; cloud SCT 005, BKN 012; temperature +9° C; dew point +8° C and QNH 1011 mb. With approximately 50 miles to run to his  destination, the pilot attempted to contact Dunkeswell Radio but received no reply so he assumed the airfield had closed for the night. The lights of Dunkeswell village and the industrial site at the north-eastern edge of the aerodrome were visible but they had a milky appearance as if shining through scattered mist pockets. The aircraft was descended to 2,600 feet on the Exeter QNH and the main altimeter was set to the Dunkeswell QFE by subtracting 31 mb from the Exeter QNH to allow for the Dunkeswell elevation of 850 feet. The pilot was utilising two GPS navigation systems programmed to provide him with centreline information for Runway 23 on a CDI (Course Deviation Indicator) scale of 0.3 nm for full deflection. Whilst there was no runway lighting at Dunkeswell, the pilot had placed white reflective panels on the right edge of Runway 23. When illuminated by the aircraft landing light, these panels would show the right hand edge of the runway and also indicate the touchdown zone of the runway. The panels measured 18 cm by 9.5 cm and were mounted vertically on low, black plastic supports. The threshold for Runway 23 is displaced 290 metres from the road which runs along the northern aerodrome boundary and the first reflector was 220 metres beyond the displaced threshold. The reflectors had been positioned over a distance of 460 metres with the distances between them varying between 15 and 49 metres. The white centreline markings would also have been visible in the landing light once the aircraft was low enough. The end of the 46 metre wide runway was 280 metres from the last reflector. The pilot had carried out night approaches and landings to Runway 23 at Dunkeswell using similar visual references on many previous occasions. The pilot identified the lights of the industrial site earlier than he expected at six miles whilst maintaining 2,600 feet on the Exeter QNH. He cancelled his radar service from Exeter, which had also provided him with ranges and bearings from Dunkeswell, and made blind transmissions regarding his position and intentions on the Dunkeswell Radio frequency. Having commenced his final approach, the pilot noticed there was scattered cloud in the vicinity of the approach path. At about 2.5 nm from the runway threshold and approximately 800 feet agl, the pilot noticed a mist pocket ahead of the aircraft and so he decided to initiate a go-around and divert to Exeter. At that point the aircraft was configured with the second stage of flap lowered, the landing gear down and the airspeed reducing through 135 kt with all three aircraft landing lights selected ON. The pilot increased power and commenced a climb but he became visual with the runway once more and so he reduced power and resumed the approach. A high rate of descent developed and the radio altimeters automatic 50 feet audio warning sounded. The pilot started to increase engine power but he was too late to prevent the severe impact with terrain that followed almost immediately. The aircrafts wings were torn off as it passed between two trees and the fuselage continued across a grass field, remaining upright until it came to a stop. The passenger vacated the aircraft immediately through the normal exit in the passenger cabin and then returned to assist the pilot. Having turned off the aircraft's electrical and fuel systems the pilot also left the aircraft through the normal exit. There was a leak from the oxygen system, which had been disrupted in the accident and the pilot was unable to remove the fire extinguisher from its stowage due to the deformation of the airframe. He contacted Exeter ATC using his mobile telephone to inform them of the accident and they initiated the response of the emergency services. ", "probable_cause": "The investigation concluded that the accident had occurred due to an attempt to land at night in fog, at an airfield with no runway lighting and only limited cultural lighting to provide visual\r\norientation; these visual references were lost when the fog was entered. The aircraft impacted the treeline at the top of the valley 1,600 metres short of the displaced threshold and 200 metres to the right of the centreline. "}