{"url": "https://www.baaa-acro.com/crash/crash-antonov-12b-sp-22-polar-sation-1-killed", "date": "May 1, 1974 at 1220 LT", "type": "Antonov AN-12", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "SP-22 Polar Station - Dikson", "msn": "8 3 455 01", "yom": 1968, "flight_number": null, "city": "SP-22 Polar Station", "zone": "Krasnoyarsk Krai", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9381, "circumstances": "The SP-22 Polar station was dismantled and several airplanes were dispatched to evacuate personnel and equipment. In the morning, cargo (tractors, woods and various equipment) were loaded on board the AN-12 as well as nine passengers and a crew of seven, en route to Dikson. The ice cracked in the morning and a large crack of about two meters appears, causing the takeoff distance to be 900 meters only. Thus, cargo was offloaded and the crew decided to takeoff with a total weight of 52 tons. During the takeoff roll, the captain started the rotation about 30 meters prior to the crack. Both main landing gear struck the crack, causing the aircraft to be out of control and to crash in flames. The radio navigator was killed while all other occupants were injured, some of them seriously. The aircraft was destroyed. ", "probable_cause": "The estimated time on ground between the landing and the takeoff was 3 hours and 50 minutes, which was too much as it give time to the ice to crack. It was determined that the crew failed to offload all nine passengers to reduce the total weight prior to takeoff. Also, poor weather conditions during the preceding days caused the evacuation mission to be postponed, which was considered as a contributing factor. "}