{"url": "https://www.baaa-acro.com/crash/crash-rockwell-sabreliner-65-molokai-6-killed", "date": "May 10, 2000 at 2031 LT", "type": "Rockwell Sabreliner 65", "operator": "Price Aircraft Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Papeete – Christmas Island – Kahului – Molokai", "msn": "465-5", "yom": 1979, "flight_number": null, "city": "Molokai", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 12775, "captain_hours_type": 1370, "copilot_hours": 1725, "copilot_hours_type": null, "aircraft_hours": 7934, "circumstances": "The airplane collided with mountainous terrain after the flight crew terminated the instrument approach and proceeded visually at night. The flight crew failed to brief or review the instrument approach procedure prior to takeoff and exhibited various cognitive task deficiencies during the approach. These cognitive task deficiencies included selection of the wrong frequency for pilot controlled lighting, concluding that the airport was obscured by clouds despite weather information to the contrary, stating inaccurate information regarding instrument approach headings and descent altitudes, and descending below appropriate altitudes during the approach. This resulted in the crew's lack of awareness regarding terrain in the approach path. Pilots approaching a runway over a dark featureless terrain may experience an illusion that the airplane is at a higher altitude that it actually is. In response to this illusion, referred to as the featureless terrain illusion or black hole phenomenon, a pilot may fly a lower than normal approach potentially compromising terrain clearance requirements. The dark visual scene on the approach path and the absence of a visual glideslope indicator were conducive to producing a false perception that the airplane was at a higher altitude. A ground proximity warning device may have alerted the crew prior to impact. However, the amount of advanced warning that may have been provided by such a device was not determined. Although the flight crew's performance was consistent with fatigue-related impairment, based on available information, the Safety Board staff was unable to determine to what extent the cognitive task deficiencies exhibited by the flight crew were attributable to fatigue and decreased alertness.", "probable_cause": "Inadequate crew coordination led to the captain's decision to discontinue the instrument approach procedure and initiate a maneuvering descent solely by visual references at night in an area of mountainous terrain. The crew failed to review the instrument approach procedure and the copilot failed to provide accurate information regarding terrain clearance and let down procedures during the instrument approach."}