{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-232-mediterranean-sea-66-killed", "date": "May 19, 2016 at 0229 LT", "type": "Airbus A320", "operator": "Egyptair", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Paris – Cairo", "msn": "2088", "yom": 2003, "flight_number": "MS804", "city": "Mediterranean Sea", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 56, "pax_fatalities": 56, "other_fatalities": 0, "total_fatalities": 66, "captain_hours": 6275, "captain_hours_type": 2101, "copilot_hours": 2675, "copilot_hours_type": null, "aircraft_hours": 48000, "circumstances": "The aircraft departed Paris-Roissy-Charles de Gaulle Airport at 2321LT on May 18 on an international schedule flight to Cairo. carrying 56 passengers and 10 crew members. The crew maintained radio contacts with the Greek ATC and was transferred to the Egyptian ATC but failed to respond. Two minutes after the airplane left the Greek Airspace, the aircraft descended from FL370 to FL220 in few seconds, apparently making a first turn to the left and then a 360 turn to the right before disappearing from the radar screen at 0229LT while at an altitude of 10'000 feet. It is believed that the aircraft crashed in the Mediterranean sea about 200 km north of Egyptian coast. The crew did not send any mayday message, thereby all assumptions remains open. It appears that some various debris such as luggage were found on May 20 about 290-300 km north of Alexandria. Two days after the accident, it is confirmed that ACARS messages reported smoke on board, apparently in the lavatory and also in a technical compartment located under the cockpit area. Above that, several technical issues were reported by the ACARS system. The CVR has been recovered on June 16, 2016, and the DFDR a day later. As both recorder systems are badly damaged, they will need to be repaired before analyzing any datas. On December 15, 2016, investigators reported that traces of explosives were found on several victims. Egyptian Authorities determined that there had been a malicious act. The formal investigation per ICAO Annex 13 was stopped and further investigation fell within the sole jurisdiction of the judicial authorities. Contradicting the Egyptian finding, the French BEA considered that the most likely hypothesis was that a fire broke out in the cockpit while the aircraft was flying at its cruise altitude and that the fire spread rapidly resulting in the loss of control of the aircraft.", "probable_cause": "It was determined that the accident was the consequence of an in-flight fire in the cockpit but investigations were unable to establish the exact origin of the fire. Following the fire that probably resulted from an oxygen leak from the copilot's quick-fit mask system, both pilots left the cockpit in a hurry and were apparently unable to find and use the fire extinguisher. To this determining element, three possible contributory factors have been identified: a blanket charged with static electricity requested by the captain to sleep; fatty substances being part of the meal served to the pilots, and a high probability of a lit cigarette or a cigarette butt burning in an ashtray while the crew smoked regularly in the cockpit. The experts also noted unprofessional behavior by the flight crew who listened to music, made multiple comings and goings in the cockpit as well as a lack of attention about flight monitoring procedures."}