{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-king-air-dutch-harbor", "date": "Jan 16, 2020 at 0806 LT", "type": "Beechcraft 200 Super King Air", "operator": "Lifemed%20Alaska", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Dutch Harbor - Adak", "msn": "BB-1642", "yom": 1998, "flight_number": null, "city": "Dutch Harbor", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6470, "captain_hours_type": 756, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7058, "circumstances": "According to the pilot, when the airplane’s airspeed reached about 90 knots during the takeoff roll, he applied back pressure to the control yoke to initiate the takeoff and noted a brief positive rate of climb followed by a sinking sensation. The airspeed rapidly decayed, and the stall warning horn sounded. To correct for the decaying airspeed, he lowered the nose then pulled back on the airplane’s control yoke and leveled the wings just before impacting the ocean. The pilot stated there were no pre accident mechanical malfunctions or anomalies that would have precluded normal operation. Wind about the time of the accident was recorded as 110º downwind of the airplane at 15 knots gusting to 28 knots. The passengers recalled that the pilot’s preflight briefing mentioned the downwind takeoff but included no discussion of the potential effect of the wind conditions on the takeoff. The airplane’s estimated gross weight at the time of the accident was about 769.6 pounds over its approved maximum gross weight, and the airplane’s estimated center of gravity was about 8.24 inches beyond the approved aft limit at its maximum gross weight. It is likely that the pilot’s decision to takeoff downwind and operate the airplane over the maximum gross weight with an aft center of gravity led to the aerodynamic stall during takeoff and loss of control. Downwind takeoffs result in higher groundspeeds and increase takeoff distance. While excessive aircraft weight increases the takeoff distance and stability, and an aft center of gravity decreases controllability. Several instances of the operator’s noncompliance with its operational procedures and risk mitigations were discovered during the investigation, including two overweight flights, inaccurate and missing information on aircraft flight logs, and the accident pilot’s failure to complete a flight risk assessment for the accident flight. The operator had a safety management system (SMS) in place at the time of the accident that required active monitoring of its systems and processes to ensure compliance with internal and external requirements. However, the discrepancies noted with several flights, including the accident flight, indicate that the operator’s SMS program was inadequate to actively monitor, identify, and mitigate hazards and deficiencies.", "probable_cause": "The pilot’s improper decision to takeoff downwind and to load the airplane beyond its allowable gross weight and center of gravity limits, which resulted in an aerodynamic stall and loss of control. Contributing to the accident was the inadequacy of the operator’s safety management system to actively monitor, identify, and mitigate hazards and deficiencies."}