{"url": "https://www.baaa-acro.com/crash/crash-fairchild-hiller-fh-227c-lebanon-32-killed", "date": "Oct 25, 1968 at 1717 LT", "type": "Fairchild-Hiller FH-227", "operator": "Northeast%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Boston – Lebanon – Montpelier", "msn": "517", "yom": 1966, "flight_number": "NE946", "city": "Lebanon", "zone": "New Hampshire", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 39, "pax_fatalities": 30, "other_fatalities": 0, "total_fatalities": 32, "captain_hours": 14700, "captain_hours_type": 1181, "copilot_hours": 2499, "copilot_hours_type": 281, "aircraft_hours": 3828, "circumstances": "Northeast Airlines Flight 946 departed Boston 17:42 for a flight to Lebanon, NH and Montpelier, VT. The Fairchild climbed to a cruising altitude of 8000 feet. At 18:08 the crew were cleared for an approach to the Lebanon Airport to cruise at 5,000 feet and report leaving 6,000 feet. At 18:10:45, the controller advised the crew that radar service had been terminated and the flight was cleared to contact the Lebanon Flight Service Station (FSS). One minute later the FSS told the crew that the weather was an estimated ceiling of 2,000 feet overcast; visibility was 10 miles; there were breaks in the overcast; the altimeter setting was 29:55; and the wind was calm. The flight did not perform the published instrument approach procedure but executed an abbreviated approach by making a right turn from their northwesterly heading and then a left turn back to intercept the inbound radial to the VOR station. The inbound radial was intercepted at approximately 8 to 10 miles northeast of the VOR station where it passed through an altitude of about 4500 feet. The crew began the descent but did not level off at 2,800 feet m.s.l., the minimum altitude inbound to the VOR. During the approach to runway 25 the airplane contacted trees on the cloud-shrouded side of a steep, rocky, heavily wooded mountain 57 feet below the summit at 2,237 feet m.s.l. The aircraft cut a swath trough the trees broke up and caught fire. Two crew members and 30 passengers were killed while 10 others were injured. ", "probable_cause": "The premature initiation of a descent towards the Minimum Descent Altitude, based on navigational instrument indications of an impending station passage in an area of course roughness. The crew was not able to determine accurately its position at this time because they had performed a non standard instrument approach and there were no supplement navigational aids available for their use."}