{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-1-dc-skymaster-mt-canigou-88-killed", "date": "Jun 3, 1967 at 2306 LT", "type": "Douglas C-54 Skymaster", "operator": "Air%20Ferry", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Manston - Perpignan", "msn": "10279", "yom": 1944, "flight_number": null, "city": "Mt Canigou", "zone": "Pyrénées-Orientales", "country": "France", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 83, "pax_fatalities": 83, "other_fatalities": 0, "total_fatalities": 88, "captain_hours": 10400, "captain_hours_type": 145, "copilot_hours": 17500, "copilot_hours_type": null, "aircraft_hours": 42663, "circumstances": "The Douglas C-54A passenger aircraft operated on a non-scheduled international flight from Manston, England, to Perpignan, France. Takeoff was accomplished at 17:31 hours GMT and the airplane climbed to the en route cruising altitude of FL90. At 19:48 hours the flight crew established contact with Marseille Control and reported having crossed the FIR boundary. At 20:25 hours the flight reported over Mende at FL90, estimating abeam Montelimar at 20:44 hours. Marseille Control immediately asked for confirmation abeam Martigues for it could not be Montelimar which is practically on the same parallel as Mende. The aircraft then corrected its message to abeam Montpellier at 20:44 hours and shortly thereafter, on request, gave its estimated time of arrival (ETA) at Perpignan as 21:10 hours. A rough calculation showed that if the aircraft had passed Mende at 20:25 hours and if its ETA of 20:44 hours abeam Montpellier was confirmed, its ETA of 21:10 hours at Perpignan was not possible without a decrease in ground speed of about 18 per cent, unless the pilot had allowed some time for the approach procedure. In view of this Marseille Control requested at 20:33 hours confirmation of the 21:10 hours ETA at Perpignan. The flight replied with an ETA of 22:10 hours then corrected this to 21:10 hours. At 20:43 hours the aircraft reported abeam Montelimar (instead of Montpellier), and estimating Papa 3, an entry point into Perpignan located at Narbonne, at 20:52 hours. This estimate was appropriate but made the ETA of 21:10 hours for Perpignan even more difficult to accept. At 20:50 hours the aircraft corrected its ETA over Papa 3 to 20:51 hours, confirmed its ETA at Perpignan as 21:10 hours and requested authorization to start its descent. Marseille Control cleared the aircraft to descend to FL70 and asked it to call Perpignan Approach. At 20:52 hours the aircraft called Perpignan Approach, confirmed its 21:10 hours ETA and stated that it was descending to flight level 70. Perpignan Approach then gave the flight the QFE, the QNH and the surface temperature and asked it to call again on passing flight level 70. At 20:55 hours the aircraft reported approaching FL70 descending to FL50, and five minutes later it reported approaching FL50. Perpignan Approach acknowledged receipt and asked it if it had the aerodrome in sight. The flight replied \"Roger, we'll advise, field in sight.\" Having apparently understood that the aircraft actually had the runway in sight, Perpignan Approach then instructed it to report downwind for runway 33 and told it that the wind was calm. At 21:04 hours Perpignan Approach asked the aircraft for its flight level and was advised 4000 ft; the flight also advised it would be \"...with you in about five minutes.\" When asked by the Controller if it had the field in sight the flight replied at 21:05 hours \"Yankee Kilo negative at this moment.\" Perpignan Approach then repeated in a questioning tone of voice - \"Yankee Kilo, you have not my field in sight?\" and received the reply \"that is affirmative\". The controller misunderstood this remark and told the aircraft to report downwind for runway 33, wind calm. A few seconds later the aircraft asked for QDMs (magnetic bearings), Perpignan Approach was surprised and asked it to repeat its request. There was no reply to any subsequent calls by Perpignan. It was subsequently found that the aircraft had impacted a mountain in the Pyrenees Mountains at an elevation of 1160 m. The wreckage was found in a ditch located at an altitude of 940 meters on the slope of Mt Canigou after the airplane struck the Dent du Lion with one of its wing. The aircraft was totally destroyed and none of the 88 occupants survived the crash. ", "probable_cause": "The Commission is of the opinion that the accident occurred following a collision with the mountainside, which resulted directly from a series of errors on the part of the crew (failure to use all the means of radio navigation available in the aircraft, error in dead reckoning, descent starting from a point which had been inadequately identified, failure to observe the safe altitudes fixed on the company's flight plan and, perhaps, mistakes in identification by visual reference to the ground.) This irrational conduct of the flight can be explained by the phenomena due to intoxication by carbon monoxide coming from a defective heating system. Finally, it should be stressed that the misunderstandings which occurred between the aircraft and the Perpignan controller, as a result of language difficulties and in particular the non-existence of any standard phraseology, and also the failure to check the aircraft's magnetic bearing by means of the D/F equipment during the communication at 20.55hrs, may have constituted additional aggravating circumstances."}