{"url": "https://www.baaa-acro.com/crash/crash-max-holste-mh-1521m-broussard-barton", "date": "Jun 7, 1988 at 1730 LT", "type": "Max Holste M.H.1521M Broussard", "operator": "Keenair Warbirds West", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Liverpool - Barton", "msn": "217", "yom": 1959, "flight_number": null, "city": "Barton", "zone": "Great Manchester", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1800, "captain_hours_type": 33, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The purpose of the flight was to familiarise a prospective purchaser with the handling of the aircraft. The captain who was the owner of the aircraft and held a Private Pilot's Licence with an Instructor's Rating, occupied the right-hand seat and the other pilot, who also held a Private Pilot's Licence, occupied the left-hand seat. The weather was fine with a light north-easterly wind. Before takeoff, some oil was noticed on the windscreen but neither the pilot considered that it warranted any action. Following an uneventful takeoff during which the engine and propeller functioned normally, some minutes were spent in the local area before it was decided to visit Barton. Liverpool ATC was informed and G-PU set course to Barton. On approaching Barton, some 20 minutes into the flight, an adjustment to the engine controls resulted in a significant increase in the amount of oil on the windscreen. The captain was unconcerned but the pilot kin the left-hand seat thought that he might have problems with visibility for landing. Shortly after this, Barton radio passed the airfield information which gave the landing runway as 09 with a left hand circuit. When crosswind at a height estimated by ground observers to be about 500 feet agl, the captain selected the propeller control to fully fine as part of his pre-landing checks. Coincident with this action, the windscreen and side windows became covered with a large quantity of oil which totally obscured both pilots view of the outside world. The operation manual recommends that under these circumstances the propeller be selected to coarse pitch to reduce the flow of oil. The captain did not execute this procedure because he considered that configuring the aircraft for an immediate landing in fine pitch was his priority in the prevailing circumstances. Both pilots opened their direct vision panels which enabled them to see the ground abeam the aircraft but not forward vision was possible because of the large amount of smoke that was ny now streaming back from the engine. The presence of smoke led the crew to believe that the aircraft might be on fire. Since the pilot in the left-hand seat could see towards the runway, it was decided that he should retain control and attempt to position the aircraft for a landing on runway 09. The captain made a radio call requesting priority in the circuit but the radio operator in the control tower received only carrier wave and assumed the call to be the captain's downwind report and replied accordingly. The aircraft's permanent radios not functioning and a hand held transceiver was being used by the pilot. Previous radio communications had been satisfactory. When it was judged that G-PU was at the end of the downwind leg, a turn onto base leg was initiated and a descent commenced. After turning towards the estimated position of the runway 09 threshold, the captain realised that he was high and selected full flap. It then became apparent to him that not only was the aircraft too high but that it had also flown through the runway centerline and he judged that, because of the presence of houses in the over-run are of runway 09, a safe landing could not be made. He therefore elected to go-around and increased power. The engine responded normally but the aircraft failed to either climb or accelerate. G-PU was now at a height estimated to be between 200 and 300 feet agl and the captain decided to retain full flap for a further circuit. During the subsequent left turn and downwind leg the aircraft as observed to be steadily losing height and the radio operator in the control tower alerted the emergency services in anticipation of a crash. G-PU continued its turn towards the airfield at a very low altitude but the crew did not have enough visual reference to determine their position. When it became apparent to the handling pilot that he was very close to the ground, he leveled the wings and waited for the inevitable impact. G-PU struck a stand of small trees and on the top of the M62 motorway embankment while on a heading of 180°, it then struck a motorway sign and several vehicles before coming to rest on the hard shoulder on a westerly heading. Neither pilot was aware that they had landed on the motorway until they vacated the aircraft. Neither pilot was injured but a car passenger sustained serious injuries. ", "probable_cause": "The most probable sequence, therefore, leading to the anomalies found in the propeller hub is, firstly, the break-up of the outboard leather seal, secondly the displacement of the inboard gasket by oil pressure following the loss of clamping loads and, coincident with the disruption of the gaskets, the damaging and ejection of the phenolic bush. The rest of the propeller pitch change system was examined for anything which could have caused excessive or asymmetric loading on the actuating cylinder but none was found."}