{"url": "https://www.baaa-acro.com/crash/crash-fokker-f28-fellowship-1000-near-chachapoyas-46-killed", "date": "Jan 9, 2003 at 0845 LT", "type": "Fokker F28 Fellowship", "operator": "TANS-Peru-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Lima – Chiclayo – Chachapoyas", "msn": "11100", "yom": 1975, "flight_number": "TJ222", "city": "Chachapoyas", "zone": "Amazonas", "country": "Peru", "region": "South America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 41, "pax_fatalities": 41, "other_fatalities": 0, "total_fatalities": 46, "captain_hours": 3127, "captain_hours_type": 753, "copilot_hours": 9255, "copilot_hours_type": 1065, "aircraft_hours": 13121, "circumstances": "The aircraft departed Lima on a regular schedule flight to Chachapoyas with an intermediate stop in Chiclayo, carrying 41 passengers and five crew members. Following an uneventful flight from Chiclayo, the crew started the descent to Chachapoyas Airport in poor weather conditions. The crew maintained several radio contacts with ATC and all seemed to be 'normal' on board when the aircraft struck the slope of Mt Coloque located 15 km from the airport. Due to poor weather conditions and because the crash site was unaccessible, SAR teams arrived on scene two days later. The wreckage was found at an altitude of 3,300 metres. The aircraft disintegrated on impact and all 46 occupants were killed. The occupants were respectively 41 Peruvians, two Belgians, one Dutch, one Spanish and one Cuban. ", "probable_cause": "It was determined that the accident was the consequence of a controlled flight into terrain after the crew continued the descent in zero visibility after suffering a total loss of situational awareness. The following contributing factors were identified:\r\n- The crew failed to proceed with an approach briefing,\r\n- Overconfidence on part of the flying crew, \r\n- The crew failed to follow the approach checklist, \r\n- The crew failed to comply with the SOP's, \r\n- Poor crew resources management, \r\n- The copilot was tired, stressed and depressive because his father passed away four days prior to the accident, \r\n- The crew was destabilized by a certain pressure from the operator's, \r\n- Poor judgment on part of the flying crew, \r\n- Poor approach planning, \r\n- Inadequate monitoring,\r\n- Poor visual perception, \r\n- Operational complacency, \r\n- The crew was non-compliant with published procedures, \r\n- Disorientation and loss of situational awareness. "}