{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-14-denver", "date": "Nov 16, 1976 at 1729 LT", "type": "Douglas DC-9", "operator": "Texas%20International", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Salt Lake City - Denver - Houston", "msn": "47081/155", "yom": 1967, "flight_number": "TI987", "city": "Denver-Stapleton", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 81, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15000, "captain_hours_type": 651, "copilot_hours": 8400, "copilot_hours_type": 4000, "aircraft_hours": 24333, "circumstances": "On November 16, 1976, Texas International Flight 987, a McDonnell Douglas DC-9-14, N9104, operated as a scheduled passenger flight from Salt Lake City, Utah, to Houston, Texas, with an intermediate stop at Denver, Colorado. The flight was routine to Stapleton International Airport, Denver, Colorado. The flight left the gate at Stapleton International Airport with 81 passengers and 5 crew members aboard. When Flight 987 was cleared to taxi to runway 8R for takeoff, the weather was clear, the wind was from 130° at 7 kns, and the temperature was 40° F. At 1726:33, the tower cleared the flight to take the runway and to hold while two light: aircraft took off from a nearby intersection. At 1729:13, Flight 987 was cleared for takeoff, and at 1729: 15 the flight reported \"rolling.\" The first officer was making the takeoff and, upon receipt of the clearance, he advanced the throttles to a position commanding 1.4 EPR and released the brakes. After the engines stabilized at 1.4 EPR, the first officer advanced the throttles to the takeoff thrust position. Upon reaching this position, he relinquished control of the throttles and placed his left hand on the control yoke. The captain guarded the throttles until rotation speed (VR) was reached. The pilots described the takeoff roll to rotation as \"normal.\" The captain monitored the engine instruments and noted no abnormal readings. He said he called out 100 KIAS, 130 KIAS, V1, VR, V2; the cockpit voice recorder (CVR) readout corroborated his statement. The first officer stated that when the captain called VR, he checked his airspeed indicator before he moved his control column aft and saw 149 or 150 KIAS either at, or just before, he began to rotate the aircraft. He stated that he rotated the aircraft at a normal rate to a target pitch angle of 10° which he determined from his attitude indicator; he estimated that this took about 3 to 4 seconds. About halfway through the rotation--about a 5° pitch angle--the stall warning system's stickshaker activated. The first officer stated that once it began it was continuous. He said he continued the rotation to what he believed to be about 10° and the stickshaker continued to operate. He saw that although the airspeed was beyond 150 KIAS, the aircraft did not lift off. Since it had accelerated to a speed greater than V1, the first officer said that he tried to get it airborne. He could not recall how long he maintained the pitch angle, but he believed it was adequate to get the aircraft off the runway. When he concluded that the aircraft was not going to fly, he rejected the takeoff. The captain stated that rotation was normal and that as rotation was begun there were a couple of \"clacks\" from the stickshaker. As the rotation continued, the stickshaker began to operate continuously. He saw about 10° pitch angle on his attitude indicator and 152 KIAS on the airspeed indicator. All other instrument indications were normal. The stickshaker continued to operate and he believed that the aircraft would not lift off. At this point, with the airspeed well past V2, he decided to reject the takeoff. His actions to reject the takeoff were simultaneous with those of the first officer. When the first officer began to abort the takeoff, he reached over and, in what he described as one continuous motion, pulled the throttles to idle and applied full reverse thrust. Almost simultaneous with his initiation of the power reduction, he felt the captain's hand on top of his. He said that he had already started to apply forward pressure on the yoke to lower the nose. on his, he realized that the captain was assuming control of the aircraft and he removed his own hand from the thrust levers and placed it on the yoke. He described the lowering of the nosewheel to the runway as rapid, and once it was on the ground he pushed the yoke forward to hold the nosewheel there and applied brakes. The stickshaker had stopped, but neither pilot could recall exactly when. When he felt the captain's hand When the nose was lowered, full reverse thrust and maximum wheel braking were applied; however, the ground spoilers were not deployed. The captain estimated that there was 2,500 to 3,000 ft of runway remaining when the takeoff was rejected. He later noted that they were in the amber lighted area of the runway when the abort began. The first officer said that all he could see were the amber runway edge lights when the nose was lowered. The amber coded runway edge lights on 8R begin 2,000 feet from the eastern threshold of the runway. The captain stated that he steered the aircraft toward the right side of the runway to avoid the approach light stanchions for runway 26L. The aircraft left the runway, continued another 1,050 ft, traversed two drainage ditches, struck approach light stanchions, turned left, and stopped headed in a northerly direction. After the aircraft stopped, the captain ordered the first officer to proceed into the cabin and assist the flight attendants with the passenger evacuation. The captain then cleaned up the cockpit and carried out the emergency engine shutdown procedures. The engines were shut down, the fuel shutoff valves were closed, the engine fire handles were pulled, the fire extinguishing agent was discharged, and battery and ignition switches were turned off. All 86 occupants were evacuated safely and the aircraft was damaged beyond repair. ", "probable_cause": "A malfunction of the stall warning system, for undetermined reasons, which resulted in a false stall warning and an unsuccessful attempt to reject the take-off after the aircraft had accelerated beyond refusal and rotation speed. The decision to reject the take-off although not consistent with standard operating procedures and training, was reasonable in this instant case, based upon the unusual circumstances in which the crew found themselves, the minimal time available for decision, and the crew's judgment concerning a potentially catastrophic situation."}