{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-100-king-air-mayfield-6-killed", "date": "Sep 15, 1989 at 2110 LT", "type": "Beechcraft 100 King Air", "operator": "James Holmes", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Orlando - Mayfield", "msn": "B-49", "yom": 1970, "flight_number": null, "city": "Mayfield-Graves County", "zone": "Kentucky", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 8000, "captain_hours_type": 400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9386, "circumstances": "During arrival, the flight was issued the current Paducah altimeter setting. The pilot requested vectors for an approach to runway 18, but the ARTCC controller (ctlr) could not accommodate the request. The pilot was cleared for a VOR/DME-a approach. MDA for the approach was 1,080 feet msl (600 feet agl). At 2108 cdt, the flight changed to the FBO frequency. FBO personnel observed the aircraft fly over the airport and advised that it was too low. One of the pilots replied that they would be 'staying under the clouds.' The pilots had planned to land on runway 36, but reported they lost sight of the runway and would change to runway 18. Subsequently, the aircraft collided with a tree about 1 mile north-northeast of the airport, while on a westerly heading (approximately position of base leg for a VFR pattern). The aircraft came to rest about 700 feet west of the tree and was destroyed by impact and fire. No preimpact part failure/malfunction of the aircraft was found. Approximately 30 miles west at Paducah, the weather was in part: 200 feet scattered, 900 feet overcast visibility 3 miles with rain and fog, wind from 360° at 7 knots. The airport manager estimated there was a 200 feet ceiling at the airport. All six occupants were killed. ", "probable_cause": "Failure of the pilot to follow ifr procedures and maintain the minimum descent altitude (MDA). Factors related to the accident were: darkness, the adverse weather conditions, and the tree."}