{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31p-pressurized-navajo-woodruff-4-killed", "date": "May 25, 2003 at 1754 LT", "type": "Piper PA-31-310 Navajo", "operator": "Navajo Inc.", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Woodruff - DuPage", "msn": "31-7530025", "yom": 1975, "flight_number": null, "city": "Woodruff-Lakeland", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 11850, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5384, "circumstances": "The twin-engine airplane was destroyed when it impacted trees and terrain shortly after takeoff. The airplane was consumed in a post-impact fire. Witnesses reported seeing the airplane climbing at a lower than normal rate just after takeoff. One witness did not hear the airplane. Another witness reported that the airplane sounded labored and this is what drew his attention to the airplane. The airplane came to rest in a wooded area about 3,500 feet from the departure end of the runway, and 700 feet left of the extended runway centerline. The wreckage path through the trees was about 65 degrees left of the runway heading. The first piece of wreckage along the wreckage trail was the left wingtip. Examination of the right propeller revealed chordwise scratching, leading edge damage, and bending and twisting opposite to the direction of rotation. In addition, several tree cuts were observed that were predominately on the right side of the wreckage path. No evidence of rotation was noted with respect to the left propeller, propeller blades, or propeller spinner. On-scene examination revealed no pre-impact anomalies with respect to the airframe, right engine, or right propeller. Follow-on examination of the left engine and propeller revealed no pre-impact anomalies. Calculations based on the power setting table, airspeed chart and en-route distance showed that the airplane would have burned a total of 56 to 71 gallons (28 to 35.5 gallons per side) of fuel for the previous leg of the round-trip flight. The main fuel tanks held a total of 112 gallons of fuel (56 gallons per side). Based on the fuel burn calculations, this quantity of fuel would not have been sufficient to complete the round-trip flight on the main fuel tanks alone. The outboard auxiliary fuel tanks held 40 gallons per side. The left fuel selector was found positioned to the inboard main fuel tank and the right fuel selector was found positioned to the outboard auxiliary fuel tank. The airplane flight manual for the airplane stipulates that only the main fuel tanks be used for takeoff and landing. No fuel was obtained for the return flight.", "probable_cause": "The pilot's failure to follow the before take-off checklist which led to an improper selection of the auxiliary fuel tanks for the takeoff leading to the subsequent fuel starvation of the left engine. Additional causes were the pilot not maintaining minimum controllable airspeed  which resulted in a loss of control of the airplane. The trees and the pilot's unsuccessful attempt to restart the engine by selecting the main fuel tank were contributing factors in the accident. "}