{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-beechjet-400a-atlanta", "date": "Jun 18, 2012 at 1006 LT", "type": "Beechcraft Beechjet 400", "operator": "N79TE LLC", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Gadsden - Atlanta", "msn": "RK-70", "yom": 1993, "flight_number": null, "city": "Atlanta-DeKalb-Peachtree", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10800, "captain_hours_type": 1500, "copilot_hours": 3500, "copilot_hours_type": 150, "aircraft_hours": 4674, "circumstances": "The second-in-command (SIC) was the pilot flying for most of the flight (takeoff, climb, cruise, and descent) and was in the left seat, while the pilot-in-command (PIC) was the pilot monitoring for most of the flight and was in the right seat. Before takeoff, the PIC calculated reference speed (Vref) for the estimated landing weight and flaps 30-degree extension was 120 knots, with a calculated landing distance of 3,440 ft. Further, before takeoff, there were no known mechanical difficulties with the brakes, flaps, antiskid, or traffic alert and collision avoidance (TCAS) systems. After takeoff and for most of the flight, the PIC coached/instructed the SIC, including instructions on how to set the airspeed command cursor, a request to perform the after-takeoff checklist, and a comment to reduce thrust to silence an overspeed warning aural annunciation. When the flight was northwest of Dekalb Peachtree Airport (PDK), Atlanta, Georgia, on a right base leg for a visual approach to runway 20L with negligible wind, air traffic controllers repeatedly announced the location and distance of a Cessna airplane (which was ahead of the Beech 400A on a straight-in visual approach to runway 20R). Because the Beech 400A flight crew did not see the other airplane, the controllers appropriately instructed them to maintain their altitude (which was 2,300 ft mean sea level [msl]) for separation until they had the traffic in sight; radar data indicated the Beech 400A briefly descended to 2,200 ft msl then climbed back to 2,300 ft msl. According to the cockpit voice recorder (CVR) transcript, at 1004:42, which was about 12 seconds after the controller instructed the Beech 400A flight crew to maintain altitude, the on board TCAS alerted \"traffic traffic.\" While the Beech 400A did climb back to 2,300 ft msl, this was likely a response to the air traffic control (ATC) instruction to maintain altitude and not a response to the TCAS \"traffic traffic\" warning. At 1004:47, the CVR recorded the SIC state, \"first degree of,\" likely referring to flap extension, but the comment was not completed. The CVR recorded an immediate increase in background noise, which was likely due to the landing gear extension. The PIC then advised the local controller that the flight was turning onto final approach. The CVR did not record any approach briefing or discussion of runway length or Vref speed. After landing on runway 20L at Atlanta-DeKalb Peachtree Airport, aircraft did not stop as expected. It overrun the runway, went through a fence and came to rest near a road, broken in two. All four occupants were injured, both pilots seriously.", "probable_cause": "The flight crew's failure to obtain the proper airspeed for landing, which resulted in the airplane touching down too fast with inadequate runway remaining to stop and a subsequent\r\nrunway overrun. Contributing to the accident were the failure of either pilot to call for a go-around and the flight crew's poor crew resource management and lack of professionalism."}