{"url": "https://www.baaa-acro.com/crash/crash-airbus-a300b4-600-medan-234-killed", "date": "Sep 26, 1997 at 1334 LT", "type": "Airbus A300-600", "operator": "Garuda-Indonesia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Jakarta - Medan", "msn": "214", "yom": 1982, "flight_number": "GA152", "city": "Medan-Polonia", "zone": "North Sumatra", "country": "Indonesia", "region": "Asia", "crew_on_board": 12, "crew_fatalities": 12, "pax_on_board": 222, "pax_fatalities": 222, "other_fatalities": 0, "total_fatalities": 234, "captain_hours": 11978, "captain_hours_type": 782, "copilot_hours": 709, "copilot_hours_type": 709, "aircraft_hours": 27095, "circumstances": "On 26 September 1997 the Garuda Indonesia Flight GA 152, PK-GAI Airbus A300-B4 departed from the Jakarta Soekarno-Hatta International Airport at 04:41 UTC. The aircraft was on a regular scheduled passengers flight to Polonia International Airport of Medan, North Sumatera with estimated time of arrival 06:41 UTC. Flight GA 152 was flying under Instrument Flight Rules during daylight. Before the flight, the flight crew reported to Garuda Indonesia Flight Operations office to receive flight briefings, including Notice to Airmen (NOTAM), weather conditions and forecast en-route, at destination and alternate airports, as well as the flight plan. The NOTAM stated that the MDN VOR was overdue for maintenance and advised to use the facility ‘with caution', although the Medan VOR has been calibrated with both ground and flight calibration on 14 June 1997 and valid until 14 December 1997, the use of Medan VOR was classified as “restricted due to radial course alignment at 270 degrees radial”. At the time of flight-planning, the visibility from Medan TAFOR (26 September 1997, 00.00 UTC – 24.00 UTC) was 1000 meters in smoke. The dispatcher stated that he received information through company channel that the actual visibility at Medan was 400 meters in smoke, which was below the minimum required visibility for runway 05 ILS of 800 meters. At 06:12:51 GA 152 requested a descend clearance to Medan Control. Medan Control cleared the aircraft to descend to FL 150. On passing FL 150, GA 152 was informed that the aircraft was in radar contact, at a distance of 43 nautical miles from MDN VOR/DME. The crew was then instructed to descend to 3000 ft for a landing on Runway 05 and to reduce the speed to 220 knots to allow Bouraq flight BO 683 to takeoff from Runway 23 at 06:20:47. GA152 requested a speed of 250 knots below 10000 feet which was approved. At 6:27:12, Medan Approach instructed GA 152 to maintain altitude on heading to Medan VOR/DME. GA 152 confirmed this instruction at 6:27:21. At 06:27:50 Medan Approach transmitted an instruction “Merpati one five two you er .. turn left heading two four zero vectoring for intercept ILS runway zero five from the right side traffic now er.. rolling”. There was no response by any aircraft to this transmission. At 06:28:06 Medan Approach enquired “Indonesia one five two do you read”. GA 152 asked the ATC to repeat the message. At 06:28:13 Medan Approach instructed GA 152 to “Turn left heading er.. two four zero two three five now vectoring for intercept ILS runway zero five”. This instruction was acknowledged by GA 152. At 06:28:52 the PIC asked the Medan Approach whether the aircraft was clear from the mountainous area northwest from Medan. This was confirmed by Medan Approach, and GA 152 was instructed to continue turning left on heading 215°M. At 06:29:41, GA 152 was instructed to descend to 2000 ft and the crew acknowledged it. Recorded FDR information indicates the aircraft is essentially wings level, heading approx 225M° and passing through 3000 feet on descent. Then at 06:30:04 GA 152 was instructed to turn right heading 046 degrees, and to report when established on the localizer. This was acknowledged by GA 152, but misread the heading “Turn right heading zero four zero Indonesia one five two check established”. Meanwhile recorded FDR information indicates the aircraft commences a roll to the left, heading reducing indicating a left turn and passing through 2600 feet on descent. At 6:30:33, while turning left, First Officer reminded the Captain to turn right. Two seconds later GA 152 queried Medan Approach whether the turn is to the left or to the right onto heading 046 degrees. At 6:30:39 Medan Approach replied “Turning right Sir”, which was acknowledged by GA 152. FDR data shows that the aircraft began to roll to wings level. At 06:30:51 Medan Approach asked whether GA 152 was making a left turn or a right turn. Recorded FDR information indicates the aircraft was wings level and rolling to the right, heading approximately 135°M and increasing, at 2035 feet pressure altitude on descent. GA 152 responded “We are turning right now”. At 06:31:05 Medan Approach instructed GA 152 to continue turning left. Recorded FDR information showed that at this point the aircraft had passed the assigned 2000 ft altitude and continued descending. GA 152 replied “Err...confirm turning left we are starting to turn right now”. During the interview, the controller stated that it was around this time that he recognized that the aircraft went below the required altitude (1800 ft and descending). Recorded FDR information indicates the aircraft reduced right roll from approx 24.3º to 10.2° and then rolled right again to approx 25°, while heading was increasing indicated a right turn was being maintained and the aircraft continued descending. At 06:31:32 the sound of tree impact is recorded. The elevation of the initial impact with the trees was at about 1550 ft above sea level. The final impact on the bottom of a ravine approximately 600 meters from the first tree impact destroyed the aircraft, and 234 people on board of the aircraft perished. There were no ground casualties.", "probable_cause": "There was confusion regarding turning direction of left turn instead of right turn at critical position during radar vectoring that reduced the flight crew’s vertical awareness while they were concentrating on the aircraft’s lateral changes. These caused the aircraft to continue descending below the assigned altitude of 2,000 feet and hit treetops at 1,550 feet above mean sea level."}