{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-62-los-angeles-15-killed", "date": "Jan 13, 1969 at 1921 LT", "type": "Douglas DC-8", "operator": "SAS.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Copenhagen – Seattle – Los Angeles", "msn": "45822/272", "yom": 1967, "flight_number": "SK933", "city": "Los Angeles", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 9, "crew_fatalities": 3, "pax_on_board": 36, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": 11135, "captain_hours_type": 900, "copilot_hours": 5814, "copilot_hours_type": 973, "aircraft_hours": 6948, "circumstances": "The aircraft crashed in Santa Monica Bay, approximately 6 nautical miles west at 1921LT. The aircraft was operating as flight SK933 from Seattle, Washington, to Los Angeles, following a flight from Copenhagen, Denmark. A scheduled crew change occurred at Seattle for the flight to Los Angeles. The accident occurred in the waters of Santa Monica Bay while the crew attempting an instrument approach to runway O7R at Los Angeles International Airport. Of the 45 persons aboard the aircraft, 3 passengers and one cabin attendant drowned, 9 passengers and 2 cabin attendants are missing and presumed dead; 11 passengers and 6 crew members including the captain, the second pilot, and the systems operator, were injured in varying degrees; and 13 passengers escaped without reported injury. The aircraft was destroyed by impact. The fuselage broke into three pieces, two of which sank approximately 350 feet of water. The third section including the wings, the forward cabin and the cockpit, floated for about 20 hours before being towed into shallow water where it sank. This section was later recovered and removed from the water. The weather at Los Angeles International Airport was generally: 1,700 feet broken, 3,500 feet overcast; visibility 4 miles in light rain and fog, wind 060° at 10 knots; and the altimeter setting was 29.87 inches of mercury. The weather in the accident area was reported to be similar. \n", "probable_cause": "The lack of crew coordination and the inadequate monitoring of the aircraft position in space during a critical phase of an instrument approach which resulted in an unplanned descent into the water. Contributing to this unplanned descent was an apparent unsafe landing gear condition induced by the design of the landing gear indicator lights, and the omission of the minimum crossing altitude at an approach fix depicted on the approach chart."}