{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-90-dl-point-mckenzie", "date": "May 24, 1998 at 0024 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Majestic Air Cargo", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Unalakleet - Anchorage", "msn": "20536", "yom": 1944, "flight_number": null, "city": "Point McKenzie", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14000, "captain_hours_type": 7000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 34232, "circumstances": "The captain/operator, the first officer and one passenger, departed on a cross-country positioning flight. The airplane contained about 300 gallons of fuel. After 3.9 hours en route, the flight was cleared for a visual approach to the destination airport. During the approach, both engines lost power about 2,000 feet mean sea level. The pilot stated the right fuel tank was empty. He estimated that 50 to 60 gallons of fuel remained in the left fuel tank. While the airplane was descending toward an area of open water, he attempted to restart the engines without success. He then lowered the landing gear, and made a right turn toward a small airstrip, located about 5 miles northwest of the destination airport. The airplane touched down in an area of soft, marsh covered, terrain. During the landing roll, the airplane nosed down and received damage to the forward, lower portion of the fuselage. An inspection of the airplane by an FAA inspector revealed the left fuel tank contained about 1 inch of fuel. The right fuel selector was positioned on the right auxiliary fuel tank. The left fuel selector was positioned between the left main, and the left auxiliary fuel tanks. ", "probable_cause": "The pilot's inadequate in-flight planning/decision which resulted in fuel exhaustion and subsequent loss of engine power. A related factor was the soft, marshy terrain at the forced landing area. "}