{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-500tp-malibu-meridian-mendoza-2-killed", "date": "Dec 7, 2009 at 1134 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Riley W. Kent", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Rockport – Austin", "msn": "46-97250", "yom": 2006, "flight_number": null, "city": "Mendoza", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3513, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was established on the localizer portion of the instrument landing system approach outside the final approach fix in visual meteorological conditions above clouds. He was then given vectors away from the localizer course by an air traffic controller. The vectors were close together and included a left 90-degree turn, a descent, and a 180-degree right turn back toward the localizer course. During the right turn and descent, the airplane continued turning with increasing bank and subsequently impacted the ground. According to a pilot weather report and flight path data the pilot entered clouds as he was starting the right turn toward the localizer. The combination of descending turns while entering instrument conditions were conducive to spatial disorientation. Further, the heading changes issued by the air traffic controller were rapid, of large magnitude, and, in combination with a descent clearance, likely contributed to the pilot’s disorientation. Diphenhydramine, a drug that may impair mental and/or physical abilities, was found in the pilot’s toxicological test results. While the exact effect of the drug at the time of the accident could not be determined, it may have contributed to the development of spatial disorientation.", "probable_cause": "The pilot’s spatial disorientation, which resulted in his loss of airplane control. Contributing to the pilot's spatial disorientation was the sequence and timing of the instructions issued by the air traffic controller. The pilot’s operation of the airplane after using impairing medication may also have contributed."}