{"url": "https://www.baaa-acro.com/crash/crash-rockwell-sabreliner-60-rocky-point", "date": "Jan 23, 2021 at 1835 LT", "type": "Rockwell Sabreliner 60", "operator": "Aviación Ejecutiva del Bajío", "flight_phase": "Landing (descent or approach)", "flight_type": "Illegal (smuggling)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Guadalajara – Santiago de Querétaro", "msn": "306-35", "yom": 1969, "flight_number": null, "city": "Rocky Point", "zone": "Clarendon", "country": "Jamaica", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On Saturday January 23, 2021, a Sabreliner with registration XB-JMR on a domestic Flight Plan with two pilots on board departed Guadalajara for Queretaro in Mexico. On reaching a cruising altitude of 20,000 feet the crew changed destination and shortly after disappeared off Mexican Radar. Mexican Authorities suspect the Transponder was turned off by the crew. The aircraft entered the Kingston Flight Information Region (KIN FIR) without a filed  Flight Plan, south of Jamaica and at approximately 6:14pm local the crew declared an emergency. The crew reported to Air Traffic Control that they were at 10,000 feet and 14 miles from land and on a heading of 055 degrees (heading north-east). The crew requested instructions to land at the nearest airport due to one engine shut down. The aircraft was observed on radar heading in a north-east direction in the vicinity of the Vernamfield area then changed direction to a south-east heading. The aircraft began circling the Portland Cottage area in Clarendon, 'squawking' Transponder code A1327 and climbing out of 17,000 feet at 6:20pm local. Search and Rescue was initiated with the Jamaica Defence Force at 6:22pm local. On reaching 18,000 feet the aircraft disappeared from radar at 6:34pm local - Transponder possibly turned off by crew. The Aircraft impacted the shoreline south-east of the White Sand Beach area of Rocky Point in Clarendon (17°45'55.69\"N 77°15'42.94\"W) at approximately 6:39pm local. On Sunday January 24, 2021, a site visit was conducted by personnel from the Operations and Airworthiness units of the Flight Safety Division. With assistance from the Security Forces, photographic evidence of the site was collected. The crash site and the aircraft were vandalized. The aircraft may have made a gear up/flaps up landing. Left-wing leading-edge slats were deployed indicating low airspeed and possible high angle of attack at time of impact.\n", "probable_cause": null}