{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2-near-syktyvkar-1-killed", "date": "Mar 23, 1977 at 1330 LT", "type": "PZL-Mielec AN-2", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Timsher – Ust-Kulom – Syktyvkar", "msn": "1G52-33", "yom": 1964, "flight_number": "SU384", "city": "Syktyvkar", "zone": "Republic of Komi", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12589, "circumstances": "The single engine airplane departed Ust-Kulom Airport at 1228LT bound for Syktyvkar with seven passengers and a crew of two on board, accompanied by a second Aeroflot AN-2 (CCCP-98382) that left at the same time. En route, weather conditions worsened and both crew lost visual contact with each other. Approaching Syktyvkar, the crew was informed about the deterioration of the weather with a limited visibility of 1,500 - 2,500 meters in snow. Few radios communications issues occurred and while descending at a height of 150 meters and making a right turn, the pilot saw the second AN-2 and made a sharp turn to avoid collision when control was lost. The airplane crashed on the icy Vychegda River, about 13 km from the Syktyvkar main Station. While the aircraft was destroyed, all nine occupants were injured. About four days later, one of the passengers died from his injuries. ", "probable_cause": "The main cause of the accident was the dangerous convergence of the aircraft due to the extremely irresponsible attitude of the management and dispatching personnel of the Syktyvkar ATC service to fulfill published procedures related to the organization and the control of the aircraft in deteriorated weather conditions. "}