{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-mount-garnet", "date": "May 20, 1988 at 1750 LT", "type": "Rockwell Shrike Commander 500", "operator": "Safcol", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kidston – Cairns", "msn": "500-3188", "yom": 1974, "flight_number": null, "city": "Mount Garnett", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was temporarily replacing the pilot who normally flew the aircraft. After arriving at Kidston he checked the fuel quantity gauge and decided that there was sufficient fuel on board for the return flight. As the aircraft approached top of climb, the pilot found that the fuel gauge indicated a lower fuel quantity than he had expected. He re-checked the indicated quantity after the aircraft was established in cruise and decided that sufficient fuel still remained to complete the planned flight. Shortly after passing Mt Garnet both engine fuel flow gauges began to fluctuate and the engines began to surge. The pilot immediately turned the aircraft towards the Mt Garnet strip, but shortly afterwards both engines failed. The pilot attempted to glide the aircraft to the strip, but it collided with trees and came to rest about one kilometre from the runway 27 threshold. All three occupants escaped with minor injuries and the aircraft was damaged beyond repair. ", "probable_cause": "Both engines had failed due to fuel exhaustion. The pilot normally flew a different type of aircraft, this aircraft only being used by the company to supplement its services. For company aircraft normal route fuel requirements are specified. As a result, there was little need for him to make significant fuel calculations. On this occasion, the pilot found he had little time between his arrival at Cairns and the scheduled DEPARTURE of his next flight. He ordered that only 80 litres of fuel be added to the aircraft tanks. The calculated fuel burn for the proposed return flight to Kidston was approximately 240 litres. However, on DEPARTURE from Cairns it was estimated that only about 220 litres of fuel was in the aircraft tanks. Refuelling facilities were available at Kidston but no fuel was added to the aircraft tanks. \r\nThe following factors were considered relevant to the development of the accident:\r\n1. The aircraft design is such that the fuel quantity can only be determined by the gauge, unless the tanks are full.\r\n2. The preflight preparation, in relation to fuel requirements, carried out by the pilot was inadequate. \r\n3. The pilot lacked recent experience at more complex fuel calculations."}