{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-villavicencio-5-killed", "date": "Mar 12, 2014 at 0633 LT", "type": "Beechcraft 90 King Air", "operator": "Ambulancias-Aereas-de-Colombia", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bogotá – Araracuara", "msn": "LJ-721", "yom": 1977, "flight_number": null, "city": "Villavicencio", "zone": "Meta", "country": "Colombia", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 3013, "captain_hours_type": 538, "copilot_hours": 1341, "copilot_hours_type": 483, "aircraft_hours": 9656, "circumstances": "The twin engine aircraft departed Bogotá-El Dorado Airport at 0600LT on an ambulance flight to Araracuara, State of Caquetá, carrying two doctors, one patient and two pilots. Fifteen minutes into the flight, the crew contacted ATC, reported problems and was cleared to divert to Villavicencio. On approach to Villavicencio-La Vanguardia Airport, the aircraft stalled and crashed in a wooded area parallel to a road, bursting into flames. The aircraft was destroyed by a post crash fire and all five occupants were killed. ", "probable_cause": "The following factors were identified:\r\n- The lack of technical knowledge published in the POH for the execution of the pertinent actions during the failure of the engine in flight, together with the unwise decisions made by the crew in that situation.\r\n- The haste of the crew members to land caused them to act in an uncoordinated manner and without the assertiveness required for the execution of the procedures contemplated by the manufacturer, the navigation charts and the published approach procedures.\r\n- The omissions, reactions and deviations inappropriate to conduct the flight safely to the runway.\r\n- The turning to the runway on the same side of the inoperative (critical) engine and maximum power on the operational engine during the unstabilized approach to the runway threshold which led to loss of control of the aircraft in low altitude flight."}