{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-russian-mission-3-killed", "date": "Aug 31, 2016 at 1001 LT", "type": "Cessna 208B Grand Caravan", "operator": "Hageland-Aviation-Services-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Russian Mission – Marshall", "msn": "208B-5088", "yom": 2014, "flight_number": "HAG3190", "city": "Russian Mission", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 18810, "captain_hours_type": 12808, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3559, "circumstances": "The Cessna had departed about 3 minutes prior on a scheduled passenger flight and the Piper was en route to a remote hunting camp when the two airplanes collided at an altitude about 1,760 ft mean sea level over a remote area in day, visual meteorological conditions. The airline transport pilot and two passengers onboard the Cessna and the commercial pilot and the passenger onboard the Piper were fatally injured; both airplanes were destroyed. Post accident examination revealed signatures consistent with the Cessna's outboard left wing initially impacting the Piper's right wing forward strut while in level cruise flight. Examination revealed no mechanical malfunctions or anomalies that would have precluded normal operation of either airplane. Neither pilot was in communication with an air traffic control facility and they were not required to be. A performance and visibility study indicated that each airplane would have remained a relatively small, slow-moving object in the other pilot's window (their fuselages spanning less than 0.5° of the field of view, equivalent to the diameter of a penny viewed from about 7 ft away) until about 10 seconds before the collision, at which time it would have appeared to grow in size suddenly (the \"blossom\" effect). From about 2 minutes before the collision, neither airplane would have been obscured from the other airplane pilot's (nominal) field of view by cockpit structure, although the Cessna would have appeared close to the bottom of the Piper's right wing and near the forward edge of its forward wing strut. The Cessna was Automatic Dependent Surveillance-Broadcast (ADS-B) Out equipped; the Piper was not ADS-B equipped, and neither airplane was equipped with any cockpit display of traffic information (CDTI). CDTI data would have presented visual information regarding the potential conflict to both pilots beginning about 2 minutes 39 seconds and auditory information beginning about 39 seconds before the collision, providing adequate time for the pilots to react. The see-and-avoid concept requires a pilot to look through the cockpit windows, identify other aircraft, decide if any aircraft are collision threats, and, if necessary, take the appropriate action to avert a collision. There are inherent limitations of this concept, including limitations of the human visual and information processing systems, pilot tasks that compete with the requirement to scan for traffic, the limited field of view from the cockpit, and environmental factors that could diminish the visibility of other aircraft. Given the remote area in which the airplanes were operating, it is likely that the pilots had relaxed their vigilance in looking for traffic. The circumstances of this accident underscore the difficultly in seeing airborne traffic by pilots; the foundation of the \"see and avoid\" concept in VMC, even when the cockpit visibility  offers opportunities to do so, and particularly when the pilots have no warning of traffic in the vicinity. Due to the level of trauma sustained to the Cessna pilot, the autopsy was inconclusive for the presence of natural disease. It was undetermined if natural disease could have presented a significant hazard to flight safety.", "probable_cause": "The failure of both pilots to see and avoid each other while in level cruise flight, which resulted in a midair collision.\n"}