{"url": "https://www.baaa-acro.com/crash/crash-douglas-r4d-5-guam-island-2-killed", "date": "Aug 14, 1978 at 1141 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "US%20Navy", "flight_phase": "Flight", "flight_type": "Military", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Agana - Ulithi Atoll", "msn": "12342", "yom": 1942, "flight_number": null, "city": "Guam Island", "zone": "All Guam Island", "country": "Guam Island", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 1, "pax_on_board": 25, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4500, "captain_hours_type": 50, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane departed Agana at 0949LT to Ulithi Atoll with a crew of five and 25 passengers, among them officers and musicians with their instruments. About 10 minutes after takeoff, while cruising to the southwest at an altitude of 6,000 feet and a speed of 180 knots, the crew reported an oil leak on the right engine but the situation seemed to be under control. About an hour later, at 1046LT, oil pressure fluctuated and the captain decided to return to Andersen Airbase. About 15 minutes later, the right engine was shut down and its propeller was feathered. Unable to maintain a safe altitude, the crew asked the passengers to jettison the cargo but the airplane continued to lost height. Eventually, the captain decided to ditch the airplane about 13 km southwest of the Guam Island coast. The aircraft landed at 1141LT and came to rest on water. The occupants evacuated the cabin and took refuge in dinghies, the airplane sank about 10 minutes later. 28 people, most of them injured, were evacuated about an hour later. Unfortunately, one passenger and the flight engineer drowned. \r\nSource: Seth P. Washburne\r\nReport: http://thirsty13th.com/Images/Guam_Airplane_Crash_1978.pdf", "probable_cause": "The starboard engine developed an oil leak or other malfunction, from an undetermined source, of such severity that it caused cockpit indications of low oil pressure, illuminated the oil pressure warning light, and ultimately resulted in a propeller overspeed."}