{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-62m-bishkek", "date": "Oct 23, 2002 at 0457 LT", "type": "Ilyushin II-62", "operator": "Tretyakovo Air Transport Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Bishkek", "msn": "16 22 2 1 2", "yom": 1976, "flight_number": null, "city": "Bishkek-Manas", "zone": "Bishkek City", "country": "Kyrgyzstan", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 34662, "circumstances": "The aircraft departed Moscow-Domodedovo Airport on a positioning flight Bishkek-Manas Airport where cargo should be loaded. The water ballast tanks were not filled, causing the centre of gravity to be outside the allowed limits. After passing the outer marker on approach to runway 26, a 15-second period of oscillations started with changes in bank angle and heading (between 245° and 255°). The plane passed over the runway threshold at a height of 30 metres and at a speed of 293 km/h. At this point the altitude should have been 15 metres. At a height of 20 metres, at a speed of 297 km/h, the thrust reversers of the n°1 and 4 engines were deployed. This was contrary to regulations, which stipulate that thrust reversers may only be deployed at the leveling-off altitude of 5-8 metres. The nose then rose to a 7° pitch angle. This was caused by the activation of the thrust reversers and the centre of gravity which was too far aft. The pitch-up could not be countered by a 13° nose down elevator application. The plane finally touched down on the maingear wheels 1395 metres down the 4,200 metres long runway. The flight engineer, without telling the pilot in command, shut down the n°2 and 3 engines. With an elevator-down deflection of 10-11° and the stabilizer at -3,3° the crew were still not able to get the nose gear on the ground. After retracting the thrust reversers and with the elevator deflected in a 21° nose-down attitude, the nose pitched down from +7° to -2,5° in 2-3 seconds. The stabilizer was then trimmed from -3,3° to +9° which caused the pitch angle to increase again. The Ilyushin ran off the left side of the runway 3,001 metres past the runway threshold. The plane continued until colliding with a concrete obstruction. The aircraft caught fire and burned out almost completely.", "probable_cause": "Wrong approach configuration on part of the flying crew, which caused the airplane to land too far down the runway. The following contributing factors were identified:\r\n- Poor crew coordination, \r\n- The pilot-in-command who was also the General Manager of the company, did not had sufficient training and qualifications to act in such position, \r\n- Poor crew resources management,\r\n- Poor flight and approach planning. "}