{"url": "https://www.baaa-acro.com/crash/crash-atr42-312-near-paranapanema-2-killed", "date": "Sep 14, 2002 at 0540 LT", "type": "ATR42-300", "operator": "Total%20Linhas%20Aereas.gif", "flight_phase": "Flight", "flight_type": "Postal (mail)", "survivors": "No", "site": "Plain, Valley", "schedule": "São Paulo – Londrina", "msn": "026", "yom": 1986, "flight_number": "TTL5561", "city": "Paranapanema", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6627, "captain_hours_type": 3465, "copilot_hours": 2758, "copilot_hours_type": 1258, "aircraft_hours": 33371, "circumstances": "The twin engine airplane departed São Paulo-Guarulhos Airport at 0440LT on a postal service (flight TTL5561) to Londrina with two pilots on board. About an hour into the flight, while cruising at an altitude of 18,000 feet, the autopilot disconnected while the crew was encountering technical problems with the elevator trim system. The captain asked the copilot to pull out the circuit breaker but this instruction was not understood immediately. Nevertheless, the copilot executed this request few seconds later. Shortly later, the aircraft nosed down and the Vmo alarm sounded, indicating to the crew that the aircraft's speed was above the maximum operating speed. The crew reduced the engine power to 10% but the aircraft entered an uncontrolled descent and crashed at a speed of 366 knots in an open field located 38 km south of Paranapanema. The aircraft was totally destroyed upon impact and both pilots were killed. Some debris were found at a depth of three metres. ", "probable_cause": "The following findings were identified:\r\n- The pilots' perception about the situation was affected by lack of specific training and procedures, which, coupled with the limited time available for action and lack of clarity in communications, influenced the time elapsed for taking corrective actions.\r\n- Communication between the crew was not clear at the time of emergency, making the co-pilot did not understand at first, the action to be performed, which increased the time spent to disarm the CB. Such facts, however, can not be separated from the situation experienced by pilots with inadequate training for emergency and in a short time to identify the problem and take the corrective actions.\r\n- The company had not provided a regular CRM training to pilots. Furthermore, the captain did not receive simulator training for over one year. It was impossible to determine, however, if the regular training and updating of the CRM simulator training of the pilot would have prevented the accident.\r\n- The removal of the pilot from his seat at the time of the emergency may have increased the time spent in identifying the crash and taking corrective actions, but it was not possible to establish whether the accident would be avoided if he would have been in the cockpit. The copilot was slow to understand the situation and initiate corrective actions, although the alarm 'whooler' has sounded, also increasing the elapsed time.\r\n- The operational testing under J IC 27-32-00 allowed the partial completion of the procedures due to lack of clarity, which allowed the release of the aircraft for flight with a defective relay.\r\nFurthermore, although the elevator trim system has been certified, no procedure for emergency triggering of the compensator in the manuals provided by the manufacturer, no replacement intervals of the components of the elevator trim system in \"Time Limits\" systems normal and reserves were not independent and the system had a low tolerance for errors."}