{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c18s-near-mcgrath-8-killed", "date": "Sep 1, 1959 at 2214 LT", "type": "Beechcraft C18S", "operator": "Bailey Enterprises", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Kotzebue – Kiana – Tanana – McGrath – Anchorage", "msn": "881", "yom": 1942, "flight_number": null, "city": "McGrath", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 6500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3429, "circumstances": "The aircraft departed Kotzebue for McGrath, both in Alaksa, at 1315 A.s.t., with nonrefueling stops at Kiana and Tanana. At Tanana Pilot Chefley W. Priest was briefed on en route weather to McGrath as well as on the route and terminal forecasts. He departed Tanana at 1957LT, about an hour before sunset, on a VFR flight plan. An emergency distress call from the aircraft was first heard at 2126LT. There followed several communications between the Beechcraft and the McGrath ground station which issued navigational advice. At or about 2214LT approximately three-quarters of an hour after dark and during rain showers, the aircraft struck the ground violently in a steep spiral at a point about 26 miles from the McGrath Airport. This accident appears to have been caused by the pilot's loss of control during instrument flight and his failure to recover. All eight occupants were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the pilot's loss of control while flying under instrument flight conditions, and failure to recover control. Contributing factors were poor flight planning, possible fuel exhaustion, and the pilot's lack of instrument proficiency."}