{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-a4-near-dunedoo-1-killed", "date": "Oct 30, 1996 at 1000 LT", "type": "Fletcher FU-24", "operator": "Pay%27s%20Air%20Service", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Dunedoo - Dunedoo", "msn": "141", "yom": 1968, "flight_number": null, "city": "Dunedoo", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7200, "captain_hours_type": 28, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot had arrived at the property to commence spraying operations on the day before the accident, and had been provided with a map of the area by the property owner. In addition, the property owner briefed the pilot on the location of relevant powerlines and other obstructions. However, the pilot did not carry out any spraying on that day, but instead flew the aircraft to Scone, in order to have a minor engine problem rectified. He then flew to Mudgee where the aircraft remained overnight. The pilot returned to the area the next morning, arriving on site at about 0645 ESuT. After spraying approximately 175 acres on an adjoining farm, he commenced an aerial inspection of the next property to be treated, but declined an offer by the property owner to accompany him in the aircraft so the property boundaries and powerlines could be pointed out. The aircraft was seen to make three passes over the area before it descended in an easterly direction, toward a crop of barley. A gentle rise, which included a dam bank located at the corner of the crop, had to be negotiated in order for the pilot to position the aircraft at the correct operating height for the swath run. A spurline, suspended over the crop and running in a northerly direction, was located a further 40 m beyond the dam. A witness reported that the aircraft had appeared to be maintaining level flight, and had commenced spraying, when it struck the spurline, then impacted heavily with the ground and overturned, fatally injuring the pilot. The weather in the area at the time of the accident was reported as fine, with light winds. The aircraft struck a three-wire spurline which ran in a northerly direction over the crop, at right angles to its flight path. The line spanned 165 m from the main powerline to the first spurline pole, located about 100 m from a house and to the left of the flight path. A number of large trees nearer to the house provided a backdrop to the spurline pole. A strainer wire stemming from the main powerline was positioned some 92 m further on in the direction of the intended flight path. It was about 10 m in length and ran parallel to the spurline. The strainer wire passed over a road and was attached to a support pole located one metre from the edge of the barley crop. The pilot had commenced the first swathe run by flying in an easterly direction, towards distant rising ground which was cloaked in shadow, whilst the powerline in the foreground was set against this backdrop.", "probable_cause": "The following factors were reported:\r\n1. The pilot had limited recent flying experience.\r\n2. The pilot had limited experience on the aircraft type, particularly with regard to low-level spraying operations, prior to the accident.\r\n3. The performance of the pilot may have been impared by the effects of a medical condition he was suffering from.\r\n4. The location of the spurline was difficult to see and may have been confused with an apparent powerline, further along the intended flight path.\r\n5. The aircraft was not fitted with any form of wire deflector or cutter.\r\n6. The aircraft provided limited structural rollover protection for the pilot during the accident sequence."}