{"url": "https://www.baaa-acro.com/crash/crash-vickers-610-viking-1b-kamershoek", "date": "Oct 17, 1958 at 1210 LT", "type": "Vickers Viking", "operator": "Deutsche Flugdienst", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "London – Düsseldorf", "msn": "250", "yom": 1947, "flight_number": null, "city": "Kamershoek", "zone": "East Flanders", "country": "Belgium", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew departed London-Heathrow Airport at 1001LT on a cargo flight to Düsseldorf, Germany. The flight proceeded normally until halfway roughly between Dover and Wulpen. At this time, at an altitude of 7,000 feet, the crew perceived some hiccups in the right engine. The boost fluctuated and the RPM varied  /- 50 revolutions/min. The captain assumed that it was caused by icing, activated carburetor heaters and gave some brief shots of alcohol. After these actions the situation seemingly became normal. Just before reaching Wulpen, the right hand engine boost fell to 25\". The oil pressure fell to 60 - 70 psi (normal pressure is 80 psi). The cylinder temperature was normal. The captain decided to shut down the engine and feather the prop. The crew contacted Brussels and were cleared to descend and divert to Brussels Airport. The pilot manoeuvred around some rain showers during the descent towards Brussels. At 11:55 local time the flight reported at 1500 feet, and almost at the Mackel beacon. The flight crew were not able to maintain altitude so the captain decided to restart the no. 2 engine. He instructed the copilot to carry out the restart. The copilot failed to use a checklist while performing the actions to restart the engine. A few minutes later the crew noticed that the right engine was on fire. Three fire extinguishing bottles were fired, but the fire was not contained. The captain then carried out an emergency descent. The airplane came down in a field next to the village of Kamershoek. It burst into flames after the three crew members exited the plane.\r\nSource:\r\nhttps://aviation-safety.net/database/record.php?id=19581017-1", "probable_cause": "- The incident that led the captain to stop the right engine and feather the corresponding propeller has not been clarified. \r\n- The captain could not maintain altitude on one engine in flight, while the AFM indicated that it was possible, especially as the aircraft was below its maximum weight. The fact of operating with the remaining engine at a boost of 33\" and later 44\" was allowed, while maintaining temperature, power was reduced below the required value.\r\n- The restart of the engine without complying with the formal procedure sparked a fire that required the emergency landing."}