{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-53-do-new-bedford-12-killed", "date": "Sep 15, 1957 at 2046 LT", "type": "Douglas C-53 Skytrooper (DC-3)", "operator": "Northeast%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Boston – Hyannis – Martha’s Vineyard – New Bedford – New York", "msn": "7337", "yom": 1942, "flight_number": "NE285", "city": "New Bedford", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 21, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 7079, "captain_hours_type": 4348, "copilot_hours": 2097, "copilot_hours_type": 1522, "aircraft_hours": 35685, "circumstances": "Northeast Airlines Flight 285 is a scheduled passenger operation originating at Boston, Massachusetts, and terminating at New York, New York, with intermediate stops serving Hyannis, Nantucket, Martha's Vineyard, and New Bedford, Massachusetts. On September 15, 1957, the flight originated on schedule, its crew consisting of Captain Vincent L. Pitts, Reserve Captain Roger W. Sweetland, serving as copilot, and Stewardess Nancy J. Lehan. Flight 285 was routine until it reached Martha's Vineyard where it landed at 2007 following a missed approach in poor weather conditions. The flight departed Martha's Vineyard for New Bedford at 2019, about 50 minutes behind schedule, the result of the missed approach, IFR delays, and accumulated minor delays. The flight to New Bedford was in and on top of Instrument weather conditions and was conducted according to an IFR (Instrument Flight Rules) flight plan. The clearance given the flight by ARTC (Air Route Traffic Control) through company radio was as follows. \"ATC clears Northeast 285 to the New Bedford middle marker, via direct Otis, Red 94, to maintain 4,000, to make climb to 2,500 at the Martha's Vineyard radio beacon before proceeding on course. Report on course and report the Otis radio beacon.\" At departure there was sufficient fuel for the flight to New Bedford, and, if necessary to the designated alternate airport, Boston, with the required reserve upon arrival there. Also, at this time, according to the company load manifest, the aircraft was loaded to a gross weight of 22,443 pounds, well under the maximum allowable of 25,346 pounds. The load was distributed within the center of gravity limitations of the aircraft. At 2024 the flight reported to the company radio at Martha's Vineyard that it was over the Martha's Vineyard radio beacon, \"2,500 feet on course.\" At 2029 it again contacted the company at Martha's Vineyard and reported it was then over Otis at 4,000 feet. A few minutes later Flight 285 contacted the New Bedford taper controller and informed him it was unable to give the Otis report to the company at Boston. The controller took the progress report and requested the flight to contact Providence approach control (Providence controls IFR flights in the New Bedford area). The flight immediately contacted Providence approach control and was cleared to maintain 4,000 feet to the compass locater at the New Bedford middle marker and to report over the marker. This was acknowledged. Immediately thereafter Providence cleared Flight 285 for an approach to the New Bedford Airport and requested it to report leaving 4,000 feet and then switch to the New Bedford tower. At 2036 the flight reported leaving 4,000 feet. Flight 285 then contacted the New Bedford tower operator and thereafter, at 2038, according to the controller, stated it was starting an ILS approach. The controller gave the flight the latest weather as follows: Indefinite 200, obscuration; visibility one mile; fog; wind southeast 3; altimeter 30.02. He also cleared the flight to land, ILS approach, straight in to runway 5, and requested that it call the tower when inbound at the outer marker. Following this clearance the captain of another Northeast flight, 275, which had shortly before, at 2031, taken off from runway 23, the reciprocal of 5, gave Flight 285 the following information. \"It'll be tight.\" Flight 285 reported that it had completed the procedure turn and was inbound over the outer marker. The controller acknowledged this report which was the last communication with the flight. He logged the report at 2046, shortly after it was received. The airplane clip trees and crashed in a dense wooded area located 4,000 feet short of runway 05 threshold. Both pilots and ten passengers were killed while 12 other occupants were injured. The aircraft was destroyed. ", "probable_cause": "The Board determines that the probable cause of this accident ins that the pilot, attempted to make a visual approach by descending prematurely in the approach area without adherence to the prescribed ILS approach procedure which was dictated by existing weather conditions. The following findings were reported:\r\n- Flight to the New Bedford area was made in and on top of instrument weather conditions in accordance with an instrument flight rules flight plan,\r\n- Flight 285 reached the New Bedford area and was cleared for an ILS approach,\r\n- Weather conditions at the airport and the surrounding area clearly dictated an ILS approach,\r\n- Airborne and ground equipment necessary to the ILS approach was functioning normally,\r\n- Flight 285 descended prematurely in the approach area without conformity to the ILS procedure,\r\n- Flight 285 descended to a low and unsafe altitude in an attempt to approach the airport visually, assisted by directional instruments,\r\n- The flight did not conform to the ILS glide path,\r\n- From low altitude a descent occurred which was not recognized by the pilots in time for corrective action to be effective,\r\n- The trees struck were located 165 feet to the right of the localizer centerline, nearly 189 feet below the glide path centerline, and about 4,000 feet short of the runway threshold,\r\n- There was no evidence of malfunction of the aircraft, its systems, or powerplants."}