{"url": "https://www.baaa-acro.com/crash/crash-cessna-421a-golden-eagle-i-chesterfield", "date": "May 23, 2007 at 1540 LT", "type": "Cessna 421A Golden Eagle I", "operator": "Golden Eagle Air", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chesterfield - Cahokia", "msn": "421A-0082", "yom": 1968, "flight_number": null, "city": "Chesterfield-Spirit of St Louis", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15450, "captain_hours_type": 1200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2835, "circumstances": "Shortly after takeoff the pilot experienced a loss of power on the right engine. He attempted to return to the airport to land, but determined that he was not going to reach the runway so he elected to land on a dirt field. He flew under power lines that were in his flight path and attempted to flare the airplane prior to it impacting the terrain. The airplane was equipped with Teledyne Continental GTSIO-520 engines. Post accident examination of the right engine revealed that all of the teeth on the starter adapter gear and several of the teeth on the crankshaft gear were missing. Several gear teeth and metal filings were located in the oil sump. The torsional damper to shaft gear woodruff key was sheared. The torsional damper was placed on a test bench to determine the damping time. The consecutive tests averaged a damping time of 6.9 seconds. The damping time of a new damper is min/max 1.5 to 3.125 seconds. Metallurgical examination revealed 15 starter gear teeth and 11 crankshaft gear teeth were fractured near their root. No indications of preexisting cracking were noted. At least two of the starter gear teeth and several of the crankshaft gear teeth displayed spalling and wear at the pitch line of the teeth. On June 13, 1994, Teledyne Continental issued a Mandatory Service Bulletin, MSB94-4, addressing the possible failure of the starter adapter gear and/or crankshaft gear on GTSIO-520 and GIO-550 engines. On October 31, 2005, Teledyne Continental issued revision, MSB94-4G. The service bulletin called for an inspection of the starter adapter viscous damper and shaft gear backlash every 100 hours of engine operation, and a visual inspection of the starter adapter shaft and crankshaft gear teeth for spalling, pitting, and wear, every 400 hours of engine operation. The Federal Aviation Administration (FAA) issued Airworthiness Directive (AD) 2005-20-04, effective November 1, 2005, requiring compliance with the Teledyne Continental Mandatory Service Bulletin. Maintenance records showed the mandatory service bulletin had been complied with when the right engine was overhauled and installed in March 2001. There was no indication in the maintenance records that either the mandatory service bulletin or the AD had been complied with since the engine was installed. The engine had a total time of 541.9 hours at the time of the accident. The pilot did not follow the published emergency procedures.", "probable_cause": "Maintenance personnel failed to comply with an Airworthiness Directive which resulted in the total failure of the starter adapter gear teeth and the crankshaft gear teeth and the pilot failed to follow the published emergency procedures. Contributing to the accident were the low altitude at which the loss of power occurred, the power lines, and the unsuitable terrain which prevented the pilot from adequately flaring the airplane and resulted in the subsequent hard landing."}