{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-325-navajo-cr-sumter", "date": "Aug 1, 2020 at 1000 LT", "type": "Piper PA-31-310 Navajo", "operator": "Terraquest", "flight_phase": "Flight", "flight_type": "Topographic", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Manning - Manning", "msn": "31-7512038", "yom": 1975, "flight_number": null, "city": "Sumter", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1625, "captain_hours_type": 550, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12038, "circumstances": "According to the pilot, he and the copilot were flying low-level mapping flights in the twin-engine airplane. Although the copilot was not multi-engine rated, he and the pilot regularly switched control of the airplane during the mapping flights. On the accident flight, the pilot was seated in the right seat; the copilot was seated in the left seat; and they were flying the airplane at an altitude of about 300 ft above ground level. According to the pilot, they flew for about 2 hours before he, who was the pilot flying at the time, switched fuel tanks from the inboard tanks to the outboard tanks. The pilot did not tell the copilot he had switched fuel tanks. About 1.5 hours later, while the copilot was the pilot flying, the left engine started to surge and lose power. The pilot began the steps of the emergency procedure for an engine failure in cruise flight starting with moving the fuel selectors to the inboard tanks. Power was not restored; the airplane immediately began losing altitude; and the pilot took over control of the airplane. The copilot stated that at the time the pilot took over control, he looked at the fuel tank quantity gauges, and they both displayed zero. The pilot reported that the airplane stalled just above the ground during the emergency landing in a field. The right wing struck first, and within a couple of seconds, the right outboard fuel tank exploded. The pilot and copilot egressed out the rear door. Examination of the wreckage revealed that neither engine exhibited evidence of power at impact. The left outboard fuel tank was found completely full of fuel, and the left inboard fuel tank was empty. Both right wing tanks were fire damaged, and the fuel quantity in the tanks at impact could not be determined. Further examination revealed that the fuel crossfeed valve was in the “crossfeed/open” position. No fuel was observed in the valve or attached fuel lines during disassembly. The left fuel selector valve was found in the “OFF” position, and no fuel was observed within the fuel line between the valve and gascolator. The right fuel selector valve was damaged by fire, and its position at impact could not be determined. No other anomalies were noted in the engines or airframe. According to the pilot, all fuel tanks were full before the flight. According to the pilot’s operating manual, the airplane likely consumed about 33.1 gallons of fuel per hour or a total of about 115 gallons of fuel during the 3.5-hour flight. Given that the inboard fuel cells held 56 gallons each (112 gallons total), that the left inboard tank was found empty, and that the copilot noticed that the fuel gauges were reading zero just before impact, it is likely that each engine was drawing fuel from its respective inboard tank throughout the flight until those tanks were empty. The left engine lost power first, and the right engine likely lost power just before impact. The postaccident positions of the crossfeed valve (on) and the left fuel selector (off) did not correspond to the pilot’s statements regarding his positioning of the fuel selector valves during the flight. The fuel panel was located between and behind the pilots’ seats and required the pilots to look down and back in order to see the panel when making changes to the panel; therefore, it is likely the pilot misconfigured the valves when he switched tanks 2 hours into the flight, when he switched tanks after the left engine lost power, or on both occasions. It is unlikely the copilot would have been able to see an incorrect switch selection on the fuel panel due to the location of the panel, and he would have been unlikely to look at the 2-hour point as the pilot did not verbalize that a change to the panel had been made. ", "probable_cause": "The pilot’s fuel mismanagement during flight, which resulted in a total loss of engine power from both engines due to fuel starvation.\n"}