{"url": "https://www.baaa-acro.com/crash/crash-avro-652-anson-i-mt-ben-more-assynt-6-killed", "date": "Apr 13, 1941 at 1306 LT", "type": "Avro 652 Anson", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Mountains", "schedule": "Kinloss - Stornoway - Kinloss", "msn": null, "yom": null, "flight_number": null, "city": "Mt Ben More Assynt", "zone": "Sutherland", "country": "United Kingdom", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft had taken off from Kinloss in less than ideal weather to follow a route via Oban, Stornaway and Cape Wrath before returning to Kinloss. The aircraft had completed the first two legs of its flight and reported passing Stornaway in icing conditions around this time the aircraft's port engine lost power and failed. Some time after this having either flown onto Cape Wrath or turning for base near Stornaway the aircraft flew into high ground in near white out conditions to the North East of Inchnadamph. The aircraft was reported overdue at Kinloss and an air search was initiated but this failed to locate the missing aircraft, it wasn't until the 25th May that the aircraft was located by a shepherd. A decision was made not to recover the remains of the crew due so they were all buried near the crash site and the aircraft was broken up and pushed in nearby gullies.  When the wreck was discovered it was found that the crew had survived the crash and had probably died in the hours shortly after the crash from the affects of their injuries and exposure / hypothermia. One crew member had attempted to walk to help but headed east away from civilization and also perished in the cold. On the same day three shepherd's died from exposure and hypothermia in the Assynt area, showing that the weather was unseasonably bad.\r\nCrew (19th OTU):\r\nF/O James Henry Steyn, instructor,\r\nP/O William Edward Drew, observer and instructor, \r\nSgt Charles McPherson Mitchell, observer, \r\nF/S Thomas Brendon Kenny, wireless operator, \r\nSgt Jack Emery, wireless operator and air gunner, \r\nSgt Harold Arthur Tompsett, wireless operator and air gunner.\r\nSource:\r\nhttp://www.peakdistrictaircrashes.co.uk/pages/scotland/scotlandn9857.htm ", "probable_cause": "The accident was caused by an engine failure due to icing, and occurred in whiteout conditions."}