{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46f-1-cu-commando-windsor-locks-2-killed", "date": "Mar 4, 1953 at 0150 LT", "type": "Curtiss C-46 Commando", "operator": "Slick-Airways2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Windsor Locks – Philadelphia – Cleveland – Detroit – Chicago", "msn": "22400", "yom": 1945, "flight_number": "SL1623", "city": "Windsor Locks-Bradley", "zone": "Connecticut", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7742, "captain_hours_type": 5092, "copilot_hours": 4074, "copilot_hours_type": 1958, "aircraft_hours": 43310, "circumstances": "At 0139 the pilot advised Bradley Approach Control that the aircraft was over Hartford at 0138 and that he would maintain 3,000 feet to the Bradley Field outer marker. The controller in the Bradley Field tower, who was handling all three radio positions, acknowledged the Hartford position report, gave the flight a time check (0139), and cleared it for an instrument approach with advice that No. 6 was the runway in use. Weather information was also given to the flight: \"Wind indicating northeast calm,\" and Bradley Field 0128 weather conditions - ceiling indefinite 500 feet, obscurement, visibility one and one-half miles, light rain and fog, altimeter 30.01 inches. The pilot was then requested to report over the outer marker when inbound and was advised that the Bradley Field glide path was inoperative until further notice. The glide path had been decommissioned for some time owing to extension of Runway 6; this had been duly published in \"Notices to Airmen.\" At approximately 0141, the pilot asked if the Bradley Field ILS localiser was also inoperative. He was told that the monitoring panel indicated normal operation of all components except the glide path. The pilot replied, \"I believe my ILS is cut momentary and I will continue to make an ADF let-down.\" The flight reported over the outer marker at 0144. The controller acknowledged and asked the pilot if the flight was inbound. The pilot replied \"Roger\" and the aircraft was cleared to land. The controller advised that the high intensity lights were on intensity 5 (maximum brilliance) and requested the pilot to let the tower know when he wished the intensity lowered, The pilot again acknowledged with \"Roger.\" This was the lest contact with the aircraft. At approximately 0149, the controller requested the pilot to give the aircraft's position. Receiving no response, he then transmitted the following advisory: \"If you are experiencing transmitter difficulties and have missed your approach you are cleared to reverse course, climb to 2,500 feet to the outer marker for another approach 2 Several other efforts were made to contact the flight, but to no avail. Following the last contact with the tower, the aircraft was seen and heard flying low to the southwest of Bradley Field just before it struck the trees. The aircraft was destroyed by impact forces and both pilots were killed. \r\nCrew:\r\nJefferson R. Elliott, pilot,\r\nJohn Bielak, copilot.", "probable_cause": "The Board determines that the probable cause of this accident was that after missing his first approach to the airport, the pilot displayed poor judgment in attempting a circle under the overcast in rain and at night, rather than execute a standard instrument approach. The following findings were pointed out:\r\n- The controller did not receive any information from the pilot that he had missed the first approach, was conducting a missed approach procedure, was circling with visual contact, nor was any request received for clearance to conducts second approach,\r\n- The pilot did not cancel his IFR flight plan at any time,\r\n- There was no evidence of mechanical failure or malfunction of either the aircraft or engines."}