{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-hailey-2-killed", "date": "Dec 6, 2004 at 1723 LT", "type": "Cessna 208B Grand Caravan", "operator": "Salmon%20Air-2_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Salt Lake  City – Hailey", "msn": "208B-0866", "yom": 2000, "flight_number": "MBI1860", "city": "Hailey-Friedman Memorial", "zone": "Idaho", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 9757, "captain_hours_type": 202, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2117, "circumstances": "Weather reporting facilities reported icing conditions in the area of the accident site. The pilot of a Cessna Citation flying the same RNAV approach twenty minutes prior to the accident aircraft reported picking up light to occasional moderate rime ice. The last communication between the local air traffic controller and the accident pilot indicated that the flight was two miles south of the final approach fix. The controller inquired if the pilot had the runway in sight, and the pilot reported \"negative, still IMC.\" A witness on the ground near the accident site reported that he heard the aircraft first then saw it at a low level below the cloud base flying in a southeasterly direction. The witness stated that the right wing was lower than the left as the aircraft continued to descend. The witness then noted that the wings were moving \"side to side\" (up and down) a couple of times before the nose of the aircraft dropped near vertical to the terrain. This witness reported hearing the sound of the engine running steady throughout the event. The wreckage was located in a flat open field about 3,000 feet south of the final approach fix coordinates. The aircraft was destroyed by impact damage and a post crash fire.", "probable_cause": "The pilot's failure to maintain aircraft control while on approach for landing in icing conditions. Inadequate airspeed was a factor."}