{"url": "https://www.baaa-acro.com/crash/crash-avro-652-anson-i-mt-foel-frach", "date": "Nov 30, 1943 at 2320 LT", "type": "Avro 652 Anson", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Mountains", "schedule": "Jurby - Jurby", "msn": null, "yom": null, "flight_number": null, "city": "Mt Foel Grach", "zone": "Gwynedd", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew were on a night cross country navigation exercise from their home base of Jurby, on the northern plain of the Isle of Man. Most routes flown from Jurby were circular tours of the Irish Sea. While flying west, presumably on a clockwise orbit of the Irish Sea, the aircraft flew into to gentle grassy slopes of the Carneddau. At about 12:30 on the 1st December the RAF Mountain Rescue team based at Llandwrog were informed by the station's Flying Control Officer that two of the aircraft's crew had walked down to Bethesda, after having spent the night in the aircraft. The MRT began their search from Bethesda police station, they were then directed to the village store where they found the two aircrew. The two crew were unable to avail the team members of the exact location of the aircraft, having walked down in low visibility. They then began a search of the area to the north and west of Carnedd Llewellyn but found nothing before sunset, when they had to abandon the search and return to base. The second day of the search started at 07:30 with the team searching around Carnedd Dafydd. At 11:00 a third member of the crew was reported as having walked off the mountain to Bethesda. He was able to inform the Police more about where the aircraft, and the now lone fourth crewman was located. The hill parties were recalled and then drove to Tal-y-bont before proceeding up the track to Melynllyn to search the mountains in that area. At about 15:30 one of the search parties came across the wreck in the area between Foel Grach and Garnedd Uchaf and the cliffs of Craig y Dulyn. The fourth crew member was found alive in the aircraft's turret. He was reported to be \"suffering from dehydration, starvation and a fractured foot, but his spirits were high\". He was recovered by a stretcher party, arriving at the Ambulance after nightfall.\r\nCrew (5th AOS):\r\nSgt James A. Knight, pilot,\r\nSgt Roy Gilbert, wireless operator and air gunner, \r\nLAC Reed, navigator, \r\nLAC Thomson, navigator.\r\nSource: \r\nhttp://www.peakdistrictaircrashes.co.uk/pages/wales/walesef909.htm", "probable_cause": null}