{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-aguadilla", "date": "Oct 27, 2010 at 1740 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Punta Cana - San Juan", "msn": "31-8252049", "yom": 1982, "flight_number": null, "city": "Aguadilla", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1902, "captain_hours_type": 38, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4736, "circumstances": "The pilot stated he experienced a high temperature in the right engine and a partial loss of engine rpm while at 9,000 feet mean sea level in cruise flight. He requested and received clearance from air traffic control to descend and divert to another airport. He leveled the airplane at 2,500 feet and both engines were operating; however, the right engine experienced a loss of rpm which made it difficult to maintain altitude. The pilot reduced power in both engines, turned the fuel boost pump on, opened the cowl flaps and the engine continued to run with a low rpm. The pilot elected to ditch the airplane in the ocean, instead of landing as soon as practical at the nearest suitable airport, as instructed in the Pilot's Operating Handbook (POH). Additionally, he shut down the right engine before performing the troubleshooting items listed in the POH. He attributed his decision to ditch the airplane to poor single-engine performance and windy conditions. The wind at the destination airport was from 060 degrees at 6 knots and runway 8 was in use at the time of the accident. The airplane was not recovered.", "probable_cause": "The pilot's improper decision to ditch the airplane after a reported partial loss of engine power and overheat on one engine for undetermined reasons.\n"}