{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-near-mys-kosistyy-6-killed", "date": "Nov 1, 1948 at 2140 LT", "type": "Lisunov LI-2", "operator": "Polyarnaya%20Aviatsiya", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Kresty Kolymskiye – Chokurdakh – Mys Kosistyy", "msn": "184 30 12", "yom": null, "flight_number": null, "city": "Mys Kosistyy", "zone": "Krasnoyarsk Krai", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was performing a cargo flight from Kresty Kolymskiye to Mys Kosistyy with an intermediate stop in Chokurdakh. Approaching this airport, weather conditions were poor and the captain decided to divert to the alternate airport of Ust-Yansk located 420 km west of Chokurdakh. On ground at Ust-Yansk, a technical problem was identified on the right engine. After repairs, some tests were made for 1 hour and 10 minutes and as they were conclusive, it was decided to proceed to Mys Kosistyy. En route, while cruising at an altitude of 2,100 meters, the crew encountered technical problems with the right engine due to a loss of hydraulic pressure. The pilot was able to shut the engine down but unfortunately, it was not possible to feather the propeller. Due to high drag, the aircraft was unable to maintain a safe altitude and the crew elected to make an emergency landing. While descending through clouds, the crew encountered icing conditions and the windscreen was covered by ice. In such conditions, the pilot was unable to distinguish the ground when the aircraft crashed in a frozen area located 16 km east of Mys Kosistyy. The wreckage and the six dead bodies were found 16 days later, on November 17, 1948. ", "probable_cause": "It was determined that the failure of the right engine was caused by a faulty conception of a hydraulic supply vent. Due to a lack of oil pressure, the engine was shot down but the propeller could not be feathered, causing high drag and necessitating an emergency landing. Heavy flight conditions, high drag, night and poor weather conditions, poor operational organisation, absence of a flight plan and the fact that the crew failed to take a 2 hours fuel reserve were considered as contributory factors. "}