{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24a-950m-near-thames-1-killed", "date": "Jul 24, 2002 at 1450 LT", "type": "Fletcher FU-24", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Orongo - Orongo", "msn": "143", "yom": 1968, "flight_number": null, "city": "Thames", "zone": "Waikato Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2016, "captain_hours_type": 1522, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "About 0900 hours on 24 July 2002, the pilot commenced spraying operations on flat farmland in the Orongo area, some three kilometres to the south-west of Thames Aerodrome. Loading for the operation was carried out at Thames by the pilot’s father, who as an experienced agricultural pilot, was also acting in a supervisory role. The pilot had only recently qualified for spraying, all his previous agricultural experience being topdressing. Spraying was stopped about 1210 hours because of unsuitable wind conditions, and both pilot and loader driver took a break for lunch at the loader driver’s home. Conditions improved after lunch, and spraying was restarted at 1350 hours, the pilot finishing the remaining treatment of the first property. The second property was started at 1420. The long axes of the paddocks on this property were aligned approximately north-west/south-east, and the pilot carried out his spray runs at right angles to the general alignment, progressively covering several paddocks on each run. The beginning of the runs was delineated by a row of about 30 mature trees of various species, over which the pilot had to descend on a south-westerly heading. On completion of the main part of the property, the pilot was left with one paddock on the other side of the trees. At the north-western end of this paddock was a barn and stockyards. On the first run over this paddock, the pilot approached over the barn and made the first spray run to the south-east. He was seen to make a 180-degree reversal turn and align the aircraft with the left (looking north-west) boundary of the paddock, in close proximity to the trees. On this heading, he was flying into the sun and towards the barn. Part -way into this run the left wing outer panel struck a protruding branch and part of the aileron was torn off. Further collisions occurred as the aircraft progressed along the tree line. The aircraft rolled inverted, struck the ground and slid to a halt with the engine still running.  The farmer and his partner were driving separately along the nearby road, towards the barn when the accident happened. The farmer continued to the scene while his partner went to a neighbour’s house to alert emergency services. Arriving at the aircraft, the farmer quickly realised that there was nothing he could do for the pilot. The accident occurred in daylight, at approximately 1450 hours NZST, at Orongo, at an elevation of 10 feet. Grid reference: 260-T12-347440; latitude S 37° 10.7', longitude E 175° 31.6'. ", "probable_cause": "Conclusions:\r\n- The pilot was appropriately licensed, rated and fit to carry out agricultural spraying operations.\r\n- The aircraft had been operating normally up until the time of the accident.\r\n- While operating into the sun and in close proximity to a line of trees, the left wing of the aircraft struck a substantial branch. \r\n- The initial collision damaged the left aileron, and subsequent collisions with further branches progressively demolished the outer wing section.\r\n- The aircraft damage resulted in a probably uncontrollable roll, followed by an inverted ground impact.\r\n- The accident was not survivable.\r\n- The aircraft structure did not feature any rollover protection for the cockpit occupant(s). "}