{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154b-1-krasnovodsk-11-killed", "date": "Jan 18, 1988 at 0519 LT", "type": "Tupolev TU-154", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow – Krasnovodsk – Ashgabat", "msn": "78A254", "yom": 1978, "flight_number": "SU699", "city": "Krasnovodsk", "zone": "Balkan Province (Balkan welaýaty)", "country": "Turkmenistan", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 0, "pax_on_board": 137, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15859, "circumstances": "Following an uneventful flight from Moscow-Domodedovo, the crew started a night approach to Krasnovodsk Airport. The visibility was reduced due to the night combined with clouds down to 400 meters. The copilot was the pilot-in-command and he completed the approach at a speed of 270 km/h with flaps down at 28°. During the last segment, flaps were downed to an angle of 45° when the rate of descent increased to 10 meters per second. At a height of 30 meters, the copilot did not have visual contact with the runway but the captain decided to continue the approach. At an excessive speed of 275 km/h, the aircraft touched down 3 meters to the left of the runway centerline. It bounced, rolled for few hundred meters and came to rest on the main runway, broken in two. Eleven passengers were killed, 120 people were injured while 15 other escaped uninjured. ", "probable_cause": "Wrong approach configuration on part of the pilot-in-command (copilot) who continued the approach after passing the minimum descent altitude without any visual contact with the runway.\r\nThe following contributing factors were reported: \r\n- Excessive approach speed and rate of descent, \r\n- Poor approach planning and landing preparation, \r\n- Lack of crew coordination, \r\n- Lack of supervision on part of the captain,\r\n- The crew failed to initiate a go-around procedure,\r\n- Poor visibility due to the night and low clouds. "}