{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-134a-samara-6-killed", "date": "Mar 17, 2007 at 1140 LT", "type": "Tupolev TU-134", "operator": "UTAir", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Surgut - Samara - Belgorod", "msn": "48390", "yom": 1976, "flight_number": "UT471", "city": "Samara-Kurumoch", "zone": "Samara oblast", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 50, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 35154, "circumstances": "The aircraft departed Surgut on a flight to Belgorod with an intermediate stop in Samara, carrying 50 passengers and 7 crew members. While descending to Samara-Kurumoch Airport, weather conditions worsened and the visibility was below minimums. After the approach checklist was completed, the crew lowered the landing gear, selected flaps down at 30° and continued the approach. In poor visibility, the aircraft descended below the MDA until it struck the ground at a speed of 320 km/h and crashed 304 metres from the runway threshold and 95 metres to the left of its extended centerline. The aircraft came to rest upside down and partially burned. Six passengers were killed, 21 other occupants were injured and 30 people escaped uninjured. At the time of the accident, the visibility was estimated to be 150 metres with an RVR of 200 metres for runway 23 and a vertical visibility of 300 feet in freezing fog. ", "probable_cause": "The decision of the crew to continue the descent below MDA in below minimums weather conditions until the aircraft impacted ground and crashed. The following contributing factors were identified:\r\n- Organizational, technical and procedural deficiencies in the work and interactions between the met office and ATC services as well as from the crew,\r\n- Deficiencies in the standards and technical documentation of the Samara Airport that made it impossible for ATC to inform the crew on a timely manner about the readings from the KRAMS-4 weather station that indicated a deterioration of the weather conditions below airport minimums,\r\n- At decision height, in the absence of reliable visual contact with the approach lights and airport environment, the flight crew failed to initiate a go-around procedure,\r\n- ATC failure to use the full capability of the radar equipment because of contradictions in the relevant standards and procedures documents, \r\n- Poor crew coordination and their delay in executing a missed approach procedure,\r\n - Lack of unified federal regulations covering flight operations, ATC, met and other services, taking into account both domestic and international experience in flight safety."}