{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-13-portland", "date": "Aug 11, 1949 at 2117 LT", "type": "Convair CV-240", "operator": "Northeast%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Boston – Portland", "msn": "161", "yom": 1949, "flight_number": "NE812A", "city": "Portland", "zone": "Maine", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 25, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11516, "captain_hours_type": 285, "copilot_hours": 1770, "copilot_hours_type": 105, "aircraft_hours": 506, "circumstances": "The trip from Boston was routine and at 2112 the flight contacted the Portland tower and received landing instructions as follows \"Northeast 812 Able cleared to enter traffic pattern Runway 20. Wind east variable southeast 5. The altimeter 2998. Check on base leg.\" At 2116 the flight reported turning into final approach and was cleared to land on Runway 20. As the aircraft passed over the approach end of the runway, at an estimated altitude of 20 to 25 feet and an indicated airspeed of 120 mph, the throttles were brought back to what was expected to be the closed position, preparatory to landing. However, due to malfunctioning of the propeller reverse lock mechanism, the throttles were actually brought back beyond the closed position and into the propeller reverse pitch position instead. This unexpected reversal of propeller pitch in flight resulted in an extremely hard landing 237 feet past the approach end of the runway with serious damage to the aircraft structure. The airplane, however, continued along the runway a distance of 1,065 feet from the point of initial impact before it came to rest. Fuel which had been spilled along the runway was ignited by sparks from the damaged aircraft and propellers scraping along the runway surface. The fire became concentrated for a period on the right side adjacent to the right engine and right wing root, but subsequently enveloped the major portion of the aircraft. All passengers were evacuated in an orderly manner through the rear cabin exit door. The captain and first officer made their escape through the left cockpit window after all effective action possible had been taken to control the fire. The airport fire equipment arrived shortly thereafter but was unable to extinguish the fire before the aircraft had been damaged beyond economical repair. Five people were slightly injured while all other occupants were unhurt. ", "probable_cause": "The Board determines that the probable cause of this accident was failure of the throttle looking device to function properly thus permitting the movement of the throttles beyond the stop into the propeller reverse pitch position."}