{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-18v-shelikov-gulf-10-killed", "date": "Feb 26, 1963 at 0855 LT", "type": "Ilyushin II-18", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Mys Schmidta – Anadyr – Magadan", "msn": "181 0026 01", "yom": 1960, "flight_number": null, "city": "Shelikov Gulf", "zone": "Magadan oblast", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2105, "circumstances": "The crew departed Mys Schmidta (Cape Schmidt) with 14,5 tons of fuel to Anadyr. Following an uneventful flight, a load of 10 tons of meat was loaded in Anadyr and the crew left Anadyr Airport at 0625LT bound for Magadan. One hour and twenty minutes into the flight, while cruising at an altitude of 7,000 meters, the radio operator informed ATC that the engine number two failed. The captain started an emergency descent and reach the altitude of 3,000 meters five minutes later when the engine number one failed as well. In such conditions, the crew elected to make an emergency landing on the icy Shelikov Gulf. The airplane belly landed on the ice and slid for several yards before coming to rest 2,700 meters off the coast. It went through the ice and sank. The wreckage and the crew was found six days later, on March 4 at 0830LT. The aircraft was lost and all ten occupants died from hypothermia (OAT -18° C and icy water). ", "probable_cause": "It was determined that a hot air line located near the engine number two broke in flight. The hot air caused the melting of electrical components and the development of a fire in the engine number two nacelle, followed by the rupture of a fuel hose. Unfortunately, the aircraft was not equipped with life jackets, signaling equipment or warm clothing."}