{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-f90-king-air-bhilainagar-6-killed", "date": "Feb 2, 1998 at 1916 LT", "type": "Beechcraft 90 King Air", "operator": "Steel%20Authority%20of%20India", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "New Delhi - Bhilainagar", "msn": "LA-233", "yom": 1985, "flight_number": null, "city": "Bhilai Nagar", "zone": "Chhattisgarh", "country": "India", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 7790, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "SAIL King Air F90 aircraft VT-ELZ was involved in an accident near Bhilai Airfield on 02-02-98 during private flight from I.G.I. Airport, New Delhi to Bhilai Airfield. The pilot while on direct track to Bhilai at 76 DME from Raipur and FL070 insisted for further descent reporting bad weather. ATC Raipur cleared him for descend to 2,700 feet on QNH of Raipur i.e. below MORA and MSA. On descending the navigation and communication guidance became intermittent and unreliable. Due to severe weather activities the aircraft diverted 40 NMs right of the track. The pilot while steering in the Easterly direction i.e. towards the destination in the darkness on the evening hours flew into rising terrain and collided with a hill resulting into fatal injuries to all the occupants\r\nand post accident fire. Aircraft was completely destroyed. Crash occurred 10 minutes to ETA.", "probable_cause": "The aircraft in flight collided with rising terrain when the pilot flew below the height of the hill top during circumnavigating bad weather and attempting to reach destination by maintaining visual contact with ground. Weather, disregard to standard operating procedures and night flying were considered as contributing factors. "}