{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3c-near-melbourne-14-killed", "date": "Jul 13, 1947 at 0430 LT", "type": "Douglas DC-3", "operator": "Burke Air Transport", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Newark – Baltimore – Augusta – Miami – San Juan", "msn": "9887", "yom": 1943, "flight_number": null, "city": "Melbourne", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 33, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 0134LT, the flight departed Augusta bound for Miami. The last communication from the crew was at 0303LT, the morning of July 13, at which time they reported to the Jacksonville Airway radio that they were at 2,000 feet. One and one-half hours later, the aircraft was observed approximately 2 1/2 miles west of Melbourne, Florida, flying southeast at an altitude of from 300 to 500 feet. The engines were heard to sputter and misfire as the aircraft proceeded ahead on a straight course. Altitude was gradually lost, the landing lights were turned on, and seconds later the aircraft struck the ground and crashed 4 miles southwest of Melbourne. Both pilots and twelve passengers were killed while all other occupants were injured, some of them seriously. ", "probable_cause": "The Board determines that the probable cause of this accident was the pilots flying for long periods of time without adequate rest resulting in their inability to remain fully awake and alert.\r\nThe following factors were considered as contributory:\r\n- Proper records for the maintenance and the operation of the aircraft were not maintained from the date of certification,\r\n- The carburetor on the left engine, and 10 spark plugs from both engines were found defective,\r\n- The aircraft departed from Newark for subject flight with an overload of 2,047 pounds, \r\n- The pilot and the co-pilot had less than 8 hours rest on the ground in a period of 37 hours and 45 minutes, 23 of which were spent in the air,\r\n- No contact was made by the flight with any airway radio station to report an emergency, \r\n- No attempt was made by the crew to land at the Melbourne-Eau Gallie airport, which was equipped for night landing, and located 3 miles east of the aircraft's flight path, and 6 miles north of the crash,\r\n- The safety belts for the flight crew were not fastened nor did the flight crew warn the passengers to fasten theirs prior to the crash."}