{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-14p-konstantinovski-27-killed", "date": "Sep 7, 1958 at 0318 LT", "type": "Ilyushin II-14", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Frunze – Aktyubinsk – Uralsk – Moscow", "msn": "7 34 23 04", "yom": 18, "flight_number": "SU164", "city": "Aktyubinsk", "zone": "Aktobe", "country": "Kazakhstan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 22, "pax_fatalities": 22, "other_fatalities": 0, "total_fatalities": 27, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2564, "circumstances": "Enroute from Aktyubinsk to Uralsk, while cruising at an altitude of 1,500 meters in marginal weather conditions, the aircraft was hit by lightning. The crew lost control of the aircraft which dove into the ground and crashed in a field located 4 km southeast of Konstantinovski, in the region of Aktyubinsk. The wreckage was found few hours later and all 27 occupants have been killed. ", "probable_cause": "The aircraft was struck by a lightning in-flight. Discharge went through the port control cables of the left aileron located on the left wing, behind the rear spar of the center wing between the 4th and 5th section. As a result, the crew was paralyzed or in a state of shock and the control of the airplane was lost instantly. The following factors were reported: \r\n- Presence of thunderstorm activity,\r\n- Overheating and rupture of the control cables on the left aileron due to the exposure to high temperatures,\r\n- The crew was unable to send any distress call, \r\n- The dive was quick, uncontrollable and at an excessive speed, \r\n- The crew was unable to attempt an emergency landing in night conditions, \r\n- Employees at the meteorological station in Aktyubinsk did not indicate any thunderstorm in the weather forecast,\r\n- The observer at the weather station of Novoalekseevka noted the presence of a thunderstorm but failed to report it to the Aktyubinsk weather station, violating the published procedures. "}