{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3t-turbo-otter-near-kodiak-1-killed", "date": "Sep 23, 2011 at 1930 LT", "type": "De Havilland DHC-3 Otter", "operator": "Servant%20Air", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Old Harbor - Kodiak", "msn": "361", "yom": 1960, "flight_number": null, "city": "Kodiak", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3000, "captain_hours_type": 280, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14634, "circumstances": "According to a passenger who was seated in the front, right seat, as the flight progressed toward the destination, the pilot decided to make an unscheduled landing at a lake that was surrounded by rising terrain. The passenger said that after making an easterly approach to the lake, before touching down, the pilot initiated a go-around. The passenger said they flew low over the surface of the lake toward a “V” shaped notch formed by a creek with hills on either side at the east end of the lake. He said that while flying through the notch, he thought the left wing of the airplane had hit the hillside. He said the pilot reacted by pulling back hard on the control yoke and rolling the airplane to the right. The airplane entered a steep climb, it began to shake, and stall warning horn sounded. The airplane then rolled left into a steep descent and impacted the ground in a nose-down attitude. The airplane’s left wing had impacted a tree on the creek bank prior to the crash. A postaccident examination of the airframe and engine revealed no evidence of mechanical malfunctions or failures that would have precluded normal operation. Toxicological tests detected the pilot’s recent use of over-the-counter medications used for relief of cold and flu symptoms. Two of these medications are sedating. The use of these sedating medications on the day of the accident or the underlying illness may have affected the pilot’s performance. Given the lack of mechanical deficiencies with the airplane, and the passenger's account of the accident, it is likely the pilot failed to maintain adequate clearance with a tree while performing a low altitude maneuver following a go-around.", "probable_cause": "The pilot’s failure to maintain clearance from a tree during a low altitude maneuver and his failure to maintain control of the airplane. Contributing to the accident was the pilot’s use of over-the-counter sedating medications."}