{"url": "https://www.baaa-acro.com/crash/crash-gaf-nomad-n22b-leongatha", "date": "Apr 5, 1990 at 0645 LT", "type": "GAF Nomad N.22", "operator": "Sydney Skydivers Parachuting School", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Leongatha - Leongatha", "msn": "25", "yom": 1976, "flight_number": null, "city": "Leongatha", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On completion of temporary repairs following a forced landing accident in a paddock, a permit to fly was issued authorising a ferry flight from the accident site to a nearby strip. During the take off roll the pilot was unable to maintain directional control and the aircraft crossed a drain before striking a fence and overturning. An inspection of the aircraft did not reveal any defect which could have contributed to the loss of directional control. Following the landing accident the property owner had rotary-hoed the paddock to a depth of 10 centimetres. Using a motor vehicle, the pilot compacted a 2.5 metre wide strip along the centreline of the paddock, which sloped approximately 3 degrees down to the north. At the time of the takeoff to the north the wind was from the north-east at 5 knots. The pilot selected a takeoff power setting of 53 percent of the maximum power available which effectively increased the take off ground roll required by approximately 170 metres. ", "probable_cause": "The investigation revealed that after a 50 metre ground roll the left main wheel entered the rotary-hoed area. The aircraft then veered further to the left before striking the fence and overturning. \r\nThe following factors were considered relevant to the development of the accident:\r\n- The strip width was inadequate for the safe operation of the aircraft.\r\n- The pilot did not maintain directional control during the take-off.\r\n- The pilot delayed abandoning the take-off. "}