{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-big-trout-lake", "date": "Feb 21, 1995 at 1248 LT", "type": "Beechcraft 100 King Air", "operator": "Bearskin%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sioux Lookout - Big Trout Lake", "msn": "B-189", "yom": 1974, "flight_number": "BLS324", "city": "Big Trout Lake", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5000, "captain_hours_type": 1500, "copilot_hours": 2300, "copilot_hours_type": 800, "aircraft_hours": 13739, "circumstances": "The crew of the Beechcraft A100, C-GYQT, were conducting a scheduled flight from Sioux Lookout, Ontario, to Big Trout Lake, Ontario, as Bearskin (BLS) 324. BLS324 departed Sioux Lookout with nine passengers and a crew of two at 1133 central standard time (CST) and arrived in the vicinity of Big Trout Lake at approximately 1240. The captain briefed an instrument approach with a circling procedure to runway 14. On descent to the radio beacon, the crew reportedly encountered flight visibilities of one mile and were in visual contact with the ground. When the aircraft was less than five miles from the airport, the crew heard a position report from another aircraft completing an approach to the airport. To ensure safe separation from the aircraft ahead, the captain elected to fly under visual flight rules to the southwest of the airport. Air Traffic Services radar data was obtained from the Big Trout Lake radar source. The radar data indicated that the crew descended to about 150 feet above ground level (agl) approximately 4.5 miles from the end of the landing runway and maintained 200 to 300 feet agl for some 50 seconds prior to impact. Immediately prior to impact, the radar data indicated that the aircraft was about 3 1/2 miles from the runway at about 300 feet agl and descending at more than 1,200 feet per minute. Throughout the approach, the first officer flew the aircraft visually with occasional reference to his instruments, while the captain navigated and maintained terrain clearance by visual reference to the terrain and issued instructions to the first officer. At approximately five miles from the runway, the crew turned onto the extended centre line of the runway and received a radio report from the other aircraft of local visibilities of less than 1/2 mile. The aircraft flew inbound over a wide expanse of lake, and the captain lowered the flaps in preparation for landing. Shortly thereafter, the captain became concerned with the reducing visibility and looked in the Company Approach Procedures binder that he held on his lap. The captain was aware of the danger of whiteout and intended to revert to instrument flight if whiteout were encountered. He had not previously removed the approach chart for Big Trout Lake and clipped it in the approach chart holder because he had discovered that the binder rings were broken and taped shut when he had performed his initial approach briefing. He intended to provide new approach information to the first officer so that a full instrument approach could be initiated from their current position. When the captain looked up from the binder, he observed the altimeter indicating a descent through 1,000 feet above sea level (asl) and called to the first officer, \"Watch your altitude.\" Before a recovery could be initiated, the aircraft struck the frozen surface of the lake and bounced into the air. The captain initiated a recovery and then, concerned with the airworthiness of the aircraft, reduced power and attempted to land straight ahead. The aircraft crashed onto the frozen surface of the lake about 3/4 mile beyond the initial impact location. All passengers and crew survived the accident. However, the crew and several passengers sustained serious injuries. Rescuers from the local community reached the aircraft about two hours after the crash and all survivors were rescued within four hours. The more seriously injured were experiencing the effects of hypothermia when rescued. The accident occurred at 1248 CST, approximately three miles northwest of Big Trout Lake Airport, at latitude 53°49'N, longitude 089°53'W, at an elevation of 690 feet asl.", "probable_cause": "While the crew were manoeuvring the aircraft to land and attempting to maintain visual flying conditions in reduced visibility, their workload was such that they missed, or unknowingly  discounted, critical information provided by the altimeters and vertical speed indicators. Contributing factors were the whiteout conditions and the crew's decision to fly a visual approach at low altitude over an area where visual cues were minimal and visibility was reduced."}