{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-fort-pierce-1-killed", "date": "Jun 25, 2006 at 1224 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Flying Cloud", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Pierce - Murfreesboro", "msn": "761", "yom": 1980, "flight_number": null, "city": "Fort Pierce", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 11000, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4073, "circumstances": "Witnesses stated that they observed the twin-engine airplane roll into a steep right bank and enter a spin at a low altitude (less than 700 feet) during the initial climb. The airplane then descended and impacted terrain about 1.5 miles from the end of the departure runway. Some witnesses reported hearing an unusual engine noise just before the airplane began to roll and spin. Day visual meteorological conditions prevailed. Examination of the right engine revealed that the ring gear support of the engine/propeller gearbox had fractured in flight due to high cycle fatigue originating from the corner radii of the high-speed pinion cutout. The reason for the fatigue could not be determined. The ring gear support disengaged from the ring gear due to this failure, resulting in a disconnection in power being transferred from the engine power section to the propeller. In addition to the ability for a pilot to manually feather the propellers, and an automatic feathering feature, the engine (Honeywell TPE-331) design also includes a “Negative Torque Sensing” (NTS) system that would automatically respond to a typical failed engine condition involving a propeller that is driving the coupled engine. Feathering the propeller reduces drag and asymmetric yawing due to the failed engine. All Federal Aviation Administration (FAA) certification evaluations for one-engine inoperative handling qualities for the airplane type were conducted with the NTS system operational. According to the airplane manufacturer, the NTS system was designed to automatically reduce the drag on the affected engine to provide a margin of safety until the pilot is able to shut down the engine with the condition lever. However, if a drive train disconnect occurs at the ring gear support, the NTS system is inoperable, and the propeller can come out of feather on its own, if the disconnect is followed by a pilot action to retard the power lever on the affected engine. In this scenario, once the fuel flow setting is reduced below the point required to run the power section at 100% (takeoff) rpm, the propeller governor would sense an “underspeed” condition and would attempt to increase engine rpm by unloading the propeller, subsequently driving the propeller out of feather toward the low pitch stop. This flat pitch condition would cause an increase in aerodynamic drag on one side of the airplane, and unanticipated airplane control difficulty could result due to the asymmetry. ", "probable_cause": "The pilot’s loss of aircraft control during the initial climb which was precipitated by the sudden loss of thrust and increase in drag from the right engine, and the pilot’s failure to adhere to the published emergency procedures regarding the position of the failed engine power lever. Contributing to the accident was the fatigue failure of the right engine’s ring gear support for undetermined reasons, which rendered the propeller’s automatic drag reducing system inoperative."}