{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-204-100v-moscow-5-killed", "date": "Dec 29, 2012 at 1633 LT", "type": "Tupolev TU-204", "operator": "Red%20Wings", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pardubice - Moscow", "msn": "1450744864047", "yom": 2008, "flight_number": "RWZ9268", "city": "Moscow-Vnukovo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 14975, "captain_hours_type": 3080, "copilot_hours": 10222, "copilot_hours_type": 579, "aircraft_hours": 8676, "circumstances": "Approach was carried out on the runway 19 at Vnukovo Airport with length of 3060m. Pilot was performed by pilot in command (PIC). Before entering the glide path the aircraft was in landing configuration: with flaps deployed at 37°, slats - at 23 °, and the landing gear down. Decision height was calculated to be 60 m. Landing weight of the aircraft was approximately 67.5 tons, alignment ~26.5%, which did not exceed the limits specified by the flight operation manual (FOM). During flight preparation PIC determined the landing glide path speed as 210 km/h, and specified that the speed at least 230 km/h has to be maintained. Glideslope descent was made in director mode with automatic throttle disabled with an average instrument speed about 255 km/h vertical speed -3…-5 m/s. Descent was performed without significant deviations from the glide path. Flyby of the of the neighboring (to the runway) homing radio beacon was performed at the altitude 65…70 m. Runway threshold was passed at the altitude about 15 m and airspeed of 260 km/h. 5 seconds after the throttle control lever had been switched to the idle mode the aircraft landed at the speed about 230 km/h, distance from the runway threshold of 900-1000 m and left bank of 1... 1.5°, provided that the signal of the signal of left gear strut compression was produced. During aircraft landing the right side wind gust reached up to ~11.5 m/s. The maximum value of the vertical acceleration during touch down was recorded as 1.12g according to flight recorders (hereinafter - magnetic tape recorder). About 10 seconds had passed from the moment of passing 4 m height above ground and touchdown. 3 seconds after landing nose gear strut was compressed. At this stage the right gear strut compression signal had not yet been formed. Almost simultaneously with nose landing gear touchdown the crew moved thrust reverser lever in one motion to the \"maximum reverse\" position and applied mechanical brakes. Actuation of the reverse valves didn't occur. Air brakes and spoilers were not also activated automatically and the crew didn't make attempt to activate them manually. After thrust levers were moved to the \"maximum reverse\" position an increase of forward thrust (up to ~90% Nvd) was recorded with both engines. The pressure in the hydraulic system of wheel brakes of the left (compressed) landing gear was up to 50 kgf/сm², whereas there were no pressure in the wheel brakes of the right (not compressed) landing gear. The minimum airspeed to to which the aircraft slowed 7-8 seconds after landing was 200-205 km/h at ~0° pitch and roll of 1° to the left, after that the speed began to increase. 2 seconds after thrust levers were moved to the \"maximum reverse\" position the flight engineer reported that reversers had not been deployed. Thrust lever had been maintained in the \"maximum reverse\" position for about 8 seconds and was switched off after that. During this time the airspeed increased to 240 km/h. The increase in airspeed led to further unloading of the main landing gear. With fluctuations in roll (from 4.5° to the left to 2.6° to the right) compression was produced alternately on the left and right landing gear struts. Almost simultaneously sith the reversers being switched off the brake pedal was pushed by left-hand-seat pilot to 60°. As before the breaking was inefficient - hydraulic pressure in the wheel brake in only applied after sufficient compression of the gear strut. 5 seconds after reversers were deactivated, after words of the flight engineer \"Turn on reverse! Reverse!\" the control was moved to the \"maximum reverse\" position again. As in the first attempt the deployment of reversers didn't occur, both engines started to produce direct thrust (at Nvd ~ 84%). Aircraft braking didn't occur, airspeed was 230…240 km/h. In 4 seconds the reverse was switched off. At the moment of reverser reactivation the aircraft was at the distance of about 900...1000 m from the exit threshold. 6 seconds after reversers switch off the crew attempted to supply automatic braking as evidenced by the crew conversation and transient appearance of commands: \"Automatic braking  on\" for the primary and backup subsystems. When the aircraft passed the exit threshold thrust levers were in the \"small-reverse\" position. The aircraft overrun occurred 32 seconds after landing, being almost on the axis of the runway, with an airspeed of about 215 km/h. In the process of overrun flight engineer by PIC command turned off the engines by means of emergency brakes. The aircraft continued to roll outside the runway slowly due to road bumps and snow cover. The compression on both landing gear struts occurred which led to activation of air brakes and spoilers. The aircraft collided with the slope of a ravine at the ground speed of about 190 km/h. Four stewardess were seriously injured while four other crew members were killed. The following day, one of the survivor died from her injuries. ", "probable_cause": "The accident with Тu-204-100В RA-64047 aircraft was caused by actuator maladjustment and reverse locking of both engines and incorrect crew actions (not complying with FOM provisions) performing landing run during spoilers and thrust reverse control that resulted in lack of efficient aircraft breaking action, RWY overrun, collision with obstacles at a high speed (~190 km/h), aircraft destruction and fatalities. (In accordance with the ICAO Accident and Incident Investigation Manual (DOC 9756 AN/965), causes and factors are in logical order, without the priority assessment).\r\nContributing factors to the fatal accident were:\r\n- Actual structure stiffness of reverse control and locking mechanism unaccounted in operational documentation determining the engine control system inspection and adjustment procedure during its service replacement. This factor can emerge only in case of the crew thrust reverse control with violation of FOM provisions;\r\n- Incoordination and conflicts in aircraft and engine operational and technical documentation and long-term formalism towards inspections of the engine control system adjustment (including reverse control and locking mechanism) by organisations performing engines replacement that didn't allow to ensure feedback with aircraft and engine designers and timely eliminate identified deficiencies;\r\n- Unstabilized approach and significant (up to 45 km/h) rated overspeed during glide slope phase by the crew that resulted in long holding before landing, significant landing distance extension and aircraft overshoot landing (~950 m);\r\n- Non-extension of spoilers and speed breaks in automatic mode due to the lack of the signal of simultaneous left and right struts compression caused by aircraft anticipatory \"soft\" landing (plunge acceleration 1.12g) at left main gear at right cross wind saturation (~11.5 м/с);\r\n- Lack of crew monitoring for automatic extension of spoilers and speed brakes after landing and manual non-extension of spoilers;\r\n- Violation of thrust reverse landing procedure be crew specified by FOM resulted in application of maximum thrust reverse by \"one motion\" without throttle intermediate stop setting (low reverse) and without reverse buckets position (stowage) monitoring that under deficiencies of the reverse control and locking mechanism resulted in immediate thrust increase;\r\n- Lack of simultaneous main landing gear compression during the RWY motion due to design features of limit switches (no failures of limit switches were identified) of main landing gears compressed position (~5.5 tonnes leg load is required for switch actuation) and non compliance with the FOM on spoilers extension in manual mode that resulted in reverser buckets non-stowage into reversal thrust mode;\r\n- Inadequate cockpit resource management by the PIC during flight that resulted in lack of monitoring for stabilized approach at the approach phase and in \"fixation\" at reverser deployment operation at the lack of monitoring for other systems operation;\r\n- Untimely preventive measures during the investigation of the serious incident with Tu-204-100V RA-64049 aircraft operated by \"Red Wings\" Airlines occurred in Tolmachevo airport on December 20, 2012; \r\n- Inadequate level of flight operation management and nonoperation of flight safety control system in the airline and formal attitude of the pilot-instructor towards proficiency check of the PIC and the lack of the appropriate supervision over proficiency checks and flight operations using flight recorders that didn't allow to timely identify and eliminate regular deficiencies in PIC's piloting technique regarding increased speed holding during glide-slope flight and the procedure of using reverse thrust application at landing run operation as well. Supervision over proficiency checks specified by FAR-128 (clause 5.7) wasn't held;\r\n- Lack of actions training in situations connected with failure of main landing gears limit switches in line proficiency check programs of crew members followed by non-extension of spoilers and speed breaks in manual mode. Technical abilities of the available simulators don't allow to train this situation."}