{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-natal", "date": "May 5, 2006 at 0710 LT", "type": "Rockwell Shrike Commander 500", "operator": "Terral%20T%C3%A1xi%20A%C3%A9reo", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Recife - Natal", "msn": "500-3129", "yom": 1972, "flight_number": null, "city": "Natal", "zone": "Rio Grande do Norte", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3000, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Recife-Guararapes Airport at 0609LT on a flight to Natal, carrying one passenger, one pilot and a load consisting of bags containing bank documents. On approach to Natal-Augusto Severo Airport runway 16L, the left engine failed. Shortly later, at a height of about 600 feet, the right engine failed as well. Aware that he will not be able to reach the airport, the pilot attempted an emergency landing in an open field. On touchdown, the undercarriage collapsed and the aircraft slid for about 200 metres before coming to rest in a muddy field. Both occupants escaped with minor injuries and the aircraft was damaged beyond repair. ", "probable_cause": "Double engine failure on approach caused by a fuel exhaustion. The following findings were identified:\r\n- Poor flight preparation on part of the pilot, \r\n- Miscalculation of fuel consumption for the flying distance (about an hour), \r\n- The day prior to the accident, tanks were filled with a quantity of 130 liters of fuel, barely 13 liters more than the quantity theoretically necessary for the flight in the conditions existing at the time of the accident,\r\n- No technical anomalies were found on the airplane and its equipment,\r\n- Poor organizational culture within the operator regarding fuel policy,\r\n- Qualitative deficiency in the instruction given to the pilot who had not acquired the basic knowledge for fuel management,\r\n- Failure to observe the actual quantity of fuel in the tanks prior to departure,\r\n- Shortcomings in the operator's organizational processes,\r\n- Inadequate supervision of flight planning activities by the operator who failed to identify any flaws in the fuel management procedures by the pilots."}