{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-hayward", "date": "Sep 16, 2009 at 1215 LT", "type": "Beechcraft 200 Super King Air", "operator": "Henry Broadcasting Nevada", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hayward - San Carlos", "msn": "BB-1750", "yom": 2001, "flight_number": null, "city": "Hayward", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2913, "captain_hours_type": 1707, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1229, "circumstances": "The airplane just had undergone a routine maintenance and this was planned to be the first flight after the inspection. During the initial climb, the pilot observed that the airplane was drifting to the left. The pilot attempted to counteract the drift by application of right aileron and right rudder, but the airplane continued to the left. The pilot reported that, despite having both hands on the control yoke, he could not maintain directional control and the airplane collided into a building. The airplane subsequently came to rest on railroad tracks adjacent to the airport perimeter. A post accident examination revealed that the elevator trim wheel was located in the 9-degree NOSE UP position; normal takeoff range setting is between 2 and 3 degrees NOSE UP. The rudder trim control knob was found in the full left position and the right propeller lever was found about one-half inch forward of the FEATHER position; these control inputs both resulted in the airplane yawing to the left. The pilot did not adequately follow the airplane manufacturer's checklist during the preflight, taxi, and before takeoff, which resulted in the airplane not being configured correctly for takeoff. This incorrect configuration led to the loss of directional control immediately after rotation. A post accident examination of the airframe, engines, and propellers revealed no anomalies that would have precluded normal operation.", "probable_cause": "The pilot's failure to maintain directional control after takeoff. Contributing to the accident was the pilot's inadequate preflight and failure to follow the airplane manufacturer's checklist to ensure that the rudder trim control and right propeller control lever were positioned correctly."}