{"url": "https://www.baaa-acro.com/crash/crash-partenavia-p68b-north-shore", "date": "Jul 20, 2001 at 0459 LT", "type": "Partenavia P.68", "operator": "Great%20Barrier%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Auckland-Whangarei", "msn": "68", "yom": 1976, "flight_number": null, "city": "North Shore", "zone": "Auckland Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 706, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4773, "circumstances": "On Friday 20 July 2001, at around 0450, Partenavia P68B ZK-DMA was abeam North Shore Aerodrome at 5000 feet in darkness and enroute to Whangarei, when it suffered a double engine power loss. The pilot made an emergency landing on runway 21 at North Shore Aerodrome, but the aircraft overran the end of the runway, went through a fence, crossed a road and stopped in another fence. The pilot was the only person on board the aircraft and received face and ankle injuries. The aircraft encountered meteorological conditions conducive to engine intake icing, and ice, hail or sleet probably blocked the engine air intakes. The pilot had probably developed a mindset that dismissed icing as a cause, and consequently omitted to use alternate engine intake air, which should have restored engine power. ", "probable_cause": "The following findings were identified:\r\n- The pilot was suitably qualified and authorised to conduct the flight.\r\n- The aircraft was airworthy and its records indicated it had been maintained correctly.\r\n- The aircraft encountered weather conditions conducive to the formation of engine intake icing.\r\n- The engine air intakes probably became blocked by sleet, ice or hail, which caused both engines to lose power.\r\n- The pilot probably developed a mindset that dismissed engine intake icing as a cause of the double engine power loss and omitted to apply the necessary corrective action.\r\n- Had the pilot selected each engine’s alternate engine intake air on, engine power should have been restored.\r\n- The Partenavia P68B flight manual warning concerning the use of alternate engine intake air should be amended to require the in-flight use of alternate air at ambient temperatures above freezing, in a high-humidity environment. "}