{"url": "https://www.baaa-acro.com/crash/crash-boeing-307-stratoliner-near-alder-10-killed", "date": "Mar 18, 1939 at 1317 LT", "type": "Boeing 307 Stratoliner", "operator": "Boeing", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Seattle - Seattle", "msn": "1994", "yom": 1939, "flight_number": null, "city": "Alder", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine aircraft (first prototype) departed Seattle-Boeing Field at 1257LT with engineers and representatives from TWA and KLM on board. At 1312LT, a radio message was transmitted from NX19901 to the Boeing Aircraft Company radio Station located at Seattle, which message gave the position of the aircraft as being between Tacoma and Mount Rainier at an altitude of 11,000 feet. Some two or three minutes later, while flying at a comparatively slow rate of speed in the vicinity of Alder, the aircraft stalled and began to spin in a nose down attitude. After completing two or three returns in the spin, during which power was applied, it recovered from the spin and began to dive. The aircraft partially recovered from the dive at an altitude of approximately 3,000 feet above sea level, during which recovery it began to disintegrate. Outboard sections of the left and right wings failed upward and broke entirely loose from the aircraft. Major portions of the vertical fin and portions of the rudder were carried away by the wing wreckage. The outboard section of the left elevator separated from the stabilizer and both fell to the ground detached. The right horizontal tail surface, being held on by the fairing along the top surface and also by the elevator trim tab cables, remained with the fuselage. The number one engine nacelle also broke loose from the aircraft and fell to the ground separately. The main body of the aircraft settled vertically and struck the ground in an almost level attitude both longitudinally and laterally at a point approximately 1,200 feet above sea level. Watches and clocks aboard the aircraft, which were broken by force of the impact, indicated the time of the accident as approximately 1317LT. The aircraft was destroyed by impact forces and all ten occupants were killed. \r\nCrew:\r\nJulius A. Barr, first pilot,\r\nEarl A. Ferguson, copilot,\r\nBenjamin J. Pearson, alternate copilot,\r\nHarlan Hull, alternate copilot,\r\nRalph L. Cram, first aerodynamist,\r\nJohn Kylstra, assistant to aerodynamist, \r\nAlbert G. von Baumhauer, assistant to aerodynamist and KLM reprensentative,\r\nPieter Guillonard, recorder and photographer,\r\nWilliam C. Doyle, operator of the oscillograph,\r\nHarry T. West, engineering officer.", "probable_cause": "Structural failure of the wings and horizontal tail surfaces due to the imposition of loads thereon in excess of those for which they were designed, the failure occurring in an abrupt pull-out from a dive following recovery from an inadvertent spin."}