{"url": "https://www.baaa-acro.com/crash/crash-airspeed-as65-consul-mediterranean-sea-2-killed", "date": "Feb 27, 1948 at 1600 LT", "type": "Airspeed AS.65 Consul", "operator": "Pullman Airways", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Nairobi – El Adem – Benina – Castel Benito – London", "msn": "5121", "yom": 1947, "flight_number": null, "city": "Mediterranean Sea", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 964, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At Benina Airport, the pilot was in a hurry and took off in a rush at 1535LT, with the passenger but without his radio navigator. While flying along the Libyan coast, he encountered poor weather conditions and the twin engine aircraft crashed into the sea around 1600LT. SAR operations were conducted but eventually suspended few days later as no trace of the aircraft nor both occupants was found. On March 6, 1948, some debris and the dead body of the passenger were found on a beach in Zarzis, Tunisia. ", "probable_cause": "Investigations revealed that the pilot, also owner of this company, showed an irresponsible attitude on several occasions during the mission from Nairobi to London. During the fuel stop in Benina, the refueling operation was completed without filter as no fuel supplier representatives was available at that time. So the pilot decided to refuel without any filter. In addition, oil tanks were to be completed but the pilot refused due to lack of time. The aircraft's radio systems were partially impaired at the time of departure and the radio navigator preferred to stay in Benina because he was tired and felt it would be difficult to locate Castel Benito because of the night and the deterioration of the weather conditions. Besides this, investigators stated that the forecasts of wind were erroneous, which was considered as a contributing factor. "}