{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-seven-islands", "date": "Jan 28, 1997 at 1700 LT", "type": "Beechcraft 200 Super King Air", "operator": "Propair2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Seven Islands - Montreal", "msn": "BB-153", "yom": 1976, "flight_number": null, "city": "Seven Islands", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": 1300, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Propair Inc. Super King Air 200 (serial number BB-153), with two pilots and ten passengers on board, was preparing to make a charter flight under instrument flight rules from Sept-Îles to Dorval, Quebec. At 1700 eastern standard time (EST), the co-pilot, in the left seat, began the take-off roll on runway 09. At an indicated airspeed of about 90 knots, 5 knots below rotation speed (VR), the aircraft began to drift to the left, toward the runway edge. The copilot attempted unsuccessfully to correct the take-off track using the rudder. At around 100 knots, just before the aircraft exited the runway, the co-pilot pulled the elevator control all the way back and initiated a climb. At about the same moment, the pilot-in-command throttled back, believing that a collision with the snowbank at the runway edge was inevitable. The aircraft descended until it struck the snow-covered surface to the north of the runway and slid on its belly before coming to rest on a heading opposite to the take-off heading. The pilot-in-command was slightly injured. The aircraft sustained considerable damage. The occupants used the main door to evacuate the aircraft.", "probable_cause": "The aircraft crashed as a result of the lack of cockpit co-ordination when the pilot-in-command took control of the aircraft as the aircraft was airborne. The following factors contributed to the occurrence: marginal environmental conditions; contaminated runway surface; poor cockpit management; ineffective briefing; and, inadequate training for rejected take-offs."}