{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-sitka-5-killed", "date": "Jul 3, 2003 at 1600 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Bowl Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Prince Rupert – Anchorage", "msn": "421C-0048", "yom": 1976, "flight_number": null, "city": "Sitka", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 9200, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7981, "circumstances": "The pilot of the twin-engine accident airplane was on an IFR flight plan in instrument meteorological conditions when the right side nose baggage door opened. The pilot expressed concerns to air traffic control about baggage exiting the compartment and striking the right propeller. He requested a diversion to the nearest airport with an instrument approach. The flight was diverted as requested, and was cleared for a non precision instrument approach to a coastal airport adjacent to mountainous terrain. The flight was authorized to a lower altitude when established on the approach. A review of the radar track information disclosed that the pilot did not fly the published approach, but abbreviated the approach and turned the wrong direction, toward higher terrain, north of the approach course. The airplane was discovered in mountainous terrain, about 1,100 msl, and 1.5 miles north of the approach course. The crash path was initially at a shallow angle in the treetops, until the airplane struck larger trees. Post accident inspection of the airplane disclosed no evidence of any preimpact mechanical problems, other than the baggage door, which was still attached to the airplane.", "probable_cause": "The pilot's failure to follow IFR procedures by not following the published approach procedures, which resulted in an in-flight collision with terrain. Factors contributing to the accident were a low ceiling, and the pressure induced by conditions/events (the open baggage door)."}