{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-stonehaven", "date": "Apr 9, 2014 at 1447 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Aeroflight%20Executive%20Services", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Wick – Le Touquet", "msn": "31-7405188", "yom": 1974, "flight_number": null, "city": "Stonehaven", "zone": "Aberdeenshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3188, "captain_hours_type": 19, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a ferry flight from Seattle in the USA to Thailand via Canada, Greenland, Iceland, Scotland and across Europe. However the flight crew abandoned the aircraft in Greenland late in December 2013 after experiencing low oil pressure indications on both engines. This may have been due to the use of an incorrect grade of oil for cold weather operations. The aircraft remained in Greenland until 28 February 2014, when a replacement ferry pilot was engaged. Although the engine oil was not changed prior to departing Greenland, the flight continued uneventfully to Wick, in Scotland. Following some maintenance activity on the right engine, the aircraft departed for Le Touquet in France. However, approximately 25 minutes after takeoff, the engines successively lost power and the pilot carried out a forced landing in a ploughed field. Examination of the engines revealed that one piston in each engine had suffered severe heat damage, consistent with combustion gases being forced past the piston and into the crankcase. ", "probable_cause": "The aircraft began experiencing engine problems, leading to the forced landing, approximately 25 minutes after departing Wick, in Scotland. However, it is possible that these problems may have originated prior to the aircraft arriving in the UK. The low oil pressures in both engines, reported by the crew on the flight leg to Greenland, may have been due to the wrong grade of oil, W100, being used in what would have been very low temperatures experienced in December in Canada and Greenland. Despite supplies of multigrade oil being sent to Greenland, the engine oil was not changed. This was due to the fact that the pilot noted normal engine indications combined with the lack of maintenance facilities. Thus the aircraft continued its journey with the same oil in the engines with which it left Seattle; this was confirmed by the subsequent analysis of the oil. No further oil pressure problems were observed, although it is likely the aircraft would have been operating in warmer temperatures at the end of February in comparison with those in December. The engine manufacturer suggested that engine damage could have occurred as a result of operating the engines at low temperatures with the wrong grade of oil. Whilst this may have been the case, it is surprising that any damage did not progress to the point where it became readily apparent during the subsequent flights, via Iceland, to Wick. In fact the pilot did report rough running of the right-hand engine, but the investigation revealed a problem only with the No 4 cylinder compression, which led to replacement of this cylinder. Since the compressions in all the cylinders were presumably assessed during the diagnosis, it must be concluded that any damage in the No 3 cylinder of the right engine was not, at that stage, significant. Ultimately, it was not possible to establish why pistons in both engines had suffered virtually identical types of damage, although it is likely to have been a ‘common mode’ failure, which could include wrong fuel, incorrect mixture settings (running too lean) and existing damage arising from the use of incorrect oil in cold temperatures. The oil analysis excluded the possibility of the aircraft having been mis-fuelled with Jet A-1 at Wick. No conclusion can be drawn regarding the possibility of one of the pilots having leaned the mixtures to an excessive degree, although this would require that either high cylinder head temperature indications were ignored, or that the temperature gauges (or sensors) on both engines were defective. The engines would have begun to fail when the combustion gases started to ‘blow by’ the pistons, causing progressive damage to the piston crowns, skirts and rings. This would have also caused pressurisation of the crankcases, which in turn would have tended to blow oil out of the crankcase breathers. In the case of the left engine, the pressurisation was such that the dipstick was blown out of its tube, resulting in more oil being lost overboard. This may have accounted for the more severe damage to the left engine, having lost more oil than the right. The detached No 1 cylinder base jet oil nozzle in the left engine may have contributed to a slight reduction in the oil pressure, but is otherwise considered to have played no part in the engine failure. "}