{"url": "https://www.baaa-acro.com/crash/mishap-fokker-f27-friendship-500f-paris-roissy-cdg", "date": "Oct 25, 2013 at 0125 LT", "type": "Fokker F27 Friendship", "operator": "Miniliner", "flight_phase": "Takeoff (climb)", "flight_type": "Postal (mail)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris - Dole", "msn": "10373", "yom": 1968, "flight_number": "MNL5921", "city": "Paris-Roissy-CDG", "zone": "Val-d'Oise", "country": "France", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was performing a night mail flight from Paris-Roissy-CDG Airport to Dole-Jura (Tavaux) Airport on behalf of Europe Airpost. Shortly after takeoff, while climbing to an altitude of 1,000 feet, the left propeller detached and impacted the left part of the fuselage, causing a large hole. The crew declared an emergency and was cleared for an immediate return. The aircraft landed safely less than 10 minutes later and was parked on the apron. Both pilots were uninjured and the aircraft was damaged beyond repair. The propeller was found in an open field in Mesnil-Amelot, near the airport. Nobody on ground was injured.", "probable_cause": "The n°2 propeller blade root on the left engine failed due to fatigue, resulting in separation from the propeller hub and then interaction with the n°1 blade and its disconnection from the propeller hub. The imbalance created by the loss of these two blades led to the front part of the engine being torn off. The cause of the fatigue cracking could not be determined with certainty. The following may have contributed to the fatigue fracture of the propeller blade root:\r\n- Insufficient preloading of the propeller, increasing the stress exerted on it. The lack of maintenance documentation made it impossible to determine the preload values of the bearings during the last general overhaul;\r\n- The presence of manganese sulphide in a heavily charged area of the propeller. The presence of this sulphide may have generated a significant stress concentration factor, raising the local stress level.\r\nThe tests and research carried out as part of this investigation show that the propeller blade root is made of a steel whose microstructure and composition are not optimal for fatigue resistance. However, the uniqueness of the rupture more than 50 years after commissioning makes it unlikely that the rate of inclusions, their distribution, size, or sulphur content of the propeller is a contributing factor in the accident."}