{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-382e-16c-hercules-dobbins-afb-7-killed", "date": "Feb 3, 1993 at 1327 LT", "type": "Lockheed C-130 Hercules", "operator": "Lockheed-Martin2", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dobbins AFB - Dobbins AFB", "msn": "4412", "yom": 1971, "flight_number": null, "city": "Dobbins AFB", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 7658, "captain_hours_type": 1260, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6708, "circumstances": "The aircraft was designed and used as the company's engineering test bed. An evaluation of the fly-by-wire rudder actuator and ground minimum control speed (vmcg) was being conducted. During the final hi-speed ground test run, the aircraft abruptly veered left and became airborne. It entered a left turn, climbed to about 250 feet, departed controlled flight and impacted the ground. Investigation revealed a design feature in the rudder actuator that removes hydraulic pressure within the actuator if the rudder position commanded by the pilot exceeded the actual rudder actuator position for a specified time, and the rudder aerodynamically trails. The actuator previously disengaged in flight. The company did not conduct a system safety review of the rudder bypass feature and its consequences to all flight regimes, nor of the vmcg test. The flight test plan specified that engine power be retarded if the rudder became ineffective. Neither pilot had received training as an experimental test pilot. The company allowed experimental flight tests at a confined, metropolitan airport. All seven occupants were killed. ", "probable_cause": "Disengagement of the rudder fly-by-wire flight control system resulting in a total loss of rudder control capability while conducting ground minimum control speed tests. The disengagement was a result of the inadequate design of the rudder's integrated actuator package by its manufacturer; the operator's insufficient system safety review failed to consider the consequences of the inadequate design to all operating regimes. A factor which contributed to the accident was the flight crew's lack of engineering flight test training."}