{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-36-marquise-pittsfield-1-killed", "date": "Mar 25, 2004 at 0533 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Royal%20Air%20Freight", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Pontiac – Rockford – Hagerstown – Bangor", "msn": "680", "yom": 1975, "flight_number": null, "city": "Pittsfield", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": null, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6500, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13420, "circumstances": "Approximately 3 minutes prior to the accident, the airplane was flying in a northeast direction, at 17,100 feet, and was instructed by air traffic controllers to contact Boston Center. He acknowledged the instruction, and no further transmissions were received from the pilot. Radar data indicated the airplane continued level at 17,100 feet on a northeasterly heading, and maintained a groundspeed of 255 knots, for approximately 2 minutes after the last transmission. The airplane then climbed 300 feet, and descended abruptly, losing 10,700 feet during the next 46 seconds, while maintaining an approximate ground speed of 255 knots. The airplane then initiated a climb from 6,700 feet to 7,600 feet, maintained an altitude of 7,600 feet for 4 seconds, and then entered a continuous descent until the last radar contact 17 seconds later, at an altitude of 2,400 feet. Several witnesses observed the airplane prior to it impacting the ground. All of the witness described the airplane in a \"flat spin\" with the engines running prior to impact. Examination of recorded weather data revealed several areas of light-to-moderate precipitation echoes in the vicinity of the accident site. The maximum echo tops were depicted ranging from 14,000 to 25,000 feet, with tops near 17,000 feet in the immediate vicinity of the accident site. Recorded radar images depicted the airplane traveling through an area of lower echoes for approximately 5-minutes immediately prior to the accident. AIRMET Zulu was current for icing conditions from the freezing level to 22,000 feet over the route of flight and the accident site. Four PIREPs were also issued indicating light-to-moderate rime to mixed icing in the clouds from the freezing level to 16,000 feet. Cloud tops were reported from 16,000 to 17,000 feet by two aircraft. Examination of the airplane and engines revealed no pre-impact mechanical anomalies. Additionally, examination of the cockpit overhead switch panel indicated propeller de-ice, engine intake heat, windshield anti-ice, and wing de-ice were all in the 'off' position. According to the pilot's toxicology test results, pseudoephedrine and diphenhydramine was detected in the pilot's urine. Diphenhydramine was not detected in the blood. ", "probable_cause": "The pilot's loss of aircraft control for undetermined reasons, which resulted in an inadvertent stall/spin and subsequent impact with the ground."}