{"url": "https://www.baaa-acro.com/crash/crash-raytheon-390-premier-i-atlanta-2-killed", "date": "Dec 17, 2013 at 1924 LT", "type": "Raytheon 390 Premier I", "operator": "Mallen-Industries", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Atlanta - New Orleans", "msn": "RB-80", "yom": 2003, "flight_number": null, "city": "Atlanta-Fulton County-Brown Field", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7200, "captain_hours_type": 1030, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 713, "circumstances": "The pilot and passenger departed on a night personal flight. A review of the cockpit voice recorder (CVR) transcript revealed that, immediately after departure, the passenger asked the pilot if he had turned on the heat. The pilot subsequently informed the tower air traffic controller that he needed to return to the airport. The controller then cleared the airplane to land and asked the pilot if he needed assistance. The pilot replied \"negative\" and did not declare an emergency. The pilot acknowledged to the passenger that it was hot in the cabin. The CVR recorded the enhanced ground proximity warning system (EGPWS) issue 11 warnings, including obstacle, terrain, and stall warnings; these warnings occurred while the airplane was on the downwind leg for the airport. The airplane subsequently impacted trees and terrain and was consumed by postimpact fire. Postaccident examination of the airplane revealed no malfunctions or anomalies that would have precluded normal operation. During the attempted return to the airport, possibly to resolve a cabin heat problem, the pilot was operating in a high workload environment due to, in part, his maneuvering visually at low altitude in the traffic pattern at night, acquiring inbound traffic, and being distracted by the reported high cabin temperature and multiple EGPWS alerts. The passenger was seated in the right front seat and in the immediate vicinity of the flight controls, but no evidence was found indicating that she was operating the flight controls during the flight. Although the pilot had a history of coronary artery disease, the autopsy found no evidence of a recent cardiac event, and an analysis of the CVR data revealed that the pilot was awake, speaking, and not complaining of chest pain or shortness of breath; therefore, it is unlikely that the pilot's cardiac condition contributed to the accident. Toxicological testing detected several prescription medications in the pilot's blood, lung, and liver, including one to treat his heart disease; however, it is unlikely that any of these medications resulted in impairment. Although the testing revealed that the pilot had used marijuana at some time before the accident, insufficient evidence existed to determine whether the pilot was impaired by its use at the time of the accident. Toxicology testing also detected methylone in the pilot's blood. Methylone is a stimulant similar to cocaine and Ecstasy, and its effects can include relaxation, euphoria, and excited calm, and it can cause acute changes in cognitive performance and impair information processing. Given the level of methylone (0.34 ug/ml) detected in the pilot's blood, it is likely that the pilot was impaired at the time of the accident. The pilot's drug impairment likely contributed to his failure to maintain control of the airplane.", "probable_cause": "The pilot's failure to maintain airplane control while maneuvering the airplane in the traffic pattern at night. Contributing to the accident was the pilot's impairment from the use of illicit drugs."}