{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-0-albany-28-killed", "date": "Sep 16, 1953 at 0834 LT", "type": "Convair CV-240", "operator": "American-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Boston – Hartford – Albany – Chicago", "msn": "116", "yom": 1948, "flight_number": "AA723", "city": "Albany", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 25, "pax_fatalities": 25, "other_fatalities": 0, "total_fatalities": 28, "captain_hours": 7500, "captain_hours_type": 2000, "copilot_hours": 1400, "copilot_hours_type": 215, "aircraft_hours": 9920, "circumstances": "American Airlines' Flight 723 of September 16, 1953, was a scheduled operation between Boston Massachusetts, and Chicago, Illinois, with intermediate stops among which were Hartford, Connecticut, and Albany, New York. The crew consisted of Captain J. W. Stentz, First Officer W. J. Schanken, and Stewardess J. G. Thornquist, Prior to departing Boston the crew filed a company VFR (Visual Flight Rules) flight plan to Chicago following which the company issued a flight clearance to proceed to Albany INSTOP (Instrument or On Top of Clouds Authorize d) 2 with an intermediate landing at Bradley Field, the airport serving Hartford, Connecticut, and Springfield, Massachusetts. The alternate airport was Syracuse, New York. At the time this flight clearance was issued, the weather en route to Albany was good mid the conditions at Albany were above minimums. The portion of the flight to Bradley Field was without incident and the aircraft arrived there at 0657. At Bradley Field Captain Stentz reviewed the latest weather reports in the company's operations office and was advised that Bradley Field had been added to his flight clearance as a second alternate in addition to Syracuse because the weather at Albany at this time was below the company's landing minimums 3 was forecast to improve to within limits by the time the flight arrived there. The special Albany 0642 weather report available to the captain at this time was: ceiling indefinite zero, sky obscured, visibility zero, fog. The en route weather was clear. According to the company's records, the gross takeoff weight of the aircraft at Hartford was 37,889 pounds which was within the allowable gross take-off weight of 40,503 pounds; the load was properly distributed with respect to the center of gravity limits of the aircraft. Departure from Bradley Field was made at 0714 with 25 passengers. Immediately before departing, the flight advised the tower it was proceeding to Albany VFR. At 0737, a message from the company's dispatcher at New York was relayed to Captain Stentz through the company radio at Albany as follows: \"If Albany still below limits on your arrival, if OK with you, suggest hold vicinity until at least 0830 EST. Expect Albany to have limits 0730-0800 EST. Advise fuel on board when over Albany.\" Flight 723 acknowledged and advised. \"We will hold.\" At 0740, the flight reported to Albany Approach Control that it was over Montgomery Ward, an in-range visual check point, VFR, and requested a clearance of at least 500 feet on top of clouds to the Albany Range Station. This request was approved and the flight was cleared to maintain at least 500 feet on top and to hold north of the Range Station. The 0739 Albany special weather report was given the flight: \"Ceiling indefinite, 100 feet, sky obscured, visibility 1/4 mile, fog, wind west-southwest one mile per hour.\" Flight 723 reported aver the Range Station at 0742. During the holding period the number of aircraft in this pattern varied from six to nine. The special Albany weather report issued at 0750 indicated thin obscurement, ceiling estimated 4,000, overcast, fog, visibility 3/4 miles. At 0753, the first of the aircraft in the holding pattern, American Airlines' Flight 750, was cleared for an instrument approach to Runway 19. At 0800, this aircraft missed its approach and was immediately cleared to climb toward the south and to again remain at least 500 feet on top of clouds. A second aircraft which was holding was then cleared to make a similar approach and it too was forced to execute a missed approach procedure. At 08163 an instrument approach mid a landing on Runway 19 were successfully completed by one of the holding aircraft. Immediately following this landing. Flight 723 was cleared to make an instrument approach to Runway 19. Three minutes later the flight advised the tower that its approach was being abandoned because the aircraft's flaps could not be lowered. It was then still at least 500 feet on top of clouds and was advised by the tower to remain there until further advised. At approximately 0830, the following message was transmitted from the Albany Tower: \"All aircraft holding Albany. It now appears to be pretty good for a contact approach from the west. It looks much better than to the north.\" Immediately following this message, Flight 723 was asked by the tower if it would accept a contact approach from the west for a landing on Runway 10. After requesting and receiving current weather including altimeter setting (29.74) and the length of Runway 10 (4,500 feet). the flight stated it would accept a contact approach. Clearance was then issued the flight to make a contact approach to Runway 10. Acknowledgement of this clearance was the last radio contact with the flight. At approximately 0834, Flight 723 struck the radio towers and crashed. The weather reported at the time of the accident was thin scattered clouds at 500 feet, ceiling estimated 4,500 feet, broken clouds, visibility 1-1/2 miles, fog. ", "probable_cause": "The Board determines that the probable cause of this accident was that during the execution of a contact approach, and while maneuvering for alignment with the runway to be used, descent was made to an altitude below obstructions partially obscured by fog in a local area of restricted visibility. The following findings were reported: \r\n- Upon arrival of the flight, Albany weather was below authorized landing minimums and the aircraft was required to hold,\r\n- A standard instrument approach was started and later abandoned because of mechanical failure of the wing flap mechanism,\r\n- A contact approach to Runway 10 was later accepted because improved weather, especially to the west of the airport, made this runway most feasible,\r\n- The aircraft made a wide right turn southwest of the airport to align with Runway 10,\r\n- The latter part of the approach was at low altitude through weather conditions which prevented adequate visual reference,\r\n- Under existing conditions the pilot should have abandoned the approach,\r\n- The aircraft struck radio towers, the upper portions of which were obscured by fog,\r\n- These towers were hazard-painted and lighted in accordance with accepted standards,\r\n- All CAA navigational and landing facilities were functioning properly,\r\n- No evidence was found in the residual wreckage not destroyed by impact or fire to indicate that structural or mechanical failure occurred prior to impact other than to the wing flap mechanism."}