{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-54f-mwanza", "date": "Nov 18, 1997 at 2109 LT", "type": "Douglas DC-8", "operator": "Cougar Air Cargo International", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Entebbe - Mwanza", "msn": "45885", "yom": 1968, "flight_number": null, "city": "Mwanza", "zone": "Mwanza Region", "country": "Tanzania", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10000, "captain_hours_type": 30, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was f1ying from Entebbe (Uganda) to Mwanza (Tanzania) for the purpose of uplifting some cargo of fish fillet which was bound for Ostend, Belgium. It was carrying a crew of four including two pilot s and two engineers. The Commander said that the flight from Entebbe to Mwanza was normal except for the n°1 generator warning light which came on 10 minutes after takeoff from Entebbe. The relevant generator was subsequently switched off and the flight was continued. The aircraft flew IFR, cruising at FL250. Shortly before landing at Mwanza the commander obtained the weather information from the Mwanza Tower. The wind was calm. The controller who was handling the flight said that whilst approaching runway 12 of Mwanza airport the aircraft was swaying from side to side. When EL-WVD touched down on the runway a loud bang was heard and one engine was observed to separate and roll down the runway whilst it was on fire. Examination of the impact and tire marks showed that the right wing tip impacted the runway first followed by the n°4 engine. The right main landing gear subsequently contacted the grass surface off the left edge of the runway followed by the left main landing gear. The aircraft continued to roll in a direction almost parallel to the runway centreline for 250 metres before it crossed the runway at an angle. It was also evident from the tyre marks that as it reached the runway the aircraft made a 180° turn to point in the opposite direction whilst sliding sideways at an angle with the centreline under its own momentum. As it did so, the main landing gear collapsed and three wing pylons sheared causing the engines to separate. EL-WVD finally settled at the edge of the runway pointing 310° with the right wing projecting 2.5 metres inside the runway. There was fuel leakage but no fire. The four crew members disembarked with minor injuries.", "probable_cause": null}