{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900c-lihue-1-killed", "date": "Jan 14, 2008 at 0508 LT", "type": "Beechcraft 1900C", "operator": "Alpine-Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Postal (mail)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Honolulu - Lihue", "msn": "UC-070", "yom": 1989, "flight_number": "AIP253", "city": "Lihue", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3098, "captain_hours_type": 1480, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 19123, "circumstances": "The pilot was flying a night, single-pilot, cargo flight over water between two islands. He had routine contact with air traffic control, and was advised by the controller to maintain 6,000 feet at 0501 hours when the airplane was 11 miles from the destination airport. Two minutes later the flight was cleared for a visual approach to follow a preceding Boeing 737 and advised to switch to the common traffic advisory frequency at the airport. The destination airport was equipped with an air traffic control tower but it was closed overnight. The accident flight's radar-derived flight path showed that the pilot altered his flight course to the west, most likely for spacing from the airplane ahead, and descended into the water as he began a turn back toward the airport. The majority of the wreckage sank in 4,800 feet of water and was not recovered, so examinations and testing could not be performed. As a result, the functionality of the altitude and attitude instruments in the cockpit could not be determined. A performance study showed, however, that the airspeed, pitch, rates of descent, and bank angles of the airplane during the approach were within expected normal ranges, and the pilot did not make any transmissions during the approach that indicated he was having any problems. In fact, another cargo flight crew that landed just prior to the accident airplane and an airport employee reported that the pilot transmitted that he was landing on the active runway, and was 7 miles from landing. Radar data showed that when the airplane was 6.5 miles from the airport, at the location of the last recorded radar return, the radar target's mode C altitude report showed an altitude of minus 100 feet mean sea level. The pilot most likely descended into the ocean because he became spatially disoriented. Although visual meteorological conditions prevailed, no natural horizon and few external visual references were available during the visual approach. This increased the importance of monitoring flight instruments to maintain awareness of the airplane attitude and altitude. The pilot's tasks during the approach, however, included maintaining visual separation from the airplane ahead and lining up with the destination runway. These tasks required visual attention outside the cockpit. These competing tasks probably created shifting visual frames of reference, left the pilot vulnerable to common visual and vestibular illusions, and reduced his awareness of the airplane's attitude, altitude and trajectory.", "probable_cause": "The pilot's spatial disorientation and loss of situational awareness. Contributing to the accident were the dark night and the task requirements of simultaneously monitoring the cockpit instruments and the other airplane."}