{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31p-pressurized-navajo-anderson-2-killed", "date": "Mar 17, 2002 at 2306 LT", "type": "Piper PA-31-310 Navajo", "operator": "Floopie Flight Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "LaGrange – Anderson", "msn": "31-7400187", "yom": 1974, "flight_number": null, "city": "Anderson-Darlington Field", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1011, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3991, "circumstances": "The airplane was destroyed by impact forces and fire, when it impacted the ground about 3.7 miles from the destination airport. The airplane had been cleared for an ILS approach to the airport. No anomalies were found during the on-scene examination of the airframe, engine or gyroscopic flight instruments that could be associated with a pre-existing condition. The minimum descent altitude for the approach is 243 feet above ground level. The inbound course for the instrument approach is 298 degrees magnetic. The radar data shows that the airplane headed in a northerly direction prior to commencing a left turn onto the inbound course of the instrument approach. The last radar return, was received prior to the airplane reaching the locator outer marker for the approach. Altitude returns show the airplane descending from a pressure altitude of 4,000 feet to a pressure altitude of 2,800 feet. The 2,800-foot return was the final return received. The wreckage path was distributed on a magnetic heading of approximately 145 degrees. The weather reporting station located at the destination airport recorded a 100 foot overcast ceiling with 1 statute mile of visibility about 20 minutes prior to the accident. The current weather was available to the pilot via the Automated Weather Observing System at the destination airport. No communications were received from the airplane after controllers authorized the pilot to change to the destination airport's advisory frequency.", "probable_cause": "The pilots failure to maintain control of the airplane during the instrument approach. The low overcast ceiling and the pilot's in-flight decision to execute the instrument approach in below minimum weather conditions were factors."}