{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-880-22m-3-tokyo-5-killed", "date": "Aug 26, 1966 at 1428 LT", "type": "Convair CV-880", "operator": "Japan%20Domestic%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tokyo - Tokyo", "msn": "22-00-45M", "yom": 1961, "flight_number": null, "city": "Tokyo-Haneda", "zone": "Kantō", "country": "Japan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 8446, "captain_hours_type": 1265, "copilot_hours": 2618, "copilot_hours_type": 25, "aircraft_hours": 5290, "circumstances": "JA8030 started a take-off run on runway 33R of Tokyo International Airport under VFR conditions at approximately 1428 hours with the pilot-in-command Manshichi Harano, examinees Yoshiomi Motouchi and Shuji Daikoku, flight engineer Terumitsu Fujimaki, and Chief Examiner of the Civil Aviation Bureau of Ministry of Transport Yukiaki Kawata, on board for the purpose of conducting a practical examination necessary for change in type rating to Convair 880-22M. About the time the aircraft took a nose-up attitude, it began to yaw left and entered into a right side-slip. At approximately 1 500 m from the runway threshold marking, the right main landing gear started to go off the ground, and while the yaw and side-slip further increased, the under-surface of No. 1 engine began to contact the runway at approximately 1 600 m from the marking. The aircraft continued to side-slip with the nose coming down and deviated from the runway at approximately 1 700 m from the marking. The aircraft moved on the lawn area, crossed taxiway C-4, then while proceeding in the direction of approximately 35O left in reference to the runway bearing, moved the heading to approximately 145O left in reference to the runway bearing, thence yawed right and continued the side-slip. Although the aircraft was in a slight nose-up attitude during this period, it went abruptly into a nose-down and almost at that time a fire started near No. 3 engine. During this period the aircraft further proceeded with the left main landing gear, nose landing gear and Nos. 3, 2, 1 and 4 engines separated in this sequence, and came to a stop at a point approximately 2 100 m from runway 33R threshold marking and approximately 200 m from the runway centre line with a heading of 90° in reference to runway 33L. The fire expanded explosively and the aircraft was damaged by fire or burnt except for the aft fuselage, empennage and a portion of the main wings. All five persons on board died. The flight was performed on behalf of Japan Air Lines. ", "probable_cause": "The reason for the uncontrollable left yaw was not determined. The following findings were reported:\r\n- No evidence related to the cause of the accident could be found from qualifications, working conditions and others of the flight crew,\r\n- No evidence related to the cause of the accident could be found from investigation of the aircraft wreckage,\r\n- It was recognized that JA 8030 was flown by pilot Daikoku in the left-hand seat, \r\n- It was estimated that the aircraft was taking off with left rudder and right wing down to counteract a cross-wind from the right,\r\n- It was estimated that No. 1 engine was idled around the time VR was reached,\r\n- Although it was estimated that the left rudder was in operation around the time No. 1 engine was idled, it was not clear why and when the rudder came to operation,\r\n- It was estimated that the aircraft was in a right side-slip conditions at the time the tire trace of the right main landing gear started to be marked. It was estimated that, at the time the tire trace of the right main landing gear had disappeared, it became impossible for the crew to counteract by control the rolling moment to the left due to the right side-slip. It is also estimated that the rolling moment produced to a considerable extent resulted from an abrupt increase in side-slip angle due to yawing acceleration after the time the tire trace of the right main landing gear started to be marked."}