{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-islander-nassau", "date": "Jun 27, 2007 at 1721 LT", "type": "Britten-Norman Islander", "operator": "Golden-Wings-Charter-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Little White Cay - Nassau", "msn": "606", "yom": 1970, "flight_number": null, "city": "Nassau", "zone": "New Providence", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9010, "circumstances": "On June 27, 2007 about 1721 eastern daylight time (2121Z) a Pilatus Britten Norman Islander, N133RS registered to and owned by FYP LTP, and operated by Golden Wings Charter, Windsor Field, Nassau, Bahamas, had crashed short of runway 14. Just prior to crashing, approximately 1718 eastern daylight time (2118Z), the pilot of aircraft N133RS reported the left engine had failed. At approximately 1721 eastern daylight time (2121Z), the pilot reported he was unable to make runway 14 and crashed approximately ½ mile short of Runway 14. The State of Manufacture and State of Design along with the State of Registry were notified of the accident on June 28, 2007. They were invited to participate in the investigation in accordance with Annex 13 and CASR 2001 Schedule 18. Visual Meteorological Conditions prevailed at the time of the accident. The flight originated from Lynden Pindling International Airport, Nassau [MYNN] to Little Whale Cay, Berry Island [MYBX] and returned to Nassau [MYNN], the incident leg. The airplane sustained substantial damage. The Pilot was the only person aboard the aircraft. The Pilot in Command holds a current United States Commercial Pilot Rating. No serious injuries or fatalities were reported.", "probable_cause": "The Flight Standards Inspectorate determined that the probable cause of this accident was Propulsion System Malfunction due to fuel exhaustion of the left engine, followed by inappropriate crew response (fuel mismanagement).\r\nContributing Factors:\r\n- Pilot’s unfamiliarity with aircraft fuel system.\r\n- Pilot’s limited command experience. (He was a new hire, low time pilot)\r\n- Pilot’s failure to conduct a proper preflight inspection of his aircraft. (did not visually check fuel tanks despite knowing that the gauges were faulty)\r\n- Pilot’s complacency with documentation of defects. (Pilot never advised maintenance or management that the gauges were faulty)\r\n- Pilot’s reliance on indications that he admitted were erroneous.\r\n- Pilot’s lack of situational awareness.\r\n- Pilot’s failure to recognize that his problem was fuel exhaustion and not engine failure and neglected to use cross-feed procedure."}