{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-edenton-2-killed", "date": "Jan 2, 1997 at 1835 LT", "type": "Cessna 208B Grand Caravan", "operator": "Tar%20Heel%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Manteo - Edenton", "msn": "208B-0179", "yom": 1989, "flight_number": null, "city": "Edenton", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2980, "captain_hours_type": 850, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3520, "circumstances": "During his weather briefing, the pilot was told that his destination weather was not available, and was provided weather for an airport about 10 miles north. He was briefed that low visibility due to fog prevailed. The flight departed earlier then usual because the company business manager was concerned that the weather at the destination airport was deteriorating, and if the airplane was not there earlier they might not get into the airport. At the time of the accident there was a power failure, and lights around the destination airport went out. The airplane had struck power lines and a support tower located on the approach end of runway 1 and runway 5, about 1/2 mile southwest of the airport. The airport had one NDB approach which was not authorized at night. The nearest recorded weather, about 10 miles north of the crash site, at the time of the accident was; '...ceiling 100, [visibility] 1/2 mile, fog, [temperature] 46 degrees F, dew point, 42 degrees F, winds 220 degrees at 5 [knots], altimeter 29.90 inches Hg. Witnesses reported that there was heavy fog at the airport and the visibility was below 1/4 mile. ", "probable_cause": "The pilot's continued VFR flight into instrument meteorological conditions. Factors in this accident were: fog, the low ceiling, and the dark night. "}