{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-comox-2-killed", "date": "Apr 22, 2005 at 0741 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Nav%20Air%20Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Nanaimo – Comox", "msn": "31-7652080", "yom": 1976, "flight_number": null, "city": "Comox", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on a scheduled cargo flight from Nanaimo, British Columbia, to the civilian terminal on the south side of the military airbase at Comox, British Columbia. The crew members established communication with the Comox tower when they were at about 2000 feet over Hornby Island, 12 nautical miles southeast of Comox, and requested a practice back course/localizer approach to Runway 30, circling for landing on Runway 18. The request was approved and the aircraft continued inbound. When the aircraft was about two miles from the threshold of Runway 30, the crew declared an emergency for an engine fire in the right engine. The tower alerted the airport response teams and requested standard data from the crew concerning the number of people and amount of fuel on board. Less than 30 seconds after the crew first reported the emergency, the aircraft was engulfed in flames. Shortly thereafter, at 0741 Pacific daylight time, the aircraft rolled inverted and struck the ground in a steep, nose-down, left-wing-low attitude. The aircraft broke apart and burned. Both crew members were fatally injured.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. At some point after 01 April 1999, a bad gasket (P/N LW-13388) was installed in the accident engine.\r\n2. The requirement of Airworthiness Directive 2002-12-07 (to ensure that old converter plate gaskets were removed and replaced by new parts) was not carried out on the accident engine.\r\n3. The improper oil filter converter plate gasket in the right engine compartment failed, allowing pressurized oil to spray into the engine compartment and ignite on contact with hot turbocharger and exhaust components.\r\n4. The firewall fuel shut-off valve remained in the OPEN position, allowing pressurized fuel to be delivered to the engine-driven fuel pump by the aircraft’s boost pumps.\r\n5. The initial oil-fed fire generated considerable heat, which melted the casing of the engine-driven fuel pump, allowing pressurized fuel to intensify the fire.\r\n6. The flames breached the main fuel tank, inboard of the engine, causing the aircraft to become engulfed in flames.\r\nFindings as to Risk:\r\n1. Inappropriate converter plate gaskets, identified by part number LW-13388, are known to have remained in the aviation system after the date of the terminating action required by Airworthiness Directive (AD) 2002-12-07.\r\n2. Compliance with the full requirements of AD 2002-12-07 is not always being accomplished with respect to vibro-peening and proper gluing procedures."}