{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-lillabelle-lake-2-killed", "date": "May 25, 2012 at 1408 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Air%20Cochrane", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Edgar Lake - Lillabelle Lake", "msn": "168", "yom": 1952, "flight_number": null, "city": "Lillabelle Lake", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1100, "captain_hours_type": 300, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 22000, "circumstances": "The Cochrane Air Service de Havilland DHC-2 Mk.1 Beaver floatplane (registration C-FGBF, serial number 168) departed Edgar Lake, Ontario, with 2 passengers and 300 pounds of cargo on board. The aircraft was destined for the company’s main base located on Lillabelle Lake, Ontario, approximately 77 miles to the south. On arrival, a southwest-bound landing was attempted across the narrow width of the lake, as the winds favoured this direction. The pilot was unable to land the aircraft in the distance available and executed a go-around. At 1408, Eastern Daylight Time, shortly after full power application, the aircraft rolled quickly to the left and struck the water in a partially inverted attitude. The aircraft came to rest on the muddy lake bottom, partially suspended by the undamaged floats. The passenger in the front seat was able to exit the aircraft and was subsequently rescued. The pilot and rear-seat passenger were not able to exit and drowned. The emergency locator transmitter activated on impact.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. On the windward side of the landing surface, there was significant mechanical turbulence and associated wind shear caused by the passage of strong gusty winds over surface obstructions.\r\n2. During the attempted overshoot, the rapid application of full power caused the aircraft to yaw to the left, and a left roll quickly developed. This movement, in combination with a high angle of attack and low airspeed, likely caused the aircraft to stall. The altitude available to regain control before striking the water was insufficient.\r\n3. The pilot survived the impact, but was unable to exit the aircraft, possibly due to difficulties finding or opening an exit. The pilot subsequently drowned.\r\n4. The rear-seat passenger did not have a shoulder harness and was critically injured. The passenger’s head struck the pilot’s seat in front; this passenger did not exit the aircraft and drowned.\r\nFindings as to Risk:\r\n1. Without a full passenger safety briefing, there is increased risk that passengers may not use the available safety equipment or be able to perform necessary emergency functions in a timely manner to avoid injury or death.\r\n2. Not wearing a shoulder harness can increase the risk of injury or death in an accident.\r\n3. Not having a stall warning system increases the risk that the pilot may not be aware of an impending aerodynamic stall.\r\n4. Commercial seaplane pilots who do not receive underwater egress training are at increased risk of being unable to exit the aircraft following a survivable impact with water."}