{"url": "https://www.baaa-acro.com/crash/crash-cessna-414a-chancellor-colonia-1-killed", "date": "Oct 29, 2019 at 1058 LT", "type": "Cessna 414 Chancellor", "operator": "Warbird Associates", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Leesburg - Linden", "msn": "414A-0471", "yom": 1980, "flight_number": null, "city": "Colonia", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 7173, "captain_hours_type": 1384, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7712, "circumstances": "The pilot was conducting a GPS circling instrument approach in instrument meteorological conditions to an airport with which he was familiar. During the final minute of the flight, the airplane descended to and leveled off near the minimum descent altitude (MDA) of about 600 ft mean sea level (msl). During this time, the airplane’s groundspeed slowed from about 90 knots to a low of 65 knots. In the few seconds after reaching 65 knots groundspeed, the flight track abruptly turned left off course and the airplane rapidly descended. The final radar point was recorded at 200 ft msl less than 1/10 mile from the accident site. Two home surveillance cameras captured the final few seconds of the flight. The first showed the airplane in a shallow left bank that rapidly increased until the airplane descended in a steep left bank out of camera view below a line of trees. The second video captured the final 4 seconds of the flight; the airplane entered the camera view already in a steep left bank near treetop level, and continued to roll to the left, descending out of view. Both videos showed the airplane flying below an overcast cloud ceiling, and engine noise was audible until the sound of impact. Postaccident examination of the airplane revealed no evidence of preimpact mechanical malfunctions that would have precluded normal operation. The propeller signatures, witness impact marks, audio recordings, and witness statements were all consistent with the engines producing power at the time of impact. The pilot likely encountered restricted visibility of about 2 statute miles with mist and ceilings about 700 ft msl. When the airplane deviated from the final approach course and descended below the MDA, the destination airport remained 3.5 statute miles to the northeast. Although the airplane was observed to be flying below the overcast cloud layer, given the restricted visibility, it is likely that the pilot was unable to visually identify the airport or runway environment at any point during the approach. According to airplane flight manual supplements, the stall speed likely varied from 76 to 67 knots indicated airspeed. The exact weight and balance and configuration of the airplane could not be determined. Based upon surveillance video, witness accounts, and automatic dependent surveillance-broadcast data, it is likely that, as the pilot leveled off the airplane near the MDA, the airspeed decayed below the aerodynamic stall speed, and the airplane entered an aerodynamic stall and spin from which the pilot was unable to recover. Based on a readout of the pilot’s cardiac monitoring device and autopsy findings, while the pilot had a remote history of arrhythmia, sudden incapacitation was not a factor in this accident. Autopsy findings suggested that the pilot’s traumatic injuries were not immediately fatal; soot material in both the upper and lower airways provided evidence that the pilot inhaled smoke. This autopsy evidence supports that the pilot’s elevated carboxyhemoglobin level was from smoke inhalation during the postcrash fire. In addition, there were no distress calls received from the pilot and there was no evidence found that would indicate there was an in-flight fire. Thus, carbon monoxide exposure, as determined by the carboxyhemoglobin level, was not a contributing factor to the accident.", "probable_cause": "The pilot’s failure to maintain airspeed during a circling instrument approach procedure, which resulted in an exceedance of the airplane’s critical angle of attack and an aerodynamic stall and spin. "}