{"url": "https://www.baaa-acro.com/crash/crash-noorduyn-norseman-iv-lake-mondor", "date": "May 9, 1952 at 1015 LT", "type": "Noorduyn Norseman", "operator": "Gold Belt Air Service", "flight_phase": "Flight", "flight_type": "Test", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Lac-à-la-Tortue - Lac-à-la-Tortue", "msn": "32", "yom": 1940, "flight_number": null, "city": "Shawinigan", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot and five passengers left Lac-à-la-Tortue for a local test flight. Ten minutes later, while flying at an altitude of 2,100 feet, the engine failed. The emergency forced landing which was attempted on the nearest lake (Lake Mondor), appears to have been made downwind. The first contact with the water was made approximately in the middle of the lake which was about three-quarter of a mile long. The aircraft bounced, settled on the water again about 200 feet from the east end of the lake and then ran up on the shore. In the ensuing collision it was substantially damaged by trees and a small cottage. Minor injuries were sustained by two of the passengers. ", "probable_cause": "Examination of the aircraft disclosed that it was equipped with a front belly tank in addition to the normal wing tanks and that the placard plate for fuel tank selection gave no indication that a belly tank was installed. Examination of the fuel lines and selector valve established that when the selector in the cockpit indicated 'both on', the selector was on the belly tank. A few days before the accident, 5 gallons of gasoline was put in the belly tank when testing the tanks for leaks. It was established that no further fuel was put in the belly tank before the accident although the wing tanks were filled. The aircraft was test flown on 8 May, and fuel was used from all three tanks. On the last flight of the aircraft on 8 May, fuel was used from the belly tank only. It was established that the pilot was not aware that the aircraft was fitted with a belly tank and that in selecting 'both on' he believed that he had selected both wing tanks. Examination of the belly tank after the accident showed it to be empty and undamaged. There was no evidence of failure or malfunctioning of the airframe, engine or controls. Weather was not considered as a factor in the accident. In conclusion, after an emergency forced landing caused by the exhaustion of fuel from the belly tanks the aircraft hit obstructions on the shore line. A contributing factor is considered to have been misleading information given by the placard on the fuel selector valve. "}