{"url": "https://www.baaa-acro.com/crash/crash-embraer-erj-145lr-mitu", "date": "May 5, 2010 at 1049 LT", "type": "Embraer ERJ-145", "operator": "Satena-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Villavicencio - Mitú", "msn": "145-879", "yom": 2005, "flight_number": "NSE9634", "city": "Mitú-Fabio Alberto León Bentley", "zone": "Vaupés", "country": "Colombia", "region": "South America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 37, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10254, "captain_hours_type": 1060, "copilot_hours": 1061, "copilot_hours_type": 806, "aircraft_hours": 9095, "circumstances": "After landing on runway 20 (1,760 meters long) at Mitú-Fabio Alberto León Bentley Airport, the aircraft encountered difficulties and was unable to stop within the remaining distance. It overran at a speed of 52 knots, went through a fence, lost its undercarriage and came to rest in a prairie some 163 metres further. All 41 occupants were uninjured while the aircraft was damaged beyond repair. It was registered FAC-1173 (military) and HK-4536 (civil). ", "probable_cause": "Wrong approach configuration on part of the crew. Execution of the landing procedure on runway 20 despite the fact that aircraft was unstable on approach. At runway threshold, the aircraft altitude was too high and its speed upon touchdown was excessive (132 knots). The airplane touched down 562 metres past the runway threshold, well beyond the touchdown zone. All brakes systems were activated but the upper right thrust reverser deployed and retracted shortly later due to technical reasons, which was considered as a contributory factor. The following factors also contributed to the mishap:\r\n- Poor techniques used by the pilot-in-command on approach and after touchdown, \r\n- Deviation from standard operating procedures (SOP), \r\n- Non-adherence to published procedures,\r\n- No reaction or corrective action to the EGPWS alarm. "}