{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-g18as-dupage", "date": "Dec 4, 1991 at 0405 LT", "type": "Beechcraft G18S", "operator": "Viking Express", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "DuPage - Covington", "msn": "BA-574", "yom": 1961, "flight_number": null, "city": "DuPage", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4571, "captain_hours_type": 330, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot stated she felt the twin engined tailwheel cargo airplane yaw to the right during takeoff. The pilot stated she applied left rudder and set differential power to correct for the perceived right hand crosswind. As the airplane lifted off, it made a sharp right turn and performed left and right banks leveling off prior to colliding with the ground. The airplane slid through security fences and a fuel supply depot before stopping. The newspaper bundle cargo moved from the two forward bays to the aft end of the cargo compartment. The newspapers were covered with plastic wrapper. The cargo compartment floor was slippery when walked upon and had traces of snow on it. According to the pilot the cargo was covered by a cargo net secured at the forward end but not at the aft end. Two cargo straps were crisscrossed over the net and secured at the aft end of the cargo load. The left throttle was found in the full forward position. The right throttle was found one inch aft of the full forward position. ", "probable_cause": "A result of the pilot in command's not maintaining directional control, an improper inflight decision, and improper remedial action once the loss of directional control was recognized by the pilot. Factors contributing to this accident are inadequate cargo restraints, loose cargo, and improper security of the cargo not observed by the pilot. Additional factors contributing to this accident are the inadequate standards for aircraft equipment and training provided by the company employing and operating the airplane."}