{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-lakeville-1-killed", "date": "Jun 26, 1990 at 1616 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "D & M express", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Flint – Akron", "msn": "46-8508044", "yom": 1985, "flight_number": null, "city": "Lakeville", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 983, "captain_hours_type": 197, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 710, "circumstances": "During IFR departure, pilot received progressive altitude clearances to climb to 15,000 feet. At 1607 edt, he was vectored for 'a good rate of climb' thru 14,000 feet with clearance to proceed on course after leveling 14,000 feet for 15,000 feet. Radar data indicated a steady climb til aircraft was above 13,000 feet. As it climbed from 13,300 feet to 13,900 fet (max recorded altitude), its speed slowed from about 115 knots to below 80 knots. At 1613 edt, pilot was cleared to proceed direct and change frequency. Radar data showed that after reaching 13,900 feet, aircraft deviated from course and entered steep descent. Radar contact was lost and inflight breakup occurred. Pieces of wings and stabilizers were found up to 1.5 mile from fuselage. Trajectory study disclosed breakup occurred between 6,000 feet and 9,000 feet msl. Exam of fractures on major components revealed characteristics typical of overstress; no preexisting cracks were found. No autopilot failure or bird strike was found. Clouds were layered to 20,000 feet; freezing level was about 12,500 feet. There was evidence aircraft was in or near convective precipitation above freezing level for about 1.5 minute before rapid descent. Found Pitot heat switch 'off' and induction air door in its primary position. The pilot, sole on board, was killed.  ", "probable_cause": "The pilot's failure to use the airplane's ice protection equipment, which resulted in a performance loss due to induction icing, propeller icing, or both, while flying in convective instrument meteorological conditions (IMC) at and above the freezing level. The performance loss led to a stall, the recovery from which probably was exacerbated by the pilot's improper response to erroneous airspeed indications that resulted from blockage of the pitot tube by atmospheric icing.   "}