{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-rockingham-county", "date": "Jan 11, 1989 at 0728 LT", "type": "Cessna 208B Grand Caravan", "operator": "Atlantic Aero", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Roanoke - Greensboro", "msn": "208B-0053", "yom": 1987, "flight_number": null, "city": "Rockingham County-Shiloh (Stoneville)", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2100, "captain_hours_type": 360, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 896, "circumstances": "As the pilot was en route to Greensboro (his destination), he flew past Shiloh and noted that weather at the airport was clear, but from about 10 south of Shiloh, ground fog extended to the south. At 0634 est, he contacted Greensboro tower and was advised the RVR was 1,600 feet. His minimums were 1,800 feet. He held for a period of time, but the weather continued to deteriorate, so he diverted to the Rockingham County-Shiloh Airport, where no weather reporting facilities were available. After being vectored over the alternate airport, he was unable to get enough visual cues for a visual approach, so he elected to make an sdf approach. The pilot stated that when he reached the minimum descent altitude (MDA), he saw the runway and proceeded to make a visual approach. As he continued, patchy fog began to obscure the runway, so he maneuvered the aircraft to keep it in site, then elected to go around. However, as he began the go-around, the aircraft hit trees and crashed. Elevation of the crash site was approximately 700 feet. MDA for the approach was 1,120 feet msl.", "probable_cause": "Improper IFR procedure by the pilot and his failure to maintain the minimum descent altitude (MDA). Contributing factors were: low ceiling, fog, delayed missed approach by the pilot, and trees.\r\nOccurrence #1: in flight collision with object\r\nPhase of operation: approach - faf/outer marker to threshold (ifr)\r\nOccurrence #1: in flight collision with object\r\nPhase of operation: approach - faf/outer marker to threshold (ifr)\r\nFindings\r\n1. (f) weather condition - low ceiling\r\n2. (f) weather condition - fog\r\n3. (f) missed approach - delayed - pilot in command\r\n4. (c) ifr procedure - improper - pilot in command\r\n5. (f) object - tree(s)\r\n6. (c) minimum descent altitude - not maintained - pilot in command"}