{"url": "https://www.baaa-acro.com/crash/crash-lockheed-p2v-7-neptune-near-dixon-2-killed", "date": "Feb 8, 1992 at 1530 LT", "type": "Lockheed P-2 Neptune", "operator": "Hawkins-Powers-Aviation-2", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Mountains", "schedule": "Tucson - Greybull", "msn": "726-7227", "yom": 1958, "flight_number": null, "city": "Dixon", "zone": "Wyoming", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6000, "captain_hours_type": 180, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8401, "circumstances": "The flight had departed Tucson, AZ, on a special VFR ferry flight to Greybull, WY. The airplane was not instrumented for IFR flight. When the flight reported over Winslow, it was advised that VFR flight was not recommended northbound from its present position. Surface weather conditions in southcentral wyoming/northwestern Colorado at the time of the accident were consistent with low ceilings, clouds and snow as reported by witnesses and surface weather observations. The witnesses, located near the Dixon Airport, reported hearing a low flying aircraft travelling west to east, and another witness northeast of the arpt heard an aircraft 'revving' its engines. Radar data shows the aircraft tracking northbound slightly east of the Dixon airport, and executing a clockwise 360° turn northeast of the airport and in the vicinity of one of the witnesses. The last radar target received placed the aircraft approximately one mile north-northeast of the accident site. The aircraft impacted snow covered terrain in a steep nose-down attitude. Both pilots were killed. ", "probable_cause": "The pilot-in-command's continued VFR flight into instrument meteorological conditions which resulted in a loss of control due to the lack of aircraft attitude indicators and resultant pilot spatial disorientation. A factor which contributed to the accident was the weather condition(s)."}