{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-90-dl-saint-louis-6-killed", "date": "May 24, 1953 at 0418 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Meteor-Air-Transport", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Teterboro – Saint Louis", "msn": "20433", "yom": 1944, "flight_number": null, "city": "Saint Louis-Lambert", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 2, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 4641, "captain_hours_type": 1361, "copilot_hours": 2729, "copilot_hours_type": 789, "aircraft_hours": 10923, "circumstances": "Meteor Air Transport is an irregular carrier, and in this instance was transporting a Pratt and Whitney R-2800 engine and four company employees from Teterboro, New Jersey, to Oklahoma City, Oklahoma, where the engine was to be installed in a company C-46 aircraft. The flight departed Teterboro for St. Louis, Missouri, at approximately 2300, May 23, 1953, on a VFR Flight Plan filed by Captain Harold Carr with an estimated flight time of six and one-half hours. An instrument flight plan filed en route was approved from over Troy, Ohio, intersection via Green Airways 4 to St. Louis, Missouri, cruising at 4,000 feet. The flight proceeded in a routine manner and reported over Terre Haute, Indiana, at 0259, May 24, and at 0324 the following clearance was given to Vandalia radio for delivery to the flight: \"ATC clears N 53596 to the Alton intersection to cross Alton at 3,000, Maintain 3,000, no delay expected, contact approach control approaching Alton.\" At 0357, N 53596 made its initial contact with the St. Louis Tower with the information that it was approaching Alton intersection at 3,000. In reply to an inquiry, N 53596 advised the tower that it carried ILS equipment and was recleared to the ILS Outer Marker 2 to maintain 3,000 with no expected delay and to report when over the Alton intersection. The flight was given the current St. Louis weather: ceiling measured 400 overcast, visibility 3 miles, fog and smoke, altimeter 29.93. It was cleared for an ILS approach to Runway 24 or l2, 3 wind south variable 5, to report leaving 3,000, passing Alton and the Outer Marker. N 53596 reported leaving 3,000 at 0408, passing Alton intersection at 0410 1/2 and inbound over the Outer Marker at 0414. While the controller was watching the approach end of Runway 24 expecting N 53596 to come into view at any moment, a surging of engines was heard; and almost simultaneously a message was received from the flight stating that it was over the field with an engine out. The time as noted by the controller was 0415 at which time all runny and approach lights were turned up to full intensity and the standby emergency alarm sounded. The pilot of the aircraft was advised that the surface winds were calm and to use any runway he could make. Shortly thereafter, the controller for the first and only time observed N 53596 at a position south of the field flying on a southeasterly heading above Natural Bridge Highway which runs parallel to Runway 12. The altitude of the aircraft was estimated at 300 feet and it appeared to be descending with the landing gear in a down position. Upon reaching an altitude of 200 feet, according to the controller, it started a climbing left turn and disappeared in the overcast. Repeated efforts to contact the flight were unsuccessful. It was learned shortly thereafter through the county sheriff's office that the aircraft had crashed adjacent to Brown Road near the McDonnell Aircraft Plant gate number 6. Navy emergency equipment was immediately dispatched to the scene. There was no fire. The occupants of the aircraft were Senior Captain S. J. Rankin, Captain Harold Carr, First Officers Edward J. Raftery and Arthur A. Ravitz, Stewardess Anne Marie Delicata, Superintendent of Maintenance John Swart and Floyd Evans, mechanic. Mr. John Swart was the only survivor.", "probable_cause": "The Board determines that the probable cause of this accident was mismanagement of fuel resulting in loss of power and control while circling the field preparatory to an approach for landing. The following findings were pointe out:\r\n- The St. Louis weather given the pilot as he approached the Alton intersection was ceiling 400 overcast, visibility 3 miles, fog and smoke, wind south 5, altimeter 29.93,\r\n- The flight circled the airport in an attempt to remain contact below the authorized minima,\r\n- Mismanagement of fuel resulted in the right engine stopping,\r\n- Ample fuel remained for continued flight at the time of the accident,\r\n- When the pilot was executing a left turn near the southeast corner of the airport, the right engine stopped and the aircraft fell striking the ground on the right wing."}