{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-134a-ivanovo-84-killed", "date": "Aug 27, 1992 at 2244 LT", "type": "Tupolev TU-134", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Mineralnye Vody - Donetsk - Ivanovo", "msn": "49868", "yom": 1977, "flight_number": "SU2808", "city": "Ivanovo-Yuzhny", "zone": "Ivanovo oblast", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 77, "pax_fatalities": 77, "other_fatalities": 0, "total_fatalities": 84, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 26307, "circumstances": "The aircraft departed Mineralnye Vody on a schedule service to Ivanovo with an intermediate stop in Donetsk. Following an uneventful flight, the crew initiated the descent to Ivanovo-Yuzhny Airport. The visibility was limited due to the night and poor weather conditions. On final approach, the aircraft was not properly aligned on the glide and the copilot and the navigator attempted to inform the captain about the deviation but without success. The captain continued the approach in a wrong configuration when, at a speed of 370 km/h and a rate of descent of 6 metres per second, the left wing struck a residential building. The aircraft entered a nose-down attitude and crashed 512 metres further, some 2,450 metres short of runway 29, bursting into flames. The aircraft was totally destroyed and all 84 occupants were killed. ", "probable_cause": "The accident was the consequence of a wrong approach configuration on part of the crew. The captain ignored several alerts from the copilot and the navigator and failed to initiate a go-around procedure despite the GPWS alarm sounded for about 10 seconds. The following contributing factors were reported: \r\n- Loss of altitude control in adverse weather conditions following a premature descent,\r\n- The crew failed to follow the published approach procedures, which resulted in the aircraft approaching the airport at an insufficient altitude and at an excessive speed, \r\n- The 4th turn was completed too late at a distance less than calculated, which caused the aircraft to deviate from the approach path with a separation (deviation) of 1,900 metres to the right of the approach path at a distance of 8,600 metres from the runway threshold at an altitude of 500 metres,\r\n- The captain decided to continue the approach while a landing was obviously impossible,\r\n- A total interruption of interactions within the crew during the approach procedure, which brang the captain in a delicate situation without any assistance from the other members of the crew and causing a regular loss of the altitude control,\r\n- The crew let the aircraft passing the admissible vertical speed during the final approach,\r\n- Failure of the crew to initiate a go-around procedure while the Ground Proximity Warning System alarm sounded for about 10 seconds, \r\n- Excessive corrective maneuvers on part of the captain which caused the aircraft to enter a roll angle greater than the permissible limits,\r\n- The violation by the crew of the approach pattern was facilitated by the lack of assistance from ATC at Ivanovo Airport. "}