{"url": "https://www.baaa-acro.com/crash/crash-cessna-441-conquest-greenacres-city-1-killed", "date": "Dec 30, 2003 at 1115 LT", "type": "Cessna 441 Conquest", "operator": "NL Five", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Boca Raton – West Palm Beach", "msn": "441-0188", "yom": 1981, "flight_number": null, "city": "Greenacres City", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5832, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4036, "circumstances": "The airplane, flown by an airline transport pilot, departed in day visual meteorological conditions for an 18-nautical mile flight from the home base airport to another airport where the pilot planned to conduct a practice instrument approach. The pilot contacted approach control and requested a practice ILS approach. The controller instructed the pilot to proceed northwest bound and maintain 2,500 feet msl. Radar indicated the airplane tracked a northerly heading instead of a northwesterly heading as instructed. The airplane continued on a northerly heading until 1113:48 when it was about 5 miles southwest of the destination airport at 1,900 feet msl with a ground speed of 172 knots. At this point, the controller instructed the pilot to turn southbound and remain clear of Class C airspace. Radar coverage for the next 50 seconds was intermittent. At 1114:29, radar picked up the airplane about 4 miles southwest of the destination airport at 1,800 feet msl, a ground speed of 106 knots, and a heading of 101 degrees. The airplane continued heading east-southeast for about 30 seconds and its ground speed continued to decay. At 1114:58, it entered an abrupt descent, going from 1700 feet to 200 feet in 15 seconds. The last radar return was recorded at 1115:13 and showed the airplane at 200 feet msl, a ground speed of 64 knots, and a heading of 093 degrees. Several witnesses observed the airplane descend in a \"flat spin\" and impact a shallow canal in a residential area. Examination of the accident site revealed that the airplane impacted the canal in a nearly flat and level attitude. No evidence of any pre-impact mechanical discrepancies with the airframe or engines was found that would have prevented normal operation. Testing of the electronic engine controls revealed that both units were functional, but under some conditions would trip to manual mode. Further investigation determined that the units tripping to manual mode was due to an electrical overstress that failed the same thermistor within each unit. The reason for the electrical overstress or when it occurred could not be determined; however, it is probable it occurred at impact when the units were submerged in water. Even if the units tripped to manual mode in flight, this would only result in the loss of the torque and temperature limiting and propeller synchrophaser systems, meaning the pilot would have to manually adjust the power levers as required to maintain the proper torque and exhaust gas temperature. Post accident toxicology testing of the pilot's blood revealed chlorpheniramine, an over-the-counter sedating antihistamine, at more than ten times higher than the level expected with a typical maximum over-the-counter dose. It is probable that the  pilot's performance and judgment were substantially impaired by his very high blood level of chlorpheniramine.", "probable_cause": "The pilot's failure to maintain aircraft control, which resulted in an inadvertent stall/spin and subsequent uncontrolled descent into a canal. A factor was the pilot's impairment by the drug\r\nchlorpheniramine."}