{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-fort-huachuca-1-killed", "date": "May 17, 2014 at 1020 LT", "type": "Rockwell Shrike Commander 500", "operator": "Ponderosa%20Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Huachuca - Fort Huachuca", "msn": "500-3091", "yom": 1976, "flight_number": null, "city": "Fort Huachuca", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 13175, "captain_hours_type": 600, "copilot_hours": 16560, "copilot_hours_type": 4100, "aircraft_hours": 21660, "circumstances": "The commercial pilot reported that the purpose of the flight was to perform a check/orientation flight with the airline transport pilot (ATP), who was new to the area; the ATP was the pilot flying. The airplane was started, and an engine run-up completed. The commercial pilot reported that, during the takeoff roll, all of the gauges were in the “green.” After reaching an airspeed of 80 knots, the airplane lifted off the ground. About 350 ft above ground level (agl), the pilots felt the airplane “jolt.” The commercial pilot stated that it felt like a loss of power had occurred and that the airplane was not responding. He immediately shut off the boost pumps, and the ATP initiated a slow left turn in an attempt to return to the airport to land. The airplane descended rapidly in a nose-low, right-wing-low attitude and impacted the ground. A witness reported that he watched the airplane take off and that it sounded normal until it reached the departure end of the runway, at which point he heard a distinct “pop pop,” followed by silence. The airplane then entered an approximate 45-degree left turn with no engine sound and descended at a high rate with the wings rolling level before the airplane went out of sight. Another witness made a similar statement. Based on the witnesses’ statements and photographs of the twisted airplane at the accident site, it is likely that a total loss of engine power occurred and that, during the subsequent turn back to the airport, the ATP did not maintain sufficient airspeed and exceeded the airplane’s critical angle-of-attack, which resulted in an aerodynamic stall and impact with terrain. Although a postaccident examination of the airframe and engines did reveal an inconsistency between the cockpit control positions and the positions of the fuel shutoff valves on the sump tank, this would not have precluded normal operation. No other anomalies were found that would have precluded normal operation.", "probable_cause": "The pilot’s failure to maintain adequate airspeed and his exceedance of the airplane’s critical angle-of-attack after a total loss of engine power during the takeoff initial climb, which resulted in an aerodynamic stall and impact with terrain. The reason for the total loss of engine power could not be determined because an examination of the airframe and engines did not reveal any anomalies that would have precluded normal operation. "}