{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu24-954-rangitata-1-killed", "date": "Dec 28, 1988 at 1005 LT", "type": "Fletcher FU-24", "operator": "Garrow Aviation", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Rangitata - Rangitata", "msn": "280", "yom": 1981, "flight_number": null, "city": "Rangitata", "zone": "Canterbury Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off at about 0950 to spray chemicals on a 10-hectare potato crop. The flight was expected to take about 25 minutes. At 1020 when the plane had not returned to the airstrip the loader driver attempted to contact the pilot using a portable VHF transceiver. There was no response. The aircraft was found to have crashed in a level stony paddock. Physical evidence showed that the ground impact had occurred with the plane in a descending left turn and a nose down attitude. The angle of bank was 20 to 30 degrees. The outer panel of the left wing was damaged at the tip and was separated from the airframe, lying about 20 metres away. After this initial impact the plane had cartwheeled, breaking up. There was no fire. This was not a survivable accident.", "probable_cause": "There was evidence that the pilot had almost completed his task at this location and was probably making a reversal turn in order to carry out a \" cleaning up \" run down one of the boundaries when the crash occurred. No evidence of structural or mechanical failure could be found. There was no sign of collision with any obstacle, or of bird strike. The all-up weight and C of G were within the permitted limits. Witnesses agreed that the engine was running normally right up to the the moment of the crash. The sky conditions were partly cloudy with normal horizontal visibility. There had been drizzle earlier in the day but there was no precipitation at the time of the crash. The surface wind was light and variable. The weather was not considered to be a factor. An autopsy showed that the 47-year-old pilot had some slight arterial narrowing but not sufficient to cause sudden incapacitation. Tests for chemical poisoning proved negative. The crash investigator concluded that no probable cause for the accident could be established."}