{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b99-airliner-near-staunton-14-killed", "date": "Sep 23, 1985 at 1020 LT", "type": "Beechcraft 99 Airliner", "operator": "Henson%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Baltimore - Staunton", "msn": "U-156", "yom": 1974, "flight_number": "AL1517", "city": "Staunton", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": 3447, "captain_hours_type": 301, "copilot_hours": 3329, "copilot_hours_type": 119, "aircraft_hours": 23455, "circumstances": "Henson Airlines flight 1517 was cleared for an instrument approach to the Shenandoah Valley Airport, Weyers Cave, Virginia, at 0959 on September 23, 1985, after a routine flight from Baltimore-Washington International Airport, Baltimore, Maryland. Instrument meteorological conditions prevailed at Shenandoah Valley Airport. there were 12 passengers and 2 crew members aboard the scheduled domestic passenger flight operating under 14 CFR 135. Radar service was terminated at 1003. The crew of flight 1517 subsequently contacted the Henson station agent and Shenandoah unicom. The last recorded radar return was at 1011, at which time the airplane was east of the localizer course at 2,700 feet mean sea level and on a magnetic track of about 075°. At 1014 the pilot said, '..we're showing a little west of course...' and at 1015 he asked if he was east of course. At 1017, the controller suggested a missed approach if the airplane was not established on the localizer course. There was no response from the crew of flight 1517 whose last recorded transmission was at 1016. The wreckage of flight 1517 was located about 1842 approximately six miles east of the airport. Both crew members and all 12 passengers were fatally injured. ", "probable_cause": "The probable cause of this accident was a navigational error by the flightcrew resulting from their use of the incorrect navigational facility and their failure to adequately monitor the flight instruments.\r\nFactors which contributed to the flightcrew's errors were:\r\n- The non standardized navigational radio systems installed in the airline's Beech 99 fleet,\r\n- Intra cockpit communications difficulties associated with high ambient noise levels in the airplane,\r\n- Inadequate training of the pilots by the airline,\r\n- The first officer's limited multi engine and instrument flying experience,\r\n- The pilots' limited experience in their positions in the Beechcraft 99,\r\n- Stress inducing events in the lives of the pilots.\r\nAlso contributing to the accident was the inadequate surveillance of the airline by the Federal Aviation Administration which failed to detect the deficiencies which led to the accident."}