{"url": "https://www.baaa-acro.com/crash/crash-cessna-425-conquest-i-idaho-falls-2-killed", "date": "Nov 10, 2000 at 1215 LT", "type": "Cessna 425 Conquest", "operator": "Aerohawk Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Idaho Falls - Idaho Falls", "msn": "425-0172", "yom": 1983, "flight_number": null, "city": "Idaho Falls", "zone": "Idaho", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4027, "circumstances": "The accident aircraft had recently had maintenance work performed on its autofeather system pressure sensing switches, due to reports of the left engine not autofeathering properly in flight. The purpose of the accident flight was to verify proper inflight operation of the autofeather system following the maintenance work on the autofeather pressure sensing switches and a successful ground check of the autofeather system. Air traffic control (ATC) communications recordings disclosed that the pilot called ready for takeoff from runway 2 approximately 1207, and requested to orbit above the airport at 8,000 feet (note: the airport elevation is 4,740 feet.) The pilot subsequently reported established in a hold above the airport at 8,000 feet approximately 1213, and was instructed by ATC to report leaving the hold. Approximately 1215, an abbreviated radio transmission, \"zero five four,\" was recorded. The Idaho Falls tower controller responded to this call but never got a response in return from the accident aircraft, despite repeated efforts to contact the aircraft. Witnesses reported that the aircraft banked to the left, or to the west, and that it entered a spiral from this bank and crashed (one witness reported the aircraft was flying at 200 to 300 feet above ground level when it entered this bank, and that it performed a \"skidding\" or \"sliding\" motion part way through the bank, about 1 second before entering the spiral.) The aircraft crashed about 2 miles north of the airport. On-site examination disclosed wreckage and impact signatures consistent with an uncontrolled, relatively low-speed, moderate to steep (i.e. greater than 22 degrees) angle, left-wing-low impact on an easterly flight path. No evidence of flight control system malfunction was found, and a large quantity of jet fuel was noted to be aboard the aircraft. Post-accident examination of the aircraft's engines indicated that the left engine was most likely operating in a low power range and the right engine was most likely operating in a mid to high power range at impact, but no indications of any anomalies or distress that would have precluded normal operation of the engines prior to impact was found. Post-accident examination of the aircraft's propellers disclosed indications that 1) both propellers were rotating at impact, 2) neither propeller was at or near the feather position at impact, 3) both propellers were being operated with power at impact (exact amount unknown), 4) both propellers were operating at approximately 14º to 20º blade angle at impact, and 5) there were no propeller failures prior to impact. Post-accident examination of the autofeather pressure sensing switches disclosed evidence of alterations, tampering, or modifications made in the field on all but one switch (a replacement switch, which had been installed just before the accident flight during maintenance) installed on the aircraft at the time of the accident. All switches except for the replacement switch operated outside their design pressure specifications; the replacement switch operated within design pressure specifications. Examination of the switches indicated that all switches were installed in the correct positions relative to high- or low-pressure switch installations. Engineering analyses of expected autofeather system performance with the switches operating at their \"as-found\" pressure settings (vice at design pressure specifications) did not indicate a likelihood of any anomalous or abnormal autofeather system operation with the autofeather switches at their \"as-found\" pressure settings. Also, cockpit light and switch evidence indicated that the autofeather system was not activated at the time of impact. The combination of probable engine power and propeller pitch on the left engine (as per the post-accident engine and propeller teardown results) was noted to be generally consistent with the \"zero-thrust\" engine torque and propeller RPM settings specified for simulated single-engine practice in the aircraft Information Manual.", "probable_cause": "The pilot-in-command's failure to maintain adequate airspeed with an asymmetric thrust condition, resulting in a loss of aircraft control. A factor was an asymmetric engine thrust condition, which was present for undetermined reasons.\n"}