{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh89-dragon-rapide-folkestone-7-killed", "date": "Oct 2, 1934 at 1050 LT", "type": "De Havilland DH.89 Dragon Rapide", "operator": "Hillmans-Airways", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Croydon – Paris", "msn": "6251", "yom": 1934, "flight_number": null, "city": "Folkestone", "zone": "Kent", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While overflying The Channel, the pilot encountered poor weather conditions with light rain and fog. He decided to return but due to low visibility and while cruising under VFR mode in IFR conditions, he was unable to distinguish the water surface and eventually lost control of the aircraft that crashed into the sea some five km off Folkestone. All seven occupants were killed. First accident involving a De Havilland DH.89 Dragon Rapide.\r\nCrew:\r\nWalter Robert Bannister, pilot.\r\nPassengers:\r\nLouis Beigneuxl,\r\nJean Louis Bordaz,\r\nMiss Phyllis Budden,\r\nAndrew McGregor Ritchie,\r\nAlbert Paul de Sanno,\r\nHelene Slabodsky. ", "probable_cause": "UK Air Ministry attributed the cause of the accident to a lack of skill and knowledge in matters of navigation on the part of the pilot. Significantly, it was noted in the investigative report that he lacked both a navigator’s license and previous experience in instrument flying. Evidence indicated that the pilot had followed the coastline, remaining below the clouds, rather than proceeding on a direct compass course to his destination. Apparently losing sight of land while over the Channel, he may have turned back towards the west in order to once again make visual contact with the coast of England. It was theorized that while in a gradual descent through the mist he failed to distinguish the glassy surface of the water in time to avoid the accident. The crash was believed to have occurred fewer than 10 minutes after a second request from the pilot to Croydon Aerodrome for a position. However, the delay and ultimate failure to provide bearing information was not considered a contributing factor."}