{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-lanai-3-killed", "date": "Feb 26, 2014 at 2130 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Maui-Air", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lanai – Kahului", "msn": "31-7552124", "yom": 1975, "flight_number": null, "city": "Lanai", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4570, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12172, "circumstances": "The airplane departed during dark (moonless) night conditions over remote terrain with few ground-based light sources to provide visual cues. Weather reports indicated strong gusting wind from the northeast. According to a surviving passenger, shortly after takeoff, the pilot started a right turn; the bank angle continued to increase, and the airplane impacted terrain in a steep right bank. The accident site was about 1 mile from the airport at a location consistent with the airplane departing to the northeast and turning right about 180 degrees before ground impact. The operator's chief pilot reported that the pilot likely turned right after takeoff to fly direct to the navigational aid located southwest of the airport in order to escape the terrain induced turbulence (downdrafts) near the mountain range northeast of the airport. Examination of the airplane wreckage revealed damage and ground scars consistent with a high-energy, low-angle impact during a right turn. No evidence was found of preimpact mechanical malfunctions or failures that would have precluded normal operation. It is likely that the pilot became spatially disoriented during the right turn. Although visual meteorological conditions prevailed, no natural horizon and few external visual references were available during the departure. This increased the importance for the pilot to monitor the airplane's flight instruments to maintain awareness of its attitude and altitude. During the turn, the pilot was likely performing the additional task of engaging the autopilot, which was located on the center console below the throttle quadrant. The combination of conducting a turn with few visual references in gusting wind conditions while engaging the autopilot left the pilot vulnerable to visual and vestibular illusions and reduced his awareness of the airplane's attitude, altitude, and trajectory. Based on toxicology findings, the pilot most likely had symptoms of an upper respiratory infection but the investigation was unable to determine what effects these symptoms may have had on his performance. A therapeutic level of doxylamine, a sedating antihistamine, was detected, and impairment by doxylamine most likely contributed to the development of spatial disorientation.", "probable_cause": "The pilot's spatial disorientation while turning during flight in dark night conditions and terrain-induced turbulence, which resulted in controlled flight into terrain. Contributing to the accident was the pilot's impairment from a sedating antihistamine.\n"}