{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-36-marquise-nashville-1-killed", "date": "Sep 6, 1990 at 1131 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Tennessee Air", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Nashville - Murfreesboro", "msn": "665", "yom": 1975, "flight_number": null, "city": "Nashville", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 9379, "captain_hours_type": 5854, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6714, "circumstances": "On a previous flight, low power was noted in the right engine, the right engine fuel flow was 5 to 8 gal/hr less than the left engine and the right engine temperature (itt) was about 500° less than the left. A decision was made to ferry the aircraft to a maint facility to have the right engine examined. The pilot took off on a 5,186 feet runway (unrway 02C) with a light tail wind in 95° temperature, though the airport had longer runways (7,702 feet, 8,000 feet and 8,500 feet). A witness noted the aircraft lifted off at the end of the runway (charts showed the takeoff roll with normal power should have been about 3,100 feet). Witnesses reported the aircraft remained low (nearly hitting a 55 feet light standard) until it rolled right and 'dropped like a rock.' Impact occurred in a right wing low attitude about 2 miles from the departure end of runway 02C. The aircraft was extensively damaged by impact and fire; no preimpact part failure was found. Both engines had evidence of engine rotation at the time of impact. The operator's lead mechanic had reported for duty about 3 hours before the accident flight, but he had not been informed of the engine problem before the aircraft took off. The pilot, sole on board, was killed. ", "probable_cause": "The company/operator management's decision to operate the aircraft with a known deficiency without further maintenance, the pilot's improper planning/decision and the pilot's failure to abort the takeoff (while there was sufficient runway remaining). Factors related to the accident were: lack of power in the right engine, and the unfavorable meteorological conditions at the airport."}