{"url": "https://www.baaa-acro.com/crash/crash-cessna-208a-caravan-i-picton-5-killed", "date": "Jan 29, 1996 at 1627 LT", "type": "Cessna 208A Caravan", "operator": "Soundsair2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Wellington - Picton", "msn": "208-0051", "yom": 1985, "flight_number": null, "city": "Picton-Koromiko", "zone": "Marlborough District Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 1937, "captain_hours_type": 322, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Wellington, the pilot started the descent to Picton-Koromiko Airport in good weather conditions. On final, at an altitude of 1,700 feet, the single engine aircraft entered clouds and struck the slope of Mt Robertson located 10 nm northeast of Blenheim. All five occupants were killed and the pilot was seriously injured. ", "probable_cause": "The following causal factors were reported:\r\n- The decision by the pilot to descend beneath the cloud layer.\r\n- Illusions, created by the conditions, producing misleading visual references.\r\n- The pilot's misidentification of distant terrain features.\r\n- An undetected heading error, and loss of \"positional awareness\".\r\n- Insufficient forward visibility, during the later stages of the descent.\r\n- The high speed of the aircraft.\r\n- The decision making by the pilot: the delayed decision to descend beneath the cloud layer; continued flight into deteriorating conditions.\r\nThe following contributing factors were reported:\r\n- The pilot's familiarity with the area, creating a false sense of security.\r\n- Improved general weather conditions, causing the pilot to relax.\r\n- A possible false horizon, created by a sloping cloud base.\r\n- The absence of documented procedures to ensure pilots crossed the coast south of Rarangi."}