{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-giv-chicago-4-killed", "date": "Oct 30, 1996 at 1300 LT", "type": "Gulfstream GIV", "operator": "Alberto%20Culver_0", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago - Burbank", "msn": "1047", "yom": 1988, "flight_number": null, "city": "Chicago-Executive (Palwaukee)", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 17086, "captain_hours_type": 496, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2938, "circumstances": "The flightcrew of a Gulfstream G-IV began taking off on Runway 34 with a crosswind from 280° at 24 knots. About 1,340 feet after the takeoff roll began, the airplane veered left 5.14° to a heading of 335°. It departed the runway, and tire marks indicated no braking action was applied. One of the pilots said, \"Reverse,\" then one said, \"No, no, no, go, go, go, go, go.\" The airplane traversed a shallow ditch that paralleled the runway, which resulted in separation of both main landing gear, the left and right flaps, and a piece of left aileron control cable from the airplane. The airplane became airborne after it encountered a small berm at the departure end of the runway. Reportedly, the left wing fuel tank exploded. The main wreckage was located about 6,650 feet from the start of the takeoff roll. Examination of the airplane indicated no preexisting anomalies of the engines, flight controls, or aircraft systems. The Nose Wheel Steering Select Control Switch was found in the \"Handwheel Only\" position, and not in the \"Normal\" position. The pilot-in-command (PIC) routinely flew with the switch in the \"Normal\" position. The PIC and copilot (pilot-not-flying) comprised a mix crew in accordance with an Interchange Agreement between two companies which operated G-IV's. The companies' operation manuals and the Interchange Agreement did not address mixed crews, procedural differences, or aircraft difference training. ", "probable_cause": "Failure of the pilot-in-command (PIC) to maintain directional control of the airplane during the takeoff roll in a gusty crosswind, his failure to abort the takeoff, and failure of the copilot to adequately monitor and/or take sufficient remedial action to help avoid the occurrence. Factors relating to the accident included the gusty crosswind condition, the drainage ditch, the flight crew's inadequate preflight, the Nose Wheel Steering Control Select Switch in the \"Handwheel Only\" position, and the lack of standardization of the two companies' operations manuals and Interchange Agreement. "}