{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-25-dk-rio-de-janeiro-26-killed", "date": "Feb 25, 1960 at 1307 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Real-Aerovias-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Campos de Goytacazes – Rio de Janeiro", "msn": "13326", "yom": 1944, "flight_number": "RL751", "city": "Rio de Janeiro", "zone": "Rio de Janeiro", "country": "Brazil", "region": "South America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 22, "pax_fatalities": 22, "other_fatalities": 0, "total_fatalities": 26, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The R4D-6 left Buenos Aires at 0825LT on a flight to Rio de Janeiro, carrying a delegation of musicians who would take part to a ceremony dedicated to the official visit in Rio de Janeiro of the US President Eisenhower. At 12:56 the crew reported over the BAGRE fix, entering the Rio Approach Control zone. The plane then descended to 1500 m reaching the Ilha Rasa (IH) NDB at 13:05. The crew were then instructed to arrive over the RJ NDB at 1800 m altitude and continue to the KX NDB descending to 1500 m. At the KX NDB the plane could enter the approach path for Galeao Airport. At 13:07 the flight reported passing over RJ at 1800 m, but the plane was in fact still approaching the NDB! False radio compass indications in the area are not uncommon; they are influenced by a steel cable car in the area. REAL DC-3 PP-AXD had left Campos at 12:10 for a flight to Rio de Janeiro. The flight reported at the Porto das Caixas fix at 12:58. at 1650 m. He was told to head for the RJ NDB at 1800 m and was later cleared for 1500 m to carry out the Victor Procedure for an approach to Santos Dumont Airport. The DC-3 overflew the RJ NDB at 13:06 at 1700 m. While carrying out the standard 180° turn to the left, the DC-3 was hit on its right side in an upward direction by the US Navy DC-6. The collision occurred at about 1600 m; the DC-3 crashed into the bay just southeast of Sugar Loaf Mountain; the DC-6 crashed into the bay just north of the mountain.", "probable_cause": "According to the Brazilian Investigations Board, the accident was attributed to an error of the personnel (pilot of the DC-6) due to improper piloting procedure when flying on authorized instrument flight. The pilot disobeyed the instructions transmitted by Rio Approach Control. An investigation by the US Navy came to a different cause: The accident cannot be attributed to either of the aircraft involved, the manner in which either was operated, or to any\r\nsignificant actions or errors of the crews. The roles of the language problem, the lack of modern air navigation and control aids and the methods of aircraft traffic control used at Rio de Janeiro, although extremely material, do not attain the status of immediate causes of the accident according to the evidence adduced. Had these matters been different, in one or more respects favorable to greater air safety, this accident might have been avoided. These problems were, however, common to the flights of all aircraft in the area and were well known by the pilots and controller to exist. It is evident that uncertainty on the part of the controller as to the original position of the DC-3; his underestimation of the time factors, including aircraft reaction time; and his lack of appreciation of the communications difficulties and the increasing seriousness of the situation, combined to create the conditions which led to the collision."}