{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-99-rapid-city", "date": "Dec 29, 2006 at 0200 LT", "type": "Beechcraft 99 Airliner", "operator": "Alpine-Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Pierre - Rapid City", "msn": "U-155", "yom": 1974, "flight_number": "AIP408", "city": "Rapid City", "zone": "South Dakota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3652, "captain_hours_type": 3069, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 39795, "circumstances": "The airplane was on an instrument flight rules flight in night instrument meteorological conditions when the accident occurred. The airplane had been cleared for an ILS approach and the pilot elected to use a non-published procedure to intercept the final approach. After becoming established on the final approach, the airplane impacted the ground about 7 miles from the destination airport at an elevation approximately the same as the airport elevation. Flight inspections of the instrument approach performed prior to and subsequent to the accident revealed satisfactory performance of both the localizer and glideslope functions. The number one altimeter setting did not match the altimeter setting that was current at the time of the accident. Post accident examination of the altimeters revealed that the number one altimeter read 360 feet high. No determination was made as to whether the discrepancy existed prior to impact. However, the pilot did not report any pre-flight discrepancies with regard to the airplane's altimeters. No other anomalies were found or reported with regard to the airplane's structure or systems.\n", "probable_cause": "The pilot's failure to follow the published instrument approach procedure which contributed to his failure to maintain altitude and clearance from terrain during the instrument approach. A factor was the night light condition."}