{"url": "https://www.baaa-acro.com/crash/crash-learjet-25-saint-augustine", "date": "Jul 21, 2007 at 1410 LT", "type": "Learjet 25", "operator": "SK%20Jets", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Gainesville - Saint Augustine", "msn": "25-49", "yom": 1970, "flight_number": null, "city": "Saint Augustine", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4620, "captain_hours_type": 250, "copilot_hours": 2453, "copilot_hours_type": 368, "aircraft_hours": 15812, "circumstances": "About 5 miles from the destination airport, the flight was cleared by air traffic control to descend from its cruise altitude of 5,000 feet for a visual approach. As the first officer reduced engine power, both engines \"quit.\" The captain attempted to restart both engines without success. He then took control of the airplane, and instructed the first officer to contact air traffic control and advise them that the airplane had experienced a \"dual flameout.\" The captain configured the airplane by extending the landing gear and flaps and subsequently landed the airplane on the runway \"hard,\" resulting in substantial damage to the airframe. Both engines were test run following the accident at full and idle power with no anomalies noted. Examination of the airplane revealed that it was equipped with an aftermarket throttle\r\nquadrant, and that the power lever locking mechanism pins as well as the throttle quadrant idle stops for both engines were worn. The power lever locking mechanism internal springs for both the left and right power levers were worn and broken. Additionally, it was possible to repeatedly move the left engine's power lever directly into cutoff without first releasing its power lever locking mechanism; however, the right engine's power lever could not be moved to the cut off position without first releasing its associated locking mechanism. The right throttle thrust reverser solenoid installed on the airplane was found to be non-functional, but it is not believed that this component contributed to the accident. No explicit inspection or repair instructions were available for the throttle quadrant assembly. Other than the throttle quadrant issues, no other issues were identified with either the engines or airframe that could be contributed to both engines losing power simultaneously.", "probable_cause": "A loss of power on both engines for an undetermined reason."}