{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-fort-liard-3-killed", "date": "Oct 15, 2001 at 2233 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Deh Cho Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yellowknife – Fort Liard", "msn": "31-7852170", "yom": 1978, "flight_number": null, "city": "Fort Liard", "zone": "Northwest Territories", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1157, "captain_hours_type": 77, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11520, "circumstances": "A Piper PA-31 Navajo Chieftain, C-GIPB, serial number 31-7852170, departed Yellowknife, Northwest Territories, at 2043 mountain daylight time on a night instrument flight rules (IFR) charter flight to Fort Liard. One pilot and five passengers were on board. On arrival at Fort Liard, in conditions of moderate to heavy snow, the pilot initiated a non-directional beacon approach with a circling procedure for Runway 02. At about 2233, the aircraft struck a gravel bar on the west shoreline of the Liard River, 1.3 nautical miles short of the threshold of Runway 02, and 0.3 nautical mile to the left of the runway centreline. The aircraft sustained substantial damage, but no fire ensued. Three passengers were fatally injured, and the pilot and two passengers were seriously injured. The emergency locator transmitter activated and was received by the search and rescue satellite system, and two Canadian Forces aircraft were dispatched to conduct a search. The wreckage was electronically located the following morning, and a civilian helicopter arrived at the accident site approximately 10 hours after the occurrence.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. For undetermined reasons, the pilot did not maintain adequate altitude during a night circling approach in IMC and the aircraft struck the ground.\r\n2. The pilot and front seat passenger were not wearing available shoulder harnesses, as required by regulation, which likely contributed to the severity of their injuries.\r\nFindings as to Risk:\r\n1. The aircraft was not fitted with, and was not required to be fitted with, a GPWS or a radio altimeter.\r\n2. The pilot used an unauthorized remote altimeter setting that would have resulted in the cockpit altimeters reading approximately 200 feet higher than the actual altitude.\r\n3. The pilot did not meet the night recency requirements necessary to carry passengers, as specified in CAR 401.05 (2).\r\n4. Risk management responsibilities had been placed almost entirely on the pilot.\r\n5. While the company had taken the voluntary initiative to appoint a safety officer, and appeared to have a safety program in place, the program may not have been directed at the needs.\r\nOther Findings:\r\n1. Approximately 28 hours of flight time that the pilot had logged as multi-engine dual would not have qualified as flight experience for the issue of a higher license.\r\n2. CAR do not define 'flight familiarization', 'flight experience', or 'dual', and therefore do not address flight time 'quality'.\r\n3. Opportunities for local community searchers to identify and access the accident site earlier were hampered by initial inaccurate SARSAT location information, by the time required to locate SAR aircraft to the Fort Liard area, and by darkness and poor weather conditions.\r\n4. The decreased time required to alert the SAR system and the higher degree of accuracy permitted by the utilization of a 406 MHz ELT, particularly one interfaced with the onboard GPS, would have likely permitted rescuers to access the site in a more timely manner. \r\n5. 703 Air Taxi operations continue to have a much higher accident rate than 704 Commuter and 705 Airline operations."}