{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-100-hyannis-1-killed", "date": "Jun 18, 2008 at 1001 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Wiggins%20Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Hyannis - Nantucket", "msn": "47", "yom": 1967, "flight_number": "WIG6601", "city": "Hyannis-Barnstable", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3607, "captain_hours_type": 99, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 38185, "circumstances": "The pilot contacted air traffic control and requested clearance to taxi for departure approximately an hour after the scheduled departure time. About 4 minutes later, the flight\r\nwas cleared for takeoff. A witness observed the airplane as it taxied, and found it strange that the airplane did not stop and \"rev up\" its engines before takeoff. Instead, the airplane  taxied into the runway and proceeded with the takeoff without stopping. The airplane took off quickly, within 100 yards of beginning the takeoff roll, became airborne, and entered a steep left bank. The bank steepened, and the airplane descended and impacted the ground. Post accident examination of the wreckage revealed that the pilot's four-point restraint was not fastened and that at least a portion of the cockpit flight control lock remained installed on the control column. One of the pre-takeoff checklist items was, \"Flight controls - Unlocked - Full travel.\" The airplane was not equipped with a control lock design, which, according to the airframe manufacturer's previously issued service bulletins, would \"minimize the possibility of the aircraft becoming airborne when take off is attempted with flight control locks inadvertently installed.\" In 1990, Transport Canada issued an airworthiness directive to ensure mandatory compliance with the service bulletins; however, the Federal Aviation Administration did not follow with a similar airworthiness directive until after the accident.", "probable_cause": "The pilot's failure to remove the flight control lock prior to takeoff. Contributing to the accident was the Federal Aviation Administration's failure to issue an airworthiness directive making the manufacturer's previously-issued flight control lock service bulletins mandatory.\n"}