{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46a-45-cu-commando-bage-40-killed", "date": "Apr 7, 1957", "type": "Curtiss C-46 Commando", "operator": "Varig.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bagé – Porto Alegre", "msn": "30283", "yom": 1944, "flight_number": null, "city": "Bagé", "zone": "Rio Grande do Sul", "country": "Brazil", "region": "South America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 35, "pax_fatalities": 35, "other_fatalities": 0, "total_fatalities": 40, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Just after take-off, the pilot noticed an incipient fire in the left engine. Acting in accordance with airline regulations, he feathered the damaged engine, returning to the traffic pattern for a landing circuit and carrying out routine radio communications. On final approach, when he considered that a safe landing could be made, he operated the undercarriage lowering mechanism. Because of the intensity of th'e fire, which was in the undercarriage housing and not, as the pilot thought, in the engine, some parts must already have melted and the undercarriage did not respond to the mechanism. Apparently the critical situation had already passed, since the fire, although intense, was not producing much smoke. The pilot, therefore, decided to give full throttle, in order to avoid a belly landing. In this he was still following airline regulations. After this action, when the aircraft reached the intersection of runways 05 and 23, flames enveloped the left wing and detached it from the fuselage. The aircraft hit the ground and was destroyed. All occupants, 5 crew members and 35 passengers, were killed. ", "probable_cause": "The main cause of the accident was fire in the undercarriage housing and consequent breaking-off of the left wing in flight. A contributing cause was an error in judgment. The pilot failed to assess the intensity of the fire in the undercarriage housing, having thought that the fire was in the left engine and that by applying the procedure prescribed in \"Regulations for C-46\", the fire had been extinguished or had become inconsequential. "}