{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6-bryce-canyon-52-killed", "date": "Oct 24, 1947 at 1229 LT", "type": "Douglas DC-6", "operator": "United-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Los Angeles – Denver – Chicago", "msn": "42875", "yom": 1947, "flight_number": "UA608", "city": "Bryce Canyon", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 47, "pax_fatalities": 47, "other_fatalities": 0, "total_fatalities": 52, "captain_hours": 15000, "captain_hours_type": 136, "copilot_hours": 3046, "copilot_hours_type": 66, "aircraft_hours": 933, "circumstances": "Flight 608 departed Los Angeles, California, at 1023 with its destination Chicago, Illinois, to cruise at 19,000 feet according to visual flight rules. Routine position reports were made over Fontana, Daggett and Silver Lake, California; Las Vegas, Nevada; and Saint George, Utah. During the latter report, the flight indicated that it estimated passing over Bryce Canyon, Utah, at 1222. At 1221 Flight 608 reported that a fire had been detected in the baggage compartment which the crew was unable to extinguish. The report added that the cabin was filled with smoke and that the flight was attempting to make an emergency-landing at Bryce Canyon Airport. Shortly thereafter the flight again reported that the “tail is going out--we may get down and we may not.” At 1226 another transmission was received from the flight indicating that it was going into the “best place” available. One minute later the flight reported “we may make it--approaching a strip.” No further contact was had from the flight. Witnesses who observed the aircraft as it was approaching Bryce Canyon from approximately 20 miles southwest first observed what appeared to be white smoke streaming from the aircraft, followed later by dense black smoke. The first witnesses who observed fire in the bottom of the aircraft at approximately the center-section were located approximately 15 miles south of Bryce Canyon. Until shortly before the moment of impact, the aircraft appeared to be under normal control; however, no witnesses were located who observed the crash.", "probable_cause": "The Board determines that the probable cause of this accident was the combustion of gasoline which had entered the cabin heater air intake scoop from the No. 3 alternate tank vent due to inadvertent overflow during the transfer of fuel from the No. 4 alternate tank. Contributing factors were the improper location of the No. 3 alternate tank air vent outlet and the lack of instructions provided DC-6 flight crews concerning hazards associated with fuel transfer.\r\nThe failure of the manufacturer and the Civil Aeronautics Administration to exercise full caution in the analysis of the fuel system of the DC-6 relative to proper location of fuel tank vents to provide non-hazardous location for fuel drainage, as required by existing regulations, and the insufficient attentiveness on the part of the manufacturer, the Civil Aeronautics Administration, and the air carriers to the procedures of fuel management employed by pilots operating DC-6 aircraft, were contributing factors."}