{"url": "https://www.baaa-acro.com/crash/crash-learjet-c-21a-ellsworth-afb-2-killed", "date": "Feb 2, 2002 at 1430 LT", "type": "Learjet C-21A", "operator": "United%20States%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Ellsworth AFB - Ellsworth AFB", "msn": "35-543", "yom": 1984, "flight_number": "Pacer 43", "city": "Ellsworth AFB", "zone": "South Dakota", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The mishap aircraft, call sign Pacer 43, was conducting pattern work operations during an off-station training mission at Ellsworth AFB, SD (RCA). Shortly before impact, the mishap crew was conducting a simulated single-engine approach to runway 31 at Ellsworth AFB. Subsequent analysis showed that there was a significantly greater amount of fuel in the left wing and left wing tip tank than the right. The gross fuel imbalance resulted from an unmonitored transfer of fuel from the right wing and right wing tip tank to the left that was initiated by the crew approximately nine and one-half minutes before impact. As the aircraft approached the point when it would normally transition to a flare, it leveled off and began a climbing turn to the west, toward the tower. It did not touch down prior to the turn, but veered left immediately during the flare, and then rolled back to wings level momentarily as it climbed. The heavier left wing, and application of power to the right engine for the go-around, caused the aircraft to roll back into a steeper left turn, stayed in a climbing left turn with the bank continuing to increase until il rolled through more than 90 degrees of bank. As the aircraft reached the highest point of the climb (approximately 450 feet), the bank angle was more than 90 degrees, and perhaps slightly inverted as the nose dropped and the aircraft began to descend. The aircraft impacted the ground in a grassy field.", "probable_cause": "The crew's failure to follow flight manual procedures for fuel transfer. As a result, the mishap aircraft experienced a fuel imbalance significant enough to cause the aircraft to enter an unsafe roll to the left from which the pilot was not able to recover."}