{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-17g-105-ve-flying-fortress-aurora", "date": "Jun 13, 2011 at 0947 LT", "type": "Boeing B-17 Flying Fortress", "operator": "Liberty Foundation", "flight_phase": "Takeoff (climb)", "flight_type": "Demonstration", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Aurora - Aurora", "msn": "8643", "yom": 1944, "flight_number": null, "city": "Aurora-Sugar Grove", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The weekend before the accident, a fuel leak was identified. The fuel leak was subsequently repaired, and a final inspection the morning of the accident flight reportedly did not reveal any evidence of a continued fuel leak. Shortly after takeoff, the flight crew noticed a faint odor in the cockpit and a small amount of smoke near the radio room. The flight crew immediately initiated a turn with the intention of returning to the departure airport. About that time, they received a radio call from the pilot of the accompanying airplane advising that there was a fire visible on the left wing. The accident pilot subsequently executed an emergency landing to a corn field. Emergency crews were hampered by the muddy field conditions, and the fire ultimately consumed significant portions airframe. In-flight photographs showed the presence of fire on the aft lower portion of the left wing between the inboard and outboard engines. Located in the same area of the fire were fuel tanks feeding the left-side engines. After landing, heavy fire conditions were present on the left side of the airplane, and the fire spread to the fuselage. A postaccident examination noted that the C-channel installed as part of the No. 1 main fuel tank repair earlier in the week was partially separated. During the examination, the tank was filled with a small amount of water, which then leaked from the aft section of the repair area in the vicinity of the partially separated channel. Metallurgical examination of the repair area revealed a longitudinal fatigue crack along the weld seam. The fatigue nature of the crack was consistent with a progressive failure along the fuel tank seam that existed before the accident flight and was separate from the damage sustained in the emergency landing and postlanding fire. The repair earlier in the week attempted to seal the leak but did not address the existing crack itself. In fact, the length of the crack observed at the time of the repair was about one-half the length of the crack noted during the postaccident examination, suggesting that the crack progressed rapidly during the course of the accident flight. Because the repaired fuel tank was positioned within the open wing structure, a fuel leak of significant volume would have readily vaporized, producing a flammable fuel vapor/air mixture. Although the exact ignition source could not be determined due to the  fire damage, it is likely that the fuel vapor and liquid fuel encountered hot surfaces from nearby engine components, which initiated the in-flight fire.", "probable_cause": "An inadequate repair of the fuel tank that allowed the fuel leak to continue, ultimately resulting in an inflight fire."}