{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130-hercules-c1p-lashkar-gah", "date": "May 24, 2006 at 1530 LT", "type": "Lockheed C-130 Hercules", "operator": "Royal-Air-Force-4", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kabul - Lashkar Gah", "msn": "4231", "yom": 1967, "flight_number": null, "city": "Lashkar Gah", "zone": "Helmand", "country": "Afghanistan", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 20, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The RAF Hercules was on a routine operational flight providing support to the Provincial Reconstruction Team (PRT) at Lashkar Gar, Afghanistan at the time of the accident. The LKG Tactical Landing Zone (TLZ) is 6,800 feet long by 150 feet wide with a surface of compacted sand and gravel located on the south side of LKG town. The TLZ is used by UK forces and other agencies including the UN and Red Cross. The aircraft took off at 08:50 UTC from Kabul International Airport (KBL) to fly a routine logistics sortie to deliver cargo and personnel to LKG TLZ. After an uneventful medium level transit the aircraft landed at LKG at 10:20 UTC. Using a standard tactical landing technique the aircraft touched down some 500ft in from the runway threshold, reverse thrust was selected and speed reduced without the need for wheel braking. After 3 seconds, as the speed was nearing 70 kts there was a loud bang from the port side of the aircraft in the vicinity of the port main landing gear, the force of which was felt throughout the aircraft. At the same time the flight deck crew saw tyre debris flying up in front of the aircraft and then became aware of structural damage to the number 2 engine. The captain ordered the Emergency Engine Shutdown Drill (EESD) on the number 2 engine. He maintained directional control with nosewheel steering. Immediately after the shutdown of number 2 engine crew members observed a large amount of fuel leaking from the port wing area in the vicinity of the external tank pylon and that there was a fire in the vicinity of No.1 engine. The captain ordered the shut down of the No.1 engine using the EESD. Whilst this drill was carried out crew members observed that the fire was spreading across the whole wing. Realising the severity of the situation the captain brought the aircraft to a halt near the northern end of the landing zone some 6,400 feet from the touchdown point. He ordered the passengers and crew to immediately carry out the Emergency Evacuation Drill. Once all personnel had evacuated the aircraft, fire rapidly destroyed the aircraft and cargo.", "probable_cause": "The Board concluded that XV206 was destroyed after detonating an explosive device that was buried in the surface of the LKG TLZ. After extensive investigation the Board concluded that the device was an anti-tank landmine. This resulted in aircraft debris puncturing the port wing fuel tanks, causing a major leak of fuel that ignited, leading to an uncontrollable fire originating in the port wing in the vicinity of the n°1 engine.\r\nThe Board concluded that the following contributed to the loss of XV206:\r\na. The lack of permanent force protection at LKG TLZ allowed uncontrolled access to persons wishing to carry out a hostile act;\r\nb. The TLZ clearance procedures proved to be inadequate for detecting subsurface mines."}