{"url": "https://www.baaa-acro.com/crash/crash-cessna-501-citation-isp-lord-howe-island", "date": "Apr 22, 1990 at 1225 LT", "type": "Cessna 501 Citation I", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sydney - Lord Howe", "msn": "501-0145", "yom": 1974, "flight_number": null, "city": "Lord Howe Island", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was being used for a pleasure flight for the owner and some friends. The Captain calculated the landing distances required for both runway 28 and 10, based on weather reports obtained at briefing, which indicated a strong northerly wind component. An updated report received some 30 minutes before descent confirmed the wind as 290 degrees at 7 knots. Approaching the island and becoming visual, the crew noted the windsock near the western end of the runway to be indicating a slight headwind component in the 10 direction and decided on a straight in approach to runway 10, to avoid an approaching squall/shower. The aircraft touched down firmly a short distance beyond the threshold. Speed brakes were immediately extended and wheel braking applied. About four seconds later the Captain called for the drag chute to be deployed. Although the co-pilot correctly activated the handle, it became obvious that the chute had not deployed as no increase in retardation occurred. When the Captain realised that the aircraft could not be stopped on the runway remaining he attempted to turn the aircraft towards a clear grass area to the right. However, the aircraft was aquaplaning on the wet surface and did not respond to steering inputs for some distance. The aircraft left the bitumen tracking to the right. It collided with a gable marker, passed through a fence, continued down an embankment, across a road, through a second fence and came to rest approximately 90 metres from the runway end and 70 metres to the right of the extended centreline. The left main and nose gear legs were torn off. Witnesses to the accident said that when the aircraft landed, the runway was very wet and the wind was westerly at 5 to 10 knots. ", "probable_cause": "It was determined that the Captain had made some miscalculations in his pre-flight assessments. He had noted the landing distance available as being the same for both runways, whereas runway 28 has a reduced length due to terrain clearance requirements on the approach. Under the conditions both forecast and prevailing, and using the criteria applicable at the time for an aircraft fitted with an alternate means of retardation, i.e. drag chute, the landing distances required for both runways were greater than the landing distances available. The Captain had also evidently applied incorrect techniques during the landing. He had not attempted to deploy the drag chute immediately the nose wheel was on the ground, and had not applied unmodulated pressure to the anti-skid braking system. These measures are required by the manufacturer to obtain maximum performance. It was found that the drag chute canister lid had been sealed with tank sealant and painted over. The latch assembly had operated but the drogue chute spring was insufficiently strong to break the seal. When the sealant was prised away from around the lid, the system operated normally. This error had not been found during a check of the aircraft immediately following repainting. The lid had the appearance of an oblong radio antenna and was not marked in any distinguishing manner. The problem should also have been noticed during a subsequent inspection of the drag chute for moisture. The inspection is required every 90 days if the drag chute has\r\nnot been deployed, and requires the removal of the lid and drogue chute in order to feel the main chute for moisture. The condition of the sealant would indicate that this had not been carried out. \r\nThe following factors were considered relevant to the development of the accident:\r\n- Inadequate pre-flight planning and preparation by the flight crew. The runway distance required was in excess of the distance available on either runway.\r\n- Adverse runway and weather conditions - wet surface and downwind component.\r\n- Improper sealing of drag chute canister.\r\n- Inadequate maintenance of the drag chute system.\r\n- Improper operation of wheel brakes."}