{"url": "https://www.baaa-acro.com/crash/crash-boeing-767-375er-anahuac-3-killed", "date": "Feb 23, 2019 at 1239 LT", "type": "Boeing 767-300", "operator": "Atlas%20Air", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Miami - Houston", "msn": "25685/430", "yom": 1992, "flight_number": "5Y3591", "city": "Anahuac", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 11172, "captain_hours_type": 1252, "copilot_hours": 5073, "copilot_hours_type": 520, "aircraft_hours": 91063, "circumstances": "On February 23, 2019, at 1239 central standard time, Atlas Air Inc. (Atlas) flight 3591, a Boeing 767-375BCF, N1217A, was destroyed after it rapidly descended from an altitude of about 6,000 ft mean sea level (msl) and crashed into a shallow, muddy marsh area of Trinity Bay, Texas, about 41 miles east-southeast of George Bush Intercontinental/Houston Airport (IAH), Houston, Texas. The captain, first officer (FO), and a nonrevenue pilot riding in the jumpseat died. Atlas operated the airplane as a Title 14 Code of Federal Regulations Part 121 domestic cargo flight for Amazon.com Services LLC, and an instrument flight rules flight plan was filed. The flight departed from Miami International Airport (MIA), Miami, Florida, about 1033 (1133 eastern standard time) and was destined for IAH. The accident flight’s departure from MIA, en route cruise, and initial descent toward IAH were uneventful. As the flight descended toward the airport, the flight crew extended the speedbrakes, lowered the slats, and began setting up the flight management computer for the approach. The FO was the pilot flying, the captain was the pilot monitoring, and the autopilot and autothrottle were engaged and remained engaged for the remainder of the flight. Analysis of the available weather information determined that, about 1238:25, the airplane was beginning to penetrate the leading edge of a cold front, within which associated windshear and instrument meteorological conditions (as the flight continued) were likely. Flight data recorder data indicated that, during the time, aircraft load factors consistent with the airplane encountering light turbulence were recorded and, at 1238:31, the airplane’s go-around mode was activated. At the time, the accident flight was about 40 miles from IAH and descending through about 6,300 ft msl toward the target altitude of 3,000 ft msl. This location and phase of flight were inconsistent with any scenario in which a pilot would intentionally select go-around mode, and neither pilot made a go-around callout to indicate intentional activation. Within seconds of go-around mode activation, manual elevator control inputs overrode the autopilot and eventually forced the airplane into a steep dive from which the crew did not recover. Only 32 seconds elapsed between the go-around mode activation and the airplane’s ground impact. \n", "probable_cause": "The NTSB determines that the probable cause of this accident was the inappropriate response by the first officer as the pilot flying to an inadvertent activation of the go-around mode, which led to his spatial disorientation and nose-down control inputs that placed the airplane in a steep descent from which the crew did not recover. Contributing to the accident was the captain’s failure to adequately monitor the airplane’s flightpath and assume positive control of the airplane to effectively intervene. Also contributing were systemic deficiencies in the aviation industry’s selection and performance measurement practices, which failed to address the first officer’s aptitude-related deficiencies and maladaptive stress response. Also contributing to the accident was the Federal Aviation Administration’s failure to implement the pilot records database in a sufficiently robust and timely manner."}