{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-414-hudson-i-raf-silloth-3-killed", "date": "Jan 4, 1943 at 1028 LT", "type": "Lockheed L-414 Hudson", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Silloth - Silloth", "msn": "414-1704", "yom": 1940, "flight_number": null, "city": "Silloth AFB", "zone": "Cumbria", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was involved in a training exercise including single engine practice. En route, the aircraft stalled and crashed into the Solway Firth, few hundred yards off shore. All three crew members were killed. \r\nCrew (1st OTU):\r\nSgt D. J. Wearne, pilot,\r\nSgt Leo Francis Ryan, navigator,\r\nP/O R. D. Hall.\r\nSource: Alan Storr Compilation", "probable_cause": "A Report into the accident, the Wg Cdr RAF Silloth stated : “ I commenced giving Wearne a check dual on Hudson N7308 previous to him flying solo. The behaviour of the aircraft was normal in every way. After about one hours flying I authorised Wearne to carry out various solo practices including single engine flying. I am quite satisfied that this pilot was quite competent to carry out the practices detailed. The pupil was a good average pilot who had been flying quite well that morning. I consider that the faulty handling of the engine controls referred to by the Investigating Officer caused the Pilot to pay too much attention to the engines, and not enough to the flying of the aircraft. with the result that the pilot stalled the aircraft and ‘spun in’. The Air Cdre Group Commander stated “ I do not agree with the findings of the Investigating Officer, as there is no evidence to justify the assumption that the cause of the accident was ‘due to the faulty handling of the engine controls.’ In my opinion the accident was caused by engine failure but the reason for the failure must remain a mystery.”\r\nSource: \r\nhttp://static.awm.gov.au/images/collection/pdf/RC09125_022--1-.pdf "}