{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6a-new-york-20-killed", "date": "Feb 1, 1957 at 1802 LT", "type": "Douglas DC-6", "operator": "Northeast%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Miami", "msn": "44678", "yom": 1955, "flight_number": "NE823", "city": "New York-LaGuardia", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 95, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": 16630, "captain_hours_type": 85, "copilot_hours": 8943, "copilot_hours_type": 17, "aircraft_hours": 8317, "circumstances": "Northeast Airlines Flight 8232 a DC-6A, N34954, was scheduled to originate at La Guardia Field, a nonstop to Miami, Florida, with a departure time of 1445. This aircraft and the same crew operating as Flight 822, had arrived at LaGuardia from Miami at 1250. The crew consisted of Captain Alva V. R. Marsh, First Officer Basil S. Dixwell, Flight Engineer Angelo V. Andon, and Stewardesses Doris Steele, Catherine Virchow, and Emily Gately. A short time before the scheduled departure time the crew and passengers boarded the aircraft. Snow, which had started at LaGuardia at 1202, began to accumulate on the aircraft's horizontal surfaces after its arrival at the LaGuardia ramp position. Snow removal by ground personnel, during preflight, was ineffective because of the continuing snowfall. Accordingly, about 1600 the aircraft was taxied, with all occupants aboard, to a nose hangar on the west side of the airport for snow removal. This was accomplished and at 1745 the crew advised LaGuardia ground control that they were ready to taxi from the nose hangar for the IFR, departure to Miami. Flight 823 was then cleared to runway 4 and was advised that the wind was northeast 10, the altimeter setting 30.12, and a time check of 1747-1/2. Air Route Traffic Control cleared the flight as follows. \"Cleared to Bellemead, maintain 7,000 feet.\" A supplementary climb-out clearance was then given: \"After takeoff, a left turn direct Paterson, direct Chatham, cross 081-degree radial of Caldwell 4,000 feet or above, cross Paterson between 5,000 and 6,000 feet and cross the northwest course of Idlewild not above 6,000 feet.\" Both clearances were repeated and acknowledged. Takeoff clearance was issued at 1800 and a tower controller saw the aircraft airborne at approximately 1801.2 The controller advised the flight to contact LaGuardia radar departure control on 120.4 mcs. This message was acknowledged but the radar controller did not receive a call from the flight; however, he did observe a target on the scope that indicated an aircraft over the runway. The next two sweeps on the scope disclosed the target beyond the end of the runway. A subsequent sweep indicated that the target was turning left. The target then disappeared from the scope. The LaGuardia tower controllers observed a large flash at approximately 1802 in the vicinity of Rikers Island, the approximate center of which is about one mile north of the point where the aircraft left the runway. It was learned at 1819, by telephone, that Northeast Airlines Flight 823 had crashed on Rikers Island. The airplane was destroyed by a post crash fire and 20 passengers were killed. ", "probable_cause": "The Board determines that the probable cause of the accident was the failure of the captain to (1) properly observe and interpret his flight instruments and (2) maintain control of his aircraft. The following findings were reported: \r\n- The weather at the time of takeoff was above the prescribed company minimums,\r\n- The aircraft, immediately following takeoff, made a left turn of approximately 119 degrees and a descent,\r\n- The pilot and flight crew did not observe or interpret any instrument indication of a left turn or descent,\r\n- The heading indications of both fire-seized course indicators corresponded closely to the impact heading of the aircraft,\r\n- These instruments had been functioning properly until the time of impact,\r\n- There was no failure or malfunction of the powerplants,\r\n- There was no airframe failure or control malfunction,\r\n- There was no electrical power failure or malfunction of instruments prior to ground impact,\r\n- There was no fire prior to ground impact,\r\n- As a result of fuselage deformation the main cabin door jammed, hindering evacuation of passengers,\r\n- The main cabin lighting system became Inoperative during deceleration and the emergency inertia lights did not actuate."}