{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2b-21-islander-near-fort-de-france-6-killed", "date": "Jul 17, 1994 at 2145 LT", "type": "Britten-Norman Islander", "operator": "Trans%20Island%20Air%202000", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Bridgetown - Fort-de-France", "msn": "2152", "yom": 1983, "flight_number": null, "city": "Fort-de-France", "zone": "Martinique", "country": "Martinique", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 2000, "captain_hours_type": 1400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On Monday July 18 1995 at 00h45 UTC, expressed in local time as Sunday July 17 at 20h45, the Trans Island Air Britten-Norman BN2B registered as 8P-TAD, took off from Grantley Adams airport (Barbados) bound for Fort de France (Martinique) with one pilot and five passengers on board. The flight had been preceded by another aircraft, registered as 8P-TAC, of the same type and belonging to the same company, flying the same route. These flights were undertaken on a charter basis on behalf of Société Nouvelle Air Martinique. They were carrying passengers originally scheduled to fly on a Dornier 228 which was out of service, and which was supposed to undertake scheduled flight PN403. At 01h39, at the request of the approach controller, the pilot announced his estimated arrival time over the FOF beacon at 01h47. At 01h40 the pilot said that he was at 2700 feet, thus at the minimum arrival altitude in that sector, still on the 150 radial from FOF; he stated that he had the field in sight and requested permission to make a visual approach. At 01h42, at the request of the controller, the pilot confirmed that he had the field in sight and obtained clearance for a visual approach. At 01h45, the pilot of 8P-TAD transmitted for the last time. At 01h48, he no longer responded to the controller's calls. At 01h58, the DETRESFA phase of the search and rescue procedure was initiated. On July 19 1994 at around 08h30, a day and a half after the accident, the wreckage of the aircraft was found in the Carbet hills, near Piton Lacroix in the\r\ncommune of Bellefontaine.", "probable_cause": "The accident was caused by the pilot's failure to identify the airdrome installations before the start of the night visual approach procedure under an IFR flight plan. The probable failure of the onboard DME and the imprecise navigation contributed to the accident."}