{"url": "https://www.baaa-acro.com/crash/crash-grumman-s-2-tracker-generac-1-killed", "date": "Aug 2, 2019 at 1718 LT", "type": "Grumman S-2 Tracker", "operator": "Securite%20Civile", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Plain, Valley", "schedule": "Nîmes - Nîmes", "msn": "456", "yom": 1958, "flight_number": "Pélican 22", "city": "Générac", "zone": "Gard", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4854, "captain_hours_type": 830, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15050, "circumstances": "The pilot, sole on board, departed Nîmes-Garons Airport at 1648LT on a fire fighting mission over Générac, a village located about 5 km southwest of the airbase. While approaching the zone to be treated, the twin engine airplane struck trees and crashed, bursting into flames. The aircraft was destroyed by impact forces and a post crash fire and the pilot was killed. At the time of the accident, the visibility was reduced due to thick smoke. ", "probable_cause": "The following findings were identified:\r\n- GASC (Groupement d’avions de la sécurité civile) has a small resource of Tracker pilots;\r\n- Without a co-pilot, the pilot is deprived of the usual cross-checking of piloting decisions and actions;\r\n- The pilot has little experience on established firefighting missions. He has never carried out a mission of this nature in a single-pilot aircraft;\r\n- Certain limitations of the flight envelope are unknown to pilots, particularly at high weight and in steep turns;\r\n- Pilots have little knowledge of the aerological phenomena associated with certain fires, and the associated turbulence;\r\n- With the implementation of the Tracker withdrawal, pilots are concerned about their future within the GASC;\r\n- Fatigued from sustained activity, the pilot had a false understanding of the situation;\r\n- The pilot suffered from overconfidence;\r\n- The pilot did not perceive the terrain. He flew a little low as he approached the hill ;\r\n- He adopted a trajectory very close to the flame front and did not anticipate the risk of turbulence;\r\n- Focused on a dwelling to protect, he did not detect the inappropriate altitude of his plane and maintained a strong bank;\r\n- The left wing underwent a local stall causing a steep left bank, which caused the pilot to recover the aircraft too low in relation to the height of the trees, which he had a false idea of."}