{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-11f-shanghai-3-killed", "date": "Nov 28, 2009 at 0814 LT", "type": "McDonnell Douglas MD-11", "operator": "Avient", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Shanghai - Bishkek", "msn": "48408/457", "yom": 1990, "flight_number": "SMJ324", "city": "Shanghai-Pudong", "zone": "Shanghai", "country": "China", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The three engine aircraft departed Shanghai-Pudong Airport on a cargo flight to Bishkek, carrying various goods and seven crew members. During the takeoff roll from runway 35L, the pilot-in-command initiated the rotation but the aircraft did not lift off properly with had a negative vario. It overran the runway and eventually crashed in an open field. Three crew were killed while four others were injured. The aircraft was totally destroyed. ", "probable_cause": "The crew did not properly operate the thrust levers so that the engines did not reach take off thrust. The aircraft had not reached Vr at the end of the runway and could not get airborne. According to the design criteria of the MD11 the crew needs to push at least two thrust levers to beyond 60 degrees, which will trigger autothrust to leave \"CLAMP\" mode and adjust the thrust to reach the target setting for takeoff, the servo motors would push the thrust levers forward in that case. During the accident departure the pilot in the left seat did not advance the thrust levers to more than 60 degrees, hence the server motors did not work although autothrust was engaged but remained in CLAMP mode and thus did not adjust the thrust to reach takeoff settings. The crew members perceived something was wrong. Audibly the engine sound was weak, visibibly the speed of the aircraft was low, tactically the pressure on the back of the seat was weaker than normal. Somebody within the crew, possibly on the observer seats, suggested the aircraft may be a bit heavy. The T/O THRUST page never appeared (it appears if autothrust is engaged and changes from CLAMP to Thrust Limit setting. Under normal circumstances with autothrust being engaged a click sound will occur as soon as the thrust levers reach the takeoff thrust position. A hand held on the thrust levers will feel the lever moving forward, however, the crew entirely lost situational awareness. None of the anomalies described in this paragraph prompted the crews members' attention. When the aircraft approached the end of the runway several options were available: reject takeoff and close the throttles, continue takeoff and push the throttle to the forward mechanical stop, continue takeoff and immediately rotate. The observer called \"rotate\", the captain rotated the aircraft. This shows the crew recognized the abnormal situation but did not identify the error (thrust levers not in takeoff position) in a hurry but reacted instinctively only. As the aircraft had not yet reached Vr, the aircraft could not get airborne when rotated. As verified in simulator verification the decision to rotate was the wrong decision. The simulator verification showed, that had the crew pushed the thrust levers into maximum thrust when they recognized the abnormal situation, they would have safely taken the aircraft airborne 670 meters before the end of the runway. The verification also proved, that had the crew rejected takeoff at that point, the aircraft would have stopped before the end of the runway. The crew did not follow standard operating procedures for managing thrust on takeoff. The crew operations manual stipulates that the left seat pilot advances the thrust levers to EPR 1.1 or 70% N1 (depending on engine type), informs the right seat pilot to connect autothrust. The pilot flying subsequently pushes the thrust levers forward and verifies they are moving forward on servos, the pilot monitoring verifies autothrust is working as expected and reaches takeoff thrust settings. In this case the left seat pilot not only did not continue to push the thrust levers forward, but also called out \"thrust set\" without reason as he did not verify the takeoff thrust setting had been achieved. It is not possible to subdivide the various violations of procedures and regulations. The crew had worked 16 hours during the previous sector. In addition, one crew member needed to travel for 11 hours from Europe to reach the point of departure of the previous sector (Nairobi Kenya), two crew members need to travel for 19 hours from America to the point of departure of the previous sector. These factors caused fatigue to all crew members. The co-pilot was 61 years of age, pathological examination showed he was suffering from hypertension and cardiovascular atherosclerosis. His physical strength and basic health may have affected the tolerance towards fatigue. All crew members underwent changes across multiple time zones in three days. Although being in the period of awakeness in their biological rhythm cycle, the cycle was already in a trough period causing increased fatigue. The captain had flown the Airbus A340 for 300 hours in the last 6 months, which has an entirely different autothrust handling, e.g. the thrust levers do not move with power changes in automatic thrust, which may have caused the captain to ignore the MD-11 thrust levers. The co-pilot in the right hand seat had been MD-11 captain for about 7 years but had not flown the MD-11 for a year. Both were operating their first flight for the occurrence company. The two pilots on the observer seats had both 0 flight hours in the last 6 months. The co-pilot (right hand seat) was pilot flying for the accident sector. The captain thus was responsible for the thrust management and thrust lever movement according to company manual. A surviving observer told the investigation in post accident interviews that the captain was filling out forms and failed to monitor the aircraft and first officer's actions during this critical phase of flight. There are significant design weaknesses in the MD-11 throttle, the self checks for errors as well as degree of automation is not high.\r\nSource: Aviation Herald/Simon Hradecky"}