{"url": "https://www.baaa-acro.com/crash/crash-cessna-t303-crusader-annecy", "date": "Dec 4, 2020 at 1550 LT", "type": "Cessna 303 Crusader", "operator": "303 Flyers", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Marseille - Annecy", "msn": "303-00058", "yom": 1981, "flight_number": null, "city": "Annecy-Meythet", "zone": "Haute-Savoie", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1077, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine airplane departed Marseille-Provence Airport on a private flight to Annecy. En route, while cruising at FL110, the pilot was informed about the weather conditions at destination with a braking coefficient considered as medium due to a wet runway. After being cleared to land on runway 04, the pilot continued the approach but landed half way down the runway at a speed of 119 knots. After touchdown, he initiated the braking procedure but the airplane suffered an aquaplaning and was unable to stop within the remaining distance. It overran, impacted an embankment, went trough a fence and came to rest on a road. While both passengers aged 26 and 28 were slightly injured, the pilot aged 70 was seriously injured. The aircraft was destroyed.", "probable_cause": "The accident was the result of the combination of the following factors: \r\n- The pilot initiated the descent too late, causing the aircraft to approach well above the glide,\r\n- The pilot continued the approach with an unstabilized airplane nor in speed nor on the glide,\r\n- The airplane landed halfway down the runway, reducing the landing distance available, \r\n- The speed upon touchdown was recorded at 119 knots, 30 knots above the recommended speed in the flight manual, \r\n- The braking coefficient was considered as medium because of a wet runway surface, \r\n- The airplane suffered an aquaplaning effect when the pilot initiated the braking procedure. "}