{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24a-950-orari-gorge-1-killed", "date": "Apr 13, 1987 at 1700 LT", "type": "Fletcher FU-24", "operator": "Rowley%20Aviation", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": null, "msn": "201", "yom": 1974, "flight_number": null, "city": "Orari Gorge", "zone": "Canterbury Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "ZK-DZA was engaged in an aerial topdressing operation at Orari Gorge Station, situated about 16 km north-northwest of the small town of Geraldine in Canterbury. The day's work had commenced at 08:12 and by 16:30 100 tonnes of superphosphate fertilizer had been distributed over the farm in about 100 sorties. These operations had been uneventful apart from two instances of the engine stopping while idling on the ground. One of these events occurred at the start up after the lunch break and the other was after the halt taken at about 16:30 to enable the attachment of a Transland spreader unit to the plane. The pilot was unconcerned at these unwanted stoppages as the engine had a tendency to do this in warm ambient temperatures, and he attributed it to \" vapour lock \". At about 16:55 the pilot took off again to spread a mixture of 575 kg of selenium pellets and between 100 and 150 kg of superphosphate over a higher area of the farm. The aircraft weight and CG were within the permitted limits. About five minutes later the loader driver heard \" a thump \" and on looking around sighted the plane on the side of a hill about one kilometer northwest of his location. The driver immediately radioed base to get them to inform the station manager that a crash had occurred. There was one eyewitness to the accident. A farmer working about 4 km away saw the Fletcher flying away from him and dropping a short trail of fertilizer before making \" a funny move sideways \" and then coming to a stop on the ground. He immediately returned to his house and telephoned Orari Gorge Station to raise the alarm. Station personnel arrived at the crash scene by 4WD vehicle within ten or fifteen minutes. They found the aircraft wrecked and the pilot dead. Fire had not occurred. The crash site was on a steep grassy slope 1,700 feet amsl. The aircraft had contacted the ground in roughly a landing attitude, at high rate of sink, and drifting to the left. It was severely damaged, with the main undercarriage legs separated and the nose leg folded back under the fuselage. The engine was displaced and the spreader torn off. Of the rest of the airframe only the tail section remained intact. Deceleration was rapid.The ground slide covered a distance of sixteen metres. This was not a survivable accident.", "probable_cause": "The weather was calm with only high cloud. Examination of the engine revealed no evidence that it may have lost power in flight. An autopsy carried out on the pilot showed that he had received a broken neck and a ruptured heart in the impact. He was suffering from a moderately severe coronary heart disease at the time of death. The crash investigator concluded that this very experienced pilot may have had a heart attack and been seriously incapacitated in flight, prompting him to attempt an immediate emergency landing on the hillside."}