{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-deland-5-killed", "date": "Oct 7, 1987 at 1150 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Blackwing Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "DeLand - Punta Gorda", "msn": "421B-0043", "yom": 1970, "flight_number": null, "city": "DeLand", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 18000, "captain_hours_type": 0, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2600, "circumstances": "The aircraft was observed to be flying slowly, then roll steeply to the left and dive into an unoccupied house from about 300 feet shortly after takeoff. The pilot had considerable flight time but he had not flown this model, except for a 35 minutes checkout that morning. The checkout consisted of 3 takeoffs and landings. The pilot's friend, a rated pilot without a multi engine rating, sat in the right cockpit seat and had logged flight time in the pilot's other twin aircraft. A witness stated the pilot looked pale and appeared troubled just before the flight. The autopsy of the pilot revealed the left main coronary artery was blocked except for a 'pinhole' opening. The doctor stated the condition could have caused a seizure but could not say whether it had any bearing on this accident. No evidence could be found to indicate any preimpact malfunction or failure with the airframe, propellers, or engines. The aircraft was estimated to be 134 pounds over gross weight. All five occupants were killed. ", "probable_cause": "Occurrence #1: loss of control - in flight\r\nPhase of operation: takeoff - initial climb\r\nFindings\r\n1. (f) aircraft weight and balance - exceeded - pilot in command\r\n2. (c) airspeed - not maintained - pilot in command\r\n3. Physical impairment (other cardiovascular) - pilot in command\r\n4. (c) stall - inadvertent - pilot in command\r\n----------\r\nOccurrence #2: in flight collision with object\r\nPhase of operation: descent - uncontrolled\r\nFindings\r\n5. Object - residence"}