{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-237b-mumbai-213-killed", "date": "Jan 1, 1978 at 2041 LT", "type": "Boeing 747-200", "operator": "Air-India", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Bombay - Dubaï", "msn": "19959", "yom": 1971, "flight_number": "AI855", "city": "Mumbai-Chhatrapati Shivaji (Santa Cruz)", "zone": "Maharashtra", "country": "India", "region": "Asia", "crew_on_board": 23, "crew_fatalities": 23, "pax_on_board": 190, "pax_fatalities": 190, "other_fatalities": 0, "total_fatalities": 213, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After takeoff from Bombay-Santa Cruz Airport runway 27, while climbing by night at an altitude of 2,400 feet, the captain contacted ATC and wished a Happy New Year. He was cleared to climb to 8,000 feet and initiated a turn to the right according to departure procedures. Once the turn was finished and the aircraft was leveling, the captain realized his Attitude Director Indicator (ADI) was still showing a right-bank indication. The copilot confirmed his ADI was correct and the flight engineer noticed the difference between the captain's ADI and the third ADI system. Despite these two confirmation, the captain started a turn to the left as he thought the aircraft was still in a right-bank attitude. The airplane entered a left turn to an angle of 40° then until an excessive angle of 108° when control was lost. From an altitude of 2,000 feet, the airplane entered a dive and crashed into the Arabian Sea. The airplane disintegrated on impact and all 213 occupants were killed. Most of the debris were found in shallow water about 3 km offshore. Control was lost as the pilot-in-command was flying over the sea by night without any visual references with the ground. ", "probable_cause": "The probable cause of this accident was due to the irrational control wheel inputs given by the captain following complete unawareness of the attitude of the aircraft on his part after Attitude Director Indicator (ADI) had malfunctioned. The crew failed to gain control based on the other flight instruments. He had failed to determine the attitude of the aircraft with the associated flight instruments including Standby Horizon Indicator. The co-pilot had failed to monitor the flight instruments and did not render any assistance to the captain in ascertaining the attitude of the aircraft."}