{"url": "https://www.baaa-acro.com/crash/crash-nord-262a-36-clarksburg-2-killed", "date": "Feb 12, 1979 at 1300 LT", "type": "Nord 262", "operator": "Allegheny-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Clarksburg – Washington DC", "msn": "48", "yom": 1968, "flight_number": "AL561", "city": "Clarksburg", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 22, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4028, "captain_hours_type": 528, "copilot_hours": 7474, "copilot_hours_type": 474, "aircraft_hours": 9140, "circumstances": "On February 12, 1979, Allegheny Airlines Flight 561 (N29824) had originally departed Benedum Airport, Clarksburg, West Virginia, for Morgantown, West Virginia, at 1116, but the pilot decided not to make an approach at Morgantown because the instrument landing system's (ILS) glide slope was out of service, and the visibility was 1/2 mi. Thereafter the flight returned to Benedum Airport and landed at 1146. The aircraft was on the ground for about 1 hr 14 min at Benedum Airport. During that time the aircraft was refueled to 3,000 lbs of Jet-A fuel (1,500 lbs in each wing tank), and all surfaces were deiced with a mixture of unheated ethylene glycol and water. Although the Safety Board could not determine the precise time of deicing, the persons involved stated that it was performed between 1220 and 1235. The persons involved stated that it was performed between 1220 and 1235. The persons who deiced the plane stated that there was no snow or ice on the aircraft when they finished decing it. Flight 561 was rescheduled as a passenger flight from Benedum Airport to National Airport, Washington, D.C. There were 22 passengers and a crew of 3 on board. Before the captain started the engines for taxiing, the station agent asked him if he wanted the aircraft deiced again, since it was still snowing. The captain declined the offer and about 1257 he taxied the aircraft from the parking ramp. According to the station agent, the aircraft had about 1/4 in. of wet snow on all its horizontal surfaces when it left the parking ramp. He said that some of the snow blew off as the aircraft moved toward the departure runway, but some of the snow appeared to stick to the aircraft's horizontal surfaces. Twelve of the passengers recalled that shortly after liftoff, the aircraft rolled to the right, back to the left, and back to the right. After the last roll, the right wingtip struck the ground and impact followed shortly thereafter. The aircraft crashed in an inverted position off the right side of the departure end of runway 21. According to other witnesses, the ground roll appeared normal. The Clarksburg Tower local controller said that he saw Flight 561 taxi to runway 21, and he cleared the flight for takeoff. He saw the aircraft during takeoff until it reached taxiway D, which is about 1,000 ft from the tower, but he did not see the aircraft after that point. He had spoken with the captain by telephone before the takeoff and had given him the 1215 special observation weather. He also radioed the same weather to Flight 561 when it was taxiing for takeoff. He stated that he saw no snow on the aircraft but that moderate snow was falling at the time. The Clarksburg approach controller said that he saw Flight 561 as it turned to line up for takeoff on runway 21. He watched the aircraft through binoculars and saw nothing abnormal as the takeoff roll began. He thought the aircraft was rotated about 1,900 ft down the runway and the liftoff appeared to him to be normal. He lost sight of the aircraft at 50 ft of altitude because of the poor visibility. He recalled that during Flight 561's takeoff, the runway lights were set at their highest intensity. He also stated that he saw no snow blow off the aircraft during its takeoff roll. Shortly after the aircraft disappeared from his view, he heard the sound of an emergency locator transmitter on 121.5 MHz. He asked the Cleveland Center controller if Flight 561 had established contact with him. Since his reply was negative, the approach controller closed the airport and activated the airport emergency plan. The control tower chief observed Flight 561 during takeoff. He lost sight of the aircraft when it was at an altitude of about 20 ft above the runway. At that time the aircraft's attitude appeared to be normal. A pilot in the terminal restaurant said that when the aircraft left the parking ramp, he saw about 1/2 to 1 in. of snow on the wing and tail surfaces of the aircraft. He said that the takeoff appeared normal; but, just before the aircraft disappeared into the overcast, it appeared to pitch up sharply. Another witness who had experience as a pilot was located on taxiway C about 75 ft from the runway. He thought the aircraft lifted off about 200 to 300 ft past taxiway C. Shortly after liftoff, he saw the right wing of the aircraft dip about 45°, then the left wing dipped about the same amount, and the right wing dipped again before the aircraft disappeared from his view about 100 ft above the runway. Shortly thereafter, he heard two separate and distinct sounds of impact. The witness heard no unusual engine noises from the aircraft. The aircraft crashed during daylight hours at an elevation of 1,203 ft ms1. A passenger and a crew member were killed while 23 other occupants were injured, some of them seriously. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of the accident was the captain's decision to take off with snow on the aircraft's wing and empennage surfaces which resulted in a loss of lateral control and a loss of lift as the aircraft ascended out of ground effect. The following findings were reported: \r\n- The aircraft had been deiced 20 to 30 min before takeoff; however, about 1/4 in. of wet snow had accumulated on the top of the wings and horizontal stabilizer before the captain taxied the aircraft for takeoff,\r\n- The captain of Flight 561 did not insure that the aircraft's wings, stabilizing surfaces, and control surfaces were clean and free of snow before he began the takeoff roll,\r\n- Shortly after liftoff, the aircraft became laterally unstable; it rolled to the right, then to the left, back to the right, and its right wing struck the runway,\r\n- The snow adhering to the outboard sections of the wing probably caused those sections to stall prematurely,\r\n- The stalling of the outboard sections of the wings caused a loss of lift and significantly reduced the effectiveness of the ailerons, which resulted in lateral control problems and lateral instability,\r\n- The lateral oscillation of the aircraft further decreased lift and caused the aircraft to lose altitude and crash,\r\n- One passenger was fatally injured because her seatbelt was not fastened,\r\n- The accident was marginally survivable for the flight crew because the cockpit structure was crushed inward, which reduced the occupiable space, particularly for the first officer."}