{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3c-s1c3g-unalaska-2-killed", "date": "Jan 23, 2001 at 2135 LT", "type": "Douglas DC-3", "operator": "Majestic Air Cargo", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Unalaska - Anchorage", "msn": "25309", "yom": 1944, "flight_number": null, "city": "Unalaska", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 15000, "captain_hours_type": null, "copilot_hours": 3000, "copilot_hours_type": null, "aircraft_hours": 55877, "circumstances": "A Douglas DC-3 airplane departed an island runway during dark night, VFR conditions without filing a flight plan. The airplane collided with a volcanic mountain at 1,500 feet msl on the runway heading, 4.5 miles from the airport. Earlier in the day, the airplane arrived from Anchorage, Alaska, without a flight plan, having flown along the Alaska Peninsula when VFR flight was not recommended. The crew of the airplane initially planned to remain overnight on the peninsula, but the captain received a request to transport cargo to Anchorage. The airplane was loaded with cargo and fuel, and departed. The crew did not file a flight plan. The end of the departure runway is positioned at the edge of an ocean bay. Beyond the end of the runway, open water and rising volcanic island terrain are present. In the area of intended flight, no illumination of the terrain, or any ground based lighting was present. An obstacle departure procedure for the departure runway recommends a right turn at 2 DME from the runway heading, and then a climb to 7,000 feet. Forty-five minutes after departure, a fire was spotted on the side of a volcano cone, and an ELT signal was detected in the area. No company flight following procedures were found for the accident flight, and the airplane was not reported overdue until the following day. The day after the accident, the airplane wreckage was located on steep, snow-covered terrain. Due to high winds and blowing snow, a rescue team could not get to the accident site until three days after the crash. The captain was the president, the director of operations, and the sole corporate entity of the company. No current maintenance records, flight logs, or pilot logs were located for the company. In the past, the captain's pilot certificate was suspended for 45 days following an accident in a DC-3 airplane when he ran out of gas. Also, the captain's medical certificate had previously been considered for denial after serving 49 months in federal prison for cocaine distribution, but after review, the FAA issued the captain a first class medical. FAA medical records for the captain do not contain any record of monitoring for substance abuse. The first officer's medical had also been considered for denial after an episode of a loss of consciousness. After a lengthy review and an appeal to the NTSB, the FAA issued the first officer a second-class medical. The first officer was part of the flight crew when the captain ran out of gas, and she had two previous aviation accidents. A toxicological examination of the captain, conducted by the FAA, found cocaine and metabolites of cocaine. A toxicological examination of the first officer found two different prescription antidepressant drugs. The FAA prohibits narcotic and mood-altering drug use by pilots.", "probable_cause": "The airplane flightcrew's failure to maintain adequate distance/altitude from mountainous terrain during a departure climb to cruise flight, and the captain's impairment from drugs. Factors in the accident were dark night conditions, and the first officer's impairment from drugs."}