{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-8-106-nuuk", "date": "Mar 4, 2011 at 1609 LT", "type": "De Havilland DHC-8-100 (Dash-8)", "operator": "Flugfelag-Islands-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Reykjavik - Kulusuk - Nuuk", "msn": "337", "yom": 1992, "flight_number": "FXI223", "city": "Nuuk (Godthåb)", "zone": "Kommuneqarfik Sermersooq", "country": "Greenland", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 31, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8163, "captain_hours_type": 44, "copilot_hours": 4567, "copilot_hours_type": 1130, "aircraft_hours": 32336, "circumstances": "The flight crew got visual contact with the runway at BGGH and decided to deviate to the right (west) of the offset localizer (LLZ) to runway 23. The flight continued towards the runway from a position right of the extended runway centerline. As the aircraft approached runway 23, it was still in the final right turn over the landing threshold. The aircraft touched down on runway 23 between the runway threshold and the touchdown zone and to the left of the runway centerline. The right main landing gear (MLG) shock strut fuse pin sheared leading to a right MLG collapse. The aircraft skidded down the runway and departed the runway to the right. Neither passengers nor crew suffered any injuries. The aircraft was substantially damaged. The accident occurred in daylight under visual meteorological conditions (VMC).", "probable_cause": "Findings:\r\n- The licenses and qualifications held by the flight crew, flight and duty times, the documented technical status of the aircraft and the aircraft mass and balance had no influence on the sequence of events\r\n- The flight crew planned the flight from BGKK to BGGH with the destination alternate BGSF\r\n- The latest BGGH TAF before departure from BGKK indicated marginal weather conditions (strong winds, low visibility and low cloud base) for a successful approach and landing at BGGH\r\n- The forecasted weather conditions at the expected approach time at BGGH were below preplanning minima (use of two destination alternate aerodromes)\r\n- The actual weather conditions at BGGH and enroute weather briefings were equivalent to the forecasted weather conditions\r\n- With reference to the operator’s aerodrome and procedure briefing and the latest reported wind conditions from Nuuk AFIS before landing, a landing was prohibited\r\n- Strong winds and moderate to severe orographic turbulence from the surrounding mountainous terrain increased the flight crew load\r\n- On approach, the flight crew had difficulties of maintaining stabilized approach parameters\r\n- The flight crew most likely suffered from task saturation and information overload\r\n- No flight crew call outs on divergence from the operator’s stabilized approach policy were made\r\n- An optimum crew resource management was not present\r\n- Important low altitude stabilized approach parameters like airspeed, bank angle and runway alignment were not sufficiently corrected\r\n- The flight crew was solely focused on landing and task saturation mentally blocked a decision of going around\r\n- A divergence from the operator’s stabilized approach policy caused an unstabilized approach and a hard landing leading to an excess load of the right MLG at touchdown\r\n- The right MLG fuse pin sheared as a result of overload\r\nFactors:\r\n- A divergence from the operator’s stabilized approach policy caused an unstabilized approach and a hard landing leading to an excess load of the right MLG at touchdown\r\n- The right MLG fuse pin sheared as a result of stress\r\nSummary:\r\nAdverse wind and turbulence conditions at BGGH led to flight crew task saturation on final approach and a breakdown of optimum cockpit resource management (CRM) resulting in a divergence from the operator’s stabilized approach policy.\r\nThe divergence from the operator’s stabilized approach policy caused an unstabilized approach and a hard landing leading to an excess load of the right MLG at touchdown. According to its design, the right MLG fuse pin sheared as a result of stress."}