{"url": "https://www.baaa-acro.com/crash/crash-yakovlev-yak-42-verbovichi-132-killed", "date": "Jun 28, 1982 at 1051 LT", "type": "Yakovlev Yak-42", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Leningrad - Kiev", "msn": "11 04 01 04", "yom": 1981, "flight_number": "SU8641", "city": "Verbovichi", "zone": "Gomel voblast", "country": "Belarus", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 124, "pax_fatalities": 124, "other_fatalities": 0, "total_fatalities": 132, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 795, "circumstances": "Enroute from Leningrad to Kiev, the crew was cleared to descend from 9,000 to 7,800 meters in order to avoid a thunderstorm area. Few minutes later, the three engine aircraft entered a dive. During an uncontrolled descent, the aircraft lost several elements then partially disintegrated and eventually crashed at a speed of 810 km/h in fields and wooded areas. A huge crater was found at the point of impact, near the village of Verbovichi, and debris scattered all around on an area of 22,7 km2 (6,5 km long and 3,5 km wide). The accident was not survivable. ", "probable_cause": "It was determined that the crew lost control of the airplane after the jackscrew connected to the stabilizers mechanism failed due to an abnormal wear and also a structural imperfection of its mechanism. This caused the stabilizers to move down and to remain blocked in the down position. Despite several attempts, the crew was unable to regain control of the aircraft. Aerodynamic forces caused few elements of the airplane to brake off as they exceeded their certification. Investigations revealed that it was not possible for those in charge of the Yak-42 maintenance to detect the jackscrew abnormal wear because of an incomplete maintenance program. Similar problems were found on other Yak-42 and its certificate of airworthiness was suspended during investigations. Following modifications and updates, the Yak-42 came back into service at the end of the year 1984. "}