{"url": "https://www.baaa-acro.com/crash/crash-raytheon-390-premier-ia-samedan-2-killed", "date": "Dec 19, 2010 at 1502 LT", "type": "Raytheon 390 Premier I", "operator": "Windrose-Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Zagreb - Samedan", "msn": "RB-249", "yom": 2008, "flight_number": "GQA631V", "city": "Samedan", "zone": "Graubünden", "country": "Switzerland", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4306, "captain_hours_type": 244, "copilot_hours": 1071, "copilot_hours_type": 567, "aircraft_hours": 1047, "circumstances": "After an uneventful flight, the IFR flight plan was cancelled at 13:53:09 UTC and the flight continued under visual flight rules. When the crew were requested at 13:54:01 UTC by the Zurich sector south air traffic controller (ATCO) to switch to the Samedan Information frequency, they wanted to remain on the frequency for a further two minutes. The aircraft was on a south-westerly heading, approx. 5 km south of Zernez, when the crew informed the ATCO at 13:57:12 UTC that they would now change frequency. After first contact with Samedan Information, when the crew reported that they were ten miles before the threshold of runway 21, the aircraft was in fact approximately eight miles north-east of the threshold of runway 21. When at 13:58:40 UTC the crew of a Piaggio 180 asked the flight information service officer (FISO) of Samedan Information about the weather as follows: \"(…) and the condition for inbound still ok?\", the crew of D-IAYL responded at 13:58:46 UTC, before the FISO was able to answer: \"Yes, for the moment good condition (…)\". D-IAYL was slightly north-east of Zuoz when the crew asked the FISO about the weather over the aerodrome. D-IAYL was over Madulein when at 13:59:46 UTC the FISO informed the crew that they could land at their own discretion. Immediately afterwards, the crew increased their rate of descent to over 2200 ft/min and maintained this until a final recorded radio altitude (RA) of just under 250 ft, which they reached over the threshold of runway 21. The crew then initiated a climb to an RA of approximately 600 ft, turned a little to the left and then flew parallel to the runway centre line. The landing gear was extended and the flaps were set to 20 degrees with a high probability. At the end of runway 21 the crew initiated a right turn onto the downwind leg, during which they reached a bank angle of 55 degrees; in the process their speed increased from 110 to 130 knots. Abeam the threshold of runway 21, the crew turned onto the final approach on runway 21. The bank angle in this turn reached up to 62 degrees, without the speed being noticeably increased. The aircraft then turned upside down and crashed almost vertically. Both pilots suffered fatal injuries on impact. A power line was severed, causing a power failure in the Upper Engadine valley. An explosion-type fire broke out. The aircraft was destroyed.", "probable_cause": "The accident is attributable to the fact that the aircraft collided with the ground, because control of the aircraft was lost due to a stall. \r\n- The following causal factors have been identified for the accident: \r\n- The crew continued the approach under weather conditions that no longer permitted safe control of the aircraft\r\n- The crew performed a risky manoeuvre close to ground instead of a consistent missed approach procedure\r\n- The fact that the flight information service did not consistently communicate to the crew relevant weather information from another aircraft was a contributing factor to the genesis of the accident\r\nAs a systemic factor that contributed to the genesis of the accident, the following point was identified:\r\n- The visibility and cloud bases determined on Samedan airport were not representative for an approach from Zernez, because they did not correspond to the actual conditions in the approach sector.\n"}