{"url": "https://www.baaa-acro.com/crash/crash-lockheed-18-56-lodestar-madison", "date": "Jan 11, 1983 at 1450 LT", "type": "Lockheed 18 LodeStar", "operator": "Georgia South America", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Madison - Miami", "msn": "2183", "yom": 1941, "flight_number": null, "city": "Madison", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15245, "captain_hours_type": 28, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10823, "circumstances": "The pilot reported that after he taxied to the rwy, the n°1 oil temperature was not up to the minimum temperature. He set the parking and advanced the n°1 throttle to 1,500 rpm until the engine warmed up. When both oil temperatures were within limits, he advanced both throttles to 30 inches manifold pressure and 2,250 rpm for a pretakeoff check. At that time, he used the normal (toe) brakes, since the parking brake would not hold the aircraft above approximately 1,700 rpm. He then applied full power and released the brakes for takeoff. As he started to roll with a slight left crosswind, the aircraft began drifting left. He corrected with right rudder, some right brake and right aileron. The aircraft then began drifting right and the pilot suspected a wind-shift from that direction. He applied left rudder and right aileron, but the plane veered right, went off the runway and headed for a ditch. Unable to stop, the pilot tried to clear the ditch. As the aircraft became airborne, the left wing dropped and hit the ground, and the aircraft yawed and crashed. The parking brake was found partially engaged. Tire marks were evident on the runway. All four occupants escaped uninjured. ", "probable_cause": "Occurrence #1: loss of control - on ground/water\r\nPhase of operation: takeoff - roll/run\r\nFindings\r\n1. (c) parking brakes - inadvertent use - pilot in command\r\n2. (f) lack of total experience in type of aircraft - pilot in command\r\n3. (f) weather condition - crosswind\r\n4. (f) directional control - not maintained - pilot in command\r\n5. (f) ground loop/swerve - uncontrolled - pilot in command\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: takeoff\r\nFindings\r\n6. (f) terrain condition - ditch\r\n7. (f) lift-off - initiated - pilot in command\r\n8. (f) stall/mush"}