{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-san-pedro-8-killed", "date": "Apr 1, 1991 at 1510 LT", "type": "Cessna 402", "operator": "Tropic%20Air-3_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Belize City - San Pedro", "msn": "402B-0827", "yom": 1975, "flight_number": null, "city": "San Pedro", "zone": "Belize", "country": "Belize", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4202, "circumstances": "On approach to San Pedro Airport runway 06, the aircraft was number 2 for landing. A Cessna 207, V3-HER was ahead and had broadcast its intention to land. A Tropic Air Twin Otter, call sign Tango Alfa, on the ground, requested that N402BL go around to allow Tango Alfa to takeoff because the ramp was full. N402BL acknowledged and was seen making a left turn with wheels down. No further communication was heard from N402BL. The aircraft was seen flying very low with wheels down and flaps down in a southerly direction and as it crossed the shoreline south of the airstrip the aircraft made a sharp left turn and crashed into the sea about 200 yards from the beach at approximately 1500 hours. The aircraft struck nose first then righted itself and sank in water about five feet deep. There was no fire. Boats in the vicinity reached the accident site within a few minutes and reported that all eight occupants were dead inside the aircraft.", "probable_cause": "There is no evidence which permits the investigation to determine with certainty the actual cause of the accident. It is considered a reasonable deduction that:\r\n- The pilot was unfit for flight due to fatigue, \r\n- He stalled the aircraft while flying very low down wind with landing gear down, \r\n- The aircraft was much too low to recover from the stall. "}