{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-246f-port-harcourt-1-killed", "date": "Nov 27, 2001 at 0156 LT", "type": "Boeing 747-200", "operator": "MK%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Luxembourg – Port Harcourt – Johannesburg", "msn": "22063", "yom": 1980, "flight_number": null, "city": "Port Harcourt", "zone": "Rivers", "country": "Nigeria", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 80500, "circumstances": "The aircraft departed Luxembourg-Findel Airport on a cargo flight to Johannesburg with an intermediate stop in Port Harcourt, carrying nine passengers, four crew members and a load consisting of almost 60 tons of electronics. On a night approach to Port Harcourt Airport, the copilot who was the pilot-in-command failed to comply with the company published procedures and carried a non-standard autopilot approach, tracking a localizer radial inbound and descending using the vertical speed mode as reference. On short final, the crew failed to realize his altitude was insufficient when the aircraft struck the ground 700 metres short of runway. The undercarriage was torn off and the aircraft slid for few dozen metres before coming to rest with its front section that broke away, bursting into flames. A crew member was killed, seven occupants were injured and five escaped uninjured. The aircraft was partially destroyed by fire. ", "probable_cause": "Wrong approach configuration on part of the flying crew which resulted in a controlled flight into terrain after the crew failed to comply with several published procedures. It was determined that the copilot was the pilot-in-command while the operator policy stipulated that approached to Port Harcourt must be completed by captain only. The following findings were identified:\r\n- It was defined in the operational procedures that the autopilot could not be used below the altitude of 2,000 feet on approach but the copilot failed to comply with,\r\n- Poor crew coordination, \r\n- There were no calls on final approach between both flying and non flying pilots, \r\n- The crew suffered a lack of situational awareness following a misinterpretation of the visual references on approach."}