{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-monroe-3-killed", "date": "Mar 29, 2011 at 1604 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Triple F Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bedford – Monroe", "msn": "46-36402", "yom": 2006, "flight_number": null, "city": "Monroe-Custer", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1600, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 851, "circumstances": "A witness reported and radar data showed the airplane approaching the runway at a higher‐than‐normal speed. As the airplane leveled low over the runway, the propeller began striking the runway surface. The damage from repetitive propeller strikes resulted in a loss of the thrust and airspeed necessary for flight. The airplane impacted the ground and subsequently caught fire. The postaccident examination of the wreckage confirmed that the airplane was configured with the landing gear and flaps retracted. No mechanical anomalies were observed that would have precluded normal operation of the airplane. Weight and balance estimates of the airplane indicated that the pilot was operating the airplane outside of its certified weight and center of gravity limits. Forensic toxicology performed on the pilot showed the presence of Hydrocodone and Dihydrocodeine, indicative of the pilot using disqualifying sedating cough or pain medications. These medications can impair performance in high workload environments. The level of medication found in the pilot’s blood at the time of the accident could not be determined. Additionally, Nortriptyline was detected in the pilot’s tissues. While the medications could have had degrading effects on the pilot’s performance, the investigation was not able to determine what role they may have played in the accident sequence.", "probable_cause": "The pilot's demonstration of poor judgment by attempting a high‐speed pass several feet above the runway and his subsequent failure to maintain clearance from the runway."}