{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-560f-venice-1-killed", "date": "Dec 26, 2011 at 1406 LT", "type": "Rockwell Aero Commander 560", "operator": "Millenium Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Venice - LaFayette", "msn": "560-1305-58", "yom": 1964, "flight_number": null, "city": "Venice", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6000, "captain_hours_type": 1500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5826, "circumstances": "The airplane departed and was climbing to an assigned altitude when the pilot informed an air traffic controller of a loss of engine power on the left engine. The pilot received radar vectors back to the departure airport and reported the airport in sight. There was no further communication with the controller. Review of radar data revealed that the airplane was about 825 feet from and 200 feet above the landing runway threshold. Seventeen seconds later, the airplane was at 100 feet above ground level and left of the intended landing runway. The last radar return was 5 seconds later, and the airplane was at 200 feet above ground level. A witness observed the airplane in the vicinity of landing runway. The airplane pitched straight up, stalled, spun to the left three times before it collided with the ground and caught fire. Postcrash examination of the airframe and flight controls revealed no anomalies. The left engine was disassembled and all connecting rods were intact except for the No.2 connecting rod. Metallugical examination of the connecting rod revealed that the bearing failed, most likely due to a progressive delamination of the bearing. Review of the  airplane flight manual revealed a minimum of 300 feet of altitude is required to recover from power-off stalls with 7500 pounds at both forward and aft center of gravity. The stall speed with the landing gear and flaps up with 0 degree angle of bank is 83 miles per hour or 72 knots. The stall speed with the landing gear extended and the flaps down is 73 miles per hours or 63 knots.", "probable_cause": "The pilot’s failure to maintain adequate airspeed during a single-engine approach, which resulted in an aerodynamic stall. Contributing to the accident was the total loss of power in the left engine due to a failed No. 2 connecting rod bearing.\n"}