{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-sandspit", "date": "Nov 12, 2002 at 2052 LT", "type": "Cessna 550 Citation II", "operator": "Canada%20Jet%20Charters", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Vancouver - Sandspit", "msn": "550-0561", "yom": 1987, "flight_number": null, "city": "Sandspit", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4550, "captain_hours_type": 1450, "copilot_hours": 3300, "copilot_hours_type": 850, "aircraft_hours": null, "circumstances": "The aircraft departed Vancouver International Airport, British Columbia, on a medical evacuation flight to the Sandspit Airport in the Queen Charlotte Islands, British Columbia. On board the aircraft were two pilots and a team of two Advanced Life Support Paramedics. When the aircraft arrived at Sandspit, the surface wind was strong, gusty, and across the runway. The crew conducted an instrument approach to Runway 30, and just before touchdown the aircraft's nose pitched down; the captain believed that the nosewheel, and then the main gear, collapsed as the aircraft slid on its belly. The crew carried out an evacuation and proceeded to the airport terminal building. When they returned to the aircraft to retrieve their belongings, the crew discovered that the gear was in the up position, as was the landing gear selector. The accident occurred at 2052 Pacific standard time. There were no injuries. The aircraft was substantially damaged.", "probable_cause": "Findings as to causes and contributing factors:\r\n1. The crew did not complete the before-landing checks, ignored aural warnings, and did not lower the landing gear, which resulted in a gear-up landing.\r\nFindings as to risk:\r\n1. The aircraft was not equipped with a GPWS, which could have prevented this accident.\r\n2. The before-landing checklist in use did not reflect the AFM requirement that the speed brakes should be retracted prior to 50 feet."}