{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-ketchikan-5-killed", "date": "Jul 24, 2007 at 1405 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Taquan%20Air-2", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Ketchikan - Ketchikan", "msn": "1100", "yom": 1957, "flight_number": null, "city": "Ketchikan", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 5273, "captain_hours_type": 178, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17356, "circumstances": "The air taxi float-equipped airplane was the second of three airplanes on an air tour flight over a remote scenic area in southeast Alaska. As the flight of three airplanes flew into mountainous terrain, the first pilot reported low clouds, with rain and fog, which required him to descend to 700 feet msl to maintain VFR flight conditions. The pilot of the third tour airplane, which was about 5 minutes behind the accident airplane, stated that as he approached the area around the accident site, he encountered \"a wall of weather\" which blocked his intended flight route, and he turned around. The accident airplane's fragmented wreckage was discovered in an area of steep, tree-covered terrain, about 2,500 feet msl, near the area where the third airplane turned around. The NTSB discovered no mechanical problems with the airplane during postaccident inspections. An NTSB weather study revealed instrument meteorological conditions in the area at the time of the accident. Photographs recovered from a passenger's camera depicted deteriorating weather conditions as the flight progressed. A charter boat captain, who had seen numerous float-equipped tour airplanes operating in adverse weather conditions, called the local FAA Flight Standards District Office (FSDO) 9 days before the accident, to report his sightings. According to the FAA, no specific tour operator could be identified during their ensuing investigation, and no enforcement actions or additional surveillance of any operators was initiated. According to the FSDO manager, the local FSDO had lost inspectors due to downsizing. He reported they had not attempted to observe operators' adherence to weather minimums via ground-based viewing locations along the heavily traveled tour routes, and noted that FAA inspectors used to purchase air tour tickets to provide en route, on-board surveillance, but had not done so for approximately the last 10 years. He noted that additional inspector assistance from other FAA offices was not requested", "probable_cause": "The pilot's decision to continue under visual flight rules into an area of instrument metrological conditions. Contributing to the accident was the pilot's inadequate weather evaluation, and the FAA's inadequate surveillance of the commercial air tour operator. "}