{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-miami-1-killed", "date": "Dec 10, 2017 at 1450 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Carman W. Rollo", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Miami - Miami", "msn": "61-0161-082", "yom": 1974, "flight_number": null, "city": "Miami-Executive (Kendall-Tamiami)", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3576, "circumstances": "Before departing on the flight, the private pilot, who did not hold a current medical certificate, fueled the multiengine airplane and was seen shortly thereafter attempting to repair a fuel leak of unknown origin. The pilot did not hold a mechanic certificate and review of the maintenance logbooks revealed that the most recent annual inspection was completed 2 years before the accident. After performing undetermined maintenance to the airplane, the pilot reported to a witness that he had fixed the fuel leak. The pilot then taxied to the runway for takeoff. Witnesses reported that a large fuel stain was present on the ramp where the airplane had been parked; however, the amount of fuel that leaked from the airplane could not be determined. The pilot aborted the first takeoff shortly after becoming airborne. Although he did not state why he aborted the takeoff, he told the tower controller that he did not need assistance; shortly thereafter, he requested and was cleared for a second takeoff. During the initial climb, the pilot declared an emergency and was cleared to land on any runway. Witnesses reported that the airplane was between 400 ft and 800 ft above the ground in a left bank and appeared to be turning back to land on an intersecting runway. They thought the airplane was going to make it back to the runway, but the airplane's bank angle increased past 90° and the nose suddenly dropped; the airplane subsequently impacted terrain. One of the pilots likened the maneuver to a stall/spin, Vmc roll, or snap roll. Examination of the flight controls and engines did not reveal any anomalies that would have prevented normal operation. The position of the fuel valves was consistent with the fuel being shut off to the left engine. The fuel valves, with the exception of the left main valve, functioned when power was applied. The left main valve was intact, but the motor was found to operate intermittently. The amount of fuel found in the left engine injection servo was less than that in the right engine; however, the cylinder head temperatures and exhaust gas temperatures were consistent between both engines for the duration of the flight, and whether or to what extent the left engine may have experienced a loss of power could not be determined. The available evidence was insufficient to determine why the pilot declared an emergency and elected to return to the airport; however, the airplane's increased left bank and nose-down attitude just before impact is consistent with a loss of control. ", "probable_cause": "The pilot's loss of control while returning to the airport after takeoff for reasons that could not be determined based on the available information.\n"}