{"url": "https://www.baaa-acro.com/crash/crash-iai-1124a-westwind-ii-near-gouldsboro-3-killed", "date": "Dec 12, 1999 at 1635 LT", "type": "IAI 1124 Westwind", "operator": "Panda Leasing Company", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Seattle - Teterboro", "msn": "338", "yom": 1981, "flight_number": null, "city": "Gouldsboro", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 10250, "captain_hours_type": 1500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5035, "circumstances": "After a 5-hour flight, the Westwind jet began its descent to the airport. Air traffic control instructed the flight crew to cross a VOR at 18,000 feet. The flight crew was then instructed to cross an intersection at 6,000 feet. The flight crew needed to descend the airplane 12,000 feet, in 36 nautical miles, to make the crossing restriction. The flight crew acknowledged the clearance, and no further transmissions were received from the airplane. The airplane struck treetops and impacted the ground in a wooded area. The accident flight was the airplane's first flight after maintenance. Work that was accomplished during the maintenance included disassembly and reassembly of the horizontal stabilizer trim actuator. Examination of the actuator at the accident site revealed that components of the actuator were separated and that they displayed no damage where they would have been attached. Examination of the actuator by the Safety Board revealed that the actuator had not been properly assembled in the airplane. A similar actuator was improperly assembled and installed in a static airplane for a ground test. When the actuator was run, the jackscrews of the actuator were observed backing out of the rod end caps within the first few actuations of the pitch trim toward the nose-down position. As the pitch trim continued to be actuated toward the nose-down position, the jackscrews became disconnected from the rod end caps, and the horizontal stabilizer became disconnected from the actuator. The passenger was Peter Lahaye, founder and owner of the Lahaye Laboratories and the aircraft. ", "probable_cause": "The improper assembly of the horizontal stabilizer trim actuator unit by maintenance personnel. "}