{"url": "https://www.baaa-acro.com/crash/crash-cessna-411-fallon-1-killed", "date": "Sep 3, 1990 at 1244 LT", "type": "Cessna 411", "operator": "Robert Seale", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fallon - Carson City", "msn": "411-0021", "yom": 1963, "flight_number": null, "city": "Fallon", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2398, "captain_hours_type": 88, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2720, "circumstances": "The aircraft had recently been returned to service after 5 years in storage. On this flight, it was being used to transport two political candidates on their campaign itinerary. During takeoff from runway 03, the right engine lost power on the initial climb and the aircraft descended and crashed about 2 miles southeast of the airport. The pilot did not complete the emergency procedure for an engine failure. There was evidence that he did not feather the propeller, did not bank into the good engine, and did not close the cowl flaps on the inoperative engine. An exam of the right engine disclosed overheating and erosion of the #1 & #4 pistons, which resulted in holes in the top edges of the pistons. Also, there were clogged fuel injectors, contamination and corrosion of the fuel injector pump, and contamination and partial obstruction of the manifold valve. Additionally, the absolute pressure control of the turbocharger was found to be incorrectly adjusted. The pilot's medical certificate was dated 8/13/86. ", "probable_cause": "Failure of the pilot to perform emergency procedures for loss of engine power (including his failure to feather the propeller of the affected engine). Factors related to the accident were: inadequate maintenance, contamination in the fuel system, and overheat failure of the #1 and #4 pistons in the right engine (from preignition or detonation).\n"}