{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-bethel-1-killed", "date": "Nov 26, 1996 at 1101 LT", "type": "Cessna 208B Grand Caravan", "operator": "Arctic Transportation Services", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bethel - Kwigillingok", "msn": "208B-0199", "yom": 1989, "flight_number": "ATS1604", "city": "Bethel", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3623, "captain_hours_type": 474, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3711, "circumstances": "The pilot was departing on a cargo flight. Just after takeoff, a company dispatcher attempted to contact the pilot by radio. The pilot replied, 'stand by.' No further communication was received from the pilot. The airplane was observed by ATC personnel in a left turn back toward the airport at an estimated altitude of 200 feet above the ground. The angle of bank during the turn increased, and the nose of the airplane suddenly dropped toward the ground. The airplane struck the ground in a nose and left wing low attitude about 1 mile west of the airport. The terrain around the airport was relatively flat, snow covered tundra. The airplane was destroyed. A postaccident examination of the engine did not reveal any mechanical malfunction. Power signatures in the engine indicated it was developing power. A postaccident examination of the propeller assembly revealed one of three composite blades had rotated in its blade clamp 17/32 inch; however, the propeller manufacturer indicated blade contact with the ground would try to drive the propeller from a high blade angle toward a low blade angle. Movement toward a low blade angle would compress the propeller feathering springs, while movement toward a high blade angle would result in a hydraulic lock condition as oil in the system is compressed. The propeller manufacturer indicated they had no reports of composite blade slippage in the blade clamps. ", "probable_cause": "Failure of the pilot to maintain control of the airplane, while maneuvering to reverse direction after takeoff, after encountering an undetermined anomaly. The undetermined anomaly was a related factor. "}