{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-464-310p-malibu-abbeville", "date": "May 26, 2006 at 0835 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Toussus-le-Noble – Fairoaks", "msn": "46-8508099", "yom": 1985, "flight_number": null, "city": "Abbeville", "zone": "Somme", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 737, "captain_hours_type": 230, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The single engine aircraft departed Toussus-le-Noble Airport in the early morning on a private flight to Fairoaks with two people on board. About 40 minutes into the flight, at an altitude of 18,000 feet, the manifold pressure dropped from 30 to 28 inches of mercury. The pilot increased the engine power when the manifold pressure boosted to 33 inches of mercury then dropped again. Suddenly, a burning smell pervades the cabin. The pilot declared an emergency and elected to divert to Abbeville Airport which was at a distance of 15 NM from his position. While descending, he lowered the landing gear and reduced the engine power. Shortly before reaching FL100, the oil pressure warning light came on, the engine started to vibrate then stopped. At this time, the aircraft was 10 NM from Abbeville Airport, descending in IMC conditions. On short final, at a height of 300 feet, the pilot established a visual contact with the runway but his trajectory was too short. The aircraft crash landed in a field and came to rest 200 metres short of runway 20. Both occupants escaped uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "Examination of the engine revealed a tightening defect in the connecting rod heads. The rupture of one of them caused a loss of oil pressure and damage to the movable coupling of the engine, which had been subject to repairs in March 2000 following a belly landing. "}