{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-111-mt-sainte-odile-87-killed", "date": "Jan 20, 1992 at 1920 LT", "type": "Airbus A320", "operator": "Air%20Inter", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Lyon - Strasbourg", "msn": "15", "yom": 1988, "flight_number": "IT148", "city": "Mt Sainte-Odile", "zone": "Bas-Rhin", "country": "France", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 5, "pax_on_board": 90, "pax_fatalities": 82, "other_fatalities": 0, "total_fatalities": 87, "captain_hours": 8806, "captain_hours_type": 162, "copilot_hours": 3615, "copilot_hours_type": 61, "aircraft_hours": 6316, "circumstances": "On 20 January 1992, an Airbus A320 registered F-GGED and operated by the company Air Inter, made the scheduled connection by night between Lyon-Satolas and Strasbourg-Entzheim using the call sign ITF 148 DA. The aircraft took off from Lyon at approx. 17.20 hours with 90 passengers, 2 flight crew members and 4 cabin crew members on board. No problems were reported by the crew during the course of the flight. The runway in operation at Strasbourg-Entzheim was 05. After listening to the ATIS announcements, the crew planned to carry out an ILS approach procedure for runway 23, followed by visual manoeuvres for a landing on runway 05. Before transferring the aircraft to Strasbourg Approach Control, the Centre Régional de la Navigation Aérienne (CRNA) Est (Eastern Regional Air Navigation Centre) in Reims cleared it to descend to Flight Level 70 near the ANDLO way point. At 18.09 hours contact was established with Strasbourg Approach Control. While the aircraft was crossing Flight Level 150 in descent its distance to STR VOR was around 22 nautical miles. Strasbourg Control cleared it to continue its descent to an altitude of 5,000 feet QNH, then, after announcing that it had passed ANDLO, cleared it to a VOR-DME approach to runway 05. However, the altitude and speed of the aircraft were such that the direct approach procedure could no longer be carried out and the crew informed Control of their intention to carry out an ILS Rwy 23 approach procedure followed by visual manoeuvres for runway 05. Control warned them that this choice would mean a delay, as three aircraft were in the process of taking off from runway 05, using an IFR flight plan. The crew then modified their strategy and advised Control that they would carry out a complete VOR-DME procedure for runway 05. Control then suggested radar guidance to bring them back to ANDLO, thus curtailing the approach procedure. The aircraft was a few seconds away from STR VOR. The crew accepted and carried out the manoeuvres prescribed by the controller: left turn towards heading 230 for an outbound track parallel to the approach axis, then a reciprocal turn towards the ANDLO point. At 18.19 hours the Controller informed the crew that the aircraft was abeam the ANDLO way point and cleared them to final approach. The aircraft then commenced its descent, approximately at the distance allowed for the approach procedure, i.e. 11 nautical miles from STR VOR. Thirty seconds later the Controller requested the crew to call back passing STR. The crew acknowledged. This was the last contact with the aircraft. The wreckage was discovered at 22.35 hours, on a slope of Mont \"La Bloss\" at a topographical level close to 800 metres (2,620 feet), at a distance approximately 0.8 nautical miles (1,500 m) to the left of the approach path and 10.5 nautical miles (19.5 km) from the runway threshold. Five crew members and 82 passengers were killed while 9 other occupants, including one crew members, were rescued. ", "probable_cause": "After analysing the accident mechanisms, the commission reach the following conclusions:\r\n1 - The crew was late in modifying its approach strategy due to ambiguities in communication with air traffic control. They then let the controller guide them and relaxed their attention, particularly concerning their aircraft position awareness, and did not sufficiently anticipated preparing the aircraft configuration for landing.\r\n2 - In this situation, and because the controller's radar guidance did not place the aircraft in a position which allowed the pilot flying to align it before ANDLO, the crew was faced with a sudden workload peak in making necessary lateral corrections, preparing the aircraft configuration and initiating the descent.\r\n3 - The key event in the accident sequence was the start of aircraft descent at the distance required by the procedure but at an abnormally high vertical speed (3300 feet/min) instead of approx. 800 feet/min, and the crew failure to correct this abnormally high rate of descent.\r\n4 - The investigation did not determined, with certainty, the reason for this excessively high rate of descent . Of all the possible explanations it examined, the commission selected the following as seen most worthy of wider investigation and further preventative actions:\r\n4.1 - The rather probably assumptions of confusions in vertical modes (due either to the crew forgetting to change the trajectory reference or to incorrect execution of the change action) or of incorrect selection of the required value (for example, numerical value stipulated during briefing selected unintentionally).\r\n4.2 - The highly unlikely possibility of a FCU failure (failure of the mode selection button or corruption of the target value the pilot selected on the FCU ahead of its use by the autopilot computer).\r\n5 - Regardless of which of these possibilities short-listed by the commission is considered, the accident was made possible by the crew's lack of noticing that the resulting vertical trajectory was incorrect, this being indicated, in particular, by a vertical speed approximately four times higher than the correct value, an abnormal nose-down attitude and an increase in speed along the trajectory.\r\n6 - The commission attributes this lack of perception by the crew to the following factors, mentioned in an order which in no way indicates priority:\r\n6.1 - Below-average crew performance characterised by a significant lack of cross-checks and checks on the outputs of actions delegated to automated systems. This lack is particularly obvious by the failure to make a number of the announcements required by the operating manual and a lack of the height/range check called for as part of a VOR DME approach.\r\n6.2 - An ambiance in which there was only minimum communication between crew members;\r\n6.3 - The ergonomics of the vertical trajectory monitoring parameters display, adequate for normal situations but providing insufficient warning to a crew trapped in an erroneous mental representation;\r\n6.4 - A late change to the approach strategy caused by ambiguity in crew-ATC communication;\r\n6.5 - A relaxation of the crew's attention during radar guidance followed by an instantaneous peak workload which led them to concentrate on the horizontal position and the preparation of the aircraft configuration, delegating the vertical control entirely to the aircraft automatic systems;\r\n6.6 - During the approach alignment phase, the focusing of both crew members attention on the horizontal navigation and their lack of monitoring of the autopilot controlled vertical trajectory;\r\n6.7 - The absence of a GPWS and an appropriate doctrine for its use, which deprived the crew of a last chance of being warned of the gravity of the situation.\r\n7 - Moreover, notwithstanding the possibility of a FCU failure, the commission considers that the ergonomic design of the autopilot vertical modes controls could have contributed to the creation of the accident situation . It believes the design tends to increase the probability of certain errors in use, particularly during a heavy workload."}