{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-30-guatemala-city-18-killed", "date": "Dec 21, 1999 at 0940 LT", "type": "Douglas DC-10", "operator": "AOM", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Havana - Guatemala City", "msn": "46890", "yom": 1973, "flight_number": "CU1216", "city": "Guatemala City-La Aurora", "zone": "Guatemala", "country": "Guatemala", "region": "Central America", "crew_on_board": 18, "crew_fatalities": 8, "pax_on_board": 296, "pax_fatalities": 8, "other_fatalities": 2, "total_fatalities": 18, "captain_hours": 16117, "captain_hours_type": 4872, "copilot_hours": 8115, "copilot_hours_type": 4156, "aircraft_hours": 85760, "circumstances": "Leased from AOM French Airlines, the aircraft was completing a charter flight (service CU1216) from Havana to Guatemala City on behalf of Cubana de Aviacion, carrying 18 crew members and 296 passengers who were mostly young Guatemalan citizens studying medicine in Cuba. After touchdown on runway 19, the crew started the braking procedure but the aircraft was unable to stop within the remaining distance. It overran, went down an embankment and eventually crashed onto several houses located in the district of La Libertad. Both pilots, six other crew members, eight passengers and two people on the ground were killed. Also, 57 people were injured (among them 20 on the ground) while 261 other occupants escaped uninjured. The aircraft was destroyed. ", "probable_cause": "Wrong approach configuration on part of the crew who landed too far down the runway with an excessive speed, between 1,220 and 1,320 metres past the runway threshold. Runway 29 is 2,767 metres long and it was calculated that the landing distance available was reduced by 1,450 to 1,500 metres. The following contributing factors were identified: \r\n- The crew failed to initiate a go-around procedure while the landing procedure was obviously missed, \r\n- An indicated airspeed (IAS) of the aircraft greater than the specified one, with an increase due to elevation and temperature,\r\n- The initial gradient of the track that requires a vertical speed descent, during leveling, May than usual,\r\n- The flotation of the aircraft during the leveling phase (flare), facilitated by the use of the “CWS” mode of the autopilot (procedure approved by the aircraft flight manual), without corrective action by the Commander,\r\n- A probable tailwind component over which there was no exact information provided by the control tower and that was not monitored by the crew, as it was not in their procedures nor did he feel the need to,\r\n- The failure of the crew to immediately start the braking procedure after touchdown, probably caused by a false visual impression of the crew which was facilitated by their lack of prior experience for the approach and landing on runway 19 at the Aurora Airport with this type of aircraft,\r\n- The runway surface condition,\r\n- A tailwind component."}