{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900c-1-near-dillingham-2-killed", "date": "Mar 8, 2013 at 0815 LT", "type": "Beechcraft 1900C", "operator": "ACE%20Air%20Cargo", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "King Salmon - Dillingham", "msn": "UC-17", "yom": 1988, "flight_number": "AER51", "city": "Dillingham", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5770, "captain_hours_type": 5470, "copilot_hours": 470, "copilot_hours_type": 250, "aircraft_hours": 29827, "circumstances": "Aircraft was destroyed when it impacted rising terrain about 10 miles east of Aleknagik, Alaska. The airplane was operated as Flight 51, by Alaska Central Express, Inc., Anchorage, Alaska, as an on demand cargo flight under the provisions of 14 Code of Federal Regulations (CFR) Part 135. The airline transport certificated captain and the commercial certificated first officer sustained fatal injuries. Instrument meteorological conditions were reported in the area at the time of the accident, and the airplane was operating on an instrument flight rules (IFR) flight plan. The flight had originally departed Anchorage about 0544, and made a scheduled stop at King Salmon, Alaska, before continuing on to the next scheduled stop, Dillingham, Alaska. According to Federal Aviation Administration (FAA) personnel, as the airplane approached Dillingham, the flight crew requested the RNAV GPS 19 instrument approach to the Dillingham Airport about 0757 from controllers at the Anchorage Air Route Traffic Control Center (ARTCC). The ARTCC specialist on duty subsequently granted the request by issuing the clearance, with instructions to proceed direct to the Initial Approach Fix (IAF) to begin the approach, and to maintain an altitude of 2,000 feet or above. A short time later the flight crew requested to enter a holding pattern at the IAF so that they could contact the Flight Service Station (FSS) for a runway conditions report, and the ARTCC specialist granted that request. The ARTCC specialist then made several attempts to contact the aircraft, but was unsuccessful and subsequently lost radar track on the aircraft. When the airplane failed to arrive at the Dillingham Airport, ARTCC personnel initiated a radio search to see if the airplane had diverted to another airport. Unable to locate the airplane, the FAA issued an alert notice (ALNOT) at 0835. Search personnel from the Alaska State Troopers, Alaska Air National Guard, and the U.S. Coast Guard, along with several volunteer pilots, were dispatched to conduct an extensive search effort. Rescue personnel aboard an Air National Guard C-130 airplane tracked 406 MHz emergency locater transmitter (ELT) signal to an area of mountainous terrain about 20 miles north of Dillingham, but poor weather prohibited searchers from reaching the site until the next morning. Once the crew of a HH-60G helicopter from the Air National Guard's 210th Air Rescue Squadron, Anchorage, Alaska, reached the steep, snow and ice-covered site, they confirmed that both pilots sustained fatal injuries.", "probable_cause": "The flight crew's failure to maintain terrain clearance, which resulted in controlled flight into terrain in instrument meteorological conditions. Contributing to the accident were the flight crew's failure to correctly read back and interpret clearance altitudes issued by the air traffic controller, their failure to adhere to minimum altitudes depicted on the published instrument approach chart, and their failure to adhere to company checklists. Also contributing to the accident were the air traffic controller's issuance of an ambiguous clearance to the flight crew, which resulted in the airplane's premature descent, his failure to address the pilot's incorrect read back of the assigned clearance altitudes, and his failure to monitor the flight and address the altitude violations and issue terrain-based safety alerts."}