{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-le-havre-saint-pierre", "date": "Nov 23, 1994 at 1714 LT", "type": "Cessna 402", "operator": "Air%20Satellite.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lourdes-de-Blanc-Sablon - Le Havre-Saint-Pierre", "msn": "402B-0820", "yom": 1975, "flight_number": "ASJ638", "city": "Le Havre-Saint-Pierre", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 689, "captain_hours_type": 29, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7012, "circumstances": "The Air Satellite Cessna 402B, flight 638, took off from Lourdes-de-Blanc-Sablon, Quebec, on an instrument flight rules (IFR) flight to Havre-Saint-Pierre, Quebec, with a load of mail. At 6,000 feet above sea level (asl), meteorological conditions were visual (VMC). About 35 nautical miles (nm) from Havre-Saint-Pierre, the pilot began his descent. At 25 nm from the airport and at an altitude of 5,000 feet asl, the pilot contacted the Flight Service Station (FSS) specialist at Sept-Îles, Quebec, via the remote communications outlet (RCO). He requested weather information for Havre-Saint-Pierre Airport. The specialist gave him the latest weather report available for the Havre-Saint-Pierre FSS. The report had been issued three hours previously by Environment Canada. The meteorological sequence indicated VMC. The pilot could see the town of Havre-Saint-Pierre when he commenced his back course approach for runway 27. During the descent, the aircraft flew into snow showers. The pilot contacted the company to check the weather at Havre-Saint-Pierre Airport, and he was told there was light snow. The pilot continued the approach to the MDA indicated on the Havre-Saint-Pierre approach chart, that is, 420 feet asl. There was moderate turbulence during the approach. The pilot tried to maintain control of the aircraft while operating the radio in an attempt to obtain more detailed weather information. One of the company pilots told him the snowfall was heavier. The aircraft then banked right. The pilot corrected, and, at the same time, the wheels touched the ground. The aircraft crashed and slid on its belly about 100 feet before coming to rest. The pilot sustained minor injuries; the aircraft sustained substantial damage. The accident occurred about 1.5 nm from the threshold of Havre-Saint-Pierre runway 27 on marshy ground. The pilot remained in radio contact with overflying aircraft and said he would stay on board the aircraft until rescuers arrived. Search and rescue crews walked toward the crash site, but they were unable to find the aircraft because of the rough terrain and reduced visibility. Five hours later, a Search and Rescue helicopter located the aircraft with the aid of the direction finder. The weak signal from the emergency locator transmitter (ELT) was still readable and was received. The pilot was transported to hospital for first aid treatment.The accident occurred during the hours of darkness.", "probable_cause": "The pilot continued the descent below the MDA without the required visual references."}