{"url": "https://www.baaa-acro.com/crash/crash-atr72-212-san-juan", "date": "May 9, 2004 at 1450 LT", "type": "ATR72-200", "operator": "American-Eagle-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Mayaguez - San Juan", "msn": "438", "yom": 1995, "flight_number": "AA5401", "city": "San Juan-Luis Muñoz Marín (Isla Verde)", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 22, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6071, "captain_hours_type": 3814, "copilot_hours": 2000, "copilot_hours_type": 20, "aircraft_hours": 19276, "circumstances": "Flight 5401 departed Mayagüez, Puerto Rico, for San Juan about 14:15. The captain was the nonflying pilot for the flight, and the first officer was the flying pilot. The takeoff, climb, and en route portions of the flight were uneventful. At 14:37, as the flight approached the San Juan traffic area, the ATIS reported that winds were 060 degrees at 17 knots and gusting at 23 knots. Shortly thereafter, the captain briefed a Vref (the minimum approach airspeed in the landing configuration before the airplane reaches the runway threshold) of 95 knots and told the first officer to \"stand by for winds.\" At 14:43 SJU Terminal Radar Approach Control cautioned the pilots of possible wake turbulence from a preceding Boeing. The captain told the first officer to slow down to about 140 kts. At 14:46, the local controller cleared the airplane to land on runway 08. The first officer turned the airplane left toward runway 08 and transitioned to the visual approach slope indicator. At 14:49, the captain stated, \"you better keep that nose down or get some power up because you're gonna balloon.\" The airplane descended below the glideslope, causing a GPWS \"glideslope\" alert. The airplane was about 45 feet above ground level and traveling at 110 knots indicated airspeed when it crossed the runway 08 threshold. After the airplane crossed the runway threshold, the captain stated, \"power in a little bit, don't pull the nose up, don't pull the nose up.\" At 14:49:39, the captain stated, \"you're ballooning,\" and the first officer replied, \"all right.\" The airplane touched down for the first time about 14:49:41 and about 1,600 feet beyond the runway 08 threshold with vertical and lateral loads of about 1.3 Gs and -0.10 G, respectively. Upon touchdown the captain stated, \"get the power,\" and, 1 second later, \"my aircraft.\" The first officer responded, \"your airplane.\" The airplane had skipped to an altitude of about 4 feet and touched down again two seconds later about 2,200 feet beyond the runway 08 threshold. The airplane then pitched up to an angle of 9° while climbing to an altitude of 37 feet and the engine torque increased from 10 to 43 percent. About 14:49:49, the pitch angle decreased to -3°, and the engine torque started to decrease to 20 percent with the pitch angle decreasing to -10°. The airplane touched down a third time about 14:49:51 at a bank angle of 7° left wing down and about 3,300 feet beyond the runway 08 threshold and with vertical and lateral loads of about 5 Gs and 0.85 G. The ATR pitched up again to 24 feet and landed a fourth time about 14:49:56 (about 15 seconds after the initial touchdown) and about 4,000 feet beyond the runway 08 threshold. This time the airplane pitched down to -7° and that it was banked 29° left wing down. The airplane came to a complete stop on a grassy area about 217 feet left of the runway centerline and about 4,317 feet beyond the runway threshold.", "probable_cause": "The captain’s failure to execute proper techniques to recover from the bounced landings and his subsequent failure to execute a go-around."}