{"url": "https://www.baaa-acro.com/crash/crash-airbus-a310-324-irkutsk-125-killed", "date": "Jul 9, 2006 at 0744 LT", "type": "Airbus A310", "operator": "S7-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Irkutsk", "msn": "442", "yom": 1987, "flight_number": "SBI778", "city": "Irkutsk-Intl", "zone": "Irkutsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 5, "pax_on_board": 195, "pax_fatalities": 120, "other_fatalities": 0, "total_fatalities": 125, "captain_hours": 10611, "captain_hours_type": 1056, "copilot_hours": 9771, "copilot_hours_type": 158, "aircraft_hours": 59865, "circumstances": "On July 8, 2006 an А310 airplane with state registration number F-OGYP (France), leased by ОАО Aviakompania Sibir, and with a flight crew consisting of the Captain and the co-pilot, was flying scheduled passenger flight С7 778 from Domodedovo to Irkutsk. Apart from the two cockpit personnel, there were 6 flight attendants and 195 passengers on board (of these, 2 worked for the company), which included 181 nationals of Russia, 3 of Germany, 3 of the PRC, 2 of Poland, 3 of Belarus, 2 of Moldova and 1 of Azerbaijan. The airplane's payload according to the flight manifest was 19,800 kg (which included about 80 kg of hazardous freight - perfume), its take-off weight 140414 kg (maximum permissible – 150,000 kg), and center-of-gravity position 25.5% (the range of permissible center-of-gravity positions for take-off is 18% - 32%). Upon completion of the pre-flight preparation, the crew took off from Domodedovo airport at 17:17 (17:15 – as per schedule) and after climbing set a course for its destination airport of Irkutsk (alternate airport Bratsk). The flight proceeded without incident and at 22:17 the crew initiated descent for an approach and landing at Irkutsk airport. At 22:43:40 the airplane landed without misalignment on runway 30 at Irkutsk airport. Before the flight, in accordance with Sibir’s MEL, the maintenance personnel deactivated the thrust reverser on the airplane's left engine after hearing the crew's observation about this thrust reverser's malfunction during a previous flight. After touchdown all spoiler sections prepared (\"armed\") by the crew for utilization were deployed and the autobrake in Low mode, previously selected by the crew, was activated. The pilot moved the right engine (no. 2) thrust reverser forward. However, simultaneously with the subsequent reduction of the reverse mode of engine no. 2, engine no. 1 started to speed up (forward thrust), which led to an increase in airplane speed and the onset of torque that pulled the airplane to the right. The crew failed to perceive the cause of what was happening. In spite of intense wheel-braking efforts, the airplane used up the entire length of the runway and overshot its end at a speed of about 180 kph. The airplane then continued to travel on wet soil. At a distance of about 300 m from the departure threshold of the runway, the airplane collided with a concrete barrier of the aerodrome and then with some garages located directly behind the barrier, after which the airplane, now seriously damaged, stopped. As a result of the destruction of the fuel tanks the fuel ignited and fire penetrated the airplane's interior. As a result of the accident, 125 individuals died, including the two pilots and three of the flight attendants. The airplane was practically completely destroyed by the fire. ", "probable_cause": "The cause of Sibir A310 F-OGYP accident was the erroneous and uncontrolled actions by the crew during rollout after landing in a configuration with one engine reverser deactivated. After touchdown, the Captain, while acting on the reverse thrust lever of the right engine, inadvertently and uncontrollably moved the throttle lever for the left engine, whose thrust reverser was deactivated, from the \"idle\" to the significant forward thrust position. Inadequate monitoring and call-outs of airplane speed and engine parameters by the Co-pilot made it impossible for the crew to perform the necessary actions, either by moving the left throttle back to idle or shutting down the engines. The crew had enough time to recognize the situation. The airplane went off the runway at the high speed of ~180 km/h, hit the concrete fence and buildings, crashed and caught fire. 125 people died as a result of the accident. "}