{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-2p6-atlanta", "date": "Nov 1, 1998 at 1848 LT", "type": "Boeing 737-200", "operator": "AirTran%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Atlanta - Dallas", "msn": "21355", "yom": 1977, "flight_number": "FL867", "city": "Atlanta-William Berry Hartsfield", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 100, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15000, "captain_hours_type": 2500, "copilot_hours": 4976, "copilot_hours_type": 167, "aircraft_hours": 45856, "circumstances": "The first officer of AirTran Airways flight 890, which preceded AirTran flight 867 in the accident airplane, identified and reported a leak from the right engine of the Boeing 737-200 during a postflight inspection at William B. Hartsfield Atlanta International Airport (ATL), Georgia. AirTran mechanics at ATL identified the source of the leak as a chafed hydraulic pressure line to the right thrust reverser. They found the part in the illustrated parts catalog (IPC), which was not designed as a troubleshooting document and does not contain sufficient detail for such use. One of the mechanics telephoned an AirTran maintenance controller in Orlando, Florida, for further instructions. The mechanics who initially identified the source of the leak had little experience working on the Boeing 737 because they had worked for ValuJet Airlines, which flew DC-9s only, until ValuJet and AirTran merged in September 1997. On the basis of the information provided by the mechanic, and without questioning his description of the line or verifying the part number that he had provided against the IPC or some other appropriate maintenance document, the maintenance controller instructed the mechanic to cap the leaking line and deactivate the right thrust reverser in accordance with AirTran's Minimum Equipment List procedures. However, instead of capping the hydraulic pressure line, the mechanics capped the right engine hydraulic pump case drain return line. The mechanics performed a leak check by starting the auxiliary power unit and turning on the electric hydraulic pumps to pressurize the airplane's hydraulic systems; no leaks were detected. Although the mechanics were not required by company procedures to test their repair by running the engines, this test would have alerted the mechanics that they had incorrectly capped the hydraulic pump case drain line, which would have overpressurized the hydraulic pump and caused the hydraulic pump case seal to rupture. However, because the mechanics did not perform this test, the overpressure and rupture occurred during the airplane's climb out, allowing depletion of system A hydraulic fluid. Depletion of system A hydraulic fluid activated the hydraulic low-pressure lights in the cockpit, which alerted the flight crew that the airplane had a hydraulic problem. The crew notified air traffic control that the airplane would be returning to ATL and subsequently declared an emergency. The flight crew's initial approach to the airport was high and fast because of the workload associated with performing AirTran's procedures for the loss of hydraulic system A and the limited amount of time available to perform the procedures. Nevertheless, the crew was able to configure and stabilize the airplane for landing. However, depletion of system A hydraulic fluid disabled the nosewheel steering, inboard flight spoilers, ground spoilers, and left and right inboard brakes. The flight crew was able to land the airplane using the left thrust reverser (the right thrust reverser was fully functional but intentionally deactivated by the mechanics), outboard brakes (powered by hydraulic system B), and rudder. The flight crew used the left thrust reverser and rudder in an attempt to control the direction of the airplane down the runway, but use of the rudder pedals in this manner had depleted the system A accumulator pressure, which would have allowed three emergency brake applications. The use of the right outboard brake without the right inboard brake at a higher-than-normal speed (Vref for 15-degree flaps is faster than Vref for normal landing flaps) and with heavy gross weight (the airplane had consumed only 4,650 pounds of the 28,500 pounds of fuel on board at takeoff) used up the remaining friction material on the right outboard brake, causing it to fail. (The left outboard brake was still functional at this point.) The lack of brake friction material on the right outboard brake caused one of the right outboard brake pistons to overtravel and unport its o-ring, allowing system B hydraulic fluid to leak out; as a result, the left outboard brake also failed. Loss of the left and right inboard and outboard brakes, loss of nosewheel steering, and use of asymmetric thrust reverse caused the flight crew to lose control of the airplane, which departed the left side of the runway and came to rest in a ditch. ", "probable_cause": "The National Transportation Safety Board determines the probable cause(s) of this accident to be:\r\n(1) the capping of the incorrect hydraulic line by mechanics, which led to the failure of hydraulic system A; \r\n(2) the mechanics' lack of experience working with the Boeing 737 hydraulic system; and \r\n(3) the maintenance controller's failure to ascertain more information regarding the leaking hydraulic line before instructing the mechanics to cap the line and deactivate the right thrust reverser.\r\nContributing to the cause of the accident were: \r\n(1) the asymmetric directional control resulting from the deactivation of the right thrust reverser; \r\n(2) the depletion of the left and right inboard brake accumulator pressure because of the flight crew's use of the rudder pedals with only the left thrust reverser to control the direction of the airplane down the runway; \r\n(3) the failure of the right outboard brake because the airplane was slowed without the use of the left and right inboard brakes and was traveling at a higher-than-normal speed and with heavy gross weight;\r\n(4) the failure of the right outboard brake after one of the right outboard pistons overtraveled and unported its o-ring, allowing system B hydraulic fluid to deplete and the left outboard brake to fail; and \r\n(5) the mechanics' improper use of the illustrated parts catalog for maintenance and troubleshooting and the maintenance controller's failure to use the appropriate documents for maintenance and troubleshooting. "}