{"url": "https://www.baaa-acro.com/crash/crash-waco-uic-detroit-1-killed", "date": "May 3, 1936 at 0650 LT", "type": "Waco UIC", "operator": "Morrell D. Banker", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Detroit - Louisville", "msn": "3775", "yom": 1933, "flight_number": null, "city": "Detroit-City (Coleman A. Young)", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On May 3, 1936, at approximately 0650LT, at Detroit, Michigan, a privately owned airplane was involved in an accident resultant death to one passenger, serious injury to another, and minor injury to the pilot. A third passenger was uninjured, and the aircraft was completely destroyed. The airplane, a Waco Model UIC, bore Federal licence number NC13420. The pilot was unlicensed. He had formerly held a Federal Transport pilot's licence, which expired on December 31, 1933. Returning from a cross-country flight to Louisville, Kentucky, the pilot landed at the Wayne County Airport to inquire about weather conditions at Detroit City Airport. He took off again a few minutes later to fly to the latter airport, which is but a short flight from the former. While circling the field at an altitude of about 200 feet preparatory to landing, the engine suddenly stopped. The pilot decided that he could not reach the airport and attempted to land downwind in some vacant lots. He overshot these badly and rather than risk striking houses, guided the nose of the airplane between two trees at the end of the vacant lots. The trees were struck while the airplane was still about 10 feet in the air, tearing off the wings and empennage. The engine and fuselage continued on about 25 feet before striking the ground, the slid along for about 20 feet more. The two passengers in the rear seat, who were under a single safety belt, were thrown forward from under the belt by the impact, causing fatal injury to one and serious injury to the other. Careful examination of the wreckage disclosed that the Lunkenheimer gasoline drain was in the drain position. This valve is located in such a manner that it is only about an inch from the left rudder pedal and a large movement of the rudder pedals, while taxying, could probably cause the valve to be accidentally opened. As the pilot states that he did not use this drain at any time during the trip, it is probable that while taxying at the Wayne County Airport, the valve was accidentally kicked open, allowing the gasoline to drain away, the supply being exhausted while preparing to land at the Detroit City Airport, thus causing the sudden engine stoppage. A check of the entire flight discloses that the pilot had put in approximately 8 hours of night flying just previous to the accident, and was probably greatly fatigued. This would had an effect on his judgment of speed and distance on the forced landing, in which he erred considerably. \r\nCrew:\r\nJames H. Baughn, pilot.\r\nPassengers:\r\nSadie Rowley, †\r\nJoseph M. Charlton, \r\nMorrell D. Banker. ", "probable_cause": "It is the opinion of the Bureau of Air Commerce that the probable cause of this accident was accidental opening of the gasoline drain valve while taxying, together with the pilot's misjudgment of speed and distance while negotiating a forced landing. "}