{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-275-cranbrook-42-killed", "date": "Feb 11, 1978 at 1255 LT", "type": "Boeing 737-200", "operator": "Pacific%20Western%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort McMurray – Edmonton – Calgary – Cranbrook – Castlegar", "msn": "20142/253", "yom": 1970, "flight_number": "PW314", "city": "Cranbrook", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 5, "crew_fatalities": 4, "pax_on_board": 44, "pax_fatalities": 38, "other_fatalities": 0, "total_fatalities": 42, "captain_hours": 5173, "captain_hours_type": 2780, "copilot_hours": 1316, "copilot_hours_type": 81, "aircraft_hours": null, "circumstances": "Pacific Western Airlines flight 314 was a scheduled Boeing 737 service from Fort McMurray, Aberta, to Castlegar with stops at Edmonton, Calgary and Cranbrook, B. C. The flight departed Calgary at 1932Z 11 February 1978, for Cranbrook with a Company estimated time enroute of 23 minutes. This estimate was passed to the Company Agent in Cranbrook. Flight 314 was cleared by Calgary Air Traffic Control to Cranbrook via high level airway 505, and reached the assigned altitude of 20,000 feet at 1938Z. Air Traffic Control in Calgary transmitted an ETA (estimated time of arrival) of 2005Z to Cranbrook Aeradio, via the land line. Cranbrook is an \"uncontrolled\" airport without a control tower, but within controlled airspace, with an \"Aeradio\" station providing communications, weather, and advisory service. At Cranbrook it was snowing with the visibility reported as 314 of a mile, and a radio equipped snow removal vehicle was sweeping the runway. The Aeradio operator at Cranbrook alerted the vehicle operator about the incoming aircraft at 1935Z and gave him the ETA of 2005Z; they both expected the flight would report by the \"Skookum Beacon\" on a straight-in approach to runway 16, thus giving the vehicle operator about seven minutes to get off the runway. At 1942Z Flight 314 called Calgary and requested and received descent clearance; it was also given clearance for the approach to Cranbrook. At 1944Z, the flight called out of 18000 feet in the descent, and Calgary ATC advised the flight to contact Aeradio. At 1945Z, Flight 314 made initial contact with Cranbrook Aeradio and at 1946Z Cranbrook passed the latest weather, altimeter and runway information. At 1947Z Cranbrook Aeradio advised the flight that snow removal was in progress and gave the latest visibility; Flight 314 acknowledged. No further transmissions were received from the flight by Aeradio or ATC. Evidence indicates the aircraft passed the Skookum beacon inbound on a straight-in instrument approach, and flew the ILS for runway 16 to touchdown.' According to witnesses and estimates partially derived from flight data recorder information, the aircraft touched down at 1955Z approximately 800 feet from the threshold and reverse thrust was selected. Reverse thrust was cancelled immediately after touchdown and a go-around was initiated. The aircraft became airborne prior to the 2000 foot mark, and flew down the runway at a height of 50 to 70 feet, flying over a snow removal vehicle which was still on the runway, 2050 feet from the threshold and 20 feet from the right edge. About this time the left engine thrust reverser doors deployed. A few seconds later, the flap was selected up from 40° to 15°. The landing gear remained down and locked. Six seconds before impact and just over 4,000 feet from the runway threshold, the flight recorder data indicates that a large amount of left rudder was momentarily applied. The aircraft climbed to 300 to 400 feet above the airfield, banked steeply to the left, lost height and side-slipped into the ground to the left of the runway. Fire broke out on impact. Four crew members and 38 passengers were killed while seven other occupants were killed. ", "probable_cause": "The following findings were reported:\r\n- The estimated time of arrival of the aircraft at Cranbrook, calculated by Calgary ATC, and used by Aeradio for advisory purposes was considerably in error and resulted in a traffic conflict between the arriving aircraft and a vehicle working on the runway,\r\n- The flight crew did not report by the Skookum beacon on final approach, as was the normal practice at Cranbrook, thereby allowing the incorrect ETA to remain undetected,\r\n- Regulatory provisions concerning mandatory pilot position reporting during instrument approaches were inadequate,\r\n- The interfaces between the organizations providing Air Traffic Services, Telecommunications (Aeradio) and Airports Services were not well enough developed to provide a reliable fail-safe flight information service,\r\n- The pilots lost control of the aircraft consequent upon the left engine thrust reverser deploying in flight when the aircraft was at low speed, and in a high drag configuration,\r\n- The FAA design standards under which the Boeing 737 was constructed did not adequately provide for the possibility of an aborted landing after touchdown and thrust reverser initiation,\r\n- The lack of a suitable national system of incident reporting, investigation, and follow-up corrective action allowed operational problems to remain uncorrected,\r\n- Rescue efforts at the accident scene were hampered due to lack of a fire fighting vehicle capable of negotiating deep snow and shortage of trained rescue personnel."}