{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-i-pittsburgh", "date": "Jan 6, 1998 at 1548 LT", "type": "Cessna 500 Citation", "operator": "US Motorsports", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Statesville - Akron - Pittsburgh", "msn": "500-0175", "yom": 1974, "flight_number": null, "city": "Pittsburgh-Allegheny County", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3745, "captain_hours_type": 1260, "copilot_hours": 946, "copilot_hours_type": 150, "aircraft_hours": 7124, "circumstances": "The pilot initiated an ILS approach with rain and fog. Approach flaps were maintained until the runway was sighted, and then landing flaps were set. The airplane landed long, overran the runway, struck the ILS localizer antenna on the departure end of the runway, and came to rest at the edge of a mobile home park. The airplane and two mobile homes were destroyed by fire. Vref had been computed at 110 Kts. The PIC reported a speed on final of 130 Kts, while the SIC said it was 140 Kts. Radar data revealed a 160 knots ground speed from the outer marker until 1.8 miles from touchdown. The airplane passed the control tower, airborne, with 2,500 feet of runway remaining on the 6,500 foot long runway. Performance data revealed that the airplane would require about 2,509 feet on a dry runway, and 5,520 feet on a wet runway. The airplane was not equipped with thrust reversers or anti-skid brakes. The PIC was the company president, and the SIC was a recent hire who had flown with the PIC three previous times. The PIC was qualified for single-pilot operations in the airplane, and had been trained to fly stabilized approaches. ", "probable_cause": "The failure of the pilot to make a go-around when he failed to achieve a normal touchdown due to excessive speed, and which resulted in an overrun. Factors were the reduced visibility due to fog, and the wet runway. "}