{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-231-kulob", "date": "Feb 2, 2014 at 0736 LT", "type": "Airbus A320", "operator": "East%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow – Kulob", "msn": "428", "yom": 1994, "flight_number": "ETJ704", "city": "Kulob", "zone": "Khatlon Province", "country": "Tajikistan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 187, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 18321, "captain_hours_type": 509, "copilot_hours": 2900, "copilot_hours_type": 1300, "aircraft_hours": 54604, "circumstances": "Following an uneventful flight from Moscow-Domodedovo Airport, the crew was cleared to land on runway 01 at Kulob Airport. In heavy snow falls, the aircraft landed 230 metres past the runway threshold at a speed of 255 km/h. After touchdown, the crew started the braking procedure when, after a course of 520 metres, the right main gear  contacted a snow berm. Simultaneously, both engines impacted a snow berm (up to 95 cm high) and stopped due to the high quantity of snow ingested. The aircraft veered to the right, lost its nose gear and came to rest in snow, 20 metres to the right of the runway and 1,190 metres from its threshold. All 192 occupants evacuated safely and the aircraft was damaged beyond repair. ", "probable_cause": " The accident with A320-231 EY-623 aircraft was caused by the aircraft collision with snow parapet during landing on unprepared RWY that was cleared to 22 m in width (45 m RWY total width), and with 50-95 cm snow parapets along the cleared part that resulted in front gear leg destruction and engines flameout followed by aircraft runway overrun to the right. The accident was caused by the consequence of the following factors combination:\r\n- flight operation officer decision for aircraft clearance on unprepared RWY,\r\n- having unprepared RWY by the time of the aircraft arrival the aerodrome service didn't put temporary restrictions, didn't make the appropriate note in the \"Aerodrome airworthiness log\", didn't take any measures to prevent the aircraft landing on unprepared RWY.   "}