{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-14-milwaukee-31-killed", "date": "Sep 6, 1985 at 1521 LT", "type": "Douglas DC-9", "operator": "Midwest%20Express.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Milwaukee - Atlanta", "msn": "47309", "yom": 1968, "flight_number": "YX105", "city": "Milwaukee", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 27, "pax_fatalities": 27, "other_fatalities": 0, "total_fatalities": 31, "captain_hours": 5100, "captain_hours_type": 1100, "copilot_hours": 5197, "copilot_hours_type": 1640, "aircraft_hours": 31892, "circumstances": "Midwest Express Airlines Flight 206, DC-9 N100ME arrived at Milwaukee (MKE) at 13:15 on September 6, 1985. It departed Milwaukee at 13:36 and arrived in Madison at 13:55 after an uneventful flight. At Madison, N100ME was designated as flight 105 to Atlanta (ATL), with an intermediate stop in Milwaukee. Flight 105 departed Madison at 14:25 and arrived at Milwaukee, on time and without incident, at 14:41. About 14:49, the first officer of flight 105 contacted Milwaukee Tower to request an instrument flight rule (IFR) clearance to Atlanta. The clearance was received. The Atlanta forecast included a 1,000-foot ceiling, visibility 2 miles, thunderstorms and rain showers. At 15:12, the Before Engine Start Checklist was read and accomplished in accordance with Midwest Express operating procedures. Engine start was commenced at 15:14 and the After Start Checklist was accomplished. The first officer requested clearance to taxi to runway 19R for departure. About 15:17:50, the Taxi Checklist was completed, and the engine pressure ratio (EPR) and airspeed reference bugs were set to 1.91 and 133 knots, respectively. Both indications were correct for the departure conditions applicable to flight 105. At the conclusion of the Taxi Checklist, the captain advised the first officer \"Standard briefing ...\" At 15:19:15, the first officer reported to the tower local controller, \"Milwaukee, Midex 105, ready on 19R.\" Flight 105 was cleared to \"position and hold\" on runway 19R. The captain called for the Before Takeoff Checklist, which was completed in accordance with the COM. Flight 105 was cleared for takeoff at 15:20:28; the first officer acknowledged the clearance. The captain operated the flight controls, and the first officer handled radio communications and other copilot responsibilities during the takeoff. The Midwest Express DC-9 Flight Operations Manual required the use of standard noise abatement takeoff procedures during all line operations, unless precluded by safety considerations or special noise abatement procedures. At the time flight 105 departed, noise abatement procedures were in effect. Midwest Express also utilized \"reduced thrust\" takeoff procedures (at the captain's discretion) to extend engine life. The flightcrew was complying with the reduced thrust and standard noise abatement takeoff procedures. The takeoff roll and liftoff were normal, with liftoff occurring near the intersection of the midfield taxiway and runway 19R, about 4,200 feet from the start of the takeoff roll. Rotation to the takeoff attitude occurred at 140 knots. The DC-9 accelerated to 168 knots with a rate of climb of about 3,000 feet/minute, indicating a normal two-engine initial takeoff flightpath. At 15:21:26 N100ME was about 7,600 feet down the runway, reaching a height of 450 feet above the ground. At that moment there was a loud noise and a noticeable decrease in engine sound. The captain then remarked \"What the # was that?\" The first officer did not respond. At 15:21:29, the local controller transmitted, \"Midex 105, turn left heading 175.\" At the time of his transmission he observed smoke and flame emanating from the right airplane engine. The captain asked the first officer, \"What do we got here, Bill?\" The first officer did not respond to the captain but advised the local controller, \"Midex 105, roger, we've got an emergency here.\" Two seconds later, the captain said, \"Here\"; again there was no response. Neither pilot made the call outs for \"Max Power\" or \"Ignition Override-Check Fuel System,\" which were part of the Midwest Express \"Engine Failure after V1\" emergency procedure. Meanwhile the airplane began to deviate substantially to the right and the heading changed from 194 degrees to 260 degrees in eight seconds. The vertical acceleration dropped sharply to about 0.3 G and increased to a value of 1.8 G. At that point the airplane stalled. This accelerated stall occurred at a KIAS of about 156 kts.", "probable_cause": "The flight crew's improper use of flight controls in response to the catastrophic failure of the right engine during a critical phase of flight, which led to an accelerated stall and loss of control of the airplane. Contributing to the loss of control was a lack of crew coordination in response to the emergency. The right engine failed from the rupture of the 9th to 10th stage removable sleeve spacer in the high pressure compressor because of the spacer's vulnerability to cracks."}