{"url": "https://www.baaa-acro.com/crash/crash-iai-1124a-westwind-meadow-lake-2-killed", "date": "Jan 27, 1994 at 0855 LT", "type": "IAI 1124 Westwind", "operator": "Millar%20Western", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Edmonton - Meadow Lake", "msn": "380", "yom": 1982, "flight_number": null, "city": "Meadow Lake", "zone": "Saskatchewan", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 15600, "captain_hours_type": 1000, "copilot_hours": 3200, "copilot_hours_type": 1500, "aircraft_hours": 4810, "circumstances": "The privately owned Israel Aircraft Industries (IAI) Westwind II aircraft was en route from the Edmonton Municipal Airport, Alberta, to the Meadow Lake aerodrome, Saskatchewan. Low ceilings and reduced visibility were reported in the vicinity of the destination aerodrome. The crew completed a straight-in instrument approach to runway 08 at Meadow Lake, and began a circling procedure to the south of the aerodrome in order to set up to land on runway 26. The aircraft passed overhead the aerodrome at an altitude of approximately 400 feet above ground level (agl). It then turned and proceeded in level flight towards the southeast. Approximately two and one-half miles from the aerodrome, the aircraft entered a number of steep-banked rolling manoeuvres. Immediately following these manoeuvres, the aircraft descended and struck the ground in a nose-high, slightly right-wing-low attitude. The ground-strike produced very high deceleration forces. The aircraft broke into several sections, internal fuel tanks ruptured, and fuel was sprayed forward and outward from the initial impact point. A severe post-crash fire erupted and engulfed the entire wreckage trail. Emergency medical service and firefighting crews responded from the town of Meadow Lake and were on the scene within minutes of the accident. Both pilots died in the crash.", "probable_cause": "While circling to land on runway 26, the aircraft performed a non-typical circling procedure at a lower than published circling altitude, leading to loss of control consistent with an accelerated stall, and descended into terrain before recovery could be completed. Whiteout conditions may have contributed to this occurrence."}