{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-near-gai-3-killed", "date": "Feb 6, 2016 at 1244 LT", "type": "PZL-Mielec AN-2", "operator": "Light Air", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Plain, Valley", "schedule": "Sterlitamak – Zilair – Akyar – Orsk – Akyar – Sterlitamak", "msn": "1G219-54", "yom": 1986, "flight_number": null, "city": "Gai", "zone": "Orenburg oblast", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4332, "captain_hours_type": 1204, "copilot_hours": 454, "copilot_hours_type": 454, "aircraft_hours": 6952, "circumstances": "The crew was performing a flight from Sterlitamak to Orsk and return via Zilair and Akyar, taking part to an oil pipeline survey mission on behalf of the oil company Transneft. While flying at low height in marginal weather conditions, the crew initiated a turn when the single engine impacted the ground and crashed in a snowy field located 2 km southwest of Gai, about 25 km north of Orsk. The aircraft was destroyed by impact forces and all three occupants were killed. There was no fire. At the time of the accident, the visibility was reduced to 800 metres and down to 300 metres locally. The cloud base was at 90 metres with freezing fog. ", "probable_cause": "Most probably the fatal accident with An-2 RA-40204 aircraft was caused by spatial disorientation by the crew turning in visibility restriction conditions (fog) and \"whiteout\" of snow underlying surface that resulted in uncontrolled descending and aircraft ground impact. \r\nMost probably the following factors contributed to the accident:\r\n- Incorrect evaluation of weather conditions by the crew resulted in unreasonable decision to perform VFR flight,\r\n- Flight operation at the unauthorized law height above ground,\r\n- Lack of IFR operation skills, training and checks for minima reduction by PIC were formal, weather conditions during operations didn't comply with assigned minima requirements."}