{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46e-1-cs-columbus-2-killed", "date": "May 16, 1948 at 2042 LT", "type": "Curtiss C-46 Commando", "operator": "Slick-Airways2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Newark – Chicago – Denver – Burbank – San Francisco", "msn": "2938", "yom": 1945, "flight_number": null, "city": "Columbus-Rickenbacker (Lockbourne AFB)", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2580, "captain_hours_type": 600, "copilot_hours": 4675, "copilot_hours_type": 1354, "aircraft_hours": 5641, "circumstances": "The flight departed from Newark, New Jersey, at 1733 May 16, 1948, for Chicago, Illinois, Denver, Colorado, Burbank, and San Francisco, California. In addition to a crew consisting of Captain William R. McCauley and Copilot Jack R. Foote, the flight carried 5,280 pounds of fuel, and 10,263 pounds of cargo. According to the hourly weather reports available to the crew in Newark prior to departure, thunderstorm activity which existed over the vicinity of Goshen and Fort Wayne, Indiana, was moving eastward. Chicago Municipal Airport was reported to have a ceiling of 2,000 feet. The flight plan specified a cruising altitude of 4,000 feet to Chicago, the first intended point of landing. South Bend, Indiana, was designated as the alternate airport. No unusual incident was reported for approximately the first two hours of the trip, then, at 1931 the flight reported over Cleveland, Ohio, at 4,000 feet, stating that there was extreme turbulence approximately five miles east of the Cleveland Airport. At this time the flight acknowledged receipt of a weather report from Toledo, Ohio, to the effect that light thunderstorms with cloud to cloud lightning were moving northeasterly from Toledo. At 2013 the flight reported at 4,000 feet over Mansfield, Ohio, 58 miles south southwest of Cleveland. The crew stated that they had changed course to the south to avoid thunderstorms, and intended to proceed to Columbus, Ohio, in accordance with visual flight rules. A special weather observation taken at Cleveland at 2003 which reported a ceiling of 2,000 feet, visibility 10 miles, light rain, wind from the northwest at 30 miles per hour with strong gusts, and cloud to cloud and cloud to ground lightning was transmitted to the flight Cleveland Radio also transmitted a weather observation taken at Columbus at 1930 which reported an unlimited ceiling, visibility of 15 miles, and wind from the south at 14 miles per hour. After acknowledging receipt of this weather information, the flight stated \"For your information advise no one to go through the turbulence we just went through.\" The next position report was received at 2032 at which time the flight reported being five miles north of Columbus. Following this report it was cleared by Columbus Tower for landing. In reply the flight stated to the tower, \"We are declaring an emergency. Our rudder is locked, and I don’t think we will have any directional control on the ground.\" A landing approach was made for runway twenty-three, 4,490 feet long. Information concerning wind direction and velocity was transmitted repeatedly by the tower to the flight throughout the course of the approach. Although the first touchdown on runway 23 appeared normal, power was immediately applied and the aircraft took off. The crew then informed the tower that they wished to land directly into the wind, which at that time was from the south at five to ten miles per hour. They were accordingly cleared to land on runway eighteen, 3,580 feet long. The second approach appeared normal, and a touchdown was made on the runway without any apparent difficulty, but power was again applied and the flight took off again. When the flight reached a point 2 1/2 miles east of the field in its left circle of the field, it was observed to spin to the ground. Flames were observed immediately after the crash.", "probable_cause": "The Board determines that the probable cause of this accident was the in-flight failure of the fuselage carry-in structure beneath the fin, due to extreme turbulence.\r\nThe following factors were considered as contributory:\r\n- The aircraft was flown through severe turbulence approximately one-half hour before the accident,\r\n- The rivets and fuselage skin immediately beneath the vertical fin failed during flight,\r\n- The separation of the fuselage skin allowed the vertical fin to rock across its longitudinal axis until the fuselage carry-in structure beneath the fin failed completely,\r\n- The failure of the vertical fin caused loss of control of the aircraft, and it crashed."}