{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-kaduna-2-killed", "date": "May 24, 2011 at 1154 LT", "type": "Beechcraft 90 King Air", "operator": "Shoreline%20Energy", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Old Kaduna - Old Kaduna", "msn": "LJ-805", "yom": 1979, "flight_number": null, "city": "Old Kaduna", "zone": "Kaduna", "country": "Nigeria", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9665, "circumstances": "On 24th May, 2011 at 11:54 h, a Beechcraft C90 aircraft with nationality and registration marks N364UZ, operated by Shoreline Energy International Limited (SEIL), departed Old Kaduna (Military) airport on a test flight with a pilot and another person onboard with three hours fuel endurance. The test flight was on a visual flight rules (VFR) flight plan. According to an eye witness, the aircraft sound was unusual and the aircraft seemed not to be gaining altitude after takeoff. Another eye witness (a local farmer), stated that he saw the aircraft moving up and down with increasing and decreasing engine sound. Thereafter, the aircraft impacted a mango tree, turned and crashed. The local farmer further stated that he and some military personnel tried all they could to rescue the occupants inside the aircraft but their efforts were not successful. At 11:59 h, the aircraft crashed on a farm-land 878 meters short of RWY 23 (military) and engulfed into flames. The two occupants were fatally injured. Dornier Aviation Nigeria AIEP (DANA) and Nigerian Air Force (NAF) fire-fighting personnel were dispatched immediately. There was no direct access between the runway and the accident site, which delayed the fire trucks from reaching the aircraft at accident site on time. The accident occurred in day light, in visual meteorological conditions (VMC).", "probable_cause": "Causal Factor:\r\nInability of the pilot to control the aircraft to landing due to inadequate power to enable the pilot maintain the appropriate approach profile (height, speed and glide path) to cover the required distance to threshold.\r\nContributory factors:\r\n1. Non-adherence to approved storage procedure.\r\n2. Non-adherence to approved return from storage procedure.\r\n3. Inadequate regulatory oversight by the authority on flight operation and maintenance of foreign registered aircraft in Nigeria."}