{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-200-palm-beach", "date": "Apr 5, 1999 at 0945 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Carib-Air%20Cargo", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Palm Beach - Kissimmee", "msn": "188", "yom": 1968, "flight_number": null, "city": "Palm Beach County Park-Lantana", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8000, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16659, "circumstances": "The pilot reported that prior to takeoff, he completed a preflight inspection of the airplane that included checking the engine oil quantity. The line personnel topped off the oil reservoirs, and reportedly secured the engine oil reservoir filler caps. Approximately two minutes into the flight, the right engine oil pressure warning light illuminated. The pilot informed Palm Beach Approach Control of the engine oil pressure problem, shut down the right engine, and returned to Lantana. As the flight approached runway 03, the pilot heard a radio transmission from another airplane taxiing for takeoff. As the pilot continued the approach, with full flaps extended, he elected to go-around 1500 feet from the approach end of the 3000-foot runway. The airplane collided with the ground during the go-around maneuver to runway 15. The wreckage examination also disclosed that the right cowling showed oil streaming back from behind the engine and onto the wing strut. Inspection of the oil filler cap revealed that it had not been properly installed. ", "probable_cause": "The pilot's failure to secure the engine oil filler cap during the preflight inspection that resulted the subsequent loss of engine power, and his in-flight decision to attempt a single engine go-around with full wing flaps extended. "}