{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-4b5-seoul", "date": "Aug 5, 1998 at 2201 LT", "type": "Boeing 747-400", "operator": "Korean%20Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tokyo - Jeju - Seoul", "msn": "26400", "yom": 1996, "flight_number": "KE8702", "city": "Seoul-Gimpo", "zone": "Seoul (서울)", "country": "South Korea", "region": "Asia", "crew_on_board": 16, "crew_fatalities": 0, "pax_on_board": 379, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Originally, the flight was a direct one from Tokyo-Narita to Seoul but due to poor weather conditions at destination, the crew diverted to Jeju. The aircraft departed Jeju Airport at 2107LT on the final leg to Seoul-Gimpo Airport. At destination, weather conditions were still poor with heavy rain falls and wind from 220 gusting to 22 knots. After touchdown on runway 14R, the crew started the braking procedure but the aircraft deviated to the right and veered off runway. While contacting soft ground, the aircraft lost its undercarriage and came to rest. All 395 occupants evacuated, among them 20 were slightly injured. The aircraft was damaged beyond repair. ", "probable_cause": "It was determined that the loss of control after touchdown was the consequence of the captain's misuse of the thrust reverser during the landing roll and his confusion over crosswind conditions. Investigations revealed that after touchdown, the n°1 engine thrust reverser did not deploy because the n°1 engine power lever's position did not allow the reverser to be deployed. The following contributing factors were identified:\r\n- Poor weather conditions, \r\n- Cross wind component, \r\n- Wet runway surface, \r\n- Poor braking action."}