{"url": "https://www.baaa-acro.com/crash/crash-pilatus-u-28a-near-djibouti-city-4-killed", "date": "Feb 18, 2012 at 1918 LT", "type": "Pilatus PC-12", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Djibouti City - Djibouti City", "msn": "0736", "yom": 2006, "flight_number": null, "city": "Djibouti City", "zone": "Djibouti City District", "country": "Djibouti", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 2316, "captain_hours_type": 2213, "copilot_hours": 1245, "copilot_hours_type": 1245, "aircraft_hours": null, "circumstances": "On 18 February 2012, at approximately 1918 local time (L), a United States Air Force U-28A aircraft, tail number 07-0736, crashed five nautical miles (NM) southwest of Ambouli International Airport, Djibouti. This aircraft was assigned to the 34th Special Operations Squadron, 1st Special Operations Wing, Hurlburt Field, FL, and deployed to the 34th Expeditionary Special Operations Squadron, Camp Lemonnier, Djibouti. The aircraft was destroyed and all four aircrew members died instantly upon impact. The mishap aircraft (MA) departed Ambouli International Airport, Djibouti at 1357L, to accomplish a combat mission in support of a Combined Joint Task Force. The MA proceeded to the area of responsibility (AOR), completed its mission in the AOR and returned back to Djiboutian airspace at 1852L arriving overhead the airfield at 1910L to begin a systems check. The MA proceeded south of the airfield at 10,000 feet (ft) Mean Sea Level (MSL) for 10 NM then turned to the North towards the airfield, accomplished a systems check and requested entry into the pattern at Ambouli International Airport. This request was denied due to other traffic, and the MA was directed to proceed to the west and descend by Air Traffic Control (ATC). The MA began a left descending turn to the west and was directed by ATC to report final. The mishap crew (MC) reported they were passing through 4,000 ft MSL and would report when established on final approach. The MA, continuing to descend, initiated a right turn then reversed the turn entering a left turn while continually and smoothly increasing bank angle until reaching 55 degrees prior to impact. Additionally, the MA continued to steadily increase the descent rate until reaching 11,752 ft per minute prior to impact. The MC received aural “Sink Rate” and “Pull Up” alerts with no apparent corrective action taken. The MA impacted the ground at approximately 1918L, 5 NM southwest of Ambouli International Airport, Djibouti.", "probable_cause": "The MC never lost control of the aircraft; there are no indications of mechanical malfunction; and there are no indications the crew took any actions to control or arrest the descent rate and nose down attitude. The evidence demonstrates that the MC did not recognize the position of the aircraft and, as a result, failed to take appropriate corrective actions. The only plausible reason for the MC not recognizing the situation or reacting to aural alerts is the cognitive disconnect associated with spatial disorientation. The Board President found that the clear and convincing evidence indicated the cause of the mishap was unrecognized spatial disorientation. Additionally, the Board President found by a preponderance of the evidence that failing to crosscheck and ignoring the “Sink Rate” caution substantially contributed to the mishap."}