{"url": "https://www.baaa-acro.com/crash/very-hard-landing-boeing-737-4q8-exeter", "date": "Jan 19, 2021 at 0237 LT", "type": "Boeing 737-400", "operator": "West-Atlantic", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "East Midlands – Exeter", "msn": "25114/2666", "yom": 1994, "flight_number": "NPT05L", "city": "Exeter", "zone": "Devonshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15218, "captain_hours_type": 9000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew were scheduled to operate two cargo flights from Exeter Airport (EXT), Devon, to East Midlands Airport (EMA), Leicestershire, and return. The co-pilot was the PF for both sectors, and it was night. The sector from EXT to EMA was uneventful with the crew electing to landed with FLAP 40. The subsequent takeoff and climb from EMA to EXT proceeded without event. During the cruise the crew independently calculated the landing performance, using the aircraft manufacturer’s software, on their portable electronic devices. Runway 26 was forecast to be wet, so they planned to use FLAP 40 for the landing on Runway 26, with AUTOBRAKE 3. With both pilots being familiar with EXT the PF conducted a short brief of the pertinent points for the approach. However, while they did mention that the ILS had a 3.5° glideslope (GS), they did not mention that the stabilized approach criteria differed from that on a 3° GS. From the ATIS they noted that the weather seemed to be better than forecast and the surface wind was from 230° at 11 kt. The ATC provided the flight crew with radar vectors from ATC to the ILS on Runway 26 at EXT. The landing gear was lowered and FLAP 25 selected before the aircraft intercepted the GS. FLAP 40 (the landing flap) was selected on the GS just below 2,000 ft amsl. With a calculated VREF of 134 kt and a surface wind of 10 kt the PF planned to fly the approach with a VAPP of 140 kt. At about 10 nm finals, upon looking at the flight management computer, the PM noticed there was a 30 kt headwind, so a VAPP of 144 kt was selected on the Mode Control Panel (MCP). The crew became visual with the runway at about 1,000 ft aal. The PF then disconnected the Auto Pilot and Auto Throttle; the Flight Directors remained on. As the wind was now starting to decrease, the VAPP was then reduced from 142 to 140 kt at about 600 ft aal. As the wind reduced, towards the 10 kt surface wind, the PF made small adjustments to the power to maintain the IAS at or close to VAPP. At 500 ft radio altimeter (RA) the approach was declared stable by the crew, as per their standard operating procedures. At this point the aircraft had a pitch attitude of 2.5° nose down, the IAS was 143 kt, the rate of descent (ROD) was about 860 ft/min, the engines were operating at about 68% N1  and the aircraft was 0.4 dots above the GS. However, the ROD was increasing and soon thereafter was in excess of 1,150 ft/min. This was reduced to about 300 ft/min but soon increased again. At 320 ft RA, the aircraft went below the GS for about 8 seconds and, with a ROD of 1,700 ft/min, a “SINK RATE” GPWS alert was enunciated. The PF acknowledged this and corrected the flightpath to bring the aircraft back to the GS before stabilizing slightly above the GS; the PM called this deviation too. As the PF was correcting back to the GS the PM did not feel there was a need to take control. During this period the maximum recorded deviation was ¾ of a dot below the GS. At about 150 ft RA, with a ROD of 1,300 ft/min, there was a further “SINK RATE” GPWS alert, to which the PM said, “WATCH THAT SINK RATE”, followed by another “SINK RATE” alert, which the PF responded by saying “AND BACK…”. The commander recalled that as the aircraft crossed the threshold, at about 100 ft, the PF retarded the throttles, pitched the aircraft nose down, from about 5° nose up to 4° nose down, and then applied some power in the last few feet. During these final moments before the landing, there was another “SINK RATE” alert. The result was a hard landing. A “PULL UP” warning was also triggered by the GPWS, but it was not audible on the CVR. The last surface wind transmitted by ATC, just before the landing, was from 230° at 10 kt. During the rollout the commander took control, selected the thrust reversers and slowed down to taxi speed. After the aircraft had vacated the runway at Taxiway Bravo it became apparent the aircraft was listing to the left. During the After Landing checks the co-pilot tried to select FLAPS UP, but they would not move. There was then a HYDRAULIC LP caution. As there was still brake accumulator pressure the crew were content to taxi the aircraft slowly the short distance onto Stand 10. Once on stand the listing became more obvious. It was then that the crew realized there was something “seriously wrong” with the aircraft. After they had shut the aircraft down, the flight crew requested that the wheels were chocked, and the aircraft be connected to ground power before going outside to inspect the aircraft. Once outside a hydraulic leak was found and the airport RFFS, who were present to unload the aircraft, were informed.", "probable_cause": "The aircraft suffered a hard landing as a result of the approach being continued after it became unstable after the aircraft had past the point where the crew had declared the approach stable and continued. Despite high rates of descent being observed beyond the stable point, together with associated alerts the crew elected to continue to land. Had the approach been discontinued and a GA flown, even at a low height, while the aircraft may have touched down the damage sustained may have been lessened. While the OM did not specifically state that an approach was to remain stable beyond the gate on the approach, the FCTM was specific that, if it did not remain stable, a GA should be initiated. The commander may have given the co-pilot the benefit of doubt and believed she had the ability to correct an approach that became unstable in the final few hundred feet of the approach. However, had there been any doubt, a GA should be executed."}