{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226t-merlin-iiib-winslow-2-killed", "date": "Apr 23, 2021 at 1530 LT", "type": "Swearingen SA226T Merlin III", "operator": "Global Air", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": null, "msn": "T-394", "yom": 1981, "flight_number": null, "city": "Winslow", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On April 23, 2021, about 1530 mountain standard time, a Swearingen SA226-T(B) twin-engine airplane, N59EZ, was destroyed when it was involved in an accident near Winslow, Arizona. The pilot and passenger were fatally injured. The airplane was operated as a Title 14 Code of Federal Regulations Part 91 personal flight. The airplane departed from Scottsdale Airport (SDL), Scottsdale, Arizona, about 1412 and was destined for Winslow-Lindbergh Regional Airport (INW), Winslow, Arizona. No flight plan was filed and there was no contact with air traffic control during the flight. Radar tracking depicted the airplane accomplishing several turning maneuvers in the vicinity of the Winslow airport and general accident area at elevations ranging from 7,100 ft mean sea level (msl) to 4,850 ft msl for about two minutes before the radar track ends. The airplane came to rest in a rock quarry adjacent to Arizona State Route 87 about 4 miles east of the Winslow Airport. The entire airplane was contained within a flat portion of the quarry; the sides of the rock quarry were about 40 ft in elevation and surrounded the accident site. A postcrash fire consumed the wreckage. The first identified point of impact was a disturbance to the ground about 10 ft from a barb-wire fence; the wood posts were fractured, and the barbwire was pulled out, the two metal posts about 12 ft apart were not damaged or disturbed. The debris path was on a 028° heading that led to the main wreckage. The main wreckage was about 410 ft from the first identified point of impact and came to rest inverted. Both wings separated from the fuselage, and both engines separated from their respective wings. The two four-bladed propellers were found at the accident site, both propeller assemblies had separated from their respective engines and were found in the debris field. ", "probable_cause": null}