{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-denver", "date": "May 12, 2021 at 1023 LT", "type": "Swearingen SA226 Metro II", "operator": "Key%20Lime%20Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Salida – Denver", "msn": "TC-280", "yom": 1978, "flight_number": "LYM970", "city": "Denver-Centennial", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On May 12, 2021, at 1023 mountain daylight time, a Cirrus SR22, N416DJ, and a Swearingen SA226TC, N280KL, collided in flight while approaching to land at Centennial Airport (APA), Englewood, Colorado. There were no injuries on either airplane. N416DJ was operated as a Title 14 Code of Federal Regulations (CFR) Part 91 personal flight, and N280KL was operated as a Title 14 CFR Part 91 positioning flight. N416DJ departed APA for a local flight about 0921, and N280KL departed the Salida Airport (ANK), Salida, Colorado, about 0956. A review of preliminary air traffic control (ATC) communications and Automatic Dependent Surveillance-Broadcast (ADS-B) data provided by the Federal Aviation Administration (FAA) revealed that, N416DJ was performing a right-hand traffic pattern for runway 17R at APA, and N280KL was on final approach for runway 17L at APA, when the collision occurred. Both airplanes were in communication with air traffic control during their respective approaches to the airport. About 1022:43, N280KL was about 5.5 nm from APA and had completed a right turn to align with the final approach course to runway 17L. At this same time, N416DJ was on the downwind leg of the righthand traffic pattern for runway 17R just before he commenced a right turn to the base leg of the traffic pattern. N280KL continued its approach and remained aligned with runway 17L. N416DJ continued the right-hand traffic pattern through the base leg, and then began to turn toward the final approach course for the runway as depicted in Figure 1. The airplanes collided at 1023:53 when they were about 3.2 nm from APA. N280KL was aligned with runway 17L while N416DJ was turning from base to final and heading about 146° when the collision occurred. After the impact, N280KL declared an emergency, continued to APA, and landed successfully on runway 17L without further incident. The pilot of N416DL reported that the airplane was not controllable after the impact and he deployed the Cirrus Airframe Parachute System (CAPS). N416DJ came to rest about 3 nm north of APA.", "probable_cause": null}