{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-giv-fort-lauderdale", "date": "Aug 21, 2021 at 1340 LT", "type": "Gulfstream GIV", "operator": "SN 1124 LLC", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "1124", "yom": 1989, "flight_number": null, "city": "Fort Lauderdale-Executive", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 11, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On August 21, 2021, about 1340 eastern daylight time, a Gulfstream Aerospace G-IV airplane, N277GM, was substantially damaged when it was involved in an accident at the Fort Lauderdale Executive Airport (FXE), Fort Lauderdale, Florida. The four crew members and 10 passengers were not injured. The airplane was operated as a Title 14 Code of Federal Regulations Part 91 personal flight. The pilot-in-command (PIC) reported that after a routine taxi to the runway he initiated the takeoff on runway 9. As the takeoff roll progressed, he recalled that the normal callouts were made, and nothing was abnormal until the airplane reached about 100 to 110 knots, at which point he felt a “terrible shimmy” that “progressively got worse and worse.” He initiated an immediate aborted takeoff with braking and thrust reversers and it seemed that the airplane was slowing; however, the airplane veered off the runway and the right main landing gear struck a concrete slab holding approach lighting equipment. The airplane came to a stop shortly after impacting the concrete slab. The second-in-command pilot reported that the taxi and initial takeoff roll were normal. As the airplane passed through 80 knots, he recalled feeling a “slight shimmy” and “a little rattle” between the rudder pedals, which “intensified dramatically.” The PIC then aborted the takeoff by reducing the power to idle, applying thrust reversers, and applying brakes. During the abort procedure, the nose dropped, and it became apparent that “the nose gear collapsed.” The airplane continued to maintain the runway centerline for a short period of time but then veered to the right, off the runway and came to a stop. He then opened the main cabin door, and the passengers immediately exited. A third non-type rated observer pilot seated in the jumpseat reported a similar account of the accident sequence. A Federal Aviation Administration inspector responded to the accident site the day of the accident. The airplane came to rest in a sandy grass area about 200 ft to the right of the runway 9 centerline. The left main landing gear did not collapse; however, the right main landing gear was displaced upward and punctured the inboard aft section of the right wing which resulted in substantial damage. Examination of the runway and surrounding grass areas found several items of debris. Moving east in the direction of the takeoff roll, the first component located on the runway was the nose landing gear (NLG) pip pin that is normally seated in the NLG torque link. It was found about  2,215 ft from the main wreckage. Continuing down the runway, about 1,315 ft from the main wreckage, the bulk of the NLG shock strut assembly, trunnion and truss, both tires, and lower scissor link were located intact and impact damaged. The safety pin, that normally is installed through the NLG pip pin was found intact with the separated NLG still attached to its lanyard cord. The NLG upper scissor link was located in the grass a few hundred feet from the runway centerline. Figure 1 shows a still image captured by the FXE Airport Authority drone shortly after the accident. Additional photographs have been added to the drone image to show the location of swivel tire marks and where components were located on the runway as noted with the red circles. ", "probable_cause": null}