{"url": "https://www.baaa-acro.com/crash/crash-pacific-aerospace-750xl-falcon-3000-near-tiniroto-2-killed", "date": "Dec 12, 2016 at 0857 LT", "type": "PAC 750XL - Pacific Aerospace Corporation", "operator": "Farmers%20Air", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Mountains", "schedule": null, "msn": "117", "yom": 2005, "flight_number": null, "city": "Tiniroto", "zone": "Gisborne District Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8518, "captain_hours_type": 3210, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8028, "circumstances": "At approximately 0500 hrs, 12 December 2016, the pilot of ZK-JPU, arrived at Gisborne Aerodrome. The pilot was accompanied by the operator’s recently employed (trainee) loader driver and already at the hangar was a senior loader driver. The pilot conducted the preflight checks of the aircraft for the day’s agricultural aircraft operations. Earlier that morning the Managing Director of the operator had called the pilot of ZK-JPU. The Managing Director requested that after finishing the first aerial topdressing task at Tauwharetoi Station and prior to the next planned task at Waimaha Station, the pilot complete a task at Pembroke Station. This was because the Managing Director was unwell and unable to undertake the Pembroke Station task as planned. The pilot of ZK-JPU agreed to the additional task. The original work plan for the day was for both loader drivers to attend the first task at Tauwharetoi Station, with the senior loader driver providing oversight for the trainee loader driver. The pilot and the senior loader driver were then to proceed to the second task of the day, while the trainee loader driver was scheduled to return to the aerodrome with the loader truck from the first task. The expectation was for the pilot to go straight from the Tauwharetoi Station task to the Pembroke Station task and then proceed to Waimaha Station. ZK-JPU departed Gisborne Aerodrome at approximately 0515 hrs with the pilot and both loader drivers on board. The aircraft was to operate from a nearby private airstrip where the loader truck was already located, as the task had been commenced the previous week. The aircraft landed at the airstrip at approximately 0530 hrs and the pilot assisted the senior loader driver to get the truck ready, double-checking the calibration of the weigh scales and fuel drain, before commencing the task at approximately 0600 hrs. On the day of the accident another pilot from the same operator, who was operating a similar Pacific Aerospace Ltd 750XL, ZK-XLA, was aerial topdressing an area of Bushy Knoll Station, operating off the Tongataha airstrip. Bushy Knoll Station is to the north of Tauwharetoi Station, alongside the route to the next two tasks scheduled for ZK-JPU at Pembroke and Waimaha Stations. The pilot of ZK-XLA commenced operating at approximately 0555 hrs and completed two to three loads before hearing the pilot of ZK-JPU over the radio at approximately 0615 hrs. The brief conversation that followed consisted of an exchange of greetings and description of locations and intentions. Both pilots then continued with their tasks without further direct communication. On completion of the first task the pilot of ZK-JPU landed at the private airstrip and instructed the senior loader driver to pack up the gear and head back to base. The senior loader driver refuelled the aircraft with 100 litres of fuel, packed up the gear and gave the trainee loader driver the radio which had been used to communicate with the pilot. After a 15 minute break the pilot of ZK-JPU was observed by the senior loader driver getting into the left seat of the aircraft and the trainee loader driver into the right seat. The senior loader driver observed ZK-JPU take off, and then departed the airstrip in the loader truck, to return to the aerodrome. At approximately 0850 the pilot of ZK-XLA received a radio call from the pilot of ZKJPU asking “are you breaking left or right?” followed by the pilot of ZK-JPU stating “I am to your left”. ZK-JPU was then observed by the pilot of ZK-XLA flying behind and to the left of ZK-XLA. The pilot of ZK-XLA advised the pilot of ZK-JPU that he was “sowing the boundary of Bushy Knoll Station […] finishing my run and […] turning right to head back to the airstrip”. Spanning the valley near the boundary of Bushy Knoll Station, near to where the pilot of ZK-XLA was operating were a set of 110 kV high voltage power lines (consisting of six wires termed ‘conductors’, supported by towers). These conductors comprised the two circuits supplying electricity to Gisborne and the East Coast region. The span traverses the valley approximately east-west and the height above terrain at the mid-span of the bottom two conductors (the lowest point of the span) was approximately 200 ft. At 0857 hrs the power supply to Gisborne and the East Coast was interrupted. Finishing the topdressing run, the pilot of ZK-XLA commenced a right climbing turn in order to return to the airstrip and sighted ZK-JPU over his right shoulder. At this point the pilot of ZK-XLA noted that something was trailing from the left wing of ZKJPU. Realising that the item trailing from ZK-JPU’s wing was a wire, the pilot of ZKXLA transmitted “you are trailing wire’’, however no response was received from ZK-JPU. The pilot of ZK-XLA witnessed ZK-JPU continue down the valley, slowly rolling to the left before impacting terrain, approximately 700 m further to the south. A postimpact fire ensued with the pilot of ZK-XLA observing “a lot of black smoke”. The pilot of ZK-XLA immediately commenced circling the accident site and attempted to call the operator via cellphone. Unable to make contact the pilot activated the emergency communications facility on the flight following equipment installed in the aircraft and reported the accident to Gisborne Tower. The accident occurred in daylight at 0857 hrs, approximately 24 NM W of Gisborne Aerodrome, at Latitude: S 38° 44' 30.85\" Longitude: E 177° 28' 37.41\".", "probable_cause": "Conclusions\r\n3.1 The aircraft struck six 110 kV high voltage power lines.\r\n3.2 The pilot likely experienced inattentional blindness, in that the pilot’s attention was likely engaged on the other aircraft and thus the pilot failed to perceive the visual stimuli.\r\n3.3 The pilot was appropriately rated and licensed to conduct the flight.\r\n3.4 Research has shown that striking a wire that the pilot was aware of usually occurred because something changed, such as a last minute change of plan.\r\n3.5 The pilot elected to change the plan at the last minute and detour during the positioning flight to an area where a pilot from the same operator was also conducting aerial topdressing.\r\n3.6 The pilot did not conduct a hazard briefing for the area about to be flown and thus did not afford himself the most accurate and well informed mental model of the area the pilot elected to operate in.\r\n3.7 Several human factors likely influenced the pilot’s decision-making and risk perception leading to the decision to change the original plan and deviate from the minimum heights as stipulated by CAR 91.311 and operators SOPs.\r\n3.8 The safety investigation did not identify any mechanical defects which may have contributed to the accident.\r\n3.9 The accident was not survivable."}