{"url": "https://www.baaa-acro.com/crash/crash-vickers-812-viscount-amarillo", "date": "Jul 8, 1962 at 0706 LT", "type": "Vickers Viscount", "operator": "Continental%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Amarillo – Lubbock – Midland – San Angelo – Austin", "msn": "354", "yom": 1958, "flight_number": "CO210", "city": "Amarillo", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 13, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16466, "captain_hours_type": 1338, "copilot_hours": 4470, "copilot_hours_type": 1798, "aircraft_hours": 11164, "circumstances": "A Continental Air Lines Vickers-Armstrongs Viscount Model 812, N243V, was landed wheels-up, almost immediately following takeoff from the Amarillo Municipal Airport, Amarillo, Texas, on July 8, 1962, at approximately 0706LT. There were no serious injuries to any of the 13 passengers or 3 crew members. The aircraft was destroyed by fire. After normal lift-off and landing gear retraction, the captain was momentarily distracted by rainwater from the window channel falling on his left shirt sleeve and he inadvertently allowed the aircraft to settle until Nos. 2 and 3 propellers struck the runway. No. 4 engine and propeller were damaged by pieces of metal thrown from the No. 3 propeller. Increasingly severe vibration, a rapidly developing right wing heaviness, and sudden and excessive rise of exhaust gas temperatures of Nos. 2 and 3 engines dictated an immediate emergency landing. This was effected, wheels up, in a harvested wheat field approximately 6,930 feet beyond the end of runway 21 and in a direction 21 degrees to the right of its extended centerline.", "probable_cause": "The Board determines that the probable cause of this accident was the captain's diversion of his attention during takeoff which allowed the aircraft to settle to the runway striking the Nos. 2 and 3 propellers."}