{"url": "https://www.baaa-acro.com/crash/crash-learjet-45-wallops-flight-facility", "date": "Oct 27, 1998 at 1456 LT", "type": "Learjet 45", "operator": "Learjet", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Wallops Flight Facility - Wallops Flight Facility", "msn": "45-004", "yom": 1998, "flight_number": null, "city": "Wallops Flight Facility", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13073, "captain_hours_type": 767, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 339, "circumstances": "The Learjet was participating in water ingestion tests, which required multiple landing rolls through a diked pool on the runway. On one of the landing rolls, the airplane's left main landing gear and nose landing gear tracked through the pool, while the right main landing gear tracked outside the pool. The airplane veered to the left, departed the left side of the runway, and struck a pickup truck parked adjacent to the runway. The airplane came to rest inverted and on fire. Formal hazard identification and risk management procedures were not employed and no alignment cues were in place on the runway to facilitate pool entry alignment. Further, the accident truck, other vehicles, heavy equipment, and personnel were placed hundreds of feet inside the FAA recommended runway-safe and object-free areas during the test. ", "probable_cause": "The failure of the pilot to obtain/maintain alignment with the water pool, which resulted in the loss of control. Factors in the accident were the inadequate preflight planning of the flight test facility and the airplane manufacturer which resulted in hazards in the test area and the subsequent collision of the airplane with a vehicle. "}