{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226t-merlin-iiib-farmingdale", "date": "Jun 20, 2016 at 1758 LT", "type": "Swearingen SA226T Merlin III", "operator": "Ponderosa%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "White Plains - Farmingdale", "msn": "T-297", "yom": 1978, "flight_number": null, "city": "Farmingdale-Republic", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11450, "captain_hours_type": 410, "copilot_hours": 1300, "copilot_hours_type": 5, "aircraft_hours": 4500, "circumstances": "According to the pilot in command (PIC), he was conducting an instructional flight for his \"new SIC (second in command),\" who was seated in the left seat. He reported that they had flown two previous legs in the retractable landing gear-equipped airplane. He recalled that, during the approach, they discussed the events of their previous flights and had complied with the airport control tower's request to \"keep our speed up.\" During the approach, he called for full flaps and retarded the throttle to flight idle. The PIC asserted that there was no indication that the landing gear was not extended because he did not hear a landing gear warning horn; however, he was wearing a noise-cancelling headset. He added that the landing gear position lights were not visible because the SIC's knee obstructed his view of the lights. He recalled that, following the flare, he heard the propellers hit the runway and that he made the decision not to go around because of unknown damage sustained to the propellers. The airplane touched down and slid to a stop on the runway. The airplane sustained substantial damage to the fuselage bulkheads, longerons, and stringers. The SIC reported that the flight was a training flight in visual flight rules conditions. He noted that the airspace was busy and that, during the approach, he applied full flaps, but they failed to extend the landing gear. He added that he did not hear the landing gear warning horn; however, he was wearing a noise-cancelling headset. The Federal Aviation Administration Aviation Safety Inspector that examined the wreckage reported that, during recovery, the pilot extended the nose landing gear via the normal extension process. However, due to significant damage to the main landing gear (MLG) doors, the MLG was unable to be extended hydraulically or manually. He added that an operational check of the landing gear warning horn was not accomplished because the wreckage was unsafe to enter after it was removed from the runway. The landing gear warning horn was presented by an aural tone in the cockpit and was not configured to be heard through the pilots' noise-cancelling headsets. When asked, the PIC and the SIC both stated that they could not remember who read the airplane flight manual Before Landing checklist. ", "probable_cause": "The pilot-in-command's failure to extend the landing gear before landing and his failure to use the Before Landing checklist. Contributing to the accident was the pilots' failure to maintain a sterile cockpit during landing."}