{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-near-zlatoust-6-killed", "date": "Dec 30, 1947", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Chelyabinsk – Kazan – Moscow", "msn": "18421005", "yom": 0, "flight_number": "SU020", "city": "Zlatoust", "zone": "Chelyabinsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2316, "circumstances": "The crew left Chelyabinsk Airport at 1215LT, established contact with RDS Koltsovo and was instructed to proceed to the altitude of 1,500 meters, although this was lower than the minimum safe altitude of 2,100 meters on the route Chelyabinsk - Kazan. An hour later, the crew encountered poor weather conditions with a cloud base at 200 meters, heavy snow falls and an estimated horizontal visibility less than 4 km. While cruising at the altitude of 1,145 meters, the twin engine aircraft hit the slope of Mt Taganay located about 20 km north of Zlatoust. The wreckage was found in an isolated and mountainous area a day later, the aircraft was destroyed by impact forces and a post crash fire and all six occupants have been killed. The aircraft was carrying a load of various goods consisting of grinding wheels, boxes and a furnace-type PET-8 for a total of 2,298 kilos. ", "probable_cause": "The crew was authorized to fly at an altitude of 1,500 meters while the minimum prescribed altitude was fixed at 2,100 meters. It was reported that weather datas compiled prior to the flight were incomplete in that the person in charge of preparing the file for the crew remained asleep. Despite this situation, the crew decided to leave the airport of Chelyabinsk while they had no specific information about the weather and although they have not been cleared to land in Kazan Airport."}