{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-near-calabar-5-killed", "date": "May 21, 2002 at 1942 LT", "type": "Let L-410", "operator": "Sky Executive Aviation Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Plain, Valley", "schedule": "Abuja – Port Harcourt – Calabar", "msn": "85 14 02", "yom": 1985, "flight_number": "SXC401", "city": "Calabar", "zone": "Cross River", "country": "Nigeria", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8086, "circumstances": "On the day of the accident, the aircraft departed Abuja with the call Sign SXC401 en route Port Harcourt conveying 2 passengers on revenue basis. Before the commencement of the flight, the Chief Engineer was reported to have replaced the \"Carbon brush\" of the starboard starter generator. The source of this pair of carbon brushes is questionable. This flight was uneventful as the passengers disembarked and the aircraft picked up fuel for Port Harcourt. The aircraft departed Port Harcourt at 1750 hrs UTC with five souls on board (all crewmembers), estimating Calabar at 1827 hrs UTC. At 1800 hrs UTC, the aircraft was in contact with Calabar Tower at 5,000 feet, reporting 5 Souls-On-Board and an endurance of 3 hrs 30 minutes. The crew also requested for the hourly weather report and the control tower passed the 1700 hours weather report as \"surface wind 140°/ 09 knots, visibility 10km, slight thunderstorm, cloud base scattered 300 metres, few CB N-SE 690 m broken at 9,000 m, QNH 1008 and temperature 27°C\". The aircraft was also instructed to maintain the 5,000 feet level and to expect no delay for the VOR approach to runway 03. At 1809 hrs UTC, the aircraft was at 35 nautical miles to the station when the pilot requested for descent clearance and the controller gave him a clearance to 2,500 feet and to position for a straight-in approach to runway 03 and the crew acknowledged. At 1824 hrs UTC, the pilot reported having electrical problem and therefore declared emergency. Thereafter, the pilot requested for increase in the intensity of the approach lights, the controller informed him that the approach lights were, already, at their maximum intensity. The controller procedurally then requested for the aircraft's altitude but the response of the pilot was \"we are coming to Calabar\" and at 1830 hrs the aircraft reported 16 nautical miles to Calabar. The control tower at 1833 hrs UTC, wanted to establish the position of the aircraft by requesting repeatedly \"Your position? Your position?\" to which the response was \"standby, standby\". The verbal query continued until 1842 hrs and when there was no response from the aircraft, the controller alerted the airport fire services to be on the standby for further instructions. When the controller could no longer establish contact with the aircraft, he then contacted the relevant agencies for search and rescue operations. Meanwhile, the aircraft on descent impacted trees and crashed in a marshy area located 22 km from the airport. The aircraft was destroyed and all five occupants were killed. ", "probable_cause": "The probable cause of the accident was the premature departure of the aeroplane from the normal Minimum Safe Altitude of 2,500 feet without ATC clearance until it flew into the terrain. The contributory factor was the emergence of electrical problem on the aircraft on the commencement of its approach. The problem might have distracted the attention of the pilots from having undistorted focus on the instruments. Another contributory factor was the unfavourable weather conditions of low cloud base and thunderstorm, which impaired the visibility at the critical time of the descent."}