{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-62m-havana-171-killed", "date": "Sep 3, 1989 at 1857 LT", "type": "Ilyushin II-62", "operator": "Cubana-de-Aviacion-2", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "City", "schedule": "Havana - Cologne - Milan", "msn": "3850453", "yom": 1989, "flight_number": "CU9646", "city": "Havana-José Martí (Rancho Boyeros)", "zone": "La Habana", "country": "Cuba", "region": "Central America", "crew_on_board": 11, "crew_fatalities": 11, "pax_on_board": 115, "pax_fatalities": 115, "other_fatalities": 45, "total_fatalities": 171, "captain_hours": 13000, "captain_hours_type": 4761, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1326, "circumstances": "Flight CU9646 was a charter flight from Havana to Milan with an intermediate stop in Cologne, carrying Italian tourists. One hour before takeoff, a low pressure zone was located about nine km from the airport of Havana with winds up to 40 km/h. The wind force increased during the last minutes prior to takeoff and the captain decided to takeoff despite unsafe conditions. After takeoff from runway 05, while in initial climb, gear was raised and the crew selected flaps from 30° to 15°. The aircraft encountered difficulties to gain height, struck elements of the ILS antenna located 220 meters past the runway end, struck a hill and crashed in a residential area. The aircraft disintegrated on impact and several houses and buildings were destroyed. Among the 126 occupants, a men aged 22 was seriously injured while all 125 other occupants were killed as well as 45 people on the ground. Eight days later, the only survivor died from his injuries. At least 59 people on the ground were injured. It was determined that wind was gusting up to 100 km/h at the time of the accident with downdrafts and windshear located in the climb path. ", "probable_cause": "The accident was the consequence of the combination of the following factors: \r\n- The existence of an adverse atmospheric phenomenon of windshear at low altitude, of which existence the captain did not know,\r\n- An unwise decision of the pilot in command to not postpone the takeoff given the existing weather conditions near the airfield."}