{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-near-bontang-4-killed", "date": "Aug 24, 2012 at 0810 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Intan-Angkasa-Air-Service", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Plain, Valley", "schedule": "Samarinda - Bontang", "msn": "31-7852065", "yom": 1978, "flight_number": null, "city": "Bontang", "zone": "East Kalimantan", "country": "Indonesia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 17547, "captain_hours_type": 4250, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16743, "circumstances": "On 24 August 2012, a Piper Chieftain PA-31-350 aircraft, registered PK-IWH, was being operated by PT. Intan Angkasa Airservice to conduct an aerial survey (aero magnetic) flight at a survey area located north of Bontang, East Kalimantan. There were 4 persons on board; one pilot, one security officer and two surveyors. Based on the flight plan submitted by the Pilot in Command (PIC) to the Briefing Office, the flight was planned with an altitude of 3,000 feet AMSL en-route and 500 feet AGL while surveying the area. The fuel endurance was for 6 hours flight time and the aircraft equipped with an Emergency Locator Transmitter (ELT). The aircraft departed from Temindung Airport (WALS), Samarinda at 0751 local time (LT - 2351 UTC). At 0004 UTC, the pilot informed to the Temindung Control Tower controller (Temindung Tower) that the aircraft was abeam Tanjung Santan descending from 3,000 feet and established contact with Bontang Info officer (Bontang Info). At 0005 UTC, the pilot informed the Bontang Info that the aircraft altitude was 300 feet and estimated over Bontang at 0011 UTC. Bontang info acknowledged this transmission and advised the pilot to report when the flight left the Bontang Area. At 0010 UTC, the SureTrack (flight following system) stopped receiving data from the aircraft. The last recorded information was an aircraft speed of 138 knots, heading 352°, latitude 0°8’33” N and longitude 117°12’54” E. At 0600 UTC, the engineer of the PK-IWH aircraft asked the Temindung Tower about the flight as the fuel endurance had been exceeded. The Temindung Tower contacted Bontang Info to get information about the aircraft. After receiving the request, Bontang Info tried to contact the pilot twice and there was no reply. Bontang Info also contacted the Tanjung Bara Airstrip to request information about the aircraft but there was no information. The Temindung Tower reported that:\r\n• at 0610 UTC declared INCERFA (Uncertainty phase);\r\n• at 0630 UTC declared ALERFA (Alert phase);\r\n• at 0700 UTC declared DETRESFA (Distress phase). \r\nAt 0730 UTC, the search and rescue team was assembled; the team consisted of the Temindung Airport Authority, National Search and Rescue, Indonesian Police, Army and Airforce. The search operation was conducted via ground and air using three helicopters. On 26 August 2012 at 0850 UTC, the aircraft wreckage was located by a ground search team on a ridge of Mayang Hill, Bontang at approximately 1,200 feet AMSL at coordinates 00°12’34.3”N, 117°16’57.3”E, 12 NM from Bontang Aerodrome on bearing of 294°. The accident site was within the planned aircraft  survey area. All occupants were fatally injured and the aircraft was destroyed by impact force and post impact fire. ", "probable_cause": "The accident was typical of a Controlled Flight into Terrain (CFIT). Low altitude VFR flying in a low visibility environment limited the pilot’s visibility and increased the probability of impact with terrain."}