{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-209bsf-bogota-2-killed", "date": "Jul 7, 2008 at 0352 LT", "type": "Boeing 747-200", "operator": "Kalitta%20Air-2", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bogotá – Miami", "msn": "22446/519", "yom": 1981, "flight_number": null, "city": "Bogotá-El Dorado", "zone": "Bogotá Capital District", "country": "Colombia", "region": "South America", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 2, "total_fatalities": 2, "captain_hours": 8874, "captain_hours_type": 2874, "copilot_hours": 11373, "copilot_hours_type": 2853, "aircraft_hours": 90613, "circumstances": "Shortly after take off from Bogotá-El Dorado Airport, while climbing by night, the crew informed ATC about engine problems and was cleared for an immediate return. After the crew realized he could not make it, he attempted an emergency landing when the aircraft collided with a farm and crashed in an open field. While all 8 crew members were injured (five seriously), two people in the farm were killed. The aircraft was totally destroyed by impact forces. ", "probable_cause": "The inability of the accident aircraft to maintain flight after the loss of power of two engines.\r\nThe following contributing factors were identified:\r\nA non-recoverable surge on the engine n°4 during the rotation, resulting in a loss of engine power. Contributing to the surge were the combined effects of the inefficient high pressure turbine, excessive blade-tip clearance, reduced cord of the fan blades and of the leading edges and the effects of high altitude. An undetermined anomaly in the engine n°1, which manifested itself during the extra power, resulted in loss of engine power. Contributing to the loss of engine power was inadequate n°1 operation to maintain the proper speed during the ascent of the aircraft, resulting in extra power use and, in turn, exposing the anomaly of the engine."}