{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31p-pressurized-navajo-clarkson-1-killed", "date": "Aug 20, 2004 at 1334 LT", "type": "Piper PA-31-310 Navajo", "operator": "Bill Law Aviation", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Plain, Valley", "schedule": "Batavia – Rochester", "msn": "31-7400215", "yom": 1974, "flight_number": null, "city": "Clarkson-Ledgedale", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 20000, "captain_hours_type": 60, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3516, "circumstances": "The airplane departed from a maintenance facility, after installation of the right engine, with an unknown quantity of fuel. Shortly after takeoff, the pilot reported that he had \"lost\" an engine. He requested vectors for the departure airport, then amended his request to an alternate destination. From the original distress call to the last recorded radar target, approximately 2 ½ minutes, the airplane descended from 2,500 feet to 700 feet and slowed from 190 knots to about 87 knots. Several witnesses described the engine sound as \"rough\", and \"cutting in and out\" before the airplane descended out of view and sounds of impact were heard. The left wing was consumed by post-crash fire. Forty gallons of fuel were drained from the right inboard and nacelle tanks. Only trace amounts of fuel were visible in the right outboard tank. Both fuel selectors were found in the outboard tank position. Examination of flight times and ground-maintenance run times revealed that the engines were run for approximately 3 hours with the outboard tanks selected. The outboard tanks each held 40 gallons, for a total of 80 gallons. According to the pilot's operating manual, the fuel consumption rate at the maximum endurance power setting was 28 gallons per hour.", "probable_cause": "The pilot's mismanagement of the fuel by his failure to select the proper fuel tank which resulted in starvation and subsequent loss of engine power in both engines."}