{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t3-t1040-cheyenne-nuiqsut-5-killed", "date": "Sep 18, 2000 at 1510 LT", "type": "Piper PA-31 Cheyenne", "operator": "Cape%20Smythe%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Deadhorse – Nuiqsut", "msn": "31-8275013", "yom": 1982, "flight_number": "6C181", "city": "Nuiqsut", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 2517, "captain_hours_type": 165, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10157, "circumstances": "The airline transport certificated pilot was landing at a remote village on a scheduled domestic commuter flight with nine passengers. The accident airplane, a twin-engine turboprop certified for single-pilot operations, was equipped with a fuselage-mounted belly cargo pod. Witnesses saw the airplane touch down on the gravel runway with the landing gear retracted. The belly pod lightly scraped the runway for about 40 feet before the airplane transitioned to a climb. The propeller tips did not contact the runway. As the airplane began climbing away from the runway, the landing gear was extended. The airplane climbed to about 100 to 150 feet above the ground, and then began a descending left turn, colliding with tundra-covered terrain. A postcrash fire destroyed the fuselage, right wing, and the right engine. The flaps were found extended to 40 degrees. The balked landing procedure for the airplane states, in part: \"power levers to maximum, flaps to 15 degrees, landing gear up, and then retract the flaps.\" Five passengers seated in the rear of the airplane survived the crash. The survivors did not recall hearing a gear warning horn before ground contact. The airplane was landed gear-up eight months before the accident. The airplane was nearly landed gear-up four months before the accident. Each time, a landing gear warning horn was not heard by the pilot or passengers. A postcrash examination of the airplane and engines did not locate any preimpact mechanical malfunction. The FAA's Fairbanks, Alaska, FSDO conducted an inspection of the operator six months before the accident, and recommended the operator utilize two pilots in the accident airplane. Following the accident, the Fairbanks FSDO required the operator to utilize two pilots for passenger flights in the accident airplane make and model. \n", "probable_cause": "The pilot's failure to extend the landing gear, his improper aborted landing procedure, and inadvertent stall/mush. Factors in the accident were an improper adjustment of the landing gear warning horn system by company maintenance personnel, and the failure of the pilot to utilize the pre-landing checklist."}