{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-188a-electra-knoxville", "date": "Aug 6, 1962 at 1731 LT", "type": "Lockheed L-188 Electra", "operator": "American-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dallas – Little Rock – Memphis – Knoxville – Washington DC – New York", "msn": "1019", "yom": 1958, "flight_number": "AA414", "city": "Knoxville", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 67, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 20634, "captain_hours_type": 878, "copilot_hours": 11000, "copilot_hours_type": 423, "aircraft_hours": 6947, "circumstances": "On August 6, 1962, at 1731 e.s.t., Flight 414, an American Airlines, Inc., Lockhead Electra, N 6102A, crashed during a landing on runway 4L at McGhee-Tyson Airport, Knoxville, Tennessee. Sixty-seven passengers and five crew members were on board the aircraft. All escaped injury except one passenger who suffered a minor injury. The aircraft was substantially damaged. During the landing made by the captain in an area of thunderstorm activity and heavy rain showers, the aircraft skidded to the right off the runway. It struck a newly constructed taxiway the surface of which was approximately 17 inches above ground level, causing failure of the right main landing gear. The right wing became separated front the aircraft. The remainder of the aircraft continued to deviate to the right off the side of the runway for a short distance and came to rest 3,010 feet from the approach end of the runway on a heading of 200 degrees magnetic.", "probable_cause": "The Board determines that the probable cause of this accident was the loss of directional control as a result of the improper technique employed in a crosswind landing in adverse weather conditions."}