{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-cairns", "date": "Mar 9, 2002 at 1729 LT", "type": "Cessna 340", "operator": "Bee Bee Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Bankstown – Cairns", "msn": "340A-0680", "yom": 1979, "flight_number": null, "city": "Cairns", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot of a Cessna 340 departed Bankstown, NSW at 1223 ESuT, for Townsville, Qld via Walgett, St George, Roma, Emerald and Clermont. He reported that he climbed the aircraft to 16,000 ft and adopted a long range power setting of about 49% which equated to a true air speed (TAS) of 168 kts and a fuel burn of 141 lbs per hour. As the pilot approached the ‘OLDER’ waypoint north of Clermont, he reviewed his fuel situation and, because of a strong tailwind decided to continue on to Cairns. He informed an enroute controller of his decision and requested, for fuel planning purposes, a clearance to allow him to track in the opposite direction on a one-way air route. The controller was unable to approve his request but offered the pilot a direct track to Biboohra, a navigation aid 20 NM west of Cairns. The pilot accepted the amended track with the intention of later requesting a more direct route to Cairns. About 15 minutes later, the pilot requested a more direct track, but was told to call the approach controller for a possible clearance. He contacted the approach controller and told the controller that he had minimum fuel. The controller asked the pilot if he was declaring an emergency, to which he replied affirmative. The pilot later commented that he did this in the hope of expediting his arrival. He was instructed to descend to 6,500 ft and track direct to Cairns. The controller asked the pilot if he preferred to join the runway 15 circuit via a left downwind or right downwind, to which the pilot requested to join a left downwind. The pilot later commented that the aircraft fuel flow gauges were indicating a total flow of 140 lbs per hour and the fuel quantity gauges for the selected main tanks, although wandering somewhat, were ‘displaying a healthy amount’ considering that he was about 12 NM from his destination. As the pilot approached 6,500 ft, he requested a clearance for further descent, to which  the controller instructed the pilot to descend to 4,000 ft. As the aircraft descended to 4,000 ft, the pilot saw Cairns City, but could not see the runway at Cairns airport. The aircraft's distance measuring equipment (DME) indicated 9 NM to the DME navigation aid at Cairns Airport. The pilot reported that at about this time, he observed one of the fuel flow gauges indicating zero, while at the same time, one or both engines began to surge and run roughly. He immediately informed the controller of the situation. The controller asked the pilot if he was familiar with a local airstrip (Greenhill which is 10 NM to the southeast of Cairns airport), to which the pilot replied that he wasn't. The controller indicated to the pilot that the strip was situated in his two o'clock position at a range of about two miles and to be aware of power lines and the sugar cane. The pilot was unsure of what to look for and was unable to see the strip, but after conducting a number of steep turns, saw a cleared strip in a field. He decided that he had to land. He extended the landing gear, but realised that the aircraft was too high and attempted a 360-degree steep turn onto final to reposition the aircraft. However, the airspeed was rapidly decreasing and there was insufficient height to complete the approach. At 1729 EST, the aircraft impacted the ground short of the strip and slid for about 20 metres. The pilot was seriously injured and the passengers received minor injuries. ", "probable_cause": "The reason for the initial fuel flow fluctuations was not identified by the pilot. It is likely that the pilot assumed the zero reading indicated impending fuel exhaustion and concentrated on conducting a landing in unfamiliar terrain. During the landing approach the pilot lost control of the aircraft and it descended rapidly to the ground. "}