{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1011-385-1-tristar-1-new-york", "date": "Jul 30, 1992 at 1741 LT", "type": "Lockheed L-1011 TriStar", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York - San Francisco", "msn": "193B-1014", "yom": 1972, "flight_number": "TW843", "city": "New York-JFK", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 12, "crew_fatalities": 0, "pax_on_board": 280, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 20149, "captain_hours_type": 2397, "copilot_hours": 15242, "copilot_hours_type": 2953, "aircraft_hours": 49662, "circumstances": "Immediately after liftoff the stick shaker activated, and the first officer, who was making the takeoff, said 'you got it.' The captain took control, closed the thrust levers, and landed. He applied full reverse thrust and maximum braking, and turned the airplane off the runway to avoid a barrier at the end. A system design deficiency permitted a malfunctioning aoa sensor to cause a false stall warning. The sensor had experienced 9 previous malfunctions, and was inspected and returned to service without a determination on the reason for the intermittent malfunction. The first officer had incorrectly perceived that the airplane was stalling and gave control to the captain without proper coordination of the transfer of control. All 292 occupants were rescued, among them 10 were injured, one seriously. ", "probable_cause": "Design deficiencies in the stall warning system that permitted a defect to go undetected, the failure of twa's maintenance program to correct a repetitive malfunction of the stall warning system, and inadequate crew coordination between the captain and first officer that resulted in their inappropriate response to a false stall warning."}