{"url": "https://www.baaa-acro.com/crash/crash-saab-340a-washington-dc", "date": "Jun 8, 2005 at 2137 LT", "type": "Saab 340", "operator": "United-Express-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "White Plains – Washington DC", "msn": "40", "yom": 1985, "flight_number": "UA7564", "city": "Washington-Dulles", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 27, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4673, "captain_hours_type": 3476, "copilot_hours": 2050, "copilot_hours_type": 620, "aircraft_hours": 41441, "circumstances": "During the approach, the flightcrew was unable to get the right main landing gear extended and locked. After several attempts, while conferring with the checklist and company personnel, the flightcrew performed an emergency landing with the unsafe landing gear indication. During the landing, the right main landing gear slowly collapsed, and the airplane came to rest off the right side of the runway. Examination of the right main landing gear revealed that the retract actuator fitting was secured with two fasteners, a smaller bolt, and a larger bolt. The nut and cotter key were not recovered with the smaller bolt, and 8 of the 12 threads on the smaller bolt were stripped consistent with an overstress pulling of the nut away from the bolt. The larger bolt was bent and separated near the head, consistent with a tension and overstress separation as a result of the smaller bolt failure. The overstress failures were consistent with the right main landing gear not being locked in the extended position when aircraft weight was applied; however, examination of the right main landing gear down lock system could not determine any pre-impact mechanical malfunctions. Further, the right main landing gear retract actuator was tomography scanned, and no anomalies were noted. The unit was then functionally tested at the manufacturer's facility, under the supervision of an FAA inspector. The unit tested successfully, with no anomalies noted.", "probable_cause": "Failure of the right main landing gear to extend and lock for undetermined reasons, which resulted in the right main landing gear collapsing during touchdown."}