{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-5-dk-ennadai-lake-2-killed", "date": "Mar 17, 2000 at 1230 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Points%20North%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Points North Landing - Ennadai Lake", "msn": "12344", "yom": 1944, "flight_number": null, "city": "Ennadai Lake", "zone": "Nunavut", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8200, "captain_hours_type": 840, "copilot_hours": 4300, "copilot_hours_type": 85, "aircraft_hours": null, "circumstances": "The Douglas DC-3 departed Points North Landing, Saskatchewan, about 1125 central standard time on a visual flight rules flight to Ennadai Lake, Nunavut, with two pilots and 6600 pounds of cargo on board. The flight was one of a series of flights to position building materials for the construction of a lodge. The pilots had completed a similar flight earlier in the day. The runway at Ennadai, oriented northeast/southwest, was an ice strip about 2700 feet long by 150 feet wide marked with small evergreens. The ice strip was constructed on the lake, and the approaches were flat, without obstacles. The snow was cleared so there were no snow ridges on the runway ends. The arrival at Ennadai Lake, toward the southwest, appeared to be similar to previous arrivals. The aircraft was observed to touch down nearly halfway along the ice strip, the tail of the aircraft remained in the air, and the aircraft took off almost immediately. The main landing gear was seen to retract. The aircraft reached the end of the runway then abruptly entered a steep, nose-up attitude, banked sharply to the left, turned left, and descended into the ice. The left wing made first contact with the ice. The aircraft rotated around the left wing and struck the ice in a steep, nose-down attitude about 400 feet from the end of the ice strip. There was no fire. The crew were killed instantly. Canadian Forces rescue specialists were air-dropped to the site on the day of the accident.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The pilot lost control of the aircraft while conducting a go-around from a balked landing on an ice strip.\r\n2. The aircraft's centre of gravity (C of G) on the accident flight was beyond the aft C of G limit.\r\n3. The actual C of G of the aircraft at basic operating weight was 16.7 inches aft of the C of G provided in the weight and balance report.\r\n4. The load sheet index number used by the crew was inaccurate.\r\n5. The stack of 2x4 lumber was inadequately secured and may have shifted rearward during the go-around.\r\n6. The crew did not recalculate the aircraft's weight and balance for the second flight.\r\n7. Leaks in the heater shroud allowed carbon monoxide gas to contaminate cockpit and cabin air.\r\n8. The captain's carboxyhaemoglobin level was 17.9%, which may have adversely affected his performance, especially his decision making and his visual acuity.\r\nOther Findings:\r\n1. The carbon monoxide detector had no active warning system. The user directions for the detector, which are printed on the back of the detector, are obscured when the detector is installed.\r\n2. The company maintenance facility overhauled the heater as required by the Transport Canada-approved inspection program.\r\n3. Although the manufacturer's maintenance instruction manual for the S200 heater, part number 27C56, lists inspection and overhaul procedures, it does not specify their intervals.\r\n4. No maintenance instructions are available for the heater, part number 27C56. The company maintenance facility did not conduct inspections, overhauls, or pressure decay tests as specified for later manufactured heaters."}