{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-602p-pamplona-1-killed", "date": "Feb 20, 2020 at 1819 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "Prive38", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sabadell - Pamplona", "msn": "62P-0897-8165027", "yom": 1981, "flight_number": null, "city": "Pamplona", "zone": "Navarre", "country": "Spain", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3049, "circumstances": "On Thursday, 20 February 2020, the Piper PA-60-602P aircraft, with registration EC-HRJ, took off from Sabadell Airport (LELL) bound for Pamplona Airport (LEPP). At 17:51:43 hours local time, when the aircraft was in the vicinity of the SURCO waypoint, a sudden change in course from 300º to 317º was observed on the aircraft's radar trace. Moments later, at 17:53:12, the pilot of the aircraft contacted the Madrid air control units to report problems with one of his engines, adding verbatim: “I’m not sure if I’ve lost the turbo”. In a subsequent communication with the same air traffic controller, at 17:57:22 h, the pilot stated: \"I’ve lost an engine”. At 17:57:58 h, the pilot contacted the controller of the Pamplona control tower. The controller asked him if he required any assistance, and the pilot replied that he did not. At 18:16:15 h, the pilot told the control tower controller that he was on right base for runway 33. The controller cleared him to land and asked him to notify him when he was on final. At 18:19:40 h, the control tower controller alerted the airport Fire Extinguishing Service (SEI) when he saw the aircraft crash and a column of smoke coming from the wreckage area. The aircraft had impacted the ground during the final approach manoeuvre. As it fell, it hit and severed a power line. The pilot, who was the sole occupant of the aircraft, was killed during the accident. The impact and subsequent fire completely destroyed the aircraft.\n", "probable_cause": "The investigation concluded the probable cause of the accident was that the aircraft lost control on final approach to runway 33 as a result of flying with asymmetrical power."}