{"url": "https://www.baaa-acro.com/crash/crash-latecoere-631-le-cap-ferret-12-killed", "date": "Mar 28, 1950 at 1730 LT", "type": "Latécoère 631", "operator": "Société d'Exploitation du Matériel Aéronautique Français (SEMAF)", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Biscarosse - Biscarosse", "msn": "03", "yom": 15, "flight_number": null, "city": "Le Cap Ferret", "zone": "Gironde", "country": "France", "region": "Europe", "crew_on_board": 12, "crew_fatalities": 12, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1001, "circumstances": "The crew (engineers and pilots) were engaged in a test flight on this third prototype consisting of controls in flight following severe vibrations on the engines. While cruising at an altitude of 1,200 meters, the six engines seaplane lost a part on the right wing, went out of control and crashed into the sea about one km northwest of Le Cap Ferret. The crew of a trawler and a French Marine boat found some debris floating on water but unfortunately, all 12 occupants were killed. \r\nCrew:\r\nRobert Boissard, Chief Pilot,\r\nMr. Dumonteil, mechanic, \r\nKléber Coulé, mechanic, \r\nHenri Faugère, mechanic, \r\nAlexandre Lepêcheur, radio operator,\r\nMr. Renaud, technical director, \r\nMr. Remaury, technician, \r\nAdj Grezel, \r\nMr. Malpot, engineer, \r\nMr. Bouchery, techincal director, \r\nMr. Martin, engineer,\r\nMr. Brolin, engineer. ", "probable_cause": "The inquiry came to the conclusion that the probable cause of the accident was a fatigue failure of the aileron control couplings resulting from the simultaneous occurrence of several vibratory phenomena: the cruising speed of the propeller with a 7/16 reducing gear in resonance with the critical vibratory frequencies of the wing and the aileron (excitation amplified by the propeller cuffs); and the occurrence of extreme aileron flutter, aerodynamically induced as a result of failure of the linkage between the aileron and the slat. In such conditions, it was impossible for the crew to detect these phenomena before their results became irreparable."}