{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-i-biggin-hill-5-killed", "date": "Mar 30, 2008 at 1438 LT", "type": "Cessna 500 Citation", "operator": "Ross Aviation - UK", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "City", "schedule": "Biggin Hill – Pau", "msn": "500-0287", "yom": 1975, "flight_number": null, "city": "Biggin Hill", "zone": "London Metropolis", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 8278, "captain_hours_type": 18, "copilot_hours": 4533, "copilot_hours_type": 70, "aircraft_hours": 5844, "circumstances": "Pilot B arrived at Biggin Hill Airport, Kent, at about 1100 hrs for the planned flight to Pau, France. At about 1130 hrs he helped tow the aircraft from its overnight parking position on the Southern Apron to a nearby handling agent whose services were being used for the flight. A member of staff employed by the handling agent saw Pilot B carry out what was believed to be an external pre-flight check of the aircraft. Pilot B also asked another member of staff to provide a print out of the weather information for the flight. Pilot A arrived at about 1145 hrs and joined Pilot B at the aircraft. Witnesses described nothing unusual in either pilots’ demeanour. Three passengers arrived at the handling agent at about 1300 hrs and waited in a lounge whilst their bags were taken to the aircraft and loaded into the baggage hold in the nose. A member of the handling agency, who later took the passengers to the aircraft, reported that Pilot B met them outside the aircraft. After they had all boarded, the agent heard Pilot B say that he would give them a safety brief. Pilot B then closed the aircraft door. Pilot A called for start at 1317 hrs. He called for taxi at 1320 hrs and the aircraft was cleared to taxi to the holding point A1. No one could be identified as a witness to the aircraft’s start or subsequent taxi to the holding point. At 1331 hrs ATC cleared the aircraft to line up on Runway 21 and at 1332 hrs cleared it to take off. Both clearances were acknowledged by Pilot A. The takeoff was observed by the tower controller who stated that everything appeared normal. No transmissions were made between the aircraft and ATC until one minute after takeoff when, at 1334 hrs, the following exchange was made. Numerous witnesses reported seeing the aircraft at around this time flying over a built-up area, about 2 nm north-north-east of Biggin Hill Airport, where it was observed flying low, passing over playing fields and nearby houses. Witnesses reported that the aircraft was maintaining a normal flying attitude with some reporting that the landing gear was up and others that it was down. Some described seeing it adopt a nose-high attitude and banking away from the houses just before it crashed. Some witnesses stated that there was no engine noise coming from the aircraft whilst others stated that they became aware of the aircraft as it flew low overhead due to the loud noise it was making, as if the engines were at high thrust. Two witnesses described hearing the aircraft make a pulsing, intermittent noise. The location of witnesses and the description of the aircraft noise they heard are also shown in Figure 1. Having flown over several houses at an extremely low height the aircraft’s left wing clipped a house which bordered a small area of woodland. The aircraft then impacted the ground between this and another house and caught fire. There were no injuries to anyone on the ground but all those on board the aircraft were fatally injured. ", "probable_cause": "The following contributory factors were identified:\r\n1. It is probable that a mechanical failure within the air cycle machine caused the vibration which led to the crew attempting to return to the departure airfield.\r\n2. A missing rivet head on the left engine fuel shut-off lever may have led to an inadvertent shut-down of that engine.\r\n3. Approximately 70 seconds prior to impact neither engine was producing any thrust.\r\n4. A relight attempt on the second engine was probably started before the relit first engine had reached idle speed, resulting in insufficient time for enough thrust to be developed to arrest the aircraft’s rate of descent before ground impact. "}