{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-17g-10-bo-flying-fortress-nevada-2-killed", "date": "Jan 4, 1944 at 1020 LT", "type": "Boeing B-17 Flying Fortress", "operator": "USAAF", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Las Vegas - Las Vegas", "msn": "6370", "yom": 1941, "flight_number": null, "city": "Nevada", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Crew took off on their mission at approximately 0700. Everything was in order. The airplane was serviced with three hundred (300) pounds of oxygen. They climbed to twenty thousand (20,000) feet and remained at this altitude for approximately one and one-half (1-1/2) hours. The crew put on their oxygen masks between nine thousand (9000) and ten thousand (10,000) feet as instructed by the pilot. The mission at twenty thousand (20,000) feet was uneventful and after returning down to nine thousand (9000) feet, the crew was instructed to remove their oxygen masks and proceed with the camera mission after meeting the fighter plane at the designated rendezvous point. The first student in the front section of the airplane had spent his film in the upper turret. While in the turret he took his parachute with him and placed it on the floor beside the turret. Nothing happened during his course of operation except that the interphone went out of commission in the turret. This student returned to the nose of the airplane and the second student took his position in the turret and loaded his film. He also took his parachute pack with him and placed it on the floor beside the turret. This student noticed that the interphone was out of commission, but the instructor ordered him to continue anyhow. By this time, the engineer had checked everything very carefully, reported to the pilot, and returned to the radio compartment to keep out of the way of the gunners. After the second student had started tracking with the turret, he noticed it had suddenly stopped working. He tried to move the controls again, but they wouldn't move. Luckily it had stopped in the almost stowed position with the guns rearward, so he could easily get out. Just a split second after the turret had stopped, the student noticed a violent array of sparks flying around his legs, and without any further delay, he backed out of the turret and down into the forward tunnel, taking his parachute pack with him, beating out the fire on it which had been ignited by the sparks. By the time the student was in the nose, the cabin was filling rapidly with smoke and intense heat. The pilot and co-pilot stated that they saw a flame emerging from underneath the center of the turret, shooting toward the left side of the cockpit, similar to a strong blow torch or acetylene torch flame. It was a bluish or red flame. They stated that the heat was intense and the smoke had an acrid, irritating odor.\r\nThe co-pilot then went down into the nose of the airplane. The crew already had their parachutes on and upon his command, relayed from the pilot, and started bailing out. One student who had become frantic was crying out that someone had taken his parachute, and started grabbing violently at the parachutes of the other crew members,. He grabbed the co-pilot's parachute and pulled the rip cord, spilling the parachute. The co-pilot gathered it up in his arms, held the pilot chute in his hand and jumped out. It opened, but had been burned and ripped somewhat, which is probably the reason that the co-pilot was injured on landing. The pilot had followed the co-pilot down into the nose and picked up the students parachute from the floor and handed it to him and them jumped himself. This student had put the parachute on upside down and followed the pilot out. His parachute opened and he landed uninjured. In the rear of the airplane, the instructor noticed the smoke and started up through the bomb bay with a fire extinguisher, but realized it was useless because the fire and smoke were too intense. He heard someone shout, \"bail out\" and immediately returned to the radio compartment and closed the door behind him. By this time all but one in the rear of the airplane had their parachutes on and were ordered to bail out. One student in the rear of the airplane couldn't find his parachute and the instructor told him it was located in the radio room. The first man standing at the side door, was pushed out by the man behind him. The remaining crew stated that his parachute had opened. This man was never found by any searching party and it is believed that his parachute opened but that he may have been injured while landing in some inaccessible place and died of exposure and injuries. One man was found among the wreckage with is parachute on. This is the man who had to return to the radio compartment to get his parachute and probably was suffocated before he could get back to the escape door. Another man was found after he had walked out of the mountains for a distance of about fifteen (15) miles away from the scene of he accident. He received minor injuries. The pilot and co-pilot had assembled eight (8) other men on a mesa and they proceeded to walk out of the mountains and were picked up by the searching party approximately thirty-six (36) hours after the accident. An intensive searching party, working by reliefs, was organized by this field, equipped with ground to air communications. Also a posse organized by the deputy sheriff of Alamo, Lincoln County, Nevada, equipment with pack horses, aided in the search. It took four (4) days for a ground party to reach the scene of the accident.\n\r\nSource : http://www.av.qnet.com/~carcomm/wreck30.htm", "probable_cause": "It is believed that this accident was caused by an electrical failure within the junction box or turret hose, the resultant heat of which burned through the oxygen supply line, which contained oxygen at two-hundred and fifty (250) pounds pressure per square inch. The fire thus being supported by four (4) bottles of oxygen, burned through the metal junction box and set fire to everything in the immediate vicinity. The torch like flame was probably produced by the burning gases being forced out of the junction box through some hole in the left side of the junction box."}