{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3c-s13-cg-waterman-3-killed", "date": "May 22, 1989 at 1045 LT", "type": "Douglas DC-3", "operator": "Condor Enterprises", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Aurora - Aurora", "msn": "13456", "yom": 1944, "flight_number": null, "city": "Waterman", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4000, "captain_hours_type": 30, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17177, "circumstances": "Purpose of the flight was to provide training to the copilot for a new (part 135) operation. Witnesses observed the DC-3, N47CE, maneuvering at 3,000 feet msl (approximately 2,200 feet agl) with the gear and flaps extended. Shortly after completing a turn, the aircraft was observed in a nose high attitude, then it entered a spin. According to witnesses, the aircraft seemed to stop spinning, but it entered a secondary spin and crashed before recovery was accomplished. The pilot-in-command (pic) had 30 hours of flight time in the make/model of aircraft. No record was found to show that the pic had been trained in approaches to stalls. No preimpact part failure/malfunction of the aircraft was found, though it was destroyed by impact and fire. The copilot was a retired airline pilot, who had flown the DC-3 in the 1940's. An examination of the wreckage revealed the gear and flaps were (fully) extended and the elevator trim was set in a full nose up (trim) position.  All three occupants were killed. ", "probable_cause": "The pilot-in-command (pic) failed to provide adequate supervision while training the copilot and allowed the aircraft to enter a stall/spin, then did not provide adequate remedial action to properly recover from the spin. Factors related to the accident were: use of excessive elevator trim, the pic's lack of training (in approaches to stalls) and lack of experience in the make/model of aircraft, and the copilot's lack of recent experience in the make/model of aircraft."}