{"url": "https://www.baaa-acro.com/crash/crash-sud-aviation-se210-caravelle-10b3-near-fujairah-112-killed", "date": "Mar 14, 1972 at 2004 LT", "type": "Sud-Aviation SE-210 Caravelle", "operator": "Sterling-Airways-2", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Colombo – Bombay – Dubai – Ankara – Copenhagen", "msn": "267", "yom": 1970, "flight_number": "NB296", "city": "Fujairah", "zone": "Fujairah (الفجيرة‎)", "country": "United Arab Emirates", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 106, "pax_fatalities": 106, "other_fatalities": 0, "total_fatalities": 112, "captain_hours": 6600, "captain_hours_type": 58, "copilot_hours": 3785, "copilot_hours_type": 1400, "aircraft_hours": 6674, "circumstances": "Following an uneventful flight from Bombay at 33,000 feet, the crew contacted Dubai control to obtain the latest weather bulletin: wind from 040° at 8 knots, visibility 10 km and 5/8 clouds at 2,000 feet. Approaching via radial 084, the crew was informed he will be able to start the descent at 1955LT. However, at 1949LT (six minutes too early), the crew informed ATC he was ready for the descent as his position was 95 NM from Dubai. At that moment, the plane was in fact 162 NM from the destination but the crew was not aware of it. After being cleared to descend at 4,000 feet, pilots were informed that they may choose either Runway 30 or 12, to which they respond that they will attempt a direct approach on Runway 30. By night, the captain thought he was seeing the lights of the city of Dubai when they are actually those of Fujairah located 95 km east. Despite that the crew had difficulties to tune into NDB frequency, the crew continued the descent when, at an altitude of 1,600 feet, the airplane struck the slope of a mountain. The wreckage was about 92 kilometers east of Dubai Airport. The airplane disintegrated on impact and all 112 occupants were killed, among them 74 Danish whom six crew members, 20 Swedish, 12 Norwegians, four Finns and two West Germans. ", "probable_cause": "At the time of the accident, weather conditions were not bad but the presence of clouds and reduced visibility by night hampered the crew in their ground recognition. The use of a flight plan with errors and outdated information or a misreading of the weather radar settings or the combination of both allowed the crew to start the descent prematurely, causing the aircraft to approach below the prescribed minimum altitude. A succession of errors within the crew during the descent also allowed the aircraft to be too far to the north from the approach path as the wreckage was located 33 kilometers north to the runway 30 approach path. The fact that pilots visually mistaken the cities of Fujairah and Dubai remained a contributing factor."}