{"url": "https://www.baaa-acro.com/crash/crash-douglas-20c-gander-4-killed", "date": "Oct 27, 1943", "type": "Douglas A-20 Havoc/DB-7 Boston", "operator": "USAAF", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Gander - Gander", "msn": null, "yom": null, "flight_number": null, "city": "Gander", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A few days prior to 27 October 1943, USAAF Major Allen and RCAF Flight Commander F/O Taylor discussed making an \"air fighting practice flight\" where they would spend an afternoon \"chasing each other around for a while\". The plan was that they would start their flights at a sufficient distance from each other that neither would have an advantage, then they would turn into each other as if to attack. It was agreed that in the case of head on attacks, they would break away to port. On 27 October 1943, F/O Taylor in an RCAF Hurricane and a crew of four including Major Allen in an A-20C (registration unknown) took off just before 1700 GMT and flew south west of the aerodrome. According to the testimony of F/O Taylor, when we turned in at approximately 3,000 yds. apart it placed us at a position head on to one another – I, slightly below the Boston; the Boston as diving and I as climbing through about 200 ft. As the distance between us decreased to about 300 yds. the Boston pulled up gradually and turned slightly to port while I turned slightly to port also; it was here I thought we had ample clearance. Then at about 100 yds. the Boston made a rapid and very decisive movement downwards, as if, in my opinion, he was either fixing his sights on me or had lost me for an instant. The upward movement, although begun, was never completed because it was at this instant that our wings collided. We were both turning slightly to port when this movement or manœuvre occurred. As the aircraft brushed right wings, the wing immediately broke off of the Hurricane and the aircraft went into a tight spin. The pilot abandoned the aircraft and parachuted to safety. The other aircraft dove into the ground and crashed, killing all four crew members. \nCrew:\nMaj Sobey F. Allen, pilot,\n2nd Lt Jack K. Schaffner, bombardier, \nSgt Pless E. Moore Jr., radio operator, \nPvt George M. Haynes, gunner. \nSource & photo: Lisa Daly", "probable_cause": "The circumstances of the crash were listed as a \"head on attack between Hurricane (RCAF) and A-20 (USAAF)\" and the cause listed as a \"mid-air collision due to error of judgement on the part of both pilots and insufficient planning\". Both pilots were highly experienced, and no flying regulations had been violated in the activity, but the pilots did not have any previously agreed upon visual clues in case of interrupted radio contact. Had such visuals been agreed upon previous to the flight, the pilots would have had a better idea of what the other was going to do."}