{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-round-rock", "date": "Oct 18, 2005 at 2315 LT", "type": "Cessna 208B Grand Caravan", "operator": "FedEx", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "City", "schedule": "Austin - Fort Worth", "msn": "208B-0105", "yom": 1988, "flight_number": null, "city": "Round Rock", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6600, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10623, "circumstances": "The airplane was fueled with 65-gallons of jet-A in preparation for the evening's flight. The 6,600-hour pilot stated that no abnormalities were noted during the engine start, and takeoff. However; shortly after departure, and after the pilot had leveled off at 7,000-feet, he reported to air traffic control that he had an engine failure and a total power loss. During the descent, the pilot attempted both an air and battery engine restart, but was not successful. The inspection on the engine was conducted on November 30, 2005. The accessory gearbox had a reddish-brown stain visible beneath the fuel pump/fuel control unit. The accessory gearbox was turned; rotation of the drive splines in the fuel pump (splines for the fuel control unit) was not observed. The fuel pump unit was then removed, the area between the fuel pump and accessory gearbox was stained with a reddish brown color. The fuel pump drive splines were worn. Additionally, the internal splines on the fuel pump drive coupling were worn. The wear on the spline drive and coupling prevented full engagement of the spline drives. Both pieces had evidence of fretting, with a reddish brown material present. The airplane had approximately 130 hours since a maintenance inspection (which included inspection of the fuel pump). The engine had accumulated approximately a total time of 9,852 hours, with 5,574 hours since overhaul. ", "probable_cause": "The loss of engine power due to the failure of the engine-driven fuel pump. A contributing factor was the inadequate inspection of the engine driven fuel pump."}