{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-mt-wilson-5-killed", "date": "Dec 10, 1991 at 1642 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Las%20Vegas%20Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Grand Canyon - North Las Vegas", "msn": "31-7652100", "yom": 1976, "flight_number": "6G50", "city": "Mt Wilson", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 2972, "captain_hours_type": 654, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7433, "circumstances": "The commuter flight was enroute to its home airport and over mountainous terrain when it encountered low ceilings and rain showers. The airplane was not certificated for ifr commuter flights. Instead of going to an alternate airport the pilot attempted to maintain visual conditions and requested and received a visual clearance into the tca and advised the controller that his altitude was 5,100 feet msl. His radio transmission became garbled during the clearance read back and shortly thereafter the controller observed the airplane's radar target turn left from its westerly track and disappear from his scope. There were no further communications between the pilot and the controller. When the aircraft failed to arrive at its destination an alnot was issued. Early the next morning the aircraft's wreckage was found impacted in a mountain approximately 10 miles south of course at an elevation of 4100 feet msl. The investigation revealed that the pilot had previously and successfully flown the accident airplane in ifr conditions.  ", "probable_cause": "The pilot-in-command's poor inflight decision by not electing to proceed to an alternate airport and to continue to the flight under visual flight rules into instrument meteorological conditions. The low ceilings and visibilities across the flight route and the mountainous terrain were factors in the accident."}