{"url": "https://www.baaa-acro.com/crash/crash-pacific-aerospace-pac-750xl-taupo-lake", "date": "Jan 7, 2015 at 1216 LT", "type": "PAC 750XL - Pacific Aerospace Corporation", "operator": "Skydive-Taupo", "flight_phase": "Flight", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Taupo - Taupo", "msn": "122", "yom": 2005, "flight_number": null, "city": "Taupo", "zone": "Waikato Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 12, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 588, "captain_hours_type": 14, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 7 January 2015 a Pacific Aerospace Limited 750XL aeroplane was being used for tandem parachuting (or ‘skydiving’) operations at Taupō aerodrome. During the climb on the fourth flight of the day, the Pratt & Whitney Canada PT6A-34 engine failed suddenly. The 12 parachutists and the pilot baled out of the aeroplane and landed without serious injury. The aeroplane crashed into Lake Taupō and was destroyed.", "probable_cause": "The following findings were identified:\r\n- The first compressor turbine blade failed after a fatigue crack, which had begun at the trailing edge, propagated towards the leading edge. The blade finally fractured in tensile overload. The separated blade fragment caused other blades to fracture and the engine to stop.\r\n- The fatigue crack in the trailing edge of the blade was likely initiated by the trailing edge radius having been below the specification for a new blade.\r\n- The P&WC Repair Requirement Document 725009-SRR-001, at the time the blades were overhauled, had generic requirements for trailing edge thickness inspections but did not specify a minimum measurement for the trailing edge radius.\r\n- The higher engine power settings used by the operator since August 2014 were within the flight manual limits. Therefore it was unlikely that the operator’s engine handling policy contributed to the engine failure.\r\n- The operator had maintained the engine in accordance with an approved, alternative maintenance programme, but the registration of the engine into that programme had not been completed. The administrative oversight did not affect the reliability of the engine or contribute to the blade failure.\r\n- It was likely that the maintenance provider had not followed fully the engine manufacturer’s recommended procedure for inspecting the compressor turbine blades. It could not be determined whether the crack might have been present, and potentially detectable, at the most recent borescope inspection.\r\n- The operator had not equipped its pilots with flotation devices to cover the possibility of a ditching or an emergency bale-out over or near water. \r\n- The pilot had demonstrated that he was competent and he had the required ratings. However, it was likely that the operator’s training of the pilot in emergency procedures was inadequate. This contributed to the pilot making a hasty exit from the aeroplane that jeopardized others."}