{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-nevis", "date": "Jul 13, 2004 at 1920 LT", "type": "Learjet 35", "operator": "Aviation Jet Charters", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sint Maarten - Nevis", "msn": "35-459", "yom": 1981, "flight_number": null, "city": "Nevis-Newcastle-Vance W. Amory", "zone": "All Saint Kitts and Nevis", "country": "Saint Kitts and Nevis", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6500, "captain_hours_type": 539, "copilot_hours": 10000, "copilot_hours_type": 539, "aircraft_hours": 9899, "circumstances": "The flightcrew stated that approximately 8 miles out on a visual approach for runway 10 they requested winds and altimeter setting from the control tower. They received altimeter setting 29.95 inches Hg., and winds from 090 degrees at 20 knots. About 5 miles out, in full landing configuration, they checked wind conditions again, and were told 090 at 16 knots. They were holding Vref of 125 knots plus 10 knots on final. The approach was normal until they got a downdraft on short final. The airplane sank and they reacted by immediately adding engine power and increasing pitch, but the airplane continued to sink. The airplane's main landing gear came in contact with the top of the barbwire fencing at the approach end of the runway. The airplane landed short of the threshold. The airplane was under control during the roll out and they taxied to the ramp. A special weather observation was taken at the Vance W. Amory International Airport at 1930, 10 minutes after the accident. The special weather observation was winds 090 at 15 knots, visibility 10 statute miles, scattered clouds at 2,000, temperature 27 degrees centigrade, dewpoint temperature 23 degrees centigrade, altimeter setting 29.95 inches hg.", "probable_cause": "The pilot's encounter with a downdraft."}