{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226ac-metro-ii-rio-gallegos", "date": "Nov 23, 1998 at 1445 LT", "type": "Swearingen SA226 Metro II", "operator": "Kaikén Linéas Aéreas", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lago Argentino - Río Gallegos", "msn": "TC-271", "yom": 1978, "flight_number": null, "city": "Río Gallegos", "zone": "Santa Cruz", "country": "Argentina", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After takeoff from Lago Argentino Airport, a red warning light came on in the cockpit panel, informing the crew about the incomplete retraction of the left main gear. The crew proceeded to a visual inspection and after confirmation that the left main gear was properly secured in its wheel well, the crew decided to continue to Río Gallegos. On approach, the left main gear did not deploy. After the crew failed to extend it manually, he raised the other landing gear and completed a belly landing. On short final, just prior to flare, both engines were shut down and their propellers were feathered. The aircraft landed on its belly, slid for few dozen metres and came to rest. All seven occupants escaped uninjured and the aircraft was damaged beyond repair. ", "probable_cause": "The crew completed a belly landing after it was impossible to extend the left main gear due to the deformation and fracture of the brace support of the gear's extension system. The following contributing factors were reported:\r\n- The left main gear suffered previous incident,\r\n- Marginal weather conditions with rain falls and unfavorable wind component, \r\n- The crew started operations with know deficiencies, \r\n- Inappropriate maintenance and technical controls. "}