{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-hollywood", "date": "Oct 12, 2011 at 1334 LT", "type": "Socata TBM-700", "operator": "SOCATA", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "City", "schedule": "North Perry - North Perry", "msn": "441", "yom": 2008, "flight_number": "SC332", "city": "Hollywood", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11071, "captain_hours_type": 4053, "copilot_hours": 2500, "copilot_hours_type": 5, "aircraft_hours": 593, "circumstances": "The airplane, registered to SV Leasing Company of Florida, operated by SOCATA North America, Inc., sustained substantial damage during a forced landing on a highway near Hollywood, Florida, following total loss of engine power. Visual meteorological conditions prevailed at the time and an instrument flight rules (IFR) flight plan was filed for the 14 Code of Federal Regulations (CFR) Part 91 maintenance test flight from North Perry Airport (HWO), Hollywood, Florida. The airline transport pilot and pilot-rated other crew member sustained minor injuries; there were no ground injuries. The flight originated from HWO about 1216. The purpose of the flight was a maintenance test flight following a 600 hour and annual inspection. According to the right front seat occupant, in anticipation of the flight, he checked the fuel load by applying electrical power and noted the G1000 indicated the left fuel tank had approximately 36 gallons while the right fuel tank had approximately 108 gallons. In an effort to balance the fuel load with the indication of the right fuel tank, he added 72.4 gallons of fuel to the left fuel tank. At the start of the data recorded by the G1000 for the accident flight, the recorded capacity in the left fuel tank was approximately 105 gallons while the amount in the right fuel tank was approximately 108 gallons. The PIC reported that because of the fuel load on-board, he could not see the level of fuel in the tanks; therefore, he did not visually check the fuel tanks. By cockpit indication, the left tank had approximately 105 gallons and the right tank had approximately 108 gallons. The flight departed HWO, but he could not recall the fuel selector position beneath the thrust lever quadrant. He further stated that the fuel selector switch on the overhead panel was in the \"auto\" position. After takeoff, the flight climbed to flight level (FL) 280, and levelled off at that altitude about 20 minutes after takeoff. While at that altitude they received a \"Fuel Low R\" amber warning CAS message on the G1000. He checked the right fuel gauge which indicated 98 gallons, and confirmed that the fuel selector automatically switched to the left tank. After about 10 seconds the amber warning CAS message went out. He attributed the annunciation to be associated with a failure or malfunction of the sensor, and told the mechanic to write this issue down so it could be replaced after the flight. The flight continued and they received an amber warning CAS message, \"Fuel Unbalance\" which the right fuel tank had more fuel so he switched the fuel selector to supply fuel from the right tank to the engine. The G1000 indicates they remained at that altitude for approximately 8 minutes. He then initiated a quick descent to 10,000 feet mean sea level (msl) and during the descent accelerated to Vmo to test the aural warning horn. They descended to and maintained 10,000 feet msl for about 15 minutes and at an unknown time, they received an amber warning CAS message \"Fuel Low R.\" Once again he checked the right fuel gauge which indicated it had 92 gallons and confirmed that the fuel tank selector automatically switched to the left tank. After about 10 seconds the CAS message went out. Either just before or during descent to 4,000 feet, they received an amber CAS message \"Fuel Unbalance.\" Because the right fuel gauge  indicated the fullest tank was the right tank, he switched the fuel selector to supply fuel to the engine from the right tank. The flight proceeded to the Opa-Locka Executive Airport, where he executed an ILS approach which terminated with a low approach. The pilot cancelled the IFR clearance and proceeded VFR towards HWO. While in contact with the HWO air traffic control tower, the flight was cleared to join the left downwind for runway 27L. Upon entering the downwind leg they received another amber CAS message \"Fuel Unbalance\" and at this time the left fuel gauge indicated 55 gallons while the right fuel gauge indicated 74 gallons. Because he intended on landing within a few minutes, he put the fuel selector to the manual position and switched to the fullest (right) tank. Established on final approach to runway 27L at HWO with the gear down, flaps set to landing, and minimum speed requested by air traffic for separation (85 knots indicated airspeed). When the flight was at 800 feet, the red warning CAS message \"Fuel Press\" illuminated  and the right seat occupant with his permission moved the auxiliary fuel boost pump switch from \"Auto\" to \"On\" while he, PIC manually moved the fuel selector to the left tank. In an effort to restore engine power he pushed the power lever and used the manual over-ride but with no change. Assured that the engine had quit, he put the condition lever to cutoff, the starter switch on, and then the condition lever to \"Hi-Idle\" attempting to perform an airstart. At 1332:42, a flight crew member of the airplane advised the HWO ATCT, \"…just lost the engine\"; however, the controller did not reply. The PIC stated that he looked to his left and noticed a clear area on part of the turnpike, so he banked left, and in anticipation of the forced landing, placed the power lever to idle, the condition lever to cutoff, the fuel tank selector to off, and put the electrical gang bar down to secure the airplane's electrical system. He elected to retract the landing gear in an effort to shorten the landing distance. The right front seat occupant reported that the airplane was landed in a southerly direction in the northbound lanes of the Florida Turnpike. There were no ground injuries.", "probable_cause": "The pilot’s failure to terminate the flight after observing multiple conflicting errors associated with the inaccurate right fuel quantity indication. Contributing to the accident were the total loss of engine power due to fuel starvation from the right tank, the inadequate manufacturing of the right fuel gauge electrical harness, and failure of maintenance personnel to recognize and evaluate the reason for the changing fuel level in the right fuel tank."}