{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-cherokee-county-1-killed", "date": "Mar 4, 2017 at 0023 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Michael W. Rogers", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tulsa - Cherokee County", "msn": "421B-0015", "yom": 1970, "flight_number": null, "city": "Cherokee County", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7522, "circumstances": "The 69-year-old commercial pilot was making a personal cross-country flight in the newly purchased airplane. When the airplane was on final approach to the destination airport in night visual meteorological conditions, airport surveillance video showed it pitch up and roll to the right. The airplane then descended in a nose-down attitude to impact in a ravine on the right side of the runway. During the descent over the ravine the right wing came in contact with a powerline that briefly cut power to the airport. Postaccident examination of the airframe, engines, and their components revealed no evidence of mechanical anomalies or malfunctions that would have precluded normal operation. The pilot's toxicology findings identified five different impairing medications: clonazepam, temazepam, hydrocodone, nortriptyline, and diphenhydramine. Although the results were from cavity blood and may not accurately reflect antemortem levels, the hydrocodone, temazepam, and diphenhydramine levels were high enough to likely have had some psychoactive effects. While the exact effects of these drugs in combination are not known, it is likely that the pilot was impaired to some degree by his use of this combination of medications, which likely contributed to his failure to maintain control of the airplane.", "probable_cause": "The pilot's failure to maintain control of the airplane during a night visual landing approach. Contributing to the accident was the pilot's impairment due to his use of a combination of medications."}