{"url": "https://www.baaa-acro.com/crash/crash-cessna-425-conquest-i-helena", "date": "Aug 11, 2021 at 0900 LT", "type": "Cessna 425 Conquest", "operator": "K-Aero", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Faribault - Missoula", "msn": "425-0103", "yom": 1982, "flight_number": null, "city": "Helena", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On August 11, 2021 about 0900 mountain daylight time, a Cessna 425 Conquest 1, N723MB, sustained substantial damage when it was involved in an accident near Helena, Montana. The pilot and two passengers sustained serious injuries. The airplane was operated as a Title 14 Code of Federal Regulations (CFR) Part 91 business flight. The pilot stated that on the morning of the accident, he physically refueled the airplane to full wing tanks by adding an additional 207 gallons of Jet A. Shortly thereafter, he departed from his home airport in Faribault, Minnesota and continued to his destination at a cruise altitude of 24,000 feet mean sea level. Investigators reviewed Air Traffic Control transmissions and flight track data covering the area of the accident using Federal Aviation Administration (FAA) provided Automatic Dependent SurveillanceBroadcast (ADS-B) data. While en route, at 0847:35, the pilot reported to an air traffic controller that the airplane had an engine flame out and requested a descent. The pilot opted to divert from the originally planned destination and contacted Helena approach control. He stated that the airplane was 16  miles from Helena and descending through 19,000 feet advising the controller that he may need to lose altitude to land on runway 27. The controller responded that the pilot could maneuver north of the airport to then align with the right base leg of the traffic pattern to the runway. At 0852:59 the pilot reported to the air traffic controller that he had an hour and a half of fuel on board and about 3 minutes later the airplane made a right turn to the north. At 0857:15, with the airplane about 7,900 feet msl, the pilot reported that the right engine experienced a loss of power (see Figure 1 below). At 0859:02, the pilot reported the airplane was going to collided with trees. The airplane came to rest with the right wing and empennage severed from the fuselage. The pilot noted that the airplane had undergone an annual inspection in March 2021, equating to about 10 flight hours prior to the accident. ", "probable_cause": null}