{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-esperance", "date": "May 13, 1980 at 0745 LT", "type": "Swearingen SA226 Metro II", "operator": "SkyWest%20Airlines%20Australia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Perth - Esperance", "msn": "TC-275", "yom": 1978, "flight_number": null, "city": "Esperance", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 11, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9010, "captain_hours_type": 1155, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Weather conditions at Esperance were fine; there was no cloud, visibility was in excess of 30 km and the surface wind was from the northwest at 5 to 10 knots. The aircraft entered the circuit on a left downwind leg for an approach to Runway 29. The flaps were lowered, firstly a quarter and then half-way, on the downwind leg and the landing gear was extended just before the aircraft turned onto a base leg. This configuration, and an airspeed of 133 knots (best single - engine rate of climb speed), was maintained until after the aircraft was straightened onto final approach. At an altitude of 1100 feet, the pilot considered he was at Decision Height and committed to land. He lowered full flaps and reduced the airspeed to 115 knots. At about this time, as he was retarding the power levers, the right engine flamed out. The pilot reported that he promptly sensed the engine failure and checked the engine instruments while re-opening both power levers. He noted both torque and fuel flow indication s for the right engine were zero. He briefly considered retracting the landing gear and flaps but decided to do neither. Left engine power was increased initially to the maximum available of 940°C ITT (Inter-turbine temperature) and then adjusted to the normal maximum limit of 923°C ITT. The right propeller was feathered. During this period the aircraft banked to the right and turned away from the runway. Its airspeed had reduced and the rate of descent increased. The turn had been opposed but the pilot found that the application of full left rudder and aileron would not enable him to maintain runway heading, although the airspeed was above the minimum control airspeed of 94 knots, specified in the aircraft flight manual. It was evident to the pilot that the aircraft would land short of the aerodrome, amongst trees to the right of the runway approach path. He therefore abandoned his efforts to regain the normal approach path and allowed the aircraft to turn further to the right, towards a large, clear paddock. Just before touchdown, he observed a power pole on his selected landing path and he again turned further right to avoid it. During this turn the right wing tip struck the ground. The nosegear then impacted heavily and collapsed . The aircraft slid and bounced across the ground for 188 metres before coming to rest. Fuel from ruptured line s ignite d under the left engine , but the fire was slow to develop and the occupants were able to make an orderly evacuation . By the time the fire brigade arrived from Esperance township, the fire had spread and most of the aircraft was consumed.\n", "probable_cause": "The right engine had flamed out because of fuel starvation, when a spur gear in the fuel control drive train failed. Five teeth of the spur gear had broken off and the remaining teeth were badly worn. The failures and abnormal wear were due to looseness of the torque sensor housing, in which the spur gear was mounted, allowing the gear to move out of its correct alignment. The housing had probably loosened because of vibration, as its natural frequency was close to some frequencies generated by the engine during normal operation. The following contributing factors were reported:\r\n- The natural frequency of the torque sensor housings in the engines fitted to VH-SWO were susceptible to vibration frequencies generated by the engines during normal operation, \r\n- Vibration loosened the torque sensor housing on the right engine, which in turn led to misalignment of a spur gear in the fuel drive train, failure of the gear and fuel starvation\r\nof the engine,\r\n- The engine failed when the aircraft was being operated in a landing configuration which precluded a successful continuation of the landing approach,\r\n- The landing procedure used by the pilot was in accordance with the operator's Company Operations Manual, which did not appreciate the poor performance and handing' difficulties of the Swearingen SA226TC in the event of an engine failure in the landing configuration. "}