{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-ii-deerfield-1-killed", "date": "Jul 1, 1999 at 1402 LT", "type": "Piper PA-31 Cheyenne", "operator": "Brian Hawley", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Jonesboro – Weyers Cave", "msn": "31-7920081", "yom": 1979, "flight_number": null, "city": "Deerfield", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1857, "captain_hours_type": 24, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4852, "circumstances": "The pilot was descending the airplane from 23,000 feet for an instrument approach. All communications were normal until after he acknowledged an instruction to contact approach control, when radio contact was lost. Radar contact ceased at 11,300 feet due to radar signal reception difficulties. Contact was lost almost directly over the eventual impact site, which was on the eastern side of a small valley. Witnesses on the western side of the valley had seen the airplane flying near them, at treetop level, eastbound, and clear of clouds. About the same time, on the eastern side of the valley where the airplane would impact trees, then terrain, there was heavy rain. The commercial pilot had about 1,850 total flight hours, and had completed a 'Wings III' flight proficiency program and an instrument proficiency program about two months earlier. The airplane had been on a continuous maintenance program. At the accident site, all of the airplane's control surfaces were found, and the engines and propellers displayed signatures consistent with being under power at impact. There were insufficient remains to conduct an autopsy or toxicological testing. Previously, the pilot's father, two uncles, and a male cousin had suffered fatal heart attacks. ", "probable_cause": "Loss of control of the airplane due to pilot incapacitation following a heart attack. "}