{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa26at-merlin-iib-jacksonville-1-killed", "date": "Nov 27, 2003 at 0752 LT", "type": "Swearingen SA26T Merlin II", "operator": "George C. Swanson", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Beaumont – Jacksonville", "msn": "T26-137", "yom": 1969, "flight_number": null, "city": "Jacksonville-Executive at Craig", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8263, "circumstances": "The pilot was on an instrument flight from Beaumont, Texas, to Craig Airport, Jacksonville, Florida. According to the pilot's children who were passengers on the airplane, the pilot knew the destination airport was forecast to have fog upon their arrival. Air traffic controllers informed the pilot east of Tallahassee, Florida, the fog at his destination airport would not lift for at least an hour and a half. The pilot was informed the weather at Saint Augustine, Florida, was clear skies with two miles visibility. The pilot informed the controller that he would slow the airplane and continue to Craig. The pilot was subsequently cleared to descend and provided vectors for the ILS Runway 32 approach at Craig. The pilot informed the controller that he had the current automatic terminal information service (ATIS) information. The ATIS for Craig reported an indefinite ceiling with a vertical visibility of 100 feet, and one-quarter of a mile visibility. The weather minimums for the ILS runway 32 approach is a decision height of 241 feet, and one-half mile visibility. The controller informed the pilot to contact Craig Tower. The pilot contacted Craig Tower, and was instructed to report passing the final approach fix. The controller informed the pilot that Jacksonville International Airport had a runway visual range of more than 6,000 feet, and that airplanes were making it in. The controller asked the pilot what his intentions were in the event he made a missed approach. The pilot replied, \"I got my brother bringing my mom there into your airfield, so I do not know, what do you think is best, what's closest.\" The controller replied Jacksonville was closer than Saint Augustine. The pilot informed the controller that he would go to Jacksonville in the event of a missed approach. The pilot was cleared to land, and there was no further radio contact between the pilot and Craig Tower. The airplane was located a short time later in a wooded area, 1.8 miles from the airport. Postaccident examination of the airplane revealed no preimpact mechanical anomalies.", "probable_cause": "The pilot's descent below decision height while performing an ILS approach with low ceilings and fog, resulting in an in-flight collision with trees and the ground. A factor associated with the accident was the pilot's decision to attempt the instrument approach with weather below  the prescribed minimums."}