{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-new-port-richey-5-killed", "date": "Jul 8, 2009 at 1352 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Q4 Aviation", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "McKinney - Tampa", "msn": "421C-0634", "yom": 1979, "flight_number": null, "city": "New Port Richey", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 1940, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4326, "circumstances": "Prior to the accident flight, the pilot indicated that he was aware of the thunderstorm activity along his route of flight and that he anticipated deviating around the weather as necessary. While enroute to his destination, the pilot requested and was provided both weather information and pilot reports from other aircraft by air traffic control (ATC). Upon encountering an area of thunderstorm activity that extended east-to-west across the route of flight, the pilot reported encountering significant turbulence, and then downdrafts of 2,000 feet per minute. He then requested a course reversal to exit the weather before he declared an emergency and advised ATC that the airplane was upside down. There were no further transmissions from the pilot and radar contact with the airplane was lost. Review of radar data revealed that the pilot had deviated south and then southwest when the airplane entered a strong and intense echo of extreme intensity. Visible imaging revealed that the echo was located in an area of a rapidly developing cumulonimbus cloud with a defined overshooting top, indicating the storm was in the mature stage or at its maximum intensity. Two debris fields were later discovered near the area where the cumulonimbus cloud had been observed. This was indicative that the airplane had penetrated the main core of the cumulonimbus cloud, which resulted in an inflight breakup of the airplane. Near the heavier echoes the airplane's airborne weather radar may have been unable to provide an accurate representation of the radar echoes along the aircraft's flight path; therefore the final penetration of the intense portion of the storm was likely unintentional.\n", "probable_cause": "The pilot’s decision to operate into a known area of adverse weather, which resulted in the inadvertent penetration of a severe thunderstorm, a subsequent loss of control, and in-flight breakup of the airplane."}