{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-524-guadalajara", "date": "Sep 16, 1998 at 2253 LT", "type": "Boeing 737-500", "operator": "Continental%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Houston - Guadalajara", "msn": "28904", "yom": 1997, "flight_number": "CO475", "city": "Guadalajara-Miguel Hidalgo y Costilla", "zone": "Jalisco", "country": "Mexico", "region": "Central America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 102, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On September 16, 1998, at 2253 central daylight time, a Boeing 737-524 transport airplane, N20643, operating as Continental Airlines flight 475, was substantially damaged following a loss of control during the landing roll at the Don Miguel Hidalgo International Airport near Guadalajara, Mexico. The 2 airline transport rated pilots, the 4 flight attendants, and the 102 passengers were not injured. The airplane was owned and operated by Continental Airlines of Houston, Texas, under Title 14 CFR Part 121. Night visual meteorological conditions prevailed for the scheduled international passenger-cargo flight for which an IFR flight plan was filed. The flight was dispatched from the George Bush International Airport near Houston, Texas, at 2056, for the two hour flight to Guadalajara, State of Jalisco, Mexico. The flight's scheduled arrival time was 2254. After executing a missed approach on their first ILS approach to runway 28, the flight was vectored for a second approach to runway 28. The second approach was reported by both pilots to be uneventful; however, after touchdown, the aircraft drifted to the left side of the runway. The left main landing gear exited the hard surface of the runway approximately 2,700 feet from the landing threshold and eventually all 3 landing gears exited the 197 foot wide asphalt runway. The first officer, who was flying the airplane, stated that he never felt any anti-skid cycling during the landing roll and did not feel any \"radical braking\" which was expected with the auto-brake in the number 3 setting. The airplane's nose landing gear collapsed resulting in structural damage to the avionics bay, the forward baggage compartment, the engine cowlings and pylons. Both engines incurred FOD. A total of 15 runway lights on the southern edge of runway 28 were found either sheared or knocked down. The tower operator reported that intermittent heavy rain showers accompanied with downdrafts and strong winds associated with a thunderstorm northeast of the airport prevailed throughout the area at the time of the accident. The two transport category airplanes that landed prior to Continental flight 475 reported windshear on final approach. The winds issued to Continental 475 by the tower while on short final were from 360 degrees at 20 knots, gusting to 40 knots. Prior to the arrival of Continental flight 475, an Aeromexico MD-82, drifted to the left side of the runway to the point where the left main gear exited the hard surface of the runway. The pilot of that flight stated that he used differential power to regain control and bring the aircraft back on the runway. The flight taxied to the gate without further incident.", "probable_cause": null}