{"url": "https://www.baaa-acro.com/crash/crash-xian-ma60-kaimana-25-killed", "date": "May 7, 2011 at 1405 LT", "type": "Xian MA60", "operator": "Merpati-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Jayapura - Sorong - Kaimana - Nabire - Biak", "msn": "06 03", "yom": 2008, "flight_number": "MZ8968", "city": "Kaimana", "zone": "Special Region of West Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 21, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 25, "captain_hours": 24470, "captain_hours_type": 199, "copilot_hours": 370, "copilot_hours_type": 234, "aircraft_hours": 615, "circumstances": "On 7 May 2011, an Xi ’An MA60 aircraft, registered PK-MZK was being operated by PT. Merpati Nusantara Airline as a scheduled passenger flight MZ 8968, from Domine Eduard Osok Airport, Sorong, Papua Barat to Utarom Airport (WASK), Kaimana1, Papua Barat. The accident flight was part of series of flight scheduled for the crew. The aircraft departed from Sorong at 0345 UTC2 and with estimated arrival time in Kaimana at 0454 UTC. In this flight, the Second in Command (SIC) was as Pilot Flying (PF) and the Pilot in Command (PIC) as Pilot Monitoring (PM). On board the flight were 2 pilots, 2 flight attendants, 2 engineers and 19 passengers consisting of 16 adults, 1 child and 2 infants. The flight from Sorong was planned under the Instrument Flight Rules (IFR)3. The destination, Kaimana, had no published instrument approach procedure. Terminal area operations, including approach and landing, were required to be conducted under the Visual Flight Rules (VFR). At about 0425 UTC, after passing waypoint JOLAM the crew of MZ 8968 contacted Kaimana Radio and informed that the weather at Kaimana was raining, horizontal visibility of 3 to 8 kilometers, cloud Cumulonimbus broken at 1500 feet, south westerly wind at a speed of 3 knots, and ground temperature 29°C. The last communication with the crew of MZ 8968 occurred at about 0450 UTC. The flight crew asked whether there were any changes in ground visibility and the AFIS officer informed them that the ground visibility remained at 2 kilometer. The visual flight rules requires a visibility of minimum 5 km and cloud base higher than 1500 feet. The evidence indicates that during the final segment of the flight, both crew member were looking outside the aircraft to sight the runway. During this period the flight path of the aircraft varied between 376 to 585 feet and the bank angle increased from 11 to 38 degree to the left. The rate of descent then increased significantly up to about 3000 feet per minute and finally the aircraft impacted into the sea. The accident site was about 800 meters south west of the beginning of runway 01 or 550 meters from the coastline. Most of the wreckage were submerged in the shallow sea between 7 down to 15 meter deep. All 25 occupants were fatally injured. The aircraft was destroyed and submerged into the sea. ", "probable_cause": "FINDINGS:\r\n1. The aircraft was airworthy prior the accident. There is no evidence that the aircraft had malfunction during the flight. \r\n2. The crew had valid flight license and medical certificate. There was no evidence of crew incapacitation. \r\n3. In this flight the SIC acted as Pilot Flying until the PIC took control of the aircraft at the last part of the flight. \r\n4. According to company operation manual (COM), in a VMC (Visual Meteorological Condition), a “minimum, minimum” EGPWS alert while the approach was not stabilized should be followed by the action of abandoning the approach. \r\n5. The cockpit crew did not conduct any crew approach briefing and checklist reading. \r\n6. As it was recorded in the CVR during the final segment of the flight, both crews member were looking out-side to look for the runway. It might reduce the situational awareness. \r\n7. At the final segment of the flight, the FDR recorded as follows: \r\n• The approach was discontinued started at 376 feet pressure altitude (250 feet radio altitude) and reached the highest altitude of 585 feet pressure altitude. While climbing the aircraft was banking to the left reaching a roll angle of 38 degree. The torque of both engines was increased reaching 70% and 82% for the left and right engine respectively. \r\n• During the go-around, the flaps were retracted to 5 and subsequently to 0 position, and the landing gears were retracted. The aircraft started to descend, and the pitch angle reached 13 degree nose down. \r\n• The rate of descend increased significantly reaching about 3000 feet per minute, and finally the aircraft crashed into the shallow sea. \r\n8. The rapid descent was mainly a result of a combination of situations such as high bank angle (up to 38 deg to the left) and the flaps retracted to 5 and subsequently to 0 position, and also the combination of other situations: engine torque, airspeed, and nose-down pitch. \r\n9. The ERS button was determined in the CRUISE mode instead of TOGA mode. This had led the torque reached 70% and 82% during discontinuing the approach. \r\n10. The flaps were retracted to 5 and subsequently to 0, while the MA-60 standard go-around procedure is to set the flaps at 15.\r\n11. There was limited communications between the crew along the flight. This type of interaction indicated that there was a steep trans-cockpit authority gradient. \r\n12. The SIC was trained in the first three batches which was conducted by the aircraft manufacturer instructor and syllabus, while the PIC was trained by Merpati instructor using modified syllabus. Inadequacy/ineffectivity in the training program may lead to actions that deviated from the standard procedure and regression to the previous type. \r\n13. The investigation found that the Flight Crew Operation Manual (FCOM) and Aircraft Maintenance Manual (AMM) used non-standard English Aviation Language. This finding was supported by a review performed by the Australian Transport Safety Bureau (ATSB). \r\nOTHER FINDINGS:\r\n1. The DFDR does not have the Lateral and Longitudinal acceleration. These two parameters which were non safety related items were mandatory according to the CASR parts 121.343 and 121.344, and at the time of the MA 60 certification, the CCAR 121 did not require those two parameters. \r\n2. Due to impact forces and immersion in water, the Emergency Locator Transmitter (ELT) did not transmit any signal. \r\nFACTORS:\r\nFactors contributed to the accident are as follows: \r\n1. The flight was conducted in VFR in condition that was not suitable for visual approach when the visibility was 2 km. In such a situation a visual approach should not have been attempted. \r\n2. There was no checklist reading and crew briefing. \r\n3. The flight crew had lack of situation awareness when tried to find the runway, and discontinued the approach. \r\n4. The missed approach was initiated at altitude 376 feet pressure altitude (250 feet radio altitude), the pilot open power to 70% and 82% torque followed by flap retracted to 5 and subsequently to 0. The rapid descent was mainly caused by continuously increase of roll angle up to 38 degree to the left and the retraction of flaps from 15 to 0 position. \r\n5. Both crew had low experience/flying time on type. \r\n6. Inadequacy/ineffectivity in the training program may lead to actions that deviated from the standard procedure and regression to the previous type."}