{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-barcelona-2-killed", "date": "Feb 19, 1998 at 0004 LT", "type": "Swearingen SA226 Metro II", "operator": "Ibertrans%20Aerea", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Barcelona - Brussels", "msn": "TC-220", "yom": 1976, "flight_number": "IBT595A", "city": "Barcelona", "zone": "Catalonia", "country": "Spain", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1880, "captain_hours_type": 952, "copilot_hours": 900, "copilot_hours_type": 394, "aircraft_hours": 17546, "circumstances": "Few minutes after a night takeoff from Barcelona Airport, en route to Brussels, the copilot informed ATC about technical problems and was cleared to return for an emergency landing. After been cleared for an approach to runway 07, the crew descended to 6,000 feet and 3,000 feet successively. At 0000:15 seconds, the aircraft passed over the outer marker at an altitude of 1,500 feet and a speed of 170 knots. At a distance of six km from the runway threshold, the aircraft started to deviate from the approach path to the right and one minute later, it struck the ground at a speed of 130 knots, crashing in a palmgrove located 3,2 km short of runway and bursting into flames. The aircraft was destroyed by a post crash fire and both pilots were killed. ", "probable_cause": "Investigations were unable to determine the nature of the technical problems that the crew reported. However, the assumption that the left engine partially failed was not ruled out. The accident resulted from an inappropriate angle of descent during the approach to runway 07 in conditions of low visibility combined with a possible fatigue of the crew due to a long duty period, and the possible left engine malfunction which required yaw compensation and special attention from the pilots. This caused the aircraft to deviate from the approach path and to descend below the MDA until impact with the ground. "}