{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-sioux-falls-4-killed", "date": "Dec 9, 2011 at 1424 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Quest-Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sioux Falls - Rapid City", "msn": "421C-0051", "yom": 1976, "flight_number": null, "city": "Sioux Falls", "zone": "South Dakota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3848, "captain_hours_type": 357, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4882, "circumstances": "Shortly after the airplane lifted off, the tower controller informed the pilot that a plume of smoke was visible behind the airplane. No communications were received from the pilot after he acknowledged the takeoff clearance. Witnesses reported that white smoke appeared to be trailing from the area of the left engine during takeoff. The witnesses subsequently observed flames at the inboard side of the left engine. The airplane began a left turn. As the airplane continued the turn, the flames and trail of white smoke were no longer visible. When the airplane reached a southerly heading, the nose dropped abruptly, and the airplane descended to the ground. Witnesses stated that they heard an increase in engine sound before impact. A postimpact fire ensued. The accident site was located about 3/4 mile from the airport. A postaccident examination determined that the left engine fuel selector and fuel valve were in the OFF position, consistent with the pilot shutting down that engine after takeoff. However, the left engine propeller was not feathered. Extensive damage to the right engine propeller assembly was consistent with that engine producing power at the time of impact. The landing gear and wing flaps were extended at the time of impact. Teardown examinations of both engines did not reveal any anomalies consistent with a loss of engine power. The left engine oil cap was observed to be unsecured at the accident site; however, postaccident comparison of the left and right engine oil caps revealed disproportionate distortion of the left oil cap, likely due to the postimpact fire. As a result, no determination was made regarding the security of left engine oil cap before the accident. Emergency procedures outlined in the pilot’s operating handbook (POH) noted that when securing an engine, the propeller should be feathered. Performance data provided in the POH for single-engine operations were predicated on the propeller of the inoperative engine being feathered, and the wing flaps and landing gear retracted. Thus, the pilot did not follow the emergency procedures outlined in the POH for single-engine operation. ", "probable_cause": "The pilot’s failure to maintain adequate airspeed after shutting down one engine, which resulted in an inadvertent aerodynamic stall and impact with terrain. Contributing to the accident was the pilot’s failure to follow the guidance contained in the pilot’s operating handbook, which advised feathering the propeller of the secured engine and retracting the flaps and landing gear.\n"}