{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-san-bernardino", "date": "May 6, 2016 at 1200 LT", "type": "PZL-Mielec AN-2", "operator": "American%20Airpower%20Heritage%20Museum", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Upland - San Bernardino", "msn": "1G210-55", "yom": 1985, "flight_number": null, "city": "San Bernardino", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3350, "captain_hours_type": 58, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2924, "circumstances": "The commercial pilot was entering the airport traffic pattern for landing during a familiarization flight. He reported that he turned on the carburetor heat, switched the fuel tank selector to the right fuel tank, and shortly thereafter, the engine experienced a total loss of power. The pilot attempted numerous times to restart the engine but was unsuccessful. After realizing that he would not be able to reach the runway, he decided to make a forced landing to a small field. During the landing approach, the airplane contacted a power line, nosed over, and came to rest inverted, resulting in substantial damage to the wings and fuselage. During the postaccident examination of the airplane, about 16 ounces of water were removed from the fuel system. Water was present in the lower gascolator, the fine fuel filter (upper gascolator), and subsequent fuel line to the carburetor inlet. A brass screen at the carburetor inlet and 2 carburetor fuel bowl thumb screens also contained corrosion, water, and rust. The approved aircraft inspection checklist called for washing the carburetor and main fuel filter every 50 hours and cleaning and/or replacing the fine fuel filter every 100 hours. The fine fuel filter is not easily accessible and not able to be drained during a preflight inspection. The mechanic who completed the most recent inspection stated that he did not drain or check the fine fuel filter. The last logbook entry that specifically stated the fuel filters were cleaned was about 4 years before the accident. ", "probable_cause": "The mechanic's failure to inspect the fine fuel filter gascolator as required during the most recent inspection, which resulted in a total loss of engine power due to fuel contamination."}