{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-30-ross-island-257-killed", "date": "Nov 28, 1979 at 1250 LT", "type": "Douglas DC-10", "operator": "Air%20New%20Zealand-2", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Auckland - Christchurch", "msn": "46910/182", "yom": 1974, "flight_number": "NZ901", "city": "Ross Island", "zone": "All Antarctica", "country": "Antarctica", "region": "Antarctica", "crew_on_board": 20, "crew_fatalities": 20, "pax_on_board": 237, "pax_fatalities": 237, "other_fatalities": 0, "total_fatalities": 257, "captain_hours": 11151, "captain_hours_type": 2872, "copilot_hours": 7934, "copilot_hours_type": 1361, "aircraft_hours": 20763, "circumstances": "In preparation for Flight TE901 two of the pilots attended a route qualification briefing. This briefing consisted of an audio visual presentation, a review of a printed briefing sheet and a subsequent 45 minute flight in a DC 10 flight simulator for each pilot to familiarise him with the grid navigation procedures applicable to the portion of the flight south of 60o  south latitude and the visual meteorological conditions (VMC) letdown procedure at McMurdo. This briefing was completed 19 days prior to the scheduled departure date. The briefing gave details of the instrument flight rules (IFR) route to McMurdo which passed almost directly over Mt Erebus, a 12450 ft high active volcano, some 20 nm prior to the most southerly turning point, Williams Field. It also stated that the minimum instrument meteorological conditions (IMC) altitude was 16000 ft and the minimum altitude after passing overhead McMurdo was 6000 ft providing conditions were better than certain specified minima well in excess of the standard VMC in New Zealand. On the day of the flight the crew participated in a normal pre-flight dispatch planning. At 1917 hours (Z) on 27 November 1979 Air New Zealand Flight TE 901, a DC10-30 (ZKNZP) departed from Auckland Airport on a non-scheduled domestic scenic flight which was planned to proceed via South Island New Zealand, Auckland Islands, Baleny Island, and Cape Hallett to McMurdo, Antarctica then returning via Cape Hallett and Campbell Island to Christchurch its first intended landing point. The flight was dispatched on an IFR computer stored flight plan route. The flight deck crew consisted of the captain, two first officers and two flight engineers. Beside the fifteen cabin crew there was an official flight commentator on the flight who was experienced in Antarctic exploration. The passenger load was reduced by 21 from the normal passenger seating capacity as a deliberate policy to facilitate movement about the cabin to allow passengers to view the Antarctic scenery. In a discussion with the McMurdo meteorological office at 0018 hours (Z) the aircraft crew was advised that Ross Island was under a low overcast with a base of 2000 ft and with some light snow and a visibility of 40 miles and clear areas approximately 75 to 100 nm northwest of McMurdo. At approximately 0043 hours (Z) Scott Base advised the aircraft that the dry valley area was clear and that area would be a better prospect for sightseeing than Ross Island. In response to the message that the area over the Wright and Taylor Valleys was clear the captain asked the commentator if he could guide them over that way. The commentator said that would be no trouble and asked if the captain wished to head for that area at the time. The captain replied he “would prefer here first”. The US Navy Air Traffic Control Centre (ATCC) “Mac Centre” suggested that the aircraft crew take advantage of the surveillance radar to let down to 1500 feet during the aircraft’s approach to McMurdo and the crew indicated their acceptance of this offer. In the event however the aircraft was not located by the radar equipment prior to initiating its descent (or at any other time). The aircraft crew also experienced difficulty in their attempts to make contact on the very high frequency (VHF) radio telephone (R/T)and the distance measuring equipment (DME) did not lock onto the McMurdo Tactical Air Navigation System (TACAN) for any useful period. The aircraft was relying primarily on high frequency (HF) R/T during the latter part of its flight for communication with the ATCC. The area which was approved by the operator for VMC descents below 16000 feet was obscured by cloud while ZK-NZP was approaching the area, and the crew elected to descend in a clear area to the north of Ross Island in two descending orbits the first to the right and the second to the left. Although they requested and were granted a clearance from “Mac Centre” to descend from 10000 to 2000 feet VMC, on a heading of 180 grid (013oT) and proceed “visually” to McMurdo, the aircraft only descended to 8600 feet before it completed a 180° left turn to 375°G (190°T) during which it descended to 5,700 feet. The aircraft’s descent was then continued to 1500 feet on the flight planned track back toward Ross Island. Shortly after the completion of the final descent the aircraft collided with Ross Island. The aircraft’s ground proximity warning system (GWPS) operated correctly prior to impact and the crew responded to this equipment’s warning by the engineer calling off two heights above ground level, 500 and 400 feet, and the captain calling for “go round power”. The aircraft’s engines were at a high power setting and the aircraft had rotated upwards in pitch immediately prior to impact. The aircraft collided with an ice slope on Ross Island and immediately started to break up. A fire was initiated on impact and a persistent fire raged in the fuselage cabin area after that section came to rest. The accident occurred in daylight at 0050 hours (Z) at a position of 77° 25’30” S and 167° 27’30” E and at an elevation of 1467 feet AMSL. The cockpit voice recorder (CVR) and digital flight data recorder (DFDR) established that the aircraft was operating satisfactorily and the crew were not incapacitated prior to the accident.", "probable_cause": "The probable cause of this accident was the decision of the captain to continue the flight at low level toward an area of poor surface and horizon definition when the crew was not certain of their position and the subsequent inability to detect the rising terrain which intercepted the aircraft’s flight path. The following findings were reported:\r\n- The flight planned route entered in the company’s base computer was varied after the crew’s briefing in that the position for McMurdo on the computer printout used at the briefing was incorrect by over 2 degrees of longitude and was subsequently corrected prior to this flight.\r\n- The system of checking the detailed flight plan entries into the base computer was inadequate in that an error of 2° of longitude persisted in a flight plan for some 14 months,\r\n- Some diagrams and maps issued at the route qualification briefing could have been misleading in that they depicted a track which passed to the true west of Ross Island over a sea level ice shelf, whereas the flight planned track passed to the east over high ground reaching to 12,450 feet AMSL,\r\n- The briefing conducted by Air New Zealand Limited contained omissions and inaccuracies which had not been detected by either earlier participating aircrews or the supervising Airline Inspectors,\r\n- The crew were not aware of the VHF R/T callsigns in use in the area and these are not published in the briefing notes, the NZAIP, or the US Department of Defence documents which were available to the crew. They were however specified in US Navy instruction CNSFA INST 3722.1, a copy of which was held by Operation Deep Freeze Headquarters,\r\n- The question of making a landing near McMurdo on either the ice runway or the skiways at Williams Field and the type of emergencies which might require such a diversion was not discussed at the company’s briefing,\r\n- The Civil Aviation Division Airline Inspectors had formally approved the audio visual stage of the route qualification briefing for the flight and one had witnessed a typical audio visual segment of the briefing for an Antarctic flight, twice, without requiring any amendments or detecting the errors contained in the briefing. They had also confirmed that it was no longer necessary for captains to carry out a supervised flight as required in the Operations Specifications in view of these briefings and the flight simulator detail,\r\n- Civil Aviation Regulation 77 1(a) had not been complied with,\r\n- The operator departed from the stated undertaking to carry two captains on each flight and substituted an additional first officer in lieu of the second captain,\r\n- Of the flight deck crew only one engineer had flown to the Antarctic previously,\r\n- The crew were not monitoring their actual position in relation to the topography adequately even though a continuous readout of the aircraft’s latitude and longitude and distance to run to the next waypoint was continuously available to them from the AINS,\r\n-The crew did not observe the transition level in use in the McMurdo air traffic control area for resetting this aircraft’s altimeters and this procedure was not published in either the briefing notes or the US Department of Defence documents which were made available to the crew. The procedure used was that prescribed in US Federal Aviation Regulation 91.81 which required the QNH to be set basically at FL 180 during descent but this was modified in low pressure areas,\r\n- The captain’s altimeter was not set to the correct QNH until the aircraft reached 3,500 feet,\r\n- The captain initiated a descent to an altitude below both the IMC (16000 feet) and VMC (6000 feet) minima for the area in a cloud free area but in contravention of the operator’s briefing and outside the sector approved for the descent to 6000 feet by the DCA and the Company,\r\n- The co-pilot was devoting a significant proportion of his time in an endeavour to establish VHF contact with the McMurdo ground stations and did not monitor the decisions of the pilot in command adequately in that he did not offer any criticism of the intention to descend below MSA in contravention of company restrictions and basic good airmanship,\r\n- The descent was intentionally continued below the VMC limit specified by CAD and Air New Zealand Limited, of 6000 feet to an indicated 1500 feet,\r\n- The crew were distracted but not preoccupied by their failure to raise the Ice Tower or any local ground station on VHF, the failure of the DME to lock on to the TACAN and the lack of any identification of the aircraft on radar,\r\n- The company deleted an earlier requirement for VMC descents to be monitored by radar and substituted the alternative procedure of contacting the radar controller for co-ordination of the descent,\r\n- The failure of the aircraft’s systems to establish satisfactory VHF contactor to “lock on” to the McMurdo TACAN was probably due to the aircraft’s low altitude in conjunction with significant high ground between the aircraft and the ground equipment,\r\n- The flight engineers endeavoured to monitor the progress of the flight and expressed their dissatisfaction with the descent toward a cloud covered area,\r\n- Although the route selected by Air New Zealand for the approach to McMurdo crossed almost directly over a 12450 ft active volcano just 20 miles from destination in preference to the normal approach path of military aircraft which was across the sea level ice shelf the Air New Zealand route was safe provided the crew observed the minimum altitudes stipulated for the flight and no extraordinary activity occurred in the volcano,\r\n- Despite the shortcomings of some aspects of the route qualification briefing, this flight and Antarctic flights in general were not unacceptably hazardous, if they had been conducted strictly in accordance with the route qualification briefing as presented,\r\n- The CAD procedure of reapproving Antarctic flights each season on the condition that they complied with the constraints of the previous season’s flights led to some items being discontinued without formal notification or agreement, e.g. the carriage of 2 captains on each flight, and the requirement for a briefing by ODF Headquarters,\r\n- The on board navigation and flight guidance system operated normally during the latter stages of the flight,\r\n- The aircraft’s GPWS operated in accordance with its design specifications,\r\n- CAD had not implemented effectively the section of the ICAO standard detailed in Annex 6 of the convention which requires appropriate life-sustaining equipment to be carried on flights across land areas which have been designated by the State concerned as areas in which search and rescue would be especially difficult. Although the Commander of the USN Antarctic Support Force stated that “limited SAR capability existed over land and very little over water”, this may not constitute “designation of the area” as being especially difficult for search and rescue activities by the State concerned,\r\n- Although some notes on Antarctic survival were given to the Chief Purser immediately before this flight no additional life-sustaining equipment was carried or training given to the crew members to facilitate survival following an emergency landing on the ice or in the polar waters of Antarctica,\r\n- Neither the passengers nor the crew were expecting the collision and all received fatal injuries on impact with the ice,\r\n- The search and rescue organisation was mobilised and co-ordinated in a competent manner despite the difficult environment and the aircraft was located as soon as practicable, (11 hours) after the collision occurred,\r\n- The aircraft was not fitted with a self activated ELT but such equipment is not at present required,\r\n- The aircraft’s CVR and DFDR operated as intended and provided an excellent record for the investigators of this accident. The CVR system however could be significantly improved as discussed in recommendation 8.\r\n- The aircraft’s radar would have depicted the mountainous terrain ahead."}