{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-dk-cape-spencer-17-killed", "date": "Nov 4, 1948 at 0445 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Pacific Alaska Air Express", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Anchorage – Homer – Yakutat – Annette Island – Seattle", "msn": "11800", "yom": 1943, "flight_number": null, "city": "Cape Spencer", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 15, "pax_fatalities": 15, "other_fatalities": 0, "total_fatalities": 17, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4320, "circumstances": "At approximately 2226, November 3, 1948. the flight departed Anchorage for Seattle, Washington, via Homer, Yakutat, and Annette Island, Alaska, with a crew consisting of A R. Kinnear, pilot, and R A Wilson, copilot. The flight arrived at Yakutat, Alaska, at 0257, November 4, 1948, without incident. At Yakutat an instrument flight plan was filed specifying a cruising altitude of 10,000 feet to Annette Island, the next intended stop. At 0407, the flight took off from Yakutat with the same crew, 15 passengers, 800 gallons of fuel, and no cargo. Total airplane weight was within the certified limit and the airplane was properly loaded. A position report was received from the flight by Gustavus Radio at 0510 to the effect that the flight was cruising at 10,000 feet, 146 miles southeast of Yakutat, and that it estimated arriving over Sitka, Alaska, 240 miles southeast of Yakutat, at 0544. This was the last communication received from the flight. Approximately one hour after the flight's estimated arrival time over Sitka, an emergency warning was issued by CAA Communications to all radio stations between Anchorage and Seattle. Also alerted was the Civil Aeronautics Board, the 10th Air and Sea Rescue Squadron, and the Coast Guard Air Facility. At 0700 the Coast Guard dispatched a search plane to the area over which the flight had last reported, but no trace of the airplane or its occupants was found.", "probable_cause": "As the aircraft was not found, there is not sufficient evidence for the Board to make any determination as to the probable cause for this accident"}