{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-south-lake-tahoe", "date": "Aug 22, 1992 at 1303 LT", "type": "Socata TBM-700", "operator": "Stage Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Monterey - South Lake Tahoe", "msn": "39", "yom": 1992, "flight_number": null, "city": "South Lake Tahoe", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 845, "captain_hours_type": 50, "copilot_hours": 246, "copilot_hours_type": null, "aircraft_hours": 94, "circumstances": "According to the aircraft occupants, the aircraft owner, who holds a commercial pilot and cfi certificates, was occupying the right front seat. A friend of the pilot, a 246 hour private pilot with no experience in high performance turbine powered aircraft, was in the left seat and flying the aircraft under the direction of the owner. While on a straight in approach to the airport, the flight was advised three times by the atct of a variable right cross wind from 200 to 220° at speeds from 8 to 14 knots, with higher gust components. The tower also advised the flight of reports of light to moderate turbulence all the way to the ground. Both pilots reported that the aircraft had just touched down on runway 18 when a sudden cross wind gust lifted the right wing. The private pilot did not correct the situation and the aircraft owner could not overpower the other pilots control inputs in time to correct for the wind gust. The left wing tip drug the ground and the aircraft cartwheeled off the left side of the runway and into an airport fence. ", "probable_cause": "The failure of both pilots to adequately anticipate and compensate for the variable cross wind condition, and, the pilot in command's inadequate supervision of the flight. A factor in the accident was the left seat pilot's limited total experience and experience in high performance aircraft types."}