{"url": "https://www.baaa-acro.com/crash/crash-canadair-regionaljet-crj-100er-kinshasa-32-killed", "date": "Apr 4, 2011 at 1356 LT", "type": "Canadair RegionalJet CRJ-100", "operator": "Georgian%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Humanitarian", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kisangani – Kinshasa", "msn": "7070", "yom": 1995, "flight_number": "UNO834", "city": "Kinshasa-N'Djili", "zone": "Kinshasa City Province", "country": "Democratic Republic of Congo", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 29, "pax_fatalities": 28, "other_fatalities": 0, "total_fatalities": 32, "captain_hours": 2811, "captain_hours_type": 1622, "copilot_hours": 495, "copilot_hours_type": 344, "aircraft_hours": null, "circumstances": "On final approach to Kinshasa-N'Djili Airport, the crew encountered very poor weather conditions and decided to make a go around. After a climb process of 12 seconds, the aircraft nosed down and at a speed of 180 knots, hit the ground 170 meters to the left of the displaced threshold of runway 24. The aircraft slid for 400 meters before coming to rest in flames upside down. Three passengers were seriously injured and evacuated but of them died from their injuries few hours later. Finally, only one passenger survived the accident. Aircraft was performing a special flight from Kisangani to Kinshasa on behalf of the United Nations Organization Stabilization Mission in the Democratic Republic of the Congo (MONUSCO). The only survivor reported that the aircraft suddenly plunged into the earth while on final approach. At the time of the accident, weather conditions were marginal with storm activity, heavy rain showers, scattered at 2,200 feet and cumulonimbus at 1,500 feet. ", "probable_cause": "Weather in Kinshasa was bad at the time of the accident, ATC failed to inform the crew about the degradation of the weather conditions and the runway in use was not closed to traffic while the visibility was below the minima. Despite this situation, the crew took the decision to continue the approach procedure while the aircraft was unstable and the approach speed was too high (180 knots). It is reported that the following factors contributed to the accident:\r\n- the crew ignored the published approach procedures, \r\n- improper crew resources management during the execution of the flight, \r\n- during the go around process, the crew encountered adverse weather conditions with vertical wind gusts, downdrafts and a 'magenta' effect. This caused the aircraft to adopt nose down attitude while it was in the final stage of the flight, preventing the pilot to take over the control, \r\n- the pilot training program was inadequate and did not include a proportionate number of flight in the simulator, \r\n- the authority for civil aviation of Georgia has probably approved a small training program for upgrading the captain to his position, \r\n- lack of oversight of the operator by the Georgian Civil Aviation Authority. \r\nIn conclusion, investigators believe that the most probable cause of the accident is the fact that the plane encountered a very dangerous meteorological phenomena similar to a microburst, to a very low level during the overshoot process. The dangerous vertical downdraft and gust caused a sudden and remarkable change in the attitude of the aircraft and a substantial loss of altitude. Flying at very low altitude, recovery of such disturbance was not possible."}