{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-lake-adonis-3-killed", "date": "Jan 13, 2000 at 1030 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Cargair2_0", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Saint-Michel-des-Saints - La Pourvoirie des 100 Lacs - Lac Adonis", "msn": "515", "yom": 1953, "flight_number": null, "city": "Lake Adonis", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3147, "captain_hours_type": 3000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 26400, "circumstances": "The DHC-2 Mk. 1 skiplane, registration C-FIVA, serial number 515, with the pilot and five passengers on board, took off from the frozen surface of Lake Adonis, Quebec, on a pleasure flight under visual flight rules (VFR). The route had not been determined, but the flight was to last about 20 minutes. When the aircraft did not return, the search and rescue (SAR) service was advised. The aircraft was found crashed on a mountainside in a wooded area a little less than five km from its point of departure. The pilot and two passengers suffered fatal injuries. The other three passengers suffered serious injuries and hypothermia. The aircraft was destroyed by the force of the impact but did not catch fire. The five passenger, all from the same family, were originating from Marseille, France. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The aircraft probably stalled with insufficient altitude for the pilot to execute a recovery.\r\n2. The prevailing conditions were conducive to optical illusions associated with low-altitude flight over rising terrain.\r\n3. The aircraft was not equipped with a stall warning system, nor was it required by regulation.\r\n4. The pilot's decision to fly at low altitude and probably use cutback power for the climb did not allow for safe obstacle clearance.\r\n5. The pre-flight safety briefing did not inform passengers where to find the survival equipment on board the aircraft. Consequently, they could not use the sleeping bags to protect themselves from exposure and thereby delay hypothermia.\r\n6. Rescue was late because the mostly white aircraft blended into the snowy ground, making it difficult to locate, and the ELT antenna was broken, reducing the range of the signal. Consequently, the survivors' exposure time was increased.\r\nOther Findings:\r\n1. The pilot was certified and qualified for the flight.\r\n2. The autopsy and toxicological test results revealed no indication that physiological factors affected the pilot's performance.\r\n3. Records indicate that the aircraft was certified, equipped, and maintained in accordance with existing regulations and approved procedures.\r\n4. The aircraft's weight and centre of gravity were within the limits specified in the aircraft fight manual.\r\n5. There is no indication that there was an emergency situation or that the aircraft experienced problems prior to impact.\r\n6. The ready-to-use weight and balance calculation form is not consistent with the standard. Transport Canada reported this irregularity in 1992, but no change was made in the form, which is still part of the company operations manual approved by Transport Canada on 23 October 1999.\r\n7. The weather conditions were suitable for visual flight."}