{"url": "https://www.baaa-acro.com/crash/crash-canadair-regionaljet-crj-100er-yerevan", "date": "Feb 14, 2008 at 0415 LT", "type": "Canadair RegionalJet CRJ-100", "operator": "Belavia-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yerevan - Minsk", "msn": "7316", "yom": 1999, "flight_number": "BRU1834", "city": "Yerevan-Zvartnots", "zone": "Armavir", "country": "Armenia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 18, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15563, "circumstances": "A Canadair CRJ100ER passenger jet, operated by Belavia, was destroyed when crashed and burned on takeoff from Yerevan-Zvartnots Airport (EVN), Armenia. All three crew members and eighteen passengers survived the accident. The airplane arrived as flight BRU1833 from Minsk-2 International Airport (MSQ), Belarus at 02:05. Refueling was carried out in preparation for the return flight and the crew conducted the flight planning. After refueling the pilot carried out a tactile and visual inspection of all critical surfaces of the wing and visual inspection of the tail assembly. All the planes were clean and dry. The weather reported for the 04:00 was: wind 110 degrees at the ground 1 m/sec, visibility 3500 meters, haze, small clouds, vertical visibility of 800 meters, scattered clouds at 3000 m, a temperature of minus 3° C, dew point minus 4° C, pressure 1019 hPa. At 04:08 both engines were started. The engine air intake heating (cowl anti-ice) was switched on but the wing anti-icing system was not switched on. The crew taxied to runway 27 and were cleared for departure. During takeoff the airplane progressively banked left until the left wing tip contacted runway. The airplane went off the side with the airplane rolling the right. The right hand wing broke off and spilled fuel caught fire. The airplane came to rest upside down. ", "probable_cause": "The accident involving aircraft CRJ-100LR registration number EW-101PJ was the result of an asymmetric loss of lift of the wing during take-off, which led to the toppling of the aircraft immediately after liftoff from the runway, the left wing tip contacting the ground, the subsequent destruction and fire. The reason for the loss of lift of the wing at the actual weather conditions, was the formation of frost, which \"pollutes\" the surface of the wing. The cause of formation of frost, most likely, was the fuel icing, while the aircraft was parked at the airport and during taxiing for the return flight, resulting in a difference in temperature of the surrounding air and cold fuel in the tanks after the flight. The situation could be aggravated when exceeding the values recommended by the operations manual of the angular velocity when lifting the nose wheel during takeoff with \"contaminated\" wings when it is impossible to monitor this parameter instrumentally. Existing procedural methods of control of the aerodynamic surfaces of the aircraft before departure, along with the inefficiency, during takeoff, the existing system of protection from stalling due to increased sensitivity of the wing, even to a slight contamination of the leading edge, can not fully guarantee the prevention of similar accidents in future. An Airworthiness Directive on the need to include anti-icing systems on the wing in the final stage of taxiing at the actual weather conditions was issued by Transport Canada after the accident. This probably could have prevented the accident."}