{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-cape-town-7-killed", "date": "Jun 5, 1983 at 1323 LT", "type": "Cessna 402", "operator": "Linair Express", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cape Town - Lanseria", "msn": "402B-1094", "yom": 1976, "flight_number": null, "city": "Cape Town", "zone": "Western Cape", "country": "South Africa", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot, Lorance Weinberg, had a history of logging hours on aircraft he had not been trained to fly as well as logging hours on aircraft in which he had only traveled as a passenger. On 4 June 1983 he booked a Cessna 402 under false pretenses to fly to Durban, but in fact took a party of 9 to Cape Town for a wedding. The following day he filed an IFR flight plan to return to Johannesburg when he was not IFR rated, but had trouble filling in the forms. He took off just before 13:00 in deteriorating weather with his 8 passengers and immediately ran into trouble. He did not follow any instructions from air traffic control and evaded their questions when they decided it would be best to bring him back for landing. It was noted on radar that he was flying in ever decreasing circles until the aircraft finally crashed onto the Polkadraai Road running between Kuils River and Stellenbosch. Weinberg, five adult passengers and a baby were killed, but two adults survived.\r\nSource: Fields of Air by James Byrom.", "probable_cause": "The CAA determined that the pilot had undertaken a flight for which he was not qualified, or trained, to act as pilot in command. He took off in instrument meteorological conditions when he was not instrument rated and suffered from spatial disorientation and because of a lack of training flew into the ground."}