{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-120er-brasilia-lagos-16-killed", "date": "Oct 3, 2013 at 0932 LT", "type": "Embraer EMB-120 Brasília", "operator": "Associated-Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lagos - Akure", "msn": "120-174", "yom": 1990, "flight_number": "SCD361", "city": "Lagos-Murtala Muhammed", "zone": "Lagos", "country": "Nigeria", "region": "Africa", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 13, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": 20068, "captain_hours_type": 1309, "copilot_hours": 4660, "copilot_hours_type": 3207, "aircraft_hours": 27362, "circumstances": "The crew discussed some concerns about the aircraft prior to departure but at this time we are not prepared to elaborate on those concerns as there remains a lot of work to complete on the CVR analysis in order to determine the specific nature of the crew’s concerns. Associated 361 was cleared for take-off on runway one eight left at Lagos international airport. The wind was calm and weather is not considered a factor in this accident. Approximately 4 seconds after engine power was advanced to commence the take-off roll, the crew received an automated warning from the onboard computer voice which consisted of three chimes followed by “Take-off Flaps…Take-off Flaps”. This is a configuration warning that suggests that the flaps were not in the correct position for take-off and there is some evidence that the crew may have chosen not to use flaps for the take-off. The warning did not appear to come as any surprise to the crew and they continued normally with the take-off. This warning continues throughout the take-off roll. As we are in the process of verifying the accuracy of the flight data, we have not yet been able to confirm the actual flap setting however we expect to determine this in the fullness of time. It was determined from the CVR that the pilot flying was the Captain and the pilot monitoring and assisting was the First Officer. The ‘set power‘ call was made by the Captain and the ‘power is set’ call was confirmed by the First Officer as expected in normal operations. Approximately 3 seconds after the ‘power is set’ call, the First Officer noted that the aircraft was moving slowly. Approximately 7 seconds after the ‘power is set’ call, the internal Aircraft Voice warning system could be heard stating ‘Take off Flaps, Auto Feather’. Auto feather refers to the pitch of the propeller blades. In the feather position, the propeller does not produce any thrust. The FDR contains several engine related parameters which the AIB is studying. At this time, we can state that the Right engine appears to be producing considerably less thrust than the Left engine. The left engine appeared to be working normally. The aircraft automated voice continued to repeat ‘Take-off Flaps, Auto Feather’. The physical examination of the wreckage revealed that the right engine propeller was in the feather position and the engine fire handle was pulled/activated. The standard ‘eighty knots’ call was made by the First Officer. The first evidence that the crew indicated that there was a problem with the take-off roll was immediately following the ‘eighty knots’ call. The First Officer asked if the take- off should be aborted approximately 12 seconds after the ‘eighty knots’ callout. Our investigation team estimates the airspeed to be approximately 95 knots. Airspeed was one of the parameters that, while working in the cockpit, appeared not to be working on the Flight Data Recorder. We were able to estimate the speed based on the radar data that we synchronized to the FDR and CVR but it is very approximate because of this. In response to the First Officer’s question to abort, the Captain indicated that they should continue and they continued the take-off roll. The crew did not make a ‘V1’ call or a Vr’ call. V1 is the speed at which a decision to abort or continue a take-off is made. Vr is the speed at which it is planned to rotate the aircraft. Normally the non-flying pilot calls both the V1 and the Vr speeds. When Vr is called the flying pilot pulls back on the control column and the aircraft is rotated (pitched up) to climb away from the runway. During the rotation, the First Officer stated ‘gently’, which we believe reflects concern that the aircraft is not performing normally and therefore needs to be rotated very gently so as not to aerodynamically stall the aircraft. The First Officer indicated that the aircraft was not climbing and advised the Captain who was flying not to stall the aircraft. Higher climb angles can cause an aerodynamic stall. If the aircraft is not producing enough overall thrust, it is difficult or impossible to climb without the risk of an aerodynamic stall. Immediately after lift-off, the aircraft slowly veered off the runway heading to the right and was not climbing properly. This aircraft behavior appears to have resulted in the Air Traffic Controller asking Flight 361 if operation was normal. Flight 361 never responded. Less than 10 seconds after rotation of the aircraft to climb away from the runway, the stall warning sounded in the cockpit and continued to the end of the recording. The flight data shows characteristics consistent with an aerodynamic stall. 31 seconds after the stall warning was heard, the aircraft impacted the ground in a nose down near 90° right bank.", "probable_cause": "The accident was the consequence of the decision of the crew to continue the take-off despite the abnormal No. 2 Propeller rpm indication and a low altitude stall as a result of low thrust at start of roll for take-off from No. 2 Engine caused by an undetermined malfunction of the propeller control unit.\r\nThe following contributing factors were identified:\r\n- The aircraft was rotated before attaining V1.\r\n- The decision to continue the take-off with flap configuration warning and auto- feather warning at low speed.\r\n- Poor professional conduct of the flight crew.\r\n- Inadequate application of Crew Resource Management (CRM) principles.\r\n- Poor company culture.\r\n- Inadequate regulatory oversight."}