{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-29a-70-bn-superfortress-near-sinuiju-3-killed", "date": "Jan 13, 1953", "type": "Boeing B-29 Superfortress", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Military", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Clark - Clark", "msn": "11694", "yom": 1944, "flight_number": null, "city": "Sinuiju", "zone": "North Pyongan (평안북도)", "country": "North Korea", "region": "Asia", "crew_on_board": 14, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Assigned to the 581st Air Resupply and Communications Wing, Kadena AB, Okinawa (91st SRS), was shot down by MiG's during a leaflet dropping mission on January 13, 1953.  One of the most sensational missions of the 581st in Korea occurred on 12 January 1953, when a 581st ARC B-29 (tail number 44-62217) on its first leaflet drop mission with the 581st ARC Wing Commander, (as well as the operations commander of the 91st Strategic Reconnaissance Wing) on board, was shot down on their last leaflet target just south of the Yalu River in far northern Korea near the Chinese town of Antung. At the time, Russian fighter squadrons, some equipped for night flying, were supporting and supplying the Chinese with airpower, including the Russian-made MiG-15 Fagot. Twelve Russian MiG-15s from the 351st (and perhaps the 535th) Fighter Air Regiments (IAP) intercepted a lone Superfortress of the 581st ARCW south of the Yalu River, about 15 miles from the Chinese border. The MiGs were scrambled and vectored to the bomber's location by Russian radar-controlled searchlight units stationed near Antung, China. The searchlights illuminated the unarmed Superfortress and several MiGs engaged the bomber. Russian MiG pilot of the 351st IAP was credited with the intercept and downing of the B-29.  Although US sources believe the B-29 was flying in North Korean airspace at the time of its mayday call, a belief that is strongly disputed by the Chinese and Russian authorities, crew members who bailed and landed believe they were in North Korean territory. Upon capture, the crew was rounded up, blindfolded and put aboard trucks, subsequently transported into China and later charged as CIA spies (the Chinese subsequently learned of the CIA connection with the ARCW units). During the highly publicized Chinese trial in Peking in October 1954, the surviving crew members, along with captured CIA agents, who were imprisoned two years earlier after they had been shot down while attempting to pick up their Chinese double agent, were given prison sentences ranging from 5 years to life. Not until 4 August 1955, two years after the Korean War Armistice, were the surviving crew members released from Chinese prison. These crew members held the distinction of being the longest held POW USAF captives of the war.\nCrew:\nCol John K. Arnold Jr.,\nMaj William E. Baumer, \nA2c Harry M. Benjamin Jr.,\nT/Sgt Howard W.\tBrown,\n1st Lt Wallace L. Brown,\nCpt John W. Buck,\nA1c Alvin D. Hart Jr., †\nA1c Steve E. Kiba,\nCpt Elmer F. Llewellyn,\nA1c Daniel C.\tSchmidt, \nA2c John W. Thompson III,\nCpt Eugene J.\tVaadi,\n1st Lt Paul E.\tVan Voorhis, †\n1st Lt Henry D. Weese. †\nSource: http://www.joebaugher.com", "probable_cause": "Shot down by Soviet MiG-15 fighter. "}