{"url": "https://www.baaa-acro.com/crash/crash-boeing-314a-clipper-atlantic-ocean", "date": "Oct 14, 1947 at 1004 LT", "type": "Boeing 314 Clipper", "operator": "American International Airlines", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Poole – Foynes – Gander – New York", "msn": "2086", "yom": 1941, "flight_number": null, "city": "Atlantic Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 62, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2000, "captain_hours_type": 162, "copilot_hours": 4040, "copilot_hours_type": 102, "aircraft_hours": 12000, "circumstances": "Take-off from Foynes was accomplished at 1540, the afternoon of October 13th. The flight climbed to its cruising altitude of 8,000 feet, proceeded on course for five hours and 50 minutes over the tops of clouds, and then, at 2130, instrument weather conditions were encountered. Since celestial navigation was no longer possible, Mr. Thompson, the only qualified celestial navigator aboard, retired. Before he had retired, however, he informed Captain Martin that the estimated time of arrival over the United States Coast Guard weather ship, Bibb, located on course and approximately 961 miles west of Foynes, was 0200. This was 45 minutes later than was originally estimated. Icing conditions were encountered shortly after midnight. At 0134, October 14th, the flight requested and was granted permission from the Moncton Ocean Air Traffic Control to descend to 6,000 feet. About this time the flight received from tie Gander radio station a weather forecast which included wind information at the original cruising altitude of 8,000 feet. According to the data received, the average headwind component had d velocity of 12 knots greater than that which was used in the computation of the flight plan. No further icing conditions were encountered at 6,000 feet, but instrument weather continued. The flight proceeded without the benefit of any navigational fix until 0205 when a radar fix from the Bibb placed the aircraft 68 miles from the vessel on a bearing of 80 degrees. At this time the flight had flown approximately 892 miles from Foynes, was slightly over half way to Gander, and had used 10 hours and 25 minutes of the estimated 22 fuel hours carried at the time of take off. They informed the Bibb that their estimated arrival time at Gander was 0930, which was 32 minutes later than was originally estimated. The crew anticipated no possibility of fuel exhaustion, and one hour and 11 minutes remained before they were to reach the point-of-no-return as computed in their flight plan. The Bibb reported the wind at its location at 6,000 feet to be 40 to 45 knots from the west. a headwind component of about 17 knots greater than that used in the flight plan. The captain estimated at 0232 that they were on course and 13 to 20 miles south of the Bibb. This was one hour and 17 minutes later than the original estimate and 32 minutes later than the amended estimate. Altitude was reduced to 4,000 feet after approval had been given by Moncton Ocean Air Traffic Control, and shortly thereafter, at 0327, eleven minutes after the flight passed its point-of-no-return, another weather forecast was received from Gander which showed the average headwind for the remainder of the route to be from 250 to 260 degrees at 38 knots, a headwind component 12 knots greater than that received in Shannon. Still no difficulty was anticipated, nor was the navigator consulted at this time. By 0500 clear weather was encountered. The navigator was then awakened in order that he might fix the aircraft's position by celestial observation, and according to the fixes that were plotted, headwinds in excess of 60 knots had existed en route, the average ground speed being only 59 knots. The crew immediately be came concerned as to whether or not the fuel remaining was sufficient. Approximately 550 miles remained to destination Captain Martin and First Officer Thompson believed that it was impossible to accomplish the remaining portion of the flight with the fuel remaining, so decided to return to the Bibb where rescue facilities would be immediately available. However, the flight continued westward and a position report was made to Gander at 0600. The turn around was actually made at 0758, at which time the aircraft was still 60 miles east of the previously reported 0600 position and approximately 460 miles east of Gander and 300 miles west of the Bibb Gander was advised of the decision, and at 0840 was Informed that the flight had two hours and 45 minutes of fuel remaining. The aircraft's position was reported at 0914 to be 100 miles west of the Bibb. The flight arrived over the Bibb at 0940, made four low passes, and then landed. All passengers had been fitted with life jackets and had been provided with seats and safety belts. Though the aircraft encountered waves six to eight feet high, no injury to any person or damage to the aircraft occurred. However, in taxying toward the Bibb the aircraft and Bibb drifted together with substantial damage to the aircraft. Rescue operations were slow and hazardous because of high seas, out by the next day all of the passengers and crew had been successfully transferred to the Bibb.", "probable_cause": "The Board finds that the probable cause of this accident was due to improper flight planning under conditions of an excess gross weight, resulting in a landing at sea.\r\nThe following factors were considered as contributory:\r\n- The aircraft was loaded approximately 5,000 pounds in excess of its certificated gross weight at the time of take-off, \r\n- Estimated air speeds for the flight could not be obtained without the use of uneconomical power settings because of the overloaded condition of the flight\r\n- There was not sufficient fuel on board for the flight in its overloaded condition to complete the intended trip safely \r\n- Information concerning winds received during the course of the flight was not properly considered in estimating a point-of-no-return and total time of flight \r\n- No continuing cruise control chart was prepared or maintained during the course of the flight."}