{"url": "https://www.baaa-acro.com/crash/crash-lockheed-vega-5c-fort-worth-1-killed", "date": "Nov 9, 1935 at 0445 LT", "type": "Lockheed 5 Vega", "operator": "Braniff", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dallas – Waco", "msn": "191", "yom": 1932, "flight_number": null, "city": "Fort Worth", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On November 9, 1935, at approximately 0445LT within the city limits of East Fort Worth, Texas, a commercially owned airplane, while being flown without passengers, crashed with resultant death of the pilot and the complete destruction of the aircraft. The airplane, a Lockheed Vega, model 5C, was owned and operated by Braniff Airway Inc., Oklahoma City, Oklahoma, and bore Department of Commerce licence n° NC980Y. At the time of the accident it was being ferried from Dallas to Waco, Texas, via Fort Worth, and no passengers were permitted to be carried. The pilot, William C. Maus of Waco, Texas, held a Department of Commerce transport pilot's licence and a scheduled air transport rating. The take-off was accomplished at 0410LT, the airplane carrying a 5-hour gasoline supply. The ceiling at Dallas was 1,000 feet with 8 miles visibility. Fort Worth at the time had a ceiling of 500 feet with 7 miles visibility. It had not been the intention of the pilot to land at Fort Worth but to fly beyond it to a lighted airway leading into Waco, Texas, his destination. By the time Fort Worth was reached the ceiling had dropped to about 75 feet and the visibility was zero. This change in weather was broadcast to the pilot from Fort Worth with instructions that he return to Dallas. Whether or not the pilot received this broadcast is not known inasmuch as his airplane was not equipped with two-way radio. However, he had plenty of fuel and could have easily returned to Dallas, where the weather had remained constant, or have flown on to Houston, where the ceiling was practically unlimited.  Reports from various people who heard the airplane overhead and saw the accident indicate that the pilot was attempting to get under the 75-foot ceiling, presumably to locate the airport. He was heard flying around for some time and made two complete circles at a low altitude in the immediate vicinity of the accident. Immediately preceding the crash the airplane appeared diving out of the mist. The engine was heard to accelerate as through the pilot had just caught sight of the ground and was making an effort to pull the airplane out of the dive before striking. The aircraft was destroyed by impact forces and the pilot was killed. ", "probable_cause": "It is the opinion of the Accident Board that the probable cause of this accident was poor judgment on the part of the pilote for attempting to land at Fort Worth under existing weather conditions. "}