{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-201-havana-112-killed", "date": "May 18, 2018 at 1210 LT", "type": "Boeing 737-200", "operator": "Cubana-de-Aviacion-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Havana – Holguín", "msn": "21816/592", "yom": 1979, "flight_number": "DMJ972", "city": "Havana-José Martí (Rancho Boyeros)", "zone": "La Habana", "country": "Cuba", "region": "Central America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 107, "pax_fatalities": 106, "other_fatalities": 0, "total_fatalities": 112, "captain_hours": 16655, "captain_hours_type": null, "copilot_hours": 2314, "copilot_hours_type": null, "aircraft_hours": 69596, "circumstances": "After takeoff from runway 06 at Havana-José Martí Airport, while in initial climb, the undercarriage were raised when the aircraft entered an excessive nose-up angle of 30°. It rolled to the right then descended until it struck power cables and a railway track before it disintegrated in a field located less than one km east from the airport. Three female passengers were seriously injured while 110 other occupants were killed, among them 102 Cubans, 6 Mexicans (crew) and 2 Argentinians. Three days after the accident, one of the three survivors died from her injuries. A second survivor died one week later, on May 25. The aircraft was operated by Cubana de Aviacíon under a wet lease contract from the Mexican operator Global Air (Damojh Aéreolíneas), and the service was operated under callsign DMJ972. ", "probable_cause": "Loss of control of the aircraft during initial climb following a chain of human errors in the preparation of the flight and the weight and balance calculation. It was determined that the crew calculated the CofG to be 17,4% while it was actually 28,5%, about 0,5% below the rear limit of 29%. Consequently, the horizontal stabilizer trim was set at 5 3/4 units instead of 3 1/4 units. This caused the aircraft to enter an excessive nose up attitude immediately after liftoff. \r\nThe following contributing factors were identified:\r\n- Inconsistencies in crew training,\r\n- Errors in weight and balance calculations,\r\n- Low operational standards manifested in flight."}