{"url": "https://www.baaa-acro.com/crash/crash-cessna-402-near-nagoorin-1-killed", "date": "Feb 21, 1983 at 0405 LT", "type": "Cessna 402", "operator": "Sunshine%20Coast%20Air%20Charter", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Brisbane – Gladstone – Rockhampton", "msn": "402-0142", "yom": 1967, "flight_number": null, "city": "Nagoorin", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was engaged in operating a night freight flight from Brisbane to Gladstone and Rockhampton. The pilot departed Rockhampton as a passenger in another company aircraft at about 2100 hours the night before the accident and was flown to Caloundra. He then flew VH-DIL to Brisbane and after arriving submitted a flight plan for the return flight to Rockhampton giving an estimated time of DEPARTURE Brisbane of 0230 hours. Before DEPARTURE, however, the pilot was required to await the arrival of another aircraft so that freight could be transhipped to his aircraft. DEPARTURE from Brisbane was made at 0301 hours and at 0400 hours the pilot reported the aircraft's position over Gayndah, the pilot was instructed to call on another radio frequency at 0410 hours. No further transmissions were heard from the aircraft. The wreckage was located two days later in mountainous terrain. The aircraft had impacted the ground in a near vertical attitude. Subsequent investigation did not reveal any fault with the aircraft or its systems that could have contributed to the accident. The day before the accident the pilot rose at about 0730 hours after spending the previous night and day at a friends property near Rockhampton. He spent the day at leisure at the property before returning to Rockhampton in the afternoon. After dining at his parents home he proceeded to the airport for the flight to Caloundra. Before departing Brisbane to return to Rockhampton the only sleep the pilot would have had was about an hour on the flight to Caloundra and possibly another short period at Brisbane Airport while waiting for his aircraft to be loaded.", "probable_cause": "The cause of the in-flight loss of control of the aircraft could not be determined. The pilot had had inadequate rest prior to undertaking the flight."}