{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-401-new-york-2-killed", "date": "Sep 20, 1989 at 2321 LT", "type": "Boeing 737-400", "operator": "US%20Airways2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York - Charlotte", "msn": "23884", "yom": 1988, "flight_number": "US5050", "city": "New York-LaGuardia", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 57, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5525, "captain_hours_type": 140, "copilot_hours": 3287, "copilot_hours_type": 8, "aircraft_hours": 2235, "circumstances": "A USAir Boeing 737-401, registration N416US, was scheduled to depart from Baltimore/Washington (BWI) as flight 1846 at 15:10, but air traffic inbound to New York-LaGuardia (LGA) delayed the takeoff until 19:35. Holding on the taxiway at BWI for 1.5 hours required the flight to return to the terminal area for fuel. The Boeing 737-400 left BWI uneventfully and arrived at LGA's Gate 15 at 20:40. Weather and air traffic in the LGA terminal area had caused cancellations and delayed most flights for several hours. The USAir dispatcher decided to cancel the Norfolk leg of Flight 1846, unload the passengers, and send the flight to Charlotte (CLT) without passengers. Several minutes later, the dispatcher told the captain that his airplane would not be flown empty but would carry passengers to Charlotte as USAir flight 5050. This seemed to upset the captain. He expressed concern for the passengers because more delays would cause him and the first officer to exceed crew duty time limitations before the end of the trip. While passengers were boarding, the captain visited USAir's ground movement control tower to ask about how decisions were made about flights and passengers. The captain returned to the cockpit as the last of the passengers were boarding, and the entry door was closed. After the jetway was retracted, the passenger service representative told the captain through the open cockpit window that he wanted to open the door again to board more passengers. The captain refused, and flight 5050 left Gate 15 at 22:52. The 737 taxied out to runway 31. Two minutes after push-back, the ground controller told the crew to hold short of taxiway Golf Golf. However, the captain failed to hold short of that taxiway and received modified taxi instructions from the ground controller at 22:56. The captain then briefed takeoff speeds as V1: 125 knots, VR: 128 knots, and V2: 139 knots. The first officer was to be the flying pilot. He was conducting his first non supervised line takeoff in a Boeing 737. About 2 minutes later, the first officer announced \"stabilizer and trim\" as part of the before-takeoff checklist. The captain responded with \"set\" and then corrected himself by saying: \"Stabilizer trim, I forgot the answer. Set for takeoff.\" Flight 5050 was cleared into position to hold at the end of the runway at 23:18:26 and received takeoff clearance at 23:20:05. The first officer pressed the autothrottle disengage and then pressed the TO/GA button, but noted no throttle movement. He then advanced the throttles manually to a \"rough\" takeoff-power setting. The captain then said: \"Okay, that's the wrong button pushed\" and 9 seconds later said: \"All right, I'll set your power.\" During the takeoff roll the airplane began tracking to the left. The captain initially used the nosewheel steering tiller to maintain directional control. About 18 seconds after beginning the roll a \"bang\" was heard followed shortly by a loud rumble, which was due to the cocked nosewheel as a result of using the nosewheel steering during the takeoff roll. At 23:20:53, the captain said \"got the steering.\" The captain later testified that he had said, \"You've got the steering.\" The first officer testified that he thought the captain had said: \"I've got the steering.\" When the first officer heard the captain, he said \"Watch it then\" and began releasing force on the right rudder pedal but kept his hands on the yoke in anticipation of the V1 and rotation callouts. At 23:20:58.1, the captain said: \"Let's take it back then\" which he later testified meant that he was aborting the takeoff. According to the captain, he rejected the takeoff because of the continuing left drift and the rumbling noise. He used differential braking and nose wheel steering to return toward the centerline and stop. The throttle levers were brought back to their idle stops at 23:20:58.4. The indicated airspeed at that time was 130 knots. Increasing engine sound indicating employment of reverse thrust was heard on the CVR almost 9 seconds after the abort maneuver began. The airplane did not stop on the runway but crossed the end of the runway at 34 knots ground speed. The aircraft dropped onto the wooden approach light pier, which collapsed causing the aircraft break in three and drop into 7-12 m deep East River. The accident was not survivable for the occupants of seats 21A and 21B because of the massive upward crush of the cabin floor.", "probable_cause": "The captain's failure to exercise his command authority in a timely manner to reject the take-off or take sufficient control to continue the take-off, which was initiated with a mistrimmed rudder. Also causal was the captain's failure to detect the mistrimmed rudder before the take-off was attempted. Board member Jim Burnett filed the following concurring and dissenting statement: \"Although I concur with the probable cause as adopted as far as it goes, I would have added the following as a contributing factor: Contributing to the cause of the accident was the failure of USAir to provide an adequately experienced and seasoned flight crew."}