{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-1245-brno-2-killed", "date": "May 26, 1998 at 0615 LT", "type": "Pilatus PC-12", "operator": "Adolf Henschel", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Brno - Altenburg", "msn": "158", "yom": 1996, "flight_number": null, "city": "Brno-Tuřany", "zone": "South Moravian Region (Jihomoravský kraj)", "country": "Czech Republic", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 651, "captain_hours_type": 397, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After takeoff from runway 28 at Brno-Tuřany Airport, the pilot reported on the tower frequency that she needs to land. She received instruction to continue a southern (left-hand) circuit and to report final for runway 28. At this time the first contact was made with the aeroplane by secondary radar at a height of about 520 feet AAL and 560 metres north from runway 28. The pilot did not confirm the instruction, did not turn for the southern (left-hand) circuit, but continued to turn for the northern (right-hand) one. Since she did not confirm repeated approval for the left-hand circuit and continued the right-hand one, she received information from tower that it is possible to continue the northern circuit, clearance to land to runway 28 ans was offered assistance after landing. Without any confirmation. At this time the height was approximately 930 feet AAL and position 2,8 km north from the aerodrome. The aeroplane started gradually to descend and to turn as the pilot probably intended to accomplish approach for runway 28. However it did not happen and the aeroplane hit the ground at 0615,28 approximately 600 metres north from the runway 28 threshold. The aeroplane was flying very low in the last phase of flight according to statements of witnesses. The last height recorded by the secondary radar was approximately 120 feet AAL 13 seconds prior to the impact onto ground. Witnesses described the attitude of the aeroplane prior to strike to ground as very unusual. Both occupants were killed. ", "probable_cause": "The following factors were identified:\r\n- The critical situation was caused by flap asymmetry. It occurred as a result of shear in torsion of the left-hand inner flexible shaft.\r\n- Loss of controllability caused by reduction of airspeed with use of Beta range in the final phase of the flight was the direct cause of the accident.\r\n- Incorrect application of emergency procedures for flap retraction listed in the Pilot's Operating Handbook was the main cause of the accident. "}