{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-new-york-1-killed", "date": "Oct 18, 1995 at 2055 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "East Coast Aviation Services", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Atlantic City – Farmingdale", "msn": "31-7952075", "yom": 1979, "flight_number": null, "city": "New York-JFK", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6950, "captain_hours_type": 425, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7335, "circumstances": "While descending from 5,000 feet to 3,000 feet, the pilot informed ATC that the left engine had failed and the engine cowling was open. The crew said that after feathering the left propeller, and with the right engine at full power, they could not arrest a 300-500 fpm rate of descent. The crew informed ATC that they would be landing in the water. All the occupants exited the airplane from the left front pilot's emergency door. The victims were in the water for approximately 30 minutes before being rescued. One of the passengers was in cardiac arrest when he was retrieved from the water. Examination of the left engine revealed that the #2 cylinder had separated from the engine in flight as a result of high stress fatigue cracking of the cylinder hold down studs and the #3 main bearing thru-studs. The fatigue in the studs occurred as a result of the cylinder fastener preload forces either initially inadequate or lost during service. Maintenance records indicated that the thru-stud was replaced 80 service hours prior to the accident. Examination of the cylinder hold down studs and the #3 main bearing thru-studs revealed that they were improperly torqued, resulting in low initial preload on the fasteners. Incorrect installation of the oversize thru-studs, per existing service information, could have also been a factor in the improper torquing of the studs. The locations of the fatigue origins and the edge worn into the deck indicate that the upper studs were probably the first to fail, allowing the cylinder to rock on the lower rear corner of the cylinder flange. ", "probable_cause": "A total loss of left engine power as a result of an in-flight separation of the #2 cylinder. The cylinder separated due to high stress fatigue cracking of the cylinder hold down studs and the #3 main bearing thru-studs. Factors in this accident were: improper torquing of the studs and failure of maintenance personnel to properly comply with service information. "}