{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-poughkeepsie", "date": "Jul 19, 2019 at 1440 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Akron Aerostar", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Akron – Pawtucket", "msn": "46-8508046", "yom": 1985, "flight_number": null, "city": "Poughkeepsie-Hudson Valley (ex Dutchess County)", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1300, "captain_hours_type": 300, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2641, "circumstances": "The pilot was in cruise flight at an altitude of 19,000 feet mean sea level (msl) for about 1 hour and 10 minutes on an easterly heading when he requested a diversion from his filed destination to an airport along his route of flight to utilize a restroom. Two miles west of his amended destination at 12,000 ft msl, the pilot advised the controller that he had a “fuel emergency light\" and wanted to expedite the approach. The controller acknowledged the low fuel warning and cleared the airplane to descend from its assigned altitude. Instead of conducting the descent over the airport, the airplane continued its easterly heading past the airport for nearly 8 miles before reversing course. After reversing course, instead of assuming a direct heading back to the airport, the pilot assumed a parallel reciprocal track and didn’t turn for the airport until the airplane intercepted the extended centerline of the landing runway. The pilot informed the controller that he was unable to make it to the airport and performed a forced landing less than 1 mile from the landing runway. Both fuel tanks were breached during the accident sequence, and detailed postaccident inspections of the airplane’s fuel system revealed no leaks in either the supply or return sides of the system. A computer tomography scan and flow-testing of the engine-driven fuel pump revealed no leaks or evidence of fuel leakage. The engine ran successfully in a test cell. Data recovered from an engine and fuel monitoring system revealed that, during the two flights before the accident flight, the reduction in fuel quantity was consistent with the fuel consumption rates depicted at the respective power settings (climb, cruise, etc). During the accident flight, the reduction in fuel quantity was consistent with the indicated fuel flow throughout the climb; however, the fuel quantity continued to reduce at a rate consistent with a climb power setting even after engine power was reduced, and the fuel flow indicated a rate consistent with a cruise engine power setting. The data also showed that the indicated fuel quantity in the left and right tanks reached 0 gallons within about 10 minutes of each other, and shortly before the accident. Given this information, it is likely that the engine lost power due to an exhaustion of the available fuel supply; however, based on available data and findings of the fuel system and component examinations, the disparate rates of indicated fuel flow and fuel quantity reduction could not be explained. ", "probable_cause": "A total loss of engine power due to fuel exhaustion as the result of a higher-than-expected fuel quantity reduction. Contributing was the pilot’s continued flight away from his selected precautionary landing site after identification of a fuel emergency, which resulted in inadequate altitude and glide distance available to complete a successful forced landing. "}