{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-f90-king-air-nacogdoches", "date": "Jan 11, 1991 at 1040 LT", "type": "Beechcraft 90 King Air", "operator": "Ridgeaire", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nacogdoches - Addison", "msn": "LA-41", "yom": 1980, "flight_number": null, "city": "Nacogdoches-A. L. Mangham Jr.", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6689, "captain_hours_type": 56, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3262, "circumstances": "The pilot reported that shortly after lifting off, the airplane began decelerating slowly. He thought the throttles had retarded; however, all of the engine instruments indicated takeoff power. Realizing that he could not return to the airport, the pilot selected a forced landing area and aimed the airplane between two trees. Investigation revealed that both props were at or near feather pitch angles at impact and being driven under power. Both engines had been changed immediately prior to the flight and both ground idle stops had been adjusted after the engine change with the left engine being slaved to the right. The system operated off of a squat switch on the right gear. Misriging of the right engine would be reflected in the left and allow oil pressure to be vented from the domes, which in turn would allow the propeller cylinder springs to drive the props toward feather as the right strut extended during takeoff. The pilot, sole on board, was seriously injured. ", "probable_cause": "The loss of thrust due to the propeller's feathering on liftoff as a result of improper adjustments made during an engine change. A factor was the lack of suitable terrain to which the pilot could execute a forced landing."}