{"url": "https://www.baaa-acro.com/crash/crash-avro-504n-east-winch-1-killed", "date": "Apr 14, 1932 at 1300 LT", "type": "Avro 504", "operator": "Royal-Air-Force-4", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "Plain, Valley", "schedule": "Digby – Marham – Bircham Newton", "msn": "K2352", "yom": null, "flight_number": null, "city": "East Winch", "zone": "Norfolk", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was performing his first solo flight from RAF Digby to RAF Bircham Newton with an intermediate stop at RAF Marham. Aircraft left RAF Digby at 1145LT bound for RAF Marham. On approach to Marham, at a height of 200-300 feet, he lost control of the aircraft that crashed in flames in a field. The aircraft was destroyed by impact forces and postcrash fire and the pilot was killed. The pilot A. J. Warford-Mein was a 23 years old Australian pupil who arrives at RAF Digby last January. He was fully competent, and the flight was authorized by the chief flying instructor, in addition to the pupil’s own instructor.", "probable_cause": "Leslie Ruskin, a team man, employed at Home Farm, East Winch, which adjoins Station Farm, said that about 1.30 on Thursday afternoon, he and another man were working in a meadow when they saw an aeroplane hovering over a field nearby. It circled three times as if looking for a landing place. It turned towards Ashwicken and then came round into the wind and dropped suddenly in a nose dive. They ran towards it and saw it crash. He thought the machine was 200 or 300 feet up when it crashed. It was blazing when they got to it, and almost burnt up. They heard the sound of an explosion. The pilot’s body was in the middle of the flames and there was no sign of life at all. They had to wait until the flames died down before they could get the body out. He had noticed nothing wrong with the machine before it crashed, only that the pilot was looking for a landing. A very strong wind was blowing at this time and it had started to rain."}