{"url": "https://www.baaa-acro.com/crash/crash-short-330-200-paris-1-killed", "date": "May 25, 2000 at 0252 LT", "type": "Short 330", "operator": "Streamline-Aviation1", "flight_phase": "Taxiing", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris - Luton", "msn": "3064", "yom": 1981, "flight_number": "SSW200", "city": "Paris-Roissy-CDG", "zone": "Val-d'Oise", "country": "France", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2240, "captain_hours_type": 1005, "copilot_hours": 4370, "copilot_hours_type": 14, "aircraft_hours": 15215, "circumstances": "The Short was departing Paris-Roissy-CDG Airport on a cargo service to Luton with two pilots on board. The crew were cleared to depart cargo stand N51 and proceed to runway 27 at 02:38. Around the same time Air Liberté Flight 8807 (an MD-83, F-GHED) also taxied to runway 27 for a flight to Madrid. At 02:44 the Charles de Gaulle ground controller asked Streamline 200 if they wished to enter runway 27 at an intermediate taxiway; the crew asked for and were granted to enter Taxiway 16. At 02:50:49 the tower controller cleared the MD-83 for takeoff: \"Liberté 8807, autorisé au décollage 27, 230°, 10 à 15 kts.\". The controller then immediately told the Shorts to line up and wait: \"Stream Line two hundred line up runway 27 and wait, number two\". As the MD-83 was travelling down the runway, the Shorts started to taxi onto the runway. At a speed of about 155 knots the left wing of MD-83 slashed through the cockpit of the Shorts plane; the MD-83 abandoned takeoff.", "probable_cause": "The following findings were identified:\r\n- Firstly, by the LOC controller’s erroneous perception of the position of the aircraft, this being reinforced by the context and the working methods, which led him to clear the Shorts to line up,\r\n- Secondly, by the inadequacy of systematic verification procedures in ATC which made it impossible for the error to be corrected,\r\n- Finally, by the Shorts’ crew not dispelling any doubts they had as to the position of the 'number one' aircraft before entering the runway.\r\nContributory factors include:\r\n- Light pollution in the area of runway 27, which made a direct view difficult for the LOC controller,\r\n- Difficulty for the LOC controller in accessing radar information: the ASTRE image was difficult to read and the AVISO image not displayed at his control position,\r\n- The use of two languages for radio communications, which meant that the Shorts crew were not conscious that the MD 83 was going to take off,\r\n- The angle between access taxiway 16 and the runway which made it impossible for the Shorts crew to perform a visual check before entering the runway,\r\n- The lack of coordination between the SOL and LOC controllers when managing the Shorts, exacerbated by the presence of a third party whose role was not defined,\r\n- A feedback system which was recent and still underdeveloped."}