{"url": "https://www.baaa-acro.com/crash/crash-boeing-777-236er-london", "date": "Jan 17, 2008 at 1242 LT", "type": "Boeing 777-200", "operator": "British%20Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Beijing - London", "msn": "30314/342", "yom": 2001, "flight_number": "BA038", "city": "London-Heathrow", "zone": "London Metropolis", "country": "United Kingdom", "region": "Europe", "crew_on_board": 16, "crew_fatalities": 0, "pax_on_board": 136, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12700, "captain_hours_type": 8450, "copilot_hours": 9000, "copilot_hours_type": 7000, "aircraft_hours": 28675, "circumstances": "G-YMMM was on a scheduled return flight from Beijing, China, to London (Heathrow) with a flight crew consisting of a commander and two co-pilots; the additional co-pilot enabled the crew to take in-flight rest. There had been no reported defects with G-YMMM during the outboard flight from London (Heathrow) to Beijing, China. The flight plan for the return sector, produced by the aircraft’s operator, required an initial climb to 10,400 m (FL341) with a descent to 9,600 m (FL315) because of predicted ‘Extreme Cold’ at POLHO (a waypoint that lies on the border between China and Mongolia). Having checked the flight plan and the weather in more detail the crew agreed on a total fuel load for the flight of 79,000 kg. The startup, taxi, takeoff at 0209 hrs and the departure were all uneventful. During the climb, Air Traffic Control (ATC) requested that G-YMMM climb to an initial cruise altitude of 10,600 m (FL348). The crew accepted this altitude and, due to the predicted low temperatures, briefed that they would monitor the fuel temperature en route. The initial climb to altitude was completed using the autopilot set in the Vertical Navigation (VNAV) mode. Approximately 350 nm north of Moscow the aircraft climbed to FL380; this step climb was carried out using the Vertical Speed (VS) mode of the autoflight system. Another climb was then carried out whilst the aircraft was over Sweden, this time to FL400, and again this was completed in VS mode. During the flight the crew monitored the fuel temperature displayed on the Engine Indication and Crew Alerting System (EICAS) and noted that the minimum indicated fuel temperature en route was -34˚C. At no time did the low fuel temperature warning annunciate. The flight continued uneventfully until the later stages of the approach into Heathrow. The commander was flying at this time and during the descent, from FL400, the aircraft entered the hold at Lambourne at FL110; it remained in the hold for approximately five minutes, during which it descended to FL90. The aircraft was radar vectored for an Instrument Landing System (ILS) approach to Runway 27L at Heathrow and subsequently stabilised on the ILS with the autopilot and autothrottle engaged. At 1,000 ft aal, and 83 seconds before touchdown, the aircraft was fully configured for the landing, with the landing gear down and flap 30 selected. At approximately 800 ft aal the co-pilot took control of the aircraft, in accordance with the briefed procedure. The landing was to be under manual control and the co-pilot intended to disconnect the autopilot at 600 ft aal. Shortly after the co-pilot had assumed control, the autothrottles commanded an increase in thrust from both engines. The engines initially responded but, at a height of about 720 ft, 57 seconds before touchdown, the thrust of the right engine reduced. Some seven seconds later, the thrust reduced on the left engine to a similar level. The engines did not shut down and both engines continued to produce thrust above flight idle, but less than the commanded thrust. At this time, and 48 seconds before touchdown, the co-pilot noted that the thrust lever positions had begun to ‘split’. On passing 500 ft agl there was an automatic call of the Radio Altimeter height, at this time Heathrow Tower gave the aircraft a landing clearance, which the crew acknowledged. Some 34 seconds before touchdown, at 430 ft agl, the commander announced that the approach was stable, to which the co-pilot responded “just”. Seven seconds later, the co-pilot noticed that the airspeed was reducing below the expected approach speed of 135 kt. On the Cockpit Voice Recorder (CVR) the flight crew were heard to comment that the engines were at idle power and they attempted to identify what was causing the loss of thrust. The engines failed to respond to further demands for increased thrust from the autothrottle and manual movement of the thrust levers to fully forward. The airspeed reduced as the autopilot attempted to maintain the ILS glide slope. When the airspeed reached 115 kt the ‘airspeed low’ warning was annunciated, along with a master caution aural warning. The airspeed stabilised for a short period, so in an attempt to reduce drag the commander retracted the flaps from flap 30 to flap 25. In addition, he moved what he believed to be an engine starter/ignition switch on the overhead panel. The airspeed continued to reduce and by 200 ft it had decreased to about 108 kt. Ten seconds before touchdown the stick shaker operated, indicating that the aircraft was nearing a stall and in response the co-pilot pushed the control column forward. This caused the autopilot to disconnect as well as reducing the aircraft’s nose-high pitch attitude. In the last few seconds before impact, the commander attempted to start the APU and on realising that a crash was imminent he transmitted a ‘MAYDAY’ call. As the aircraft approached the ground the co-pilot pulled back on the control column, but the aircraft struck the ground in the grass undershoot for 27L approximately 330 m short of the paved runway surface and 110 m inside the airfield perimeter fence. During the impact and short  round roll the nose landing gear (NLG) and both the main landing gears (MLG) collapsed. The right MLG separated from the aircraft but the left MLG remained attached. The aircraft came to rest on the paved surface in the undershoot area of Runway 27L. The commander attempted to initiate an evacuation by making an evacuation call, which he believed was on the cabin Passenger Announcement (PA) system but which he inadvertently transmitted on the Heathrow Tower frequency. During this period the co-pilot started the actions from his evacuation checklist. Heathrow Tower advised the commander that his call had been on the tower frequency so the commander repeated the evacuation call over the aircraft’s PA system before completing his evacuation checklist. The flight crew then left the flight deck and exited the aircraft via the escape slides at Doors 1L and 1R. The cabin crew supervised the emergency evacuation of the cabin and all occupants left the aircraft via the slides, all of which operated correctly. One passenger was seriously injured, having suffered a broken leg, as a result of detached items from the right MLG penetrating the fuselage. Heathrow Tower initiated their accident plan, with a crash message sent at 1242:22 hrs and fire crews were on scene 1 minute and 43 seconds later. The evacuation was completed shortly after the arrival of the fire vehicles. After the aircraft came to rest there was a significant fuel leak from the engines and an oxygen leak from the disrupted passenger oxygen bottles, but there was no fire. Fuel continued to leak from the engine fuel pipes until the spar valves were manually closed.", "probable_cause": "Whilst on approach to London (Heathrow) from Beijing, China, at 720 feet agl, the right engine of G-YMMM ceased responding to autothrottle commands for increased power and instead the power reduced to 1.03 Engine Pressure Ratio (EPR). Seven seconds later the left engine power reduced to 1.02 EPR. This reduction led to a loss of airspeed and the aircraft touching down some 330 m short of the paved surface of Runway 27L at London Heathrow. The investigation identified that the reduction in thrust was due to restricted fuel flow to both engines. It was determined that this restriction occurred on the right engine at its FOHE. For the left engine, the investigation concluded that the restriction most likely occurred at its FOHE. However, due to limitations in available recorded data, it was not possible totally to eliminate the possibility of a restriction elsewhere in the fuel system, although the testing and data mining activity carried out for this investigation suggested that this was very unlikely. Further, the likelihood of a separate restriction mechanism occurring within seven seconds of that for the right engine was determined to be very low.\r\nThe investigation identified the following probable causal factors that led to the fuel flow restrictions:\r\n1) Accreted ice from within the fuel system released, causing a restriction to the engine fuel flow at the face of the FOHE, on both of the engines.\r\n2) Ice had formed within the fuel system, from water that occurred naturally in the fuel, whilst the aircraft operated with low fuel flows over a long period and the localised fuel temperatures were in an area described as the ‘sticky range’.\r\n3) The FOHE, although compliant with the applicable certification requirements, was shown to be susceptible to restriction when presented with soft ice in a high concentration, with a fuel temperature that is below -10°C and a fuel flow above flight idle.\r\n4) Certification requirements, with which the aircraft and engine fuel systems had to comply, did not take account of this phenomenon as the risk was unrecognised at that time. "}