{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-waldron-1-killed", "date": "Apr 4, 1999 at 1831 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Robert R. Meredith", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Nashville – Addison", "msn": "46-36197", "yom": 1999, "flight_number": null, "city": "Waldron", "zone": "Arkansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 732, "captain_hours_type": 23, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 30, "circumstances": "While in cruise flight at 24,000 feet msl, the pilot of the Piper Malibu Mirage advised Memphis Center that he had encountered icing conditions and was experiencing a fuel imbalance. The pilot requested and was cleared to deviate to the north. Subsequently, radio and radar contact were lost. A witness reported hearing the sound of the airplane's engine stop running and observed the airplane descending from the dark clouds in a nose down attitude and rotating clockwise. Residents of the area reported that the weather at the time of the accident was high ceilings with heavy rain just before and after the accident. There were thunderstorms with lightning in the area at the time of the accident. The wreckage of the airplane was scattered along an area of about four miles. The airplane was equipped with an autopilot, weather radar, and an ice protection system. The pilot had recently purchased the 1999 model airplane and had completed a Mirage initial training course. At the time of the accident the pilot had accumulated a total of 21.4 hours in the make and model of the accident aircraft. No anomalies were found with the airframe or engine that would have prevented normal operation. ", "probable_cause": "The pilot's encounter with adverse weather and loss of aircraft control, which resulted in exceeding the aircraft's design stress limits. Factors were the pilot's lack of total experience in the make and model of airplane, and the icing and thunderstorm weather conditions. "}