{"url": "https://www.baaa-acro.com/crash/crash-cessna-525a-citationjet-cj2-santa-monica-4-killed", "date": "Sep 29, 2013 at 1820 LT", "type": "Cessna 525 CitationJet CJ2", "operator": "CREX-MML", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Hailey - Santa Monica", "msn": "525A-0194", "yom": 2003, "flight_number": null, "city": "Santa Monica", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3463, "captain_hours_type": 1236, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1932, "circumstances": "The private pilot was returning to his home airport; the approach was normal, and the airplane landed within the runway touchdown zone markings and on the runway centerline. About midfield, the airplane started to drift to the right side of the runway, and during the landing roll, the nose pitched up suddenly and dropped back down. The airplane veered off the runway and impacted the 1,000-ft runway distance remaining sign and continued to travel in a righthand turn until it impacted a hangar. The airplane came to rest inside the hangar, and the damage to the structure caused the roof to collapse onto the airplane. A postaccident fire quickly ensued. The subsequent wreckage examination did not reveal any mechanical anomalies with the airplane's engines, flight controls, steering, or braking system. A video study was conducted using security surveillance video from a fixed-base operator located midfield, and the study established that the airplane was not decelerating as it passed through midfield. Deceleration was detected after the airplane had veered off the runway and onto the parking apron in front of the rows of hangars it eventually impacted. Additionally, video images could not definitively establish that the flaps were deployed during the landing roll. However, the flaps were deployed as the airplane veered off the runway and into the hangar, but it could not be determined to what degree. To obtain maximum braking performance, the flaps should be placed in the ”ground flap” position immediately after touchdown. The wreckage examination determined that the flaps were in the ”ground flap” position at the time the airplane impacted the hangar. Numerous personal electronic devices that had been onboard the airplane provided images of the passengers and unrestrained pets, including a large dog, with access to the cockpit during the accident flight. Although the unrestrained animals had the potential to create a distraction during the landing roll, there was insufficient information to determine their role in the accident sequence or what caused the delay in the pilot’s application of the brakes.", "probable_cause": "The pilot’s failure to adequately decrease the airplane’s ground speed or maintain directional control during the landing roll, which resulted in a runway excursion and collision with an airport sign and structure and a subsequent postcrash fire."}