{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-bournemouth", "date": "May 18, 2011 at 1131 LT", "type": "Beechcraft 90 King Air", "operator": "Sherborne Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bournemouth - Manchester", "msn": "LW-198", "yom": 1976, "flight_number": null, "city": "Bournemouth-Hurn", "zone": "Dorset", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 800, "captain_hours_type": 660, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot had planned to fly from Bournemouth Airport to Manchester Airport operating the flight as a single pilot, with a passenger seated in the co-pilot’s seat. He arrived at the airport approximately one hour before the planned departure time of 1130 hrs, completed his pre‑flight activities and went to the aircraft at approximately 1110 hrs. The 1120 hrs ATIS gave the weather at the airport as: surface wind from 230° at 10 kt, visibility 10 km or greater, few clouds at 1,000 ft, broken cloud at 1,200 ft and at 2,000 ft, temperature 16°C, dew point 12°C and QNH 1015 hPa. After starting the engines, the pilot was cleared to taxi to holding point ‘N’ for a departure from Runway 26 and he was given clearance to take off at 1127 hrs. At 1129:45 hrs, approximately 55 seconds after the aircraft became airborne, the aerodrome controller transmitted “four six bravo mike do you have a problem?” because he believed the aircraft was not climbing normally. The pilot replied “november four six bravo going around” and, shortly afterwards, “four six bravo requesting immediate return”. The controller cleared the pilot to use either runway to land back at the airport but received no reply. The pilot carried out a forced landing into a field 1.7 nm west of the Runway 08 threshold at Bournemouth Airport and neither he nor his passenger was hurt.", "probable_cause": "The pilot experienced symptoms of symmetrical power loss sufficient to prevent the aircraft from sustaining level flight and made a forced landing into a field. The deficiency in the aircraft’s takeoff performance suggested that its powerplants were not producing sufficient thrust. As fuel contamination was discounted and no fault was found in either engine, it was concluded that, in all probability, the poor performance was not caused by a failure in either powerplant. Maximum rpm was not selected for departure but it was unlikely that this explained the aircraft’s poor performance on the runway or in the air. The pilot insisted that he had set torque to the takeoff limit. There was insufficient evidence to enable the cause of the apparent power loss to be determined."}