{"url": "https://www.baaa-acro.com/crash/crash-cessna-441-conquest-ii-latrobe-5-killed", "date": "Nov 11, 1985 at 1804 LT", "type": "Cessna 441 Conquest", "operator": "Hy Flight Associates", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Rockford - Derry", "msn": "441-0177", "yom": 1980, "flight_number": null, "city": "Latrobe-Arnold Palmer-Westmoreland County", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 14000, "captain_hours_type": 1200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1760, "circumstances": "During arrival, the pilot was advised the destination weather was: estimated 500 feet overcast, visibility one mile with fog, airport below minimums. The pilot elected to make an NDB runway 23 approach, but said he would divert if a missed approach was made. He was provided radar vectors and was cleared for the approach. At the IAF (initial apch fix/tiney intersection), radar service was terminated and the pilot was told to contact tower. On tower frequency, the pilot was again reminded the airport was below minimums. Approximately two minutes later, he reported over the outer marker (OM) which was 4.2 miles past (southwest of) the NSB/final approach fix (FAF) and 3.9 miles northeast of the airport. Seconds later, the tower transmitted info (just recorded from ARTCC) that the aircraft was 2-1/2 mi east of course. Tower tried to notify the pilot, but radio and radar contact were lost. Investigations revealed the aircraft impacted a ridge nearly 4 miles past the NDB and two miles left of course at an elevation of approximately 1,900 feet, but before passing the OM. Minimum descent altitude (MDA) between the NDB and OM was 2,220 feet msl. MDA after passing the OM was 1,940 feet; airport elevation was 1,161 feet. No preimpact aircraft problems were found. The NDB facility operated satisfactorily during flight and ground checks. All five occupants were killed. ", "probable_cause": "Occurrence #1: in flight collision with terrain/water\r\nPhase of operation: approach - faf/outer marker to threshold (ifr)\r\nFindings\r\n1. (f) light condition - dark night\r\n2. (f) weather condition - low ceiling\r\n3. (f) weather condition - fog\r\n4. (f) weather condition - below approach/landing minimums\r\n5. (f) in-flight planning/decision - improper - pilot in command\r\n6. (c) ifr procedure - improper - pilot in command\r\n7. (c) proper alignment - not maintained - pilot in command\r\n8. (c) proper altitude - not maintained - pilot in command\r\n9. (f) terrain condition - mountainous/hilly\r\n10. (f) terrain condition - rising"}