{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-grand-rapids-1-killed", "date": "Jul 4, 2005 at 1758 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Stephen D. Jensen", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Grand Rapids – Minneapolis", "msn": "46-8508037", "yom": 1985, "flight_number": null, "city": "Grand Rapids-Itasca County", "zone": "Minnesota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2200, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1856, "circumstances": "The airplane was destroyed on impact with terrain during a forced landing following an observed in-flight loss of engine power after takeoff. A witness observed the takeoff and stated that the airplane took off from the end of runway 34. About halfway down the runway the airplane emitted a sound like a rapid misfire, a pop, and then no more audible engine sounds. The airplane was about 300 to 400 feet above ground level at that point. He said that the airplane turned right then turned left to a bank where the wing was straight down. The airplane's wings then leveled, the airplane descended, and it impacted terrain. He stated that the time from the sounds to the impact was about two to three seconds. An on-scene examination revealed no airframe pre-impact anomalies. An engine examination revealed a cracked crankshaft propeller flange. The engine without the turbochargers and with the original crankshaft was test run up to 2,100 RPM. A propeller and governor inspection revealed no anomalies. Examination of the turbocharger system's exhaust bypass valve assembly revealed its butterfly valve was stuck (bound) in the extended closed position. The engine's cracked crankshaft was removed and a serviceable crankshaft was installed. The engine was test run again with a serviceable exhaust bypass valve assembly. The engine produced rated power. The original exhaust bypass valve assembly was reinstalled. The exhaust bypass valve assembly's wastegate bound again during an engine run and a loss of engine power was observed. Sectioning of the bypass valve assembly revealed a bent wastegate shaft. The valve assembly lever arm was bent and exhibited pre-impact tool marks consistent with pliers loosening a bound wastegate shaft. The airplane's pilot operating handbook and Federal Aviation Administration (FAA) approved airplane flight manual (POH), in part, stated, \"ENGINE POWER LOSS DURING TAKEOFF If sufficient runway remains for a normal landing, leave gear down and land straight ahead.\" The engine manufacturer's maintenance and operator's manual stated that the wastegate is required to be checked for operation and condition during 100 hour inspections. The manual did not specify a procedure for maintenance personnel on how to check the wastegate's operation and its acceptable condition. National Transportation Safety Board Recommendation A-94-081, issued to the FAA in 1994, stated, \"Require the amendment of pilot operating handbooks and airplane flight manuals applicable to aircraft equipped with engine turbochargers by including in the 'Emergency Procedures' section information regarding turbocharger failure. The information should  include procedures to minimize potential hazards relating to fire in flight and/or loss of engine power.\" The airplane's POH latest revision was dated October 14, 2002 and review of the emergency procedures section showed that the POH did not contain information, procedures, or amplified procedures on turbocharger failures. The airplane accumulated 8.7 hours of operation since the last annual inspection.", "probable_cause": "An observed loss of engine power due to the bound/jammed turbocharger wastegate during takeoff, the pilot not maintaining airplane control, and the stall he inadvertently encountered. A factor was the maintenance personnel not replacing the turbocharger wastegate bypass valve assembly during the last annual inspection 8.7 hours of operation prior to the accident. An additional factor was the manufacturer's insufficiently defined inspection conditions for the bypass valve's proper operation."}