{"url": "https://www.baaa-acro.com/crash/crash-cessna-208-caravan-i-whitsunday-island", "date": "Jan 28, 2016 at 1518 LT", "type": "Cessna 208A Caravan", "operator": "Hamilton-Island-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Hamilton Island - Whitsunday Island", "msn": "208-0522", "yom": 2010, "flight_number": null, "city": "Whitsunday Island", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1350, "captain_hours_type": 230, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1510, "circumstances": "On 28 January 2016 the pilot of a Cessna Aircraft Company Caravan 208 amphibian aircraft, registered VH-WTY (WTY) was conducting a series of charter flights in the Whitsunday region of Queensland. The pilot was conducting his third flight of the day when the aircraft departed Hamilton Island Airport at about 1415 Eastern Standard Time with 10 passengers on board. The tour included a scenic flight over the Great Barrier Reef for about 50 minutes before heading to Chance Bay, on the south-east tip of Whitsunday Island, about 11 km north east of Hamilton Island Airport. Following a water landing at Chance Bay, the group was to spend 90 minutes at the beach before a short flight back to Hamilton Island. The tour was originally planned to include a landing at Whitehaven Beach, however wind conditions at the time required the water landing be altered to Chance Bay. Radar surveillance data showed WTY approach Whitsunday Island from the north and conduct an orbit about 2 km north of Whitehaven Beach at about 1510, before heading toward Whitehaven Beach. WTY flew over the southern end of Whitehaven Beach and the strip of land that separates it from Chance Bay. At about 1515, after crossing Chance Bay beach in a southerly direction, WTY descended below radar surveillance for the remainder of the flight. The pilot advised that he flew WTY over the western end of Chance Bay’s main beach in order to conduct a visual pre-landing check of the bay. The pilot noted the positions of various vessels moored in the bay to determine the best taxi path to the beach. During this fly-over, the pilot also noted the sea state and observed evidence of wind gusts on the water surface. The pilot then initiated a right downwind turn toward the landing area. The approach was from the south with the intent to land in the most suitable location within the designated landing area and then taxi to the beach. The pilot reported setting up for landing at about 50 ft above the water and then delayed the landing in order to fly through an observed wind gust. Passenger video footage indicated that, during the subsequent landing, WTY bounced three times on the surface of the water. After the second bounce, with WTY getting closer to the beach and terrain, the pilot increased engine power and initiated a go-around. The third bounce, which occurred almost immediately after the second, was the most pronounced and resulted in the aircraft rebounding about 30 to 50 ft above the water. While increasing power, the pilot perceived that the torque was indicating red, suggesting an over-torque for the selected propeller configuration. Noticing that the climb performance was less than expected with the flaps at 30˚, the pilot stopped increasing power and reduced the flap to 20˚. As the aircraft climbed straight ahead towards a saddle, climb performance was still below the pilot’s expectations and he assessed that WTY would not clear the terrain. In response, the pilot turned right to avoid the surrounding rising terrain. WTY clipped trees during this turn, before colliding with terrain and coming to rest in dense scrub about 150 m from the eastern end of the main beach, near the top of the ridge. The pilot promptly advised the passengers to exit and move away from the aircraft. Some of the 11 people on board suffered minor injuries but all were able to quickly leave the aircraft. There was no post-impact fire. The aircraft’s fixed emergency beacon self-activated during the collision with terrain and was detected by the Australian Maritime Safety Authority (AMSA), resulting in a search and rescue response being initiated by the Joint Rescue Coordination Centre (JRCC) Australia. The pilot reported also activating his personal locator beacon, however this was not detected by AMSA. In addition, the pilot used the company satellite phone to advise the operator of the occurrence and current status of all on board. At about the same time, several witnesses who were located in Chance Bay made their way to the aircraft before assisting everyone down to the beach. A tourist boat was utilized to transfer the pilot and passengers to Hamilton Island, arriving at about 1600. From there, one passenger was transferred by helicopter to Mackay for further treatment.", "probable_cause": "From the evidence available, the following findings are made with respect to the collision with terrain involving amphibian Cessna Aircraft Company C208 Caravan aircraft, registered VH-WTY that occurred at Chance Bay, 11 km north-east of Hamilton Island airport, Queensland, on 28 January 2016. These findings should not be read as apportioning blame or liability to any particular organisation or individual. \r\nContributing factors:\r\n- The aircraft's initial touches with water were past the nominated decision point and beyond the northern boundary of the ALA, which reduced the safety margins available for a successful water landing or go-around.\r\n- The pilot initiated a go-around without using all available power and the optimal speed, turned towards higher terrain and placed the aircraft in a down-wind situation, which ultimately resulted in the collision with terrain.\r\nOther findings:\r\n- The aircraft was equipped with lap-sash seatbelts, which have been demonstrated to reduce injury, and the use of emergency beacons and satellite phone facilitated a timely response to the accident."}