{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-maiden-1-killed", "date": "Jan 9, 1998 at 1704 LT", "type": "Cessna 208B Grand Caravan", "operator": "FedEx", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Maiden - Greensboro", "msn": "208B-0013", "yom": 1987, "flight_number": null, "city": "Maiden", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4030, "captain_hours_type": 860, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6183, "circumstances": "The pilot was reported to be in a hurry as he positioned two aircraft and picked up the accident aircraft for his final positioning leg. He told company personnel he had a birthday party to go to and his family confirmed this. The pilot reported to company personnel that he was departing on runway 3 and that he would report in on his arrival at the destination. No further contacts with the flight were made and the wreckage of the aircraft was discovered off the end of the departure runway about 40 minutes after his reported takeoff. Examination showed the aircraft had run off the left side of the runway about 800 feet from the end and then crossed over the runway and entered into the woods at the departure end of the runway. Post crash examination showed no evidence of pre crash failure or malfunction of the aircraft structure, flight controls, or engine. The onboard engine computer showed the engine was producing normal engine power and the aircraft was traveling at 98 knots when electrical power was lost as it collided with trees. The aircraft's control lock was found tangled in the instrument panel near the left control yoke where it is normally installed and the lock had multiple abnormal bends, including a 90 degree bend in the last 1/2 inch of the lock where it engages the control column. Removal of the control lock and checking the flight controls for freedom is on the normal pilots checklist. The pilot was also found to not be wearing his shoulder harness.", "probable_cause": "The pilot's failure to remove the control lock prior to takeoff and his failure to abort the takeoff when he was unable to initiate a climb, resulting in the aircraft over running the runway and colliding with trees on the departure end of the runway. Contributing to the accident was the pilot's self-induced pressure to arrive at his destination to attend a family affair."}