{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-76md-privolzhskiy-afb", "date": "Jun 20, 2000 at 1750 LT", "type": "Ilyushin II-76", "operator": "Russian%20Air%20Force.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Government", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Makhatchkala – Privolzhskiy – Vozzhayevka – Khabarovsk", "msn": "00734 75245", "yom": 1987, "flight_number": null, "city": "Privolzhskiy AFB (Astrakhan)", "zone": "Astrakhan oblast", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 221, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Makhachkala on a flight to Khabarovsk with intermediate stops at Privolzhskiy AFB and Vozzhayevka AFB, carrying 221 passengers and a crew of seven on behalf of the Russian Ministry of Defense. Some 23 minutes after takeoff from Privolzhskiy AFB, while cruising at an altitude of 6,100 metres, the crew encountered technical problems with the fuel system and was cleared to return for an emergency landing. While descending to Privolzhskiy AFB, the flaps could not be lowered and a fire erupted in the left wing. After touchdown, the aircraft was unable to stop within the remaining distance, overran, lost its undercarriage and came to rest 200 metres further, bursting into flames. All 232 occupants evacuated safely while the aircraft was destroyed by a post crash fire. ", "probable_cause": "An in-flight fire occurred in the area between the second and third flap tracks on the left wing, which led to a failure of the fuel lines, hydraulic systems and flap control systems. The most likely cause of the fire was a production flaw, causing electric wires to touch the hydraulic system pipeline, which led to a chafing of the insulation of the wires, their short circuit with subsequent piercing of the pipeline and ignition. The unsuitability of fire extinguishing means and the unpreparedness of the fire brigade of the Privolzhskiy AFB to extinguish fires on aircraft with a flight mass of more than 50 tons led to the destruction by fire of the aircraft on the ground."}