{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-55f-asuncion-22-killed", "date": "Feb 4, 1996 at 1412 LT", "type": "Douglas DC-8", "operator": "LAC-Colombia-2", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "City", "schedule": "Barranquilla - Asunción - Campinas", "msn": "45882", "yom": 1966, "flight_number": "ALA028", "city": "Asunción-Silvio Pettirossi", "zone": "Central", "country": "Paraguay", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 18, "total_fatalities": 22, "captain_hours": 9100, "captain_hours_type": 5919, "copilot_hours": 3500, "copilot_hours_type": 3158, "aircraft_hours": 66326, "circumstances": "The aircraft was completing a positioning flight from Asunción to Campinas on behalf of Alas Paraguayas, under flight number ALA028. As there was no cargo on board, the crew decided to make profit of the situation to perform training upon takeoff. During the takeoff roll on runway 02, at Vr speed, the captain reduced the power on engine n°1 and after liftoff, he reduced power on engine n°2. With the undercarriage still down and the flaps at 15°, the aircraft became unstable, lost height and crashed in the district of Mariano Roque Alonso, about 1,500 metres past the runway end. The aircraft was destroyed by impact forces and a post crash fire and all four occupants were killed as well as 18 people on ground, most of them children taking part to a volleyball game. ", "probable_cause": "It was determined that the loss of control during initial climb was the consequence of the decision of the crew to perform training upon takeoff, intentionally reducing power on both engines n°1 and 2. This decision was taken at a critical phase of flight and the copilot-in-command was unable to maintain control of the aircraft, causing the aircraft to lose speed and to stall.\r\nThe following contributing factors were reported:\r\n- The captain's experience in such configuration was low, \r\n- Lack of flight safety doctrine in the cockpit during all flight,\r\n- Execution of unauthorized takeoff training under uncontrolled conditions,\r\n- Execution of such take-off training by a person who was not qualified as an instructor."}