{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b90-king-air-sturtevant", "date": "Oct 22, 2012 at 1830 LT", "type": "Beechcraft 90 King Air", "operator": "Direct Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jackson - Sturtevant", "msn": "LJ-406", "yom": 1968, "flight_number": null, "city": "Sturtevant", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2331, "captain_hours_type": 1425, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12637, "circumstances": "The aircraft collided with a fence and a ditch when it overran runway 8R (2,272 feet by 38 feet, asphalt) while landing at the Sylvania Airport (C89), Sturtevant, Wisconsin. The commercial pilot was not injured and his passenger received minor injuries. The airplane sustained damage to its fuselage and both wings. The airplane was registered to Direct Action Aviation LLC, and was operated by Skydive Midwest. The accident flight was conducted under the provisions of 14 Code of Federal Regulations Part 91 as a personal flight. Instrument meteorological conditions prevailed for the flight, which was not operated on a flight plan. The flight originated from the Jackson County Airport-Reynolds Field (JXN), Jackson, Michigan, about 1800. The pilot reported that the landing approach was normal and when the airplane crossed the runway threshold it floated and he pulled the engine power levers to the stops. He stated that although he did not remember the airplane bouncing, his passenger told him that it had. He pulled the power levers to reverse, but there was no immediate reverse thrust. He applied brakes and felt the airplane accelerate. He recognized that he would not be able to stop the airplane on the remaining runway and attempted to steer it to the north. The airplane left the runway, impacted two ditches and came to rest on a highway. The pilot stated that he should have recognized that braking action would be significantly reduced with the possibility of hydroplaning, that pulling the power levers to the stops before touchdown induced a lag in realization of reverse thrust, and that he should have executed a go-around when the airplane floated before landing. The pilot reported no mechanical failures or malfunctions of the airplane. At 1853, weather conditions reported at the Kenosha regional Airport (ENW), located 6 miles south of the accident site, included heavy rain.", "probable_cause": "The pilot's decision to continue the landing after touching down long and on a wet runway that reduced the airplane’s braking capability, which resulted in an overrun."}