{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1049h-super-constellation-adak-1-killed", "date": "Mar 15, 1962 at 0114 LT", "type": "Lockheed L-1049 Super Constellation", "operator": "Flying%20Tiger%20Line", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Travis – Cold Bay – Adak – Misawa – Kadena", "msn": "4804", "yom": 1957, "flight_number": "FT7816", "city": "Adak", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 13000, "captain_hours_type": 3055, "copilot_hours": 19000, "copilot_hours_type": 1211, "aircraft_hours": 16038, "circumstances": "A Lockheed Constellation, model L-1049H, N 6911C, owned by The Flying Tiger Line Inc., and being operated under contract with the Military Air Transport Service, crashed during the hours of darkness at Adak, Alaska, March 15, 1962, at 1214 G.m.t. Impact and subsequent fire destroyed the aircraft. There were seven occupants, all crew members. Six received minor injuries and one, the duty flight engineer, was trapped in the cockpit and died in the fire. This was a scheduled cargo flight, designated by the carrier as Flight No. FTL 7816/14. It originated at Travis Air Force Base, California, for Kadena Air Force Base, Okinawa, with stops planned at Cold Bay, Alaska, Adak, Alaska, and Misawa, Japan. Shortly after departure from Travis Air Force Base, buffeting developed and the aircraft was landed back at Travis. Inspection disclosed an open hydraulic reservoir access door. This was closed and secured and the flight proceeded uneventfully to Cold Bay, Alaska. The flight from Cold Bay to the vicinity of Adak was also uneventful, with the copilot flying the aircraft from the left seat and the captain acting as copilot in the right seat. Instrument weather prevailed at Adak and a ground controlled approach (GCA) was started. The flight was advised several times that it was below the glide slope and then was advised to execute a missed approach. The aircraft’s captain replied that the field was in sight. The approach continued, visually. At a point 328 feet short of the runway threshold and four feet below its level the landing gear struck rocks. The main landing gear was torn off and the aircraft slid about 2,000 feet on the runway coining to rest just off its edge. A severe fire developed.", "probable_cause": "The Board determines that the probable cause of this accident was the pilot’s misjudgment of distance and altitude during the final approach for landing."}