{"url": "https://www.baaa-acro.com/crash/crash-cessna-421a-golden-eagle-i-denver-3-killed", "date": "Dec 17, 2004 at 1522 LT", "type": "Cessna 421A Golden Eagle I", "operator": "Nadia E. Barghelame", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Denver - Denver", "msn": "421A-0069", "yom": 1968, "flight_number": null, "city": "Denver-Centennial", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 12000, "captain_hours_type": null, "copilot_hours": 414, "copilot_hours_type": 31, "aircraft_hours": 2666, "circumstances": "The pilot's father had just purchased the airplane for his daughter, and she was receiving model-specific training from a contract flight instructor. Her former flight instructor was aboard as a passenger. The engines were started and they quit. They were restarted and they quit again. They were started a third time, and the airplane was taxied for takeoff. Shortly after starting the takeoff roll, the pilot reported an unspecified engine problem. The airplane drifted across the median and parallel runway, then rolled abruptly to the right, struck the ground, and cartwheeled. The landing gear was down. Neither propeller was feathered. Disassembly of the right engine and turbocharger revealed no anomalies. Disassembly and examination of the left engine and turbocharger revealed the mixture shaft and throttle valve in the throttle and fuel control assembly were jammed in the idle cutoff and idle rpm positions, respectively. Manifold valve and fuel injector line flow tests produced higher-than-normal pressures, indicative of a flow restriction. Disassembly of the manifold valve revealed the needle valve in the plunger assembly was stuck in the full open position, collapsing the needle valve spring. A scribe was used to free the needle valve, and the manifold valve and fuel injector lines were again flow tested. The result was a lower pressure. Plunger disassembly revealed the threads had been tapped inside the retainer and metal shavings were found between the retainer and spring. The Teledyne Continental Motor (TCM) retainer has no threads. GPS download showed that 2,698 feet had been covered between the start of the takeoff roll and the attainment of rotation speed. Maximum speed attained was 132 mph. Computations indicated distance to clear a 50-foot obstacle was 2,000 feet, distance to clear a 50-foot obstacle (single engine) was 2,600 feet, and accelerate-stop distance was 3,000 feet.", "probable_cause": "Loss of engine power due to fuel starvation, and the instructor's failure to maintain aircraft control. Contributing factors were a partially blocked fuel line resulting in restricted fuel flow, the instructor's failure to perform critical emergency procedures, and his failure to abort the takeoff in a timely manner."}