{"url": "https://www.baaa-acro.com/crash/crash-saab-340b-amsterdam-3-killed", "date": "Apr 4, 1994 at 1446 LT", "type": "Saab 340", "operator": "KLM%20Cityhopper", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Amsterdam - Cardiff", "msn": "195", "yom": 1990, "flight_number": "KL433", "city": "Amsterdam-Schiphol", "zone": "North Holland", "country": "Netherlands", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 21, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2605, "captain_hours_type": 1214, "copilot_hours": 1718, "copilot_hours_type": 1334, "aircraft_hours": 6558, "circumstances": "After take off from runway 24, the aircraft followed a VALKO departure as cleared by Air Traffic Control (ATC) . During climb, passing flight level 165 (FL165), the Master Warning was triggered by the right engine oil pressure Central Warning Panel (CWP) light. The Captain slowly retarded the right hand power lever to flight idle and called for the emergency checklist. After completion of the emergency checklist procedure, the right hand engine oil pressure CWP light was still on and the Captain decided to return to Amsterdam . The right hand engine remained in flight idle during the remainder of the flight. While returning to Amsterdam, the flight was radar vectored by ATC for an Instrument Landing System (ILS) approach on runway 06 . After passing approximately 200 feet height, the aircraft became displaced to the right of the runway and a go around was initiated. During the go around, control of the aircraft was lost and, at 12 :46 UTC, the aircraft hit the ground, in a slight nose low attitude with approximately 80° bank to the right, approximately 560 meters right from the runway 06 centerline, just outside the airport. Two passengers and the Captain died in the accident; eight passengers and the First Officer (FO) were seriously injured.", "probable_cause": "Inadequate use of the flight controls during an asymmetric go around resulting in loss of control. \r\nThe following contributing factors were reported:\r\n- Insufficient understanding of the flight crew of the SAAB 340B engine oil system,\r\n- Lack of awareness of the consequences of an aircraft configuration with one engine in flight idle,\r\n- Poor Crew Resource Management."}