{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54g-15-do-skymaster-norman-wells", "date": "Jan 5, 2006 at 1704 LT", "type": "Douglas C-54 Skymaster", "operator": "Buffalo%20Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Norman Wells – Yellowknife", "msn": "36090", "yom": 1946, "flight_number": "BFL1405", "city": "Norman Wells", "zone": "Northwest Territories", "country": "Canada", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Buffalo Airways Limited Douglas C-54G-DC (DC-4), registration C-GXKN, serial number 36090, departed from Norman Wells, Northwest Territories, at 1749 mountain standard time for a visual flight rules flight to Yellowknife, Northwest Territories, with a crew of four and 2000 pounds of cargo. While climbing through an altitude of approximately 3500 feet above sea level, the crew experienced a failure of the number 2 engine and a nacelle fire. The crew carried out the Engine Fire Checklist, which included discharging the fire bottles and feathering the number 2 propeller. The fire continued unabated. During this period, an uncommanded feathering of the number 1 propeller and an uncommanded extension of the main landing gear occurred. The crew planned for an emergency off-field landing, but during the descent to the landing area, the fuel selector was turned off as part of the Engine Securing Checklist, and the fire self-extinguished. A decision was made to return to the Norman Wells Airport where a successful two-engine landing was completed at 1804 mountain standard time. The aircraft sustained substantial fire damage, but there were no injuries to the four crew members on board. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. Airworthiness Directive AD 48-12-01 mandates the replacement of the potentially hazardous fuel line, but the line had not been replaced on this aircraft.\r\n2. A fuel leak from the main fuel inlet line in the engine compartment of this cargo DC-4 caused an in-flight fire that spread into the nacelle and wing. \r\n3. The fuel-fed fire burned for an extended period of time because turning the fuel selector off is not required as part of the primary Engine Fire Checklist. "}