{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-nairobi", "date": "Mar 26, 2021 at 1630 LT", "type": "Beechcraft 200 Super King Air", "operator": "Westwind-Aviation-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nairobi – Kisumu – Eldoret – Nairobi", "msn": "BB-837", "yom": 1981, "flight_number": null, "city": "Nairobi-Wilson", "zone": "Nairobi City District", "country": "Kenya", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6589, "captain_hours_type": 4600, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12177, "circumstances": "The aircraft, registered 5Y-NJS operated by Westwind Aviation Ltd crashed at Ngong Racecourse. The flight with two onboard was on a private mission to Kisumu, Eldoret and back to Nairobi. The aircraft departed Wilson Airport (HKNW) at 0420Z and landed at Kisumu Airport (HKKI) at 0502Z. It then departed HKKI to HKEL at 1142Z and landed at 1200Z where it picked one passenger. The flight then departed HKEL to HKNW with three onboard at 1247Z with an estimated flight time of 40 minutes. According to the preliminary information obtained from the Captain, the aircraft attained flight level 250 42NM from Eldoret VOR. The flight was then cleared to fly direct to GV VOR by Nairobi Area Control Centre. During descend to flight level 100 they encountered bad weather whereby the wings developed heavy icing. The Captain deployed deicing systems on the wings but the problem persisted. The situation prompted the Captain to request Wilson Control to descend to “Monstry fix” for landing at HKNW which was approved. As the flight continued descending the left engine went off. The Captain requested Wilson Tower for assistance. After 30 seconds, the right engine also went off. The Captain elected to make an emergency landing at Ngong Racecourse. On landing along, the left wing collided with trees and broke-off and separated together with the left engine and the left main landing gear. The turned clockwise through 180° and faced the opposite direction. All three onboard escaped unhurt but the aircraft was destroyed.", "probable_cause": null}