{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-matambwe-1-killed", "date": "Jan 5, 2007 at 0902 LT", "type": "Piper PA-31-310 Navajo", "operator": "DJB Air Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dar es Salaam – Matambwe", "msn": "31-627", "yom": 1970, "flight_number": null, "city": "Matambwe", "zone": "Morogoro", "country": "Tanzania", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1700, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was carrying tourists, including the organizer of the trip to Matambwe. These passengers included five adults, a boy of sixteen, three girls of eleven, five and four years. There was also an infant of 11 months. This trip was arranged by a company called Tent with a View Safaris, which owns a camp at Matambwe in the Selous Game Reserve. According to the company, initially two aircraft were organized to transport the passengers to Matambwe. The booking was made through a telephone call to an operator called Wings of Zanzibar, who advised them to go to Terminal I of Julius Nyerere International Airport in Dar es Salaam. However, when the passengers arrived at the Wings of Zanzibar office at the airport, they found it closed. When Wings of Zanzibar was contacted on the telephone, a pilot employed by another company, DJB Ltd, was alerted to meet them. The pilot initially took them to the offices of DJB for payment. He also recommended that one aircraft would suffice for the trip. According to the pilot, he believed that the three children were small enough to sit on their parents’ laps. The passengers had little baggage. The aircraft, a Piper PA31-310 Navajo, took off from Dar es Salaam at 0825 hours and cruised at FL 65. The flight to Matambwe was uneventful and the aircraft was overhead the airstrip at 0902 hours. The pilot over flew the airstrip to alert the camp staff and check for wind and animals, a common procedure for landing in the Game Reserve airstrips. He also made another low run over the runway to ascertain its condition. Eye witnesses and passengers confirmed that the pilot made an overshoot, having flown very low attempting to land. The pilot was not sure of the runway condition because he had not flown into this airfield for a long time. In addition, before embarking on this trip, he had requested information on the runway condition from another pilot who had recently flown into the airstrip. He was told that the runway was usable. Finally, the pilot decided to land. He chose to land on runway 28 with full flaps. He touched down about two hundred and fifty meters beyond the beginning of the usable part of the runway and braked normally. After rolling for some time, he realized that the aircraft would not be able to stop before the end of the remaining length of the runway. With about another two hundred and fifty meters ahead, the pilot initiated a go round believing he had sufficient runway length remaining to gather enough speed for takeoff and climb out. He immediately increased power and initiated the go around. It is at this moment that the aircraft became airborne with no speed increase. The aircraft flew straight and level at full power without gaining height. It subsequently started chopping small tree tops for about two hundred meters beyond the end of the runway and then started to lose height. As it did so, the starboard wing collided with a large tree and the aircraft rotated through 180 degrees before coming to rest. The main wreckage settled below the impact tree and the passengers evacuated immediately. The wreckage caught fire immediately after the last passenger was evacuated. It burned completely, leaving only the tail fin and parts of the engine nacelle. When staff  members from Tent with a View Camp located at Matambwe arrived, the aircraft was burning fiercely. They assisted in moving the occupants to a safer location, far from the burning wreckage and in administering first aid. The aircraft occupants were later treated at a local dispensary before being transported to a hospital in Dar es Salaam. One passenger died in the hospital four hours after the accident. Two passengers were treated for serious injuries. The injuries to the rest of the occupants were minor. ", "probable_cause": "The accident was caused by the aircraft colliding with trees just beyond the end of the runway. The failure to select the correct flap position for the take off, the lack of proficiency training, insufficient flight preparation and lack of real time information on the runway at Matambwe were contributory factors."}