{"url": "https://www.baaa-acro.com/crash/crash-dornier-do328jet-manassas", "date": "Jun 3, 2006 at 0719 LT", "type": "Dornier DO328Jet", "operator": "East%20Coast%20Flight%20Services", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Manassas - Myrtle Beach", "msn": "3105", "yom": 2000, "flight_number": null, "city": "Manassas", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15615, "captain_hours_type": 2523, "copilot_hours": 819, "copilot_hours_type": 141, "aircraft_hours": 2830, "circumstances": "Prior to departure on the maintenance repositioning flight, the captain discussed with the first officer an uneven fuel balance that they could \"fix\" once airborne, and a 25,000 feet msl restriction because of an inoperative air conditioning/pressurization pack. The captain also commented about the right pack \"misbehaving\", and a bleed valve failure warning. The captain also commented about aborting below 80 knots for everything, except for the bleed shutoff valve. During the takeoff roll, a single chime was heard, and the first officer reported a bleed valve fail message. The captain responded, \"ignore it.\" Another chime was heard, and the first officer reported \"lateral mode fail, pusher fail.\" The captain asked about airspeed and was advised of an \"indicated airspeed miscompare.\" The captain initiated the aborted takeoff approximately 13 seconds after the second chime was heard. The crew was unable to stop the airplane, and it went off the end of the runway, and impacted obstructions and terrain. According to the flight data recorder, peak groundspeed was 152 knots and the time the aborted takeoff was initiated, and indicated airspeed was 78.5 knots. The captain and the airplane owner's director of maintenance were aware of several mechanical discrepancies prior to the flight, and the captain had advised the first officer that the flight was for \"routine maintenance,\" but that the airplane was airworthy. Prior to the flight the first officer found \"reddish clay\" in one of the pitot tubes and removed it. A mechanic and the captain examined the pitot tube, and determined the tube was not obstructed. The captain's pitot tube was later found to be partially blocked with an insect nest. A postaccident examination of the airplane and aircraft maintenance log revealed that no discrepancies were entered in the log, and no placards or \"inoperative\" decals were affixed in the cockpit.", "probable_cause": "The partially blocked pitot system, which resulted in an inaccurate airspeed indicator display, and an overrun during an aborted takeoff. A factor associated with the accident was the pilot-in-command's delayed decision to abort the takeoff."}