{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-104b-moscow-59-killed", "date": "Mar 17, 1979 at 1948 LT", "type": "Tupolev TU-104", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Odessa", "msn": "9 2 10 01", "yom": 1959, "flight_number": "SU1691", "city": "Moscow-Vnukovo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 1, "pax_on_board": 114, "pax_fatalities": 58, "other_fatalities": 0, "total_fatalities": 59, "captain_hours": null, "captain_hours_type": 32, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 24356, "circumstances": "Five seconds after takeoff from runway 01 at Moscow-Vnukovo Airport, while in initial climb, a fire alarm activated in the cockpit panel, informing the crew about a fire in the left engine. The crew declared an emergency, continued to climb and was cleared to return. Following several turns, the crew started an approach to runway 01 by night and marginal weather conditions. On final, the airplane descended below the MDA until it struck the ground at a speed of 350 km/h and crashed in flames in a snow covered field located along a wooded area, 1,548 meters short of runway 01. 58 passengers and a stewardess were killed while 61 other occupants were injured. The aircraft was destroyed. ", "probable_cause": "It was determined that the fire alarm that activated in the cockpit was false and not related to an engine fire. Analysis revealed that the temperature of the left engine compartment increased to 253° C due to the disconnection of a pipe coupled to the anti-icing system. The accident was the consequence of the combination of several wrong decisions on part of the flying crew and the following factors: \r\n- The approach was completed by night and icing conditions in a single engine configuration,\r\n- The total weight of the aircraft was 10,201 kg above the maximum weight allowed for landing, \r\n- The approach was completed with a tailwind component, \r\n- Excessive approach speed, \r\n- Premature descent resulting in a collision with ground after passing MDA, \r\n- Lack of crew interaction and coordination,\r\n- The navigator failed to inform the captain about the decision height fixed at 120 meters, \r\n- The approach was completed with the GPWS deactivated, \r\n- The copilot failed to monitor the instruments properly, which contributed to the deviation of the airplane to the right during the last sequence until it lost altitude and impacted the ground. "}