{"url": "https://www.baaa-acro.com/crash/crash-antonov-26b-tallinn", "date": "Mar 18, 2010 at 1018 LT", "type": "Antonov AN-26", "operator": "Exin", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Helsinki – Tallinn", "msn": "105 03", "yom": 1980, "flight_number": "EXN3589", "city": "Tallinn-Lennart Meri-Ülemiste", "zone": "Harjumaa", "country": "Estonia", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4695, "captain_hours_type": 2295, "copilot_hours": 990, "copilot_hours_type": 495, "aircraft_hours": 25941, "circumstances": "Exin Co was operating An-26B for regular cargo flight between Tallinn and Helsinki. The crew performed last maintenance check in Tallinn on previous day and made uneventful flight to Helsinki on 17th March afternoon. Next morning the aircraft took off from Helsinki for regular flight EXN3589 to Tallinn at 09:46 local time. The takeoff weight was 23,954 kg, 46 kg below the MTOW. Four crewmembers, company mechanic and one cargo attendant were on board. During takeoff crew used RU 19-300 APU for additional thrust as prescribed in AFM. The RU 19-300 was shot down after takeoff. The flight was uneventful until 08:14:50, 9.5 nm from the runway 26. When power levers were retarded to flight idle crew noticed engine vibration and smelled a smoke in the cockpit. The engine chip detector indicator in the cockpit was lit. After short discussion about which engine should be shot down the flight engineer shot down the left engine and the captain tried to start the RU19A-300 (APU) to gain more thrust. During the approach the air traffic controller noticed the aircraft deviation from the approach path to the left and notified the crew. According to the FDR and CVR data the crew was unable to maintain a proper approach path both in lateral and vertical dimensions. The attempts to start RU19A-300 engine failed. Visual contact with the RWY was established 0.5 nm from the threshold. The aircraft crossed the airport boundary being not configured for landing and with IAS 295-300 km/h. The flaps were extended for 10˚ over the threshold; the landing gear was lowered after passing the RWY threshold and retracted again. The aircraft made a high speed low path over the runway on ca 10-15 feet altitude with the landing gear traveling down and up again. Flaps were extended over runway, and then retracted again seconds before impact. At the end of the RWY the full power on right engine was selected, aircraft climbed 15-20 feet and started turning left. Crew started retracting flaps and lowered landing gear. Aircraft crossed the highway at the end of the RWY on altitude ca 30 feet, then descended again, collided with the treetops at the lake shore and made crash-landing on the snow and ice-covered lake waterline. Due to the thick ice the aircraft remained on the ice and glided 151 m on the ice with heading 238˚ before coming to full stop. After the impact the flight engineer shoot down the RH engine and power and released all engine fire extinguishers. All persons onboard escaped immediately through the main door. No emergency was declares and despite suggestions from FO go-around was not commanded.", "probable_cause": "Causes of the accident:\r\n1. The failure of the left engine lubrication oil system, leading to the failure of the rear compressor bearing and inflight engine failure.\r\n2. The failure of the crew to maintain the approach path and adhere to single engine landing procedures.\r\nFactors contributing to the accident:\r\n1. Improper and insufficient crew training, inter alia complete absence of simulator training.\r\n2. The lack of effective coordination between crewmembers.\r\n3. The failure of the crew to start RU19A-300 (APU).\r\n4. Adverse weather conditions.\r\n5. Inadequate company supervision by Polish CAA, consisting in not noticing the lack.\r\nof flight crew training and companies generally pour safety culture.\r\n6. Inadequate company maintenance practices, leaving preexisting breather duct failure unnoticed."}