{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-derby-2-killed", "date": "Oct 18, 2013 at 1017 LT", "type": "Cessna 500 Citation", "operator": "Ed-Dufresne", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Wichita - New Braunfels", "msn": "500-0241", "yom": 1975, "flight_number": null, "city": "Derby", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2605, "captain_hours_type": 1172, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7560, "circumstances": "After climbing to and leveling at 15,000 feet, the airplane departed controlled flight, descended rapidly in a nose-down vertical dive, and impacted terrain; an explosion and postaccident fire occurred. Evidence at the accident site revealed that most of the wreckage was located in or near a single impact crater; however, the outer portion of the left wing impacted the ground about 1/2 mile from the main wreckage. Following the previous flight, the pilot reported to a maintenance person in another state that he had several malfunctioning flight instruments, including the autopilot, the horizontal situation indicator, and the artificial horizon gyros. The pilot, who was not a mechanic, had maintenance personnel replace the right side artificial horizon gyro but did not have any other maintenance performed at that time. The pilot was approved under an FAA exemption to operate the airplane as a single pilot; however, the exemption required that all equipment must be operational, including a fully functioning autopilot, flight director, and gyroscopic flight instruments. Despite the malfunctioning instruments, the pilot chose to take off and fly in instrument meteorological conditions. At the time of the loss of control, the airplane had just entered an area with supercooled large water droplets and severe icing, which would have affected the airplane's flying characteristics. At the same time, the air traffic controller provided the pilot with a radio frequency change, a change in assigned altitude, and a slight routing change. It is likely that these instructions increased the pilot's workload as the airplane began to rapidly accumulate structural icing. Because of the malfunctioning instruments, it is likely that the pilot became disoriented while attempting to maneuver and maintain control of the airplane as the ice accumulated, which led to a loss of control.", "probable_cause": "The airplane's encounter with severe icing conditions, which resulted in structural icing, and the pilot's increased workload and subsequent disorientation while maneuvering in instrument flight rules (IFR) conditions with malfunctioning flight instruments, which led to the subsequent loss of airplane control. Contributing to the accident was the pilot's decision to takeoff in IFR conditions and fly a single-pilot operation without a functioning autopilot and with malfunctioning flight instruments."}