{"url": "https://www.baaa-acro.com/crash/crash-vickers-813-viscount-uttoxeter-1-killed", "date": "Feb 25, 1994 at 1946 LT", "type": "Vickers Viscount", "operator": "British%20World%20Airlines", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Edinburgh - Coventry", "msn": "349", "yom": 1958, "flight_number": "BWL4272", "city": "Uttoxeter", "zone": "Staffordshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5121, "captain_hours_type": 1121, "copilot_hours": 3334, "copilot_hours_type": 2181, "aircraft_hours": 50995, "circumstances": "While on a cargo from Edinburgh to Coventry, cruising at FL150, the crew encountered severe icing conditions when engines n°2 and 3 failed. The crew was cleared to initiate an emergency descent to FL070 and FL050 and elected to divert to Birmingham Airport. Shortly later, he was able to restart the engine n°2 when the engine n°4 failed as well. The aircraft entered an uncontrolled descent and crashed in a wooded area located in Uttoxeter, about 45 km north of Birmingham Airport. The copilot was seriously injured and the captain was killed. ", "probable_cause": "The following causal factors were identified:\r\n- Multiple engine failures occurred as a result of flight in extreme icing conditions,\r\n- Incomplete performance of the emergency drills by the crew, as a result of not referring to the Emergency Checklist, prejudiced the chances of successful engine re-starts,\r\n- Crew actions for securing and re-starting the failed engines, which were not in accordance with the operator's procedures, limited the power available. The drag from two unfeathered propellers of the failed engines and the weight of the heavily iced airframe resulted in a loss of height and control before the chosen diversion airfield could be reached,¨\r\n- Poor Crew Resource Management reduced the potential for emergency planning, decision making and workload sharing. Consequently, the crew had no contingency plan for the avoidance of the forecast severe icing conditions, and also was unaware of the relative position of a closer diversion airfield which could have been chosen by making more effective use of air traffic services."}