{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-1245-burlington-1-killed", "date": "Jan 16, 2013 at 0556 LT", "type": "Pilatus PC-12", "operator": "LabCorp", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Burlington - Morristown", "msn": "265", "yom": 1998, "flight_number": "SKQ53", "city": "Burlington-Alamance", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6369, "captain_hours_type": 315, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4637, "circumstances": "The pilot departed in night instrument flight rules (IFR) conditions on a medical specimen transport flight. During the climb, an air traffic controller told the pilot that the transponder code he had selected (2501) was incorrect and instructed him to reset the transponder to a different code (2531). Shortly thereafter, the airplane reached a maximum altitude of about 3,300 ft and then entered a descending right turn. The airplane’s enhanced ground proximity warning system recorded a descent rate of 11,245 ft per minute, which triggered two “sink rate, pull up” warnings. The airplane subsequently climbed from an altitude of about 1,400 ft to about 2,000 ft before it entered another turning descent and impacted the ground about 5 miles northeast of the departure airport. The airplane was fragmented and strewn along a debris path that measured about 800-ft long and 300-ft wide. Postaccident examination of the airplane did not reveal any preimpact mechanical malfunctions that would have precluded the pilot from controlling the airplane. The engine did not display any evidence of preimpact anomalies that would have precluded normal operation. An open resistor was found in the flight computer that controlled the autopilot. It could not be determined if the open resistor condition existed during the flight or occurred during the impact. If the resistor was in an open condition at the time of autopilot engagement, the autopilot would appear to engage with a mode annunciation indicating engagement, but the pitch and roll servos would not engage. The before taxiing checklist included checks of the autopilot system to verify autopilot function before takeoff. It could not be determined if the pilot performed the autopilot check before the accident flight or if the autopilot was engaged at the time of the accident. The circumstances of the accident are consistent with the known effects of spatial disorientation. Dark night IFR conditions prevailed, and the track of the airplane suggests a loss of attitude awareness. Although the pilot was experienced in night instrument conditions, it is possible that an attempt to reset the transponder served as an operational distraction that contributed to a breakdown in his instrument scan. Similarly, if the autopilot’s resistor was in an open condition and the autopilot had been engaged, the pilot’s failure to detect an autopilot malfunction in a timely manner could have contributed to spatial disorientation and the resultant loss of control.", "probable_cause": "The pilot's failure to maintain airplane control due to spatial disorientation during the initial climb after takeoff in night instrument flight rules conditions.\n"}