{"url": "https://www.baaa-acro.com/crash/crash-vfw-fokker-614-bremen-1-killed", "date": "Feb 1, 1972 at 1458 LT", "type": "VFW-Fokker 614", "operator": "VFW", "flight_phase": "Flight", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bremen - Bremen", "msn": "MG.01", "yom": 1971, "flight_number": null, "city": "Bremen-Neuenland", "zone": "Bremen", "country": "Germany", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 30, "circumstances": "The 614 had been designed with servo-tab elevators, control and trim tabs on the rudder, and spring and trim tabs on the ailerons. The result of this was a very complex mathematical model of vibration characteristics, which was not complete by the time of the first flight. This was accordingly limited to a maximum indicated airspeed of 140kt and an altitude of 3,000ft, Flight tests were pushed out towards the edges of the envelope: 330 kt IAS, Mach 0-74 diving speed; 285 kt IAS, Mach 0-65 V M O . Real-time data monitoring and transmission was used to assist in observing the flights. Flying went ahead cautiously in the second half of 1971, because ground-resonance testing of the 614 was not showing full correlation with prediction. As the envelope was extended small explosive charges—\"bonkers\"—were used to stimulate flutter conditions. The most serious flutter problem centred on the elevators. At 260 kt IAS and 10,000ft and above, the firing of asymmetric bonkers on the elevator caused a 3sec flutter phase. This was stopped either by a reduction in speed or a permanent distortion of the tailplane structure. Apart from the restriction caused by the flutter problem, the first 614 cleared the flight envelope to 260 kt IAS and 25,000ft, for lateral, directional and longitudinal stability. The accident to the first aircraft occurred after it had been fitted with flutter dampers. The effect of these was to re-introduce the asymmetric flutter at 220 kt and 10,000ft on a check flight. This time the flutter could not be eliminated by slowing down and the crew abandoned the aircraft. The aircraft dove into the ground and crashed in a field near Bremen-Neuenland Airport. Two occupants were rescued while the copilot Hans Bardill was killed when his parachute failed to open.\r\nSource: Flight International", "probable_cause": "The accident was caused by nutter of elevator servo tabs. "}