{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-near-sundar-nagar-11-killed", "date": "Jul 9, 1994 at 0905 LT", "type": "Beechcraft 200 Super King Air", "operator": "Government%20of%20Punjab", "flight_phase": "Flight", "flight_type": "Government", "survivors": "No", "site": "Mountains", "schedule": "Chandigarh – Kulu-Bhuntar", "msn": "BB-1456", "yom": 1993, "flight_number": null, "city": "Sundar Nagar", "zone": "Himachal Pradesh", "country": "India", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 7503, "captain_hours_type": 113, "copilot_hours": 6412, "copilot_hours_type": 46, "aircraft_hours": 153, "circumstances": "The twin engine aircraft departed Chandigarh Airport at 0850LT on a flight to Kulu-Bhuntar, carrying eight passengers and three crew members, among them Surendra Nath, Governor of Punjab and Himachal Pradesh along with his family members. While in cruising altitude, the crew encountered limited visibility due to cumulus when the aircraft struck trees and rocks and crashed on the slope of a mountain located in the Kamrunag Mountain Range, about 18,5 km southeast of Sundar Nagar, some 50 km south of Kulu-Bhuntar Airport. The aircraft was destroyed and all 11 occupants were killed. ", "probable_cause": "The accident was caused due to serious errors on the part of the flight crew by not strictly adhering to the VFR conditions for flight to Bhuntar Airfield. As a result, the aircraft after encountering cumulus clouds enroute, deviated from the pre-determined route and collided with the hilltop covered with clouds.\r\nThe contributed factors to the accident were:\r\n- Existence of bad weather enroute with cumulus clouds in layers covering the hill tops;\r\n- Pilots not conversant with the topography of the mountains in the region;\r\n- Failure on the part of the flight crew not to refer and follow the maps of the region;\r\n- Mental pressure on the pilot-in-command to complete the flight in time with a view to meet the subsequent flight commitments;\r\n- Failure on the part of the copilot to bring out flight deviations to the notice of the commander,\r\n- Disregard of procedures, regulations and instructions on part of the pilot, \r\n- Operational decision. "}