{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-1-near-mccomb-6-killed", "date": "Oct 20, 1977 at 1852 LT", "type": "Convair CV-240", "operator": "L & J Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Greenville - Baton Rouge", "msn": "3", "yom": 1948, "flight_number": null, "city": "McComb", "zone": "Mississippi", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 24, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 6802, "captain_hours_type": 68, "copilot_hours": 2362, "copilot_hours_type": 38, "aircraft_hours": 29013, "circumstances": "The airplane was completing a charter flight from Greenville, South Carolina, to Baton Rouge, Louisiana, carrying members of the Lynyrd Skynyrd Band. At 04:30 CDT on October 18, N55VM had arrived at the Greenville Downtown Airport, South Carolina, from Lakeland, Florida. While on the ground at Greenville, the aircraft had been refueled with 400 gallons of 100-octane, low-lead fuel. On October 20 at 16:02 CDT, the flight had departed Greenville Downtown Airport for Baton Rouge, Louisiana. The pilot had filed an IFR flight plan with the Greenville Flight Service Station. The route of flight was to be Victor 20 Electric City, direct Atlanta, direct La Grange, direct Hattiesburg Victor 222 McComb, V194 and to Baton Rouge. The pilot requested an altitude of 12,000 ft and stated that his time en route would be 2 hours 45 minutes and that the aircraft had 5 hours of fuel on board. The pilot was also given a weather briefing. After reaching 12,000 ft, N55VM proceeded according to flight plan and at 18:39 was cleared to descend to and maintain 6,000 ft. This clearance was acknowledged. At 18:40 the flight told Houston Air Route Traffic Control Center (ARTCC), \"We're out of one two thousand for six thousand.\" About 18:42 N55VM advised Houston Center, \"Yes, sir, we need to get to a airport, the closest airport you've got, sir.\" Houston Center responded by asking the crew if they were in an emergency status. The reply was, \"Yes, sir, we're low on fuel and we're just about out of it, we want vectors to McComb, post haste please, sir.\" Houston Center gave the flight vectors to McComb and advised it to turn to a heading of 025°. N55VM did not confirm that a turn was initiated until 18:44. At 18:44:34, the pilot of N55VM said, \"We are not declaring an emergency, but we do need to get close to McComb as straight and good as we can get, sir.\" At 18:45:12 N55VM advised Houston, \"Center, five victor Mike we're out of fuel.\" The center replied, \"Roger, understand you're out of fuel?\" N55VM replied, \"I am sorry, it's just an indication of it.\" The crew did not explain what that indication was. At 18:45:47 Houston Center requested N55VM's altitude. The response was, \"We're at four point five.\" This was the last recorded communication between N55VM and the ARTCC. Several attempts were made by Houston Center to contact the flight but there was no response. At 18:55:51 an aircraft reported picking up a weak transmission from an emergency locator transmitter (ELT). The aircraft had crashed in heavily wooded terrain, during twilight hours, at an elevation of 310 ft near the town of Gillsburg, Mississippi. Both pilots, band members Ronnie Van Zant, Steve Gaines, Cassie Gaines, and the band's manager Dean Kilpatrick were killed in the accident. The aircraft was destroyed. ", "probable_cause": "Fuel exhaustion and a total loss of power on both engines due to crew inattention of fuel supply. Contributing to the fuel exhaustion were inadequate flight planning and an engine malfunction of undetermined nature in the right engine which resulted in a higher than normal fuel consumption. The following findings were reported:\r\n- Both engines ceased to produce power because the aircraft's usable fuel supply was exhausted,\r\n- The crew failed to monitor adequately the fuel flow, en route fuel consumption, and fuel quantity gages,\r\n- The crew failed to take appropriate preflight and maintenance action to assure an adequate fuel supply for the flight, \r\n- The crew operated the aircraft for an indeterminate amount of time before the accident with the right engine's mixture control in the auto-rich position."}