{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-temple-3-killed", "date": "Jan 17, 2002 at 1522 LT", "type": "Cessna 340", "operator": "Harold S. Bercu", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "City", "schedule": "League City – Killeen", "msn": "340A-0712", "yom": 1979, "flight_number": null, "city": "Temple-Draughon-Miller Central Texas", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3464, "captain_hours_type": 10, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5877, "circumstances": "While on an IFR clearance, the pilot reported to approach control that he was unable to maintain 4,000 feet msl, and did not give a reason. Shortly thereafter, the pilot contacted approach control and stated that he had \"fuel starvation\" in the right engine and the left engine had just quit. Radar data depicted the aircraft at an altitude of 3,400 feet. The controller asked the pilot if they were completely without power, and the pilot responded, \"yes, we're now gliding.\" The controller gave the pilot instructions to the nearest airport, which was approximately 4.5 nautical miles away. After passing 2,100 feet, the pilot informed the controller that he would be landing short. During the forced landing, the airplane struck the top of a tree, crossed over a house, struck another tree, struck a telephone wire which crossed diagonally over a street, and then cleared a set of wires which paralleled the street. The airplane then impacted a private residence within a residential area, and a fire erupted damaging the airplane and the private residence. Ten gallons of fuel were drained from the left locker tank, which supplements the left main fuel tank. Examination of the airframe and engines did not disclose any structural or mechanical anomalies that would have prevented normal operation. Examination of the propeller revealed that neither propeller had been\r\nfeathered.", "probable_cause": "The pilot's mismanagement of fuel, which resulted in a total loss of engine power due to fuel starvation. Contributing factors were the pilot's failure to follow the checklist to feather the propellers in order to reduce drag."}