{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-panther-ii-zurich-1-killed", "date": "May 26, 2000 at 2023 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Lemanair", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Zurich - Geneva", "msn": "31-7952003", "yom": 1979, "flight_number": "HBLTC", "city": "Zurich-Kloten", "zone": "Zurich", "country": "Switzerland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1119, "captain_hours_type": 9, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8387, "circumstances": "On 25 and 26 May 2000 aircraft HB-LTC was used for a commercial flight from Zurich to Béziers (F) and back. To this end, the pilot made a positioning flight from Geneva to Zurich on 24 May 2000. The reconstruction of the following events is based on recorded radio conversations and witness statements. On 25 May 2000 at approx. 07:20 hrs, the pilot placed a telephone order with the refuelling service of Jet Aviation Zurich AG. According to statements from aircraft refuelling attendant A concerned, the pilot asked for the aircraft to be fully refuelled with aviation gasoline (AVGAS) for a flight to France. When aircraft refuelling attendant A arrived at the aircraft, the pilot was present. The refuelling attendant saw the winglets  on the HB-LTC and asked the pilot whether the machine had been modified and therefore needed jet kerosene. Before the pilot could even answer, the refuelling attendant realised, from the square engine housings, that the machine was equipped with reciprocating engines. The pilot confirmed that HB-LTC had been modified but pointed out that this modification involved only the airframe and that the aircraft had not been converted to turboprop operation. Refuelling attendant A then filled the HB-LTC’s four fuel tanks with 372 l of AVGAS 100LL (low lead). The aircraft was therefore fully refuelled and at that time had 726 l of fuel. Refuelling attendant A later reported that he had not noticed markings which described the types of fuel permitted for this aircraft, either on the wing or on the tank seals. During the refuelling operation, which ended at approx. 07:30 hrs, the pilot was in the cockpit. Nobody observed him draining the tanks after refuelling. The seven passengers for the flight to Béziers (F) arrived on 25 May 2000 at about eight o’clock in the morning at the General Aviation Centre (GAC) at Zurich airport. At 08:18:42 hrs the pilot received start-up clearance from Zurich Apron (ZRH APR) and at 08:26:25 hrs indicated that he was ready to taxi. Taxi clearance was granted without delay and the aircraft taxied to the holding point of runway 28. Several passengers later stated that the pilot carried out a run up of the engines while the following time of waiting. At 08:32:01 hrs HB-LTC indicated to aerodrome control (Zurich Tower – ZRH TWR) that it was ready to take off. The aircraft was queued in the traffic and was cleared for take-off at 08:45:27 hrs. The aircraft landed in Béziers (F) some two hours later. On 26 May 2000 between 15:35 and 15:45 hrs HB-LTC was refuelled in Béziers with 107 l of AVGAS 100LL. The aircraft then flew with the same passengers from Béziers (F) back to Zurich, where it landed at 19:10 hrs. Before the flight back to Geneva, the pilot obviously decided to refuel. According to the statements of aircraft refuelling attendant B at approx. 19:45 hrs the pilot ordered “Kraftstoff JET-A1” by telephone. Unlike the telephone conversations of air traffic control at Zurich airport, incoming and outgoing telephone calls made to and from the refuelling service of Jet Aviation Zurich AG were not recorded. The precise wording of the pilot’s fuel order cannot therefore be established with certainty. Aircraft refuelling attendant B then forwarded the order by radio to his colleague, aircraft refuelling attendant C. A third aircraft refuelling attendant D heard on his radio how aircraft refuelling attendant B gave the instruction to aircraft refuelling attendant C to refuel aircraft HB-LTC with JET A-1 fuel. Then aircraft refuelling attendant C drove tanker FL 7 to HB-LTC, which was parked in GAC Sector 1. According to his statements, he positioned the tanker with its right-hand side in front of the aircraft so that he could reach the filler caps on both wings using the hose affixed to that side of the tanker. Then aircraft refuelling attendant C, still next to the tanker, began to complete the delivery note, while the pilot came up to him and indicated the desired quantity of fuel in English. The pilot gave him a credit card and aircraft refuelling attendant C then explained to him that after refuelling he would have to complete the transaction in the office. The pilot remarked that he had a slot. Aircraft refuelling attendant C later stated that this gave him to understand that the pilot did not have much time. The aircraft refuelling attendant replied to the pilot that he would only need an additional two or three minutes. Because it had started to rain shortly before refuelling, the pilot evidently withdrew into the aircraft after his conversation with aircraft refuelling attendant C. According to his partner, the pilot conducted a brief conversation with her from his mobile telephone during this phase. As the investigation showed, this telephone call took place between 19:50:06 and 19:51:28 hrs. In the meantime, aircraft refuelling attendant C had connected HB-LTC to the tanker and then pumped 50 l of JET A-1 fuel into each of the two inboard main cells. The aircraft refuelling attendant later stated that he had not noticed markings or labels which described the permitted types of fuel for this aircraft, either on the tank seals or in the vicinity of the tank openings. He then drove the tanker to the office, debited the credit card and returned it with the receipt and the delivery note to the aircraft. He presented the debit slip and the delivery note to the pilot for signature. In the process the aircraft refuelling attendant asked the pilot what aircraft type HB-LTC was. The pilot answered that his aircraft was a modified PA31. The aircraft refuelling attendant then entered “PA31” on the delivery note and then gave the pilot the carbon copy. At 20:08:44 hrs the pilot made radio contact with Zurich Clearance Delivery (ZRH CLD) air traffic control and received departure clearance with the instruction to change to the ZRH APR frequency for start-up clearance. The apron gave HB-LTC start-up clearance at 20:10:00 hrs. Three minutes and 50 seconds later the pilot requested taxi clearance and was then instructed to taxi to the holding point of runway 28. After the transfer to ZRH TWR at 20:15:02 hrs the pilot stated he was ready for take off at 20:17:30 hrs. A short time after this he was able to line up runway 28 and at 20:20:58 hrs ZRH TWR gave him take-off clearance. According to witness statements, HB-LTC took off normally and went into a climb. In the region of runway intersection 28/16 and at an altitude of approx. 50 m AGL the aircraft stopped climbing, maintained level flight briefly and began to descend slightly. At the same time, HB-LTC began to make a gentle right turn and overflew the woods to the north of runway 28. Because of this unusual flight pattern, the duty aerodrome controller (ADC) at 20:22:08 hrs asked the pilot whether everything was normal: “Tango Charlie, normal operations?” The pilot replied in the negative: “(Ne)gative, Hotel Tango Charlie!” In this phase, the aircraft began to make a left turn with a high bank angle and witnesses observed that the landing gear was lowered. At 20:22:21 hrs the pilot radioed that he was in an emergency situation: “Mayday, Mayday, Mayday, Hotel Tango Charlie”. During the first 90° of the turn, HB-LTC descended only slightly. After crossing the extended centerline of runway 28 the aircraft increasingly lost height in the tight left turn. When the aircraft had almost completed the full turn, its bank attitude began to reduce. At a height of approx. 10 m AGL HB-LTC collided with the trees in a copse. The aircraft passed through the copse and came to rest upside down in the “Glatt” river. The pilot was fatally injured on impact. Coordinates of the final position of the wreck: 682 700/256 700, elevation 420 m AMSL corresponding to 1378 ft AMSL.", "probable_cause": "The investigation established the following causal factors for the accident:\r\n• A misunderstanding occurred when the fuel was ordered.\r\n• The refuelling attendant concerned did not notice the fuel grade rating placards attached to the aircraft.\r\n• The refuelling attendant concerned did not realise that the aircraft was equipped with reciprocating engines.\r\n• The pilot did not notice the fuel grade rating placards on the tanker vehicle.\r\n• The pilot did not realise the incorrect refuelling on the receipt for the fuel provision.\r\nThe following factors allowed or favoured the occurrence of the accident:\r\n• The delivery nozzle on the filler gun was of an outside diameter which allowed the aircraft involved in the accident to be refuelled.\r\n• The level of training and knowledge of the refuelling personnel concerned was inadequate.\r\n• The Federal Office for Civil Aviation never inspected the refuelling operation before the accident.\r\n• Until the time of the accident, the Federal Office for Civil Aviation had issued no regulations on the training of refuelling personnel, the size of delivery nozzles and tank openings on aircraft or on the identification of filler guns and tank openings.\r\nThe following points may have exacerbated the outcome of the accident:\r\n• The pilot decided on an about turn which brought him onto a collision course with obstacles.\r\n• The retention mechanism of the safety belt was not working. "}