{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-near-veydelev", "date": "Jul 12, 2001", "type": "PZL-Mielec AN-2", "operator": "Belgavia-PANKh", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "Yes", "site": "Plain, Valley", "schedule": null, "msn": "1G231-28", "yom": 1988, "flight_number": null, "city": "Veydelev", "zone": "Belgorod oblast", "country": "Russia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2153, "circumstances": "The aircraft was dispatched in the region of Veydelev to perform a crop spraying mission. On board were three pilots, one copilot seating in the jumpseat, one instructor seating in the right seat and one pilot seating in the left seat. After a first pass over the area to be treated at a speed of 140 km/h and at an altitude of 130 metres, the crew initiated a right turn during which the aircraft banked right to an angle of 90°, descended to 60-70 metres and lost speed to 130 km/h while at this stage, its speed should be 155-160 km/h. As the crew was facing a hill, he decided to increase power to gain height but the aircraft struck the ground in a landing configuration. The crew reduced the engine power and started to brake when, at a speed of 50-60 km/h, the aircraft struck trees and came to rest in a wooded area. All three occupants were injured and the aircraft was damaged beyond repair. ", "probable_cause": "The accident was the consequence of a crew error in the piloting technique when flying in difficult terrain conditions, which manifested itself in a loss of speed and flight altitude, which led to an unintentional landing of the aircraft and its collision with ground obstacles. The error in the piloting technique became possible due to the unstable piloting skills of the pilot-in-command and the failure of the instructor to fulfill his duties. It was reported that the pilot-in-command did not fly for about five years. "}