{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-300-super-king-air-cullman-2-killed", "date": "Jan 14, 1999 at 0918 LT", "type": "Beechcraft 300 Super King Air", "operator": "USA Healthcare Leasing", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Greenville - Cullman", "msn": "FA-70", "yom": 1985, "flight_number": null, "city": "Cullman", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4100, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7687, "circumstances": "The airplane descended to 2,600 feet to the NDB, and initiated the approach upon crossing the NDB. As the airplane descended below 1,500 feet MSL, Huntsville lost radar contact. The next communication with the airplane was when the pilot radioed that he was initiating the missed approach. The published missed approach procedure is, 'Climbing lift turn to 2,700 direct CPP NDB and hold.' The airplane made a series of turns within the next one minute and 24 seconds. Additionally, the airplane's altitude varied but it never climbed above the altitude of 1,700 feet. The airplane wreckage was located approximately 3.5 miles north of the airport on a 345 degree heading on the opposite side of the outbound course to the NDB. Witnesses in the immediate area stated that they could hear the airplane flying low over their homes but could not see it due to the foggy conditions. A review of pilot records did not show the pilot having any fixed wing airplane experience. ", "probable_cause": "The pilot's failure to adhere to the missed approach procedure resulting in a collision with terrain. Contributing factors were fog and the rotorcraft rated pilot's lack of fixed wing certification/experience. "}