{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-580-miami", "date": "Dec 6, 2001 at 2258 LT", "type": "Convair CV-580", "operator": "Trans%20Air%20Link", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Nassau – Fort Lauderdale – Miami-Opa Locka", "msn": "46", "yom": 1953, "flight_number": null, "city": "Miami", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12765, "captain_hours_type": 1940, "copilot_hours": 2569, "copilot_hours_type": 271, "aircraft_hours": 75103, "circumstances": "The airline completed weight and balance and dispatch release forms for the initial flight showed an incorrect fuel load at the time the engines were started. The first officer performed a walk-around before the first flight leg which included checking the fuel tanks. A total of 460 gallons of fuel were added to the fuel tanks, and a delay loading cargo occurred. After both engines were started to begin the first flight, the engines remained operated for between 9-10 minutes before they were secured due to a radio problem. Maintenance personnel reracked the VHF radios, and again the engines were started where the airplane remained on the ramp 3-4 minutes before taxiing to the runway. The airplane remained at the runway hold short area for between 20 and 25 minutes before returning to the ramp due to a radio problem. The engines were secured, and a new VHF radio was purchased and installed. The company did not prepare new dispatch release, or weight and balance forms for the flight taking into account the additional fuel consumed with the engines operating. The engines were started, and the airplane was taxied to the runway and departed for the planned first leg. The airplane landed uneventfully at the destination airport where the cargo was offloaded. The first officer performed a walk-around which included checking the fuel tanks; 300 gallons of fuel were added to the fuel tanks (150 gallons in each side). The flight departed to return and when near the coastline, the flight was vectored to an airport other than the planned destination due to a issue with U.S. Customs. The flight landed uneventfully, and experienced a delay clearing customs. While on the ground before departure on the accident flight, the first officer reportedly performed a walk-around which included checking the fuel tanks with the captain looking on. The first officer reported that each fuel tank had approximately 1,100 pounds of fuel, and he and the captain both agreed before takeoff as to the quantity of fuel on-board as indicated by the magna-sticks. No fuel was purchased. Following starting of both engines for the accident flight, the first officer checked the fuel quantity gauges indications against the magna-sticks indications he observed; the fuel quantity gauges indicated approximately 200 pounds more. The flight departed, proceeded eastbound, and climbed to approximately 2,100 feet msl. During a right turn from a southeast to westerly heading, the right engine experienced a loss of horsepower which decreased from 900 to zero. The right engine was secured as a precaution, and priority handling to the destination airport was requested with air traffic control. The left engine horsepower remained the same (900) for a period of 31 seconds following the right engine horsepower decrease, then increased to 2,200, and remained at that value for 1 minute 13 seconds. The left engine horsepower then began to decrease and dropped to zero. The airplane was turned to the east, then turned to the south and ditched. The captain and first officer evacuated but remained with the airplane, and made it to shore where the first officer advised his wife that something was wrong with the fuel gauges. Following recovery of the airplane, pressure testing of the left fuel tank revealed no evidence of preimpact leakage. Pressure testing of the right fuel tank revealed slight leakage past the fuel cap. Boroscope examination of the engines, and functional test of each engine ignition system, fuel control units and fuel pumps revealed no evidence of preimpact failure or malfunction. Examination of the installed magna-sticks revealed no evidence of preimpact failure. The left fuel tank was drained and found to contain 2 gallons of Jet A fuel, while the right fuel tank was drained and found to contain approximately 540 gallons of salt water and 1/2 gallon of Jet A fuel. Fuel consumption calculations performed by FAA personnel revealed that at the time of engine start for the accident flight, the fuel tanks contained approximately 714 pounds of fuel. According to a representative of the engine manufacturer, the amount of fuel drained from the engine components post accident was consistent with, \"low residual fuel.\"", "probable_cause": "The inadequate dispatch of the airplane by company personnel prior to the first leg of the flight due to failure of company personnel to prepare a new flight release and weight and balance after considerable time on the ground with the engines operating. Also causal, was the inadequate preflight of the airplane by the captain by which he failed to note the low level of fuel in the fuel tanks before departure resulting in total loss of engine power of both engines due to fuel exhaustion and subsequent ditching of the airplane. A finding in the accident was the inaccurate fuel quantity gauges."}