{"url": "https://www.baaa-acro.com/crash/crash-aerospatiale-bac-concorde-gonesse-113-killed", "date": "Jul 25, 2000 at 1644 LT", "type": "Aérospatiale-BAC Concorde", "operator": "Air-France-31", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "City", "schedule": "Paris – New York", "msn": "203", "yom": 1975, "flight_number": "AF4590", "city": "Gonesse", "zone": "Val-d'Oise", "country": "France", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 100, "pax_fatalities": 100, "other_fatalities": 4, "total_fatalities": 113, "captain_hours": 13477, "captain_hours_type": 317, "copilot_hours": 10035, "copilot_hours_type": 2698, "aircraft_hours": 11989, "circumstances": "On Tuesday 25 July 2000 the Concorde registered F-BTSC, operated by Air France, took off from Paris Charles de Gaulle to undertake charter flight AF4590 to New York with nine crew members (3 FC, 6 CC) and 100 passengers on board. The Captain was Pilot Flying (PF), the First Officer was Pilot Not Flying (PNF). The total weights of the aircraft and of the fuel on board stated by the Flight Engineer (FE) at the time the aircraft started out were 186.9 t and 95 t respectively. The speeds selected by the crew were V1: 150 kt, VR: 198 kt, V2: 220 kt. At 13 h 58 min 27 s, the crew contacted ATC on the Flight data frequency and requested the whole length of runway 26 right for a takeoff at 14 h 30. At 14 h 07 min 22 s, the controller gave start-up clearance and confirmed runway 26 right for takeoff. At 14 h 34 min 38 s, the Ground controller cleared the aircraft to taxi towards the runway 26 right holding point via the Romeo taxiway. At 14 h 40 min 02 s, the Loc Sud controller cleared 4590 to line up. At 14 h 42 min 17 s, he gave it takeoff clearance, and announced a wind from 090° at 8kt. The crew read back the takeoff clearance. The FE stated that the aircraft had used eight hundred kilos of fuel during taxiing. At 14 h 42 min 31 s, the PF commenced takeoff. At 14 h 42 min 54.6 s, the PNF called one hundred knots, then V1 nine seconds later. A few seconds after that, tyre No 2 (right front) on the left main landing gear was destroyed after having run over a piece of metal lost by an aircraft that had taken off five minutes before. The destruction of the tyre in all probability resulted in large pieces of rubber being thrown against the underside of the left wing and the rupture of a part of tank 5. A severe fire broke out under the left wing and around the same time engines 1 and 2 suffered a loss of thrust, severe for engine 2, slight for engine 1. By 14 h 43 min 13 s, as the PF commenced the rotation, the controller informed the crew the presence of flames behind the aircraft. The PNF acknowledged this transmission and the FE announced the failure of engine 2. The recorded parameters show a transient loss of power on engine 1 that was not mentioned by the crew. At around 14 h 43 min 22 s the engine fire alarm sounded and the FE announced \"shut down engine 2\" then the Captain called for the \"engine fire\" procedure. A few seconds later, the engine 2 fire handle was pulled and the fire alarm stopped. The PNF drew the PF’s attention to the airspeed, which was 200 kt. At 14 h 43 min 30 s, the PF called for landing gear retraction. The controller confirmed the presence of large flames behind the aircraft. At 14 h 43 min 42 s the engine fire alarm sounded again for around 12 seconds. It sounded for the third time at about 14 h 43 58 s and continued until the end of the flight. At 14 h 43 min 56 s, the PNF commented that the landing gear had not retracted and made several callouts in relation to the airspeed. At 14 h 43 min 59 s, the GPWS alarm sounded several times. The FO informed ATC that they were trying for Le Bourget aerodrome. The recorded parameters then indicate a loss of power on engine 1. A few seconds later, the aircraft crashed onto a hotel at “La Patte d’Oie” in Gonesse at the intersection of the N17 and D902 roads. The aircraft was totally destroyed by impact forces and a post crash fire and all 109 occupants were killed as well as four people working in the hotel. Five other employees were injured. The aircraft was chartered by the German Operator Deilmann to carry German tourists to New York. On board were nine French citizens (all crew members), 96 Germans, two Danish, one American and one Austrian. ", "probable_cause": "The following findings were identified:\r\n- High-speed passage of a tyre over a part lost by an aircraft that had taken off five minutes earlier and the destruction of the tyre.\r\n- The ripping out of a large piece of tank in a complex process of transmission of the energy produced by the impact of a piece of tyre at another point on the tank, this transmission associating deformation of the tank skin and the movement of the fuel, with perhaps the contributory effect of other more minor shocks and /or a hydrodynamic pressure surge.\r\n- Ignition of the leaking fuel by an electric arc in the landing gear bay or through contact with the hot parts of the engine with forward propagation of the flame causing a very large fire under the aircraft's wing and severe loss of thrust on engine 2 then engine 1.\r\n- In addition, the impossibility of retracting the landing gear probably contributed to the retention and stabilisation of the flame throughout the flight."}