{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b60-duke-huntsville-2-killed", "date": "Jan 18, 2010 at 1345 LT", "type": "Beechcraft 60 Duke", "operator": "John M. White", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Huntsville – Nashville", "msn": "P-591", "yom": 1982, "flight_number": null, "city": "Huntsville", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1600, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3383, "circumstances": "The multiengine airplane was at an altitude of 6,000 feet when it experienced a catastrophic right engine failure, approximately 15 minutes after takeoff. The pilot elected to return to his departure airport, which was 30 miles away, instead of diverting to a suitable airport that was located about 10 miles away. The pilot reported that he was not able to maintain altitude and the airplane descended until it struck trees and impacted the ground, approximately 3 miles from the departure airport. The majority of the wreckage was consumed by fire. A 5 1/2 by 6-inch hole was observed in the top right portion of the crankcase. Examination of the right engine revealed that the No. 2 cylinder separated from the crankcase in flight. Two No. 2 cylinder studs were found to have fatigue fractures consistent with insufficient preload on their respective bolts. In addition, a fatigue fracture was observed on a portion of the right side of the crankcase, mostly perpendicular to the threaded bore of the cylinder stud. The rear top 3/8-inch and the front top 1/2-inch cylinder hold-down studs for the No. 2 cylinder exceeded the manufacturer's specified length from the case deck by .085 and .111 inches, respectively. The airplane had been operated for about 50 hours since its most recent annual inspection, which was performed about 8 months prior the accident. The right engine had been operated for about 1,425 hours since it was overhauled, and about 455 hours since the No. 2 cylinder was removed for the replacement of six cylinder studs. It was not clear why the pilot was unable to maintain altitude after the right engine failure; however, the airplane was easily capable of reaching an alternate airport had the pilot elected not to return to his departure airport.", "probable_cause": "The pilot's failure to divert to the nearest suitable airport following a total loss of power in the right engine during cruise flight. Contributing to the accident was the total loss of power in the right engine due to separation of its No. 2 cylinder as a result of fatigue cracks."}