{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-2a8-new-delhi-0", "date": "Dec 2, 1995 at 1253 LT", "type": "Boeing 737-200", "operator": "Indian%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bombay – Jaipur – New Delhi", "msn": "20963", "yom": 1974, "flight_number": "IC492", "city": "New Delhi-Indira Gandhi", "zone": "National Capital Territory of Delhi", "country": "India", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 102, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6088, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following a wrong approach configuration, the aircraft landed too far down the runway, about 600 metres from the runway end. Unable to stop within the remaining distance, the aircraft overran, struck a concrete wall (45 cm high) and came to rest 450 metres further. All 108 occupants were evacuated safely and the aircraft was damaged beyond repair. ", "probable_cause": "The accident was the consequence of the combination of the following factors: \r\n- The injudicious and imprudent decision of the Pilot-in-Command to hastily complete the flight in the inadequate time available before the notified closure of Delhi airport for a VVIP flight,\r\n- The dangerously unstabilised approach made by the Pilot-in-Command, primarily due to his failure to decelerate the aircraft in time, \r\n- The failure of the First Officer to call out significant deviations from the stipulated approach parameters, \r\n- The failure of the Pilot-in-Command to carry out a missed approach in spite of his approach being grossly unstabilised, \r\n- The inadvertent omission of the Pilot-in-Command to arm the speed brake before landing,\r\n- Touch-down of the aircraft at excessive speed and too far down the runway, \r\n- Failure of the First Officer and Pilot-in-Command to monitor the automatic deployment of the speed brake, and failure of the Pilot-in-Command to deploy it manually, \r\n- Impact of the aircraft with an 18-inch high cement-concrete cable duct in the kutcha ground beyond the over-run area,\r\n- The pilot disregard of procedures, regulations and instructions."}