{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-dk-mt-crillon-2-killed", "date": "Jan 12, 1952 at 1150 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "General Airways (USA)", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Portland – Annette Island – Anchorage", "msn": "11827", "yom": 1943, "flight_number": "GEA785", "city": "Mt Crillon", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5366, "captain_hours_type": 3866, "copilot_hours": 3575, "copilot_hours_type": 606, "aircraft_hours": 8546, "circumstances": "Flight 785 departed Portland, Oregon, at 0200, January 12, 1952, destined for Merrill Field, Anchorage, Alaska, with a cargo of produce consisting mainly of crated eggs. The crew consisted of Captain Burton L. McGuire, Chief Pilot of General Airways, Inc., and First Officer George A. Simpson. The flight proceeded uneventfully and landed at Annette, Alaska, at 0709, at this point having completed almost one-half of the trip. At Annette, 507 gallons of 91 octane gasoline were added, resulting in a total fuel load of 650 gallons. The fueling report of the Standard Oil station at Annette reflected that the oil supply for each engine was 24 gallons. No cargo was removed from or added to the aircraft; the cargo weight upon departure was 6,177 pounds. The weight and balance manifest indicated a takeoff gross weight of 26,894 pounds, and the load was properly distributed with respect to the center of gravity. The maximum certificated takeoff gross weight for the aircraft was 26,900 pounds. The flight delayed at Annette for two hours and twenty-two minutes, awaiting improvement of weather conditions at Anchorage. Both pilots were thoroughly briefed on weather conditions by U. S. Weather Bureau personnel, and the pilots reviewed pertinent weather information several times. The aircraft was placed in a hangar to prevent ice formation due to freezing drizzle. A solid overcast was forecast over the route from Annette to Anchorage with temperature at flight level lowering from -10 degrees C. at Annette to -12 degrees C. between Sitka and Cape Spencer, and -14 degrees C. at Yakutat. Winds at the 10,000-foot level 2 were forecast as approximately 230 degrees and 45 knots to Sitka, and 200 degrees and 65 knots north of Sitka. Stable air was predicted, with little or no turbulence except over high, rough terrain where mechanically induced turbulence was expected due to the effect of strong winds. Light icing at flight level was forecast. The freezing drizzle changed to snow at about 0905, and the pilots made preparations to continue the flight. A new flight plan was filed at Annette, and Flight 785 was authorized by Air Route Traffic Control to proceed under Instrument Flight Rules (IFR), direct from Annette to Sitka (off airway) and thence to Anchorage via Amber Airway No. 1. 3 The flight was to maintain at least 500 feet on top of the clouds while in the control area, join Amber 1 at Sitka at 9,000 feet, and maintain 9,000 feet. The alternate airport was Kenai, near Anchorage. Flight 785 departed Annette at 0931. The flight reported to Annette radio at 0940 that it estimated over Sitka at 1050. At 1111, Flight 785 advised Sitka radio that it was meeting strong head winds and estimated over Sitka in five or ten minutes. At 1116, the pilot reported by Sitka at 1113, 9,000 feet, and estimating Cape Spencer intersection 4 at 1156. Flight 785 reported by Cape Spencer intersection at 1147, 9,000 feet, estimating over Yakutat at 1245. This was the last radio contact with N 41748.", "probable_cause": "The Board, upon consideration of all available evidence, determines that the probable cause of this accident was deviation from the planned route due to improper navigation of the flight. The following findings were pointed out:\r\n- The flight was proceeding from Annette to Anchorage in accordance with an IFR flight plan,\r\n- No malfunctions of any nature were reported by the crew after departure from Annette,\r\n- Radio range stations in the area operated normally and the on-course signals were within allowable tolerances,\r\n- One or more transmitters and receivers installed in N 41748 operated normally for at least two hours and sixteen minutes after the Annette departure,\r\n- The wind at flight level in the crash area was from about 210 degrees and 80 knots, whereas the latest forecast wind on which the pilots were briefed was 65 knots from 200 degrees for the 10,000-foot level,\r\n- The flight struck Mt. Crillon at an altitude of 9,000 feet MSL and about 30 miles northeast of its planned course."}