{"url": "https://www.baaa-acro.com/crash/crash-sud-aviation-se-210-caravelle-vi-n-new-delhi-2-killed", "date": "Feb 15, 1966", "type": "Sud-Aviation SE-210 Caravelle", "operator": "Indian%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Calcutta – New Delhi", "msn": "130", "yom": 1964, "flight_number": null, "city": "New Delhi-Palam", "zone": "National Capital Territory of Delhi", "country": "India", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 74, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 18378, "captain_hours_type": 484, "copilot_hours": 14887, "copilot_hours_type": 178, "aircraft_hours": 5411, "circumstances": "Indian Airlines Corporation, Caravelle, VT-DPP, while on scheduled domestic passenger service from Calcutta Airport to Palam Airport on 15 February 1966, undershot the runway while attempting to land under conditions of poor visibility due to fog at Palam, with the result that it struck a cement pillar and subsequently several other obstructions until it came to rest on its belly near the threshold of the runway in use. Fortunately, all crew and passengers were able to get out before the aircraft was consumed by the fire which had broken out as a result of the earlier impact with obstructions. Some of the passengers received injuries and burns of varying degrees. Unfortunately, two passengers succumbed to their injuries subsequently. The aircraft was completely destroyed.", "probable_cause": "The Government of India has accepted that the aircraft undershot and crashed as a result of the abandonment of the ILS approach at too early a stage during an attempt to land under conditions of poor visibility in fog. \r\nContributory causes were: \r\n(i) Lack of information with the pilot regarding the true conditions of- surface visibility, which was in fact below thi minimum prescribed for a night landing by Caravelle aircraft on runway 28 at Palam. \r\n(ii) Lack of proper monitoring and possibly incorrect setting of altimeter(s) during the approach to land. \r\n(iii) The use of landing lights which resulted in glare during the final stages of the approach in foggy conditions. "}