{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-406-barcelona", "date": "Nov 28, 2004 at 1850 LT", "type": "Boeing 737-400", "operator": "KLM-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Amsterdam – Barcelona", "msn": "25424", "yom": 1992, "flight_number": "KL1673", "city": "Barcelona", "zone": "Catalonia", "country": "Spain", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 140, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5414, "captain_hours_type": 5414, "copilot_hours": 5117, "copilot_hours_type": 1543, "aircraft_hours": 31756, "circumstances": "At 16:46 KLM Flight 1673 departed Amsterdam for Barcelona. Upon rotation from runway 18L the aircraft suffered a bird strike. A bird collided with the nose gear. The gear was retracted normally and there was no abnormal indication in the cockpit. The crew reported the impact to the ATC and the flight to Barcelona continued normally. The aircraft touched down on Barcelona's runway 25R. After touchdown of the nose landing gear, the aircraft started deviating to the left of the runway centreline. The veering to the left continued and the aircraft left the paved surface of the runway and went through an area of soft sand where some construction works were being carried out. The nose landing gear leg collapsed rearwards and the left main landing gear leg detached from its fittings shortly before the aircraft came to a stop close to the edge of a rain drainage canal. The final position of the aircraft was at a longitudinal distance of approximately 1606 m from runway 25R threshold, and at a lateral distance of approximately 84 m from the runway centreline.", "probable_cause": "It is considered that the accident probably happened because during the takeoff a bird strike broke one of the cables of the nose wheel steering system of the aircraft and jammed the other, which made that the nose wheels were rotated to the left during landing, causing a veering to the left that could not be arrested by full rudder deflection as the aircraft decelerated. The subsequent application of brakes and other actions by the crew could not avoid that the aircraft went outside the runway surface. The damages to the aircraft were increased by the condition of the runway strip due to the airport construction works. Contributing to the breaking of the cable was the fact that it was severely worn locally. The wear could be traced back to the incorrect application of grease to the cable system during maintenance. Despite the training and experience of the flight crew, they were unable to quickly recognize the possible cause of the deviation of the aircraft and to keep the aircraft on the runway."}