{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130j-30-jalalabad-14-killed", "date": "Oct 2, 2015 at 0016 LT", "type": "Lockheed C-130 Hercules", "operator": "United%20States%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Jalalabad - Bagram", "msn": "5648", "yom": 2011, "flight_number": null, "city": "Jalalabad", "zone": "Nangarhar", "country": "Afghanistan", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 3, "total_fatalities": 14, "captain_hours": 943, "captain_hours_type": null, "copilot_hours": 338, "copilot_hours_type": null, "aircraft_hours": 2551, "circumstances": "On 2 October 2015, at approximately 0016LT, the airplane crashed after takeoff from runway 31 at Jalalabad Airfield, on the second scheduled leg of a contingency airlift mission. The mishap aircraft was assigned to the 455th Air Expeditionary Wing at Bagram Airfield, Afghanistan. The mishap crew (MC) was from the 774th Expeditionary Airlift Squadron. The MC consisted of the mishap pilot (MP), the mishap copilot (MCP), and two mishap loadmasters. Also on board were two fly-away security team (FAST) members and five contractors travelling as passengers. Upon impact, all eleven individuals onboard the aircraft died instantly. The aircraft struck a guard tower manned by three Afghan Special Reaction Force (ASRF) members, whom also died. The MA and cargo load were destroyed, and a perimeter wall and guard tower were damaged.", "probable_cause": "The Accident Investigation Board (AIB) president found by a preponderance of the evidence that the causes of the mishap were the MP’s placement of the hard-shell NVG case in front of the yoke blocking forward movement of the flight controls, the distractions experienced by the MP and MCP during the course of the ERO, and the misidentification of the malfunction once airborne. The AIB president also found by a preponderance of the evidence that environmental conditions, inaccurate expectations, and fixation substantially contributed to the mishap. "}