{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-wise-river-1-killed", "date": "Sep 5, 1996 at 1157 LT", "type": "Cessna 340", "operator": "Michael A. O’Keefe", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Butte - McCall", "msn": "340A-0084", "yom": 1976, "flight_number": null, "city": "Wise River", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1500, "circumstances": "The pilot received a full weather briefing from a Flight Service Station (FSS) on the morning of the accident. The FSS briefer told the pilot that moderate turbulence and icing prevailed along the pilot's intended route of flight, and that there were forecasts for isolated thundershowers. The briefer advised the pilot to call for an update just prior to departure. The pilot departed on the flight almost 3 hours later without calling for an update. He received an IFR clearance after 15 minutes of delays, then proceeded on course to his destination. About 35 minutes after departure, while cruising at 16,000 feet, the pilot reported that he was 'in the clouds and the bumps are big time.' About 3 minutes later, the pilot radioed that he was 'in a dive and I don't...' The airplane impacted terrain in a nose-down, inverted attitude and exploded. Analysis of recorded radar and meteorological data indicates that the airplane encountered a thunderstorm, strong updrafts, downdrafts, and turbulence. ", "probable_cause": "The pilot's attempt to fly in adverse meteorological conditions which led a loss of aircraft control. Factors contributing to the accident include: the pilot's failure to obtain the most current information of the meteorological conditions prior to departure, a thunderstorm, and turbulence."}