{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a60-duke-snoqualmie-pass-6-killed", "date": "Nov 21, 1992 at 0935 LT", "type": "Beechcraft 60 Duke", "operator": "James D. Huber", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Seattle - Pullman", "msn": "P-209", "yom": 1973, "flight_number": null, "city": "Snoqualmie Pass", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 3250, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "While climbing in moderate icing conditions after takeoff, pilot was cleared to 17,000' feet. Radar data showed aircraft climbed at an indicated airspeed (IAS) of 82 to 123 knots. A Beech safety info booklet stated that a minimum airspeed of 140 knots must be maintained in icing conditions. Climbing at reduced airspeed would have increased angle of attack and allowed ice to accumulate under the wings and aft of the de-icing boots. Aircraft climbed to 13,500 feet, descended momentarily to 13,300 feet, then continued climbing as airspeed decreased abruptly. After slowing to 60 knots ias at 13,700 feet, the aircraft entered a steep descending turn and accelerated to high speed (above VNE). An emergency was declared, stating the aircraft 'lost an engine.' Soon thereafter, radar contact was lost and the aircraft crashed. Pieces of empennage surfaces separated in flight and were found at remote location from the main wreckage. Both counterweights separated from the elevators. Post crash tests disclosed no mechanical evidence of engine malfunction. Low ceiling, fog, light rain, snow and icing conditions were reported in area. All six occupants were killed. ", "probable_cause": "Failure of the pilot to maintain control of the aircraft, his failure to prevent the aircraft from exceeding the never exceed speed (VNE), and subsequent exceeding of the design stress limits of the aircraft. Factors related to the accident were: weather conditions (including icing conditions), improper airspeed, and loss of engine power for undetermined reason(s)."}