{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-1-do-skymaster-dusseldorf-7-killed", "date": "Nov 3, 1957 at 0703 LT", "type": "Douglas C-54 Skymaster", "operator": "Karl-Herfurtner-Luftreederei", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Düsseldorf – Reykjavik – New York", "msn": "7459", "yom": 1944, "flight_number": null, "city": "Düsseldorf-Lohausen", "zone": "North Rhine-Westphalia", "country": "Germany", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 6, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 1, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight was to be from Dusseldorf, Germany, to New York via Reykjavik. One crew was to pilot the first leg of the trip to Reykjavik and the relief crew was to complete the flight to New York. Of the ten aboard the aircraft, seven were crew and three were passengers. Take-off from Dusseldorf at 0700 hours was normal until the aircraft became airborne. Immediately after becoming airborne and following retraction of the gear No. 1 engine was cut off and its propeller feathered. Then the No. 2 engine was also cut off and its propeller feathered. During this process the flaps were immediately and fully retracted. The aircraft, having attained an altitude of 50 metres, dropped sharply, lost altitude and crashed (0703 hours) into buildings within the city limits killing six of the occupants instantly and seriously injuring the other four. In addition, one person on the ground was killed and two others seriously injured. The wreckage was completely destroyed by fire. ", "probable_cause": "The accident was caused by the intentional creation of an emergency situation on take-off for a long distance flight: first No. 1 engine was cut off and its propeller feathered, then No. 2 engine was also stopped and its propeller feathered. In addition, the flaps were immediately and fully retracted at low altitude. Such action by the pilot-in-command during take-off immediately after the aircraft became airborne, with a view to testing a crew member, caused the aircraft to crash. The piloting technique was not consistent with the safety requirements and operating instructions as prescribed by the Directorate of Civil Aviation. "}