{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-80-dl-ankara-52-killed", "date": "Feb 1, 1963 at 1513 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Turk-Hava-Kuvvetleri", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "City", "schedule": "Ankara - Ankara", "msn": "19668", "yom": 1944, "flight_number": null, "city": "Ankara", "zone": "Central Anatolia Region (İç Anadolu Bölgesi)", "country": "Turkey", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 49, "total_fatalities": 52, "captain_hours": null, "captain_hours_type": 1452, "copilot_hours": null, "copilot_hours_type": 36, "aircraft_hours": 2340, "circumstances": "Middle East Airlines flight 265, a Vickers Viscount registered OD-ADE, was descending for Ankara-Esenboğa Airport, Turkey and had been cleared for an approach to runway 03. Last radio contact was at 13:09 hours GMT when the flight reported being over the Ankara NDB at 8000 feet, descending for 6500 feet. The crew would contact Ankara again over the NDB when inbound. Earlier in the day, at 11:22 GMT, a Douglas C-47 transport plane of the Turkish Air Force (CBK-28) had taken off from Ankara's Etimesgut Air Base for an instrument training flight in the southeast region of the Gölbasi beacon. The duration of the flight was planned for 1 hour 30 minutes . In this type of flight the student pilot is normally seated in the left-hand seat, an orange plexiglass panel is placed in front of him on the left half of the windshield, and he wears dark blue glasses. The instructor is in the right-hand seat and is able to maintain a lookout. The training manoeuvres had been completed, and the aircraft was returning to Etimesgut flying under visual flight rules by the time MEA flight 265 was descending for Esenboğa Airport. The Viscount, cruising on a heading of 283°, collided with the C-47 which was flying on a heading of 243° towards Etimesgut. The lower right-hand-side of the Viscount's nose and the starboard wing struck the C-47 from behind at a 40° angle in the door area on its port side. Propeller no. 3 also struck the C-47's left horizontal stabilizer, cutting it off. The blade ends broke off and remained with the tail unit of the C-47 near the base of the left horizontal stabilizer. The blade of propeller no. 4 cut the underside of the tip of the right horizontal stabilizer. Both aircraft flew together for a very short time then separated. The tail unit of the C-47 having been cut off, the C-47 fell vertically immediately thereafter. Prior to being cut off, the left horizontal stabilizer of the C-47 damaged the starboard side skin covering of the Viscount in the vicinity of the passenger cabin windows. This piece of skin covering broke off, and some of the passengers fell out through this hole. The Viscount flew a very short while following the separation of the two aircraft, then nosed down and fell. Both aircraft crashed into a residential area of Ankara, killing 87 people on the ground. 50 others were seriously injured.", "probable_cause": "The Viscount aircraft had an IFR flight plan but was cruising under VFR conditions when it hit, with the lower side of the nose and with its starboard wing, the C-47 aircraft of the Turkish Air Force between the door on the port side of the fuselage and the tail group at an angle of forty degrees from the left rear and at an angle of approximately five to ten degrees upward. It cut off, with its starboard inner (No.3) propeller, the port side horizontal stabilizer of the C-47 aircraft. The pilots of the Viscount aircraft did not see the C-47 aircraft cruising below 7000 feet on their right-hand side forward, and the Viscount, having a higher speed, caught up with the C-47 from the left rear. At the last moment the Viscount pilots saw the C-47 and tried to avoid the collision by pulling up, but they did not succeed. The following findings were reported:\r\n- The Viscount pilot made an estimation error of two minutes on the distance between Gölbasi and the Ankara NDB, \r\n- His radiocommunications did not conform to the standard international conversation procedures,\r\n- The C-47 was returning to Etimesgut Airport under visual flight rules (VFR) following an instrument training flight,\r\n- These training flights are scheduled to be carried out below 7 000 ft with the trainee-pilot behind blind flight panels and the instructor-pilot sitting so as to be able to see outside thoroughly, The flights normally last for 1 hour- and 30 minutes, however, the instructor is authorized to extend this period if he deems it necessary,\r\n- The C-47 was subjected to an impact from the port side rear at an angle of 40° and from the bottom to the top upwards at an angle of approximately 5 to 10°. The Viscount's flaps were set at 32° down, and the gear was down and locked. The aircraft collided over the City of Ankara at an altitude less than 7 000 feet."}