{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-282-funchal-131-killed", "date": "Nov 19, 1977 at 2148 LT", "type": "Boeing 727-200", "operator": "Air%20Portugal", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Brussels - Lisbon - Funchal", "msn": "20972", "yom": 1975, "flight_number": "TP425", "city": "Funchal", "zone": "Madeira", "country": "Portugal", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 6, "pax_on_board": 156, "pax_fatalities": 125, "other_fatalities": 0, "total_fatalities": 131, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6154, "circumstances": "While descending to runway 24 on an NBD approach, the crew encountered poor weather conditions with limited visibility to 3 km, clouds down to 1,500 feet and rain falls. Unable to establish a visual contact with the runway, the pilot-in-command initiated a go-around. Few minutes later, while on a second attempt to land, the crew landed too far down, about 2,060 feet past the runway threshold (runway 24 is 5,000 feet long) at a speed of 148 knots. Immediately after touchdown, the crew activated the thrust reversers and deployed the spoilers but unable to stop on a wet runway, the airplane overran. It went down a steep embankment, collided with a stone bridge, broke into several pieces and eventually came to rest in flames on a beach located about 40 meters below airfield elevation. The aircraft was totally destroyed by impact forces and a post crash fire. Six crew members and 125 passengers were killed while 33 other occupants were seriously injured.", "probable_cause": "The accident was the consequence of the combination of the following contributing factors:\r\n- Very unfavorable weather conditions at the time of landing, \r\n- Possible existence of conditions for hydroplaning,\r\n- Landing at a speed of Vref + 19 knots,\r\n- Landing long with a too long flare,\r\n- Sudden directional correction after touchdown on the runway."}