{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-204-100-moscow", "date": "Mar 22, 2010 at 0235 LT", "type": "Tupolev TU-204", "operator": "Aviastar-Tu", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hurghada - Moscow", "msn": "14507413640", "yom": 1993, "flight_number": "TUP1906", "city": "Moscow-Domodedovo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5388, "captain_hours_type": 1868, "copilot_hours": 1973, "copilot_hours_type": 979, "aircraft_hours": 18335, "circumstances": "The aircraft was returning to Moscow on a ferry flight after passengers have been dropped off in Hurghada. On approach to Moscow-Domodedovo Airport, the visibility was low due to foggy conditions. Horizontal visibility on runway 14L threshold was 1,300 meters and vertical visibility was 200 feet. In flight, the flight computer failed and the crew continued the approach below minimums. Despite he was not able to establish a visual contact with the runway, the captain continued the approach and failed to initiate a go-around procedure. The aircraft descended below the glide, impacted trees and crashed in a dense wooded area located 1,450 metres short of runway. All eight occupants were injured, three seriously. The aircraft was destroyed. ", "probable_cause": "The crew performed an approach in below-minima weather conditions for an airplane with a defective flight computer. The crew failed to initiate a go-around procedure while unable to establish a visual contact with the runway.\r\nContributing factors were:\r\n- Insufficient training of the crew to perform approaches at or near weather minimums,\r\n- Lack of control over the activities of the crew, which led to poor resource management (CRM) of the captain,\r\n- Failure of the flight control computer system, which led to an increase in the allowed weather minima of the aircraft,\r\n- Failure of captain to divert to another airport,\r\n- Failure of captain to decide about a missed approach when there was visual contact with the approach lights,\r\n- Failure of the co-pilot to call for a missed approach,\r\n- Unsatisfactory interaction in the crew, resulting in a descent below safe altitude.\n"}