{"url": "https://www.baaa-acro.com/crash/crash-learjet-25b-pittsburgh-2-killed", "date": "Nov 22, 2001 at 1305 LT", "type": "Learjet 25", "operator": "Universal%20Jet%20Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Pittsburgh - Boca Raton", "msn": "25-088", "yom": 1972, "flight_number": null, "city": "Pittsburgh-Intl", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5952, "captain_hours_type": 3030, "copilot_hours": 1240, "copilot_hours_type": 300, "aircraft_hours": 10004, "circumstances": "A commercial pilot, who observed the airplane during the takeoff attempt, stated that it used \"lots\" of runway, and that the nose lifted \"too early and way too slow.\" The airplane \"struggled\" to get in the air, and it appeared tail heavy, with \"extreme\" pitch, about 45 degrees nose-up. It also appeared that the only thing keeping the nose up was ground effect. The airplane became airborne for \"a very short time,\" then sank to the ground, and veered off the left side of the runway. The nose was \"up\" the whole time, the airplane never \"rolled off on a wing,\" and the wings never wobbled. The engines were \"really loud,\" like a \"shriek,\" and engine noise was \"continuous until impact.\" Another witness at a different location confirmed the extreme nose high takeoff attitude and the brief time the airplane was airborne. It seemed odd to him that an airplane with that much power used so much runway. A runway inspection revealed no evidence of foreign objects or aircraft debris. Tire tracks from the airplane's main landing gear veered off the left side of the paved surface, at a 20-degree angle, about 3,645 feet from the runway's approach end. They continued for about 775 feet, then turned back to parallel the runway for another 650 feet, before ending about 50 feet prior to a chain link fence. There was no evidence that the nose wheel was on the ground prior to the fence. The fence, which was about 1,300 feet along the airplane's off-runway ground track and 200 feet to the left of the runway edge stripe, was bent over in the direction of travel. Ground scars began about 150 feet beyond the fence, and the main wreckage came to rest 300 feet beyond the beginning of the ground scars. The first officer advised a witness that he'd be making the takeoff; however, the pilot at the controls during the accident sequence could not be confirmed. When asked prior to the flight if he'd be making a high-performance takeoff, the captain replied that he didn't know. There was no evidence of mechanical malfunction.", "probable_cause": "The (undetermined) pilot-at-the-controls' early, and over rotation of the airplane's nose during the takeoff attempt, and his failure to maintain directional control. Also causal, was the captain's inadequate remedial action, both during the takeoff attempt and after the airplane departed the runway."}