{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-60-duke-mexia-1-killed", "date": "Mar 3, 2002 at 1350 LT", "type": "Beechcraft 60 Duke", "operator": "Mapleleaf Acquisitions", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Mexia - DuPage", "msn": "P-124", "yom": 1970, "flight_number": null, "city": "Mexia", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 25600, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4363, "circumstances": "The pilot arrived at Mexia-Limestone County Airport (TX06), Mexia, Texas, sometime before 1100. Once onboard the airplane, a witness, and an acquaintance of the pilot, closed and locked the airplane's cabin door for the pilot, and walked away from the airplane. He also reported that after the engines to the airplane were started, the airplane stayed on the ramp and idled for 10 to 15 minutes. No one saw the pilot taxi to the runway, but he taxied to the north end of Runway 18 for a downwind takeoff to the south. Examination of the accident site found the wreckage oriented along a path consistent with an extended centerline of runway 18. The airplane was found along a fence line approximately 1/4 mile from the departure end of Runway 18. The airplane's track was along a 183-degree bearing, and there was a large burn area prior to and around the debris zone along the wreckage path. Examination of the cockpit revealed a 9/16-inch hex-head bolt inserted in the control lock pinhole for the control column. Under normal procedures Cockpit Check in the Duke 60 Airplane Flight Manual, for Preflight Inspection the first item listed is: 1. \"Control Locks - REMOVE and STOW\". In addition, under normal procedures Before Starting checklist in the Duke 60 Airplane Flight Manual, the fourth item to check is listed as: 4. \"Flight Controls - FREEDOM OF MOVEMENT and PROPER RESPONSE\" ", "probable_cause": "The pilot's failure to remove the control lock before the flight and his failure to follow the checklist."}