{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-westfield-1-killed", "date": "Jul 28, 2001 at 1655 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Munir H. Abbasy", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nantucket – Westfield", "msn": "46-22079", "yom": 1989, "flight_number": null, "city": "Westfield-Barnes", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1660, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1030, "circumstances": "After a normal cross country flight, the airplane was on final approach for landing to runway 20, when the air traffic controller instructed the pilot to \"go-around\" because a preceding airplane had not cleared the runway. The airplane was observed to pitch up and enter a steep, almost 90 degree left bank. The passenger in the rear seat described the flights from and to BAF as \"smooth.\" She stated she thought that the airplane would be landing; however, then realized the airplane was in a left turn. The airplane impacted on the roof of a commercial building, and came to rest upright  on a heading of 020 degrees, in a parking lot, about 1/4 mile east of the approach end the runway. Examination of the airplane, which included a teardown of the engine, did not reveal evidence of any pre-impact malfunctions. Weather reported at the airport about the time of the accident included winds from 240 degrees at 7 knots; visibility 10 status miles and few clouds at 6,500 feet. The pilot owned the airplane and had accumulated about 1,660 hours of total flight experience. ", "probable_cause": "The pilot's failure to maintain aircraft control while maneuvering during a go-around."}