{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-201f-oxon-hill-5-killed", "date": "Jan 13, 1948 at 0436 LT", "type": "Douglas DC-3", "operator": "Eastern-Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Houston – Atlanta – Greenville – Winston – Washington DC", "msn": "4092", "yom": 1941, "flight_number": "EA572", "city": "Oxon Hill", "zone": "Maryland", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 7271, "captain_hours_type": 5111, "copilot_hours": 4593, "copilot_hours_type": 1002, "aircraft_hours": 29974, "circumstances": "Flight 572 arrived in Atlanta, Georgia, from its point of origin, Houston, Texas, at 2330, January 12, 1948. With a new crew, consisting of Captain Paul J. Saltanis, First Officer Ralph B. Sanborn, Jr., and Flight Attendant Peter L. Philiois, the flight departed from Atlanta at 2355 for Greenville and Winston-Salem, North Carolina, and Washington, D. C. The flight as far as Winston-Salem was routine. At 0306, January 13, 1948, the flight took off from Winston-Salem carrying six passengers, a crew of three, and 600 gallons of fuel. It proceeded at the altitude of 9,000 feet specified in the flight plan, to Washington, via Blackstone and Richmond, Virginia. Shortly after reporting over Blackstone, at 0405, 146 miles southwest of Washington, an airway traffic control clearance was transmitted by company radio to the flight authorizing it to cross the Doncaster fan marker, 27 miles southwest of Washington, at 5,000 feet. Captain Saltanis requested a lower altitude and ten minutes later received another ATC clearance approving 3,000 feet over Doncaster, and permission to descend to 2,500 feet immediately after crossing Doncaster. At 0427, the flight reported its position to the Washington control tower, stating that it was over Doncaster at 3,000 feet. It was instructed by the tower to maintain 2,500 feet, and to report again when it was over Mt. Vernon. 9 miles south of the Washington National Airport. At about this same time another Eastern Air Lines’ flight, No, 454, reported that it was at 4,500 feet over the Arcola range station, which is located 23 miles west-northwest of Washington, D. C. Since the two Eastern Air Lines' flights were converging toward Mt. Vernon, the airport traffic controller thought that flight 454 might fly over Mt. Vernon before it had descended to a safe altitude below Flight 572. To assure that both airplanes would not be over Mt. Vernon at the seine time and altitude, the controller instructed Flight 572 to climb to 3,500 feet Flight 572 acknowledged, advised that it was contact, and asked why it was necessary to climb. Less than a minute later, at approximately 0430, the east bound flight, No. 454, reported that it was “contact” at 2,000 feet and approaching Mt. Vernon. The controller then knowing that a safe altitude separation existed between the two aircraft, cleared night 572 back to its previous approach altitude of 2,500 feet. At 0433, flight 572 was again cleared to the airport by the Washington Tower, and advised to report when leaving 2,500 feet, when leaving Mt. Vernon, and when \"VFR.\" 2 Following this transmission flight 572 was asked to give a short count, since the tower wished to adjust its receiving frequency. The flight complied. Then at 0435, the flight was requested to report the altitude of the base of the clouds. The flight responded, “standby.” According to the tower operator the pilot’s voice when giving the tuning count was normal, but his “standby,” sounded “hurried and preoccupied.” One to two minutes after the east bound flight, No. 454, reported contact approaching Mt. Vernon, an aircraft was observed in the tower’s surveillance radar scope over the vicinity of Mt. Vernon. This aircraft was then tracked continuously, first In the surveillance, and then in the precision beam radar scope until it had landed on runway 36. 3 It was then identified as Eastern's Flight 454. Flight 572, however, was not observed in either scope. From 0435 to 0445 several attempts were made to establish radio contact with flight 572. Forty-five minutes later it was learned that it had crashed in the vicinity of Oxon Hill, Maryland, approximately 5.2 miles south of the Washington National Airport. Three passengers and two crew members were killed in the accident. ", "probable_cause": "The Board determines that the probable cause of this accident was the failure of the flight to follow prescribed instrument procedure and to maintain a safe altitude during the course of an instrument approach to the Washington National Airport."}