{"url": "https://www.baaa-acro.com/crash/crash-pacific-aerospace-pac-750xl-near-oksibil-8-killed", "date": "Aug 11, 2018 at 1420 LT", "type": "PAC 750XL - Pacific Aerospace Corporation", "operator": "Dimonim%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Tanah Merah – Oksibil", "msn": "144", "yom": 2009, "flight_number": null, "city": "Oksibil", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 13665, "captain_hours_type": 1468, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4574, "circumstances": "On 11 August 2018, a PAC 750XL aircraft registered PK-HVQ was being operated by PT. Marta Buana Abadi (Dimonim Air) on unscheduled passenger flight from Tanah Merah to Oksibil. At the day of the occurrence the meteorological condition at Oksibil was below the requirement of Visual Flight Rule (VFR) weather minima and did not improve. Being aware that some flights had performed flight to Tanah Merah to Oksibil and returned, the pilot decided to fly to Oksibil. At 1342 LT, on daylight condition the PK-HVQ aircraft departed from Tanah Merah to Oksibil, on board the aircraft were one pilot, one observer pilot and 7 passengers. According to the passenger and cargo manifest, the total weight of passenger and the baggage were 473 kg. Prior to the departure, there was no record or report of aircraft system malfunction. At 1411 LT, the PK-HVQ pilot made initial contact to Oksibil Tower controller and reported that the aircraft was maintaining altitude of 7,000 feet over and the estimate time arrival at Oksibil would be 0520 UTC (1420 LT). The Oksibil Tower controller advised the pilot of the latest meteorological condition that the visibility was 1 up to 2 km and most of the area were covered by cloud. At 1416 LT, the pilot reported that the aircraft position was over Oksibil Aiport and the Oksibil Tower controller instructed the pilot to continue the flight to the final runway 11 and to report when the runway had in sight. The Oksibil Tower controller and pilots of other aircraft called the pilot but no reply. On the following day, the aircraft was found on a ridge of mountain about 3.8 Nm north west of Oksibil on bearing 331° with elevation about 6,800 feet. Eight occupants were fatally injured and one occupant was seriously injured. ", "probable_cause": "The KNKT concluded the contributing factors as follows:\r\n- The VFR weather minimum requirement that was not implemented properly most likely had made the pilot did not have a clear visual to the surrounding area.\r\n- Considering that the Pilot in Command (PIC) had lack knowledge of the terrain surrounding the Oksibil area, and the absence of voice alert from the TAWS when the aircraft flying close to terrain, resulted in the PIC did not have adequate awareness to the surrounding terrain while flying into clouds and continued to fly below the terrain height until the aircraft impacted the terrain."}