{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-bakersfield-2-killed", "date": "Feb 6, 1990 at 1548 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "James W. Hager", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Porterville – Redlands", "msn": "46-22091", "yom": 1989, "flight_number": null, "city": "Bakersfield", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8155, "captain_hours_type": 51, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 62, "circumstances": "Before takeoff, pilot was advised of IFR conditions along 1st part of route, with flight predictions for occasional moderate turbulences below 15,000 feet and mixed icing from freezing level (6,000 feet) to 18,000 feet. He filed IFR flight plan with cruise altitude of 11,000 feet. During departure, pilot was cleared to climb to 9,000 feet and told to expect clearance to 11,000 feet 5 minutes later. Radar data showed aircraft climbed at about 1,500 feet/minute and 100 knots, slowing slightly above 8,000 feet. At abt 9,000 feet, aircraft started to level and accelerate. It then climbed momentarily, deviated laterally from course and entered steep descent. Inflight breakup occurred and wreckage was scattered over 4,100 feet area. Trajectory study showed breakup occurred between 4,500 feet and 6,500 feet as aircraft was in steep descent in excess of 266 knots. Metallurgical examination of wings and stabilizers revealed features typical of overstress separation; no pre-existing cracks or defects were found. The aircraft was recently purchased. Pilot's son indicated principal problem was 'twenty year leap in technology' from previously owned PA-24, that pilot had difficulty with avionics and flight director/autopilot, and that he lacked detail training in autopilot emergencies. Both occupants were killed. ", "probable_cause": "The pilot's failure to activate the pitot heat before flying at and above the freezing level in instrument meteorological conditions (IMC), followed by his improper response to erroneous airspeed indications that resulted from blockage of the pitot tube by atmospheric icing. Contributing to the accident was spatial disorientation of the pilot.   "}