{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-21-islander-guadalcanal-1-killed", "date": "Oct 17, 2007 at 1930 LT", "type": "Britten-Norman Islander", "operator": "Auxiliar de Actividades Aérea", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "Yes", "site": "Mountains", "schedule": "Guadalcanal - Guadalcanal", "msn": "2011", "yom": 1977, "flight_number": null, "city": "Guadalcanal", "zone": "Andalusia", "country": "Spain", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": 2400, "copilot_hours_type": null, "aircraft_hours": 8500, "circumstances": "The Britten Norman “Islander” aircraft, registration G-CHES, had flown on the morning of 17 October 2007 over various points of the Sierra Morena and the north part of the province of Seville. Its mission had been to scout the various flight fields which would be available to the aircraft in future operations. The purpose of that day’s flight was to land at a temporary runway in the town of Guadalcanal, in the province of Seville on the border with the province of Badajoz. This runway, used by airplanes on agricultural flights, is some five kilometers SW of the town. The pilot, however, mistakenly landed at another temporary field, with the same bearing and approximately halfway between the town and the other runway on Guadalcanal. The runway on which it landed, called Los Tomillares (after the name of the ranch on which it is located), is considerably shorter. The distance available was sufficient for the airplane’s sole pilot to land normally. In order to be able to depart from that strip, which measured only 400 m in length, the pilot telephoned for help and guidance in order to make the short four-kilometer flight from that strip to the runway in Guadalcanal, his original destination. In response to his call for help, a pilot with experience on that type of airplane reported to the strip early in the afternoon and joined the pilot as a crew advisor on the aircraft in order to aid the pilot in command. Two other persons on the ground provided assistance loading fuel in the main tanks. The gasoline was taken to the aerodrome in 50-liter plastic drums, which were placed inside the aircraft once emptied, since they were operating between runways in which there was no refueling service. A total of 250 liters of AV100LL fuel was deposited in the main tanks. Both pilots walked the length of the field at Los Tomillares to check its condition and dimensions. They determined its length by counting their steps. They also determined its gradient. Although the surface was made of uncompacted dirt, they calculated that it was sufficient for takeoff, which they decided to do toward the southeast to take advantage of the favorable negative slope. Specifically, they planned to depart on a SE heading, turn 90° right, and continue flying south until they were lined up with the Guadalcanal runway. They planned to land on a NW course. They postponed the operation until late in the afternoon, before sunset, so as to avoid glare from the setting sun while landing at Guadalcanal. According to eyewitness accounts, the pilot in command did the pre-flight check and dismissed the ground assistants, who left before the airplane took off. A few minutes later, at 19:30, half an hour prior to sunset, the aircraft headed for the runway threshold. Shortly thereafter it started its takeoff, gaining speed and becoming airborne prior to reaching the opposite threshold. The right engine then started to fail partially, causing the airplane to yaw hard to the right. The pilot in command, seated to the left, was flying the airplane. According to the statement of the accompanying pilot, who was seated in the RH seat, when the engine failed, the pilot asked him to take the flight controls while he attempted to restore power to the right engine. After lowering the nose, they started to descend slightly, managing to correct the right yaw by applying left rudder. They had practically managed to regain directional control of the aircraft when the right engine started to run at full power once more, propelling the aircraft, which caused it to veer left, toward higher ground. They were unable to avoid the impact. The aircraft’s left wingtip impacted first, hitting some bushes on the hillside. A few meters later the left gear wheel made contact. After crossing a small river bed, the aircraft’s left wing and forward fuselage impacted, with the airplane coming to a stop after traveling along the ground for a few meters. The impact site was on the runway centerline extension and some 400 m from the southeast threshold, which they had overflown a few seconds earlier when taking off. The aircraft was seriously damaged and was essentially destroyed. There was no fire after the impact.", "probable_cause": "It is believed that the fault and abnormal operation of the right engine was probably caused by the presence of water in the fuel being supplied to it. This water could have come from condensation inside the tanks that was not properly drained when the airplane was serviced. Alternatively, the water could have come from the jugs that were used to transport the fuel prior to the refueling in the field. The cause behind the airplane’s loss of lateral control and its ability to climb was probably the result of the oscillating condition of the high asymmetric drag as the stationary propeller, and the counteracting forces being applied by the rudder, were suddenly and immediately replaced by a condition of high symmetric thrust with the left rudder pedal still fully depressed."}