{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900c-nassau", "date": "Oct 22, 2004 at 1345 LT", "type": "Beechcraft 1900C", "operator": "Southern%20Air%20Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Arthur’s Town – Nassau", "msn": "UB-41", "yom": 1985, "flight_number": "SAC204", "city": "Nassau", "zone": "New Providence", "country": "Bahamas", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8000, "captain_hours_type": 112, "copilot_hours": 568, "copilot_hours_type": 178, "aircraft_hours": 26397, "circumstances": "The occurrence of this accident was notified to the Flight Standards Inspectorate by the Nassau Control Tower. On October 22, 2004 about 1328 eastern daylight time (1828Z) a Beechcraft 1900C, N79YV registered to JODA LLC of Chesterfield Missouri, and operated by Southern Air Charter Limited of Nassau, Bahamas, was ditched. The accident occurred in approximately four (4) feet of water, approximately 82 yards off the southern shoreline of New Providence Island (6.98 nautical miles southeast of the Nassau International Airport). The State of Manufacture of the airframe and engines (United States) was advised of the accident on that day and invited to participate in the investigation. The NTSB as well as the FAA were also notified and subsequently made party to the investigation, as the aircraft was a United States registered aircraft operating on an approved United States 129.14 maintenance program. Visual Meteorological Conditions prevailed at the time and an outbound visual flight plan was on file. N79YV operated as a schedule air commuter on a domestic transport flight. The flight originated from Arthur’s Town, Cat Island Bahamas enroute to Nassau International Airport, Nassau, Bahamas. The airplane sustained substantial damage. The occupants of the aircraft consisted of eight (8) passengers and a crew of two (2). The Pilot in Command held an Airline Transport Pilot rating and the First Officer held a Commercial Pilot rating. Both crews were certificated by the Federal Aviation Administration, (FAA). No serious injuries or fatalities were reported.", "probable_cause": "Failure of the right engine due to fuel exhaustion. No fuel was found in left or right collector tanks. On October 22, 2004 at 6:35 am, a total of 386 gallons of fuel was uplifted, which brought fuel total to 2800 pounds. A total of 3 flights were conducted lasting 29 minutes, 11 minutes and then 21 minutes (for a total of 61 minutes chock to chock time and a usage of 700 pounds of fuel) which brought fuel total down to 2100 pounds. On October 22, 2004 at 8:42am a further 146 gallons of fuel was uplifted. This additional 146 gallons brought fuel total back to 2800 pounds. No additional fuel slips were produced to show any further uplift of fuel. A total of 8 flights including the fateful flight were conducted with this 2800 pounds of fuel. "}