{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200c-super-king-air-coffs-harbour", "date": "May 15, 2003 at 0833 LT", "type": "Beechcraft 200 Super King Air", "operator": "Royal%20Flying%20Doctor%20Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sydney – Coffs Harbour", "msn": "BL-126", "yom": 1985, "flight_number": null, "city": "Coffs Harbour", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 18638, "captain_hours_type": 460, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft impacted the sea or a reef about 6 km north-east of Coffs Harbour airport. The impact occurred immediately after the pilot initiated a go-around during an instrument approach to runway 21 in Instrument Meteorological Conditions (IMC) that included heavy rain and restricted visibility. Although the aircraft sustained structural damage and the left main gear detached, the aircraft remained airborne. During the initial go-around climb, the aircraft narrowly missed a breakwater and adjacent restaurant at the Coffs Harbour boat harbour. Shortly after, the pilot noticed that the primary attitude indicator had failed, requiring him to refer to the standby instrument to recover from an inadvertent turn. The pilot positioned the aircraft over the sea and held for about 30 minutes before returning to Coffs Harbour and landing the damaged aircraft on runway 21. There were no injuries or any other damage to property and/or the environment because of the accident. The aircraft was on a routine aeromedical flight from Sydney to Coffs Harbour with the pilot, two flight nurses, and a stretcher patient on board. The flight was conducted under instrument flight rules (IFR) in predominantly instrument meteorological conditions (IMC). During the descent, the enroute air traffic controller advised the pilot to expect the runway 21 Global Positioning System (GPS) non-precision approach (NPA). The pilot reported that he reviewed the approach diagram and planned a 3-degree descent profile. He noted the appropriate altitudes, including the correct minimum descent altitude (MDA) of 580 ft, on a reference card. A copy of the approach diagram used by the pilot is at Appendix A. The aerodrome controller advised the pilot of the possibility of a holding pattern due to a preceding IFR aircraft being sequenced for an instrument approach to runway 21. The controller subsequently advised that holding would not be required if the initial approach fix (SCHNC)2 was reached not before 0825. At about 0818, the aerodrome controller advised the pilot of the preceding aircraft that the weather conditions in the area of the final approach were a visibility of 5000 m and an approximate cloud base of 1,000 ft. At 0825 the aerodrome controller cleared the pilot of the King Air to track the aircraft from the initial approach fix to the intermediate fix (SCHNI) and to descend to not below 3,500 ft. The published minimum crossing altitude was 3,600 ft. About one minute later the pilot reported that he was leaving 5,500 ft and was established inbound on the approach. At 0828 the pilot reported approaching the intermediate fix and 3,500 ft. The controller advised that further descent was not available until the preceding aircraft was visible from the tower. At 0829 the controller, having sighted the preceding aircraft, cleared the pilot of the King Air to continue descent to 2,500 ft. The pilot advised the controller that he was 2.2 NM from the final approach fix (SCHNF). At that point an aircraft on a 3-degree approach slope to the threshold would be at about 2,500 ft. The controller then cleared the pilot for the runway 21 GPS approach, effectively a clearance to descend as required. The pilot subsequently explained that he was high on his planned 3-degree descent profile because separation with the preceding aircraft resulted in a late descent clearance. He had hand flown the approach, and although he recalled setting the altitude alerter to the 3,500 ft and 2,500 ft clearance limits, he could not recall setting the 580 ft MDA. He stated that he had not intended to descend below the MDA until he was visual, and that he had started to scan outside the cockpit at about 800 ft altitude in expectation of becoming visual. The pilot recalled levelling the aircraft, but a short time later experienced a 'sinking feeling'. That prompted him to go-around by advancing the propeller and engine power levers, and establishing the aircraft in a nose-up attitude. The passenger in the right front seat reported experiencing a similar 'falling sensation' and observed the pilot's altimeter moving rapidly 'down through 200 ft' before it stopped at about 50 ft. She saw what looked like a beach and exclaimed 'land' about the same time as the pilot applied power. The pilot felt a 'thump' just after he had initiated the go-around. The passenger recalled feeling a 'jolt' as the aircraft began to climb. Witnesses on the northern breakwater of the Coffs Harbour boat harbour observed an aircraft appear out of the heavy rain and mist from the north-east. They reported that it seemed to strike the breakwater wall and then passed over an adjacent restaurant at a very low altitude before it was lost from sight. Wheels from the left landing gear were seen to ricochet into the air and one of the two wheels was seen to fall into the water. The other wheel was found lodged among the rocks of the breakwater.During the go-around the pilot unsuccessfully attempted to raise the landing gear, so he reselected the landing gear selector to the 'down' position. He was unable to retract the wing flaps. It was then that he experienced a strong g-force and realised that he was in a turn. He saw that the primary attitude indicator had 'toppled' and referred to the standby attitude indicator, which showed that the aircraft was in a 70-degree right bank. He rapidly regained control of the aircraft and turned it onto an easterly heading, away from land. The inverter fail light illuminated but the pilot did not recall any associated master warning annunciator. He then selected the number-2 inverter to restore power to the primary attitude indicator, and it commenced to operate normally. The pilot observed that the left main landing gear had separated from the aircraft. He continued to manoeuvre over water while awaiting an improvement in weather conditions that would permit a visual approach. About 4 minutes after the King Air commenced the go-around, the aerodrome controller received a telephone call advising that a person at the Coffs Harbour boat harbour had witnessed an aircraft flying low over the harbour, and that the aircraft had '…hit something and the wheel came off'. The controller contacted the pilot, who confirmed that the aircraft was damaged. The controller declared a distress phase and activated the emergency response services to position for the aircraft's landing. Witnesses reported that the landing was smooth. As the aircraft came to rest on the runway, foam was applied around the aircraft to minimise the likelihood of fire. The occupants exited the aircraft through the main cabin door.", "probable_cause": "This occurrence is a CFIT accident resulting from inadvertent descent below the MDA on the final segment of a non-precision approach, fortunately without the catastrophic consequences normally associated with such events. The investigation was unable to conclusively determine why the aircraft descended below the MDA while in IMC, or why the descent continued until CFIT could no longer be avoided. However, the investigation identified a number of factors that influenced, or had the potential to influence, the development of the occurrence."}