{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-52h-155-bw-stratofortress-andersen-afb", "date": "May 19, 2016 at 0830 LT", "type": "Boeing B-52 Stratofortress", "operator": "United%20States%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Andersen - Andersen", "msn": "474412", "yom": 1960, "flight_number": null, "city": "Andersen AFB", "zone": "All Guam Island", "country": "Guam Island", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 796, "captain_hours_type": 387, "copilot_hours": 420, "copilot_hours_type": 195, "aircraft_hours": null, "circumstances": "On 19 May 2016, at 0832 hours local time (L), a B-52H, tail number 60-0047 [Mishap Aircraft (MA)], assigned to the 69th Expeditionary Bomb Squadron, 5th Bomb Wing, Andersen Air Force Base, Guam, departed the prepared-surface overrun of Runway 06 Left (RWY 06L) during a highspeed, heavy-weight, aborted takeoff. The Mishap Crew (MC), which consisted of the Mishap Pilot (MP), Mishap Co-Pilot (MCP), Mishap Radar Navigator (MRN), Mishap Navigator (MN), Mishap Electronic Warfare Officer (MEW), an augment pilot occupying the Mishap Gunner (MG) station, and an Instructor Weapon System Officer occupying the Mishap Instructor Pilot (MIP) jump seat, were conducting a Higher Headquarters Directed mission. The MC were treated for minor injuries consistent with a ground egress. The MA sustained total damage with a loss valued at $112M. There was no damage to private property. The MC were cleared for takeoff at 0831L. The MA accelerated within performance standards verified by takeoff and landing data calculated performance for S1 timing and S1 decision speed. Approximately three to five seconds after reaching the S1 speed of 111 knots, the MP, MCP, and MN observed birds in front of the MA at wing level. Shortly thereafter, the MP and MCP observed engine indications for numbers 5, 6, and 7 “quickly spooling back” from the required takeoff setting. The MP also observed high oil pressure indications on the number 8 engine and a noticeable left-to-right yawing motion. Accelerating through approximately 142 knots, the MP simultaneously announced and initiated aborted takeoff emergency procedures. With the throttles set to idle thrust and airbrakes set to six, the MP initiated continuous braking pressure. The MCP deployed the drag chute at 135 knots. The drag chute failed to inflate properly. At 2,500 feet runway remaining, the MP shut off the outboard engines (numbers 1/2 and 7/8). Shortly thereafter, the MP announced the MA and MC were going to depart the prepared surface. The MEW jettisoned the defensive compartment, starboard-side hatch and the MP shut off the inboard engines (numbers 3/4 and 5/6). The MA departed the prepared surface shearing the main landing gear. The MA finally came to a rest slightly canted from runway centerline, right wing down approximately 300 feet from the runway, and subsequently caught on fire. The MC performed emergency aircraft shutdown procedures and safely egressed the MA through the MEW hatch.", "probable_cause": "The Accident Investigation Board (AIB) President found by a preponderance of the evidence the cause of the mishap was the MP analyzed visual bird activity and perceived cockpit indications as a loss of symmetric engine thrust required to safely attain flight and subsequently applied abort procedures after S1 timing. The AIB President also found by a preponderance of the evidence the following factors substantially contributed to the mishap: drag chute failure on deployment and exceeding brake-energy limits resulting in brake failure."}