{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3c-burbank-3-killed", "date": "Sep 8, 1955 at 0757 LT", "type": "Douglas DC-3", "operator": "Currey Air Transport", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Burbank – Oakland", "msn": "6257", "yom": 1943, "flight_number": "CRR024", "city": "Burbank", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 30, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4500, "captain_hours_type": 1200, "copilot_hours": 2880, "copilot_hours_type": 120, "aircraft_hours": 9849, "circumstances": "This was a nonscheduled flight originating at Burbank, California, for Oakland, California. There were 30 passengers and a crew consisting of Captain Joseph A. Bradsher, Copilot Keith C. Dutson, and Stewardess Utta Jorgensen. Company records indicated that takeoff gross weight was 26,089 pounds (authorized maximum was 26,200 pounds), and the center of gravity of the aircraft was located within prescribed limits. A Defense Visual Flight Rules flight plan was filed; the plane was loaded, taxied to the end of the runway, and its engines were run up. At 0751 the flight was cleared for takeoff from runway 15, to climb westward on top of haze and smoke. It executed a takeoff and climbed in a normal manner into smoke haze, which was more dense toward the south., and in which it was lost to view of observers at the airport. Approximately one minute 2 after takeoff (0752) Flight 24 called the tower and requested an emergency landing clearance. This was granted; runway 7 was suggested by the tower and accepted by the pilot. The airport was cleared of traffic and emergency equipment alerted. At 0755 the tower called repeatedly as the flight had not been sighted. At 0756 the flight called the tower and stated its intent to land on runway \"31.\" Lockheed Air Terminal has no runway 31 but has a runway 33. About this time Flight 24 was sighted by the control tower operator an estimated one mile to the southwest proceeding in a nose-high attitude toward the airport but not aligned with any runway. Across the approach track being used was a powerline about 500 feet short of the airport boundary. As this line approached the nose-high attitude increased and immediately after passing this powerline the aircraft executed a slight left turn, banked 10 to 12 degrees. The left wing then struck a service powerline at the airport boundary. The aircraft stalled, its left wing collided with two parked Air Force C-54's, it cartwheeled, slid across the apron and struck Lockheed Service hangar No. 24, coming to rest in the open doorway of that hangar. The fuselage broke open at a point behind the wing and most of the survivors escaped or were rescued through this opening. Small fires started by the crash were quickly extinguished by personnel of Lockheed's plant protection organization, who also rescued survivors and rendered first aid most efficiently. This organization also guarded the scene and wreckage.", "probable_cause": "On the basis of all available evidence the Board determines that the probable cause of this accident was the captain's irrevocable commitment to a landing without radio or visual confirmation of his runway alignment following engine failure immediately after takeoff. A contributing factor was engine malfunction immediately after takeoff in near minimum visibility. The following findings were reported:\r\n- Overheating of the right engine's rear master rod and loss of much of its bearing metal constituted a failure which foretold imminent internal destruction of that engine,\r\n- Feathering of the right propeller was not accomplished and that propeller continued to rotate (windmill),\r\n- The aircraft when observed approaching the airport had its gear extended, its attitude was excessively nose-high, and it was not aligned with any runway,\r\n- The left wing of the aircraft struck a powerline,\r\n- Forward motion continued; the aircraft stalled and collided successively with two parked Air Force aircraft, the apron, and Lockheed Service Hangar No. 24."}