{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-mt-mauna-loa-10-killed", "date": "Sep 25, 1999 at 1726 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Big%20Island%20Air", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Kona - Kona", "msn": "31-8352039", "yom": 1983, "flight_number": "BIA058", "city": "Mt Mauna Loa", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 11500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4523, "circumstances": "On September 25, 1999, about 1726 Hawaiian standard time, Big Island Air flight 58, a Piper PA-31-350 (Chieftain), N411WL, crashed on the northeast slope of the Mauna Loa volcano near Volcano, Hawaii. The pilot and all nine passengers on board were killed, and the airplane was destroyed by impact forces and a postimpact fire. The sightseeing tour flight was operating under 14 Code of Federal Regulations Part 135 as an on-demand air taxi operation. A visual flight rules flight plan was filed, and visual meteorological conditions existed at the Keahole-Kona International Airport, Kona, Hawaii, from which the airplane departed about 1622. The investigation determined that instrument meteorological conditions prevailed in the vicinity of the accident site.", "probable_cause": "The pilot's decision to continue visual flight into instrument meteorological conditions (IMC) in an area of cloud-covered mountainous terrain. Contributing to the accident were the pilot's failure to properly navigate and his disregard for standard operating procedures, including flying into IMC while on a visual flight rules flight plan and failure to obtain a current preflight weather briefing."}