{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-aurora-2-killed", "date": "Jan 23, 2010 at 1852 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "ENS Corporation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Aurora – Broomfield", "msn": "61-0164-004", "yom": 1974, "flight_number": null, "city": "Aurora-Sugar Grove", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 555, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The visibility at the time of the accident was 1/2 mile with fog and the vertical visibility was 100 feet. A witness stated that the pilot checked the weather, but that he appeared to be in a hurry and took off without performing a preflight inspection of the aircraft. After takeoff, air traffic control instructed the pilot to turn left to a heading of 270 degrees. The pilot reported to the controller that he was at 1,300 feet climbing to 3,000 feet and the controller cleared the pilot to climb to 4,000 feet; the pilot acknowledged the clearance. Witnesses on the ground noted that the airplane was loud; one witness located about 1.5 miles from the departure airport reported that the airplane flew overhead at treetop height. The airplane impacted trees and a residence about 2.3 miles north-northeast of the departure airport. The airplane's turning ground track and the challenging visibility conditions were conducive to the onset of pilot spatial disorientation. Post accident inspection failed to reveal any mechanical failure that would have resulted in the accident. The pilot purchased the airplane about three months prior to the accident; at that time he reported having 72.6 hours of instrument flight experience and 25 hours of multi-engine experience, with none in the accident airplane make and model. After purchasing the airplane, the pilot received 52 hours of flight instruction in the accident airplane in 7 days. Logbook records were not located to establish subsequent flight experience.", "probable_cause": "The pilot's spatial disorientation and subsequent failure to maintain airplane control."}