{"url": "https://www.baaa-acro.com/crash/crash-douglas-26c-25-dt-invader-near-el-jadida-2-killed", "date": "Jan 14, 1954", "type": "Douglas A-26 Invader", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Sidi Slimane - Sidi Slimane", "msn": "18737", "yom": 1943, "flight_number": null, "city": "El Jadida", "zone": "Doukkala-Abda", "country": "Morocco", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4200, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew left Sidi Slimane AFB at 1826LT for a 2,5 hours training flight with two other similar aircraft. After departure, the captain completed the level off at an altitude of 2,000 feet and proceeded to the southwest. Later, while cruising at an altitude of 1,000 feet, the crew completed several maneuvers and circuits then started his way back to Sidi Slimane AFB via Azemmour. Suddenly, the right engine failed. The captain increased power on the left engine that failed shortly later. He attempted to make an emergency landing in a field located near Cap Blanc, about 15 km southwest of El Jadida. After a night descent of 300 feet per minute with its landing gear down, the airplane landed at a speed of 130 knots in a field. After a course of dozen yards, it collided with a rocky wall, lost its both engines and came to rest. First rescuers arrived on site at 0200LT on January 15. Two crew members were killed while two others were seriously injured. \nCrew (based at Laon-Couvron AFB, France):\nCol John Crocker, pilot, †\nCpt Gene Robert, copilot,\n1st Lt Gordon Stewart, navigator, †\nS/Sgt Theo McCool, gunner.", "probable_cause": "The cause of the failure of the right engine could not be determined with certainty. However, it is believed that the failure of the left engine was the result of a mistake on part of the pilot-in-command while trying to complete an emergency maneuver. "}