{"url": "https://www.baaa-acro.com/crash/crash-partenavia-p68b-melbourne-6-killed", "date": "Jul 10, 1978 at 1853 LT", "type": "Partenavia P.68", "operator": "Speedair", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "City", "schedule": "Melbourne - Melbourne", "msn": "65", "yom": 1976, "flight_number": null, "city": "Melbourne-Essendon", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 6, "total_fatalities": 6, "captain_hours": 3512, "captain_hours_type": 2, "copilot_hours": 288, "copilot_hours_type": 34, "aircraft_hours": 819, "circumstances": "The twin engine airplane was engaged in a local training flight at MelBourne-Essendon Airport, carrying one instructor, a pilot under supervision and a pilot's friend as passenger. Shortly after takeoff from runway 26, while climbing to a height of 200-250 feet, the pilot-under-supervision selected the wing flaps up and, at about this time, the pilot-in-command simulated an engine failure of one engine by closing a mixture control-believed to have been the starboard engine. The pilot-under-supervision identified the 'failed' engine, exercised the appropriate engine throttle to signify this identification and indicated the essential actions which would be taken in the event of an actual engine failure. The relevant controls were not operated. Following the completion of these actions full engine power was restored by the pilot-in-command. During the course of the simulated engine failure the aircraft assumed a nose down attitude. It then descended straight ahead with full engine power, passed through electric power cables outside the airport boundary at a height of 4.15 metres above terrain, and crashed into houses 286 metres beyond the western end of the runway. All three occupants were seriously injured while six people on the ground were killed, a seventh was injured as well. ", "probable_cause": "The cause of the accident was that the aircraft became grossly out of trim at a height which did not permit time for the crew to affect recovery. The manner in which the out-of-trim condition occurred has not been determined and the possibility of a trim system malfunction cannot be eliminated. However, the more likely explanation is that the command trim switch was activated unknowingly."}