{"url": "https://www.baaa-acro.com/crash/crash-sud-aviation-se-210-caravelle-10r-stockholm", "date": "Jan 6, 1987 at 0912 LT", "type": "Sud-Aviation SE-210 Caravelle", "operator": "Transwede", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Stockholm - Alicante", "msn": "263", "yom": 1970, "flight_number": null, "city": "Stockholm-Arlanda", "zone": "Uppland", "country": "Sweden", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 21, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11187, "captain_hours_type": 1037, "copilot_hours": 7890, "copilot_hours_type": 680, "aircraft_hours": 34044, "circumstances": "Immediately after liftoff from runway 08, while climbing to a height of about 10 meters, the aircraft pitched down. The copilot confirmed that the airspeed value and the engine indications were normal. The airplane was continuing to 'float' above the runway and the captain decided to land back. The aircraft landed hard on its nose gear and bounced. The second touchdown was completed on both main gears but hard again, causing them to penetrate the wings and the fuel tanks, causing the fuel to spill. Out of control, the aircraft slid for about 300 meters then veered off runway to the left and came to rest in a snow covered field, bursting into flames. All 27 occupants evacuated safely while the aircraft was damaged beyond repair.   ", "probable_cause": "The perception of an unusual climb configuration due to various disturbances forced the crew to abort the takeoff procedure. The following contributing factors were reported: \r\n- An incorrect movement of the pitch immediately after liftoff,\r\n- The presence of nitrogen in the hydraulic lines may affected rudder movements,\r\n- A possible accumulation of ice/snow on the top of the stabilizers may affected the aircraft stability and controllability. "}