{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-227b-near-pine-valley-25-killed", "date": "Mar 3, 1946 at 0812 LT", "type": "Douglas DC-3", "operator": "American-Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "New York – Nashville – Dallas – El Paso – Tucson – San Diego", "msn": "2203", "yom": 1940, "flight_number": "AA6103", "city": "Pine Valley", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 22, "pax_fatalities": 22, "other_fatalities": 0, "total_fatalities": 25, "captain_hours": 6973, "captain_hours_type": 1423, "copilot_hours": 3300, "copilot_hours_type": 1000, "aircraft_hours": 16322, "circumstances": "At 0559LT, the aircraft departed Tucson and routine position reports were subsequently received from the flight over Casa Grande, Gila Bend, and Yuma, Arizona. At 0754, the American Airlines radio operator at San Diego transmitted the 0750 weather report for San Diego: Indefinite ceiling 1,200 feet, broken clouds; visibility 8 miles. Receipt of this information was acknowledged by flight 6103 and immediately thereafter the flight reported that it had been over El Centro, California, at 0753 at 3,000 feet. Los angels Airway Traffic Control delivered a clearance for Flight 6103 to American Airlines radio station at San Diego clearing the flight to San Diego to cruise at 8,000 feet and to cross San Diego at an altitude of at least 500 feet above the overcast. The company station, in turn, attempted to relay the Airway Traffic Control clearance to the flight at 0812, however, after several attempts at establishing contact with the flight, Airway Traffic Control was advised that the clearance as not delivered. All further attempts to contact the flight were unsuccessful. Routine search procedures were initiated immediately and at 1305 aircraft of the Naval Air Control Center at San Diego reported sighting the wreckage of the airplane was spotted on the east slope of Thing Mountain, some 10 miles southeast of Pine Valley. The aircraft was destroyed by impact forces and all 25 occupants were killed. ", "probable_cause": "The probable cause of this accident was the action of the pilot in descending or permitting a descent to be made, into instrument conditions to an altitude below that required to maintain clearance over Thing Mountain. The reason for the descent has not been determined."}