{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-teesside", "date": "Jul 15, 1987 at 0616 LT", "type": "Piper PA-31-310 Navajo", "operator": "Casair Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Teesside – Nantes", "msn": "31-760", "yom": 1971, "flight_number": null, "city": "Teesside", "zone": "Durham", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2769, "captain_hours_type": 900, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft was engaged in a charter flight from Teeside to Nantes, carrying two passengers, two pilots and a load of 250 kilos of cargo, including a container of Type A radioactive material weighing 37 kilos. Takeoff acceleration was normal and the pilot allowed the aircraft to accelerate to 100 mph, some 15 mph above the minimum controllable single-engine speed, before lifting off. Very soon after lift-off he felt a loss of power from the left engine but, believing this to be only a partial failure, decided to continue the take-off and raised the landing gear. He felt the aircraft was still climbing and heard the pilot's assistant say 'I have the rudder'. He then realized that the airspeed was reducing rapidly and that he was losing directional control. He lowered the nose and headed for a grass area to the left of the runway, where the aircraft struck the ground in a steep left bank. All four occupants were quickly rescued, only the pilot was seriously injured. The aircraft was damaged beyond repair. ", "probable_cause": "Loss of power on the left engine during initial climb. A damaged gasket was found in the Lear-Romeo engine driven fuel pump, capable of causing a large fuel leak and allowing air to enter the fuel system. "}