{"url": "https://www.baaa-acro.com/crash/crash-airbus-a300-622r-nagoya-264-killed", "date": "Apr 26, 1994 at 2015 LT", "type": "Airbus A300-600", "operator": "China-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Taipei - Nagoya", "msn": "580", "yom": 1990, "flight_number": "CI140", "city": "Nagoya-Komaki", "zone": "Chūbu", "country": "Japan", "region": "Asia", "crew_on_board": 15, "crew_fatalities": 15, "pax_on_board": 256, "pax_fatalities": 249, "other_fatalities": 0, "total_fatalities": 264, "captain_hours": 8340, "captain_hours_type": 1350, "copilot_hours": 1624, "copilot_hours_type": 1033, "aircraft_hours": 8550, "circumstances": "China Airlines' Flight 140 (from Taipei International Airport to Nagoya Airport), B-1816, took off from Taipei International Airport at 0853 UTC (1753 JST) on April 26, 1994 (hereinafter all times shown are Coordinated Universal Time, unless otherwise specified), canying a total of 271 persons consisting of 2 flight crew members, 13 cabin crew members and 256 passengers (including 2 infants). The flight plan of the aircraft, which had been filed to the Taiwanese civil aviation authorities, Zhongzheng International Airport Office, was as follows: \r\nFlight rule: IFR, Aerodrome of departure: Taipei International Airport, Destination Aerodrome: Nagoya Airport, Cruising speed: 465 knots, Level: FL330, Route: A1 SUCJAKAL-KE-SIV-XMC, total estimated enroute time: 2 hours and 18 minutes, Alternate Aerodrome: Tokyo International Airport.\r\nDFDR shows that the aircraft reached FL330 about 0914 and continued its course toward Nagoya Airport in accordance with its flight plan.\r\nDFDR and CVR show that its flight history during approximately 30 minutes prior to the accident progressed as follows:\r\nThe aircraft which was controlled by the FIO, while cruising at FL330 was cleared at 1047:35 to descend to FL210 by the Tokyo Area Control Center and commenced descent. For about 25 minutes from a few minutes before the aircraft began its descent, the CAP briefed the F/O on approach and landing.\r\nAt 1058:18, communication was established with Nagoya Approach Control. The aircraft began to descend and decreased its speed gradually, in accordance with the clearances given by Approach Control.\r\nAt 1104:03, the aircraft was instructed by Nagoya Approach control to make a left turn to a heading of 010\". Later, at 1107:14, the aircraft was cleared for ILS approach to Runway 34 and was instructed to contact Nagoya Tower. After the aircraft took off from Taipei International Airport, from 0854 when the aircraft had passed 1,000 feet pressure altitude, AP No.2 was engaged during climb, cruise and descent.\r\nAt 1107:22, when the aircraft was in the initial phase of approach to Nagoya airport, AP No. 1 was also engaged. Later, at 1111:36, both AP No. 1 and 2 were disengaged by the FIO. The aircraft passed the outer marker at 1112:19, and at 1113:39, received landing clearance from Nagoya Tower. At this time, the aircraft was reported of winds 290 degrees at 6 knots. Under manual control, the aircraft continued normal LS approach.\r\nAt 1114:05, however, while crossing approximately 1,070 feet pressure altitude, the F/O inadvertently triggered the GO lever. As a result the aircraft shifted into GO AROUND mode leading to an increase in thrust. The CAP cautioned the FIO that he had triggered the GO lever and instructed him, saying \"disengage it\". The aircraft leveled off for about 15 seconds at approximately 1,040 feet pressure altitude (at a point some 5.5 km from the Runway). The CAP instructed the F/O to correct the descent path which had become too high. The F/O acknowledged this. Following the instruction, the F/O applied nose down elevator input to adjust its descent path, and consequently the aircraft gradually regained its normal glide path. During this period, the CAP cautioned to the FIO twice that the aircraft was in GO AROUND Mode.\r\nAt 1114: 18, both AP No.2 and No. 1 were engaged almost simultaneously when the aircraft was flying at approximately 1,040 feet pressure altitude, a point 1.2 dots above the glide slope. Both APs were used for the next 30 seconds. There is no definite record in the CVR of either the crew expressing their intention or calling out to use the AP. For approximately 18 seconds after the  AP was engaged, the THS gradually moved from -5.3\" to -12.3\", which is close to the maximum nose-up limit. The THS remained at -12.3\" until 1115: 1 1. During this period, the elevator was continually moved in the nose-down direction. In this condition, the aircraft continued its approach, and at 1115:02, when it was passing about 510 feet pressure altitude (at a point approximately 1.8 km from the runway), the CAP, who had been informed by the FIO that the THR had been latched, told the FIO that he would take over the controls. Around this time, the THR levers had moved forward greatly, increasing EPR from about 1.0 to more than 1.5. Immediately afterwards, however, the THR levers were retarded, decreasing EPR to 1.3. In addition, the elevator was moved close to its nose-down limit when the CAP took the controls. \r\nAt 1115:11, immediately after the CAP called out \"Go lever\", the THR levers were moved forward greatly once again, increasing EPR to more than 1.6. The aircraft therefore began to climb steeply. The F/O reported to Nagoya Tower that the aircraft would go around, and Nagoya Tower acknowledged this. The aircraft started climbing steeply, AOA increased sharply and CAS decreased rapidly. During this period, the TI-IS decreased from -12.3\" to -7.4\", and SLATS/FLAPS were retracted from 30/40 to 15/15 after the F/O reported \"Go Around to Nagoya Tower.\r\nAt 1115:17, the GPWS activated Mode 5 warning \"Glide Slope\" once, and at 1115:25, the stall warning sounded for approximately 2 seconds.\r\nAt 1115:31, after reaching about 1,730 feet pressure altitude (about 1,790 feet radio altitude), the aircraft lowered its nose and began to dive.\r\nAt 1115:37, the GPWS activated Mode 2 warning \"Terrain, Terrain\" once, and the stall warning sounded from 1115:40 to the time of crash.\r\nAt about 1115:45, the aircraft crashed into the landing zone close to the El taxiway. The accident occurred within the landing zone approximately 110 meters east-northeast of the center of the Runway 34 end at Nagoya Airport. It occurred at about 1115:45. Seven passengers were seriously injured and all 264 other occupants were killed. ", "probable_cause": "While the aircraft was making an ILS approach to Runway 34 of Nagoya Airport, under manual control by the F/O, the F/O inadvertently activated the GO lever, which changed the FD (Flight Director) to GO AROUND mode and caused a thrust increase. This made the aircraft deviate above its normal glide path. The APs were subsequently engaged, with GO AROUND mode still engaged. Under these conditions the FIO continued pushing the control wheel in accordance with the CAP'S instructions. As a result of this, the THS (Horizontal Stabilizer) moved to its full nose-up position and caused an abnormal out-of-trim situation. The crew continued approach, unaware of the abnormal situation. The AOA increased. The Alpha Floor function was activated and the pitch angle increased. It is considered that, at this time, the CAP (who had now taken the controls), judged that landing would be difficult and opted for go-around. The aircraft began to climb steeply with a high pitch angle attitude. The CAP and the FIO did not carry out an effective recovery operation, and the aircraft stalled and crashed.\r\nThe AAIC determined that the following factors, as a chain or a combination thereof, caused the accident:\r\n1. The F/O inadvertently triggered the Go lever. It is considered that the design of the GO lever contributed to it: normal operation of the thrust lever allows the possibility of an inadvertent triggering of the GO lever.\r\n2. The crew engaged the APs while GO AROUND mode was still engaged, and continued approach.\r\n3. The F/O continued pushing the control wheel in accordance with the CAP'S instructions, despite its strong resistive force, in order to continue the approach.\r\n4. The movement of the THS conflicted with that of the elevators, causing an abnormal out-of-trim situation.\r\n5. There was no warning and recognition function to alert the crew directly and actively to the onset of the abnormal out-of-trim condition.\r\n6. The CAP and FIO did not sufficiently understand the FD mode change and the AP override function. It is considered that unclear descriptions of the AFS (Automatic Flight System) in the FCOM (Flight Crew Operating Manual) prepared by the aircraft manufacturer contributed to this.\r\n7. The CAP'S judgment of the flight situation while continuing approach was inadequate, control take-over was delayed, and appropriate actions were not taken. \r\n8. The Alpha-Floor function was activated; this was incompatible with the abnormal out-of-trim situation, and generated a large pitch-up moment. This narrowed the range of selection for recovery operations and reduced the time allowance for such operations. \r\n9. The CAP'S and F/O's awareness of the flight conditions, after the PIC took over the controls and during their recovery operation, was inadequate respectively.\r\n10. Crew coordination between the CAP and the FiO was inadequate.\r\n11. The modification prescribed in Service Bulletin SB A300-22-6021 had not been incorporated into the aircraft.\r\n12. The aircraft manufacturer did not categorise the SB A300-22-602 1 as \"Mandatory\", which would have given it the highest priority. The airworthiness authority of the nation of design and manufacture did not issue promptly an airworthiness directive pertaining to implementation of the above SB. "}