{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-120rt-brasilia-bordeaux-16-killed", "date": "Dec 21, 1987 at 1510 LT", "type": "Embraer EMB-120 Brasília", "operator": "Air%20Littoral", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Brussels - Bordeaux", "msn": "120-033", "yom": 1986, "flight_number": "AF1919", "city": "Bordeaux-Mérignac", "zone": "Gironde", "country": "France", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 13, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": 2394, "captain_hours_type": 101, "copilot_hours": 1326, "copilot_hours_type": 215, "aircraft_hours": 2505, "circumstances": "Following an uneventful flight from Brussels, the crew contacted Bordeaux Approach at 15:01 and was vectored for an ILS approach to runway 23. Visibility was poor with low clouds at 100 feet and a runway visual range (RVR) of between 650 and 350 metres. Flight 1919 crossed the KERAG beacon, the initial approach fix (IAF) at an altitude of FL144, at 15:04:40. Cloud base was still around 100 feet so the crew requested to enter a holding pattern to the south of the airport. The weather conditions slightly improved during the next few minutes and Bordeaux Approach reported a cloud base at 160 feet. Flight 1919 had not reached the holding pattern yet and the pilot decided to attempt to rejoin the ILS. At 15:06:38 the flight was cleared direct to the BD beacon and to descend down to 2000 feet. At the BD beacon, the flight was cleared for final approach and instructed to contact Bordeaux Tower. The airplane had overshot the centreline and was slightly right on the glidepath. Bordeaux Tower then instructed the flight to report over the Outer Marker, which was acknowledged by the captain. After crossing the Outer Marker, the airplane was still not properly established on the ILS. The airplane descended below the glideslope with the crew hurriedly deploying flaps and landing gear. The captain did not contact Bordeaux Tower as requested. Instead he took over control of the airplane, attempting to continue the approach. Both crew members had very little time to adapt to their new roles as the airplane was descending below the glide slope. The descent continued until the aircraft struck tree tops and crashed in the Eysines forrest, about 5 km short of runway. The aircraft was totally destroyed and all 16 occupants were killed. ", "probable_cause": "The accident was the direct result of poorly managed aircraft trajectory.\r\n- The lack of vigilance with respect to altitude, by one pilot and then the other, when they were in a pilot-flying situation (PF, according to the Air Littoral Operations Manual) both when the aircraft descended out of the ILS beam through 2000 feet altitude and when it descended below 220 feet, the decision height.\r\n- Inadequate coordination of tasks between the two pilots who formed the flight crew, neither of which had performed important tasks related to this function, such as monitoring and reporting ILS or altitude deviations, while in a nonpilot-flying situation (PNF, according to the same manual)."}