{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-biddeford-1-killed", "date": "Apr 10, 2011 at 1805 LT", "type": "Cessna 402", "operator": "My Plane", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "White Plains - Portland", "msn": "402B-1218", "yom": 1977, "flight_number": null, "city": "Biddeford", "zone": "Maine", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4735, "captain_hours_type": 120, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6624, "circumstances": "The multi-engine airplane was being repositioned to its base airport, and the pilot had requested to change the destination, but gave no reason for the destination change. Radar data indicated that the airplane entered the left downwind leg of the traffic pattern, flew at pattern attitude, and then performed a right approximate 250-degree turn to enter the final leg of the approach. During the final leg of the approach, the airplane crashed short of the runway into a house located in a residential neighborhood near the airport. According to the airplane's pilot operating handbook, the minimum multi-engine approach speed was 95 knots indicated airspeed (KIAS), and the minimum controllable airspeed was 82 KIAS. According to radar data, the airplane's ground speed was about 69 knots with the probability of a direct crosswind. Post accident examination of the propellers indicated that both propellers were turning at a low power setting at impact. During a controlled test run of the right engine, a partial power loss was noted. After examination of the throttle and control assembly, two o-rings within the assembly were found to be damaged. The o-rings were replaced with comparable o-rings and the assembly was reinstalled. During the subsequent test run, the engine operated smoothly with no noted anomalies. Examination of the o-rings revealed that the damage was consistent with the o-rings being pinched between the corner of the top o-ring groove and the fuel inlet surface during installation. It is probable that the right engine had a partial loss of engine power while on final approach to the runway due to the damaged o-ring and that the pilot retarded the engine power to prevent the airplane from rolling to the right. The investigation found no mechanical malfunction of the left engine that would have prevented the airplane from maintaining the published airspeed.\n", "probable_cause": "The pilot did not maintain minimum controllable airspeed while on final approach with a partial loss of power in the right engine, which resulted in a loss of control. Contributing to the accident was the partial loss of engine power in the right engine due to the improperly installed o-rings in the engine’s throttle and control assembly.\n"}