{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-30-marquise-cairns", "date": "Nov 15, 1983 at 0625 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "North West Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Townsville – Cairns", "msn": "505", "yom": 1970, "flight_number": null, "city": "Cairns", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was established on final by the pilot under check. A 5 knot downwind component prevailed. The flare was commenced higher than is normal and the airspeed decreased below the optimum. The pilot did not react to prompting by the the check-pilot but, at about 20 feet, retarded the throttles. The aircraft struck the runway heavily in a left wing low attitude and the left main and nose landing gear was torn off. Command responsibility for the flight was not discussed and the check-pilot was under the misapprehension that his role was only that of safety pilot. Due to flight rescheduling, the pilot under check slept for only two and a half hours prior to commencing duty. The autopilot was unserviceable and the pilot under check flew the aircraft by hand for most of the four flight legs. During the last leg the check-pilot twice simulated an engine failure. The second failure was simulated on final approach at about 7 DME. Power was reinstated shortly afterwards and the approach continued normally until close to the threshold. At this time the pilot under check had been on duty for five and a half hours and the check-pilot for over twelve hours. Overseas research has shown that subtle errors in visual perception may be induced by an event which causes stress, and that this condition may persist for several minutes after the event. Fatigue may aggravate the problem. The errors in perception are the result of changes in focal length of the lens of the eye caused by the physiological effects of the stress resulting from the event. The experimental research and information from accident data has provided evidence that the effect of the changes in focal length may cause a pilot on final approach to perceive a runway to be on a higher plane than it actually is. In this case, with the particular combination of factors prevailing at the time, it is possible that the imposition of a simulated engine failure on approach within a few minutes prior to the final landing of a long and fatiguing night's operations caused a stress reaction in the pilot under check. The level of stress induced in this fatigued pilot may have been sufficient to cause the kind of perceptual error described above.  The runway would thus appear to the pilot slightly higher than it actually was. His judgement of flare height, being based on this false perception, would therefore be incorrect. ", "probable_cause": "Schedule changed; auto-pilot unserviceable; both pilots fatigued; command responsibility unresolved; pilot under check misjudged flare; check-pilot did not take over in time to recover control. Possible Factor Visual perception errors resulting from stress induced by the pilot's reaction to the simulated engine failure. "}