{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-richmond", "date": "Apr 11, 2011 at 2127 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "AirNet%20Systems", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Richmond - Charlotte", "msn": "31-8052018", "yom": 1980, "flight_number": "SKQ601", "city": "Richmond-Byrd Field", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1948, "captain_hours_type": 31, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17265, "circumstances": "The twin-engine airplane was scheduled for a routine night cargo flight. Witnesses and radar data described the airplane accelerating down the runway to a maximum ground speed of 97 knots, then entering an aggressive climb before leveling and pitching down. The airplane subsequently impacted a parallel taxiway with its landing gear retracted. Slash marks observed on the taxiway pavement, as well as rotation signatures observed on the remaining propeller blades, indicated that both engines were operating at impact. Additionally, postaccident examination of the wreckage revealed no evidence of any preimpact mechanical failures or malfunctions of the airframe or either engine. The as-found position of the cargo placed the airplane within the normal weight and balance envelope, with no evidence of a cargo-shift having occurred, and the as-found position of the elevator trim jackscrew was consistent with a neutral pitch trim setting. According to the airframe manufacturer's prescribed takeoff procedure, the pilot was to accelerate the airplane to an airspeed of 85 knots, increase the pitch to a climb angle that would allow the airplane to accelerate past 96 knots, and retract the landing gear before accelerating past 128 knots. Given the loading and environmental conditions that existed on the night of the accident, the airplane's calculated climb performance should have been 1,800 feet per minute. Applying the prevailing wind conditions about time of the accident to the airplane's radar-observed ground speed during the takeoff revealed a maximum estimated airspeed of 111 knots, and the airplane's maximum calculated climb rate briefly exceeded 3,000 feet per minute. The airplane then leveled for a brief time, decelerated, and began descending, a profile that suggested that the airplane likely entered an aerodynamic stall during the initial climb.\n", "probable_cause": "The pilot’s failure to maintain adequate airspeed during the initial climb, which resulted in an aerodynamic stall and subsequent impact with the ground.\n"}