{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-morristown-5-killed", "date": "Dec 20, 2011 at 1005 LT", "type": "Socata TBM-700", "operator": "Coolstream%20Media", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Teterboro - Atlanta", "msn": "332", "yom": 2005, "flight_number": null, "city": "Morristown", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 1400, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 702, "circumstances": "Although the pilot filed an instrument flight rules flight plan through the Direct User Access Terminal System (DUATS), no evidence of a weather briefing was found. The flight departed in visual meteorological conditions and entered instrument meteorological conditions while climbing through 12,800 feet. The air traffic controller advised the pilot of moderate rime icing from 15,000 feet through 17,000 feet, with light rime ice at 14,000 feet. The controller asked the pilot to advise him if the icing worsened, and the pilot responded that he would let them know and that it was no problem for him. The controller informed the pilot that he was coordinating for a higher altitude. The pilot confirmed that, while at 16,800 feet, \"…light icing has been present for a little while and a higher altitude would be great.\" About 15 seconds later, the pilot stated that he was getting a little rattle and requested a higher altitude as soon as possible. About 25 seconds after that, the flight was cleared to flight level 200, and the pilot acknowledged. About one minute later, the airplane reached a peak altitude of 17,800 feet before turning sharply to the left and entering a descent. While descending through 17,400 feet, the pilot stated, \"and N731CA's declaring…\" No subsequent transmissions were received from the flight. The airplane impacted the paved surfaces and a wooded median on an interstate highway. A postaccident fire resulted. The outboard section of the right wing and several sections of the empennage, including the horizontal stabilizer, elevator, and rudder, were found about 1/4 mile southwest of the fuselage, in a residential area. Witnesses reported seeing pieces of the airplane separating during flight and the airplane in a rapid descent. Examination of the wreckage revealed that the outboard section of the right wing separated in flight, at a relatively low altitude, and then struck and severed portions of the empennage. There was no evidence of a preexisting mechanical anomaly that would have precluded normal operation of the airframe or engine. An examination of weather information revealed that numerous pilots reported icing conditions in the general area before and after the accident. At least three flight crews considered the icing \"severe.\" Although severe icing was not forecasted, an Airmen's Meteorological Information (AIRMET) advisory included moderate icing at altitudes at which the accident pilot was flying. The pilot operating handbook warned that the airplane was not certificated for flight in severe icing conditions and that, if encountered, the pilot must exit severe icing immediately by changing altitude or routing. Although the pilot was coordinating for a higher altitude with the air traffic controller at the time of the icing encounter, it is likely that he either did not know the severity of the icing or he was reluctant to exercise his command authority in order to immediately exit the icing conditions.", "probable_cause": "The airplane’s encounter with unforecasted severe icing conditions that were characterized by high ice accretion rates and the pilot's failure to use his command authority to depart the icing conditions in an expeditious manner, which resulted in a loss of airplane control.\n"}