{"url": "https://www.baaa-acro.com/crash/crash-lockheed-18-56-23-lodestar-king-salmon-6-killed", "date": "Jul 10, 1957 at 0642 LT", "type": "Lockheed 18 LodeStar", "operator": "C.R. Vose Company", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "King Salmon – Anchorage", "msn": "2506", "yom": 1943, "flight_number": null, "city": "King Salmon", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 10000, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4181, "circumstances": "At King Salmon on the morning of July 10, 1957, about 0615, following two weeks in Alaska on a combined business and pleasure trip, Mr. C. R. Vose and party boarded N 45376 as its passengers. The flight crew of the executive Lodestar was Pilot Edward Coligny and Mechanic-Fight Engineer Ralph L. Hughes. The Vose party contemplated a flight to Anchorage, Alaska, the first segment of its return trip to Seattle, Washington. Earlier that morning Mr. Hughes had filed a VFR flight plan to Anchorage which proposed a departure time of 0630 and a routing to Anchorage over Airway Green 8 at an altitude of 6,000 feet. The flight plan also showed that the flight duration would be 1 hour and 40 minutes at a cruising speed of 170 knots and that there was sufficient fuel on board for 6 hours and 30 minutes. At 0638, following a period of engine rump on the parking ramp, the flight called the King Salmon tower for taxi and takeoff information. The duty controller cleared it to runway 11 and furnished the latest wind and altimeter conditions: “Wind east-northeast 8; altimeter 29.90.” There being no other traffic, N 45378 was cleared directly onto runway 11 where several persons saw it pause one to two minutes and heard its propellers run through one or two times. The takeoff was started at 0642 and it seemed entirely normal as the aircraft left the runway surface and climbed to between 75 and 100 feet. The landing gear, however, remained extended. The climb continued normally although somewhat steeper to between 150 and 200 feet, at which time the climb of the aircraft steepened rapidly but smoothly until it was nearly vertical. At the peak of the climb the aircraft pivoted counterclockwise, plunged to the group, and exploded. An intense fuel-fed fire followed. The airport traffic controller alerted the U. S. A. F. emergency equipment located on the base and the fire was quickly extinguished; however, not before the aircraft was nearly destroyed. All six occupants were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the pilot’s action in taking off with the elevator trim tab positioned for landing. The following findings were reported:\r\n- The aircraft was loaded about 1,000 pounds in excess of the allowable gross takeoff weight; however, the load was properly distributed and the excess weight was not a factor in the accident,\r\n- After becoming airborne the aircraft assumed a normal climb attitude to about 100 feet,\r\n- As airspeed increased the climb steepened smoothly but rapidly until the aircraft was climbing in a near vertical nose-up attitude,\r\n- The aircraft stalled at an altitude of between 500 and 700 feet, pivoted counterclockwise, and plunged to the ground in a vertical nose-down attitude,\r\n- Rumination of the cockpit trim tab control indicator and actuating mechanism of the elevator trim tab revealed the tab was set to 17-1/2 units nose-down,\r\n- The above elevator trim tab position is abnormal for any usual flight condition. especially for takeoff, and resulted from a desperate attempt to relieve yoke pressure,\r\n- The rearward yoke pressure resulted from the elevator trim tab being positioned for landing during the takeoff."}