{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-7c-douala-111-killed", "date": "Mar 4, 1962 at 1921 LT", "type": "Douglas DC-7", "operator": "Caledonian_0", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Lourenço Marques – Douala – Lisbon – Luxembourg", "msn": "45160", "yom": 1957, "flight_number": "CA123", "city": "Douala", "zone": "Littoral", "country": "Cameroon", "region": "Africa", "crew_on_board": 10, "crew_fatalities": 10, "pax_on_board": 101, "pax_fatalities": 101, "other_fatalities": 0, "total_fatalities": 111, "captain_hours": 11587, "captain_hours_type": 287, "copilot_hours": 10249, "copilot_hours_type": 227, "aircraft_hours": null, "circumstances": "The aircraft lined up on runway 12 and took at 1820 GMT (night takeoff evening twilight ended at 1756 hours). According to the controller on duty at the control tower the aircraft's landing lights were not on during the take-off. The aircraft lifted off runway 12 after what appeared to be an unusually long run of approximately 2,300 meters (of 2,850 meters available) after release of the brakes and gained height with difficulty. The anti-collision light was seen at a low altitude and the disappeared behind the trees. Five seconds later the sky was lit up by a fire. The left wing and left side of the fuselage struck the first trees of the forest at a height of about 22 meters above the elevation and about 2,300 meters beyond the threshold of runway 30. After the initial impact in a near level flight attitude and with the aircraft slightly banked to port, it then went progressively into a dive with the left wing low and sheared the tops of the trees over a traversed distance of about 130 meters before final impact with the water of a creek. The attitude of the aircraft on final impact was approximately 25° nose down with the same angle of left bank. The aircraft exploded on impact. The fuel and oil spread over the surface of the water and ignited. The fire destroyed the submerged parts of the wreckage. All 111 occupants were killed. ", "probable_cause": "In spite of the very numerous expert examinations and all the tests on the ground and in flight which the Commission of Inquiry has carried out or caused to be carried out, the state of the wreckage and its position in an inundated forest area have prevented the Commission from determining with absolute certainty the cause of the accident to DC-7C G-ARUD. The commission considers, however, that there is evidence to show that an elevator spring-tab mechanism may have jammed before impact. This jamming would have resulted in abnormal elevator control forces during the takeoff. Flight tests have shown this to be consistent with a prolonged takeoff run and a risk of losing height during flap retraction. Furthermore, the following features, all adverse, may have aggravated the circumstances in which the accident occurred: - the implementation of a procedure for gaining speed which was conducive to the aircraft being flown at a low altitude - the fact that a positive rate of climb was not maintained at the time of flap retraction which, in the SABENA procedure applied by Caledonian Airways, is not subject to any altitude limitation other than that of obstacle clearance - the presence in the co-pilot's seat of a check pilot whose attention may have been attracted more by the actions of the first pilot than by the indications on his own instrument panel. The Commission had been unable to eliminate an instrument failure as a possible cause of the accident, as the instruments were not recovered or were too seriously damaged to allow of any valid expert examination."}