{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-12p-moscow-3-killed", "date": "Mar 29, 1951 at 2057 LT", "type": "Ilyushin II-12", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Moscow", "msn": "30019", "yom": 3, "flight_number": null, "city": "Moscow-Vnukovo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1278, "circumstances": "The airplane left Moscow-Vnukovo at 1535LT for a local test flight, carrying eight crew members, pilots and engineers. After departure, the crew lost his orientation due to poor weather conditions. At this time, the ceiling was about 100 meters with an horizontal visibility estimated between 2 and 4 km. Despite the situation, the crew continued the flight and flew over the capital city for few hours, completing the test program. Weather conditions worsened during the flight, the visibility dropped to 400 meters with fog and rain. On a night approach to runway 24, the aircraft was misaligned and the pilot in command decided to make a go around. Few minutes later, while on a second approach to land, the aircraft was too low and hit trees located 1,275 meters short of runway 24, stalled and crashed. The aircraft was destroyed and all eight occupants were seriously injured. The captain, the copilot and the flight engineer died from their injuries few hours later. ", "probable_cause": "It was determined that the crew took the decision to carry a test flight while the weather conditions were below minima. Also, a direction finder was out of service when the crew started the flight, which contributed to the loss of orientation after takeoff. The following factors were considered as contributory: \n- violation of the operator procedures on part of the flying crew, \n- lack of discipline on part of the flying crew, \n- poor weather conditions (below minima),\n- overconfidence and arrogance on part of the captain,\n- violation of the published navigation rules. "}