{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-48ef-east-china-sea-2-killed", "date": "Jul 28, 2011 at 0411 LT", "type": "Boeing 747-400", "operator": "Asiana-Cargo", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Seoul - Shanghai", "msn": "29907/1370", "yom": 2006, "flight_number": "OZ991", "city": "East China Sea", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 14123, "captain_hours_type": 6896, "copilot_hours": 5211, "copilot_hours_type": 492, "aircraft_hours": 28752, "circumstances": "On 28 July 2011, about 04:11 Korean Standard Time), Asiana Airlines flight 991, a B747-400F airplane, HL7604 (hereafter referred to as AAR991), a scheduled cargo flight from Incheon, Republic of Korea, to Shanghai, China, crashed into the international waters about 130 km west of Jeju International Airport (hereafter referred to as Jeju Airport after the flight crew reported a cargo fire to SHI ACC near a reporting point SADLI on airway A593 about 03:54 and attempted to divert to Jeju Airport. Due to the crash impact and fire, the captain and the first officer (FO) were fatally injured, the aircraft was destroyed, and the cargo shipments were damaged, incapable of being recovered, or washed away. AAR991 was a scheduled international cargo flight operated at night under the instrument flight rule in accordance with the Aviation Act of the Republic of Korea and the Convention on International Civil Aviation. The captain and the FO showed up at the flight crew ready room of Asiana Airlines in Incheon International Airport (hereafter referred to as Incheon Airport) an hour before the scheduled time of departure) and signed the \"show-up log,\" respectively. The line mechanic stated that on 28 July, about 02:00, the flight crew arrived at the airplane and that the captain performed the ramp inspection. The loadmaster stated that about 02:15, under the guidance with him, the captain inspected the loaded status of dangerous goods and other shipments in the main deck cargo compartment. The transcript) of ATC radio communications shows that at 03:04:28, AAR991 took off from runway 15L in Incheon Airport. From this moment, the captain) took control of radio communications. At 03:05:48, AAR991 made initial contact with Seoul Area Control Center (SEL ACC) after takeoff and was instructed to climb to 34,000 ft and fly direct to MALPA. At 03:12:19, the flight crew were advised to contact Incheon Area Control Center (ICN ACC). At 03:12:35, AAR991 was climbing to 34,000 ft on a permitted route when it made initial contact with ICN ACC, and at 03:13:05, was allowed to fly direct to NIRAT. At 03:26:05, ICN ACC instructed AAR991 to change its radio frequency to 124.52 MHz. From this moment, the FO mainly assumed control of radio communications, but the captain also occasionally made communication. At 03:26:21, the crew were instructed to fly direct to SADLI, and at 03:50:46, ICN ACC advised AAR991 to contact SHI ACC on frequency 134.0 MHz. At 03:51:15, AAR991 stated that it was maintaining at 34,000 ft and flying direct to SADLI when it made initial contact with SHI ACC. At 03:52:39, SHI ACC instructed AAR991, \"AAR991 radar contact, off-set 5 miles right of track,\" and the flight crew carried out this instruction at 03:52:51. The Aircraft Communications Addressing and Reporting System (ACARS) messages) received by the ground station were as follows: about 03:53, \"EQUIPMENT SMOKE,\" \"EQUIP COOLING,\" and \"CGO DET 11 MN DK\"; and about 03:54, \"CGO DET 6 MN DK\" and \"CGO DET 10 MN DK.\" At 03:54:23, the FO stated, \"Shanghai control, Shanghai control, AAR991 request emergency descent, emergency, declare emergency due to fire main deck. Request descent, and descent to one-zero thousand.\" At 03:54:37, SHI ACC gave AAR991 a descent clearance and instructed it to turn at its discretion, and the FO acknowledged this instruction. The radar data of ICN ACC shows that AAR991 started descending at 03:54:59. At 03:55:08, the FO requested a diversion to Jeju Airport, stating \"We have fire main deck, AAR991, return to Jeju AAR991,\" and SHI ACC approved the request. At 03:58:03, SHI ACC instructed AAR991 to maintain 10,000 ft, however, followed by no response from AAR991. At 03:58:25, SHI ACC requested KAL886 flying near AAR991 to relay any information from AAR991 to SHI ACC. KAL886 stated that AAR991 was descending to 10,000 ft and flying direct to Jeju. According to the radar data of ICN ACC, AAR991 was flying at 16,000 ft at a ground speed of 452 kt on a heading of 345°. At 03:59:13, AAR991 requested a radar vector to Jeju. At 03:59:50, SHI ACC instructed AAR991 to fly heading 045, and AAR991 acknowledged this instruction. At 03:59:26, according to the ATC transcript, the sound of the FO's breathing through an oxygen mask was recorded four times when he communicated with SHI ACC. The last ACARS messages received by the ground station about 04:00 are as follows: \"YAW DAMPER UPR,\" \"RUD RATIO DUAL,\" and \"FLAPS CONTROL.\" At 04:00:23, SHI ACC instructed AAR991 to contact ICN ACC on 124.52 MHz for a radar vector to Jeju, however, AAR991 stated that it was unable to contact on this frequency. Consequently, SHI ACC instructed the crew to monitor frequency 134.0 MHz. The radar data of ICN ACC shows that at 04:01:43, AAR991 was flying at 8,200 ft at a ground speed of 404 kt on a heading of 033°, and after this, AAR991's altitude, ground speed, and heading changed inconsistently. At 04:02:00, SHI ACC instructed AAR991 to contact Fukuoka Area Control Center (FUK ACC) on 133.6 MHz. At 04:02:10, the FO stated, \"AAR991\" and 12 seconds later, added, \"Fukuoka AAR991 mayday mayday mayday, we have cargo fire, request direct to Jeju please,\" followed by no response from FUK ACC. At 04:03:01, the FO called SHI ACC and stated that it was unable to contact FUK ACC. Consequently, SHI ACC instructed AAR991 to pass information to KAL886 and let KAL886 relay the information to FUK ACC and ICN ACC. At 04:03:01, the flight track data of the Incheon radar shows that AAR991's transponder code in Mode 3/A was set to 7700 from 6353 when the aircraft was flying at 8,500 ft at a ground speed of 410 kt on a heading of 027°. At 04:03:24, KAL886 advised AAR991 that it would relay its message to ICN ACC, and the FO stated, \"Yes, now direct Jeju heading 030.\" KAL886 informed AAR991 that SHI ACC gave it heading 045, and the FO acknowledged this instruction. At 04:04:14, SHI ACC instructed KAL886 to use another transmitter to contact ICN ACC on 124.52 MHz, to request heading to Jeju from its present position, and to report back to SHI ACC. Regarding this, KAL886 gave an affirmative response. At 04:05:30, the captain called KAL886, and KAL886 responded, \"Relay from Incheon Control, from Incheon Control, maintain heading 060, radar vector for final, and you may descend to 7,000 ft.\" At 04:05:52, KAL886 again relayed the message, \"Maintain heading 060, radar vector for final, and descend to 7,000 ft,\" followed by the captain's response, \"Descend 7,000 ft.\" Beginning 04:06:25, the captain called \"Korean Air\" twice. At 04:06:30, KAL886 responded, \"Stand by, stand by,\" followed by the captain's statement at 04:06:32, \"Ah… we are now that rudder control is not working and seems to be fired… (jamming).\" At 04:06:41, SHI ACC instructed KAL886 to contact ICN ACC on 124.52 MHz, and at 04:07:16, instructed AAR991 to try contacting KAL886 on 124.52 MHz, followed by the captain's acknowledgement. At 04:07:34, the captain stated, \"We have to open the hatch, hatch.\" Subsequently, KAL886 instructed AAR991 to change its frequency to ICN ACC frequency 124.52 MHz. At 04:08:52, ICN ACC instructed KAL886 to relay the message to AAR991 that JEJ APP established radar contact with AAR991 and that AAR991 should contact JEJ APP on 121.2 MHz. At 04:09:08, KAL886 relayed this message to AAR991. At 04:09:47, the captain said to JEJ ACC, \"Rudder control… flight control, all are not working.\" The FO said to JEJ ACC, \"Did you contact? Uh… do you contact us?\" and JEJ ACC responded, \"AAR991… yes, I can hear you.\" At 04:10:06, the FO stated, \"We have heavy vibration on the airplane, may need to make an emergency landing, emergency ditching,\" and JEJ ACC responded, \"Yes, say again, please.\" He stated, \"Altitude control is not available due to heavy vibration, going to ditch… ah.\" At 04:10:26, JEJ ACC asked AAR991, \"Can you make approach to Jeju?\" and subsequently, tried to contact AAR991 three times, however, followed by no response from AAR991. The aircraft crashed in the East China Sea and both pilots were killed. Debris were found about 130 km west of Jeju. ", "probable_cause": "The Aviation and Railway Accident Investigation Board (ARAIB) determines the cause of this accident as follows:\r\nA fire developed on or near the pallets containing dangerous goods but no physical evidence of the cause of the fire was found. The fire rapidly escalated into a large uncontained fire, and this caused some portions of the fuselage to separate from the aircraft in midair, thereby resulting in the crash.\r\nContributing Factors:\r\n1. Flammable materials like photo-resist (Class 3) were loaded in position ML, and flammable materials like paint, photo-resist, corrosive liquid, and lithium-ion batteries (Class 9) were loaded on one pallet in position PR.\r\n2. It was difficult to contain a large scale of fire only by the fire suppression system of a Class E cargo compartment that was not equipped with an active fire suppression system. "}