{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-83-alexandria", "date": "Apr 20, 2018 at 1420 LT", "type": "McDonnell Douglas MD-83", "operator": "World-Atlantic", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago - Alexandria", "msn": "53093/2066", "yom": 1993, "flight_number": "WAL708", "city": "Alexandria", "zone": "Louisiana", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 94, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13335, "captain_hours_type": 6466, "copilot_hours": 4590, "copilot_hours_type": 2474, "aircraft_hours": 43724, "circumstances": "The airplane suffered a right main landing gear collapse during landing at the destination airport. The airplane sustained substantial damage to the right lower wing skin when it contacted the runway after the landing gear collapse. The crew stopped the airplane on the runway and an emergency evacuation was performed through three of the four doors on the airplane. The escape slide at the left forward door did not deploy or inflate due to the depletion of the gas charge in the reservoir. The reservoir depleted due to a leak in the valve assembly and was not caught during multiple inspections since installation of the slide assembly in the airplane. The landing gear cylinder fractured under normal landing loads due to the presence of a fatigue crack on the forward side of the cylinder in an area subject to an AD inspection for cracks. The most recent AD inspection of the cylinder was performed 218 landings prior when the fatigue crack was large enough to be detectable. A previous AD inspection performed 497 landings prior to the accident also did not detect the crack that would have been marginally detectable at the time.", "probable_cause": "The failure of the right main landing gear under normal loads due to fatigue cracking in an area subject to an FAA Airworthiness Directive that was not adequately inspected."}