{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-uncompahgre-national-forest-9-killed", "date": "Oct 8, 1997 at 0723 LT", "type": "Cessna 208B Grand Caravan", "operator": "Scenic%20Airlines", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Montrose - Page", "msn": "208B-0432", "yom": 1995, "flight_number": null, "city": "Uncompahgre National Forest", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 12900, "captain_hours_type": 1546, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2599, "circumstances": "The airplane departed under visual flight rules (VFR) for a flight over mountainous terrain. It was tracked by radar from the departure area to the accident site. While climbing at the normal rate of climb to 15,400 feet, the airplane abruptly disappeared from radar. The wreckage was located among pine trees and exhibited evidence of a steep flight path angle and damage consistent with a stall/spin event. Investigation revealed no indication of airframe or flight control anomalies, and the powerplant and propeller damage was consistent with engine operation at moderate to high power. Evidence indicated that the airplane was free of airframe ice at impact. Postaccident calculations indicate that the airplane was near the maximum certificated gross weight and aft center of gravity limit. The pilot did not maintain instrument flying currency and reportedly avoided instrument meteorological conditions (IMC). Evidence indicated that the pilot did not use oxygen, as required (when flying above 12,000 feet). Ground observations and satellite and Doppler radar imagery indicated widespread cloudiness over the mountains west of Montrose on the day of the accident. Satellite data showed variable cloud tops higher than the airplane's flight altitude in the vicinity of the accident. The radar plot of the aircraft during the climb above 10,000 feet indicated course changes from the southwest to the northwest, back to the southwest and then a sharp turn to the right just prior to the rapid descent. ", "probable_cause": "the pilot's failure to maintain sufficient airspeed for undetermined reasons while maneuvering the airplane near the maximum gross weight and aft cg in or near instrument meteorological conditions, resulting in the loss of control and entry into a stall/spin. Factors contributing to the accident were the pilot's improper in-flight planning and decision-making and his failure to use proper stall/spin recovery techniques."}