{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-35-marquise-argyle-1-killed", "date": "Sep 1, 2006 at 1115 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Intercontinental Jet", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tulsa - Argyle", "msn": "645", "yom": 1974, "flight_number": null, "city": "Argyle", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 30780, "captain_hours_type": 10000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6642, "circumstances": "Prior to the accident flight, the pilot obtained a preflight weather briefing and filed an instrument flight rules flight plan. The briefer noted no adverse weather conditions along the route. The airplane departed the airport at 0853, and climbed to FL190. The first two hours of the flight was uneventful, and the aircraft was handed off to Jacksonville Air Route Traffic Control Center (ZJX ARTCC) at 1053. The pilot contacted ZJX Crestview sector at 1054:45 with the airplane level at FL190. At 1102, the Crestview controller broadcasted an alert for Significant Meteorological Information (SIGMET) 32E, which pertained to thunderstorms in portions of Florida southwest of the pilot's route. At 1103, the controller cleared to the airplane to descend to 11,000 feet and the pilot again acknowledged. At 1110:21, the pilot was instructed to contact Tyndall Approach. The pilot checked in with the Tyndall RAPCON North Approach controller at 1110:39. The pilot was told to expect a visual approach. Shortly thereafter, the pilot transmitted, \"...we're at 11,000, like to get down lower so we can get underneath this stuff.\" The controller told the pilot to stand by and expect lower [altitude] in 3 miles. About 15 seconds later, the controller cleared to pilot to descend to 6,000 feet, and the pilot acknowledged. At 1112:27, the pilot was instructed to contact Tyndall Approach on another frequency. The airplane's position at that time was just northwest of REBBA  intersection. The Panama sector controller cleared the pilot to descend to 3,000 feet at his discretion, and the pilot acknowledged. There was no further contact with the airplane. The controller attempted to advise the pilot that radar contact was lost, but repeated attempts to establish communications and locate the airplane were unsuccessful. A witness, located approximately 1 mile south of the accident site, reported he heard a \"loud bang,\" looked up and observed the airplane in a nose down spiral. The witness reported there were parts separating from the airplane during the descent. The witness stated it was raining and there  was lightning and thunder in the area. Local authorities reported that the weather \"was raining real good with lightning and the thunderstorm materialized very  quickly.\" The main wreckage came to rest near the edge of a swamp in tree covered and high grassy terrain. The left wing, left engine, and the left wing tip tank were located in a wooded area approximately 0.6 miles northwest of the main wreckage. The left wing separated from the airplane inboard of the left engine and nacelle. Examination of the fracture surfaces indicated that both the front and rear spars failed from \"catastrophic static up-bending overstress...\" The airplane flew through an intense to extreme weather radar echo containing a thunderstorm. Although the controllers denied that there was any weather displayed ahead of the airplane, recorded radar and display data indicated that moderate to extreme precipitation was depicted on and near the route of flight. During the flight, the pilot was given no real-time information on the weather ahead. The airplane was equipped with a weather radar system and the system provided continuous en route weather information relative to cloud formation, rainfall rate, thunderstorms, icing conditions, and storm detection up to a distance of 240 miles. No anomalies were noted with the airframe and engines.", "probable_cause": "The pilot's inadvertent flight into thunderstorm activity that resulted in the loss of control, design limits of the airplane being exceeded and subsequent in-flight breakup. A contributing factor was the failure of air traffic control to use available radar information to warn the pilot he was about to encounter moderate, heavy, and extreme precipitation along his route of flight."}