{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-beechjet-400-mt-lavender-9-killed", "date": "Dec 11, 1991 at 0941 LT", "type": "Beechcraft Beechjet 400", "operator": "Bruno%27s", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Mountains", "schedule": "Rome - Huntsville", "msn": "RJ-57", "yom": 1989, "flight_number": null, "city": "Mt Lavender", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 17000, "captain_hours_type": 600, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Before takeoff, an IFR flight plan was filed for a 15 minutes flight from Rome, GA, to Huntsville, AL. Takeoff was commenced at 0937 est with the copilot flying the aircraft. After a VFR takeoff, the captain contacted Atlanta Center to obtain an IFR clearance. The controller advised that other traffic was in the area and instructed the flight to remain VFR (while an IFR clearance was being arranged). At that time, the flight reported at 1,300 feet in VFR conditions. While waiting for an IFR clearance, the crew became concerned about higher terrain and low ceilings. At about 0940, the captain directed the copilot to fly 'back to the right.' Approximately one minute later, the CVR stopped recording and radio contact was lost with the aircraft. Later, the aircraft was found where it had collided with the top of Mt Lavender. Elevation of the crash site was approximately 1,580 feet msl. The aircraft was not equipped with a ground proximity warning system. All nine occupants were killed, among them  Angelo J. Bruno, the chairman of Bruno's Inc. company; his brother, Lee J. Bruno, vice chairman; Sam A. Vacarella, senior vice president for merchandising; Edward C. Hyde, vice president for store operations, and R. Randolph Page Jr., vice president for personnel.", "probable_cause": "The captain's decision to initiate visual flight into an area of known mountainous terrain and low ceilings and the failure of the flightcrew to maintain awareness of their proximity to the terrain."}