{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-virgin-gorda", "date": "Feb 11, 2017 at 2004 LT", "type": "Cessna 402", "operator": "Tropical Transport Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Charlotte Amalie – Virgin Gorda", "msn": "402C-0603", "yom": 1982, "flight_number": null, "city": "Virgin Gorda", "zone": "All British Virgin Islands", "country": "British Virgin Islands", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5458, "captain_hours_type": 809, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was flying from St Thomas in the US Virgin Islands to Virgin Gorda (VIJ) in the British Virgin Islands. There were eight passengers on board, together with the pilot. It was the pilot’s eleventh flight of the day, and his fourth flight to Virgin Gorda. All these flights were short, with the longest flight being about 40 minutes duration and the shortest just a few minutes. The flight from St Thomas to Virgin Gorda took 35 minutes. The weather in Virgin Gorda was excellent with a light easterly wind and little cloud. The pilot commenced his approach to Virgin Gorda using his usual turning and configuration points. The aircraft touched down normally on runway 03 and the pilot retracted the flaps before applying the brakes. The brakes responded, although the pilot commented that the right brake did not seem to respond as positively as he expected. The pilot reapplied the brakes but the left brake pedal “flopped to the floor”. Judging he had insufficient room to abort the landing, the pilot continued to pump the brakes which he did not consider to be responding. He shut down the engines before the aircraft left the paved surface, struck signage and then a low wall before coming to rest on a bank. The pilot vacated the aircraft through the side window and then opened the main door to allow the passengers to exit the aircraft. None of the occupants was injured. The aircraft was extensively damaged.", "probable_cause": "The aircraft landed at Virgin Gorda in conditions (of weight, altitude, temperature and surface condition) where the landing distance required was very close to the landing distance available and without the required safety margin. Hence, when the performance of the brakes was not as expected, probably due to debris in the braking system, the aircraft could not be stopped on the runway. Analysis of the maintenance state of the aircraft involved in this accident indicated that the maintenance capability, processes and planning of its operator were not consistent with the standards expected in conducting international passenger charter services. This appeared also to be the case for the operational procedures and data management."}