{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-800-kingston", "date": "Dec 22, 2009 at 2222 LT", "type": "Boeing 737-800", "operator": "American-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Washington DC - Miami - Kingston", "msn": "29550/1019", "yom": 2001, "flight_number": "AA331", "city": "Kingston-Norman Manley (Palisadoes)", "zone": "Kingston City District", "country": "Jamaica", "region": "Central America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 148, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "American Airlines Flight AA331, a Boeing 737-823 in United States registration N977AN, carrying 148 passengers, including three infants, and a crew of six, was being operated under the provisions of 14 Code of Federal Regulations (CFR) Part 121. The aircraft departed Miami (KMIA) at 20:22 Eastern Standard Time (EST) on 22 December 2009 (01:22 Universal Coordinated Time (UTC) on 23 December 2009) on an instrument flight rules (IFR) flight plan, on a scheduled flight to Norman Manley International Airport (NMIA), ICAO identifier: MKJP, Kingston, Jamaica. The aircraft landed at NMIA on runway 12 in the hours of darkness at 22:22 EST (03:22 UTC) in Instrument Meteorological Conditions (IMC) following an Instrument Landing System (ILS) approach flown using the heads up display (HUD) and becoming visual at approximately two miles from the runway. The aircraft touched down at approximately 4,100 feet on the 8,911 foot long runway in heavy rain and with a 14 knot left quartering tailwind. The crew was unable to stop the aircraft on the remaining 4,811 feet of runway and it overran the end of the runway at 62 knots ground speed. The aircraft broke through a fence, crossed above a road below the runway level and came to an abrupt stop on the sand dunes and rocks between the road and the waterline of the Caribbean Sea. There was no post-crash fire. The aircraft was destroyed, its fuselage broken into three sections, while the left landing gear collapsed. The right engine and landing gear were torn off, the left wingtip was badly damaged and the right wing fuel tanks were ruptured, leaking jet fuel onto the beach sand. One hundred and thirty four (134) passengers suffered minor or no injury, while 14 were seriously injured, though there were no life-threatening injuries. None of the flight crew and cabin crew was seriously injured, and they were able to assist the passengers during the evacuation.", "probable_cause": "Jamaican Director General of Civil Aviation Col. Oscar Derby, stated in the week following the accident, that the jet touched down about halfway down the 8,910-foot (2,720 m) runway. He also noted that the 737-800 was equipped with a head-up display. Other factors that were under investigation included \"tailwinds, and a rain soaked runway;\" the runway in question was not equipped with rain-dispersing grooves common at larger airports. The aircraft held a relatively heavy fuel load at the time of landing; it was carrying enough fuel for a round trip flight back to the US. The FDR later revealed that the aircraft touched down some 4,100 feet (1,200 m) down the 8,910-foot (2,720 m) long runway. Normally touchdown would be between 1,000 feet (300 m) and 1,500 feet (460 m).  The aircraft was still traveling at 72 miles per hour (116 km/h) when it departed the end of the runway. The aircraft landed with a 16 miles per hour (26 km/h) tailwind, just within its limit of 17 miles per hour (27 km/h)."}