{"url": "https://www.baaa-acro.com/crash/crash-cessna-501-citation-i-birmingham", "date": "Nov 19, 2010 at 1535 LT", "type": "Cessna 501 Citation I", "operator": "Frandley Aviation Partnership", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Belfast - Birmingham", "msn": "501-0178", "yom": 1981, "flight_number": null, "city": "Birmingham", "zone": "West Midlands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7200, "captain_hours_type": 3000, "copilot_hours": 1785, "copilot_hours_type": 735, "aircraft_hours": null, "circumstances": "The flight crew reported for duty at Liverpool Airport at 0845 hrs. Their original task was to fly to Belfast City Airport, collect a transplant organ, and take it to Cambridge Airport. However, on their arrival at Belfast the transfer was no longer required, so they were given a new task to fly to Belfast Aldergrove Airport and collect an organ to carry to Birmingham Airport. The aircraft departed Belfast Aldergrove at 1450 hrs with the co-pilot as pilot flying. The flight was uneventful and the aircraft was given a radar vector to intercept the ILS for a straight-in approach to Runway 15 at Birmingham. The Runway 15 ILS course is 149°M. The autopilot was engaged and the aircraft was flying on a track of 135°M, 13 nm from the touchdown zone and at a groundspeed of 254 kt, when it crossed the localiser centreline. The aircraft then turned right onto a corrective track but once again passed through the localiser course. Further corrections were made and the aircraft passed through the localiser once more before becoming established at 5 nm. The co-pilot later reported that, because the autopilot was not capturing the localiser, he had disconnected it and flown the approach manually. When the aircraft was at 10 nm, the radar controller broadcast a message advising of the presence of a fog bank on final approach and giving RVRs of 1,400 m at touchdown and in excess of 1,500 m at both the mid-point and stop end. The airfield was sighted by the commander during the approach but not by the co-pilot. A handover to the tower frequency was made at around 8 nm. When the aircraft was at 6 nm, landing clearance was given and acknowledged. The tower controller then advised the aircraft that there was a fog bank over the airfield boundary, together with the information that the touchdown RVR was 1,400 m. The commander responded, saying: “WE’VE GOT ONE END OF THE RUNWAY”. The aircraft was correctly on the localiser and the glideslope at 4 nm. The Decision Altitude (DA) of 503 feet amsl (200 feet aal) for the approach was written on a bug card mounted centrally above the glare shield. Both pilots recollected that the Standard Operating Procedure (SOP) calls of “500 above” and “100 above” DA were made by the commander. However, neither pilot could recall a call of ‘decision’ or ‘go-around’ being made. At between 1.1 nm and 0.9 nm, and 400 feet to 300 feet aal, the aircraft turned slightly to the right, onto a track of 152°M. This track was maintained until the aircraft struck the glideslope antenna to the right of the runway some 30 seconds later (see Figure 3, page 11). The aircraft came to rest in an upright position on the grass with a fire on the left side. The co-pilot evacuated through the main cabin door, which is located on the left side of the fuselage, and suffered flash burns as he passed through the fire. The commander was trapped in the cockpit for a time.", "probable_cause": "The co-pilot’s task of flying the approach would have become increasingly demanding as the aircraft descended and it is probable that his attention was fully absorbed by this. This was confirmed by his erroneous perception that the aircraft was in IMC from below 2,000 feet amsl. The co-pilot reported that during the final stages of the approach, when he noticed he had lost the localiser indication, he had asked the commander whether he should go around. The response he reported he heard of “no, go left” was not what he had expected, and may correspond to the time from which no further control inputs were made. The commander could not recall having given any instructions to the co-pilot after the ‘100 feet above’ call. It is likely that the crew commenced the approach with an expectation that it would be completed visually. However, the weather conditions were unusual and the aircraft entered IMC unexpectedly, late in the approach. As an aircraft gets closer to a runway the localiser and glideslope indications become increasingly sensitive and small corrections have a relatively large effect. The task for the flying pilot becomes more demanding and the role of the monitoring pilot has greater significance. A successful outcome relies on effective crew co-ordination, based on clear SOPs. The monitoring of this approach broke down in the latter stages and the crucial ‘decision’ call was missed, which led to the aircraft’s descent below minima. \n"}