{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-daytona-beach-1-killed", "date": "May 25, 2009 at 0846 LT", "type": "Rockwell Shrike Commander 500", "operator": "Commonwealth Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Daytona Beach - New Smyrna Beach", "msn": "500-3162", "yom": 1963, "flight_number": null, "city": "Daytona Beach", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1470, "captain_hours_type": 574, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3360, "circumstances": "The pilot departed in the twin-engine airplane with an unknown quantity of fuel and a fuel quantity indicating system that was known to be inaccurate. Immediately after takeoff, approximately 1/2 mile beyond the departure end of the runway, witnesses reported the engine noise from the accident airplane as \"surging\" as the airplane passed overhead, and one witness described a \"radical\" turn back to the airport. Two witnesses stated that only one engine was running, and added that it was \"revving,\" and would then stop before revving up again. During the descent to the airport, radar data showed the airplane at 93 knots 700 feet and 1 mile from the runway, and at 90 knots at 500 feet and 1/2 mile from the runway, but the airplane crashed prior to the approach end of the runway. Post accident examination of the wreckage revealed no evidence of a pre accident mechanical malfunction. The fuel system had a capacity of 226 gallons, was serviced through a single port on top of the left wing, and the tanks were interconnected to a center fuel sump that fed both engines. The fuel cells were opened through access panels and each was intact and contained only trace amounts of fuel. The airplane was leveled, the drain petcock was opened at the center fuel cell sump, and 1 quart of fuel was drained.", "probable_cause": "A total loss of engine power due to fuel exhaustion as a result of the pilot’s inadequate preflight inspection."}