{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-near-julian-2-killed", "date": "Oct 26, 2000 at 1058 LT", "type": "Cessna 340", "operator": "Marko%20Foam%20Products", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Mountains", "schedule": "Santa Ana – Calexico", "msn": "340A-0538", "yom": 1978, "flight_number": null, "city": "Julian", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 20000, "captain_hours_type": 180, "copilot_hours": 338, "copilot_hours_type": null, "aircraft_hours": 3182, "circumstances": "During en route cruise flight at an assigned altitude of 11,000 feet (msl) in instrument meteorological conditions, the airplane impacted mountainous terrain at 5,300 feet, in wings level, descending flight. During the final 12 minutes of the flight (from 1046 to 1058 Pacific daylight time), recorded military search radar height values (primary radar returns) show the aircraft in a steady descent from 11,000 feet to 5,600 feet, where radar contact was lost. During the same time interval, recorded Mode C altitudes received at Los Angeles Air Traffic Control Center (Center) and SoCal Terminal Radar Approach Control (TRACON) indicated the aircraft was level at 11,000 feet. At 1055:49, when the pilot was handed off from SoCal TRACON to Los Angeles Center, the pilot checked in with the Center \". . . level at one one thousand.\" At 1057:28, the pilot asked the Center controller \"what altitude you showing us at\" to which the controller responded \"not receiving your mode C right now sir.\" At 1057:37, the pilot transmitted \"o k we'd like to climb to vfr on top, our uh altimeter just went down to uh fifty three hundred.\" The controller approved the pilot's request to climb to VFR conditions on-top and, at 1057:54, the pilot responded \"roger we're out.\" No further transmissions were received from the aircraft. The airplane was equipped with a single instrument static pressure system with two heated static ports. The static system and static system instruments were damaged or destroyed by impact and post-crash fire sufficiently to preclude post-accident testing.", "probable_cause": "Total blockage of the instrument static system due to ice."}