{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dash-8-301-governors-harbour", "date": "Apr 20, 2007 at 1708 LT", "type": "De Havilland DHC-8-300 (Dash-8)", "operator": "Bahamasair-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nassau – Governor’s Harbour", "msn": "159", "yom": 1989, "flight_number": "UP353", "city": "Governor's Harbour, Eleuthera Island", "zone": "Central Eleuthera", "country": "Bahamas", "region": "Central America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 48, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 29570, "circumstances": "Following an uneventful flight (service UP353) from Nassau, the crew started the descent to Governor’s Harbour. After landing on runway 15, the left main gear collapsed. The aircraft slid for few dozen metres then turn slightly to the left and came to rest on the main runway. All 51 occupants evacuated safely, nevertheless, few passengers suffered minor injuries. The aircraft was damaged beyond repair. ", "probable_cause": "The probable Cause has been determined as an over-center Torque Link condition that culminated in a single cycle failure of the cylinder. The over center torque links condition occur as a result of the over extension of the shock strut.\r\nPossible Contributory factors to the over extension of the shock strut includes:\r\nPossible Cause for Loss of Damping\r\n• The failure to install the dampening ring when the landing gear was assembled.\r\n• Improper servicing of the landing gear shock strut with Mil-H-5606 hydraulic fluid plus nitrogen during initial assembly.\r\n• Improper servicing of landing gear shock strut during line maintenance and inadequate post servicing follow up per AMM Chapter 12. See attached report Appendix A-30 From Bombardier\r\n• Under-serviced shock strut (low oil volume)\r\n• A broken damper ring\r\n• No damper ring\r\n• Disengaged damper ring."}