{"url": "https://www.baaa-acro.com/crash/crash-gippsland-ga8-airvan-lady-barron", "date": "Oct 15, 2010 at 1715 LT", "type": "GippsAero GA8 Airvan", "operator": "Flinders%20Island%20Aviation%20Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Lady Barron - Bridport", "msn": "GA8-05-075", "yom": 2005, "flight_number": null, "city": "Lady Barron", "zone": "Tasmania", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2590, "captain_hours_type": 1355, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was conducting a charter flight from Lady Barron, Flinders Island to Bridport, Tasmania with six passengers on board. The aircraft departed Lady Barron Aerodrome at about 1700 Australian Eastern Daylight-saving Time and entered instrument meteorological conditions (IMC) several minutes afterwards while climbing to the intended cruising altitude of about 1,500 ft. The pilot did not hold a command instrument rating and the aircraft was not equipped for flight in IMC. He attempted to turn the aircraft to return to Lady Barron Aerodrome but became lost, steering instead towards high ground in the Strzelecki National Park in the south-east of Flinders Island. At about 1715, the aircraft exited cloud in the Strzelecki National Park, very close to the ground. The pilot turned to the left, entering a small valley in which he could neither turn the aircraft nor out climb the terrain. He elected to slow the aircraft to its stalling speed for a forced landing and, moments later, it impacted the tree tops and then the ground. The first passenger to exit the aircraft used the aircraft fire extinguisher to put out a small fire that had begun beneath the engine. The other passengers and the pilot then exited the aircraft safely. One passenger was slightly injured during the impact; the pilot and other passengers were uninjured. During the night, all of the occupants of the aircraft were rescued by helicopter and taken to the hospital in Whitemark, Flinders Island.", "probable_cause": "Contributing safety factors: \r\n• The weather was marginal for flight under the visual flight rules, with broken cloud forecast down to 500 ft above mean sea level in the area. \r\n• The pilot, who did not hold a command instrument rating, entered instrument meteorological conditions because he was adhering to an un-written operator rule not to fly below 1,000 ft above ground level. \r\n• The pilot became lost in cloud and flew the aircraft towards the Mt Strzelecki Range, exiting the cloud in very close proximity to the terrain. \r\n• The aircraft exited the cloud in a small valley, within which the pilot could neither turn round nor out-climb the terrain. \r\nOther key findings:\r\n• The aircraft exited cloud before impacting terrain and with sufficient time for the pilot to execute a forced landing. \r\n• The design of the aircraft’s seats, and the provision to passengers in the GA-8 Airvan of three-point automotive-type restraint harnesses with inertia reel shoulder straps contributed to the passengers’ survival, almost without injury. \n"}