{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-i-near-petersburg-1-killed", "date": "Jun 4, 2013 at 1531 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Pacific-Wings", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Petersburg - Petersburg", "msn": "1290", "yom": 1958, "flight_number": null, "city": "Petersburg-James A. Johnson", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4841, "captain_hours_type": 1465, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 34909, "circumstances": "The pilot reported that the accident flight was his fourth flight and the third tour flight of the day in a float-equipped airplane. The weather had deteriorated throughout the day with lowering ceilings, light rain, and fog on the mountain ridges. The pilot said that when approaching a mountain pass, he initiated a climb by adding a “little bit” of flap (about 1 pump of the flap handle actuator) but did not adjust the engine power from the cruise power setting. He noted his airspeed at 80 knots, with a 200-feet-per-minute climb on the vertical speed indicator. He was having difficulty seeing over the cowling due to the nose-high attitude, when he suddenly noticed trees in his flight path. He initiated an immediate left turn; the airplane stalled, and began to drop, impacting the mountainous, tree-covered terrain. A passenger reported that the weather conditions at the time of the accident consisted of tufts of low clouds, and good visibility. They did not enter the clouds at any time during the flight. He reported that the airplane made a left turn, stalled, and then made a sharp left turn right before impact. The airplane seemed to be operating fine, and he heard no unusual sounds, other than the engine speed seemed to increase significantly right before impact. The pilot reported that there were no preaccident mechanical anomalies that would have precluded normal operation, and the postaccident examination of the airframe and engine revealed no evidence of mechanical malfunctions or failures that would have precluded normal operation.", "probable_cause": "The pilot’s failure to maintain adequate altitude above the trees, and his subsequent failure to maintain adequate airspeed while maneuvering to avoid the trees, which resulted in an\r\ninadvertent aerodynamic stall/spin and an uncontrolled descent. "}