{"url": "https://www.baaa-acro.com/crash/crash-dornier-do28d-2-skyservant-san-pablo-1-killed", "date": "Sep 9, 2000 at 1751 LT", "type": "Dornier DO.28D Skyservant", "operator": "Rentacorp", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Manta - San Pablo", "msn": "4342", "yom": 1979, "flight_number": null, "city": "San Pablo-Coaselsa", "zone": "Imbabura", "country": "Ecuador", "region": "South America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6234, "circumstances": "The airplane departed Manta-Eloy Alfaro Airport at 1711LT on a cargo flight to San Pablo, carrying one passenger, two pilots (among them an instructor) and a Load consisting of 70 boxes of shrimp larvae. En route, while cruising at an altitude of 5,000 feet, the right engine suffered power fluctuations. The instructor pilot switched on the auxiliary fuel pump and changed the fuel mixture but the engine problems persisted. On final approach to San Pablo, the right engine failed and the crew continued the approach on one engine. Following a high approach, the aircraft landed too far down the runway, about 292 metres from the runway end. It bounced and landed firmly six metres further. Realizing that the runway distance available was insufficient, the instructor pilot decided to initiate a go-around procedure. The aircraft climbed to a height of about 20 metres then impacted ground 140 metres to the right of the runway centreline and 26 metres past the runway end. The copilot was killed and both other occupants were seriously injured. ", "probable_cause": "The instructor pilot's decision to initiate a go-around procedure after landing in the last third portion of the runway with the right engine inoperative, an insufficient runway length and an aircraft's weight that required to stay on the ground. The following contributing factors were identified:\r\n- The decision of the crew to continue the flight after the failure of the right engine that required an immediate landing,\r\n- The crew failed to follow the checklist, \r\n- Failure of the instructor pilot to proceed to an adequate approach briefing,\r\n- Wrong approach configuration, \r\n- Lack of awareness about the runway's characteristics on part of the pilot-in-command,\r\n- The total weight of the aircraft was above the permissible limit, \r\n- Lack of crew coordination,\r\n- The crew mistakenly feathered the left propeller."}