{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-90-30-riyadh", "date": "May 8, 2009 at 1558 LT", "type": "McDonnell Douglas MD-90", "operator": "Saudia", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jeddah - Riyadh", "msn": "53513/2257", "yom": 1999, "flight_number": "SVA9061", "city": "Riyadh-King Khaled", "zone": "Manţiqat ar Riyāḍ (منطقة الرياض)", "country": "Saudi Arabia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A Saudi Arabian Airlines MD-90 was substantially damaged during a runway excursion accident Riyadh (RUH). The seven crew members escaped unhurt. The airplane operated on a repositioning flight from Jeddah. During the flight, the captain discussed the use of manual spoilers during landing with the first officer. He further stated that; as he \"had only around 400 hours in the aircraft\" as a captain, he wanted to \"see the effect' of landing with manual spoilers. He further explained that the flight provided an opportunity to \"do it manually\" (use manual spoilers) as it was a repositioning flight and, the weather and dry runway conditions were ideal. As such, he discussed the procedure with the first officer and elected to land with the auto ground spoiler system unarmed. The flight was uneventful. During the approach to Riyadh the Landing Checklist was completed, which included the arming of the auto ground spoiler system for landing. After the Landing Checklist was completed, the captain disarmed the auto ground spoiler system with the intention of applying manual ground spoilers after landing. The auto braking system was also not armed prior to landing. The final approach and touchdown to runway 15 Left at Riyadh were uneventful. The touchdown airspeed was 135 knots calibrated air speed (CAS). On touchdown, the captain manually extended the spoiler/speed brake lever, but did not latch it in the fully extended (EXT) position (fully aft and latched upwards). The captain then removed his right hand from the speed brake lever in order to deploy the thrust reversers. The first officer noted the movement of the spoiler/speed brake lever and called \"Spoilers Deployed\". Since the spoiler/speed brake lever was not fully pulled aft and latched upwards, the lever automatically returned to the forward retracted (RET) position. This movement of the spoiler/speed brake lever was not noticed by the captain and the first officer. In response, the ground spoilers re-stowed before being fully deployed and, a speed brake/flap configuration (SPD BRK/FLP CONFIG) Level 1 Amber Alert occurred. This alert occurred as the aircraft was not yet fully weight on wheels (WOW) and the aircraft still sensed a flight condition with speed brakes deployed and flaps extended beyond six degrees. Six seconds after touchdown on the right main landing gear, the nose gear touched down and the aircraft transferred to a ground condition (WOW on nose gear and main wheel spin up). The SPD BRK/FLP CONFIG alert extinguished when the nose gear oleo actuated ground shift on landing. After touchdown, the aircraft banked to the right and began to drift right of the runway centerline. In response, he applied left rudder, deployed the thrust reversers and applied left aileron. But this did not have any noticeable effect. The captain saw the approaching G4 taxiway exit and in an attempt to keep the aircraft from leaving the runway surface beyond the G4 taxiway exit, he decided to direct the aircraft towards the taxiway. He then applied a right rudder input which caused the aircraft to commence a rapid sweeping turn to the right towards the G4 taxiway exit. The aircraft left the runway at high speed, traversed the full width of the G4 taxiway, and exited the surface at its southern edge. The aircraft then entered a sand section and travelled the distance infield between the edge of the G4 taxiway and the adjacent section of taxiway GOLF. The left main landing gear collapsed during this time. The aircraft came to rest on taxiway GOLF. There was no post impact fire.", "probable_cause": "Cause Related Findings\r\n1. The Captain decided to land with manual ground spoilers when the auto ground spoiler system was fully operational.\r\n2. The initiative by the Captain to conduct this improvised exercise contravened the Standard Operating Procedures (SOPs) and the Flight Operations Policy Manual (FOPM).\r\n3. The auto ground spoiler system was disarmed prior to landing.\r\n4. The spoiler/speed brake lever was partially applied manually after landing.\r\n5. The spoiler/speed brake lever was released before it was fully extended and latched.\r\n6. The spoiler/speed brake lever automatically retracted as per design.\r\n7. The ground spoilers never fully deployed.\r\n8. The loss of lift and aircraft deceleration were greatly reduced by the lack of ground spoiler deployment.\r\n9. Brakes were not used in an attempt to control or slowdown the aircraft.\r\n10. The Captain applied a large right rudder input with the intention of directing the aircraft onto the G4 taxiway exit.\r\n11. The aircraft exited the runway at high speed and was travelling too fast to successfully negotiate the right turn onto the G4 taxiway."}