{"url": "https://www.baaa-acro.com/crash/crash-boeing-307-stratoliner-saigon", "date": "May 22, 1961 at 1148 LT", "type": "Boeing 307 Stratoliner", "operator": "Aigle-Azur-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Saigon – Vientiane", "msn": "1995", "yom": 1940, "flight_number": null, "city": "Saigon", "zone": "Thành phố Hồ Chí Minh City District", "country": "Vietnam", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 24, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 20251, "captain_hours_type": 3000, "copilot_hours": 15000, "copilot_hours_type": 8000, "aircraft_hours": null, "circumstances": "Shortly after takeoff from Saigon-Tan Son Nhat Airport, while climbing, the crew informed ground about the failure of the engine n°4 and was cleared to return for a safe landing. At this time, the visibility was estimated between 500 and 1,000 meters. While returning to the airport, the crew was informed about the deterioration of the weather conditions with a visibility reduced to 80 meters and strong winds. In such conditions, the captain decided to attempt a go around when the airplane banked right and crashed near the runway 25 threshold. All 28 occupants were evacuated safely while the aircraft was damaged beyond repair. ", "probable_cause": "The direct cause seems to derive mainly from the sudden worsening of the atmospheric conditions. The violence of the storm was definitely localized in the approach of the squall and in the squall. Whirling winds, three quarters front and then full crass, were the cause of the displacement of the aircraft to the right in spite of the efforts of the pilot, who felt that No. 3 engine was not yielding it. full power. The subsequent downdraft and rain forced the aircraft down, caused it to lose altitude and brought it to the ground. The reapplication of power, effected at an altitude of approximately 250 to 300 ft, and 25 to 30 seconds from the beginning of the runway, occurred late. In identical weather conditions, if the pilot had re-applied power as soon as he received the QBI and QAM (latest MET observation) he had requested from the tower, the aircraft would have been at an altitude of approximately 560 to 600 ft and one minute and twenty seconds from the runway, at a distance of 4 km. It would have met the squall in higher altitude and speed conditions that would have avoided the aircraft's being brought to the ground. The following factors had an aggravating effect although they were not direct causes of the accident: \r\n- QBI was first announced by the tower while the aircraft was at 1 500 ft in a rear wind. The pilot and the radio operator stated that they did hot hear it at that time. However, a playback of the recorded tape definitely included the voice of the radio operator answering: \"Aerodrome is QBI; all right\". Had the pilot known of the QBI condition at that time, he would probably have requested a QAM and would have been in a better position to make a prompt decision to reapply power,\r\n- The second report of appearance of smoke, the origin of which could not be detected on board, distracted the attention of the crew from the controls for a fraction of a second, causing them to apprehend danger from the holds. The load was 660 kg heavier than that submitted by the company. The airline should have reweighed the baggage instead of relying on the weights shown on the packages and on the manifest drawn up and filed"}