{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-squamish-2-killed", "date": "Jul 28, 2005 at 0840 LT", "type": "Beechcraft 200 Super King Air", "operator": "Northern%20Thunderbird%20Air", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Plain, Valley", "schedule": "Vancouver – Smithers", "msn": "BB-190", "yom": 1976, "flight_number": "NT202", "city": "Squamish", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2700, "captain_hours_type": 100, "copilot_hours": 1200, "copilot_hours_type": 80, "aircraft_hours": null, "circumstances": "A Raytheon Beechcraft King Air 200 (registration C-FCGL, serial number BB190) operating as NTA202 (Northern Thunderbird Air), departed Vancouver, British Columbia, at 0824 Pacific daylight time on 28 July 2005 for a visual flight rules flight to Smithers, British Columbia, with a crew of two on board. The aircraft did not arrive at its destination, and a search was commenced later that same day. The aircraft was found on 30 July 2005. The crash site was in a narrow canyon at an elevation of about 3900 feet above sea level, in an area of steeply rising terrain. Both occupants were fatally injured. A post-crash fire destroyed most of the aircraft. The emergency locator transmitter was destroyed in the fire and no signal was detected. The crash occurred at about 0840 Pacific daylight time. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The aircraft was flown up a narrow canyon into rapidly rising terrain for reasons that could not be determined. The aircraft’s proximity to terrain and the narrowness of the canyon precluded a turn, and the aircraft’s climb rate was insufficient to clear the rising terrain.\r\n2. The pilot decision-making training received by the crew members was ineffective because they were unprepared for the unique hazards and special operating techniques associated with flying low in mountainous terrain.\r\nFinding as to Risk:\r\n1. The company operations manual (COM) gave no guidance to the crew for the operation of a visual flight rules (VFR) flight, except for the provision that it should not be conducted closer to obstacles than 500 feet vertically and horizontally. "}