{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-40-solitaire-napa-2-killed", "date": "Mar 11, 2004 at 2035 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Ronald S. Scott", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Imperial – Napa", "msn": "405", "yom": 1979, "flight_number": null, "city": "Napa", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4546, "captain_hours_type": 1651, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4119, "circumstances": "The airplane entered a descending turn while on a night visual approach and impacted a river. At 2030, the pilot reported leaving 6,000 feet, and stated that he had the airport in sight. The controller cleared him for the approach. He advised the controller that he would like to cancel his IFR clearance, and switch to the traffic advisory frequency. The controller cleared him to switch to advisory frequency. No further transmissions were recorded from the flight. According to radar data, the airplane was southeast of the airport, and maintaining a westerly heading south of the airport. At 2035, it crossed a river, and began a sharp left turn away from the airport. It completed about 90 degrees of turn before abruptly disappearing from radar contact, with the last radar target on the west side of the river near the impact location. The highly fragmented wreckage was recovered from the river after several weeks underwater. The teardown and examination of the engines disclosed that the left engine was not rotating or operating at the time of impact, and the left propeller was in feather. The type and degree of damage to the right engine was indicative of engine rotation and operation at the time of impact. Investigators found no pre-existing condition on either engine, or with the airframe systems, that would have interfered with normal operation, or explained the apparent shutdown of the left engine.", "probable_cause": "The pilot's failure to maintain control of the airplane following a shutdown of the left engine during a night visual approach. A factor contributing to the accident was the dark night."}