{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-tulsa", "date": "Dec 9, 2004 at 1831 LT", "type": "Beechcraft 200 Super King Air", "operator": "RNH Air 1", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "La Crosse – Tulsa", "msn": "BB-856", "yom": 1981, "flight_number": null, "city": "Tulsa", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2089, "captain_hours_type": 469, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3084, "circumstances": "The 2,100-hour instrument-rated private pilot stated that prior to departure for a 507 nautical mile cross-country flight, the fuel gauges indicated approximately 800 pounds of fuel on each side for a total of 1600 pounds; however, he did not visually check the amount of fuel that the tanks contained. During his approach to the destination airport, the right engine started to \"sputter\" before it finally quit. The pilot then \"looked over at the fuel gauges and both tanks were showing empty.\" The left engine quit just a few moments later. The auto ignition installed in the airplane attempted to restart the engines. The engines restarted momentarily and then shut-off once more. The pilot declared an emergency and executed a forced landing onto a street below. After a hard landing onto the street, the right wing hit a telephone pole, and the left wing then hit several tree limbs before the airplane impacted a hill and came to a stop. The Federal Aviation Administration (FAA) inspector, who responded to the accident site, found the fuel transfer switch in the \"right-crossfeed\" position. The fuel system was examined and no leaks or anomalies were found. Approximately three-quarters of a gallon of unusable fuel was found in the right engine nacelle. Approximately four gallons (28 pounds) of usable fuel was found in the left engine nacelle. ", "probable_cause": "The loss of engine power due to fuel exhaustion as a result of the pilot's inadequate preflight and in-flight planning / preparation."}