{"url": "https://www.baaa-acro.com/crash/crash-antonov-26-100-abidjan-4-killed", "date": "Oct 14, 2017 at 0823 LT", "type": "Antonov AN-26", "operator": "Valan%20ICC", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Ouagadougou – Abidjan", "msn": "32 04", "yom": 1975, "flight_number": "Kondor 26", "city": "Abidjan", "zone": "Lagunes", "country": "Ivory Coast", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 7, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 23766, "captain_hours_type": 10133, "copilot_hours": 2250, "copilot_hours_type": 2080, "aircraft_hours": null, "circumstances": "The airplane departed Ouagadougou on a flight to Abidjan, carrying seven passengers, three crew members and military equipment on behalf of the French Army (antiterrorist operation 'Barkhane'). On approach to Abidjan-Félix Houphouët-Boigny Airport, the crew encountered poor visibility due to heavy rain falls. On short final, the aircraft descended below MDA, impacted water and crashed in the sea few hundred metres short of runway 03. Six occupants were rescued while four others including all three crew members were killed. The aircraft was destroyed. At the time of the accident, weather conditions were below minimums. ", "probable_cause": "The probable cause of this accident is the continuation of the approach below minimums without having established formal visual contact with runway references and without adequate monitoring of the aircraft's glide path. The rigorous application of the company SOPs should have necessarily led to a go-around.\r\nThe following factors contributed to the accident:\r\n- Underestimation of adverse weather conditions below minimums;\r\n- A lack of knowledge of the environment of Abidjan airport and insufficient awareness of the aircraft's vertical position;\r\n- Inadequate monitoring of aircraft instruments and flight path (altitude and speed) in degraded weather conditions;\r\n- A high workload due to continued final approach training and distraction from tasks not related to flight operations;\r\n- Disabling EGPWS audible alerts due to unwanted alarms;\r\n- Crew resource management (CRM) probably unbalanced by the authority of the PNF over the rest of the crew.\r\n- Strict non-compliance with company SOPs."}