{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-2h6-mt-san-vicente-65-killed", "date": "Aug 9, 1995 at 2014 LT", "type": "Boeing 737-200", "operator": "Aviateca", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Miami – Guatemala City – San Salvador – Managua – San José", "msn": "23849", "yom": 1987, "flight_number": "GU901", "city": "Mt San Vicente (Chichontepec)", "zone": "San Vicente", "country": "Salvador", "region": "Central America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 58, "pax_fatalities": 58, "other_fatalities": 0, "total_fatalities": 65, "captain_hours": 9828, "captain_hours_type": null, "copilot_hours": 4696, "copilot_hours_type": null, "aircraft_hours": 16645, "circumstances": "Following an uneventful flight from Guatemala City, the crew was cleared to start the descent to San Salvador-Comalapa Airport but encountered poor visibility due to the night and heavy rain falls. In thunderstorm activity, the crew was cleared to modify his route while descending to the airport. After being cleared to descend to 5,000 feet, the GPWS alarm sounded. The captain applied full power when the aircraft struck trees and crashed in a dense wooded area located on the Mt San Vicente (Chichontepec Volcano - 2,181 metres high), about 25 km northeast from runway 25 threshold. The aircraft disintegrated on impact and all 65 occupants were killed. ", "probable_cause": "The probable cause of the accident was the flight crew's lack of situational awareness in relation to the 7,159 foot obstruction, the flight crew's decision to descend below the MSA while deviating from a published transition or approach, and the ambiguity of position information between both the flight crew and the air traffic controller which resulted in the controller's issuance of an altitude assignment that did not provide terrain clearance. Contributing to the accident was the failure of the First Officer to direct his concern of reported positions to the Captain in a more direct and assertive manner and the failure of the controller to recognize the aircraft's reported position relative to obstructions and give appropriate instructions/warnings. An ineffective CRM program at Aviateca also contributed to the accident."}