{"url": "https://www.baaa-acro.com/crash/crash-yakovlev-yak-40-mt-airy-tash-21-killed", "date": "Sep 3, 1970 at 2126 LT", "type": "Yakovlev Yak-40", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Frunze - Khujand", "msn": "9 91 05 03", "yom": 1969, "flight_number": "SH-4", "city": "Mt Airy Tash", "zone": "Sughd Province", "country": "Tajikistan", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 18, "pax_fatalities": 18, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1020, "circumstances": "The airplane departed Frunze Airport, Kirghizistan, at 2024LT bound to Leninabad, Tajikistan, carrying 18 passengers and a crew of three. Weather conditions were considered as good and the crew reached the assigned altitude of 5,700 meters. En route, the crew failed to realize the airplane deviated from the prescribed flight path to the west and informed ATC he passed over the cities of Namangan and Kokand. At 2121LT, ATC based at Leninabad cleared the crew to descent to 3,300 meters then 2,100 meters without knowing the exact position of the airplane. By night, at a speed of 500 km/h, the airplane struck the slope of Mt Airy Tash (2,300 meters high) located about 90 km northeast of Leninabad. The airplane disintegrated on impact and all 21 occupants were killed. First accident involving a Yak-40.", "probable_cause": "Poor flight planning, erroneous in-flight decisions and navigation errors on part of the flying crew caused the aircraft to be off-course at the time of the accident, resulting in a controlled flight into terrain. The following contributing factors were reported: \r\n- Lack of ATC assistance who failed to properly check the exact position of the aircraft before clearing the crew to descent to 2,100 meters over mountains terrain, \r\n- ATC failed to use properly the different navaids, poor ATC coverage, \r\n- Both pilots were relatively inexperienced on this type of aircraft as they were recently qualified on Yak-40 type, \r\n- Lack of experience in IFR flight and by night, \r\n- Despite the fact that the captain had already been disciplined for serious violations of flight rules, he had recently been allowed to fly with passengers on night flights on this type of aircraft."}