{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-dayton-1-killed", "date": "Dec 7, 2004 at 0140 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Tiffin%20Aire", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Knoxville – Dayton", "msn": "31-7405436", "yom": 1974, "flight_number": null, "city": "Dayton-James M. Cox", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3800, "captain_hours_type": 350, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9900, "circumstances": "The pilot was conducting a cargo flight in night instrument meteorological conditions, and was cleared for the ILS Runway 6L approach. The pilot reported that he was established on the localizer, and the control tower stated that the touchdown and mid-point \"RVR\" was 1,800 feet, and the roll-out \"RVR\" was 1,600 feet. The pilot also was instructed, and acknowledged, to make a right turn off the runway, after landing. There were no further communications from the airplane. The airplane's last radar target was observed at an altitude of 1,200 feet msl, and a ground speed of 130 knots. The airplane impacted trees, and came to rest inverted on airport property, on a bearing of 053 degrees, and a distance of 1/2 mile to the runway. Examination of the airplane did not reveal any pre-impact mechanical failures. A weather observation taken at the airport about the time of the accident included, winds from 140 degrees at 9 knots, 1/8 mile visibility, runway 06L visual range variable between 1,800, and 2,000 feet in fog, vertical visibility 100 feet, and a temperature and dew point 54 degrees F. The airport elevation was 1,009 feet msl. Review of the approach diagram for the ILS Runway 6L approach revealed a decision height of 1,198 feet msl, and an approach minimum of 1,800 feet runway visual range (RVR), or 1/2 mile visibility. The pilot had accumulated about 3,800 hours of total flight experience, which included about 350 hours in the same make and model as the accident airplane, and 250 total hours logged in instrument meteorological conditions.", "probable_cause": "The pilot's failure to maintain adequate altitude\\clearance while on approach, which resulted in an in-flight collision with trees. Factors in the accident were the fog and low ceiling conditions."}