{"url": "https://www.baaa-acro.com/crash/crash-lockheed-kc-130t-hercules-near-itta-bena-16-killed", "date": "Jul 10, 2017 at 1549 LT", "type": "Lockheed C-130 Hercules", "operator": "USMC.png", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Plain, Valley", "schedule": "Cherry Point - El Centro", "msn": "5303", "yom": 1992, "flight_number": "Yanky 72", "city": "Itta Bena", "zone": "Mississippi", "country": "United States of America", "region": "North America", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": 2614, "captain_hours_type": null, "copilot_hours": 822, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed MCAS Cherry Point-Cunningham Field in the early afternoon on a personnel transfer mission to El Centro NAS, California. En route, while cruising at an altitude of 20,000 feet, the n°4 blade on the engine n°2 detached, struck the left side of the fuselage, penetrated the cabin, then the right side of the fuselage and eventually impacted the right stabilizer that detached. The aircraft suffered a catastrophic structural failure, causing the cockpit to separate and detach. The airplane entered an uncontrolled descent and crashed in a soybean field located 11 km southwest of Itta Bena. The airplane was destroyed by impact forces and a post crash fire and all 16 occupants were killed. \r\nCrew:\r\nMaj Caine M. Goyette, pilot, \r\nCpt Sean E . Elliott, copilot,\r\nS/Sgt Joshua Snowden, flight engineer,\r\nSgt Owen J . Lennon, flight engineer.\r\nG/Sgt Mark A. Hopkins, gunnery\r\nG/Sgt Brendan C . Johnson, gunnery\r\nSgt Julian M. Kevianne, crewmaster,\r\nL/Cpl Daniel I. Baldassare, crewmaster. \r\nPassengers:\r\nCpl Collin J. Schaaff\r\nS/Sgt William J. Kundrat,\r\nS/Sgt Robert H. Cox, \r\nS/Sgt Talon R. Leach,\r\nSgt Chad E . Jenson,\r\nSgt Joseph J . Murray,\r\nSgt Dietrich A. Schmiernan,\r\nPO Ryan Lohrey.", "probable_cause": "The investigation determined the cause of the mishap to be an inflight departure of the number four blade from the number two propeller. This propeller blade (P2B4) liberated while the aircraft was flying at a cruise altitude of 20,000 feet . The liberation of P2B4 initiated the catastrophic sequence of events resulting in the midair breakup of the aircraft and its uncontrollable descent and ultimate destruction. Post- mishap analysis of P2B4 revealed that a circumferential fatigue crack in the blade caused the fracture and liberation. This fatigue crack propagated from a radial crack which originated from intergranular cracking (IGC) and corrosion pitting. The analysis also revealed the presence of anodize coating within the band of corrosion pitting and intergranular cracking on the blade near the origin of the crack. This finding proves that the band of corrosion pitting and intergranular cracking was present and not removed during the last overhaul of P2B4 at Warner Robins Air Logistics Complex (WR-ALC) in the fall of 2011. The investigation concluded that the failure to remediate the corrosion pitting and intergranular cracking  was due to deficiencies in the propeller blade overhaul process at WR-ALC which existed in 2011 and continued up until the shutdown of the WR-ALC propeller blade overhaul process in the fall of 2017. The investigation also examined whether any operational or intermediate level maintenance inspections or maintenance actions exist which could have detected the underlying causal conditions prior to the mishap. The investigation concluded that while these inspections exist, it cannot be quantifiably determined that these inspections would have detected the causal condition. The investigation arrived at this conclusion due to the fact that the growth or propagation rate of an IGC radial crack cannot be predicted. Though no evidence exists to determine when the radial crack had grown to a detectable area, beyond the bushing, there exists a distinct possibility that it could have been detected if the radial crack had grown past the bushing and the off wing eddy current inspection was performed. "}