{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-17g-ve-flying-fortress-raf-binbrook", "date": "Jul 25, 1989 at 1330 LT", "type": "Boeing B-17 Flying Fortress", "operator": "IGN", "flight_phase": "Takeoff (climb)", "flight_type": "Cinematography", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Binbrook - Binbrook", "msn": "8552", "yom": 1944, "flight_number": null, "city": "Binbrook AFB", "zone": "Lincolnshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 10, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11179, "captain_hours_type": 2131, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During the takeoff roll, after about 100 yards, a slight swing to the left developed, which the commander (who was the handling pilot) corrected by partially retarding the power on engines n°3 and 4, and by the use of rudder. Full power was then re-applied on all engines, but the aircraft started to swing to the right. The pilot throttled back engine n°1 and 2, together with the application of rudder, but these actions were not immediately effective. The aircraft did not resume a straight course until it was on the grass to the right of the runway. Knowing that the B17 had been operated from grass runways, the commander elected to continue with the take-off. However, after some 400-500 yards the aircraft swung further to the right, by which time the speed was 90-95 mph. The commander then became aware that the aircraft's path was obstructed by a tree and a pile of gravel. The left wing tip struck the tree and the n°4 propeller struck the gravel. The aircraft yawed to the right, crossed a hollow in the ground and landed in a cornfield beyond. The fuselage broke in two and a fire erupted. All 10 occupants were rescued, among them five were injured, two seriously. The aircraft was totally destroyed by fire. ", "probable_cause": "The commander was subsequently unable to provide any explanation for the accident, although he suggested that the n°1 engine turbo-compressor may have been 'cutting in and out'. He also considered that the right wheel brake may not have been completely free. One eye witness, an engineer who was familiar with B17 aircraft, saw smoke emanating from the area of the n°3 engine at the start of the take-off. This led him to venture the opinion that this engine may have over-boosted and then suffered a power loss, thus causing the sequential left and right swings."}