{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-naples", "date": "Dec 19, 2020 at 1216 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Plane Fun Inc.", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Sarasota - Key West", "msn": "46-8508095", "yom": 1985, "flight_number": null, "city": "Naples", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3462, "captain_hours_type": 890, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3462, "circumstances": "After takeoff from his home airport with about 50 gallons of fuel in each fuel tank, the pilot climbed to 7,000 ft and proceeded to his destination. When he was about halfway there, he switched from the right fuel tank to the left fuel tank. Immediately after switching fuel tanks, the engine started to sputter and lost power. The pilot switched back to the right fuel tank but there was no change. He then tried different power settings, adjusted the mixture to full rich and switched tanks again without regaining engine power. The pilot advised air traffic control (ATC) that he was having an engine problem and needed to land at the nearest airport. ATC instructed him contact the control tower at the nearest airport and cleared him to land. The pilot advised the controller that he was not going to be able to make it to the airport and that he was going to land in the water. During the water landing, the airplane came to a sudden stop. The pilot and his passenger then egressed, and the airplane sank. An annual inspection of the airplane had been completed about 2 months prior to the accident and test flights associated with the annual inspection had all been done with the fuel selector selected to the right fuel tank, and this was the first time he had selected the left fuel tank since before the annual inspection. The airplane was equipped with an engine monitor that was capable of recording engine parameters. Examination of the data revealed that around the time of the loss of engine power, exhaust gas temperature and cylinder head temperature experienced a rapid decrease on all cylinders along with a rapid decrease of turbine inlet temperature, which was indicative of the engine being starved of fuel. Examination of the wreckage did not reveal any evidence of any preimpact failures or malfunctions of the airplane or engine that would have precluded normal operation. During examination of the fuel system, the fuel selector was observed in the RIGHT fuel tank position and was confirmed to be in the right fuel tank position with low pressure air. However, when the fuel selector was positioned to the LEFT fuel tank position, continuity could not be established with low pressure air. Further examination revealed that a fuel selector valve labeled FERRY TANK was installed in the left fuel line between the factory-installed fuel selector and the left fuel tank. The ferry tank fuel selector was observed to be in the ON position, which blocked continuity from the left fuel tank to the engine. Continuity could only be established when the ferry tank fuel selector was positioned to the OFF position. With low pressure air, no continuity could be established from the ferry tank fuel line that attached to the ferry tank’s fuel selector. The ferry tank fuel selector valve was mounted between the pilot and copilot seats on the forward side of the main wing spar in the area where the pilot and copilot would normally enter and exit the cockpit. This location was such that the selector handle could easily be inadvertently kicked or moved by a person or object. A guard was not installed over the ferry tank fuel selector valve nor was the selector valve handle safety wired in the OFF position to deactivate the valve even though a ferry tank was not installed. Review of the airplane’s history revealed that about 3 years before the accident, the airplane had been used for an around-the-world flight by the pilot and that prior to the flight, a ferry tank had been installed. A review of maintenance records did not reveal any logbook entries or associated paperwork for the ferry tank installation and/or removal, except for a copy of the one-page fuel system schematic from the maintenance manual with a handwritten annotation (“Tank”), and hand drawn lines, both added to it in blue ink. A review of Federal Aviation Administration records did not reveal any record of a FAA Form 337 (Major Repair or Alteration) or a supplemental type certificate for installation of the ferry tank or the modification to the fuel system.", "probable_cause": "The inadvertent activation of the unguarded ferry tank fuel selector valve, which resulted in fuel starvation and a total loss of engine power.\n"}