{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-north-adams-1-killed", "date": "Aug 4, 1994 at 1605 LT", "type": "Beechcraft 100 King Air", "operator": "Westchester Air", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "North Adams – White Plains", "msn": "B-119", "yom": 1972, "flight_number": null, "city": "North Adams-Harriman and West", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10200, "captain_hours_type": 106, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10426, "circumstances": "The airplane had undergone routine maintenance for slow acceleration on the right engine. Maintenance records revealed the fuel controls were changed from the right engine to the left engine. The airplane was released back to the pilot for service, and he departed for his home station. Several witnesses saw the airplane after takeoff at a low altitude, and at a slow speed. The airplane turned left, and the left wing struck the ground. Two witnesses saw the airplane pass by them at a low altitude, and wrote, '...at this point we could see the left (port) engine propeller was turning very slowly. You could actually see the individual blades of the propeller turning.' A complete disassembly of both engines, revealed no discrepancies other than impact, and post impact fire damage. Disassembly of the left propeller indicated  that the propeller blades were at or near feather at impact. The pilot had a total of 106 flight hours in Beech A100 aircraft, all in the 90 days prior to the accident, and 56 hours in the 30 days prior to the accident.", "probable_cause": "The pilot's failure to maintain minimum control speed after an undetermined loss of engine power, which resulted in an inadvertent stall at too low of an altitude to allow recovery. "}