{"url": "https://www.baaa-acro.com/crash/crash-boeing-247d-cheyenne-12-killed", "date": "Oct 7, 1935 at 0219 LT", "type": "Boeing 247", "operator": "United-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Oakland – Salt Lake City – Denver – Cheyenne", "msn": "1698", "yom": 1935, "flight_number": "UA004", "city": "Cheyenne", "zone": "Wyoming", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Denver, the crew initiated the approach to Cheyenne Airport. The visibility was poor due to the night and marginal weather conditions. Too low, the airplane impacted the top of a hill, continued for about 300 metres and crashed, bursting into flames. All 12 occupants were killed.", "probable_cause": "Whether or not the pilot was flying entirely on instruments, the question still arises as to why he was flying so close to the ground at the point of first contact with the ground. It is possible that the copilot in giving their position as Silver Crown could have done so having observed that the airplane was approaching Silver Crown. The pilot, hearing this over the interphones, might have taken this literally and started losing altitude factor or sooner than he should have from actual location. Another possibility is that the pilot misread his altimeter and as a consequence was actually flying at a much lower altitude than he believed. An additional 1,000 feet of altitude at the point of the accident would have placed the airplane in suitable position for a normal power glide to the airport for a landing. It is the opinion of the Accident Board that the probable cause of this accident was an error on the part of the pilot in judging his altitude or his distance from the airport, or both."}