{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-near-castalia-4-killed", "date": "Jun 7, 2019 at 1331 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Gregory G. Boll", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Naples - Easton", "msn": "46-36431", "yom": 2007, "flight_number": null, "city": "Castalia", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 312, "captain_hours_type": 147, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1449, "circumstances": "The pilot departed on the cross-country flight with the airplane about 730 lbs over its maximum gross weight. While in cruise altitude at 27,000 ft mean sea level (msl), the pilot reported to air traffic control that he observed weather on his radar along his route and ahead of his position. The areas of weather included thunderstorms with cloud tops up to 43,000 ft msl. The controller acknowledged the weather; however, she did not provide specifics to the pilot, including the size and strength of the area of precipitation or cloud tops information, nor did she solicit or disseminate any pilot reports related to the conditions, as required. The airplane entered an area of heavy to extreme precipitation, likely a thunderstorm updraft, while in instrument meteorological conditions. Tracking information indicated that the airplane climbed about 300 ft, then entered a right, descending spiral and broke up in flight at high altitude. The recovered wreckage was found scattered along a path about 2.6 miles in length. Both wings separated, and most of the empennage was not located. The airplane was likely about 148 lbs over the maximum allowable gross weight at the time of the accident. Examination of the wreckage revealed no evidence of a pre accident malfunction or failure that would have prevented normal operation. The pilot, who owned the airplane, did not possess an instrument rating. The pilot-rated passenger in the right seat was instrument-rated but did not meet resency of experience requirements to act as pilot-in-command. Toxicology testing detected a small amount of ethanol in the pilot’s liver but not in muscle. After absorption, ethanol is uniformly distributed throughout all tissues and body fluids; therefore, the finding in one tissue but not another is most consistent with post-mortem production. Hazardous weather avoidance is ultimately the pilot’s responsibility, and, in this case, the airplane was sufficiently equipped to provide a qualified pilot with the information necessary to navigate hazardous weather; however, the controller’s failure to provide the pilot with adequate and timely weather information as required by Federal Aviation Administration Order JO 7110.65X contributed to the pilot’s inability to safely navigate the hazardous weather along his route of flight, resulting in the penetration of a thunderstorm and the resulting loss of airplane control and inflight breakup.", "probable_cause": "The pilot’s failure to navigate around hazardous weather, resulting in the penetration of a thunderstorm, a loss of airplane control, and an inflight breakup. The air traffic controller’s failure to provide the pilot with adequate and timely weather information as required by FAA Order JO 7110.65X contributed to the pilot’s inability to safely navigate the hazardous weather along his route of flight. "}