{"url": "https://www.baaa-acro.com/crash/crash-ami-turbo-dc-3-65tp-pretoria-1-killed", "date": "Aug 24, 1998 at 1646 LT", "type": "Douglas DC-3", "operator": "Airworld", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pretoria - Durban", "msn": "13143", "yom": 1944, "flight_number": null, "city": "Pretoria-Wonderboom", "zone": "Gauteng", "country": "South Africa", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 11691, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Final power assurance checks were carried out on the aircraft’s engines on the morning of the accident. The AME (Aircraft Maintenance Engineer) trimmed the elevator-trim tab to the Full Nose UP position in order to reduce the stick forces required to hold the tail down during the engine power checks, but he did not set the elevator trim back to the neutral position on completion of the checks. The AME was requested by the pilot(s) to remove the aileron and elevator external gust locks and the landing gear down lock pins. He left the rudder lock in place, which was later removed by one of the pilots. The pilot(s) did not carry out a pre-flight inspection. At approximately 1646 on 24 August 1998 the DC3TP, registration number ZS-NKK, crashed during take-off from runway 11 at Wonderboom Airport. The PIC (Pilot-in-Command), who did not wear a shoulder harness, sustained fatal injuries and the co-pilot, who did wear a shoulder harness, serious injures. The accident occurred on the first flight after the aircraft had undergone a maintenance inspection, which included power assurance checks of the engines. The co-pilot sat in the left-hand seat and while he started the engines, the PIC attended to the cockpit checklist.", "probable_cause": "It would appear that the accident was as a result of the PIC taking-off with the elevator trim set to the full nose-up position. This resulted in the nose of the aircraft pitching up after rotation, causing the pilot to lose control of the aircraft."}