{"url": "https://www.baaa-acro.com/crash/crash-fairchild-c-123k-provider-denali-national-park-3-killed", "date": "Aug 1, 2010 at 1500 LT", "type": "Fairchild C-123 Provider", "operator": "All West Freight", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Palmer - Unalakleet", "msn": "20158", "yom": 1954, "flight_number": null, "city": "Denali National Park", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 20000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot, co-pilot and the passenger departed on a day VFR cross country flight in a large, 1950's era former military transportb category airplane to deliver cargo. The pilot did not file a flight plan, and had no communication with any air traffic control facility during the flight. While en route, witnesses saw the airplane fly slowly across a valley near the entrance of a national park, which was not the intended route of flight. The airplane suddenly pitched up, stalled, and dived into wooded terrain within the park. Two pilot-rated witnesses said the engines were operating at the time of the accident, and the landing gear was retracted. An on-scene examination of the burned airplane structure and engines revealed no evidence of any preaccident mechanical deficiencies, or any evidence that the cargo had shifted during the flight. A former military pilot who had experience in the accident type airplane, stated that the airplane was considered unrecoverable from a stall, and  for that reason, pilots did not typically practice stalls in it. He also indicated that if a problem was encountered with one of the two piston engines on the airplane, the auxiliary jet engine on the affected side should be started to provide additional thrust. Given the lack of mechanical deficiencies discovered during postaccident inspection, the absence of any distress communications, and the fact that neither of the two auxiliary jet engines had been started to assist in the event of a piston engine malfunction, it is likely the pilot allowed the airplane to lose airspeed and enter a low altitude stall from which he was unable to recover.", "probable_cause": "The pilot's failure to maintain adequate airspeed to avoid a low altitude stall, resulting in a loss of control and collision with terrain."}