{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950m-paparata-1-killed", "date": "Apr 10, 1979", "type": "Fletcher FU-24", "operator": "TAT%20Company", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Paparata - Paparata", "msn": "79", "yom": 1962, "flight_number": null, "city": "Paparata", "zone": "Auckland Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Flying operations commenced at 07:30 a.m. after a delay caused by unfavourable weather. Twenty-seven loads of fertilizer were sown before the pilot and loader driver stopped for a 30-minute break. During this break the plane was refueled to capacity. After the break the pilot instructed the loader driver to put the same load in the hopper as before and then started his take off from the sloping airstrip. A witness thought the aircraft was taking longer to get off the ground than it had earlier. The loader driver looked up to see the plane in a left hand turn at a height of 30 to 40 feet just off the end of the strip and \"porpoising\". The angle of bank was then seen to increase to beyond vertical, and the plane crashed in an inverted attitude on the far side of a nearby gully. It was destroyed by impact and an intense fire and the pilot, sole on board, was killed. This was not a survivable accident. ", "probable_cause": "The accident investigator found that a freshening of the breeze during the rest and refueling break caused a slightly increased tailwind component on the take off run. This, combined with a full hopper load and full fuel meant that the aircraft no longer had sufficient distance available to become fully airborne in. The Fletcher had flown through a fence at the end of airstrip in a nose high attitude and the impact of a concrete post had damaged the left stabilator and wrenched it out of alignment with the fuselage. This damage also affected the free movement of the control. The fertilizer load was not jettisoned. There was no evidence that the MAUW had been exceeded but the plane was clearly overloaded for the ambient conditions. The CG was within the permitted limits. The weather was favourable for aerial topdressing with high cloud, a light breeze, and good visibility. The engine was developing full power right up until the final impact. The investigator concluded his report with the opinion that the probable cause of the accident was that the pilot was unable to maintain control after damage to a flight control system occurred when the aircraft failed to become airborne and struck a fence at the end of the airstrip.\n"}