{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-4-san-juan-52-killed", "date": "Apr 11, 1952 at 1220 LT", "type": "Douglas DC-4", "operator": "Pan%20Am.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Juan – New York", "msn": "10503", "yom": 1945, "flight_number": "PA526A", "city": "San Juan", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 64, "pax_fatalities": 52, "other_fatalities": 0, "total_fatalities": 52, "captain_hours": 6920, "captain_hours_type": 4995, "copilot_hours": 5000, "copilot_hours_type": 708, "aircraft_hours": 20835, "circumstances": "Pan American World Airways’ Flight 526A originated at San Juan and departed there at 1211, April 11, 1952, for New York, New York. The crew consisted of Captain J. C. Burn, First Officer W. T. Hutchins, Second Officer J. R. Laubach, Purser A. Perez, and Steward R. Torres. According to company records, the air-craft at the time of takeoff weighed 31,868 kilograms (70,256 pounds), which was within the allowable gross takeoff weight of 33,113 kilograms (73,000 pounds). The load was properly distributed with respect to the approved center of gravity limits of the aircraft. Prior to departure, the captain filed with Air Route Traffic Control an IFR (Instrument Flight Rules) flight plan to New York International Airport, New York, to cruise at an altitude of 8,000 feet, estimating the flight time as eight hours and three minutes. This flight plan was approved. The crew testified that the aircraft was taxied to the end of Runway No. 9, the pre-takeoff check made, and the takeoff run started. During the takeoff and the initial climb, the aircraft appeared to be sluggish but not to an extent to cause concern. At an altitude of approximately 250 feet with the gear up, the flaps were raised and power was reduced to climb power. Climbing at an indicated air speed of 155 miles per hour, the first officer noticed that the oil pressure of No. 3 engine was falling and the oil temperature increasing. This condition was immediately pointed out to the captain, who requested that the San Juan tower be advised that they were returning to the airport. Accordingly, at 1213 the flight advised the tower of its intentions, and the tower replied, “Roger 526A, cleared to land, Runway 9, wind east one eight, altimeter two nine nine five. I’ll notify your company.” The company was notified and upon request, emergency field equipment was alerted. Because the oil pressure of No. 3 engine continued to drop rapidly and the oil temperature correspondingly increased, the propeller of this engine was feathered and power was increased to rated power on the remaining three engines. By this time the aircraft’s altitude was approximately 350 feet. When power was increased, the No. 4 engine backfired several times; however, immediately following these backfires, the engine continued to run in a normal manner. A climbing turn was initiated to a westerly heading, and the captain said that for best climbing conditions he reduced the aircraft’s air speed during the turn to 145 miles per hour. This reduction in air speed was accomplished by using up elevator. Upon reaching an altitude of about 550 feet, No. 4 engine again backfired and ran rough. Manifold pressure was reduced on this engine to approximately 32-35 inches, and again the engine ran smoothly. Subsequent attempts to operate No. 4 engine at increased power were unsuccessful due to recurrent roughness. At 1217 the tower asked the flight to report its position and received this reply: “We are still quite a way out.” And at 1218, the tower advised the U. S. Coast Guard Rescue Coordination Center at San Juan that the flight was in trouble and gave its position as seven miles, 300 degrees from the tower. The captain gradually reduced the air speed to 135 miles per hour, and at this time the heading of the aircraft was changed slightly to the right to maintain a course approximately parallel to the coast line. Because the aircraft was losing altitude, engines No. 1 and No. 2 were increased to takeoff power. The second officer was sent to the passenger compartment to advise the purser and steward that fuel was to be dumped, and all fuel dump valves were then opened. After the second officer returned to the cockpit, the flight advised the tower, at 1219, that it might have to ditch, and the captain instructed the second officer to alert the passengers. The second officer re-turned to the cabin, indicated that a ditching was imminent, took a forward seat in the cabin and fastened his safety belt. At 1220, an Air Force C-47 flying in the vicinity notified the San Juan tower that a DC-4 seemed to be ditching and accordingly was advised to circle the area. Flight 526A continued to settle, and the throttles of engines Nos. 1 and 2 were advanced to their stops. With the air speed near 120 miles per hour, the flaps were lowered to five degrees. Shortly after this, a landing on the water was made. The landing gear and flaps were lowered, and the fuel dump valves closed. The second officer obtained a life raft, which he carried to the main cabin and launched through a forward emergency exit on the right side. The first officer, after an unsuccessful attempt to loosen another life raft, abandoned the aircraft through a cockpit window. The captain entered the cabin and assisted passengers in evacuating the aircraft through the main cabin door until he was swept overboard by the action of the sea against the door. The aircraft sank approximately three minutes after landing on the water. At the time of the accident the weather was: high broken clouds at 35,000 feet with lower scattered clouds at 3,000 feet, visibility 20 miles and wind from east-southeast, 16 miles per hour.", "probable_cause": "The Board determines that the probable cause of this accident was (a) the company’s inadequate maintenance in not changing the No. 3 engine which resulted in its failure immediately subsequent to takeoff, and (b) the persistent action of the captain in attempting to re-establish a climb, without using all available power, following the critical loss of power to another engine. This resulted in a nose-high attitude, progressive loss of air speed and the settling of the aircraft at too low an altitude to effect recovery. The following findings were pointed out:\r\n- Weather was not a factor in this accident,\r\n- The company’s maintenance department at San Juan should have been alerted to a dangerous condition when metal particles were found in the nose section of No. 3 engine,\r\n- Pan American’s Miami office, having received information regarding the No. 3 engine from the maintenance department at San Juan, should have issued instructions to San Juan that this engine be changed,\r\n- Due to the condition of No. 3 engine, the aircraft was not airworthy when it departed San Juan,\r\n- No. 3 engine failed immediately after takeoff, which was followed by a partial loss of power from No. 4 engine,\r\n- The captain demonstrated questionable flying technique under the existing conditions."}