{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a90-king-air-tampa-1-killed", "date": "Jun 12, 2006 at 1235 LT", "type": "Beechcraft 90 King Air", "operator": "Dynamic-Aviation-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sarasota - Tampa", "msn": "LM-37", "yom": 1967, "flight_number": null, "city": "Tampa-Peter O’Knight", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2120, "captain_hours_type": 457, "copilot_hours": 1208, "copilot_hours_type": 44, "aircraft_hours": 15671, "circumstances": "The first officer reported that during cruise flight, both propeller secondary low pitch stop (SLPS) lights illuminated, indicating the SLPS system prevented both propellers from going below the low pitch hydraulic mechanical stop. The right occurred first, then the left approximately 1 minute later. Emergency procedures to correct the condition were ineffective. The right propeller feathered at some point during the flight, and the first officer reported that while operating single engine, they experienced a problem with the propeller governor. The flight proceeded direct to an airport with short runways approximately 3.2 nautical miles (nm) northwest of their present position, rather than to an air carrier airport located 8.5 nm away. The captain entered a close-in right base to runway 35 (2,688 feet long runway), while flying at 155 knots (51 knots above single engine reference speed). He turned onto final approach with the landing gear and flaps retracted, but overshot the runway. The airplane contacted a taxiway near the departure end of intended runway, and then collided with several obstacles before coming to rest at a house located past the departure end of runway 35. A post crash fire consumed the cockpit, cabin, and sections of both wings. Post accident examination of the airframe, engines, and propellers revealed no evidence of preimpact failure or malfunction. No determination was made as to the reason for the annunciation of both SLPS lights.", "probable_cause": "The poor in-flight planning decision by the captain for his failure to establish the airplane on a stabilized approach for a forced landing, resulting in the airplane landing on a taxiway near the departure end of the runway. Contributing to the accident were the failure or malfunction of the primary hydraulic low pitch stop of both propellers for undetermined reasons, the excessive approach airspeed and the failure of the captain to align the airplane with the runway for the forced landing."}