{"url": "https://www.baaa-acro.com/crash/crash-cessna-525-citationjet-cj1-marietta-4-killed", "date": "Apr 4, 1998 at 1032 LT", "type": "Cessna 525 CitationJet CJ1", "operator": "Alpha Wolf Enterprises", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Chamblee - Harrisburg", "msn": "525-0222", "yom": 1997, "flight_number": null, "city": "Marietta", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1824, "captain_hours_type": 86, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 181, "circumstances": "A Cessna 525 and a Cessna 172 collided in flight about 3,400 feet mean sea level on converging courses, with the 525 heading north and the 172 heading southwest. The converging speed was about 300 knots. The 525 departed under instrument flight rules, received vectors, and was initiating a climb on course. Training in the 525 emphasizes maximum use of the autopilot to afford greater outside scanning by the single pilot. The 525 was in radio contact with terminal approach control and the pilot's acknowledgement of the climb clearance was interrupted by the collision. The 172 had departed a local airfield, located just outside the 30 mile Mode C veil airspace of a terminal airport, and proceeded southwest. The collision occurred as the 172 was approaching Class D airspace of a military tower, and the pilot was initiating radio contact with the military tower. The terminal approach controller in contact with the 525 stated he did not observe the primary target of the 172, and conflict alert software was not installed. The 172 did not display a transponder signal and the transponder switch was subsequently found in the 'off' position. A cockpit visibility study indicated that from a fixed eye position the 172 was essentially hidden behind aircraft structure of the 525 for the 125 seconds before impact. The 172 could be seen by shifting the pilot's eye position. The 525 was viewable in the left lower section of the 172's windscreen. Both airplanes were operating in visual flight conditions. ", "probable_cause": "The failure of both pilots to see and avoid conflicting traffic, and the failure of the 172 pilot to operate the transponder as required by current regulations. Factors were the controller's failure to observe the traffic conflict, the lack of radar conflict alert capability, and the training emphasis on maximum autopilot usage with the autopilot controller placed at the rear of the cockpit center mounted pedestal."}