{"url": "https://www.baaa-acro.com/crash/crash-quest-kodiak-100-georgetown-2-killed", "date": "Feb 27, 2018 at 1925 LT", "type": "Quest Kodiak 100", "operator": "Pegasus of Montana", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Welaka - Welaka", "msn": "100-0173", "yom": 2016, "flight_number": null, "city": "Georgetown", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3400, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 68, "circumstances": "The private pilot and pilot-rated passenger were returning to the airport in night visual meteorological conditions with a cloud ceiling about 1,500 ft above ground level. Radar data indicated that the airplane overflew the airport and completed a 360° descending right turn and overflew the airport again before entering an approximate 180° left climbing turn toward and over an unlighted area within a denselywooded national forest. The airplane continued the left turn and entered a descent to impact in a river about 1 mile from the airport. All major components of the airplane were recovered from the river except the outboard section of the left wing and the left aileron. An examination of the airframe and engine revealed no mechanical malfunctions or failures that would have precluded normal operation. Because each of the two pilots onboard would have been capable of safely landing the airplane, it is unlikely that an acute event from either occupant's heart disease contributed to the accident. The night conditions, which included overcast clouds that would have obscured the nearly full moon, and the pilots' maneuvering for landing over an area devoid of cultural lighting provided conditions conducive to the development of spatial disorientation. It is likely that the pilots experienced a \"black hole\" illusion while maneuvering to align with the runway for landing, which resulted in an uncontrolled descent and impact with water.\n", "probable_cause": "The pilots' spatial disorientation while maneuvering for landing in night conditions over unlighted terrain, which resulted in an uncontrolled descent and impact with water."}