{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-marianna-3-killed", "date": "Apr 5, 2000 at 0930 LT", "type": "Learjet 35", "operator": "Bankair", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Miami - Marianna", "msn": "35-194", "yom": 1978, "flight_number": null, "city": "Marianna", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 12000, "captain_hours_type": null, "copilot_hours": 1776, "copilot_hours_type": 343, "aircraft_hours": 13262, "circumstances": "The pilot canceled the IFR flight plan as the aircraft crossed the VOR and reported the airport in site. The last radio contact with Air Traffic Control was at 0935:16. The crew did not report any problems before or during the accident flight. The distance from the VOR to the airport was 4 nautical miles. Witnesses saw the airplane enter right traffic at a low altitude, for a landing on runway 36, then turn right from base leg to final, less than a 1/2-mile from the approach end of the runway. Witnesses saw the airplane pitch up nose high, and the right wing dropped. The airplane than struck trees west of the runway, struck wires, caught fire, and impacted on a hard surface road. This was a training flight for the left seat pilot to retake a Learjet type rating check ride he had failed on March 24, 2000. He failed the check ride, because while performing an ILS approach in which he was given a simulated engine failure, and he was transitioning from instruments to VFR, he allowed the airspeed to decrease to a point below Vref [landing approach speed]. According to the company's training manual, \"...if a crewmember fails to meet any of the qualification requirements because of a lack in flight proficiency, the crewmember must be returned to training status. After additional or retraining, an instructor recommendation is required for reaccomplishing the unsatisfactory qualification requirements.\" The accident flight was dispatched by the company as a training flight. On the accident flight a company check airman was in the right seat, and the check ride was set up for 0800, April 5,2000. The flight arrived an hour and a half late. The left seat pilot's, and the company's flight records did not indicate any training flights, or any other type of flights, for the pilot from March 24, 2000, the date of the failed check flight, and the accident flight on April 5, 2000. The accident flight was the first flight that the left seat pilot was to receive retraining, and was the only opportunity for him to demonstrate the phase of flight that he was unsuccessful at during the check flight on March 24th. Examination of the\r\nairframe and engine did not reveal any discrepancies.\n", "probable_cause": "The pilot's failure to maintain control of the airplane while on final approach resulting in the airplane striking trees. Factors in this accident were: improper planning of the approach, and not obtaining the proper alignment with the runway.\n"}