{"url": "https://www.baaa-acro.com/crash/crash-douglas-r5d-2-mt-sunol-ridge-40-killed", "date": "Feb 17, 1956 at 1342 LT", "type": "Douglas C-54 Skymaster", "operator": "US%20Navy", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "Mountains", "schedule": "Camp Pendleton – El Toro – Alameda – Hickam", "msn": "18331", "yom": 1944, "flight_number": null, "city": "Mt Sunol Ridge", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 35, "pax_fatalities": 35, "other_fatalities": 0, "total_fatalities": 40, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed El Toro Airbase at 1030LT Bound for Alameda NAS on behalf of the Marine Transport Squadron 152. On board were United States Marines from Camp Pendleton en route to Hickam Field, and five crew members. While approaching his destination, the captain was instructed to follow a 30 minutes holding circuit. At 1342LT, while descending at an altitude of 3,500 feet in marginal weather conditions, the pilot started the approach when the aircraft hit the slope of Mt Sunol Ridge located about 21 miles southeast of Alameda Airbase. The aircraft was destroyed upon impact and all 40 occupants have been killed. It was reported that the airplane hit the mountain about 200 feet below the summit. \r\nCrew:\r\nMaj Alexander Watson, pilot,\r\n1st Lt Thomas E. Straughan, copilot,\r\nM/Sgt Donald J. Down, navigator, \r\nS/Sgt Terrell M. Young, flight engineer,\r\nS/Sgt Harry E. Knight, radio operator.", "probable_cause": "It was determined that the collision with the mountain was the consequence of several errors and omissions on part of the flying crew who neglected approach procedures and wrongly interpreted some signals transmitted by local beacons. This caused the crew to start the descent prematurely and the aircraft to drift off course by six miles to the northeast at the time of the accident. Low visibility due to clouds was considered as a contributing factor. "}