{"url": "https://www.baaa-acro.com/crash/crash-iai-1124a-westwind-ii-huntsville-3-killed", "date": "Jun 18, 2014 at 1424 LT", "type": "IAI 1124 Westwind", "operator": "Synfuels Holdings Finance", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Huntsville - Huntsville", "msn": "392", "yom": 1983, "flight_number": null, "city": "Huntsville", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 20200, "captain_hours_type": 850, "copilot_hours": 28421, "copilot_hours_type": 1816, "aircraft_hours": 7571, "circumstances": "A pilot proficiency examiner (PPE) was using the airplane to conduct a pilot-in-command (PIC) proficiency check for two company pilots. Before the accident flight, one of the two company pilots on board received a PIC proficiency check, which terminated with a full-stop landing and reverse thrust application; no discrepancies with either thrust reverser were discussed by either flight crewmember. The pilot being examined then left the cockpit, and the accident pilot positioned himself in the left front seat while the PPE remained in the right front seat. The flight crew then taxied to the approach end of the runway to begin another flight. Data from the enhanced ground proximity system (EGPWS) revealed that, the flight began the takeoff roll with the flaps retracted, the thrust reversers armed, and both engines stabilized at 96 percent N2. About 2 seconds later, the cockpit voice recorder (CVR) recorded the \"V1\" call while on the airplane was on the runway; acoustic analysis indicated that the N2 speed of one engine, likely the right, decreased; the N2 speed of the other engine remained constant. This decrease in N2 speed was consistent with the PPE retarding right engine thrust to flight idle with the intent of simulating an engine failure. The takeoff continued, and, while the airplane was in a wings-level climb at an airspeed of 148 knots about 18 ft radar altitude, the CVR recorded the pilot command that the landing gear be retracted. The landing gear remained extended, and, about 1 second after the command to retract the landing gear, or about 3 seconds after becoming airborne, while about 33 ft above the runway and at the highest recorded airspeed of 149 knots, the CVR recorded the beginning of a rattling sound, which was consistent with the deployment of the right thrust reverser, and it continued to the end of the recording. About 1.5 seconds after the rattling sound began, the CVR recorded the PPE asking, \"…what happened,\" which indicates that the deployment was likely not annunciated in the cockpit. The right engine N2 speed continued to gradually decrease, and the airplane rolled slightly left, back to a wings-level position. The airplane continued climbing with the landing gear extended as pitch changes continued to occur. During this time, the flight crew exchanged comments about their lack of understanding about what was occurring. While flying 10 knots above V2 speed with the left engine N2 speed remaining steady and the right engine N2 speed decreasing at a slightly greater rate than previously, the airplane began a right roll with a corresponding steady decrease in airspeed from about 144 knots. About 9 seconds after the original call to retract the landing gear, the CVR recorded the PPE requesting that the landing gear be retracted, which occurred 1 second later. The airplane then continued in the right turn with the airspeed steadily decreasing, and about 11 seconds after the PPE asked \"…what happened\", the EGPWS sounded a bank angle alert. At that time, the airplane was in a right roll of about 30 degrees, and the airspeed was about 132 knots. The right roll continued to a maximum value of about 39 degrees, which was the last valid bank angle value recorded. The airplane impacted the ground off the right side of the runway in a nose- and right-winglow attitude. The landing gear and flaps were retracted, and there was no evidence of preimpact failure or malfunction of the flight controls for roll, pitch, and yaw; nor was there any evidence of a mechanical failure or malfunction of either engine. A definitive reason for the deployment of the right thrust reverser could not be determined. No previous instances of inadvertent in-flight thrust reverser deployment were documented by the operator of the accident airplane or by the airframe manufacturer for the accident airplane make and model. Certification flight testing of an airplane with the same thrust reverser system determined that the airplane remained controllable with the right thrust reverser deployed and throttle retarder system functioning. The flight testing also included application of a momentary, peak burst of right engine thrust, again with no controllability issues noted. It was also noted that with the installed throttle retarder system, in the event of inadvertent thrust reverser deployment, that the engine's thrust should have been reduced to idle within 4 to 8 seconds. Acoustic analysis of the accident flight indicated that the lowest recorded N2 rpm value was about 84 percent and that the reduction in rpm occurred over a period of about 8.5 seconds, after the right thrust reverser deployed. No determination could be made as to why the throttle retarder system did not reduce the right engine thrust to flight idle as designed. Additionally, no determination could be made as to why the flight crew was not able to maintain directional control of the airplane following deployment of the right thrust reverser. Although the PPE had severe coronary artery disease, which placed him at risk for an acute coronary event that would cause symptoms like chest pain, shortness of breath, or sudden unconsciousness, the CVR recorded no evidence of impairment. Neither the heart disease nor the medications he was taking to treat it would have impaired his judgement or physical functioning. Therefore, it is unlikely any medical condition or substance contributed to the PPE's actions. Additionally, there was no evidence that any medical condition would have impaired judgement or physical functioning of the pilot being examined.", "probable_cause": "The flight crew's inability to maintain airplane control during initial climb following deployment of the right thrust reverser for reasons that could not be determined because postaccident examination of the airframe and engine thrust reverser system did not reveal any anomalies. Contributing to the accident was the excessive thrust from the right engine with the thrust reverser deployed for reasons that could not be determined during postaccident examinations and testing."}