{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-mt-bull-10-killed", "date": "Oct 24, 2004 at 1235 LT", "type": "Beechcraft 200 Super King Air", "operator": "Hendrick%20Motorsports", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Mountains", "schedule": "Concord – Martinsville", "msn": "BB-805", "yom": 1981, "flight_number": null, "city": "Mt Bull", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 10733, "captain_hours_type": 210, "copilot_hours": 2090, "copilot_hours_type": 121, "aircraft_hours": 8078, "circumstances": "On October 24, 2004, about 1235 eastern daylight time (all times in this brief are eastern daylight time based on a 24-hour clock), a Beech King Air 200, N501RH, operated by Hendrick Motorsports, Inc., crashed into mountainous terrain in Stuart, Virginia, during a missed approach to Martinsville/Blue Ridge Airport (MTV), Martinsville, Virginia. The flight was transporting Hendrick Motorsports employees and others to an automobile race in Martinsville, Virginia. The two flight crewmembers and eight passengers were killed, and the airplane was destroyed by impact forces and post crash fire. The flight was operating under the provisions of 14 Code of Federal Regulations (CFR) Part 91 on an instrument flight rules (IFR) flight plan. Instrument meteorological conditions (IMC) prevailed at the time of the accident.", "probable_cause": "The flight crew's failure to properly execute the published instrument approach procedure, including the published missed approach procedure, which resulted in controlled flight into terrain. Contributing to the cause of the accident was the flight crew's failure to use all available navigational aids to confirm and monitor the airplane's position during the approach."}