{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154b-1-leningrad-13-killed", "date": "May 23, 1991 at 1306 LT", "type": "Tupolev TU-154", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sukhumi - Leningrad", "msn": "75A097", "yom": 1975, "flight_number": "SU8556", "city": "Leningrad-Pulkovo", "zone": "Leningrad oblast", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 174, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Sukhumi, the crew initiate the approach to Leningrad-Pulkovo Airport in heavy rain falls. At a distance of 7 km on approach, at an altitude of 400 meters and at a speed of 287 km/h, flaps were deployed to an angle of 45°. Fifteen seconds laters, at a distance of 5,700 meters, the crew was cleared to land and continued the approach when the aircraft passed below the glide. With a rate of descent of 7 meters per second and at a speed of 250 km/h, the aircraft struck the ground 13 meters short of runway threshold in a 1° nose down attitude and with a positive acceleration of 4,5 g. The aircraft broke in three parts and came to rest 80 meters to the left of the runway. 13 passengers were killed, 38 other occupants were injured and 130 escaped uninjured. ", "probable_cause": "Wrong approach configuration on part of the flying crew. The following contributing factors were reported:\r\n- Deviations in the actions of the crew during the approach procedure, \r\n- Lack of crew coordination,\r\n- Inconsistencies in crew actions during an instrument approach that resulted in a significant vertical deviation from the calculated descent trajectory and delayed actions to eliminate them,\r\n- Lack of assistance from the approach controller,\r\n- Decision of the crew to continue the approach maneuver instead of initiating a go-around procedure."}