{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-elyria-4-killed", "date": "Jan 18, 2010 at 1405 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Mitts Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Gainesville - Elyria", "msn": "732", "yom": 1978, "flight_number": null, "city": "Elyria-Lorain County", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 2010, "captain_hours_type": 1250, "copilot_hours": 190, "copilot_hours_type": null, "aircraft_hours": 6799, "circumstances": "On his first Instrument Landing System (ILS) approach, the pilot initially flew through the localizer course. The pilot then reestablished the airplane on the final approach course, but the airplane’s altitude at the decision height was about 500 feet too high. He executed a missed approach and received radar vectors for another approach. The airplane was flying inbound on the second ILS approach when a witness reported that he saw the airplane about 150 feet above the ground in about a 60-degree nose-low attitude with about an 80-degree right bank angle. The initial ground impact point was about 2,150 feet west of the runway threshold and about 720 feet north (left) of the extended centerline. The cloud tops were about 3,000 feet with light rime or mixed icing. The flap jack screws and flap indicator were found in the 5-degree flap position. The inspection of the airplane revealed no preimpact anomalies to the airframe, engines, or propellers. A radar study performed on the flight indicated that the calibrated airspeed was about 130 knots on the final approach, but subsequently decreased to about 95–100 knots during the 20-second period prior to loss of radar contact. According to the airplane’s flight manual, the wings-level power-off stall speed at the accident aircraft’s weight is about 91 knots. The ILS approach flight profile indicates that 20 degrees of flaps should be used at the glide slope intercept while maintaining 120 knots minimum airspeed. At least 20 degrees of flaps should be maintained until touchdown. The “No Flap” or “5 Degrees Flap Landing” flight profile indicates that the NO FLAP Vref airspeed is 115 knots calibrated airspeed minimum.\n", "probable_cause": "The pilot's failure to maintain adequate airspeed during the instrument approach, which resulted in an aerodynamic stall and impact with terrain.\n"}