{"url": "https://www.baaa-acro.com/crash/crash-cessna-207-skywagon-marshall", "date": "Oct 28, 2002 at 2000 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Grant%20Aviation-2_0", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "Yes", "site": "Mountains", "schedule": "Marshall - Bethel", "msn": "207-0069", "yom": 1969, "flight_number": null, "city": "Marshall", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1745, "captain_hours_type": 115, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14551, "circumstances": "The commercial pilot was positioning the airplane from the departure airport to another airport. The flight took place on a dark night with overcast skies, and no discernible horizon. The pilot departed and climbed to a cruise altitude between 1,200 and 1,400 feet msl. About 4 miles south of the departure airport, the airplane collided with an east-west ridge at 1,200 feet msl. The ridgeline is perpendicular to the direct route of flight between the departure and destination airports, and rises from west to east with a summit elevation of 1,714 feet msl. The departure airport was a newly commissioned airport 3 miles east-northeast of the old airport. The accident flight was the pilot's second trip to the new airport, and his first night departure from either the old or new airport. Direct flight from the new airport to the destination airport requires a higher altitude to clear the ridgeline than does a direct flight from the old airport. A direct flight from the old airport crosses the same ridgeline farther to the west, where the elevation of the ridge is less than 500 feet msl.", "probable_cause": "The pilot's failure to maintain clearance from terrain, which resulted in an in-flight collision with a ridgeline. Factors contributing to the accident were the high terrain, the pilot's inadequate preflight planning, and the dark night light conditions."}