{"url": "https://www.baaa-acro.com/crash/crash-learjet-25b-northolt", "date": "Aug 13, 1996 at 0957 LT", "type": "Learjet 25", "operator": "Mac%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Palma de Mallorca - Northolt", "msn": "25-184", "yom": 1974, "flight_number": "MAQ123", "city": "Northolt AFB", "zone": "London Metropolis", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5200, "captain_hours_type": 1900, "copilot_hours": 5340, "copilot_hours_type": 1700, "aircraft_hours": 4396, "circumstances": "Learjet 25B EC-CKR arrived near Northolt following a flight from Palma de Mallorca. Due to the presence of priority traffic which was due to depart Northolt at that time, the flight was extended down wind to a distance of 10 nm before the crew received vectors and descent instructions for the final approach to runway 25. At 3.5nm short of the runway the pilot was asked to confirm that his landing gear was down and locked as is normal procedure at Northolt. After some rephrasing of this question, the landing gear was confirmed down, however during this exchange the aircraft was seen to deviate above the glidepath. At 2.5 nm, landing clearance was confirmed and the aircraft was advised of the surface wind and the fact that there was a 4 kt tailwind. The aircraft was also advised that it was above the glide path. At the decision altitude which was at approximately half a mile from the runway the aircraft was still above the glidepath although seen to be correcting to it. On arrival at the runway the aircraft was observed to land some distance beyond the normal touchdown point. Towards the end of the landing roll it veered to the right and then swerved to the left and overran the end of the runway. It collided with three lighting stanchions and continued in a south-westerly direction towards the airfield boundary which is marked by a high chain-link fence. After bursting through the boundary fence the aircraft ran onto the A40 trunk road and was almost immediately in collision with a Ford Transit van on the east bound carriageway, and seriously injuring its driver. The aircraft came to rest in the left hand lane of the road with the van embedded in the right side of the fuselage immediately forward of the right wing.", "probable_cause": "The following causal factors were identified: \r\n(1) The commander landed the aircraft at a speed of 158 (+/- 10 kt) and at a point on the runway such that there was approximately 3,125 feet (952 metres) of landing run remaining; \r\n(2) The commander did not deploy the spoilers after touchdown; \r\n(3) The first officer did not observe that the spoilers had not been deployed after touchdown; \r\n(4) At a speed of 158 (+/- 10 kt) with spoilers retracted and given the aircraft weight and atmospheric conditions prevailing, there was insufficient landing distance remaining from the point of touchdown within which to bring the aircraft to a standstill; \r\n(5) The commander allowed himself to become overloaded during the approach and landing. The safeguards derived from a two crew operation were diminished by the first officer’s lack of involvement with the final approach."}