{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-465-london-5-killed", "date": "Apr 8, 1968 at 1535 LT", "type": "Boeing 707", "operator": "BOAC-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "London - Zurich - Tel Aviv - Tehran - Bombay - Singapore - Sydney", "msn": "18373/302", "yom": 1962, "flight_number": "BA712", "city": "London-Heathrow", "zone": "London Metropolis", "country": "United Kingdom", "region": "Europe", "crew_on_board": 11, "crew_fatalities": 1, "pax_on_board": 116, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 14878, "captain_hours_type": 1555, "copilot_hours": 5496, "copilot_hours_type": 2829, "aircraft_hours": 20870, "circumstances": "The aircraft was operating Flight BA. 712 from Heathrow Airport, London to Zurich with onward routing to Sydney, Australia. In addition to the normal crew complement, a check pilot was on the aircraft for the purpose of carrying out a route check on the pilot-in-command. The aircraft became airborne from Runway 28 Left at 1527 hours GMT and 20 seconds later, just before the time for the noise abatement power reduction, the flight crew felt and heard a combined shock and bang. The thrust lever for No. 2 engine \"kicked\" towards the closed position and at the same time the instruments showed that the engine was running down. The pilot-in-command ordered \"Engine Failure Drill\" and the flight engineer began the immediate actions of that drill. Because the undercarriage was retracted, the warning horn sounded when the flight engineer fully retarded the thrust lever; the check pilot and flight engineer simultaneously went for and pulled the horn cancel switch on the pedestal whilst the co-pilot, instinctively, but in error, pressed the fire bell cancel button in front of him. The flight engineer went for the engine fire shut-off handle but he did not pull it. The lack of a flight deck voice recorder makes it impossible to establish a second by second timing of events, but at about this time the check pilot looked out of a flight deck window on the port side and reported a serious fire in No. 2 engine, adding words to the effect that a landing should be made at the earliest possible moment. No member of the flight crew recalls hearing the fire warning bell. Nevertheless, the fire warning light in No. 2 fire shut-off handle was seen to be on and the pilot-in-command ordered an \"Engine Fire Drill\". The check pilot suggested, and the co-pilot with the pilot-in-command's approval broadcast, a \"Mayday\" call. Having initially started an engine failure drill, the flight engineer changed directly to the engine fire drill. According to his evidence, having completed Phase 1 of the engine fire drill, which is required to be done by memory, he subsequently used his own copy of the checklist to complete Phase I1 of the drill, including the operation of the fire extinguisher transfer switch and pushing the discharge button for the second shot thirty seconds after the first. When the co-pilot started to read the check list the flight engineer told him the check was already completed. During this period and subsequently, according to his evidence, the check pilot directed his attention to monitoring the state of the fire on the wing and to providing the pilot-in-command with comments intended to help him position the aircraft for the landing. ATC originally offered the pilot-in-command a landing back on Runway 28L and alerted the fire services but after the \"Mayday\" call he was offered Runway 05 R which was accepted as it would resulting a shorter flight path. ATC ordered other landing aircraft to overshoot in order to ensure a clear approach to Runway 05 R and to clear Runway 28R for the passage of the fire vehicles. The initial notification to the Airport Emergency Services of the expected landing on Runway 28 L was also revised. About 14 minutes after the start of the fire, No. 2 engine, together with part of its pylon, became detached and fell into a waterfilled gravel pit. This was unknown to the flight crew but because of the separation the light in the fire handle would have gone out. Nevertheless, they were aware that a serious fire continued to burn. At various places along the flight path a number of engine fragments and pieces of cowling had already fallen away, but these caused no injury to persons or damage to property. At about the time the engine fell away the undercarriage was lowered and full flap selected. The undercarriage locked down normally but the hydraulic pressure and contents were seen to fall and the flaps stopped extending at 470, that is 30 short of their full range. The approach to Runway 05 R was made from a difficult position, the aircraft being close to the runway and having reached a height of about 3 000 ft and a speed of 225 kt. There is no glide slope guidance to this runway but the approach was well judged and touchdown was achieved approximately 400 yards beyond the threshold. To add to the pilot-in-command's difficulties, during the final approach the flight engineer informed him that the instruments of No. 1 engine indicated that it might fail, although it did not do so. In order to bring the aircraft to a stop in the shortest possible distance after landing, in addition to the wheel. brakes, reverse thrust from No. 1 and No. 4 engines was used down to a very low speed. The use of reverse thrust caused the flames to be deflected in towards the fuselage. The aircraft came to a stop just to the left of the runway centre line, about 1 800 yards from the threshold, on a heading of 0350M. After the aircraft came to rest the flight engineer commenced the engine shut-down drill and closed the start levers. Almost simultaneously the pilot-in-command ordered fire drill on the remaining engines. Before this could be carried out there was an explosion from the port wing which increased the intensity of the fire and blew fragments of the wing over to the starboard side of the aircraft. The pilot-in-command then ordered immediate evacuation of the flight deck. The engine fire shut-off handies were not pulled and the fuel booster pumps and main electrical supply were not switched off. There were more explosions and fuel, which was released from the port tanks, spread underneath the aircraft and greatly enlarged the area of the fire. The cabin crew had made preparations for an emergency landing and as the aircraft came to a stop opened the emergency exits and started rigging the escape chutes. The passengers commenced evacuation from the two starboard overwing exits and shortly afterwards, when the escape chutes had been inflated, from the rear starboard galley door and then the forward starboard galley door. However, because of the spread of the fire under the rear of the fuselage the escape chute at the rear galley door soon burst and, following the first explosion, the overwing escape route also became unusable. The great majority of the survivors left the aircraft via the forward galley door escape chute. The co-pilot, who could not get into the galley to help with the evacuation, left the aircraft through the starboard flight deck window by use of the escape rope at that position. The Second Officer, who helped guide the passengers in the initial stages, followed, the pilot-in-command, having assisted the stewardess to inflate the port forward chute, also left by the flight deck window after seeing the evacuation was proceeding satisfactorily. The flight engineer saw that the port forward chute had not inflated properly so he climbed down it to straighten it. However, immediately after it inflated it became unusable from heat and burst. The evacuation of passengers had been largely completed by the time the airport fire and rescue services began to provide assistance. The fire services prevented the fuel in the starboard tanks from catching fire but the rear fuselage and port wing were burned out. Four of the passengers and one stewardess were overcome by heat and smoke at the rear of the aircraft and did not escape, whilst thirty-eight passengers sustained . injuries during the evacuation. Some hours after the accident it was not known how many had escaped alive or had been injured because some survivors were quickly removed to various treatment and rest centres whilst others left the vicinity of the airport without leaving their names. ", "probable_cause": "The accident resulted from an omission to close the fuel shut-off valve when No. 2 engine caught fire following the failure of its No. 5 low pressure compressor wheel. The failure of the wheel was due to fatigue. The following findings were reported:\r\n- The number 2 engine fifth stage low pressure compressor wheel failed due to fatigue. The reason for this has not been established,\r\n- The failure of the No. 2 engine compressor wheel caused damage to the starboard side of the engine and to its cowling. This resulted in a fuel leak from the engine fuel supply line and a fire,\r\n- After starting and before completing an engine overheat or failure drill, it became necessary for the crew to carry out a fire drill,\r\n- The co-pilot cancellation of the fire bell instead of the undercarriage warning horn prevented the fire bell from ringing,\r\n- The closure of the fuel shut-off valve by pulling the fire handle was inadvertently omitted by the flight engineer when he carried out the fire drill. The omission was not noticed by the pilot-in-command, the co-pilot or the Check pilot. The Second Officer was in no position to observe the situation,\r\n- The failure to close the fuel shut-off valve permitted the fire to continue,\r\n- The BOAC fire and engine overheat or failure drills in force at the time were capable of misapplication under stress,\r\n- The overall efficiency of the airport fire service was seriously reduced by some appliance deployment and equipment failures. However, they were successful in preventing the spread of the fire to 3 000 gallons of fuel in the starboard wing of the aircraft"}