{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-near-union-city-50-killed", "date": "Aug 24, 1951 at 0428 LT", "type": "Douglas DC-6", "operator": "United-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Boston – Hartford – Cleveland – Chicago – Oakland – San Francisco", "msn": "43260", "yom": 1951, "flight_number": "UA615", "city": "Union City", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 44, "pax_fatalities": 44, "other_fatalities": 0, "total_fatalities": 50, "captain_hours": 12032, "captain_hours_type": 417, "copilot_hours": 5842, "copilot_hours_type": 2848, "aircraft_hours": 361, "circumstances": "Air Route Traffic Control (ARTC) cleared Flight 615 on an instrument flight plan from Chicago to Oakland, and from Oakland to San Francisco in accordance with Visual Flight Rules (VFB). Altitude was to be 18,000 feet man sea level (MSL) via Red Airway 4, Creen Airway 3, and Red Airway 6 from Chicago to Denver, direct to Milford, Utah, and thence direct to Oakland. Flight between Oakland and San Francisco was to have been via Green Airway 3 at 500 feet. Routine radio contacts were made en route. At 0354, August 24, while approaching the Oakland area, Flight 615 was cleared to the Newark, California fan marker, with instructions to descend to 6,000 feet, maintain that altitude, and contact Oakland Approach Control over Altamont, California. At 0411, the flight reported over Stockton, California, at 9,500 feet, descending. At this time the flight was given, and acknowledged, the Oakland altimeter setting of 29 88 inches. Flight 615 reported over the Altamont Intersection at 0416, and made initial contact with Oakland Approach Control one-half minute later. Clearance of the flight into Oakland was now vested in Approach Control, and no further radio contacts were made with company communications. The flight was cleared by Approach Control to the Oakland radio range station to maintain at least 500 feet above the tops of the clouds. The pilot followed this contact with a request for clearance direct to Newark and a straight-in range approach. The Newark fan marker and compass locator lie on the southeast leg of the Oakland radio range This request was granted, with instructions to maintain an altitude of 500 feet on top of the cloud layer between Altamont and Newark. At 0422, the flight reported approaching the Hayward, California, compass locator, which is between Newark and Altamont, and requested a second modification to clearance instructions by asking for a straight-in ILS (Instrument Landing System) approach 2. Approach Control advised it to stand by due to another aircraft in the area. Flight 615 shortly thereafter advised Approach Control that it was approaching Newark and to disregard the request for an ILS approach. At 0425 Flight 615 was cleared for a straight-in approach on the southeast course of the Oakland radio range from Newark. At 0427 the flight reported leaving Newark inbound to Oakland. This was the last radio contact. A minute later, the four engine aircraft struck the Tolman peak (985 feet high) located about 14,6 miles southeast of Oakland Airport. The aircraft was destroyed by impact forces and all 50 occupants were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the failure of the captain to adhere to instrument procedures in the Newark area during an approach to the Oakland Municipal Airport. The following findings were pointed out: \r\n- The captain failed to follow the approved procedure for a straight-in range approach from Newark to Oakland by descending below the minimum altitudes for the Newark area,\r\n- The flight had been cleared for a straight-in range approach, but neither receiver was tuned to the Oakland radio range station, as required,\r\n- The aircraft struck a hill at an altitude of 983 feet MSL on a heading of about 296 degrees magnetic, and approximately three miles to the right of the southeast on-course signal of the Oakland radio range,\r\n- Substantial power was being developed at the time of impact."}