{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-greenhead-5-killed", "date": "Dec 22, 2006 at 0849 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Island Times", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Destin - Marsh Harbour", "msn": "421B-0813", "yom": 1974, "flight_number": null, "city": "Greenhead", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 15000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6478, "circumstances": "Prior to takeoff, the pilot contacted Eglin Clearance Delivery for a weather briefing. He was informed of severe thunderstorms in the area and worked out a plan with the Clearance Delivery operator to avoid them. The flight originated from Destin Florida Airport, Destin, Florida about 0832 central standard time en route to Marsh Harbor, Bahamas. Eglin South Approach Control provided vectors to steer the flight around the weather. At 0841:30, the flight was handed off to Tyndall Approach Control. The flight was informed that it was entering \"a line of weather that's going to continue for the next 15 miles.\" At 0844:10, Tyndall Approach Control alerted all aircraft of \"hazardous weather.\" Tyndall Approach Control also informed the flight that their station was not equipped with the same detailed weather radar that Eglin had, and instructed the flight to continue on its current vector, which was provided by Eglin. About 4 minutes later, the pilot contacted ATC to request a block altitude clearance because he was \"up and down here quite a bit.\" The controller provided a clearance for 4,000 through 6,000 feet. The pilot acknowledged the clearance, and there were no further communications with the flight. The pilot and four passengers were fatally injured, and the aircraft was destroyed after impacting the ground near Greenhead, Florida. According to the Sheriff, the property owner who initially located the wreckage, said that there was heavy rain, thunder, lightning and wind in the area at the time of the accident. The NTSB conducted a meteorological study and weather data along with the airplane's track and found it to be consistent with the airplane encountering a level 5 thunderstorm.", "probable_cause": "The pilot-in-command's improper planning/decision and continued flight into known adverse weather which resulted in an encounter with a level 5 thunderstorm."}