{"url": "https://www.baaa-acro.com/crash/crash-casa-212-aviocar-200-near-bohorok-18-killed", "date": "Sep 29, 2011 at 0750 LT", "type": "Casa 212 Aviocar", "operator": "Nusantara%20Buana%20Air", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Medan - Kuta Cane", "msn": "88N/283", "yom": 1989, "flight_number": "NBA823", "city": "Bohorok", "zone": "North Sumatra", "country": "Indonesia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 16, "pax_fatalities": 16, "other_fatalities": 0, "total_fatalities": 18, "captain_hours": 5935, "captain_hours_type": 3730, "copilot_hours": 2500, "copilot_hours_type": 1100, "aircraft_hours": 11329, "circumstances": "On 29 September 2011, a CASA 212-200 aircraft registered PK-TLF was being operated by Nusantara Buana Air as a non-scheduled passenger flight from Polonia International Airport (MES/WIMM), Medan - North Sumatera1 to Alas Leuser Airstrip Kuta Cane, South East Aceh. The flight was conducted under Visual Flight Rules (VFR) The aircraft departed from Medan at 0728 LT (0028 UTC) and scheduled to be arrived at Kuta Cane at 0058 UTC. There were 18 person on board consisted of two pilots and 16 passengers including two children and two infants. The aircraft radar target was last observed on the radar screen at about 0050 UTC, while at position on radial 262˚ and 35 NM from MDN VOR. The aircraft was found impacted to a of 70º slope terrain at 5,055 feet altitude in the Leuser Mountain National Park, direction of 109 and 16 Nm from Kuta Cane on coordinate N 030 24’ 00” E 0980 01’ 00”. All 18 occupants were fatally injured and the aircraft was severely damage. \n", "probable_cause": "Factors: \r\n1. The flight was in VFR however both pilots agreed to fly into the cloud, consequently, the flight crew had lack of situation awareness due to lost of visual references to the ground and no or late recovery action prior to impact due to low visibility. \r\n2. There was lack of good crew coordination due to steep cockpit transition gradient. \r\n3. There was no checklist reading and crew briefing."}