{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-placencia", "date": "Nov 17, 2017 at 0846 LT", "type": "Cessna 208B Grand Caravan", "operator": "Tropic%20Air-3_0", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Placencia – Punta Gorda", "msn": "208B-1162", "yom": 2005, "flight_number": null, "city": "Placencia", "zone": "Stann Creek", "country": "Belize", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 19040, "captain_hours_type": 12092, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2106, "circumstances": "On 17 November, 2017, a Tropic Air Cessna 208B Grand Caravan with registration V3-HGX, departed from the Sir Barry Bowen Municipal Airport at approximately 7:15 a.m. local time with one aircraft captain, 11 passengers and 1 crew on board. The flight was a regular operated commercial passenger flight with scheduled stops in Dangriga, Placencia and with the final destination being Punta Gorda. The pilot reported that the portion of the flight from Belize City to Dangriga was uneventful and normal and so was the landing at Placencia. At approximately 8:40 a.m. local time the airplane taxied from the Tropic Air ramp and taxied towards the west on runway 25. The pilot did a turnaround using all the available runway at normal speed and started his takeoff run to the east on runway 07. The pilot proceeded down the runway in a normal takeoff roll with normal takeoff speed and prior to reaching the end of the runway, he rotated the aircraft and lifted the nose wheel to get airborne. At exactly 28 feet past the end of runway 07 and during the initial climb phase, a part of the aircraft landing gear made contact with the upper part of the front righthand passenger door frame of a vehicle that had breached the area in front of the runway which is normally protected by traffic barriers. The impact caused the aircraft to deviate from its initial climb profile, and the pilot reported that the engine was working for a couple seconds and it abruptly shut down shortly after. The pilot realized that he was unable to return to the airport. The pilot carried out emergency drills for engine loss after take-off over water and decided to ditch the aircraft in the sea, which was approximately 200-300 feet from the main shoreline in front of the Placencia airport. The flight crew and all passengers were safely evacuated from the fuselage with the assistance of witnesses and passing boats which provided an impromptu rescue for the  passengers. All passengers received only minor injuries.", "probable_cause": "The following are factors that are derived from the failures in the areas mentioned in section 3.00 (conclusions):\r\na. There is a lack of traffic surveillance to ensure that drivers comply with the warning signs of low flying aircraft and do not breach the barriers when they are down or inoperative. The left barrier at Placencia was reportedly inoperative and the right barrier was said to be working. As a result, this removed a significant level of protection for vehicles which operate on the portion of the road which intersects the departure path of aircraft. The purpose of the barriers is to protect vehicles from coming in close contact with low flying aircraft. The driver of the vehicle failed to adhere to traffic warning signs regarding low flying aircraft and drove his vehicle directly into the departure path of an aircraft (Probable cause).\r\nb. ADAS data calculations showed that the pilot had a period of 13.33 seconds when he achieved take off performance, but he did not rotate the aircraft. Although the aircraft engine performance was normal, the actual take-off weight was within limits and the distance available to the pilot to abort the take-off was 872 feet; the pilot still flew the aircraft at a dangerously low altitude over the road and did not properly assess the risk at hand which was a vehicle advancing into the aircraft’s departure path which could cause a collision. (Probable cause).\r\nc. The angle at which the aircraft made contact with the vehicle was not a direct head on angle, but the contact was made when the vehicle was off to the right-hand side of the extended centerline of runway 07. The aircraft did not follow the direct path of the extended center line of runway 07 prior to making contact, but instead it made a slight right turn shortly after the wheels left the ground. The pilot did not take collision avoidance (evasive) measures in a timely manner (probable cause).\r\nd. The pilot did not demonstrate adequate knowledge of proper ditching procedures which led to an inadequate response to the emergency at hand. The operator did not provide the flight crew with the proper ditching training.\n\r\nProbable causes:\r\n1. The driver of the vehicle failed to adhere to traffic warning signs regarding low flying aircraft and drove his vehicle directly into the departure path of an aircraft.\r\n2. The pilot flew the aircraft at a dangerously low altitude over the road and did not properly assess the risk at hand which was a vehicle advancing into the aircraft’s departure path which could cause a collision.\r\n3. The pilot did not take collision avoidance (evasive) measures in a timely manner. "}