{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-near-makkovik-1-killed", "date": "May 1, 2019 at 0816 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Southern%20Aircraft%20Consultancy_0", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "Yes", "site": "Mountains", "schedule": "Goose Bay - Narsarsuaq", "msn": "46-36657", "yom": 2015, "flight_number": null, "city": "Makkovik", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3500, "captain_hours_type": 20, "copilot_hours": 1300, "copilot_hours_type": 0, "aircraft_hours": null, "circumstances": "On 01 May 2019 at 0723, the aircraft departed CYYR on a VFR flight plan direct to BGBW. The ferry pilot, who was the pilot-in-command, occupied the left seat while the co-owner occupied the right seat. The aircraft climbed to 2000 feet ASL and proceeded on a direct track to destination. The altitude and heading did not change significantly along the route, therefore it is likely that the autopilot was engaged. At 0816, the aircraft collided with a snow-covered hill 2250 feet in elevation, located 35 nautical miles (NM) southeast of Makkovik Airport (CYFT), Newfoundland and Labrador. The impact happened approximately 200 feet below the top of the hill. The aircraft came to rest in deep snow on steep sloping terrain. The aircraft sustained significant damage to the propeller, nose gear, both wings, and fuselage. Although the cabin was crush-damaged, occupiable space remained. There was no post-impact fire. The ferry pilot was seriously injured and the co-owner was fatally injured. The Joint Rescue Coordination Centre (JRCC) in Halifax received an emergency locator transmitter (ELT) signal from the aircraft at 0823. The ferry pilot carried a personal satellite tracking device, a personal locator beacon (PLB) and a handheld very high frequency (VHF) radio, which allowed communication with search and rescue (SAR). Air SAR were dispatched to the area; however, by that time, the weather had deteriorated to blizzard conditions and aerial rescue was not possible. Ground SAR then deployed from the coastal community of Makkovik and arrived at the accident site approximately 4 hours later because of poor weather conditions and near zero visibility. The ferry pilot and the body of the co-owner were transported to Makkovik by snowmobile. The following day, they were airlifted to CYYR.", "probable_cause": "Controlled flight into terrain. "}