{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-muskogee-6-killed", "date": "Jan 5, 1991 at 2043 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Ronnie Ray Shanks", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Muskogee - Albuquerque", "msn": "421B-0516", "yom": 1973, "flight_number": null, "city": "Muskogee", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 1820, "captain_hours_type": 684, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2580, "circumstances": "A pilot (whose instrument currency could not be determined) took off at night in IMC. Shortly after takeoff, the aircraft crashed about 1.5 mile from the departure end of the runway. There was evidence that it impacted in an 85° right bank, nose down attitude at high speed. No preimpact part failure was found during the investigation; however, during a pre-purchase inspection on 10/16/90, several discrepancies were noted. These included an inop flight director, an autopilot malfunction and a misrigged flight control system that allowed the control wheel to indicate a left turn when the aircraft was in level flight. There was no record of these being repaired. Records showed the pitot-static system was last tested on 3/24/88. The pilot was taking sine-aid and tylenol for a chronic sinus infection. Although tox checks indicated the presence of 50.7 ug/ml of pseudoephedrine and 36.4 ug/ml of acetaminophen in the pilot's urine, none was found in his blood. The sinus cond could have affected the pilot's balance and equilibrium. All six occupants were killed. ", "probable_cause": "The pilot's failure to maintain control of the aircraft, due to spatial disorientation. Factors related to the accident were: darkness, adverse weather conditions, and the pilot's physical impairment from the chronic sinus infection."}