{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-500a-ketchikan-2-killed", "date": "Sep 6, 1997 at 1300 LT", "type": "Rockwell Aero Commander 500", "operator": "Robert Kirke Dent", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Wrangell – Everett", "msn": "500-908-17", "yom": 1960, "flight_number": null, "city": "Ketchikan", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2577, "captain_hours_type": 81, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6679, "circumstances": "The aircraft had an in-flight breakup when the left wing and tail section separated. Post accident inspection revealed a right engine main fuel supply line progressive rupture, only trace amounts of fuel in the fuel lines, and no rotational damage to the right engine. Pre accident, long term, fuel leak evidence surrounded the ruptured line. The right propeller was not feathered. The left wing D-tube rib at station 127 exhibited compressive buckling. Left wing fractures were upward, and horizontal stabilizer deformation was downward. During an actual loss of engine power in the airplane 17 months before this accident, the pilot had feathered the incorrect propeller. Both a mechanic, and an FAA safety counselor, who were familiar with the pilot, described him as able to be disoriented, and reliant on GPS for navigation. He had stated five months before the accident that he did not feel his instrument flying skills were proficient, and desired training. On the day of the accident, weather was visual meteorological conditions, with layered clouds above 2,200 feet mean sea level. The pilot stated to the FAA weather briefer that he wanted to make the flight under visual conditions. The flight route and altitude was unknown. ", "probable_cause": "The rupture of the right engine fuel supply line as a result of inadequate inspection by the pilot/mechanic, and the pilot's excessive pull up which resulted in exceeding the design stress limits of the airplane. Factors were the improper emergency procedures and failure to feather the propeller. "}