{"url": "https://www.baaa-acro.com/crash/crash-learjet-25-ithaca-2-killed", "date": "Aug 24, 2001 at 0542 LT", "type": "Learjet 25", "operator": "Ameristar%20Jet%20Charter2", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Ithaca – Jackson", "msn": "25-053", "yom": 1970, "flight_number": null, "city": "Ithaca-Tompkins", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4826, "captain_hours_type": 760, "copilot_hours": 3634, "copilot_hours_type": 377, "aircraft_hours": 12486, "circumstances": "While departing from the airport, with the second-in-command (SIC) at the controls, the airplane impacted a fence, and subsequently the ground about 1,000 feet beyond the departure end of the runway. A witness on the ramp area south of the runway, stated that he heard the engines spool up; however, due to the fog, he could only see the strobe lights on the airplane. He then observed the airplane rotate about 3,500 feet from the departure end of the runway and begin to climb at a steep angle, before losing sight of it when it was about 150 feet above ground level. The weather reported, at 0550 was, calm winds; 1/2 statute miles of visibility, fog; overcast cloud layer at 100 feet; temperature and dew point of 17 degrees Celsius. Excerpts of the cockpit voice recorder (CVR) transcript revealed that the flightcrew discussed the prevailing visibility at the airport on numerous occasions, and indicated that it appeared to be less than one mile. Examination of the wreckage revealed no anomalies with the airframe or engines. According to the FAA Instrument Flying Handbook, \"Flying in instrument meteorological conditions (IMC) can result in sensations that are misleading to the body's sensory system...A rapid acceleration, such as experienced during takeoff, stimulates the otolith organs in the same way as tilting the head backwards. This action creates the somatogravic illusion of being in a nose-up attitude, especially in situations without good visual references. The disoriented pilot may push the aircraft into a nose-low or dive attitude.\"", "probable_cause": "The pilot's failure to maintain a proper climb rate while taking off at night, which was a result of spatial disorientation. Factors in the accident were the low visibility and cloud conditions, and the dark night."}