{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-850-iowa-city-1-killed", "date": "Jun 3, 2008 at 1007 LT", "type": "Socata TBM-850", "operator": "Angel Flight Central", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Iowa City - Decatur", "msn": "412", "yom": 2007, "flight_number": null, "city": "Iowa City", "zone": "Iowa", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5688, "captain_hours_type": 4138, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 420, "circumstances": "The private pilot arrived at the accident airport as part of an Angel Flight volunteer program to provide transportation of a passenger who had undergone medical treatment at a local hospital. About 0937, the airplane landed on runway 30 (3,900 feet by 150 feet) with winds from 073-080 degrees and 5-6 knots, which continued to increase due to an atmospheric pressure gradient. The pilot met the passengers and departed the terminal about 1003, with winds at 101-103 degrees and 23-36 knots. About 1005 the airplane was near the approach end of runway 30 with wind from 089-096 degrees and 21-31 knots. The pilot stated that he began rotating the airplane about 3,000 feet down the runway. About 1006, the airplane was approximately 3,553 feet down the runway while flying about 30 feet above the runway. The airplane experienced an aerodynamic stall, and the left wing dropped before it impacted the ground. No mechanical anomalies that would have precluded normal operation of the airplane were noted during the investigation. The fatally injured passenger, who had received medical treatment, was 2 years and 10 months of age at the time of the accident. She was held by her mother during the flight, as she had been on previous Angel Flights, but was otherwise unrestrained. According to 14 CFR 91.107(3), each person on board a U.S.-registered civil aircraft must occupy an approved seat with a safety belt properly secured during takeoff, and only unrestrained children who are under the age of 2 may be held by a restrained adult. Although the accident was survivable (both the pilot and the adult passenger survived with non-life-threatening injuries), an autopsy performed on the child revealed that the cause of death was blunt force trauma of the head.", "probable_cause": "The pilot's improper decision to depart with a preexisting tailwind and failure to abort takeoff. Contributing to the severity of the injuries was the failure to properly restrain (FAA-required) the child passenger."}