{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900d-kayenta", "date": "Feb 22, 2008 at 0745 LT", "type": "Beechcraft 1900D", "operator": "Peabody%20Energy", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Flagstaff – Kayenta", "msn": "UE-299", "yom": 1997, "flight_number": null, "city": "Kayenta-Peabody Bedard Field", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 18, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5080, "captain_hours_type": 2700, "copilot_hours": 5524, "copilot_hours_type": 4207, "aircraft_hours": 6497, "circumstances": "The captain initially flew the GPS (global positioning system) runway 2 approach down to minimums and executed a missed approach. The approach chart listed the minimum visibility for the straight-in approach as 1 mile, the minimum descent altitude (MDA) as 6,860 feet mean sea level (329 feet above ground level), and the missed approach point as the runway threshold. The audio information extracted from the CVR indicated the flight crew listened to the automated weather station at the airport twice during the second approach; both times the report stated, in part, \"visibility one half [mile] light snow sky conditions ceiling two hundred broken one thousand overcast.\" At 0744:09, the first officer said, \"there's MDA,\" and at 0744:27, \"there's the runway right below ya.\" The CVR recorded the ground proximity warning system (GPWS) audio alert \"sink rate, sink rate, sink rate, sink rate\" at 0744:37, the sound of touchdown at 0744:52, and the sound of impact at 0745:00. According to both pilots, the airplane touched down even with the midfield windsock. The captain applied brakes and full reverse on both propellers; however, the airplane did not slow down and continued off the end of the runway, impacted and knocked down a chain link fence, and continued into downsloping rough terrain. The landing gear collapsed and the airplane slid to a stop. The operator reported that there was 2 to 3 inches of slush on the runway. The runway was equipped with pilot activated medium intensity runway lights, runway end identifier lights, and a visual approach slope indicator. The first officer said that on both approaches, he attempted to turn on the lights, but the lights did not activate. The Federal Aviation Regulation that specifies the instrument flight rules for takeoff and landing states, in part, that no pilot may operate an aircraft below the authorized MDA unless (1) the aircraft is continuously in a position from which a descent to a landing on the intended runway can be made at a normal rate of descent using normal maneuvers, and (2) the flight visibility is not less than the visibility prescribed in the standard instrument approach being used. The regulation further states that if these conditions are not met when the aircraft is being operated below the MDA or upon arrival at the missed approach point, the pilot shall immediately execute an appropriate missed approach procedure. In this case, the minimum required visibility was 1 mile versus the 1/2- mile visibility reported by the automated weather station. Additionally, the activation of the GPWS \"sink rate\" audio alert indicates a normal rate of descent was exceeded during the  landing. Both of these conditions should have prompted the flight crew to execute a missed approach, which would have prevented the accident.", "probable_cause": "The flight crew's failure to execute a missed approach, which resulted in a runway excursion after landing. Contributing to the accident were the inoperative lights, weather conditions below published approach minimums, and the slush contaminated runway.\n"}