{"url": "https://www.baaa-acro.com/crash/crash-cessna-560-citation-v-carlsbad-4-killed", "date": "Jan 24, 2006 at 0640 LT", "type": "Cessna 560 Citation V", "operator": "Goship Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sun Valley - Carlsbad", "msn": "560-0265", "yom": 1994, "flight_number": null, "city": "Carlsbad", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 17000, "captain_hours_type": null, "copilot_hours": 7500, "copilot_hours_type": null, "aircraft_hours": 4720, "circumstances": "Air traffic control cleared the flightcrew for the instrument landing system (ILS) approach to runway 24, which was 4,897 feet long. The flightcrew then reported that they had the runway in sight, cancelled their instrument flight rules (IFR) clearance, and executed a visual flight rules (VFR) approach in VFR conditions to the airport. The reported winds favored a landing toward the east, onto the opposite runway (runway 6). During the approach, after a query from the first officer, the captain indicated to the first officer that he was going to \"...land to the east,\" consistent with the reported winds. However, the final approach and subsequent landing were made to runway 24, which produced a six-knot tailwind. During the approach sequence the captain maintained an airspeed that was approximately 30 knots higher than the correct airspeed for the aircraft's weight, resulting in the aircraft touching down about 1,500 feet further down the runway than normal, and much faster than normal. The captain then delayed the initiation of a go-around until the first officer asked if they were going around. Although the aircraft lifted off the runway surface prior to departing the paved overrun during the delayed go-around it impacted a localizer antenna platform, whose highest non-frangible structure was located approximately 304 feet past the end of the runway, and approximately two feet lower than the terrain at the departure end of the runway. The aircraft continued airborne as it flew over downsloping terrain for about 400 more feet before colliding with the terrain and a commercial storage building that was located at an elevation approximately 80 feet lower than the terrain at the end of the runway. The localizer antenna platform was located outside of the designated runway safety area, and met all applicable FAA siting requirements. The captain had type 2 diabetes, for which he took oral medication and monitored blood sugar levels. He did not reveal his history of diabetes to the FAA. The captain's post-accident toxicology testing was consistent with an elevated average blood sugar level over the previous several months; however, no medical records of the captain's treatment were available, and the investigation could not determine if the captain's diabetes or treatment were potentially factors in the accident. The captain of the accident flight was the sole owner of a corporation that was asked by the two owners of the accident airplane to manage the airplane for them under a Part 91 business flight operation. The two owners were not pilots and had no professional aviation experience, but they desired to be flown to major domestic airports so that they could transfer and travel internationally via commercial airlines. One of the two owners stated that the purpose of the accident flight was to fly a businessman to a meeting, and to also transport one of the owner's wives to visit family at the same destination. According to one of the owners, the businessman was interested in being a third owner in the accident airplane, so the owner permitted the businessman to fly. The owner also stated that the accident pilot told him that the passenger would pay for expenses directly related to the operation of the airplane for the flight (permitted under FAA Part 91 rules), and an \"hourly fee\" (prohibited under FAA Part 91 rules); however, no documentation was found to corroborate this statement for the accident flight or previous flights.", "probable_cause": "The captain's delayed decision to execute a balked landing (go-around) during the landing roll. Factors contributing to the accident include the captain's improper decision to land with a tailwind, his excessive airspeed on final approach, and his failure to attain a proper touchdown point during landing."}