{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-near-mcgrath-1-killed", "date": "Aug 27, 2004 at 1600 LT", "type": "De Havilland DHC-3 Otter", "operator": "Mavrik%20Aire", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Kenai – McGrath – Kotzebue", "msn": "197", "yom": 1957, "flight_number": null, "city": "McGrath", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10500, "captain_hours_type": null, "copilot_hours": 210, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airline transport certificated pilot was conducting a VFR cross-country business flight, transporting cargo and personnel to a remote airport. The accident airplane was one of two airplanes transporting supplies for a hunting/fishing company, traveling a multi-segment route. The pilot was accompanied by a pilot-rated passenger occupying the right front seat, and a second passenger seated behind the pilot. The pilot obtained a weather briefing from the FAA, which included AIRMETs for mountain obscuration, and IFR conditions due to low ceilings and visibility in smoke, light rain and mist. The pilot said that when he took off on the accident flight, the visibility was 1 to 3 miles in smoke, haze, and fog, but was VFR. He recalled hazy conditions in which he could see rolling hills and river cuts. The pilot-rated passenger was initially flying the airplane. Upon entering lowering visibility, the pilot said he reassumed control of the airplane, and attempted a 180 degree turn to clear the low visibility area, but collided with trees and crashed. The rear seat passenger reported that the accident airplane was flying about 500 to 1,000 feet above the ground because of smoke and fog. He estimated the visibility at takeoff was about 1 mile. About 30 minutes after departure, the airplane was flying over mountainous terrain, and appeared to be following a canyon. The passenger said that the visibility decreased due to fog. He said that the airplane's throw-over control yoke was initially positioned in front of the right seat, pilot-rated passenger, when suddenly a mountain ridge appeared in front of the airplane. The pilot repositioned the control yoke in front of the left seat, banked the airplane to the left, and added engine power. Within a few seconds, the passenger indicated that he felt the airplane collide with several trees and then descend to the ground. The airplane came to rest upright with extensive fuselage damage, about 1,400 feet msl. One wing was torn off the airframe. A postcrash fire consumed the wreckage. A terminal forecast for the airport of departure included few clouds at 500 feet, and visibilities as low as 3 miles in smoke and mist. The destination airport for the accident flight segment had few clouds at 100 feet, and visibilities as low as 2 1/2 miles.", "probable_cause": "The pilot's inadequate in-flight planning/decision making, his continued VFR flight into instrument meteorological conditions, and his failure to maintain obstacle clearance. Factors contributing to the accident were low ceilings due to smoke, rain, and mist."}