{"url": "https://www.baaa-acro.com/crash/crash-saab-340b-nassenwil-10-killed", "date": "Jan 10, 2000 at 1756 LT", "type": "Saab 340", "operator": "Crossair.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Zurich - Dresden", "msn": "213", "yom": 1990, "flight_number": "LX498", "city": "Nassenwil", "zone": "Zurich", "country": "Switzerland", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 8452, "captain_hours_type": 1870, "copilot_hours": 2332, "copilot_hours_type": 1162, "aircraft_hours": 21676, "circumstances": "Aircraft HB-AKK had landed in Zurich on 10 January 2000 as Crossair flight CRX 842 from Guernsey and reached stand F74 at 16:00 UTC, which is located near to the threshold of runway 28. The aircraft was then prepared for the next flight at this stand. According to statements from the Swissport ground personnel the preparation of the aircraft took place without any special occurrence. During its time on the ground, the aircraft was supplied with electric power by a ground power unit (GPU). An air-conditioning truck was not used and the aircraft was not de-iced. The crew prepared for the flight using the computer-aided briefing system. The following description of the history of the flight was reconstructed with the help of recordings from the cockpit voice recorder (CVR), digital flight data recorder (DFDR), voice radio communications and ATC radar (cf. Annex 1). According to the available recordings, the commander, as planned by the crew, was pilot flying (PF) and the first officer was pilot non flying (PNF) throughout the flight. At 16:39:14 UTC, flight CRX 498 to Dresden received from clearance delivery (DEL) the following ATC-clearance: \"runway two eight, Dresden, Zurich East One Yankee Departure, squawk three zero zero four\". The crew was then instructed to change to the apron (APR) frequency. Permission to start engines was given at 16:45:00 UTC by APR. At 16:49:22 UTC the first officer signaled readiness to taxi to APR. While the crew waited for taxi clearance, a few points of the taxi checklist were performed. At 16:50:30 UTC APR cleared flight CRX 498 to follow a Swissair Airbus A320 (SWR 014) to the holding position of runway 28. In accordance with this clearance, CRX 498 started to move. The flight crew performed the outstanding items on the taxi checklist and contacted the tower (TWR), which gave line-up clearance at 16:52:36 UTC. Take-off clearance was given at 16:54:00 UTC: \"Crossair four nine eight, wind three zero zero degrees, three knots, cleared take-off runway two eight\". According to the automatic terminal information service (ATIS) at 16:50 UTC the following meteorological conditions existed: wind 290° at 2 knots, visibility 6 km in drizzle, broken, cloud base at 500 feet above ground level, temperature 2 °C, dew point 1 °C, QNH 1032 hPa. The aircraft began its take-off roll at 16:54:10 UTC in darkness. The landing lights were on and the flaps were fully retracted. After take-off at 16:54:31 UTC the landing gear was retracted. Then, on the commander's order, the flight director (FD) was switched on and the NAV mode was armed. Both pilots confirmed that the long range navigation system number 1 (LRN 1) was following the track (LRN 1 captured). The commander controlled the aircraft in a stable climb with a pitch of 15° attitude nose up (ANU) and a speed of 136 knots indicated airspeed (KIAS). For the remaining flight, the autopilot was never engaged. Since the cloud base was indicated as 500 ft above ground level (AGL), it can be assumed that the aircraft, once above an altitude of approx. 1900 ft above mean sea level (AMSL) entered instrument meteorological conditions (IMC). The initial flight path, at a heading of 276°, followed the centre line of the runway. After the request from TWR, CRX 498 switched to the departure control frequency (DEP) at 16:55:07 UTC. The radar recording then showed a deviation in the flight path by 5° to the south. However, this slight deviation was reduced before waypoint DME 2.1 KLO was reached by initiating a right turn. At 16:55:15 UTC flight CRX 498 was cleared to climb to flight level 110. At 16:55:39 UTC, Zurich departure issued the instruction to turn to VOR ZUE: \"four nine eight, turn left to Zurich East\". The first officer confirmed by radio: \"turning left to Zurich East, Crossair four niner eight\". At the same time the aircraft reached waypoint DME 2.1 KLO. At this point the departure procedure ZUE1Y specifies a left turn, in order to capture and follow radial 255 of VOR KLO. At 16:55:45 the bank angle to the left reached a maximum of 16.9° on a compass heading of 270°. At 16:55:47 UTC the first officer informed the commander that the LRN system was programmed from the present position to ZUE: \"from present, LRN is to Zurich East, yeah\". The commander confirmed with: \"checked\". The left turn instruction from DEP was not mentioned. After the aircraft had remained briefly at a 16° bank angle to the left, it began to roll to the right. From 16:55:47 UTC the bank angle rate amounted to 3°/s to the right. In this phase the first officer was very busy carrying out the orders routinely issued by the commander (\"CTOT/APR off, yaw damper on, bleed air on\"). All relevant flight parameters in this phase indicated a stable climb with a pitch of 13-14° ANU. The communication being conducted internally did not give any indication of difficulties of any kind. At 16:55:55 UTC, at a bank angle of 8.4° to the right, the bank angle rate increased and the nose of the aircraft began to drop from 14.2° to 10.8° ANU. At 16:56:00 UTC the right bank angle attained a value of 31.0°, when the commander gave the order to set climb power: \"set climb power\". The first officer confirmed with a whispered \"coming\" and began to set the climb power – a procedure which takes quite some time. Between 16:56:03 UTC and 16:56:10 UTC the commander stabilized the bank angle to the right between 39° and 42° by corresponding flight control inputs. The pitch reduced further and stabilized at a value of 1° ANU at 16:56:06 UTC as a result of corresponding elevator inputs for four seconds. As a consequence, the trajectory reached its maximum altitude of 4720 ft AMSL. According to information from the crew of the preceding flight SWR 014 the cloud top at that time was approx. 5000 ft AMSL. The speed of the aircraft involved in the accident increased to 158 KIAS. 16:56:10 UTC marked the beginning of a nine-second period which was characterized by destabilization of the attitude. It featured uncoordinated deflections of the ailerons to the left and right. Meanwhile, the elevator remained practically in the neutral position. Since the rightward deflections of the aileron were dominant, the bank angle increased from 42° to 80° to the right. Given the neutral position of the elevator, because of the high bank angle the pitch increased to 25° attitude nose down (AND). The aircraft therefore quickly lost altitude and its speed increased to 207 KIAS. At 16:56:12 UTC the first officer made the commander aware that they should turn left to ZUE: \"turning left to Zurich East, we should left\". At 16:56:15 UTC, at a bank angle of 65.8° to the right, the commander muttered unclearly: \"ohna-na\". Three seconds later at 16:56:18 UTC, DEP requested confirmation that the aircraft was turning to the left: \"Crossair four nine eight, confirm you are turning left\". The first officer responded immediately: \"moment please, standby\". DEP then instructed the crew to continue the right turn: \"ok, continue right to Zurich East.\" In the final phase of flight, beginning at 16:56:20 UTC, the aircraft went into a spiral dive. As a result of massive aileron deflections, the aircraft attained a maximum bank angle of 137° to the right. The engines still provided high power, since setting of climb power had not yet been terminated. At a speed of 250 KIAS the over speed warning horn sounded. At 16:56:24 UTC the first officer vigorously warned the commander to turn left: \"turning left, left, left, left... left!\" At the end of the data recording at 16:56:25 UTC the aircraft still exhibited a bank angle of 76° to the right. The nose of the aircraft had dropped to 63° AND at an air speed of 285 KIAS. Several witnesses observed the aircraft breaking out of the clouds in a steep descent and performing a right turn. At 16:56:27.2 UTC the aircraft crashed in an open field near Au, Nassenwil, ZH. None of the three crew members and seven passengers survived the impact. ", "probable_cause": "The accident is attributable to a collision with the ground, after the flight crew had lost control of the aircraft for the following reasons:\r\n• The flight crew reacted inappropriately to the change in departure clearance SID ZUE 1Y by ATC.\r\n• The co-pilot made an entry in the FMS, without being instructed to do so by the commander, which related to the change to the SID ZUE 1 standard instrument departure. In doing so, he omitted to select a turn direction.\r\n• The commander dispensed with use of the autopilot under instrument flight conditions and during the work-intensive climb phase of the flight.\r\n• The commander took the aircraft into a spiral dive to the right because, with a probability bordering on certainty, he had lost spatial orientation.\r\n• The first officer took only inadequate measures to prevent or recover from the spiral dive. \r\nThe following factors may have contributed to the accident:\r\n• The commander remained unilaterally firm in perceptions which suggested a left turn direction to him.\r\n• When interpreting the attitude display instruments under stress, the commander resorted to a reaction pattern (heuristics) which he had learned earlier.\r\n• The commander’s capacity for analysis and critical assessment of the situation were possibly limited as a result of the effects of medication.\r\n• After the change to standard instrument departure SID ZUE 1Y the crew set inappropriate priorities for their tasks and their concentration remained one-sided.\r\n• The commander was not systematically acquainted by Crossair with the specific features of western systems and cockpit procedures."}