{"url": "https://www.baaa-acro.com/crash/crash-blackburn-b-101-beverley-c1-near-raf-abingdon-20-killed", "date": "Mar 5, 1957 at 1100 LT", "type": "Blackburn B-101 Beverley", "operator": "Royal-Air-Force-4", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "City", "schedule": "Abingdon – Akrotiri", "msn": "1023", "yom": 7, "flight_number": null, "city": "Abingdon AFB", "zone": "Oxfordshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 3, "pax_on_board": 17, "pax_fatalities": 15, "other_fatalities": 2, "total_fatalities": 20, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed RAF Abingdon at 1042LT bound for RAF Akrotiri in Cyprus. It was carrying cargo, a relief crew, eight RAF police dog handlers and eight police dogs. There was low cloud at 500 feet (150 m), visibility was less than 1,000 feet (300 m), and an easterly wind of 10 knots (19 km/h). As the aircraft climbed, the engine number one developed a fuel leak. The flight crew responded by shutting down the engine and feathering its propeller. The flight crew declared an emergency and requested a blind approach to RAF Abingdon. The controller alerted emergency services on the ground. A short time later, cockpit instruments alerted the flight crew to a large loss of fuel from No. 2 fuel tank, the second of four such tanks in the port wing. In an effort to stop the leak, the crew de-activated the fuel cocks and boosters for the No. 2 tank, but left them on for the No. 1 tank. As the Beverley turned on to final approach for RAF Abingdon the crew attempted to increase power from the remaining three Bristol Centaurus engines but No. 2 engine – also on the port wing – failed to respond and the aircraft began to lose speed and height. Knowing he could not reach the airfield, the captain tried to land in a field. However, the aircraft became uncontrollable and struck a number of high tension cables and a group of elm trees that tore the port wing from the fuselage. On impact with the ground, the aircraft destroyed a caravan and a prefabricated house before somersaulting and crashing upside down. Eighteen occupants were killed, among them three crew members, and two people on the ground. ", "probable_cause": "A Board of Inquiry investigated the crash and found it was caused by loss of power from Nos. 1 and 2 engines, both mounted on the port wing. George Ward told the House of Commons that \"the four fuel tanks on the port side of the Beverley feed into a collector box from which the two port engines are fed. From the available evidence, including inspections of part of the aircraft's fuel system, it is clear that a non-return valve between No. 1 (port) tank and the collector box had been fitted in reverse and that the fuel supply from Nos. 3 and 4 (port) tanks were switched off throughout the flight.\" Ward continued, saying that the loss of power from No. 1 was caused by it being shut down as a precautionary measure, and the fuel starvation to No. 2 engine was caused by an incorrectly fitted non-return valve in the supply line from No. 1 fuel tank. No. 2 fuel tank had been isolated and two smaller fuel tanks in the port wing had not been selected during the flight. The tradesman who had fitted the valve, and his supervisor, were prosecuted and charged, and the technician was court-martialled for negligence and punished with a reprimand. The Board also noted that some fuel was available from two smaller tanks but they were not used during the flight, and that the captain \"must bear some responsibility\" for not using those tanks. Ward said, however, that \"owing to the nature of the flight the amount of fuel in the two smaller tanks was not large, and it can only be assumed that the captain had no reason to believe that both port engines would not operate satisfactorily off the two main port tanks individually.\" The captain was killed in the accident and no allegations were brought against him or any of his crew."}