{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-580f-paraparaumu-2-killed", "date": "Oct 3, 2003 at 2125 LT", "type": "Convair CV-580", "operator": "Air%20Freight%20NZ", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Christchurch – Palmerston North", "msn": "17", "yom": 1952, "flight_number": "AFZ642", "city": "Paraparaumu-Kapiti Coast", "zone": "Greater Wellington Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 16928, "captain_hours_type": 3286, "copilot_hours": 20148, "copilot_hours_type": 194, "aircraft_hours": 66660, "circumstances": "On Friday 3 October 2003, Convair 580 ZK-KFU was scheduled for 2 regular return night freight flights from Christchurch to Palmerston North. The 2-pilot crew arrived at the operatorís base on Christchurch Aerodrome at about 1915 and together they checked load details, weather and notices for the flight. The flight, using the call sign Air Freight 642 (AF642), was to follow a standard route from Christchurch to Palmerston North via Cape Campbell non-directional beacon (NDB), Titahi Bay NDB, Paraparaumu NDB and Foxton reporting point. The pilots completed a pre-flight inspection of ZK-KFU and at 2017 the co-pilot (refer paragraph 1.10.4) called Christchurch Ground requesting a start clearance. The ground controller approved engine start and cleared AF 642 to Palmerston North at flight level 210 (FL 210) and issued a transponder code of 5331. The engines were started and the aircraft taxied for take-off on runway 20. At 2032 AF 642 started its take-off on schedule and tracked initially south towards Burnham NDB before turning right for Cape Campbell NDB, climbing to FL210. The flight progressed normally until crossing Cook Strait. After crossing Cape Campbell NDB, the crew changed to the Wellington Control frequency and at 2108 advised Wellington Control that AF 642 was at FL210, and requested to fly directly to Paraparaumu NDB. The change in routing was common industry practice and offered a shorter distance and flight time with no safety penalty. The Wellington controller approved the request and AF 642 tracked directly to Paraparaumu NDB. At 2113 the Wellington controller cleared AF 642 to descend initially to FL130 (13 000 feet (ft)). The co-pilot acknowledged the clearance. At 2122 the Wellington controller cleared AF 642 for further descent to 11 000 ft, and at 2125 instructed the crew to change to the Ohakea Control frequency. At 2125:14, after crossing Paraparaumu NDB, the co-pilot reported to Ohakea Control that AF 642 was in descent to 11 000 ft. The Ohakea controller responded 'Air Freight 642 Ohakea good evening, descend to 7000 ft. Leave Foxton heading 010, vectors [to] final VOR/DME 076 circling for 25. Palmerston weather Alfa, [QNH] 987.' At 2125:34 the co-pilot replied ìRoger down to 7000 and leaving Foxton heading 010 for 07 approach circling 25 and listening for Alfa. Air Freight 642. At 2125:44 the Ohakea controller replied 'Affirm, the Ohakea QNH 987.' The crew did not respond to this transmission. A short time later the controller saw the radar signature for AF 642 turn left and disappear from the screen. At 2126:17 the Ohakea controller attempted to contact AF 642 but there was no response from the crew. The controller telephoned Police and a search for AF 642 was started.  Within an hour of the aircraft disappearing from the radar, some debris, later identified as coming from AF 642, was found washed ashore along Paraparaumu Beach. Later in the evening an aerial search by a Royal New Zealand Air Force helicopter using night vision devices and a sea search by local Coastguard vessels located further debris offshore. After an extensive underwater search lasting nearly a week, aircraft wreckage identified as being from ZK-KFU was located in an area about 4 km offshore from Peka Peka Beach, or about 10 km north of Paraparaumu. Police divers recovered the bodies of the 2 pilots on 11 October and 15 October. ", "probable_cause": "The following findings were identified:\r\nFindings are listed in order of development and not in order of priority.\r\n- The crew was appropriately licensed and fit to conduct the flight.\r\n- The captain was an experienced company line-training captain, familiar with the aircraft and route.\r\n- The co-pilot while new to the Convair 580 was, nevertheless, an experienced pilot and had flown the route earlier in the week.\r\n- The aircraft had a valid Certificate of Airworthiness and was recorded as being serviceable for the flight.\r\n- The estimated aircraft weight and balance were within limits at the time of the accident.\r\n- With a serviceable weather radar the weather was suitable for the flight to proceed.\r\n- The captain was the flying pilot for the flight from Christchurch to Palmerston North.\r\n- The flight proceeded normally until the aircraft levelled after passing Paraparaumu NDB.\r\n- Why the aircraft was levelled at about 14 400 ft was not determined, but could have been because of increasing or expected turbulence.\r\n- The weather conditions at around the time of the accident were extreme.\r\n- The aircraft descended through an area of forecast severe icing, which was probably beyond the capabilities of the aircraft anti-icing system to prevent ice build-up on the wings and tailplane.\r\n- The crew was probably aware of the presence of icing but might not have been aware of the likely speed and the extent of ice accretion.\r\n- The rate of ice accretion might have left insufficient time for the crew to react and prevent the aircraft stalling.\r\n- The transponder transmissions were impaired probably due to ice build-up on the aerials.\r\n- The aircraft probably stalled because of a rapid build-up of ice, pitching the aircraft nose down and probably disorientating the crew. This could have resulted from a tailplane stall.\r\n- Although the aircraft controls were probably still functional in the descent, a very steep nose down attitude, high speed and a potentially stalled tailplane, made recovery very unlikely.\r\n- Under a combination of high airspeed and G loading, the aircraft started to break-up in midair, probably at about 7000 ft.\r\n- Although there was no evidence to support the possibility of a mechanical failure or other catastrophic event contributing to the accident, given the level of destruction to ZK-KFU and that some sections of the aircraft were not recovered, these possibilities cannot be fully ruled out. \r\n- The crew of AF 642 not being advised of the presence of a new SIGMET concerning severe icing should not have affected the pilotsí general awareness of the conditions being encountered.\r\n- Had the crew been aware of the new SIGMET it might have caused them to be more alert to icing.\r\n- Pilots awareness of the presence of potentially hazardous conditions would be increased if other pilots commonly sent AIREPs when such conditions were encountered.\r\n- Operatorsí manuals, especially for IFR operators, might contain inadequate and misleading information for flight in adverse weather conditions.\r\n- The search for the aircraft and pilots was competently handled in adverse conditions. \r\n- The regular mandatory checks of the CVR failed to show that it was not recording on all channels.\r\n- The lack of any intra cockpit voice recordings hampered and prolonged the investigation. \r\n-  The DFDR data and available CVR recordings provided limited but valuable information for the investigation.\r\n- Had more modern and capable recorders been installed on ZK-KFU, significantly more factual information would have be available for the investigation, thus enhancing the investigation and increasing the likelihood of finding a confirmed accident cause, rather than a probable one.\r\n- Had suitable ULB tracking equipment been available, the finding of the wreckage and recovery of the recorders would have been completed more promptly.\r\n- The lack of tracking equipment could have resulted in the recorders not being found, and possibly even the wreckage not being found had it been in deeper water."}