{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-wichita-1-killed", "date": "Nov 6, 2012 at 0745 LT", "type": "Cessna 208B Grand Caravan", "operator": "FedEx", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Wichita - Garden City", "msn": "208B-0291", "yom": 1991, "flight_number": "FDX8588", "city": "Wichita-Dwight D. Eisenhower (Mid-Continent)", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 15200, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10852, "circumstances": "The aircraft was substantially damaged when it collided with a hedgerow during a forced landing following a loss of engine power near Wichita, Kansas. The loss of engine power occurred about 4-1/2 minutes after departing Wichita Mid-Continent Airport (ICT), Wichita, Kansas. The commercial pilot, who was the sole occupant, was fatally injured. The airplane was registered to the Federal Express Corporation and operated by Baron Aviation Services Incorporated, under the provisions of 14 Code of Federal Regulations Part 135 while on an instrument flight plan. Day visual meteorological conditions prevailed for the cargo flight that had the intended destination of Garden City Regional Airport (GCK), Garden City, Kansas. According to air traffic control transmissions, at 0734:35 (hhmm:ss), the pilot requested an instrument flight rules clearance from ICT to GCK. Radar track data indicated that the airplane departed runway 19R approximately 0737:45. At 0738:18, the tower controller told the pilot to change to the departure control frequency. The departure controller then cleared the flight to proceed direct to GCK and to climb to 8,000 ft mean sea level (msl). The airplane continued to climb on a westerly heading until 0742:02, at which time the airplane began a left 180-degree turn back toward the departure airport. According to radar data, the airplane had reached 4,700 ft msl when it began the left turn. At 0742:13, the pilot transmitted that his airplane had experienced a loss of engine power and that he was attempting to return to the departure airport. At 0742:31, the pilot asked if there were any nearby airports because he was unable to reach ICT. The departure controller provided vectors toward an airstrip that was approximately 2.5 miles southeast of the airplane's position. At 0743:46, the pilot advised that he could not see the airstrip because the airplane's windshield was contaminated with oil. At 0744:57, the pilot's final transmission was that he was landing in a grass field. The airplane was located about 2.2 miles south of ICT at 1,600 feet msl, about 300 feet above ground level (agl) at the time of the last transmission. The radar data continued northeast another 1/2 mile before radar contact was lost at 0745:15. A witness to the accident reported that he was outside his residence when he observed the accident airplane overfly his position. He recalled that the airplane's propeller was not rotating and that he did not hear the sound of the engine operating. He stated that the airplane landed in a nearby agricultural field on a northeast heading. He reported that during the landing rollout the airplane impacted a hedgerow located at the northern edge of the field. The witness indicated that the pilot was unresponsive when he arrived at the accident site and that there was a small grass fire located 8 to 10 feet in front of the main wreckage.", "probable_cause": "The total loss of engine power as a result of a fractured compressor turbine blade due to high-cycle fatigue."}