{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b60-duke-big-spring", "date": "Jan 29, 2020 at 1710 LT", "type": "Beechcraft 60 Duke", "operator": "7X%20Oilfield%20Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Abilene – Midland", "msn": "P-303", "yom": 1974, "flight_number": null, "city": "Big Spring", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 25000, "captain_hours_type": 7, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was conducting a cross-country flight at a cruise altitude of 10,500 ft mean sea level when the left engine lost all power. He secured the engine and elected to continue to his destination. Shortly thereafter, the right engine lost all power. After selecting an airport for a forced landing, he overflew the runway and entered the pattern. The pilot stated that on short final, after extending the landing gear, \"the plane quit flying and the airspeed went to nothing.\" The airplane landed 200 to 300 yards short of the runway threshold, resulting in substantial damage to the wings and fuselage. During a postaccident examination, only tablespoons of fuel were drained from the left tank. Due to the position of the airplane, the right tank could not be drained; however, when power was applied to the airplane, both fuel quantity gauges indicated empty fuel tanks. Neither fuel tank was breached during the accident, and there was no discoloration present on either of the wings or engine nacelles to indicate a fuel leak; therefore, the loss of engine power is consistent with fuel exhaustion.", "probable_cause": "A total loss of engine power in both engines due to fuel exhaustion, which resulted in a landing short of the runway."}