{"url": "https://www.baaa-acro.com/crash/crash-antonov-32b-tarapaca", "date": "Jun 11, 2017 at 1712 LT", "type": "Antonov AN-32", "operator": "Aercaribe", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "La Pedrera – Tarapacá", "msn": "34 04", "yom": 1993, "flight_number": null, "city": "Tarapacá", "zone": "Amazonas", "country": "Colombia", "region": "South America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 40, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8400, "captain_hours_type": 1475, "copilot_hours": 1560, "copilot_hours_type": 426, "aircraft_hours": 3409, "circumstances": "Following an unventful charter flight from La Pedrera, the crew initiated the approach to Tarapacá Airfield. Just after touchdown on runway 25, the aircraft went out of control and veered off runway to the right. While contacting soft ground, the airplane rolled for few dozen metres and became stuck in mud. All 45 occupants evacuated safely and the aircraft was damaged beyond repair. ", "probable_cause": "The following findings were identified:\r\n- Inappropriate decision by the aircraft operator to rush the aircraft's initial route to an aerodrome unknown to the company, not appropriate to the type of aircraft and not authorised in its Operating Specifications, without at least a proper risk assessment. \r\n- Inadequate crew decision to accept and decide to proceed to an unknown aerodrome, without due knowledge of its characteristics, without prior experience or training in aerodrome operation and without at least a risk assessment. \r\n- A side runway excursion, from 24 metres from the threshold of runway 25, as a result of a probable unstabilised approach resulting in an off-axis landing.\r\nContributing factors:\r\n- Inefficient planning and supervision of operations by the aircraft operator, by scheduling the operation to an unknown airfield.\r\n- Failure of the company to comply with the contents of the Dispatch Manual and General Operations Manual, in relation to the procedures that must be complied with before operating new routes, new airports or special airports, in aspects such as route analysis, runway analysis, risk management and crew requirements.\r\n- Ignorance of the Tarapacá runway by the crew."}