{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-62m-yakutsk", "date": "Jul 1, 1990 at 0019 LT", "type": "Ilyushin II-62", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Yakutsk", "msn": "2623717", "yom": 1976, "flight_number": null, "city": "Yakutsk-Intl (Platon Oyunsky)", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 10, "crew_fatalities": 0, "pax_on_board": 99, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine aircraft departed Moscow-Domodedovo Airport at 1237LT with 99 passengers and 10 crew members on board. Following an uneventful flight of 5 hours and 42 minutes, the crew started the approach to Yakutsk-Intl Airport by night. After touchdown on runway 23 (3,300 meters long), the flight engineer mistakenly selected reverse thrust on engine n°2 and 3 only, letting both engines n°1 and 4 running at takeoff power. Both pilots took few seconds to identify the problem and the aircraft's speed was about 265-270 km/h and there were 655 meters of remaining runway. The captain attempted an emergency braking procedure when all tyres burst and the aircraft overran runway at a speed of 200 km/h, lost its undercarriage and came to rest 397 meters further, broken in three. All 109 occupants were evacuated, among them six were injured, two seriously. The aircraft was written off. ", "probable_cause": "The accident was the consequence of an error on part of the flight engineer who mistakenly selected reverse thrust on engine n°2 and 3 only, letting both engines n°1 and 4 running at takeoff power.\r\nThe following contributing factors were reported:\r\n- The spoilers could not deploy because reverse thrust was not activated on all four engines, \r\n- The crew was disorganized during the landing phase,\r\n- Poor crew coordination, \r\n- The mistake committed by the flight engineer was identified too late by the rest of the flying crew, ¨\r\n- Heavy verbal charge during the landing phase,\r\n- Insufficient professional skills of the flight engineer. "}