{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-7c-istanbul", "date": "Sep 28, 1964 at 0450 LT", "type": "Douglas DC-7", "operator": "Caledonian_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "London – Istanbul – Singapore", "msn": "45161/757", "yom": 1957, "flight_number": "CA355", "city": "Istanbul-Yeşilköy", "zone": "Marmara Region (Marmara Bölgesi)", "country": "Turkey", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 89, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9530, "captain_hours_type": null, "copilot_hours": 1811, "copilot_hours_type": null, "aircraft_hours": 20668, "circumstances": "Flight 355 took off from London for a flight to Singapore via Istanbul. The first approach to Istanbul runway 24 was abandoned because the pilot-in-command couldn't see the runway lights. Heavy rain continued as the pilot approached for the second time. VHF communications were lost during a short period of time because of a power failure in the tower transmitter and was restored when the plane was in the procedure turn. Lightning and heavy turbulence were reported during the descent and the runway was sighted when descending to 500 feet. The pilot made a slight correction to the right and ordered full flaps and power reduction to 20\" boost. The plane sank quickly just short of the runway and more power was ordered, but the left main gear had struck the ground in line with the runway, 72 m short of the threshold. The plane bounced and touched down again 14 m further on. The left main gear as well as nose gear collapsed, causing the no. 1 and 2 engines to break off, followed by the entire left wing. The fuselage skidded 260 m down the runway and a fire developed.", "probable_cause": " During the last approach, the pilot was too early in selecting full flap and reducing the power. Due to heavy rain and poor visibility, the height could not be controlled precisely. The order for full power was given too late; this created the undershoot condition."}