{"url": "https://www.baaa-acro.com/crash/crash-cessna-441-conquest-dallas-4-killed", "date": "Oct 1, 1985 at 1328 LT", "type": "Cessna 441 Conquest", "operator": "Rosewood Enterprises", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "New Orleans - Dallas", "msn": "441-0069", "yom": 1978, "flight_number": null, "city": "Dallas", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 7000, "captain_hours_type": 2200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2227, "circumstances": "A student pilot in a Cessna 152, N5522L, had departed Redbird Airport at Dallas. He was practicing solo maneuvers in a privately designated practice area that overlapped the extended inbound course to runway 31L and 31R at Love Field. At the same time, a Cessna 441, N400BG, was being vectored for a back course ILS to rwy 31R. DFW approach control cleared N400BG to continue descending to 3,000 feet and fly heading 290°. While N400BG was descending thru approximately 3,600 feet, about 14 miles southeast of Love Field, the two aircraft collided. The Cessna 152 pilot was maneuvering at or near the edge of the practice area when the collision occurred. An investigation revealed the Cessna 152 had just completed an approximately 180° turn toward an easterly heading. Both aircraft were demolished in a quartering head-on collision. Radar info from both aircraft was displayed on the controller's scope. The Cessna 152 was depicted as a 1200 beacon code; however, it was not equipped with a mode C (altitude reporting) transponder. The controller did not provide a traffic advisory for the Cessna 441 pilot; but, in this situation, an advisory was not mandatory. All five pilot on both aircraft were killed. ", "probable_cause": "Occurrence #1: midair collision\r\nPhase of operation: descent\r\nFindings\r\n1. (f) in-flight planning/decision - improper - pilot of other aircraft\r\n2. (f) monitoring - inadequate - atc personnel(dep/apch)\r\n3. (c) visual lookout - inadequate - pilot in command\r\n4. (c) visual lookout - inadequate - pilot of other aircraft"}