{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-700-oxford-3-killed", "date": "Dec 6, 2003 at 1124 LT", "type": "Socata TBM-700", "operator": "Thys Limburg", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Brussels - Oxford", "msn": "201", "yom": 2001, "flight_number": null, "city": "Oxford-Kidlington", "zone": "Oxfordshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1573, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Towards the end of a flight from Brussels to Oxford (Kidlington), the pilot was cleared to land from a visual straight-in approach to Runway 01. The surface wind was reported as 030°/15 kt. As the aircraft crossed the airfield boundary, it started to roll to the left. Shortly after, it struck the ground to the west of the runway threshold. Despite an extensive investigation, no technical malfunction was identified which could have caused the apparent uncontrolled roll to the left. Although there was no other conclusive evidence which would explain the manoeuvre, it is possible that control of the aircraft was lost during application of power to adjust the flight path or in an attempted late go-around, or as a result of an unknown distraction. The passengers was the French businessman Paul-Louis Halley, CEO of Carrefour, accompanied by his wife. They were en route to England to take part to a wedding. ", "probable_cause": "Despite an extensive investigation, no definite conclusion could be reached as to why N30LT crashed on a visual approach to Oxford (Kidlington) Airport. No technical evidence was found which would explain the uncontrolled roll but there were certain operational possibilities. Without hard evidence, however, none could be fully supported, but loss of control resulting from an unknown distraction, or during the application of power for flight path adjustment or an attempted late go-around, must be considered as possibilities. The lack of a crash protected data, voice or image recording system on N30LT made it impossible to successfully determine a specific cause or causes of this accident. "}