{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-100-la-ronge", "date": "Feb 4, 2009 at 0915 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Transwest%20Air-2", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "La Ronge – Deschambeault Lake", "msn": "8", "yom": 1966, "flight_number": null, "city": "La Ronge", "zone": "Saskatchewan", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14000, "captain_hours_type": 11000, "copilot_hours": 625, "copilot_hours_type": 425, "aircraft_hours": null, "circumstances": "The aircraft was taking off from a ski strip east of and parallel to Runway 36 at La Ronge. After the nose ski cleared the snow, the left wing rose and the aircraft veered to the right and the captain, who was the pilot flying, continued the take-off. The right ski, however, was still in contact with the snow. The aircraft became airborne briefly as it cleared a deep gully to the right of the runway. The aircraft remained in a steep right bank and the right wing contacted the snow-covered ground. The aircraft flew through a chain link fence and crashed into trees surrounding the airport. The five passengers and two crewmembers evacuated the aircraft with minor injuries. There was a small fire near the right engine exhaust that was immediately extinguished by the crew.\n", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. Contamination on the wings of the aircraft was not fully removed before take-off. It is likely that asymmetric contamination of the wings created a lift differential and a loss of lateral control.\r\n2. Although the operator was not authorized for short take-off and landing (STOL) take-off on this aircraft, the crew conducted a STOL take-off, which reduced the aircraft’s safety margin relative to its stalling speed and minimum control speed.\r\n3. As a result of the loss of lateral control, the slow STOL take-off speed, and the manipulation of the flaps, the aircraft did not remain airborne and veered right, colliding with obstacles beside the ski strip.\r\nFindings as to Risk:\r\n1. The out of phase task requirements regarding the engine vibration isolator assembly, as listed in the operator’s maintenance schedule approval, results in a less than thorough inspection requirement, increasing the likelihood of fatigue cracks remaining undetected.\r\n2. The right engine inboard and top engine mounts had pre-existing fatigue cracks, increasing the risk of catastrophic failure.\r\nOther Findings:\r\n1. The cockpit voice recorder (CVR) contained audio of a previous flight and was not in operation during the occurrence flight. Minimum equipment list (MEL) procedures for logbook entries and placarding were not followed.\r\n2. The Transwest Air Limited safety management system (SMS) did not identify deviations from standard operating procedures."}