{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-tulsa-3-killed", "date": "Feb 22, 1991 at 1519 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Corporate Aviation Services", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tulsa - Tulsa", "msn": "786", "yom": 1980, "flight_number": null, "city": "Tulsa", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4910, "captain_hours_type": 445, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6094, "circumstances": "Airplane was departing on a required maintenance test flight following replacement of both engines. Witnesses stated that the takeoff roll and initial climb appeared normal, but that at about 500 feet agl, the airplane entered a right bank which continued until the wings were vertical and the nose fell through. Airplane impacted in an inverted steep nose down attitude. Examination of wreckage revealed that the right engine had been secured and feathered. Subsequent investigation did not reveal any evidence of pre-impact failure or malfunction of either engine or any of the airframe systems. Engine mounting/rigging continuity could not be established due to impact damage. The pilot was a principal in the operator's organization and not one of the regular line pilots. Evidence indicated that the gear was up and that the left spoiler was deployed at impact. Emerg procedure taught in transition training is to use rudder trim as soon as possible after engine failure to preclude deployment of spoilers. Rudder trim found in neutral position. All three occupants were killed. ", "probable_cause": "The shutdown of one engine for undetermined reasons, and the pilot's failure to maintain VMCA during a critical phase of flight. A factor in the accident was the pilot's improper emergency procedure."}