{"url": "https://www.baaa-acro.com/crash/crash-cessna-207-stationair-8-bethel", "date": "Nov 20, 2021 at 1755 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Yute%20Commuter%20Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bethel – Kwethluk", "msn": "207-0730", "yom": 1981, "flight_number": null, "city": "Bethel", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On November 20, 2021, about 1755 Alaska standard time, a Cessna 207 airplane, N9794M sustained substantial damage when it was involved in an accident at the Bethel Airport, Bethel, Alaska. The pilot and five passengers were not injured. The airplane was operated by the pilot as a Title 14 Code of Federal Regulations Part 135 scheduled passenger flight. The purpose of the flight was to transport five passengers and cargo to Kwethluk, Alaska, which is located about 12 miles east of Bethel. The flight was operated by Yute Commuter Service as a scheduled commuter flight as flight number 700B (3). The pilot reported that shortly after departing from Bethel, he noticed that the red, ELT (Emergency Locator Transmitter) light on the instrument panel mounted, remote switch, had illuminated. The pilot then asked the Bethel tower operator if they were hearing an ELT signal, and the tower operator responded that no signal was being received. Moments later, the pilot began to smell what he describes as an electrical burn smell, and he elected to return to Bethel. The pilot said that about one minute later, the electrical burn smell intensified, which was followed by visible smoke in the cockpit, and he then declared an inflight emergency to the Bethel tower. The pilot then turned off the airplane’s master electrical switch, and subsequently opened his side window for ventilation and smoke removal. He said he briefly turned the master switch back on to again declare an emergency with Bethel tower, and to inform the tower operator that he was planning to land on Runway 1L. The pilot said that after landing, during the landing roll, he realized that the nosewheel steering system and brake system were both inoperative. After the airplane rolled to a stop on the left side of Runway 1L, he ordered all the passengers to evacuate the airplane. The pilot reported that after all the passengers had safely departed the airplane, heavy smoke filled the cockpit and passenger compartment, and he saw a candle like flame just behind the pilot and co-pilot seats, just beneath the floorboards of the airplane. Moments after all the passengers and pilot had exited the airplane, it was immediately engulfed in flames. ", "probable_cause": null}