{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-ketchikan-6-killed", "date": "Aug 5, 2021 at 1050 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Southeast%20Aviation2", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Ketchikan - Ketchikan", "msn": "1594", "yom": 1965, "flight_number": null, "city": "Ketchikan", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 15552, "captain_hours_type": 8000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15028, "circumstances": "The accident flight was the pilot’s second passenger sightseeing flight of the day that overflew remote inland fjords, coastal waterways, and mountainous, tree-covered terrain in the Misty Fjords National Monument. Limited information was available about the airplane’s flight track due to radar limitations, and the flight tracking information from the airplane only provided data in 1-minute intervals. The data indicated that the airplane was on the return leg of the flight and in the final minutes of flight, the pilot was flying on the right side of a valley. The airplane impacted mountainous terrain at 1,750 ft mean sea level (msl), about 250 ft below the summit. Examination of the wreckage revealed no evidence of pre accident failures or malfunctions that would have precluded normal operation. Damage to the propeller indicated that it was rotating and under power at the time of the accident. The orientation and distribution of the wreckage indicated that the airplane impacted a tree in a left-wing-low attitude, likely as the pilot was attempting to maneuver away from terrain. Review of weather information for the day of the accident revealed a conditionally unstable environment below 6,000 ft msl, which led to rain organizing in bands of shower activity. Satellite imagery depicted that one of these bands was moving northeastward across the accident site at the accident time. Federal Aviation Administration (FAA) weather cameras and local weather observations also indicated that lower visibility and mountain obscuration conditions were progressing northward across the accident area with time. Based on photographs recovered from passenger cell phones along with FAA weather camera imagery, the accident flight encountered mountain obscuration conditions, rain shower activity, and reduced visibilities and cloud ceilings, resulting in instrument meteorological conditions (IMC) before the impact with terrain. The pilot reviewed weather conditions before the first flight of the day; however, there was no indication that he obtained updated weather conditions or additional weather information before departing on the accident flight. Based on interviews, the accident pilot landed following the first flight of the day in lowering visibility, ceiling, and precipitation, and departed on the accident flight in precipitation, based on passenger photos. Therefore, the pilot had knowledge of the weather conditions that he could have encountered along the route of flight before departure. The operator had adequate policies and procedures in place for pilots regarding inadvertent encounters with IMC; however, the pilot’s training records indicated that he was signed off for cue-based training that did not occur. Cue-based training is intended to help calibrate pilots’ weather assessment and foster an ability to accurately assess and respond appropriately to cues associated with deteriorating weather. Had the pilot completed the training, it might have helped improve his decision-making skills to either cancel the flight before departure or turn around earlier in the flight. The operator’s lack of safety management protocols resulted in the pilot not receiving the required cue-based training, allowed him to continue operating air tours with minimal remedial training following a previous accident, and allowed the accident airplane to operate without a valid FAA registration. The operator was signatory to a voluntary local air tour operator’s group letter of agreement that was developed to improve the overall safety of flight operations in the area of the Misty Fjords National Monument. Participation was voluntary and not regulated by the FAA, and the investigation noted multiple instances in which the LOA policies were ignored, including on the accident flight. For example, the accident flight did not follow the standard Misty Fjords route outlined in the LOA nor did it comply with the recommended altitudes for flights into and out of the Misty Fjords. FAA inspectors providing oversight for the area reported that, when they addressed operators about disregarding the LOA, the operators would respond that the LOA was voluntary and that they did not need to follow the guidance. The FAA’s reliance on voluntary compliance initiatives in the local air tour industry failed to produce compliance with safety initiatives or to reduce accidents in the Ketchikan region.", "probable_cause": "The pilot’s decision to continue visual flight rules (VFR) flight into instrument meteorological conditions (IMC), which resulted in controlled flight into terrain. Contributing to the accident was the FAA’s reliance on voluntary compliance with the Ketchikan Operator’s Letter of Agreement. "}