{"url": "https://www.baaa-acro.com/crash/crash-tupolev-ant-9-vaziani-2-killed", "date": "Oct 23, 1941", "type": "Tupolev ANT-9 (PS-9)", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Vaziani - Vaziani", "msn": "158", "yom": 1933, "flight_number": null, "city": "Vaziani", "zone": "Kvemo Kartli", "country": "Georgia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5138, "circumstances": "At 0800LT, the crew departed Tbilisi Airport on a short flight to the nearest airport of Vaziani where seven skydivers were picked up for a local exercise. During the takeoff roll at Vaziani Airport, the airplane veered to the left and the pilot aborted. A second attempt to takeoff was also abandoned few minutes later for the same reasons. As the crew thought that the mudguard was rubbing the left wheel, they proceeded with a slight modification of the position of the mudguard. On the third attempt to takeoff, the airplane lifted off then climbed to a height of 2-3 metres when it turned 90° to the left, causing the left wheel to touch the ground. The airplane rolled on a distance of 88 metres then the right wheel struck the ground as well. The airplane continued on a distance of nine metres then crashed. The airplane was totally destroyed and two paratroopers were killed. The other occupants were injured.  ", "probable_cause": "It was determined that the loss of control after takeoff was the consequence of the failure of the right rudder control cable. \r\nThe following contributing factors were identified:\r\n- The person in charge of the maintenance of the airplane was asked on October 20 to proceed with the change of both rudder control cables. The mechanic failed to comply with this order, did not proceed with any change and reported to his superiors that he changed the cables, which was not the case,\r\n- The superior failed to check the work from his mechanic prior to release the airplane, \r\n- The crew failed to inspect the airplane prior to takeoff and did not comply with published procedures,\r\n- The pilot continued the takeoff procedure with an apparently defective airplane and failed to reduce the engine power when the airplane turned left after liftoff. "}