{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-229-utica-16-killed", "date": "Sep 4, 1950 at 1410 LT", "type": "Douglas DC-3", "operator": "Robinson%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Ithaca – Syracuse – Utica – Newark", "msn": "2011", "yom": 1937, "flight_number": "RBS032", "city": "Utica", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 20, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": 4431, "captain_hours_type": 1900, "copilot_hours": 3600, "copilot_hours_type": 2273, "aircraft_hours": 19023, "circumstances": "Prior to takeoff, the engines were given a pre-flight check, following which the takeoff roll was commended. The flaps were in the \"full up\" position for the takeoff. The aircraft became airborne in a normal manner approximately 1,500 feet down the runway and climbed to an altitude of approximately 50 feet and leveled off. At this time, the landing gear was retracted and the air speed was estimated to be 105 to 110 miles per hour by qualified observers. Approximately 3,000 feet from the point of take-off parts were observed falling from the left engine and the aircraft made a shallow turn to the left. At this time, the left propeller appeared to be fully feathered. The flight continued in a left turn, slowly losing altitude until it struck a grove of trees 1.5 miles southeast of the airport. The elevation of the terrain at this point was 480 feet which is 256 feet below the elevation of the airport. The tree tops were 80 feet above the ground. First impact with the trees was made on a heading of approximately 60 degrees and as the aircraft descended through the trees, it turned anti-clockwise 180 degrees to the original heading. Following impact with the trees, the fuel tanks ruptured causing a fire which consumed the fuselage. Sixteen of the occupants were fatally injured and seven seriously injured. The survivors escaped either through broken windows on the right side, or the right rear escape hatch.", "probable_cause": "The Board determines that the probable cause of the accident was the failure of the left engine shortly after take-off, coupled with increased drag due to loss of left engine cowling and reduced power output of the right engine because the right propeller was in the high pitch position."}