{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-greenville", "date": "Nov 9, 2009 at 1009 LT", "type": "Beechcraft 200 Super King Air", "operator": "MDTR Holdings", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Greenville - Greenville", "msn": "BB-1628", "yom": 1998, "flight_number": null, "city": "Greenville-Spartanburg", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15717, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3060, "circumstances": "The pilot flew the airplane to a maintenance facility and turned it in for a phase inspection. The next morning, he arrived at the airport and planned a local flight to evaluate some avionics issues. He performed a preflight inspection and then went inside the maintenance facility to wait for two avionic technicians to arrive. In the meantime, two employees of the maintenance facility test ran the engines on the accident airplane for about 30 to 35 minutes in preparation for the phase inspection. The pilot reported that he was unaware that the engine run had been performed when he returned to the airplane for the local flight. He referred to the flight management system (FMS) fuel totalizer, and not the aircraft fuel gauges, when he returned to the airplane for the flight. He believed that the mechanics who ran the engines did not power up the FMS, which would have activated the fuel totalizer, thus creating a discrepancy between the totalizer and the airplane fuel gauges. The mechanics who performed the engine run reported that each tank contained 200 pounds of fuel at the conclusion of the engine run. The B200 Pilot’s Operating Handbook directed pilots not take off if the fuel quantity gauges indicate in the yellow arc or indicate less than 265 pounds of fuel in each main tank system. While on final approach, about 23 minutes into the flight, the right engine lost power, followed by the left. The pilot attempted to glide to the runway with the landing gear and flaps retracted, however the airplane crashed short of the runway. Only residual fuel was found in the main and auxiliary fuel tanks during the inspection of the wreckage. The tanks were not breached and there was no evidence of fuel leakage at the accident site.", "probable_cause": "A loss of engine power due to fuel exhaustion as a result of the pilot’s failure to visually verify that sufficient fuel was on board prior to flight.\n"}