{"url": "https://www.baaa-acro.com/crash/crash-cessna-560-citation-encore-cresco-2-killed", "date": "Jul 19, 2006 at 1104 LT", "type": "Cessna 560 Citation Encore", "operator": "Tomco II", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Oxford - Rochester", "msn": "560-0636", "yom": 2003, "flight_number": null, "city": "Cresco", "zone": "Iowa", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 11607, "captain_hours_type": 557, "copilot_hours": 13312, "copilot_hours_type": 833, "aircraft_hours": 713, "circumstances": "The airplane was managed by and listed on the certificate of Jackson Air Charter, Inc. (JAC), a 14 Code of Federal Regulations (CFR) Part 135 on-demand operator; however, because the owner of the airplane was using it for personal use, the accident flight was flown under 14 CFR Part 91 regulations. The right-seat pilot, who was the chief pilot for JAC, was the flying pilot for the flight. The right-seat pilot had about 13,312 total flight hours, 833 hours of which were in Cessna 560 airplanes. The left-seat pilot, who was the nonflying pilot for the flight and had only worked for JAC for a little over a month, had not yet completed the company's Part 135 training but was scheduled to do so. The left-seat pilot had about 11,607 total flight hours, 557 hours of which were in Cessna 560 airplanes. The flight was planned to land at Rochester International Airport (RST), Rochester, Minnesota. The flight crew attempted to circumnavigate severe weather conditions and continue the planned descent for about 15 minutes even though a Minneapolis Air Route Traffic Control Center controller stated that the flight would have to deviate 100 miles or more to the north or 80 miles to the south to do so. The RST approach controller subsequently told the flight crew that there was \"weather,\" including wind gusts, along the final approach course, and on-board radar and weather advisories also showed severe thunderstorms and wind gusts in the area. Given the overwhelming evidence of severe weather conditions around RST, the flight crew exhibited poor aeronautical decision-making by attempting to continue the preplanned descent to RST despite being aware of the severe weather conditions and by not diverting to a suitable airport earlier in the flight. The cockpit voice recorder (CVR) recorded the flight crew begin discussing an alternate destination airport about 3 minutes after contacting RST approach; however, the CVR did not record the left-seat pilot adequately communicate to air traffic control that the flight was going to divert. CVR evidence also showed that neither pilot took a leadership role during the decision-making process regarding the diversion. As a result, the flight crew chose an alternate airport, Ellen Church Field Airport (CJJ), Cresco, Iowa, from either looking at a map or seeing it out the cockpit window. The flight crew was not familiar with the airport, which did not have weather reporting capabilities. CVR evidence indicates that the flight crew did not use the on-board resources, such as the flight management system and navigational charts, to get critical information about CJJ, including runway direction and length. Further, the flight crew did not use on-airport resources, such as the wind indicator located on the left side of runway 33. During the approach and landing, the enhanced ground proximity warning system (EGPWS) alerted in the cockpit. However, the flight crew did not recognize or respond to the EGPWS warning, which alerted because the EGPWS did not recognize the runway since it was less than 3,500 feet long. CVR evidence indicated that the flight crew incorrectly attributed the warning to the descent rate. Further, the runway was not depicted on an on-board non-navigational publication, which only contained runways that were 3,000 feet or more long, and this was referenced and noted by the flight crew. In addition, the flight crew visually recognized during the final approach that the runway was shorter than the at least 5,000 feet they originally believed it to be (as stated by the right-seat pilot earlier in the flight). Despite all of these indications that the runway was not long enough to land safely, the flight crew continued the descent and landing. (After the accident, Cessna computed the landing distance for the accident conditions, which indicated that about 5,200 feet would have been required to stop the airplane on a wet runway with a 10-knot tailwind. Runway 33 is only 2,949 feet long. Further, the Cessna Aircraft Flight Manual does not recommend landing on precipitation covered runways with any tailwind component.) Because the flight crew did not look up the runway length and did not heed indications that the runway was too short, both of which are further evidence of the flight crew's poor aeronautical decision-making, they landed with inadequate runway length to either land the airplane on the runway or abort the landing. Subsequently, the airplane exited the runway and continued about 1,700 feet beyond its end. The airplane had sufficient fuel to have proceeded to an airport with a suitable runway length. In addition to the poor decision-making, the flight crew did not exhibit adequate crew resource management (CRM) throughout the flight. For example, the flight crew exhibited poor communication and decision-making skills, did not effectively use the available on-board resources to get information about the landing runway, and neither pilot took a leadership role during the flight. JAC did not have and was not required to have an approved CRM training program although, according to company pilots, some CRM training was  incorporated into the company's simulator training. On December 2, 2003, the National Transportation Safety Board issued Safety Recommendation A-03-52, which asked the Federal Aviation Administration (FAA) to require that 14 CFR Part 135 on-demand charter operators that conduct dual-pilot operations establish and implement an FAA-approved CRM training program for their flight crews in accordance with 14 CFR Part 121, subparts N and O. On May 2, 2006, Safety  recommendation A-03-52 was reiterated and classified \"Open-Unacceptable Response\" pending issuance of a final rule. Although the accident flight was operated under Part 91, if JAC, as an on-demand Part 135 operator, had provided all of its pilots CRM training, the benefits of such training would extend to the company's Part 91 flights. In November 2007, the Safety Board placed Safety Recommendation A-03-52 on its Most Wanted List of Transportation Safety Improvements because of continued accidents involving accident flight crew members. As a result of this accident, the Safety Board reiterated Safety Recommendation A-03-52 on May 1, 2008. The right-seat pilot had in his possession multiple prescription and nonprescription painkillers, nonprescription allergy and anti-acid medications, and one prescription muscle relaxant. None of these medications are considered illicit drugs and would not have been reportable on drug testing required under 49 CFR Part 40. The right-seat pilot was known to have problems with back pain, although no medical records of treatment for the condition could be located. On his most recent application for airman medical certificate, the pilot had reported no history of or treatment for any medical conditions and no use of any medications. Toxicology testing revealed recent use of a prescription muscle relaxant, which might have resulted in impairment. It is also possible that the right-seat pilot was impaired or distracted by the symptoms for which he was taking the muscle relaxant; however, it could not be determined what role the muscle relaxant or the physical symptoms might have played in this accident.", "probable_cause": "The flight crew's inadequate aeronautical decision-making and poor crew resource management (CRM), including the inadequate use of the on-board sources (such as the flight management system and navigation charts), to get critical information about Ellen Church Field Airport, including runway direction and length. Contributing factors to the accident were the flight crew's failure to consider and understand indications that the runway length was insufficient and inadequate CRM training for pilots at Part 135 on-demand operators."}