{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-hailey", "date": "Feb 15, 1983 at 1102 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Sierra%20Pacific%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Boise - Hailey", "msn": "361", "yom": 1973, "flight_number": "SPA868", "city": "Hailey-Friedman Memorial", "zone": "Idaho", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12000, "captain_hours_type": 1000, "copilot_hours": 275, "copilot_hours_type": 100, "aircraft_hours": 4767, "circumstances": "About 1100 mst, on February 15,1983, a Sierra Pacific Airlines DHC-6, operating as Transwestern Flight 868, crashed during its final approach to a landing on runway 31, 1.7 mile south of the Friedman Memorial Airport at Hailey, Idaho. Flight 868 was a regularly scheduled commuter passenger flight between Boise and Hailey, Idaho. There were two flightcrew members and six passengers on board the flight. One passenger escaped with minor injuries, but all the other occupants sustained serious injuries in the accident. There was no fire. About 800 feet above the small town of Bellevue, 2 miles south of the airport, the captain reduced power in order to configure the airplane for its final approach. Immediately afterward, the captain realized that he had lost eleva control of the airplane. The airplane nosed over and descended steeply. The captain attempted to control the pitch of the airplane by adding power; it began to recover but it crash landed on a highway in a slight nosedown attitude, with the right wing slightly down The airplane then veered off the highway, struck a 4-foot-high snowbank, and broke apart.", "probable_cause": "The in-flight loss of elevator control following separation of the control rod from the torque tube at a connection where the company's maintenance department had used a non-standard, unsecured bolt, which the company's inspection department had failed to detect. Contributing to the accident was the company's failure to maintain the separation of maintenance and inspection functions required by the maintenance program approved by the Federal Aviation Administration, and the failure of the FAA to detect the company's deviation from approved maintenance procedures during surveillance inspection."}