{"url": "https://www.baaa-acro.com/crash/crash-noorduyn-norseman-iv-gander-lake-2-killed", "date": "Aug 18, 1950", "type": "Noorduyn Norseman", "operator": "Newfoundland Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": null, "msn": "627", "yom": 1944, "flight_number": null, "city": "Gander", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The float quipped aircraft taxied out to take-off position on Gander Lake, Newfoundland, with a pilot and one passenger on board Several people watched the take-off and, according to one witness, the aircraft never did get on the step but was pulled off the water in a nose high attitude and in semi-stalled conditions. At a height of roughly 10 to 15 feet above the surface, the left wing went down and the aircraft began to sideslip, continuing to lose height until the wing tip struck the water, causing the aircraft to cartwheel and partially submerge. The pilot and the passenger died as a result of drowning. Weather was suitable for the flight. Although ,the aircraft did not take off directly into wind according to the Gander Airways Weather report, the wind velocity was only 7 MPH.", "probable_cause": "Inspection of the aircraft, and evidence of witnesses, failed to disclose any indication of malfunctioning of the aircraft, engine or controls prior to the crash. The immediate cause of the accident would appear to be that the left wing\r\ntip of the aircraft came into contact with the water following which the aircraft crashed and partially submerged. The major contributing factors would appear to be:\r\n1) poor judgment on the part of the pilot in attempting a turn at approximately 15 feet above the water; and\r\n2) poor technique on the part of the pilot in permitting the aircraft to stall."}