{"url": "https://www.baaa-acro.com/crash/crash-hawker-siddeley-hs121-trident-1c-kuwait-city", "date": "Jun 30, 1966 at 2346 LT", "type": "Hawker Siddeley HS.121 Trident", "operator": "Kuwait-Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Beirut - Kuwait City", "msn": "2118", "yom": 1965, "flight_number": "KU032", "city": "Kuwait City", "zone": "All Kuwait", "country": "Kuwait", "region": "Asia", "crew_on_board": 11, "crew_fatalities": 0, "pax_on_board": 72, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": 95, "copilot_hours": null, "copilot_hours_type": 107, "aircraft_hours": 361, "circumstances": "Flight KU32 was a scheduled international flight from Beirut, Lebanon to Kuwait. It departed Beirut at 1855 hours GMT and apart from a tendency for the autopilot pitch lock to disconnect the flight to the descent point was uneventful. The aircraft was cleared to commence descent at 2028 hours GMT from flight level 300 to flight level 95 by the DY NDB - the pilot-in-command decided to carry out a visual approach and advised the co-pilot accordingly. The aircraft reached flight level 95 some three minutes before reaching the DY NDB and it maintained this level until passing the beacon at about 2039 hours GMT at which time it was cleared to descend to 3 000 ft it being agreed the aircraft would report on left base for runway 33R. By visual navigation and ADF indications from the MG NDB the aircraft was positioned on a left hand base leg for runway 33R passing abeam the MG NDB 1 - 2 miles to the south. The rate of descent was 1500 ft/min with the outboard engines at idle and 10 400 rpm on the centre engine. At about this time and when at flight level 50 the flight reported the field in sight - the pilot-in-command and flight engineer having sighted the airport rotating beacon and the co-pilot the rotating beacon and some airport lights - and the aircraft was cleared for final. A left turn on to final was cow menced at about 4 000 ft and the flight reported its position as 6 miles from the airport when at 2 300 ft. Rate of descent was 1 500 ft/min and airspeed was 178 kt. During all these manoeuvres the aircraft was being flown on the autopilot and the co-pilot had been requested to set 1 500 ft in the \"acquire height\" box of the autopilot. The ADF was tuned to the KWS locator which is 2 224 m from the runway threshold, and the co-pilot was occupied with the landing checks. At this stage of the flight the aircraft was at 1 830 ft almost abeam of the MG NDB inbound and 80 seconds from impact with the ground. Desired approach speed was 154 kt with a descent rate of 700 ft/min and a threshold speed of 134 kt. The aircraft struck the ground and crashed approximately 4 km short of the runway threshold, slightly to the left of the centreline at an elevation of approximately 185 ft. (Latitude 29013'25\"N, Longitude 47058'05\"E). The accident occurred at approximately 2046 hours GMT at night. ", "probable_cause": "High rate of descent and non-observance of Company's regulations. Corrective action carried out in calling for 10 500 rpm was not sufficient to re-establish level flight. A further demand for additional power was too late to be of any use. The pilot-in-command did not follow the procedures laid down in the operations manual for approach and landing of the aircraft type. The cockpit check for the approach and landing was still being carried out when the aircraft hit the ground and the pilot-in-command's altimeter was set on the QNH instead of the QFE."}