{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-kincolith-5-killed", "date": "Aug 4, 1998 at 1758 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Harbour%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Prince Rupert - Kincolith", "msn": "39", "yom": 1949, "flight_number": "H3709", "city": "Kincolith", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 1700, "captain_hours_type": 1250, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 22369, "circumstances": "The float-equipped de Havilland DHC-2 Beaver, serial number 0039, departed Prince Rupert, British Columbia, at 1719 Pacific daylight time on a visual flight rules flight to Kincolith, British Columbia, with the pilot and four passengers on board. When the aircraft arrived at Kincolith at about 1750, witnesses watched it carry out three low approaches to the water landing area, each time descending to a few feet above the water before climbing away. On the fourth approach, at about 1758, the aircraft touched down, apparently in a controlled manner, and skipped on the water surface. The floats then dug into the water followed by the right wing, which was severed from the fuselage on water impact. The aircraft quickly overturned and came to rest inverted with only the bottom of the floats visible. Several members of the village community, who had been waiting for the aircraft on the Government Dock, rushed to the sunken aircraft in small boats but were unable to rescue the pilot or passengers inside the submerged cabin. The five occupants drowned in the accident, and the aircraft was substantially damaged.", "probable_cause": "On touchdown, the float(s) struck the water and caused a flying attitude that the pilot could not control before the right wing dug in and the aircraft overturned. Contributing to the accident were conflicting wind and water conditions at the time of the occurrence."}