{"url": "https://www.baaa-acro.com/crash/crash-cessna-402a-kansas-city-1-killed", "date": "Jan 21, 1982 at 1924 LT", "type": "Cessna 402", "operator": "Springdale Air Service", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Springdale - Kansas City", "msn": "402-0053", "yom": 1979, "flight_number": null, "city": "Kansas City", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5993, "captain_hours_type": 1200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3746, "circumstances": "The pilot received two weather briefings. Most of the first briefing was spend finding an alternate. The forecast include IMC with low ceilings, low visibilities with light snow, fog and possible freezing drizzle. The aircraft was not certificated for flight in known icing conditions. During arrival, the plane entered an overcast at 3,500 feet MSL. Two minutes later, the pilot reported and encounter with freezing precipitation. The first approach was abandoned in the vicinity of the FAF/outer marker after the pilot flew through the localizer course line and was half mile to the right. He was vectored for another ILS approach. While inbound on the approach, he was informed that approach control had received a low altitude alert. He was reminded that his altitude should be 2,600 feet until reaching the FAF; however, he reached only 2,400 feet. His airspeed was much higher than normal while descending from the FAF. The plane struck a building and burned about 1/3 mile northeast of the end of runway 18. The pilot, sole on board, was killed. ", "probable_cause": "In flight encounter with weather during approach - FAF/outer marker to threshold (IFR), loss of control and subsequent collision with object. The following findings were reported:\r\n- Dark night,\r\n- Low ceiling, \r\n- Fog,\r\n- Snow,\r\n- Rain, \r\n- Icing conditions, \r\n- Wing ice, \r\n- The pilot initiated operation with known deficiencies in equipment, \r\n- Overconfidence in aircraft's ability on part of the pilot, \r\n- The pilot continued flight into known adverse weather, \r\n- Overconfidence in personal ability on part of the pilot, \r\n- Non residential building."}