{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1049-super-constellation-grand-canyon-70-killed", "date": "Jun 30, 1956 at 1031 LT", "type": "Lockheed L-1049 Super Constellation", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Los Angeles – Kansas City – Washington DC ", "msn": "4016", "yom": 1952, "flight_number": "TW002", "city": "Grand Canyon", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 64, "pax_fatalities": 64, "other_fatalities": 0, "total_fatalities": 70, "captain_hours": 14922, "captain_hours_type": 7208, "copilot_hours": 6976, "copilot_hours_type": 825, "aircraft_hours": 10519, "circumstances": "On June 30, 1956, at 0901, Trans World Airlines Flight 2, a regularly scheduled passenger service, took off from runway 25 of the Los Angeles Inter-national Airport. Flight 2 was on an instrument flight rules (IFR) flight plan from Los Angeles, California, to Kansas City, Missouri, via Green Airway 5, Amber Airway 2, Daggett direct Trinidad, direct Dodge City, Victor Airway 10 Kansas City. The flight plan also proposed a cruising altitude of 19,000 feet, a .JPG\"> airspeed of 270 knots, and a departure time of 0830. The Trans World flight crew consisted of Captain Jack S. Gandy, Copilot James H. Ritner, Flight Engineer Forrest D. Breyfogle, night Engineer Harry H. Allen (aboard as an additional crew member), and Hostesses Tracine E. Armbruster and Beth E. Davis. Preparations for Flight 2 were routine except that departure was delayed a few minutes by minor maintenance on the aircraft. The flight was dispatched with 3,300 gallons of fuel and the load manifest showed the gross weight of the aircraft at takeoff was 108,115 pounds, well, under the maximum allowable of 113,200 pounds. The load was properly distributed with respect to center of gravity limitations of the aircraft. As requested. the flight, after takeoff, contacted the Los Angeles tower radar departure controller, and was vectored through an overcast which existed in the Los Angeles area. After reporting \"on top\" (2,400 feet) the flight switched to Los Angeles Air Route Traffic Control Center (referred to as Los Angeles Center) frequency, 118.9 mcs., for its en route clearance. This clearance specified the routing as filed in the flight plan, however, the controller specified that the flight climb to 19,000 feet in VFR conditions. Immediately thereafter TWA 2 asked for a routing change to Daggett via Victor Airway 210. This was approved in a routine manner. At 0921, through company radio communications, Flight 2 reported that it was approaching Daggett and requested a change in flight plan altitude assignment from 19,000 to 21,000 feet. ARTC (Los Angeles Center) advised they were unable to approve the requested altitude because of traffic (United Air Lines Flight 718). Flight 2 requested a clearance of 1,000 feet on top. Ascertaining from the radio operator that the flight was then at least 1,000 on top, ARTC cleared the flight. At 0959 Trans World 2 reported its position through company radio at Las Vegas. It reported that it had passed Lake Mohave at 0955, was 1,000 on top at 21,000 feet, and estimated it would reach the 321-degree radial of the Winslow omni range station (Painted Desert) at 1031 with Farmington next. This was the last radio communication with the flight.", "probable_cause": "The Board determines that the probable cause of this mid-air collision was that the pilots did not see each other in time to avoid the collision. It is not possible to determine why the pilots did not see each other, but the evidence suggests that it resulted from any one or a combination of the following factors: Intervening clouds reducing time for visual separation, visual limitations due to cockpit visibility, and preoccupation with normal cockpit duties, preoccupation with matters unrelated to cockpit duties such as attempting to provide the passengers with a more scenic view of the Grand Canyon area, physiological limits to human vision reducing the time opportunity to see and avoid the other aircraft, or insufficiency of en route air traffic advisory information due to inadequacy of facilities and lack of personnel in air traffic control. The following findings were reported: \r\n- Approaching Daggett, TWA 2 requested its company radio to obtain 21,000 feet as an assigned altitude, or 1,000 on top,\r\n- Company radio requested 21,000 feet IFR from ARTC. This vas denied by ARTC. Request was then made for 1,000 on top. This was approved and clearance issued. The flight climbed to and proceeded at 21,000 feet,\r\n- As an explanation for the denial of 21,000 feet, TWA 2 was furnished pertinent information on UA718,\r\n- The last position report by each flight indicated it was at that time at 21,000, estimating the Painted Desert line of position at 1031,\r\n- The Salt Lake controller possessed both position reports at approximately 1013, at which time both flights were in uncontrolled airspace,\r\n- Traffic control services are not provided in the uncontrolled airspace and according to existing Air Traffic Control policies and procedures the Salt Lake controller was not required to issue traffic information; none was issued voluntarily,\r\n- A general overcast with some breaks existed at 15,000 feet in the Grand Canyon area,\r\n- Several cumulus buildups extending above flight level existed; one was nearly over Grand Canyon Village and others were north and northeast in the area of the collision,\r\n- The collision occurred at approximately 1031 in visual flight rule weather conditions at about 21,000 feet,\r\n- The collision in space was above a position a short distance west of the TWA wreckage area, 17 miles west of or approximately 3-1/2 minutes' flying time from the Painted Desert line of position,\r\n- Under visual flight rule weather conditions it is the pilot's responsibility to maintain separation from other aircraft,\r\n- At impact the aircraft relative to each other converged at an angle of about 25 degrees with the DC-7 to the right of the L-1049. The DC-7 was rolled about 20 degrees right wing down and pitched about 10 degrees nose down relative to the L-1049,\r\n- There was no evidence found to indicate that malfunction or failure of the aircraft or their components was a factor in the accident."}