{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-325-navajo-wollaston-lake", "date": "Nov 25, 1995 at 2325 LT", "type": "Piper PA-31-310 Navajo", "operator": "Eagle Air Services - Canada", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Wollaston Lake – La Ronge", "msn": "31-7712050", "yom": 1977, "flight_number": null, "city": "Wollaston Lake", "zone": "Saskatchewan", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4920, "captain_hours_type": 450, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7056, "circumstances": "The Eagle Air Services Piper PA-31-325 Navajo, C-GOLM, departed runway 34 at Wollaston Lake, Saskatchewan, at 2325 central standard time (CST), on a medical evacuation (MEDEVAC) flight to La Ronge. The flight was arranged by the Wollaston nursing station to transport a patient to a hospital in La Ronge. The patient was accompanied on the flight by her mother and a nurse from the nursing station. The aircraft was observed to climb at an unusually shallow angle after take-off, and, when efforts by company personnel to reach the pilot by radio were unsuccessful, a ground search was commenced. The aircraft was found about five minutes after the accident, located on the ice- and snow-covered surface of Wollaston Lake, about 0.75 nautical miles (nm) from the departure end of the runway, and about 1.3 nm from the point of commencement of the take-off roll. The pilot and the patient suffered serious injuries. The other two occupants sustained minor injuries. The accident occurred during the hours of darkness at latitude 58°6.98'N, longitude 103°10.79'W, at an elevation of 1,300 feet above sea level (asl). The temperature was about -25°/C.", "probable_cause": "After take-off, the left propeller was likely on its start locks, which, as the airspeed increased, allowed the propeller to overspeed. The pilot was unable to resolve the situation in time to prevent the aircraft from striking the surface of Wollaston Lake. Contributing to the severity of the patient's injuries were the inadequate restraint provided by the stretcher and its restraining strap, the lack of standards regarding stretchers used in aircraft, and the lack of standards as to the operation of MEDEVAC flights."}