{"url": "https://www.baaa-acro.com/crash/crash-avro-689-tudor-i-atlantic-ocean-31-killed", "date": "Jan 30, 1948 at 0317 LT", "type": "Avro 689 Tudor", "operator": "BSAA", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "London – Lisbon – Horta – Hamilton – Havana", "msn": "1349", "yom": 1946, "flight_number": null, "city": "Atlantic Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 25, "pax_fatalities": 25, "other_fatalities": 0, "total_fatalities": 31, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 575, "circumstances": "Christened 'Star Tiger', the four engine aircraft left Horta, in the Azores Islands, at 1534LT bound for Hamilton, Bermuda. At 0200LT, about 10,5 hours into the flight, the navigator Cyril Ellison fixed its position and learned that they too had been blown off course and were crabbing away from Bermuda. He informed the pilot McMillan about a new course which turned the aircraft directly into a gale. However, McMillan still expected to reach Bermuda with at least an hour's worth of fuel remaining upon landing. At 0304LT, the radio officer Robert Tuck requested a radio bearing from Bermuda, but the signal was not strong enough to obtain an accurate reading. He repeated the request eleven minutes later, and this time the Bermuda radio operator was able to obtain a bearing of 72 degrees, accurate to within 2 degrees. The Bermuda operator transmitted this information, and Tuck acknowledged receipt at 0317LT. This was the last radio contact with the aircraft and its crew. As the aircraft failed to arrive in Hamilton, SAR operations were conducted but were eventually suspended few days later as no trace of the aircraft nor the 31 occupants was found. ", "probable_cause": "In the complete absence of any reliable evidence as to either the nature or the cause of the disaster to 'Star Tiger' the Court has not been able to do more than suggest possibilities, none of which reaches the level even of probability. Into all activities which involve the cooperation of man and machine two elements enter of very diverse character. There is the incalculable element of the human equation dependent upon imperfectly known factors; and there is the mechanical element subject to quite different laws. A breakdown may occur in either separately or in both on conjunction. Or some external cause may overwhelm both man and machine. What happened in this case will never be known and the fate of 'Star Tiger' must forever remain an unsolved mystery."}