{"url": "https://www.baaa-acro.com/crash/crash-cessna-t303-crusader-mill-creek-5-killed", "date": "Nov 13, 2006 at 2003 LT", "type": "Cessna 303 Crusader", "operator": "CPRT Investment", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "South Bend - Ankeny", "msn": "303-00145", "yom": 1982, "flight_number": null, "city": "Mill Creek", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 504, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4577, "circumstances": "The pilot departed his home airport at 0502 and landed at another airport where he picked up employees of a marketing company to fly them to an out of state meeting. The accident occurred at 2003 shortly after taking off on the return trip to fly the employees back home. Shortly before departure a fourth passenger was added to the flight after his commercial flight was cancelled. A person who worked for the fixed base operator at the departure airport stated the pilot looked tired or just ready to go home. The pilot received his clearance for the IFR flight prior to takeoff. The pilot misread the clearance back to the controlled and was corrected. Radar data showed the pilot initially flew the assigned south-southwest heading prior to the airplane turning right to a westerly heading. The controller queried the pilot and issued a heading to intercept the VOR. The pilot corrected the heading and shortly thereafter the airplane once again began a right turn back toward the west. The airplane continued to climb throughout the heading changes. Radar data showed the airplane then began another left turn during which time it entered a spiraling rapid descent. According to weather data, the airplane was in instrument meteorological conditions when this occurred. The airplane impacted the terrain in an open cornfield. Weight and balance calculations indicate the airplane was at least 383 pounds over gross weight. Post accident inspection of the airplane and engines did not reveal any preexisting failure/malfunction. ", "probable_cause": "The pilot became spatially disoriented and as a result failed to maintain control of the airplane. Factors associated with the accident were the instrument meteorological conditions aloft and the pilot being fatigued."}