{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-600-near-cassilis-2-killed", "date": "Dec 22, 1987 at 1620 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Bankstown – Coolah", "msn": "60-0054-123", "yom": 1971, "flight_number": null, "city": "Cassilis", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was conducting a freight charter flight, and witness evidence confirmed that on DEPARTURE he was occupying the left-hand seat. The pilot was accompanied by a friend who was also a commercial pilot, but not endorsed on this type of aircraft. Approximately 18 minutes prior to the estimated time of arrival at the destination, the pilot reported leaving the cruising altitude of 6500 feet on descent. Several minutes after the descent report had been made, a witness about 50 kilometres from the destination reported seeing the aircraft pull-up into a very steep climb from an extremely low height with its wings level, and then become inverted. It then entered what was described by the witness as a spin or spiral dive, before impacting the ground in a near vertical descent. The pilot was found in the right-hand seat, and the passenger had been thrown clear of the wreckage. It was established that neither seat belt had been fastened at the time of the impact. Although it could not be determined which pilot was flying the aircraft at the time of the pull-up, medical evidence suggested that the pilot occupying the right-hand seat position was handling the controls at the time of ground impact. The weather at the time of the accident was fine and clear, with 10-15 knot winds.", "probable_cause": " A thorough examination of the aircraft wreckage did not reveal any malfunction or mechanical failure which may have caused a sudden and severe loss of control. Investigation showed that at the\r\nmoment of impact the aircraft was in a near vertical descent, without any rotation about the vertical axis, and the wings were in a stalled condition. No reason was found which could have explained either the low flying, or the steep pull-up. During the investigation it was established that with this aircraft type, a considerable degree of sustained elevator force would need to be applied by a pilot in order to achieve the type of flight path reported by the witness. It is considered that such a control input would need to be deliberately executed.\r\nSignificant Factors:\r\nIt was considered that the following factors were relevant to the development of the accident:\r\n1. The pilot, or passenger, performed what was apparently a deliberate steep pull-up from low-level. The reason for the pull-up was not established.\r\n2. Loss of control occurred as a consequence of the aircraft becoming stalled.\r\n3. There was insufficient height for the pilot to effect recovery following the loss of control. "}