{"url": "https://www.baaa-acro.com/crash/crash-gippsland-ga8-airvan-latrobe-valley", "date": "Feb 7, 1996 at 1845 LT", "type": "GippsAero GA8 Airvan", "operator": "GippsAero", "flight_phase": "Flight", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Latrobe Valley - Latrobe Valley", "msn": "GA8-05-001", "yom": 1995, "flight_number": null, "city": "Latrobe Valley (Morwell)", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6500, "captain_hours_type": 100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The prototype GA-8 aircraft was undertaking test flying from the manufacturer's facility at the Latrobe Valley airfield. The test flying was scheduled by the designer under the provisions of a permit to fly approved by the Civil Aviation Safety Authority. For a series of spin tests the aircraft was fitted with fixed and jettisonable ballast, a jettisonable pilot's door, and a tail mounted anti-spin parachute attached to a long lanyard. On this flight the aircraft was set up at 9,000 feet above ground level with full power, flaps fully down, an extreme aft centre of gravity (C of G) and maximum all up weight. The test pilot, who was the only occupant, applied full left rudder and full right aileron to initiate a spin. After the aircraft entered a spin to the left the pilot applied standard control inputs to effect a recovery to normal flight. The aircraft did not respond and at 6,500 feet, 13 seconds after the spin commenced, the pilot jettisoned the ballast and deployed the anti-spin parachute. The aircraft still did not respond and at about 32 seconds into the spin, at 5,200 feet, the pilot initiated release of the jettisonable door, released his harness, baled out, and was clear of the aircraft as it passed through 3,600 feet. At 1,800 feet the aircraft was observed to stop spinning. Fifty seconds after the commencement of the spin, the aircraft dived into the ground and was destroyed. The pilot sustained minor injuries during his landing.", "probable_cause": "This was a prototype aircraft and some deficiencies and/or problems during testing are to be expected. With this particular aircraft the fact that the inadequate rudder hinge moment was masked throughout flight testing meant that the inadequate rudder performance during critical spin recovery was not clearly detected until it combined with other factors to become critical. These other factors included an ineffective anti-spin parachute, extensive blanking of the fin and rudder, and flight at the extremes of the weight and C of G envelope. It is not known what , if any, effect the previous rerigging of the elevator controls had on this flight.\r\nThe following factors were reported:\r\n1. The rudder and fin effectiveness was inadequate for the spin test being undertaken.\r\n2. The anti-spin protection systems were ineffective.\r\n3. The aircraft was not able to be recovered from an intentional spin."}