{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-harrisburg-9-killed", "date": "Feb 24, 1977 at 0924 LT", "type": "Piper PA-31 Cheyenne", "operator": "Commonwealth of Pennsylvania", "flight_phase": "Takeoff (climb)", "flight_type": "Government", "survivors": "No", "site": "City", "schedule": "New Cumberland - Harrisburg - University Park - New Cumberland", "msn": "31-7720001", "yom": 1977, "flight_number": null, "city": "Harrisburg-Capital City", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 1, "total_fatalities": 9, "captain_hours": 4469, "captain_hours_type": 32, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 173, "circumstances": "Shortly after takeoff from Harrisburg-Capital City Airport runway 08, the twin engine aircraft went out of control and crashed in flames onto a house located in a populated area in the town of Bressler, 1,55 statute miles from the departure end of runway 08. The aircraft disintegrated on impact and all eight occupants were killed as well as one people in the house.\r\nThose on board were:\r\nCrew:\r\nDavid M. Wolf, pilot,\r\nEdward Soisson, copilot.\r\nPassengers:\r\nWilliam Sherlock, State Transportation Secretary,\r\nRichard C. Frame, State GOP Chairman,\r\nWilliam R. Smith, Sherlock's Chief of Staff,\r\nCharles Wilson, PennDOT Public Relations Officer,\r\nLarry G. Pennsyl, PennDOT photographer,\r\nJohn W. Krebs, PennDOT data processing manager.", "probable_cause": "The probable cause of the accident was the flightcrew's failure to insure that the aircraft was loaded properly and that it's center of gravity was within certificated limits. As a result, the aircraft's control characteristics were degraded significantly by a center of gravity well aft of the certificated limits. This imbalance led to the pilot's inability to control a longitudinally unstable aircraft during a climbing turn in instrument meteorological conditions. There was no evidence of engine failure or malfunction, the flight crew was properly certified and the pilots had no medical or psychological problems. The accident was not survivable."}