{"url": "https://www.baaa-acro.com/crash/crash-boeing-kc-135a-bn-stratotanker-near-luke-afb-4-killed", "date": "Mar 13, 1982 at 1050 LT", "type": "Boeing KC-135 Stratotanker", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Phoenix - Luke AFB", "msn": "17560/169", "yom": 1958, "flight_number": null, "city": "Luke AFB", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3604, "captain_hours_type": 370, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10650, "circumstances": "The KC-135A aircraft departed Phoenix-Sky Harbor International Airport at 0755 MST for a scheduled 3-hour and 30-minute flight. After completing the navigation leg, the aircraft descended into the Phoenix area for transition at Luke AFB. After completing one TACAN approach at Luke AFB, the KC-135A aircraft was vectored to Phoenix-Sky Harbor International Airport for an ILS touch-and-go landing. The aircraft was then vectored back to the final approach course for a TACAN runway 03 left approach at Luke AFB. The KC-135A aircraft was cleared for the approach to Luke AFB, and after the final approach fix radio call, a midair collision occurred with a Grumman American Yankee civilian aircraft. The empennage of the KC-135A separated, rendering the aircraft incapable of flight and it was destroyed upon ground impact. The Grumman American Yankee aircraft was destroyed during the midair collision. The four crew members in the KC-135A and the two civilians in the Grumman American Yankee were fatalities. \r\nCrew:\r\nLT Col James N. Floor, \r\nLt Col Ted L. Beam, \r\nMaj Truman R. Young Jr.,\r\nT/Sgt Donald J. Plough.", "probable_cause": "The USAF KC-135 was on an IFR flight plan and executing a TACAN 03L approach to Luke AFB. The AA-1 had departed Sky Harbour Airport and had been released by phoenix TRSA. The AA-1 was heading westerly in airspace designated as a special traffic area and was required to have been at or below 2,000 ft msl. A pilot of another aircraft who was trailing the AA-1 stated that a low broken cloud cover was encountered and he had to descend to about 2,000 ft to remain 500 ft below the bases. He stated the pilot of the AA-1 did not descend but appeared to be skimming along in and out of the bases of the clouds. He noticed the KC-135 descending through the cloud deck followed immediately by the collision. The collision occurred about 5 mi south of Luke AFB at an altitude of 2,500 ft msl. The logbook of the AA-1 pilot indicated this was his first trip to the phoenix area. Luke AFB was depicted on the north side of the sectional chart only. VOR airway #16 was split along an e-w line with the northern and southern halves being depicted on each side of the chart.\n\r\nOccurrence #1: midair collision\r\nPhase of operation: cruise - normal\r\nFindings\r\n1. En route charts - inadequate\r\n2. (c) vfr procedures - improper - pilot in command AA-1\r\n3. (f) lack of familiarity with geographic area - pilot in command AA-1"}