{"url": "https://www.baaa-acro.com/crash/crash-rockwell-500s-shrike-commander-pembroke-park-2-killed", "date": "Aug 28, 2020 at 0902 LT", "type": "Rockwell Shrike Commander 500", "operator": "Conquest-Air-Cargo", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "City", "schedule": "Pompano Beach – Opa Locka", "msn": "500-3056", "yom": 1969, "flight_number": null, "city": "Pembroke Park", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 27780, "captain_hours_type": 300, "copilot_hours": 8029, "copilot_hours_type": null, "aircraft_hours": 10300, "circumstances": "The pilot-in-command seated in the right seat was providing familiarization in the multiengine airplane to the left seat pilot during a flight to a nearby airport for fuel. Shortly after takeoff, one of the pilots reported an engine problem and advised that they were diverting to a nearby airport. A witness along the route of flight reported hearing the engines accelerating and decelerating and then popping sounds; several witnesses near the accident site reported hearing no engine sounds. The airplane impacted a building and terrain about 10 minutes after takeoff. Very minimal fuel leakage on the ground was noted and only 23 ounces of aviation fuel were collected from the airplane’s five fuel tanks. No evidence of preimpact failure or malfunction was noted for either engine or propeller; the damage to both propellers was consistent with low-to-no power at impact. Since the pilot could not have visually verified the fuel level in the center fuel tank because of the low quantity of fuel prior to the flight, he would have had to rely on fuel consumption calculations since fueling based on flight time and the airplane’s fuel quantity indicating system. Although the fuel quantity indications at engine start and impact could not be determined postaccident from the available evidence, if the fuel quantity reading at the start of the flight was accurate based on the amount of fuel required for engine start, taxi, run-up, takeoff, and then only to fly the accident flight duration of 10 minutes, it would have been reading between 8 and 10 gallons. It is unlikely that the pilot, who was a chief pilot of a cargo operation and tasked with familiarizing company pilots in the airplane, would have knowingly initiated the flight with an insufficient fuel load for the intended flight or with the fuel gauge accurately registering the actual fuel load that was on-board. Examination of the tank unit, or fuel quantity transmitter, revealed that the resistance between pins A and B, which were the ends of the resistor element inside the housing, fell within specification. When monitoring the potentiometer pin C, there was no resistance, indicating an open circuit between the wiper and the resistor element. X-ray imaging revealed that the conductor of electrical wire was fractured between the end of the lugs at the wiper and for pin C. Bypassing the fractured conductor, the resistive readings followed the position of the float arm consistent with normal operation. Visual examination of the wire insulation revealed no evidence of shorting, burning or damage. Examination of the fractured electrical conductor by the NTSB Materials Laboratory revealed that many of the individual wires exhibited intergranular fracture surface features with fatigue striations in various directions on some individual grains. It is likely that the many fatigue fractured conductor strands of the electrical wire inside the accident tank unit or fuel transmitter resulted in the fuel gauge indicating that the tanks contained more fuel than the amount that was actually on board, which resulted in inadequate fuel for the intended flight and a subsequent total loss of engine power due to fuel exhaustion. The inaccurate fuel indication would also be consistent with the pilot’s decision to decline additional fuel before departing on the accident flight. While the estimated fuel remaining since fueling (between 15 and 51 gallons) was substantially more than the actual amount on board at the start of the accident flight (between 8 and 10 gallons), the difference could have been caused by either not allowing the fuel to settle during fueling, and/or the operational use of the airplane. Ultimately, the fuel supply was likely completely exhausted during the flight, which resulted in the subsequent loss of power to both engines. Given the circumstances of the accident, the effects from the right seat pilot’s use of cetirizine and the identified ethanol in the left seat pilot, which was likely from sources other than ingestion, did not contribute to this accident.", "probable_cause": "A total loss of engine power due to fuel exhaustion. Contributing to the fuel exhaustion was the fatigue fracture of an electrical wire in the tank unit or fuel transmitter, which likely resulted in an inaccurate fuel quantity indication."}