{"url": "https://www.baaa-acro.com/crash/crash-cessna-404-titan-ii-jandakot-2-killed", "date": "Aug 11, 2003 at 1537 LT", "type": "Cessna 404 Titan", "operator": "Fugro%20Spatial%20Solutions", "flight_phase": "Takeoff (climb)", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jandakot - Jandakot", "msn": "404-0820", "yom": 1981, "flight_number": null, "city": "Jandakot", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 16722, "captain_hours_type": 12345, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16819, "circumstances": "The aircraft took off from runway 24 right (24R) at Jandakot Airport, WA. One pilot and five passengers were on board the aircraft. The flight was being conducted in the aerial work category, under the instrument flight rules. Shortly after the aircraft became airborne, while still over the runway, the pilot recognized symptoms that he associated with a failure of the right engine and elected to continue the takeoff. The pilot retracted the landing gear, selected the wing flaps to the up position and feathered the propeller of the right engine. The pilot later reported that he was concerned about clearing a residential area and obstructions along the flight path ahead, including high-voltage powerlines crossing the aircraft’s flight path 2,400 m beyond the runway. The aircraft was approximately 450 m beyond the upwind threshold of runway 24R when the pilot initiated a series of left turns. Analysis of radar records indicated that during the turns, the airspeed of the aircraft reduced significantly below the airspeed required for optimum single-engine performance. The pilot transmitted to the aerodrome controller that he was returning for a landing and indicated an intention to land on runway 30. However, the airspeed decayed during the subsequent manoeuvring such that he was unable to safely complete the approach to that runway. The pilot was unable to maintain altitude and the aircraft descended into an area of scrub-type terrain, moderately populated with trees. During the impact sequence at about 1537, the outboard portion of the left wing collided with a tree trunk and was sheared off. A significant quantity of fuel was spilled from the wing’s fuel tank and ignited. An intense postimpact fire broke out in the vicinity of the wreckage and destroyed the aircraft. Four passengers and the pilot vacated the aircraft, but sustained serious burns in the process. One of those passengers died from those injuries 85 days after the accident. A fifth passenger did not survive the post-impact fire.", "probable_cause": "Significant factors:\r\n1. The material specification contained in the engineering order for replacing the pump bushing of the engine driven fuel pump (EDFP) fitted to the right engine was not appropriate.\r\n2. High torsional loads between the EDFP’s spindle shaft and the sleeve bearing sheared the pump’s drive shaft during a critical phase of flight.\r\n3. The reduction in fuel pressure was insufficient to sustain operation of the engine at the take-off power setting.\r\n4. The loss of engine power occurred close to the decision speed with the landing gear extended while the aircraft was over the runway.\r\n5. The pilot elected to continue the takeoff.\r\n6. The aircraft was manoeuvred, including turns and banks, at low altitude resulting in a decrease in airspeed below that required to maximise one-engine inoperative performance.\r\n7. The pilot was unable to maintain the aircraft’s altitude over terrain that was unsuitable for an emergency landing."}