{"url": "https://www.baaa-acro.com/crash/crash-cessna-207-skywagon-marathon", "date": "Dec 29, 2021 at 1622 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Two Zero Seven Inc.", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Marathon - Naples", "msn": "207-0196", "yom": 1971, "flight_number": null, "city": "Marathon", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On December 29, 2021, at 1622 eastern standard time, a Cessna 207 airplane, N1596U, sustained minor damage when it was involved in an accident in the Florida Bay near Marathon, Florida. The pilot sustained serious injuries and the two passengers sustained minor injuries. The airplane was operated by ExecAir of Naples as an on-demand passenger flight under the provisions of Title 14 Code of Federal Regulations Part 135. According to the operator, the pilot reported that the takeoff from The Florida Keys Marathon International Airport (MTH), Marathon, Florida was normal, and the flight progressed oncourse over water toward the destination of Naples Municipal Airport (APF), Naples, Florida. Once the airplane reached about 3,500 ft mean sea level, a “bang” from the engine was heard, which was immediately followed by a total loss of engine power and oil spraying onto the cowling. The pilot briefed the passengers that they would not be able to make it to land and to prepare for a water landing. Subsequently, the ditching was accomplished in open water, the airplane remained upright, and everyone evacuated the airplane. About 10-15 minutes later, a passing pleasure vessel rescued the occupants and a United States Coast Guard helicopter also arrived shortly thereafter. Review of photographs of the airplane after it was recovered to land revealed that it sustained minor damage to areas of the cowling, fuselage, and wings. Photos of the engine (Continental Motors, IO-520-F) revealed that a large fracture hole was sustained to the crankcase near the No. 2 cylinder, with several internal engine components protruding from the area. The magnetos were also observed to have fractured from their attach points and were resting on top of the engine. The propeller was intact and showed minimal damage.", "probable_cause": null}