{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900c-1-saint-marys", "date": "Feb 11, 1999 at 2345 LT", "type": "Beechcraft 1900C", "operator": "ACE%20Air%20Cargo", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Anchorage – Saint Mary’s", "msn": "UC-28", "yom": 1988, "flight_number": "AER91", "city": "Saint Mary's", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12326, "captain_hours_type": 1587, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 19588, "circumstances": "The airline transport pilot was cleared for the localizer approach. The airplane impacted the ground 3.2 nautical miles from the runway threshold. The minimum descent altitude (MDA) for the approach was 560 feet msl, which is 263 feet above touchdown. Night, instrument meteorological conditions prevailed at the time of the accident. The surrounding terrain was flat, snow-covered, and featureless. The reported weather was 200 feet overcast, 1 1/2 miles visibility in snow, and winds of 12 knots, gusting to 32 knots. The pilot reported he was established on the final approach course, descending to the MDA, and then woke up in the snow. He said he did not remember any problems with the airplane. No pre accident mechanical anomalies were discovered with the airplane during the investigation. The airport has high intensity runway lights, sequenced flashing lead-in lights, and visual approach slope indicator lights. All airport lights and navigation aids were functioning. The airplane was not equipped with an autopilot. Captains have the option of requesting a copilot, but, the captain's pay is reduced by a portion equal to one-half the copilot's pay. The pilot had returned from the previous nights trip at 0725. He had three rest periods, four hours, two hours, and five hours 15 minutes, since his previous nights flight. Each rest period was interrupted by contact with the company. The company indicated that it is the pilot's responsibility to tell the company if duty times are being exceeded. 14 CFR 135.267 states, in part: '(d) Each assignment ... must provide for at least 10 consecutive hours of rest during the 24 hours that precedes the planned completion of the assignment.' ", "probable_cause": "The pilot's descent below the minimum descent altitude on the instrument approach. Factors were pilot fatigue resulting from the pilot's rest period being interrupted by scheduling discussions and the night weather conditions of low ceilings and whiteout. "}