{"url": "https://www.baaa-acro.com/crash/crash-saab-2000-werneuchen", "date": "Jul 10, 2002 at 2042 LT", "type": "Saab 2000", "operator": "Crossair.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Basel - Hamburg", "msn": "2000-047", "yom": 1997, "flight_number": "LX850", "city": "Werneuchen", "zone": "Brandenburg", "country": "Germany", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 16, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2600, "captain_hours_type": 2350, "copilot_hours": 1940, "copilot_hours_type": 1732, "aircraft_hours": 12303, "circumstances": "The twin engine aircraft departed Basel-EuroAirport on a flight to Hamburg with 16 passengers and four crew members on board. While descending to Hamburg, weather conditions deteriorated rapidly and due to thunderstorm activity with heavy rain falls and strong winds, the crew was unable to land at Hamburg-Fuhlsbüttel Airport and decided to divert to Bremen. Unfortunately, weather conditions were so poor that the crew was unable to land in Bremen, Hanover and Berlin-Tegel Airport as well. Due to low fuel reserve, the crew informed ATC about his situation and was vectored to Werneuchen, a former Soviet military airfield some 60 km northeast of Berlin. Werneuchen's unlighted runway has a length of 2,400 metres but has no approach aids. ATC warned the crew about the presence of a one metre high earth embankment across the runway, some 900 metres past the runway threshold which was there to avoid illegal car races. The remaining runway was still used for general aviation. Due to limited visibility caused by poor weather conditions, the crew was unable to see and avoid the earth embankment. After landing, the aircraft impacted the earth embankment, causing the undercarriage to be torn off. The aircraft slid on its belly for few dozen metres before coming to rest in the middle of the runway. All 20 occupants evacuated the cabin, among them two were slightly injured. The aircraft was damaged beyond repair.", "probable_cause": "The following findings were identified:\r\n- Dimension and intensity of the storm front and dynamics of the weather conditions,\r\n- Inadequate use of resources in decision-making during the flight (proactive),\r\n- Loss of alternative landing facilities at increasing time pressure (reactive),\r\n- Landing of the aircraft outside the operating area of an aerodrome,\r\n- Collision with the embankment due to the non-detection of an obstacle.\r\nSystemic causes:\r\n- Inadequate information on weather conditions and development before and during the flight,\r\n- Inadequate information on the Werneuchen Special Airfield due to an ambiguous map display as well as misleading or lack of communication,\r\n- Inadequate labeling/marking of the operational and non-operational areas of the airport."}