{"url": "https://www.baaa-acro.com/crash/crash-cessna-551-citation-iisp-near-bardufoss-4-killed", "date": "Nov 15, 1989 at 2302 LT", "type": "Cessna 551 Citation II", "operator": "Air Express - Norway", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "No", "site": "Mountains", "schedule": "Tromsø - Bardufoss", "msn": "551-0245", "yom": 1980, "flight_number": "AXP05", "city": "Bardufoss", "zone": "Troms", "country": "Norway", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 8920, "captain_hours_type": 460, "copilot_hours": 4067, "copilot_hours_type": 405, "aircraft_hours": 3417, "circumstances": "The aircraft departed Tromsø-Langnes Airport at 2248LT on an ambulance flight to Bardufoss, carrying one patient and three crew members. Four minutes later, at an altitude of 8,000 feet, the crew contacted Bardufoss control and obtained information for an ILS approach to runway 29. At 2254LT, the crew awas cleared to descend to 6,000 feet and was instructed by ATC to report once established on the ILS. At about 22:57:50 at a position about 8 NM north of the Målselv (MLV) NDB, the airspeed increased from 265 knots to 285 knots over a distance of about 5 NM. This speed was maintained up to the NDB. At 22:59:30 LN-AAE passed the MLV NDB. Instead of performing the left hand procedure turn from 174° to 122°, the crew continued a straight heading for about 30 seconds at an airspeed about 100 knots above the recommended approach speed. The aircraft was about 2 NM (4 km) south in relation to the established procedure pattern. The airplane should still have been at 6,000 feet until established on the ILS but it had descended 1,250 feet below the minimum altitude when it collided with a relatively flat mountain ridge just south of the summit of Langfjelltind (4,935 feet). The wreckage was found about 35 km east-southeast of the airport and all four occupants were killed. ", "probable_cause": "The accident resulted in a controlled flight into terrain after the crew failed to follow the ILS approach procedure to runway 29."}