{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3c-yellowknife", "date": "Aug 19, 2013 at 1712 LT", "type": "Douglas DC-3", "operator": "Buffalo%20Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yellowknife - Hay River", "msn": "9371", "yom": 1943, "flight_number": "BFL168", "city": "Yellowknife", "zone": "Northwest Territories", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 21, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13000, "captain_hours_type": 4300, "copilot_hours": 500, "copilot_hours_type": 125, "aircraft_hours": null, "circumstances": "On 19 August 2013, a Buffalo Airways Ltd. Douglas DC-3C (registration C-GWIR, serial number 9371) was operating as a scheduled passenger flight from Yellowknife, Northwest Territories, to Hay River, Northwest Territories. After lift-off from Runway 16 at 1708 Mountain Daylight Time, there was a fire in the right engine. The crew performed an emergency engine shutdown and made a low-altitude right turn towards Runway 10. The aircraft struck a stand of trees southwest of the threshold of Runway 10 and touched down south of the runway with the landing gear retracted. An aircraft evacuation was accomplished and there were no injuries to the 3 crew members or the 21 passengers. There was no post-impact fire and the 406 MHz emergency locator transmitter did not activate.", "probable_cause": "Findings as to causes and contributing factors:\r\n1. An accurate take-off weight and balance calculation was not completed prior to departure, resulting in an aircraft weight that exceeded its maximum certified takeoff weight.\r\n2. The right engine number 1 cylinder failed during the take-off sequence due to a preexisting fatigue crack, resulting in an engine fire.\r\n3. After the right propeller’s feathering mechanism was activated, the propeller never achieved a fully feathered condition likely due to a seized bearing in the feathering pump.\r\n4. The windmilling right propeller caused an increase in drag which, combined with the overweight condition, contributed to the aircraft’s inability to maintain altitude, and the aircraft collided with terrain short of the runway.\r\n5. The operator’s safety management system was ineffective at identifying and correcting unsafe operating practices.\r\n6. Transport Canada’s surveillance activities did not identify the operator’s unsafe operating practices related to weight and balance and net take-off flight path calculations. Consequently, these unsafe practices persisted. \r\nFindings as to risk:\r\n1. If companies do not adhere to operational procedures in their operations manual, there is a risk that the safety of flight cannot be assured.\r\n2. If Transport Canada does not adopt a balanced approach that combines inspections for compliance with audits of safety management processes, unsafe operating practices may not be identified, thereby increasing the risk of accidents.\r\n3. If cockpit or data recordings are not available to an investigation, this may preclude the identification and communication of safety deficiencies to advance transportation safety.\r\nOther findings:\r\n1. Current Canadian Aviation Regulations permit a transport category piston-powered aircraft to carry passengers without a flight data recorder or cockpit voice recorder.\r\n2. The crew resource management component of the flight attendant’s training had not been completed."}