{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-31-boston-88-killed", "date": "Jul 31, 1973 at 1108 LT", "type": "Douglas DC-9", "operator": "Delta-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Burlington - Manchester - Boston", "msn": "47075/166", "yom": 1967, "flight_number": "DL723", "city": "Boston-Logan", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 83, "pax_fatalities": 82, "other_fatalities": 0, "total_fatalities": 88, "captain_hours": 14840, "captain_hours_type": 1457, "copilot_hours": 6994, "copilot_hours_type": 217, "aircraft_hours": 14639, "circumstances": "As Delta Flight 723 was descending, the approach clearance was given by the controller after a delay, because the controller was preoccupied with a potential conflict between two other aircraft. This caused the flight to be poorly positioned for approach. The aircraft passed the Outer Marker at a speed of 385 km/h (80 km/h too fast) and was 60 m above the glide slope. The flight director was inadvertently used in the 'go-around-mode', which led to abnormal instrument indications. This caused some confusion. The first officer, who was flying the approach became preoccupied with the problem. The DC-9 continued to descend and struck a seawall 3000 feet short of and 150 feet to the right of runway 04R, crashed and caught fire. RVR at the time was 500 m with 60 m overcast. Two passengers survived, one died a day later while the second passed away on December 11, 1973.", "probable_cause": "The failure of the flight crew to monitor altitude and to recognize passage of the aircraft through the approach decision height during an unstabilized precision approach conducted in rapidly changing meteorological conditions. The unstabilized nature of the approach was due initially to the aircraft's passing the outer marker above the glide slope at an excessive airspeed and thereafter compounded by the flight crew's preoccupation with the questionable information presented by the flight director system. The poor positioning of the flight for the approach was in part the result of nonstandard air traffic control services."}