{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e90-king-air-sotillo-de-las-palomas-4-killed", "date": "Dec 4, 2016 at 1617 LT", "type": "Beechcraft 90 King Air", "operator": "PA Scale Company of Florida", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Madrid – Cascais", "msn": "LW-303", "yom": 1979, "flight_number": null, "city": "Sotillo de las Palomas", "zone": "Castile-La Mancha", "country": "Spain", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Madrid-Cuatro Vientos Airport on a private flight to Cascais, Portugal, carrying three passengers and one pilot. One of the reasons for the flight was to repair the weather radar at a Portuguese maintenance center that specialized in this equipment. The pilot had to delay the takeoff until 1557LT due to bad weather conditions. The aerodrome of Cuatros Vietnos was in instrument conditions (IMC), which forced its closing from 0900LT until 1444LT. At 1615LT, the aircraft was en route, climbing from flight level 190 to its authorized cruise level of 210. Moments later, according to a detailed analysis of the data taken from the radar, there was a yaw to the left, and the aircraft started to turn in this direction and suddenly lose altitude. After this event, the airspeed fell quickly and gradually until the aircraft stalled. The aircraft went into a spin, which after some time turned into a flat spin. As the airplane descended out of control, and with the spin fully developped, loads were placed on the horizontal tail that exceeded the design loads, causing the tail to break up in flight into five parts before the aircraft impacted the ground. The aircraft was completely destroyed by the impact and sibsequent fire, and its four occupants were killed in the accident. ", "probable_cause": "The investigation has concluded that this accident was caused by the loss of control of the aircraft in flight due to a stall and subsequent spin. Due to the high degree of destruction of the aircraft's wreckage after the ground impact and subsequent fire, and the lack of other pertinent data to do so, it has not been possible to determine with precision the sequence of the process leading to the aircraft stall/spin.\r\nThe investigation identified the following contributing factors:\r\n- The decision to make the flight with adverse meteorological conditions (IMC) along the planned route, considering the fact that the weather radar was not operational.\r\n- The forecast of moderate to strong icing conditions in areas of the route (presence of cumulonimbus with caps of up to 35,000 feet and with temperatures between -17°C and -19°C at flight level FL180) suggests that the formation of ice or its accumulation on the aircraft has been a significant contributory factor in this accident\r\n- The use of the autopilot and the failure to disengage it when the emergency situation arose, as it is concluded from the detailed analysis of the radar data, could have contributed significantly to the process that resulted in the loss of control of the aircraft.\r\n- The inadequate training of the pilot (who lacked the type rating for the accident aircraft) in abnormal or emergency situations on the accident aircraft."}