{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-1247-plettenberg-bay-9-killed", "date": "Feb 8, 2011 at 1633 LT", "type": "Pilatus PC-12", "operator": "Majuba Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Queenstown - Plettenberg Bay", "msn": "858", "yom": 2007, "flight_number": null, "city": "Plettenberg Bay", "zone": "Western Cape", "country": "South Africa", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 2662, "captain_hours_type": 582, "copilot_hours": 351, "copilot_hours_type": 112, "aircraft_hours": 1096, "circumstances": "The aircraft, which was operated under the provisions of Part 91 of the Civil Aviation Regulations (CARs), departed from Queenstown Aerodrome (FAQT) at 1329Z on an instrument flight plan for Plettenberg Bay Aerodrome (FAPG). On board the aircraft were two (2) crew members and seven (7) passengers. The estimated time of arrival for the aircraft to land at FAPG was 1430Z, however the aircraft never arrived at its intended destination, nor did the crew cancel their search and rescue as per flight plan/air navigation requirements. At ±1600Z an official search for the missing aircraft commenced. The search was coordinated by the Aeronautical Rescue Co-ordination Centre (ARCC). The first phase of the search, which was land based, was conducted in the Robberg Nature Reserve area. Progress was slow due to poor visibility associated with dense mist and night time. A sea search was not possible following activation of the official search during the late afternoon and night time, but vessels from the National Sea Rescue Institute (NSRI) were able to launch at first light the next morning. Floating debris (light weight material) was picked up from the sea and along the western shoreline of the Robberg Nature Reserve where foot patrols were conducted. On 11 February 2011 the South African Navy joined the search for the missing wreckage by utilizing side scan sonar equipment to scan the sea bed for the wreckage. All the occupants on board the aircraft were fatally injured in the accident. ", "probable_cause": "The aircraft crashed into the sea following a possible in flight upset associated with a loss of control during IMC conditions. \r\nThe following contributory factors were identified:\r\n- Deviation from standard operating procedures by the crew not flying the published cloud-break procedure for runway 30 at FAPG, but instead opted to attempt to remain visual with the ground/sea (comply with VMC requirements) by descending over the sea and approaching the aerodrome from the southeast (Robberg Nature Reserve side).\r\n- Inclement weather conditions prevailed in the area, which was below the minima to comply with the approved cloud-break procedure for runway 30 at FAPG (minimum safety altitude of 844 feet according to cloud-break procedure) as published at the time of the accident.\r\n- Judgement and decision making lacking by the crew. (The crew continued from the seaward side with the approach during IMC conditions and not diverting to an alternative aerodrome with proper approach facilities timeously although a cell phone call in this regard indicate such an intention).\r\n- The possibility that the pilot-flying at the time became spatially disorientated during the right turn while encountering / entering IMC conditions in an attempt to divert to FAGG should be regarded as a significant contributory factor to this accident.\r\n- This was the first time as far as it could be determined that the two crew members flew together."}