{"url": "https://www.baaa-acro.com/crash/crash-boeing-757-23a-lima-70-killed", "date": "Oct 2, 1996 at 0111 LT", "type": "Boeing 757-200", "operator": "AeroPeru-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Miami - Lima - Santiago", "msn": "25489", "yom": 1992, "flight_number": "PL601", "city": "Lima", "zone": "Lima", "country": "Peru", "region": "South America", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 61, "pax_fatalities": 61, "other_fatalities": 0, "total_fatalities": 70, "captain_hours": 21955, "captain_hours_type": 1520, "copilot_hours": 7954, "copilot_hours_type": 719, "aircraft_hours": 10654, "circumstances": "The aircraft departed Lima-Jorge Chávez Airport at 0042LT on an international regular service to Santiago de Chile, carrying 61 passengers and a crew of nine. When they took off and reached speed V2 + 10, the crew noticed that the altimeters were not responding and that something irregular was occurring. They therefore decided to notify the control tower in Lima to declare an emergency, consulted Lima for confirmation of their altitude by radar, and requested assistance to return via radar vectors. After 29 minutes of flight, while returning to Lima airport and with the crew attempting to control the aircraft, it impacted with the sea 48 nautical miles from the airport, with the total loss of the aircraft and all of its occupants.", "probable_cause": "The following findings were reported:\r\n- It can be deduced from the investigation carried out that the maintenance staff did not remove the protective adhesive tape from the static ports. This tape was not detected during the various phases of the aircraft's release to the line mechanic, its transfer to the passenger boarding apron and, lastly, the inspection by the crew responsible for the flight (the walk-around or pre-flight check), which was carried out by the pilot-in-command, according to the mechanic responsible for the aircraft on the day of the accident.\r\n- The pilot-in-command made a personal error by not complying with the procedure for GPWS alarms and not noticing the readings of the radio altimeters in order to discard everything which he believed to be fictitious.\r\n- The copilot made a personal error by not being more insistent, assertive and convincing in alerting the pilot-in-command much more emphatically to the ground proximity alarms."}