{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dash-8-q402-yangon", "date": "May 8, 2019 at 1852 LT", "type": "De Havilland DHC-8-400 (Dash-8)", "operator": "Biman%20Bangladesh%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dhaka - Yangon", "msn": "4367", "yom": 2011, "flight_number": "BG060", "city": "Yangon-Mingaladon", "zone": "Yangon Region", "country": "Myanmar", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 28, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9646, "captain_hours_type": 1474, "copilot_hours": 580, "copilot_hours_type": 405, "aircraft_hours": 8115, "circumstances": "The route of the aircraft on that day was DAC-RGN-DAC. At (18:03) the Bombardier DHC-8-402 aircraft, registered (S2-AGQ) contacted Yangon control tower and at (18:16) had ILS established and reported to the Yangon control tower. Due to adverse weather, Yangon control tower asked them to execute a go-around and the aerodrome operations was closed for the aviation safety for 2 hours. When the weather condition got better, the aerodrome operations was opened. And then the DHC-8-402 aircraft, registered S2-AGQ made RNP approach because only localizer was available at that moment. While the Bombardier DHC-8-402 aircraft was and making approach to runway 21, it was a bit higher than on slope 3 degree and landed on runway 21, remaining on the ground for upwards of 7 seconds, but the aircraft ran parallel to the runway, and then it flew up in the air up to 44 ft above the ground and sank again and collided with runway 03 and slid forward out of the runway and came to a complete stop on the over-run of the runway 03. There was no fire. All gears were collapsed and fuselage was broken into three sections. All 33 occupants were evacuated, among them 20 were injured. The aircraft was destroyed. ", "probable_cause": "While the aircraft was unstabilized on approach, the pilot did not execute a go-around. "}