{"url": "https://www.baaa-acro.com/crash/crash-cessna-525c-citationjet-cj4-cleveland-6-killed", "date": "Dec 29, 2016 at 2257 LT", "type": "Cessna 525 CitationJet CJ4", "operator": "Superior-Beverage-Group", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Cleveland – Columbus", "msn": "525C-0072", "yom": 2012, "flight_number": null, "city": "Cleveland-Burke Lakefront", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 1205, "captain_hours_type": 56, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 861, "circumstances": "The airplane entered a right turn shortly after takeoff and proceeded out over a large lake. Dark night visual conditions prevailed at the airport; however, the airplane entered instrument conditions shortly after takeoff. The airplane climb rate exceeded 6,000 fpm during the initial climb and it subsequently continued through the assigned altitude of 2,000 ft mean sea level. The flight director provided alerts before the airplane reached the assigned altitude and again after it had passed through it. The bank angle increased to about 62 degrees and the pitch attitude decreased to about 15 degrees nose down, as the airplane continued through the assigned heading. The bank angle ultimately decreased to about 25 degrees. During the subsequent descent, the airspeed and descent rate reached about 300 knots and 6,000 fpm, respectively. The enhanced ground proximity warning system (EGPWS) provided both \"bank angle\" and \"sink rate\" alerts to the pilot, followed by seven \"pull up\" warnings. A postaccident examination of the recovered wreckage did not reveal any anomalies consistent with a preimpact failure or malfunction. It is likely that the pilot attempted to engage the autopilot after takeoff as he had been trained. However, based on the flight profile, the autopilot was not engaged. This implied that the pilot failed to confirm autopilot engagement via an indication on the primary flight display (PFD). The PFD annunciation was the only indication of autopilot engagement. Inadequate flight instrument scanning during this time of elevated workload resulted in the pilot allowing the airplane to climb through the assigned altitude, to develop an overly steep bank angle, to continue through the assigned heading, and to ultimately enter a rapid descent without effective corrective action. A belief that the autopilot was engaged may have contributed to his lack of attention. It is also possible that differences between the avionics panel layout on the accident airplane and the airplane he previously flew resulted in mode confusion and contributed to his failure to engage the autopilot. The lack of proximal feedback on the flight guidance panel might have contributed to his failure to notice that the autopilot was not engaged.The pilot likely experienced some level of spatial disorientation due to the dark night lighting conditions, the lack of visual references over the lake, and the encounter with instrument meteorological conditions. It is possible that once the pilot became disoriented, the negative learning transfer due to the differences between the attitude indicator display on the accident airplane and the airplane previously flown by the pilot may have hindered his ability to properly apply corrective control inputs. Available information indicated that the pilot had been awake for nearly 17 hours at the time of the accident. As a result, the pilot was likely fatigued which hindered his ability to manage the high workload environment, maintain an effective instrument scan, provide prompt and accurate control inputs, and to respond to multiple bank angle and descent rate warnings.", "probable_cause": "Controlled flight into terrain due to pilot spatial disorientation. Contributing to the accident was pilot fatigue, mode confusion related to the status of the autopilot, and negative learning transfer due to flight guidance panel and attitude indicator differences from the pilot's previous flight experience.\n"}