{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh104-dove-i-yangon", "date": "Nov 22, 1950", "type": "De Havilland DH.104 Dove", "operator": "Union-of-Burma-Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "04195", "yom": 1948, "flight_number": null, "city": "Yangon", "zone": "Yangon Region", "country": "Myanmar", "region": "Asia", "crew_on_board": 0, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft commenced a normal take-off and when airborne, \"wheels up\" was selected. Since sticking of the undercarriage selector knob was experienced the radio operator was requested to operate the undercarriage safety switch. The undercarriage retracted normally and the aircraft immediately sank and struck the runway. The pilot shut off power and the aircraft slid at high speed for a considerable distance down the runway. The aircraft caught fire but all passengers and crew were evacuated safely before the aircraft was almost completely destroyed. The pilot-in-command stated in his evidence that he had no idea of the airspeed at the time he retracted the undercarriage but he was satisfied that he had the safety speed. Although 'Pilots notes' give 20 degrees of flap for take-off no flap was used in this case as the pilot felt that, in the event of engine failure after take-off, 20 degrees flap would make it more difficult to handle the aircraft on one engine. It was brought out in the evidence that in handling the undercarriage lever, which is at times awkward to operate in Dove aircraft, the attention of the pilot can be distracted from actual flight.", "probable_cause": "The accident was caused by the combination of the following factors: \r\n- The aircraft was pulled off after too short a take-off run at a low speed. \r\n- The undercarriage was retracted too early and before safety speed was reached, whilst still at a very low altitude. \r\n- The aircraft sank back on to the runway before the safety speed was reached. This my be due to either a thermal disturbance or to the fact that the pilot's attention was distracted by difficulty in retracting the undercarriage. \r\n- The aircraft caught fire to the rear of the starboard engine nacelle while still sliding down the PSP runway, due possibly to the fracture of petrol pipes and electrical circuits. \r\n- The pilot failed to operate the fire extinguishers in the engine nacelles which might have prevented the outbreak of fire. (The inertia switch of the static fire extinguishers in the engine bays were not operating due to the relatively slow acceleration. \r\n- The airport fire tender delivered its full complement of 2,500 gallons of foam, but was late in arrival as a result of taking the unserviceable taxi track, and the equipment on it was not applied to the best advantage due to the inexperience of the crew. \r\n- The fire burnt itself out and the aircraft was almost totally destroyed."}