{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-near-points-north-landing", "date": "May 1, 1999", "type": "De Havilland DHC-3 Otter", "operator": "Points%20North%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": null, "msn": "23", "yom": 1953, "flight_number": null, "city": "Points North Landing", "zone": "Saskatchewan", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 20000, "captain_hours_type": 6400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The wheel-ski equipped de Havilland DHC-3 Otter, C-FASV, serial number 23, was engaged in flying road construction crews from base camps to work sites in northern Saskatchewan. A five-man crew was moved from a base camp to a small lake, about 22 nautical miles (nm) from Points North Landing, Saskatchewan, the company's main base. The drop-off was made in the morning with a pick-up planned for late afternoon. The pilot then flew back to Points North Landing and filled the aircraft's fuel tanks from the company's main fuel supply. When the pilot returned for the pick-up, the ambient temperature was about seven degrees Celsius, and there were between five and six inches of slush on the ice surface. The pilot loaded the passengers and attempted a take-off. The aircraft accelerated slowly in the slush, and the pilot rejected the take-off. He selected a different take-off run, moved a passenger to a forward seat, and attempted a second take-off. The pilot continued beyond his previously selected rejection distance. The engine revolutions per minute (rpm) then reportedly decreased by about 150 rpm. The aircraft did not become airborne, and it ran into the low shoreline and crashed, skidding to a stop about 300 feet from the shore. An intense fire broke out immediately. The passengers and pilot evacuated the aircraft. Only one passenger suffered minor burns during the evacuation. Flames engulfed the main fuselage and engine, destroying the aircraft.", "probable_cause": "The pilot continued the take-off run with the left ski firmly adhering to the slushy surface beyond a point at which a reject could have been made safely. Contributing to the occurrence was the decrease in engine rpm during take-off."}