{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-fort-lauderdale", "date": "Aug 13, 2005 at 1557 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Twin-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "North Eleuthera - Fort Lauderdale", "msn": "31-8152033", "yom": 1981, "flight_number": "TTL217", "city": "Fort Lauderdale-Hollywood", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14500, "captain_hours_type": 6550, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot provided an emergency briefing to the passengers before departure. The outboard fuel tanks were empty and the inboard fuel tanks were filled before departure. After takeoff, the flight climbed to 8,500 feet msl and proceeded towards the destination airport. During cruise flight while flying at 1,000 feet msl approximately 10 miles from the destination airport , the left engine started losing power, but the airplane did not yaw; the left cowl flap was closed at the time. The pilot reported the left fuel flow light was on, but the fuel pressure was in the green arc (indicating approximately 38 to 42 psi). He switched each fuel selector to its respective outboard fuel tank though the outboard tanks were empty, turned on both emergency fuel pumps, and also attempted cross feeding fuel to the left engine in an effort to restore engine power but was unsuccessful. The left engine manifold pressure decreased to 18 inHg, and he was maintaining \"blue line\" airspeed plus a few knots with the right engine at full power. He slowed the airplane to less than blue line airspeed in an attempt to \"gain altitude\", and approximately 2 to 3 minutes after first noticing the loss of engine power from the left engine with the manifold pressure indication of 15 inHg, and after seeing boats nearby, he moved the left propeller control to the feather position but later reported the propeller did not feather. The left engine rpm was in the upper green arc through the whole event, and he did not see any oil coming out of the left engine cowling. The flight was unable to maintain altitude, and he advised the passengers to don but not inflate their life vests. He maneuvered the airplane into the wind near boats, and ditched with the flaps and landing gear retracted. All occupants exited the airplane and were rescued by one of the nearby boats. Each inboard fuel tank is equipped with a \"surge tank\" and a flapper valve, and also a sensing probe installed at the outlet of the tank. The airplane POH/AFM indicates that if the fuel flow light illuminates, and there is fuel in the corresponding tank, a malfunction of the flapper valve has occurred. The airplane was not recovered; therefore no determination could be made as to the reason for the reported loss of engine power from the left engine, nor the reason for the failure of the left propeller to feather.", "probable_cause": "The reported loss of engine power from the left engine, and the failure of the left propeller to feather for undetermined reasons, resulting in the inability to maintain altitude, and subsequent ditching.\n"}