{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90gti-king-air-paraty-2-killed", "date": "Jan 3, 2016 at 1430 LT", "type": "Beechcraft 90 King Air", "operator": "Supermercados-Shibata.png", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Mountains", "schedule": "Campo de Marte - Paraty", "msn": "LJ-1866", "yom": 2008, "flight_number": null, "city": "Paraty", "zone": "Rio de Janeiro", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 801, "captain_hours_type": 319, "copilot_hours": 159, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Campo de Marte Airport at 1334LT on a positioning flight to Paraty, with an ETA at 1415LT. While descending to Paraty Airport, the crew encountered instrument meteorological conditions. On final, while approaching under VFR mode, the aircraft impacted trees and crashed in a dense wooded area located in hilly terrain few km short of runway. The aircraft was destroyed and both pilots were killed. ", "probable_cause": "Contributing factors:\r\n- Attention - undetermined\r\nMoments before the accident, another aircraft successfully completed the landing at the Paraty aerodrome. It is possible that the pilot's attention was focused on this information, which indicated the possibility of landing, despite the critical conditions faced, leading him to take high risks to make the landing in critical conditions.\r\nAlso, the presence of a copilot not qualified to operate the aircraft may have influenced the pilot's cognitive processes, causing deconcentration or deviation of attention from the pilot.\r\n- Attitude - contributed\r\nRecurring attempts to make the landing indicated an excess of self-confidence on the part of the pilot, leading him to continue the flight to the Paraty aerodrome, even in adverse weather conditions.\r\nThe bold operational profile of the pilot, his past experience and the rules and values ​​adopted informally in the group of pilots are possible factors that influenced the development of this attitude of excessive self-confidence.\r\n- Adverse weather conditions - contributed\r\nOn the day of the accident, the weather conditions were not favorable for visual flight at the Paraty aerodrome.\r\n- Culture of the working group - contributed\r\nAmong the pilots who operated in the Paraty region, competitive behavior had been installed, valued by the social recognition attributed to those who managed to operate in critical conditions. Above all, landing under conditions adverse weather conditions in the region was considered a manifestation of proficiency and professional competence. The values ​​shared by that group of pilots favored the weakening of the collective perception about the present operational risks. The presence of other pilots who were also trying to land in the region on the day of the occurrence, as well as the landing made by one of these aircraft, moments before the accident, and also the accomplishment of two failed attempts of the PP-LMM aircraft, translates clear evidence of that behavior.\r\n- Pilot forgetfulness - undetermined\r\nThe fact that the landing gear was not retracted during the second launch in the air indicated a failure, fueled by the possible forgetfulness of the crew, to perform the planned procedure. Maintaining the landing gear in the lowered position affected the aircraft's performance during the ascent, which may have contributed to the aircraft not reaching the height required to clear obstacles.\r\n- Pilotage Judgment - undetermined\r\nThe possible decision not to retract the landing gear during the launch affected the aircraft's performance during the climb, which may have contributed to the aircraft not reaching the height necessary to clear the obstacles.\r\n- Motivation - undetermined\r\nThe successful landing by the pilot of another aircraft, even under unfavorable conditions, may have increased the motivation of the pilot of the PP-LMM aircraft to complete the landing, in order to demonstrate his proficiency and professional competence.\r\n- Perception - contributed\r\nThe occurrence of a collision with the ground, in controlled flight, indicated that the crew had a low level of situational awareness at the time of the occurrence. This inaccurate perception of the circumstances of the flight made it impossible to adopt the possible measures that could prevent the collision.\r\n- Decision making process - contributed\r\nThe pilot chose to make two landing attempts at the Paraty aerodrome, despite adverse weather conditions, indicating an inaccurate assessment of the risks involved in the operation. This evaluation process may have been adversely affected by the competition behavior installed among the pilots. In this context, it is possible that the pilot based his decision only on the successful landing of another aircraft, a fact that limited his scope of evaluation.\r\n- Organizational processes - undetermined\r\nThe PP-LMM aircraft was operated by a group of pilots, mostly composed of freelance professionals, who were informally managed by a hired pilot. Therefore, there was no formal system used by the operator to recruit, select, monitor and evaluate the performance of professionals. The failures related to the management of this process, possibly, caused inadequacies in the selection of pilots, in the crew scale, in untimely activations and, as in the case in question, in the choice of crew member not qualified to exercise function on board."}