{"url": "https://www.baaa-acro.com/crash/crash-antonov-24b-sovetskiy-32-killed", "date": "Nov 21, 1989 at 1728 LT", "type": "Antonov AN-24", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Perm - Sovetskiy", "msn": "97305602", "yom": 1979, "flight_number": "SU37577", "city": "Sovetskiy", "zone": "Khantia-Mansia okrug", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 35, "pax_fatalities": 27, "other_fatalities": 0, "total_fatalities": 32, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 36861, "circumstances": "Following an uneventful flight from Perm, the crew started the descent to Sovetskiy Airport and was informed about the weather conditions at destination with ceiling down to 80 meters and an horizontal visibility estimated to 2 kilometers, which was below minimums. Despite this situation, the crew decided to continue the approach and deliberately passed below the minimum descent altitude probably to establish a visual contact with the ground. On short final, the aircraft struck tree tops (25 meters high), banked right and crashed in a wooded area located 700 meters short of runway 30, about 250 meters to the right of its extended centerline, bursting into flames. Eight passengers were rescued while 32 other occupants were killed. ", "probable_cause": "It was determined that the accident was the consequence of a wrong approach configuration of the flying crew who decided to continue the approach in below weather minimums and passed the MDA until the aircraft contacted trees and crashed. \r\nThe following contributing factors were reported:\r\n- Poor approach planning,\r\n- Unsatisfactory crew interactions, \r\n- Poor distribution of tasks among the flight crew,\r\n- Violation of minimums, \r\n- The crew decided to continue the approach after passing the MDA,\r\n- The crew failed to initiate a go-around procedure. "}