{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-burlington-9-killed", "date": "Aug 9, 2000 at 0752 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Patuxent Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "City", "schedule": "Lakehurst - Patuxent", "msn": "31-7952056", "yom": 1979, "flight_number": null, "city": "Burlington", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 3968, "captain_hours_type": 1418, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A Piper PA-31-350 Navajo Chieftain, N27944, operated by Patuxent Airways, Inc., Hollywood, Maryland, and a Piper PA-44-180 Seminole, N2225G, operated by Hortman Aviation Services, Inc., Philadelphia, Pennsylvania, were destroyed when they collided in flight over Burlington Township, New Jersey. The airline transport pilot, commercial pilot, and seven passengers aboard the Navajo Chieftain were killed, as were the flight instructor and the private pilot aboard the Seminole. Day visual meteorological conditions existed at the time of the accident, and both airplanes were operating under visual flight rules when the collision occurred. The flight crews of both airplanes were properly certificated and qualified in accordance with applicable Federal regulations. None of these individuals was experiencing any personal problems or rest anomalies that would have affected their performance. The airplanes had undergone the required inspections. Examination of their maintenance documents revealed that both airplanes complied with all appropriate airworthiness directives. Evidence gathered from the wreckage indicated that neither airplane had experienced an in-flight fire, bird strike, or structural or mechanical failure. Tissue samples revealed that the pilot of the Seminole had taken doxylamine sometime before the accident. (Doxylamine is a sedating antihistamine that has substantial adverse effects on performance.) However, the amount of blood available for analysis was insufficient for determining exactly when the pilot may have ingested the medication or whether his performance was impaired by the effects of doxylamine. A partial cockpit visibility study revealed that the Seminole would have been visible to the pilots in the Chieftain for at least the 60 seconds before the collision. No stereo photographs from a Seminole cockpit were available to determine precise obstruction angles. However, because of the relative viewing angle, the Chieftain would have been visible to the pilots in the Seminole for most of the last 60 seconds. The study further revealed that about 4 seconds before impact, or about .11 nm separation, the angular width of each airplane in each pilot's field of vision would have been approximately 0.5 to 0.6 degrees or about 1/4 inch apparent size at the windscreen. ", "probable_cause": "The failure of the pilots of the two airplanes to see and avoid each other and maintain proper airspace separation during visual flight rules flight."}