{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-nahant", "date": "May 5, 2001 at 2015 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Northeast Equipment Leasing Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Nantucket – Beverly", "msn": "31-8052068", "yom": 1980, "flight_number": null, "city": "Nahant", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1030, "captain_hours_type": 65, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3000, "circumstances": "The pilot departed his home airport for a 90 mile personal flight with eight passengers. The pilot stated he departed with 24 gallons of fuel in the outboard tanks, and 80 gallons of fuel in the main tanks. After landing, the airplane was refueled with 100 low-lead aviation gasoline; 12 gallons in each main fuel tank. Before departing for the return flight, the pilot performed a preflight inspection of the airplane, which did not include a visual check of the airplane's fuel tanks. After takeoff, the pilot experienced a \"small surge in both engines,\" while climbing through 1,150 and 3,300 feet, respectively. He further described the surges as \"minor but still noticeable.\" About 30 minutes later, after the airplane had descended, and was leveling at 1,500 feet, the pilot experienced an intermittent illumination of the \"right aux fuel pump light,\" which was followed by a total loss of power on the right engine. Shortly thereafter, the left engine began \"surging,\" and after about \"three or four minutes, at most,\" he feathered the left engine propeller. The pilot ditched the airplane in Massachusetts Bay. The airplane was recovered about 1 month later. The fuel selectors were positioned to the outboard tanks, and the airplane's fuel tanks revealed fluid consistent with seawater with \"some odor of fuel;\" however, no visible evidence of fuel was observed. According to the airplane's information manual, the airplane's total fuel capacity was 192 gallons, of which, 182 gallons were usable. Examination of the airframe and engine did not reveal evidence of any pre-impact mechanical malfunctions. The pilot reported he had purchased the airplane and attended 5-day type specific training course in March 2001. He reported about 1,050 hours of total fight experience, which included 800 hours in multi-engine airplanes, of which 65 hours was in the make and model. Additionally, the pilot reported he had not experienced any prior mechanical problems. He believed he had flown the airplane the day prior to the accident as well. The last documented refueling of the airplane prior to the date of the accident occurred on May 3, 2001, when the airplane was refueled with 128 gallons of aviation gasoline. The last flight documented in the pilot's logbook was on May 4, 2001, when the pilot logged 1.9 hours in the accident airplane. The pilot said he normally flew a 65 percent power, an \"a little rich,\" and experienced a fuel burn of about 20 to 21 gallons per hour, for each engine. ", "probable_cause": "A loss of engine power due to fuel exhaustion for undetermined reasons. A factor in this accident was the pilot's failure to visual check the airplane's fuel quantity prior to takeoff."}