{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-14p-surami-7-killed", "date": "Nov 28, 1964 at 0741 LT", "type": "Ilyushin II-14", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Tbilisi – Kutaisi", "msn": "1460 007 08", "yom": 1956, "flight_number": "SU051F", "city": "Surami", "zone": "Shida Kartli", "country": "Georgia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 11, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14861, "circumstances": "The aircraft departed Tbilisi Airport at 0655LT bound for Kutaisi on flight SU051F. The crew was cleared to climb to 2,700 meters and while approaching the region of Surami, he encountered poor weather conditions with snow falls and a visibility reduced to 50-500 meters. Following successives errors on part of ATC based in Kutaisi, the crew was cleared to descend from 2,700 to 2,100, 1,500 and then to 1,200 meters successively. In zero visibility, the twin engine aircraft struck the slope of a snow covered mountain located near Surami. The wreckage was found a day later at the altitude of 980 meters. Three crew members and four passengers were killed while eight other people were seriously injured. The aircraft was destroyed but there was no fire. ", "probable_cause": "It was determined the accident was the consequence of the following factors:\r\n- ATC at Tbilisi transferred the flight to ATC at Kutaisi without assuring the exact position of the aircraft,\r\n- At the time of the accident, the airplane was too late on track and 37 km behind schedule due to strong headwinds (120 km/h instead of 70 km/h),\r\n- Inappropriate information regarding the wind component and speed were transmitted to the crew, \r\n- ATC at Kutaisi misinterpreted aircraft and transmitted instructions to the wrong crew, causing the aircraft to descend prematurely. "}