{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2b-27-islander-puerto-montt-6-killed", "date": "Apr 16, 2019 at 1050 LT", "type": "Britten-Norman Islander", "operator": "Archipiélagos Servicios Aéreos", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "City", "schedule": "Puerto Montt - Ayacara", "msn": "2169", "yom": 1983, "flight_number": null, "city": "Puerto Montt-Marcel Marchant (La Paloma)", "zone": "Región de Los Lagos", "country": "Chile", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 1414, "captain_hours_type": 437, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 22330, "circumstances": "The twin engine airplane departed Puerto Montt-Marcel Marchant (La Paloma) Airport Runway 01 at 1050LT on a charter flight to Ayacara, carrying five passengers and one pilot. About 36 seconds after takeoff, while climbing, the pilot declared an emergency. The airplane entered a left turn then stalled and crashed onto a house located in a residential area, about 450 metres from the runway end, bursting into flames. The houses and the airplane were destroyed by a post crash fire and all six occupants were killed. One person in the house was injured. ", "probable_cause": "Loss of control of the airplane in flight, during a left turn, due to the failure of the right engine (n°2) during takeoff, caused by a fuel exhaustion.\r\nThe following contributing factors were identified:\r\n- Failure of the pilot to comply with the pre takeoff checklist, \r\n- Failure of the pilot to check the fuel selector switch and the fuel quantity prior to start the engines, \r\n- Failure of the pilot to feather the propeller of the right engine (n°2) during an emergency situation,\r\n- Failure of the pilot to bring the flaps to the neutral position during an emergency situation,\r\n- Decrease of the speed and altitude of the airplane,\r\n- Increase bank of the wing during a left turn."}