{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-roxboro-2-killed", "date": "Oct 1, 1989 at 2207 LT", "type": "Cessna 550 Citation II", "operator": "GTE South", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tampa - Roxboro", "msn": "550-0400", "yom": 1981, "flight_number": null, "city": "Roxboro", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7986, "captain_hours_type": 2643, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5111, "circumstances": "During arrival, flight was vectored for NDB runway 06 approach, and advised Raleigh-Durham weather was 500 feet overcast, visibility 3 miles with fog, wind from 140° at 12 knots, altimeter 30.01. After clearance for approach, aircraft crossed final approach fix (faf) at 2,100 feet msl. Radar service was terminated and frequency change was approved. When aircraft did not arrive, search was initiated. The wreckage was found about 2.5 miles southwest of runway 06, where aircraft hit trees and crashed. Elevation of crash site was about 600 feet msl. MDA for approach was 1,160 feet msl (with local altimeter setting; 1,260 feet with Raleigh-Durham setting). Exam revealed aircraft hit trees, while on runway heading in wings level attitude; configured for landing. No preimpact part failure/malfunction was found. Toxicological check of pic's blood showed 0.10 mg/l of diazepam and 0.09 mg/l of nordiazepam. Check of his urine showed metabolite of marijuana (11- nor-delta-9-tetrahydrocannabinol-9-carboxylic acid) at level of 0.117 mg/l. After surgery for malignant lymphoma (feb 89), pic was restored to flight status on 8/9/89 and cleared for pic duty one week later. He continued flying tho he received maintenance chemotherapy and associates noted that he tired easily. Both occupants were killed. ", "probable_cause": "Impairment of the pilot-in-command (pic) due to drugs/medication, chemotherapy and fatigue; failure of the pic to assure that the IFR (instrument) approach procedure was followed; and his failure to maintain the minimum descent altitude (MDA). Inadequate surveillance of the operation by company/operator/management personnel was a related factor."}