{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-truckee-2-killed", "date": "Dec 28, 2005 at 1406 LT", "type": "Learjet 35", "operator": "Skyward%20Aviation%20USA", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Twin Falls - Truckee - Carlsbad - Monterrey", "msn": "35-218", "yom": 1978, "flight_number": null, "city": "Truckee", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4880, "captain_hours_type": 2200, "copilot_hours": 1650, "copilot_hours_type": 56, "aircraft_hours": 9244, "circumstances": "The airplane collided with the ground during a low altitude, steep banked, base-to-final left turn toward the landing runway during a circling instrument approach. The airplane impacted terrain 1/3-mile from the approach end of runway 28, and north of its extended centerline. A witness, located in the airport's administration building, made the following statement regarding his observations: \"I saw the aircraft in and out of the clouds in a close base for [runway] 28. I then saw the aircraft emerge from a cloud in a base to final turn [and] it appeared to be approximately 300-400 feet above the ground. The left wing was down nearly 90 degrees. The aircraft appeared north of the [runway 28] centerline. The aircraft pitched nose down approximately 30-40 degrees and appeared to do a 1/2 cartwheel on the ground before exploding.\" ATC controllers had cleared the airplane to perform a GPS-A (circling) approach. The published weather minimums for category C and D airplanes at the 5,900-foot mean sea level airport was 3 miles visibility, and the minimum descent altitude was 8,200 feet mean sea level (msl). Airport weather observers noted that when the accident occurred, the visibility was between 1 1/2 and 5 miles. Scattered clouds existed at 1,200 feet above ground level (7,100 feet msl), a broken ceiling existed at 1,500 feet agl (7,400 feet msl) and an overcast condition existed at 2,400 feet agl (8,300 feet msl). During the approach, the first officer acknowledged to the controller that he had received the airport's weather. The airplane overflew the airport in a southerly direction, turned east, and entered a left downwind pattern toward runway 28. A 20- to 30-knot gusty surface wind existed from 220 degrees, and the pilot inadequately compensated for the wind during his base leg-to-final approach turning maneuver. The airplane was equipped with Digital Electronic Engine Controls (DEEC) that recorded specific data bits relating to, for example, engine speed, power lever position and time. During the last 4 seconds of recorded data (flight), both of the power levers were positioned from a mid range point to apply takeoff power, and the engines responded accordingly. No evidence was found of any preimpact mechanical malfunction. The operator's flight training program emphasized that during approaches consideration of wind drift is essential, and a circling approach should not be attempted in marginal conditions.", "probable_cause": "The pilot's inadequate compensation for the gusty crosswind condition and failure to maintain an adequate airspeed while maneuvering in a steep turn close to the ground.\n"}