{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-30f-bogota", "date": "Apr 28, 2004 at 0356 LT", "type": "Douglas DC-10", "operator": "Centurion-Air-Cargo-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Miami – Bogotá", "msn": "48277", "yom": 1981, "flight_number": null, "city": "Bogotá-El Dorado", "zone": "Bogotá Capital District", "country": "Colombia", "region": "South America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 77864, "circumstances": "Following an uneventful cargo flight from Miami-Intl Airport on behalf of Lineas Aéreas Suramericanas, the crew started a night approach to Bogotá-El Dorado Airport. On final, the aircraft was unstable and too low when the GPWS alarm sounded five times. The captain increased engine power and elected to gain height, causing the aircraft to continue over the glide. At an excessive speed of 180 knots, the aircraft landed 1,500 feet past the runway 13L threshold (runway 13L is 3,800 metres long). After touchdown, the crew started the braking procedure but unable to stop within the remaining distance, the aircraft overran. It lost its undercarriage, collided with the ILS equipment, lost both engines n°1 and 3 and eventually came to rest few hundred metres further in a grassy area. All three crew members escaped uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "Departure from runway 13 left the El Dorado airport as a result of a landing with a speed of 180 knots and 1500 feet from the threshold, during which the spoilers were not used and in which there was hydroplaning by the main landing gear making the braking action less than expected. The decision of the crew to continue the approach despite the fact that this was not stabilized in accordance with the criteria described in the manual of operations of the airline. The omission of points in the checklist and call out from the crew that resulted in a lower alert situation facing the parameters of the approach and monitoring the operation of key systems such as the extension of spoilers after the landing. The non-response to the ground proximity warning system that is sounded for at least five times during the final approach in two different modes."}