{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-campbell-river-8-killed", "date": "Sep 27, 1995 at 1910 LT", "type": "De Havilland DHC-3 Otter", "operator": "Western Straits Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Triumph Bay – Campbell River", "msn": "38", "yom": 1954, "flight_number": null, "city": "Campbell River", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 9002, "captain_hours_type": 1251, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16428, "circumstances": "The single-engine turbine Otter on amphibious floats departed Triumph Bay, British Columbia, at 1634 Pacific daylight saving time (PDT) with one pilot and nine passengers on board for a visual flight rules (VFR) flight to Campbell River. At 19:01:59 the pilot called Campbell River Flight Service Station (FSS) and reported that he was seven nautical miles (nm) northwest of the airport, inbound for Campbell River. Radar data from Comox indicate that, when this call was made, the aircraft was actually 11 nm northwest of Campbell River, just south of the Narrows (see map, Appendix A). At 19:02:40, the pilot was given the 1900 PDT Campbell River weather observation, which was as follows: ceiling 300 feet overcast and visibility two miles in light rain and fog. The pilot requested a special VFR (SVFR) clearance to enter the Campbell River control zone. Clearance for SVFR was delayed by Comox air traffic control (ATC) until an instrument flight rules (IFR) aircraft on approach to Campbell River had landed. At 19:03:54, the IFR aircraft reported breaking clouds at 900 feet above sea level (asl), which would be approximately 550 feet above ground level, on the ILS approach to runway 11 at Campbell River (airport elevation is 346 feet). This information was acknowledged by the turbine Otter pilot. The IFR aircraft landed at 1904, and the turbine Otter was issued an SVFR clearance at 19:04:45. Radar data indicate that, at that time, the aircraft was about one mile northwest of Tyee Spit, a frequently used, alternate landing site (water) for company aircraft when weather conditions preclude landing at Campbell River airport. Radar data indicate that, at 1906, after passing by Tyee Spit, the aircraft turned southbound and flew directly toward the airport. At about 2 1/2 miles from the airport, at 19:07:40, the aircraft turned right to a heading of approximately 310/ magnetic and flew in that general direction for about two minutes. The aircraft was on a track that was approximately parallel to the extended runway centre line, tracking outbound from the airport with the localizer and the Campbell River (YBL) non-directional beacon (NDB) to the left. The aircraft passed abeam the YBL NDB, which serves as the final approach fix (FAF) for the ILS approach to runway 11, and continued outbound. At 19:09:40, at about three miles outside the beacon, the aircraft turned left to a southerly heading toward the localizer and the YBL NDB. At 19:10:08, the pilot radioed that he was seven miles northwest; this was the last transmission received from the aircraft. At 19:10:25, radar contact was lost. The aircraft crashed into the northwest side of a 1,047-foot mountain at about the 860-foot level, in straight-and-level flight on a heading of 183/ magnetic. The pilot and seven of the passengers received fatal injuries. The two remaining passengers received serious injuries. The accident occurred at 1910 PDT during the hours of official daylight, at latitude 50/01'N, longitude 125/22'W. Official sunset in Campbell River was at 1908, and night was at 1940 PDT. ", "probable_cause": "The pilot progressively lost situational awareness while attempting to navigate in conditions of low visibility or in cloud and was unaware of the rapidly rising terrain in his flight path. Contributing to this accident were the existing visual flight regulations and the prevailing industry attitudes and practices which did not provide adequate safety margins. Contributing to the severity of the injuries was the detachment of the passenger seats at impact. "}