{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-augsburg", "date": "Dec 8, 2015 at 0942 LT", "type": "Cessna 340", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Mönchengladbach – Augsburg", "msn": "340A-1814", "yom": 1984, "flight_number": null, "city": "Augsburg", "zone": "Bavaria", "country": "Germany", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5188, "captain_hours_type": 75, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3747, "circumstances": "The twin engine aircraft departed Mönchengladbach on a flight to Augsbourg, carrying four passengers and one pilot. On descent to Augsburg Airport, the pilot was informed by ATC that weather conditions at destination were worse than predicted, that the visibility was estimated between 225 and 250 metres, thus below minimums. The pilot acknowledged and informed ATC about his intention to attempt an approach and that he would divert to Oberpfaffenhofen if necessary. On short final, at a height of 200 feet, the pilot established a visual contact with the runway lights and decided to continue. After passing over the threshold, he reduced the engine power when the aircraft entered a stall and impacted the runway surface. On impact, the undercarriage were torn off and the aircraft slid for 104 metres before coming to rest, bursting into flames. Four occupants were seriously injured and the fifth was slightly injured. The aircraft was partially destroyed by a post crash fire. ", "probable_cause": "The accident is the consequence of the pilot's decision to continue the approach and not to initiate a go-around procedure, which resulted in the aircraft entering an attitude he was unable to control. Poor approach planning on part of the pilot and poor decision making during the approach contributed to the accident, as well as the fact that the runway visual range (RVR) was 250 metres, which was below minimums. "}