{"url": "https://www.baaa-acro.com/crash/crash-avro-504k-chard-1-killed", "date": "Apr 30, 1933", "type": "Avro 504", "operator": "Devonshire Aviation Tours", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Chard - Chard", "msn": null, "yom": null, "flight_number": null, "city": "Chard", "zone": "Somerset", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The single engine airplane was dispatched in the area of Chard for local pleasure flights all day. Shortly after takeoff, while climbing to a height of about 100 feet, the engine failed. The pilot attempted to return for a safe landing but to avoid a telegraph line, he accidentally stalled the airplane that crashed on the ground. A passenger was killed and two other occupants were injured. ", "probable_cause": "The aeroplane was being employed for the purpose of giving pleasure trips and had made a considerable number of flights that day. Very shortly after the start of the last flight - when the aircraft was little more than 100 feet from the ground - the engine suddenly ceased to function. The pilot thereupon attempted to turn back to the only large field within reach, but in avoiding a line of telegraph wires he accidentally stalled the aeroplane. The machine crashed to the ground and one of the two passengers received fatal injuries. As a result of his investigations, the Inspector of Accidents came to the conclusion that the engine failed through shortage of petrol in the main tank (the machine had not been refuelled since the commencement of flying that day) and that, for this, the pilot was alone to blame, he having failed in his duty to exercise reasonable precautions to ensure the safety of his aircraft in flight. The Secretary of State for Air suspended the pilot's licence for twelve months."}