{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh114-heron-2e-cairns-11-killed", "date": "Oct 23, 1975 at 1928 LT", "type": "De Havilland DH.114 Heron", "operator": "Connair", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Alice Springs - Mount Isa - Cairns", "msn": "14067", "yom": 1955, "flight_number": "CK1263", "city": "Cairns", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 3859, "captain_hours_type": 1030, "copilot_hours": 184, "copilot_hours_type": 109, "aircraft_hours": 14986, "circumstances": "DH-114 Heron registered VH-CLS was operating Connair Flight 1263 from Alice Springs to Cairns landing at Mount Isa en route. At 12:57 hours VH-CLS taxied to runway 30 at Alice Springs and was cleared for takeoff. The flight landed at Mount Isa at 15:35 hours after making a visual approach. At 16:46 hours VH-CLS taxied to runway 34 at Mount Isa, and the flight reported its departure as 16:55 hours at which time it was climbing to its planned cruising altitude of 7000 feet. As the flight progressed position reports at the appropriate reporting points were received. At 18:01 hours, VH-CLS advised that it was descending to cruise at 6000 feet. Subsequently, at 18:49 hours, VH-CLS reported as being at the Saucebottle Creek position, 146 km southwest of Cairns, at an altitude of 6000 feet. The crew indicated an ETA at the Biboohra VOR, 35 km west of Cairns, of 19:12. VH-CLS was then advised by the Cairns aerodrome/approach controller, through the Cairns Flight Service Unit (FSU), to expect an ILS approach to runway 15 at Cairns Airport. At 18:54 hours the Cairns aerodrome/approach controller issued an air traffic clearance, for transmission through the Cairns FSU, authorising VH-CLS to enter the control area via the 049 degree radial of the Biboohra VOR cruising at 6000 feet and using an altimeter setting of 1006 millibars. At about 18:55 hours, the Weather Service Office (WSO) located at Cairns Airport observed a thunderstorm, without precipitation, in the vicinity of the airport and the following 'special' aerodrome weather report was issued: Wind : 360 degrees at 6 knots, visibility : 10 km or more, thunderstorm without precipitation, 1/8 cumulonimbus clouds, base 3000 feet, 4/8 cumulus, base 2300 feet, 4/8 strato cumulus, base 4000 feet. This was reported to the crew. At 19:10 hours, VH-CLS reported to the Cairns aerodrome/approach controller that it was over the Biboohra VOR at 6000 feet and, following confirmation by VH-CLS that its 'preferred approach' was an ILS approach, it was cleared 'on the Biboohra zero four nine radial, descend to three seven zero zero for an ILS approach runway one five, and report at Buchan Locator'. VH-CLS acknowledged this instruction and advised that the aircraft was leaving 6000 feet. At 19:17:29 hours, VH-CLS reported over the Buchan Locator turning outbound onto a heading of 330 degrees this being the standard ILS procedure; the aerodrome/approach controller cleared the aircraft for an ILS approach and instructed it to report leaving 3700 feet. At 19:20:54 hours, VH-CLS reported 'leaving three seven zero zero' implying that the aircraft had commenced the final approach segment of the ILS approach. The aerodrome/approach controller acknowledged the report and radioed: 'wind from the northwest, maximum downwind component runway one five not above six knots, runway wet, clear to land'. At 19:22:53 hours, the controller notified VH-CLS 'there's a moderately heavy shower at the field now, visibility er is reducing as the shower moves south, visibility to the south at the moment er in excess of four thousand metres, high intensity approach and runway lighting is on, advise when you would like the intensity decreased'. VH-CLS acknowledged. At 19:26:23 hours, VH-CLS reported 'going round' and the aerodrome/approach controller instructed VH-CLS to 'make missed approach on a heading of zero three five and climb to three seven zero zero'. VH-CLS turned away from the airport, descended to a low height above terrain, and completed about 270 degrees of a left hand orbit. It then entered a turn to the right during which it descended and crashed.", "probable_cause": " The cause of the accident was that, following misalignment of the aircraft with the runway and abandonment of the landing approach, the pilot in command did not immediately initiate a climb to a safe altitude. Why such action was not taken has not been determined. "}