{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-bulverde-1-killed", "date": "Aug 23, 2001 at 1641 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Klinck Store N°3 Inc.", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "46-8408053", "yom": 1984, "flight_number": null, "city": "Bulverde", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3100, "captain_hours_type": null, "copilot_hours": 2360, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane's fuel tanks were fueled from a self serve fuel pump with 63 gallons of fuel prior to departure. The pilot initiated the takeoff roll from runway 30 with a 10 knot tailwind. The airplane was reported to have used the entire length of the runway during the takeoff roll. The airplane became airborne, attained a height approximately 100 feet agl, entered a descent, and subsequently, impacted the ground. A post accident fire consumed the airplane. Immediately following the accident, the pilot reported to local authorities that \"he was leaving the airstrip and the plane stalled due to lack of airspeed.\" The 3,000-foot runway rises rapidly at its north end, such that the departure end of runway 30 was 50 feet higher than the approach end. At the time of the accident, the wind was from 130 degrees at 10 knots and the density altitude was 4,136 feet. Examination of the engine did not reveal any anomalies that would have precluded its operation prior to the accident.", "probable_cause": "The pilot's failure to obtain airspeed after rotation, which resulted in a stall/mush. Contributing factors were the tailwind condition, high density altitude, and upsloping runway."}