{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154b-2-new-delhi", "date": "Jan 9, 1993 at 0408 LT", "type": "Tupolev TU-154", "operator": "Indian%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hyderabad - New Delhi", "msn": "82A533", "yom": 1982, "flight_number": "IC840", "city": "New Delhi-Indira Gandhi", "zone": "National Capital Territory of Delhi", "country": "India", "region": "Asia", "crew_on_board": 13, "crew_fatalities": 0, "pax_on_board": 152, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10245, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 9th January, 1993 TU-154 aircraft No. 85533 wet leased by Indian Airlines from Uzbekistan Airways was operating flight IC-840 from Hyderabad to Delhi. The aircraft was being flown by Uzbeki operating crew and there were 165 persons on board including the crew. The aircraft touched down slightly outside the right edge of the runway, collided with some fixed installations on the ground, got airborne once again and finally touched down on kutcha ground on the right side of the runway. At this stage the right wing and the tail of the aircraft broke away and it came to rest in an inverted position. During the process, the aircraft caught fire and was destroyed. Most occupants of the aircraft escaped unhurt. Six persons suffered either limb fracture or other serious injuries while 45 persons suffered injuries of a minor nature. ", "probable_cause": "The probable cause of accident has been attributed to :\r\n- The failure of the Pilot-in-Command to divert to Ahmedabad when he was informed that the RVR on runway 28 was below the minima applicable to his flight.\r\n- The switching on of landing lights, on the instruction of the second Captain, at a height of only about ten metres, resulting in the loss of all visual references due to the blinding effect of\r\nlight reflections from fog.\r\n- The failure of captain to carry out a missed approach when visual reference to the runway was lost."}