{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-35-dl-mt-la-gotera-24-killed", "date": "Apr 3, 1961 at 2115 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "LAN-Chile-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Castro – Puerto Montt – Osorno – Temuco – Santiago du Chili", "msn": "9716", "yom": 1943, "flight_number": "LA210", "city": "Mt La Gotera", "zone": "Región del Maule", "country": "Chile", "region": "South America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 20, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": 6012, "captain_hours_type": null, "copilot_hours": 489, "copilot_hours_type": null, "aircraft_hours": 18299, "circumstances": "A Douglas DC-3C passenger plane, operated by LAN Chile, was destroyed when it impacted a mountainside near Linares, Chile. LAN flight 621 was a domestic passenger flight from Castro to Santiago with en route stops at Puerto Montt, Osorno and Temuco. On board the flight were eight players and the trainer of the Green Cross football team. The DC-3 took off from Temuco at 18:30 hours local time for the last leg of the flight, following Airway 45 and 40 at an altitude of 8,500 feet. Estimated flying time was 2 hours and 30 minutes. While en route the flight was instructed to climb to 9,500 feet because of other traffic at 8500 feet. At 19:10 the crew requested a descent to 9,000 feet because of ice formation on the wings. The controller didn't authorize the descent because of conflicting traffic (LAN flight 205) on Airway 4. The controller later cleared the flight to turn back on Airway 45 and then descend to 6,500 feet on the same Airway, pass over Curico and to continue on Airway 40 to the Santo Domingo beacon. There was no more radio contact with the flight. After seven days of search operations, the wreckage was found on April 10. The airplane had impacted Cerro La Gotera, a mountain located in a sector of Sierra de las Ánimas, and east-northeast of a hill named Lástimas del Pejerrey. The aircraft was flying in a south-westerly direction, impacting 50 m below the summit of the mountain, at an elevation of about 3,500 m (11,480 feet). The wreckage slid down about 14 meters before coming to rest.", "probable_cause": "The aircraft crashed on La Gotera Hill in the Lastima-Pejerrey Range. From the wreckage's position it was determined that the flight was on a south-west heading, although owing to the aircraft's being entirely destroyed and burnt out it was not possible to state its speed or altitude, or whether the left engine had failed. At impact it appeared that the right engine was functioning normally. It was not possible to determine the cause of the accident from the navigation instruments or the wreckage."}