{"url": "https://www.baaa-acro.com/crash/crash-antonov-12b-luxor-5-killed", "date": "Feb 20, 2009 at 0418 LT", "type": "Antonov AN-12", "operator": "Aerolift2", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Kisangani – Entebbe – Luxor – Mykolaiv", "msn": "6 3 443 10", "yom": 1966, "flight_number": "LFT1015", "city": "Luxor", "zone": "Luxor", "country": "Egypt", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 20000, "captain_hours_type": null, "copilot_hours": 6397, "copilot_hours_type": null, "aircraft_hours": 11692, "circumstances": "The four engine aircraft was transferred from Kisangani to Mykolaiv, Ukraine, for maintenance purposes. Two enroute stops were scheduled in Entebbe and Luxor. Ar 0417LT, the crew was cleared for takeoff. The aircraft started rolling on runway 02 for takeoff but it kept rolling on it till it reached its end. The aircraft continued rolling in the sand drifting from the runway centerline to the right, crossing a service road and eventually crashing into a military zone located 500 metres from the runway end. The aircraft crashed into one of the buildings inside the military unit causing complete destruction of the building. The right wing also crashed into another building putting the aircraft on fire and forcing the aircraft to turn right. The aircraft kept moving forward the military unit fence (next to Tiba-Luxor road) and stopped there, crashing in its way into oil barrel. The accident resulted in the total destruction and fire of the aircraft and the fatality of its crew but no further injuries. ", "probable_cause": "The following factors were identified:\r\n- Lack of available thrust which corresponded to the power of only two engines running during take off run,\r\n- Lack of authorized maintenance of the aircraft,\r\n- The uncoordinated crew actions in the critical situation (both pilots had previously flown as captains). The lack of coordination is confirmed by the braking trails left by the main landing gear at the end of RWY -02, based on FCOM instructions, and in case of rejected takeoff attempt, the crew had to set the throttles to idle, lower the nose gear to reach the runway and then use the propellers for braking (releasing them from the stops). Also, to reduce the roll and to maintain the direction they were to use the nose wheel steering and wheel brakes as well as emergency braking if needed. Actually the crew did neither of the above procedures, except using the main wheel brakes."}