{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-100-vancouver", "date": "Nov 1, 2000 at 1510 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "West%20Coast%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Vancouver - Victoria", "msn": "086", "yom": 1967, "flight_number": "8O151", "city": "Coal Harbour (Vancouver)", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 15, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4000, "captain_hours_type": 2500, "copilot_hours": 2000, "copilot_hours_type": 1650, "aircraft_hours": null, "circumstances": "A de Havilland DHC-6-100 float-equipped Twin Otter (serial number 086), operated by West Coast Air Ltd., was on a regularly scheduled flight as Coast 608 from Vancouver Harbour water aerodrome, British Columbia, to Victoria Harbour water aerodrome. The flight departed at about 1510 Pacific standard time with two crew members and 15 passengers on board. Shortly after lift-off, there was a loud bang and a noise similar to gravel hitting the aircraft. Simultaneously, a flame emanated from the forward section of the No. 2 (right-hand) engine, and this engine completely lost propulsion. The aircraft altitude was estimated to be between 50 and 100 feet at the time. The aircraft struck the water about 25 seconds later in a nose-down, right wing-low attitude. The right-hand float and wing both detached from the fuselage at impact. The aircraft remained upright and partially submerged while the occupants evacuated the cabin through the main entrance door and the two pilot doors. They then congregated on top of the left wing and fuselage. Within minutes, several vessels, including a public transit SeaBus, arrived at the scene. The SeaBus deployed an inflatable raft for the occupants, and they were taken ashore by several vessels and transported to hospital for observation. There were no serious injuries. The aircraft subsequently sank. All of the wreckage was recovered within five days.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. A planetary gear disintegrated in the propeller reduction gearbox of the No. 2 engine and caused the engine drive shaft to disconnect from the propeller, resulting in a loss of propulsion from this engine.\r\n2. The planetary gear oil strainer screen wires fractured by fatigue as a consequence of the installation at the last overhaul. This created an unsafe condition and it is most probable that the release of wire fragments and debris from this strainer screen subsequently initiated or contributed to distress of the planetary gear bearing sleeve and resulted in the disintegration of the planetary gear.\r\n3. Although airspeed was above Vmc at the time of the power loss, the aircraft became progressively uncontrollable due to power on the remaining engine not being reduced to relieve the asymmetric thrust condition until impact was imminent. \r\nFindings as to Risk:\r\n1. The propeller reduction gearboxes were inspected in accordance with the West Coast Air maintenance control manual. These inspections exceeded requirements of the de Havilland Equalized Maintenance Maximum Availability program. Since the last inspection, 46 hours of flight time before the accident, did not reveal any anomaly, a risk remains of adverse developments with\r\nresulting consequences occurring during the unmonitored period between inspections.\r\n2. Regulations require the installation of engine oil chip detectors, but not the associated annunciator system on the DHC-6. Without an annunciator system, monitoring of engine oil contamination is limited to the frequency and thoroughness of maintenance inspections. An annunciator system would have provided a method of continuous monitoring and may have warned the crew of the impending problem.\r\n3. Although regulations do not require the aircraft to be equipped with an auto-feather system, its presence may have assisted the flight crew in handling the sudden loss of power by reducing the drag created by a windmilling propeller.\r\n4. Since most air taxi and commuter operators use their own aircraft rather than a simulator for pilot proficiency training, higher-risk emergency scenarios can only be practiced at altitude and discussed in the classroom. As a result, pilots do not gain the benefit of a realistic experience during training. \r\nOther Findings:\r\n1. The fact that the aircraft remained upright and floating in daylight conditions contributed to the successful evacuation of the cabin without injury and enabled about half of the passengers to locate and don their life vests.\r\n2. The aircraft was at low altitude and low airspeed at the time of power loss. The selection of full flaps may have contributed to a single-engine, high-drag situation, making a successful landing difficult."}