{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-sioux-lookout", "date": "Dec 7, 1997 at 1505 LT", "type": "Beechcraft 100 King Air", "operator": "Voyageur%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Winnipeg – Sioux Lookout", "msn": "B-124", "yom": 1972, "flight_number": null, "city": "Sioux Lookout", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A Voyageur Airways Beechcraft A100 aircraft, C-GILM, was on a flight from Winnipeg International Airport Winnipeg International Airport, MB (YWG) to Sioux Lookout Airport, ON (YXL). The crew of two pilots and two paramedics had completed a medevac flight and were returning to Sioux Lookout without a patient on board. The weather was reported to be: wind 060 degrees at two knots, visibility three statute miles in freezing drizzle, and ceiling overcast at 400 feet AGL. The First Officer was at the controls as they attempted two full NDB approaches for runway 34, each of which resulted in a missed approach. The captain then took control of the aircraft and conducted a full NDB approach for runway 34. On final approach, the crew had the runway in sight and the aircraft was lined up, but the aircraft was high on the approach. The captain called for full flap and pushed the props up to help slow the aircraft down. The aircraft developed a high rate of descent that was not fully countered before the aircraft contacted the runway firmly with the left main landing gear. The aircraft was taxied part way to the company ramp before the aircraft began pulling to the left very noticeably. The scissors had failed and the main wheels were turned slightly off-line. While conducting a heavy-landing inspection, company maintenance and operational personnel determined that in addition to the damage to the scissors for the left main landing gear, the rear spar of the left wing had failed in the vicinity of a pass-through hole for the flap actuator. The damage is reported to be overload in nature and consistent with the effects of landing hard on the left main wheel. During the approaches, the aircraft was above cloud during the penetration turns and was only in cloud during the final approach phases. A small amount of ice accumulated on the aircraft while in cloud (about 1/8th to 1/4 inch on the spinner remained after landing) but the de-ice equipment was working and was used.", "probable_cause": null}