{"url": "https://www.baaa-acro.com/crash/crash-martin-202-near-winona-37-killed", "date": "Aug 29, 1948 at 1705 LT", "type": "Martin 202", "operator": "Northwest%20Airlines2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Chicago – Minneapolis", "msn": "9165", "yom": 1947, "flight_number": "NW421", "city": "Winona", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 33, "pax_fatalities": 33, "other_fatalities": 0, "total_fatalities": 37, "captain_hours": 5502, "captain_hours_type": 311, "copilot_hours": 2380, "copilot_hours_type": 155, "aircraft_hours": 1321, "circumstances": "Northwest Airlines' Flight 421 departed from Chicago for Minneapolis at 1550, August 29, 1948. On board were 33 passengers, four crew members, 800 gallons of fuel, and 1,038 pounds of baggage. Total aircraft weight was 38,015 pounds which was within the certificated limit and it was properly loaded in reference to the center of gravity. Weather information available to the flight prior to departure indicated that relatively good flying conditions existed en route with the exception of scattered rain showers and thunderstorms which were in the vicinity of La Crosse, Wisconsin and Rochester, Minnesota. Routine position reports were received from the flight as it progressed on course at Its flight plan altitude of 8,000 feet. At 1655, one hour and five minutes after takeoff from Chicago, the flight reported over La Crosse, 125 miles southeast of Minneapolis, and was at that time cleared to start an en route descent. Four minutes later, at 1659, the flight reported passing through the 7,000-foot altitude level. No indication of any trouble was contained in this transmission. This was the last word beard from the flight. Between 1645 and 1700 several persons in the vicinity of Winona, Minnesota, approximately 95 miles southeast of Minneapolis were watching a thunderstorm which was approaching from the northwest, AS the storm moved over Winona, the wind increased in intensity and considerable lightning and thunder were observed. At this time, about 1705, Flight 421 was seen flying below the overcast. As it passed over Winona, the aircraft appeared to enter the roll cloud or the leading edge of the thunderstorm at which time it was lost from view. Seconds later parts of the airplane were observed falling. It was later found that the flight had crashed approximately 4 miles northwest of Winona on a bluff on the east side of the Mississippi River. All 37 occupants were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the loss of the outer panel of the left wing which separated from the aircraft as a result of a fatigue crack in the left front outer panel attachment fitting which had been induced by a faulty design of that fitting, the fatigue crack having been aggravated by severe turbulence encountered in the thunderstorm."}