{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200c-super-king-air-east-bay-cay-1-killed", "date": "Feb 6, 2007 at 1842 LT", "type": "Beechcraft 200 Super King Air", "operator": "Air%20Turks%20and%20Caicos", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "East Bay Cay - Grand Turk", "msn": "BL-131", "yom": 1988, "flight_number": null, "city": "East Bay Cay", "zone": "All Turks and Caicos Islands", "country": "Turks and Caicos Islands", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 8500, "captain_hours_type": 394, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 24578, "circumstances": "The aircraft was parked on the small apron at North Caicos Airport while the pilot went home to collect some personal items. One of the intended passengers saw the aircraft arrive. He remained in the vicinity until the pilot returned, and reported that the aircraft was unattended in the intervening time. When the pilot returned, four of the five passengers were gathered near the aircraft, and the last passenger arrived soon afterwards. The pilot, a local man well-known to the passengers, appeared to be his normal self and in good spirits. As most inter-island travel in the TCI is by air, the passengers were also familiar with the operator’s aircraft and used to travelling by air. Some had flown frequently on VQ-TIU. The pilot supervised embarkation and gave an emergency briefing. One passenger reported that the pilot made a mobile telephone call, which he presumed to be to Air Traffic Control (ATC) at Providenciales to notify them of the proposed flight. Prior to seating himself at the controls, the pilot told the passengers that they may expect some turbulence. The aircraft taxied onto the runway at its eastern end and along its length for a departure from Runway 08. It was about one hour after sunset and outside the airport’s normal operating hours, so there were no ATC personnel on duty. The runway lights were operated by the operator’s station manager. The aircraft took off at 1840 hrs. Soon after takeoff the aircraft was seen to start a turn to the right, which was consistent with its routing to Grand Turk, some 54 nm to the south-east. However, the aircraft reached a relatively large angle of bank and started to descend. The descent continued until it crashed with significant forward speed into an area of very shallow water. The aircraft broke up on impact, with the fuselage section coming to rest nearly inverted but comparatively intact. All those on board survived the impact sequence with varying degrees of injury. However, the pilot died before he could receive specialist medical treatment. \n", "probable_cause": "The investigation identified the following causal factors:\r\n1. The aircraft adopted an excessive degree of right bank soon after takeoff. This led to a descending, turning flight path which persisted until the aircraft was too low to make a safe recovery.\r\n2. The pilot probably became spatially disoriented and was unable to recognise or correct the situation in time to prevent the accident.\r\nThe investigation identified the following contributory factors:\r\n1. The environmental conditions were conducive to a spatial disorientation event.\r\n2. The pilot had probably consumed alcohol prior to the flight, which made him more prone to becoming disorientated.\r\n3. The flight was operated single-pilot when two pilots were required under applicable regulations. The presence of a second pilot would have provided a significant measure of protection against the effects of the flying pilot becoming disoriented. "}