{"url": "https://www.baaa-acro.com/crash/crash-douglas-r4d-8-fort-lauderdale", "date": "Jun 13, 2005 at 1550 LT", "type": "Douglas DC-3", "operator": "Air%20Pony%20Express", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "City", "schedule": "Fort Lauderdale – Marsh Harbour", "msn": "43344", "yom": 1943, "flight_number": null, "city": "Fort Lauderdale-Executive", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 18000, "captain_hours_type": null, "copilot_hours": 8500, "copilot_hours_type": null, "aircraft_hours": 19623, "circumstances": "The crew stated the airplane was hire by a private individual and had 220 gallons of fuel onboard, and was carrying 6 pieces of granite, weighing 3,200 lbs. The passenger was responsible for the granite during the flight. During takeoff, about 400 feet above the ground, a discrepancy with the left engine manifold pressure was noted, followed by a slight hesitation and mild backfire. Oil was seen leaking from the front nose section of the engine followed by an engine manifold pressure and rpm decrease. Smoke coming from the left engine was observed and reported by the airport controllers. The left engine's propeller failed to feather and the airplane wouldn't maintain altitude. The airplane impacted trees, vehicles, and the right wing struck a home before coming to a stop on the road. A fire ensued immediately after ground impact, all onboard exited without assistance. The fuselage from the cockpit to the tail section melted from the fire. The right wing was damaged by impact and fire, and the right engine remained intact on the wing. The left wing was separated 12 feet from the outboard and the engine separated from the firewall. Both engine's propellers were in the low pitch position. The flaps were full up and the landing gear were retracted. A weight and balance sheet was never furnished. The pieces of granite and limited cargo recovered from the wreckage weighed 3,140 lb. Examination of the airplane revealed all flight controls surface were present and flight control continuity was accounted for and established. No evidence of any pre-impact mechanical discrepancies with the airframe or its systems was found that wound have prevented normal operation of airplane. On December 09, 2004, the left engine's nose section assembly was found with six out of the ten retaining bolts broken. The section was inspected and all ten bolts were replaced with serviceable ones. The assembly of the dose dome section and installation to the engine was performed by the repair station mechanic. The remaining assembling of the engine was completed by the operator's mechanic/pilot. During the left engine post accident examination, the ten bolts securing the nose dome section flange to the stationary reduction gear were fractured with their respective safety wire still intact. The chamber for the propeller feathering oil system was not secured to the plate sections, producing a bypass of the oil for the propeller feathering process. Metal flakes and pieces were observed deposited in the oil breather screen, consistent with the master rod bearing in an advance stage of deterioration. The silver plated master rod bearing had a catastrophic failure. Silver like metal flakes and particles were observed throughout the nose section, reduction gear  section, main oil screen, and oil filter housing of the engine. An indication of propeller shaft housing movement was evident. Metal flakes with carbon build up were observed in the propeller shaft support and sleeve assembly. A metallurgical examination of the ten bolts securing the nose dome assembly indicated all were fractured though the threaded section of the shanks. The fatigue zones propagated from the opposite sides toward the center of the bolts consistent with reversed bending of the bolt.", "probable_cause": "The inadequate maintenance inspection by company maintenance personnel/pilot and other maintenance personnel of the left engine resulting in a total failure of the master rod bearing, and nose case partial separation, which prevented the left propeller from feathering. This resulted in the airplane not able to maintain altitude and a subsequent forced landing in a residential area."}