{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-bishop-1-killed", "date": "Aug 8, 2003 at 2132 LT", "type": "Cessna 340", "operator": "WSP Leasing", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bishop - Upland", "msn": "340A-0968", "yom": 1980, "flight_number": null, "city": "Bishop", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1302, "captain_hours_type": 1, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1123, "circumstances": "During a nighttime takeoff initial climb, the airplane collided with terrain near the airport. Witnesses reported watching the airplane accelerate on runway 12, rotate, and climb to 200 to 300 feet above ground level. The climb rate decreased and the airplane appeared to initiate a left turn, with the roll continuing to a wings vertical attitude. At this point the airplane descended into the terrain. One witness north of the accident site described the landing lights going from horizontal to vertical followed by a decrease in engine sound just before impact. According to the airplane owner, the pilot had never flown the accident airplane before the first leg to the accident location to drop off the owner and another passenger. Examination of the pilot records failed to locate any previous flight time in Cessna 300 or 400 series airplanes. In the last 30 days he had given instruction in a smaller light twin engine airplane. Post accident examination of the wreckage revealed the landing gear to be in the down position at the time of impact. The retractable landing lights were extended and the nose gear taxi light was destroyed. Both propellers exhibited symmetrical power signatures. No preimpact mechanical malfunctions or failures were identified. The impact site was east of the airport about 0.68 nautical miles. The departure direction is towards a mountain range with sparse population and few ground reference lights. The moon's disk was 25 degrees above the southeastern horizon and was 89 percent illuminated. The FAA AC61-23C Pilot's Handbook of Aeronautical Knowledge addresses the environmental factors and potential in-flight visual illusions, which could affect pilot performance. The reference material describes Somatogravic Illusion as, \"a rapid acceleration during takeoff can create the illusion of being in a nose up attitude. The disoriented pilot will push the airplane into a nose low, or dive attitude. A rapid deceleration by a quick reduction of the throttles can have the opposite effect, with the disoriented pilot pulling the airplane into a nose up, or stall attitude.\"", "probable_cause": "The pilot's in-flight loss of control due to a Somatogravic illusion and/or spatial disorientation. Factors in the accident were the dark lighting conditions and the pilot's lack of familiarity with the airplane."}