{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b100-king-air-abbotsford", "date": "Feb 23, 2018 at 1204 LT", "type": "Beechcraft 100 King Air", "operator": "Island%20Express%20Air_0", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Abbotsford - San Bernardino", "msn": "BE-8", "yom": 1976, "flight_number": "IAX640", "city": "Abbotsford", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10000, "captain_hours_type": 800, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10580, "circumstances": "Weather conditions at Abbotsford at the time of departure consisted of a temperature of -2°C in moderate to heavy snowfall with winds of approximately 10 knots. Prior to the departure, the fuel tanks were filled to capacity and the pilot and passengers boarded the aircraft inside the operator's heated hangar. The aircraft was towed outside of the hangar without being treated with anti-ice fluid, and taxied for the departure on runway 07. Due to an inbound arrival at Abbotsford, C-GIAE was delayed for departure. Once cleared for takeoff, the aircraft had been exposed to snow and freezing conditions for approximately 14 minutes. After becoming airborne, the aircraft experienced power and control issues shortly after the landing gear was retracted. The aircraft collided with terrain within the airport perimeter. Four passengers and the pilot sustained serious injuries as a result of the accident which destroyed the aircraft.", "probable_cause": "The accident was the consequence of the combination of the following findings: \r\n- The occurrence aircraft exited a warm hangar and was exposed to 14 minutes of heavy snow in below-freezing conditions. This resulted in a condition highly conducive to severe ground icing,\r\n- As the aircraft climbed out of ground effect on takeoff, it experienced an aerodynamic stall as a result of wing contamination,\r\n- The pilot’s decision making was affected by continuation bias, which resulted in the pilot attempting a takeoff with an aircraft contaminated with ice and snow adhering to its critical surfaces,\r\n- The pilot and the passenger seated in the right-hand crew seat were not wearing the available shoulder harnesses. As a result, they sustained serious head injuries during the impact sequence,\r\n- During the impact sequence, the cargo restraint system used to secure the baggage in the rear baggage compartment failed, causing some of the baggage to injure passengers seated in the rear of the aircraft cabin,\r\n- The aircraft was not airworthy at the time of the occurrence as a result of an incomplete airworthiness directive."}