{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-sitka-5-killed", "date": "Sep 20, 2004 at 1115 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Harris%20Aircraft%20Services", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Sitka - Warm Spring Bay", "msn": "948", "yom": 1956, "flight_number": null, "city": "Sitka", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 2878, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16155, "circumstances": "The commercial certificated pilot, with four passengers, departed for a remote lodge on an on-demand air taxi flight in an amphibious float-equipped airplane. The airplane was the second of two company airplanes to depart for the lodge. The route of flight would have transited around the north end, from the west side to the east side of a large island. The first company airplane completed the flight, but the accident airplane did not arrive at the lodge, and was reported overdue. Throughout the morning, before the accident flight, the pilot received two telephonic weather briefings from the local FAA flight service station, which included an AIRMET for mountain obscuration, and two pilot reports from the first pilot. In addition, the pilot visited the FSS for another weather briefing. The weather conditions along the route of flight had reported visibilities as low as 2 miles, and ceilings as low as 200 feet due to rain and mist, and wind of 35 to 40 knots. The area of the accident flight is characterized by steep mountainous island terrain, numerous ocean channels, and an extensive shoreline, containing small coves and bays. The area frequently has low ceilings and reduced visibility due to rain, fog, and mist. The island is one of several barrier islands between the north Pacific Ocean and mainland Alaska. The western coastal portion of the island is exposed to open ocean. The eastern coastal portion of the island is adjacent to a wide strait, which separates the island from several inner islands. The area of operations for the accident airplane has no low-level radar coverage, intermittent radio communications, and limited weather reporting capability. The company's operations manual states that aircraft may not be released for a flight at any location unless there is agreement about the parameters of the flight with the pilot-in-command, and any of the following: Director of operations; chief pilot; or trained individuals granted the authority by the director of operations. The airplane has been declared missing, and is presumed to have crashed; the occupants are presumed to have received fatal injuries. ", "probable_cause": "Reason for occurrence is undetermined. The airplane is missing."}