{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-560a-belleview-2-killed", "date": "Jan 30, 1999 at 1740 LT", "type": "Rockwell Aero Commander 560", "operator": "Bryant Monturiol", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Belleview - Belleview", "msn": "560-0290", "yom": 1956, "flight_number": null, "city": "Belleview", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1590, "captain_hours_type": 298, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5515, "circumstances": "After takeoff, the flight climbed to 1500 feet and the pilot reduced the engine RPM to 3000. The pilot also reported that within seconds of reducing the engine RPM the left engine sputtered. The pilot turned on the fuel boost pump in an effort to restore full engine power. Immediately afterward, the right engine sputtered and lost power. The pilot turned on the right engine boost pump again in an effort to restore full power. Attempts by the pilot to restore normal engine operation failed. The pilot selected an area for an emergency landing. The pilot recalled that as he prepared for an emergency landing, the airplane would yaw right and left as the engines momentarily gain and lose power. The airplane collided with tops of several trees. The airplanes subsequently collided with a single family home adjacent to the lake. Examination of the airframe and engine assemblies failed to disclose a mechanical malfunction or a component failure. During the examination of the fuel system, approximately 2 1/2 pints of fuel were recovered. The pilot reported that he thought he had about 50 gallons of fuel when he departed. ", "probable_cause": "The pilot's inadequate preflight planning of the fuel required for the flight that resulted in fuel exhaustion and the subsequent total loss of engine power to both engines. "}