{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-lake-stevens", "date": "Aug 2, 2000", "type": "De Havilland DHC-3 Otter", "operator": "Jackson%20Air%20Services", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": null, "msn": "383", "yom": 1960, "flight_number": null, "city": "Lake Stevens", "zone": "Manitoba", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A DHC-3 and a Cessna 185 (both float equipped aircraft) had been chartered to move equipment from an outpost camp which was being threatened by forest fires in the Tadoule Lake (Lac Brochet, MB) area. Takeoff was conducted in a westerly direction into light winds estimated to be 5 to 8 knots. Besides the pilot there were two passengers (the camp owner and his son), two 45 gallon drums of #2 gas, a propane cylinder, battery chargers plus other sundry items. It was reported that once the aircraft was airborne, a windshift occurred which may have resulted in rollover and a downdraft situation. The aircraft began to descend, despite the application of full engine power, and settled into the trees with little forward speed and the wings in a near level attitude. The aircraft was then consumed by fire, the pilot and his two passengers were able to escape with minor scrapes and bruises. The pilot of the Cessna 185 witnessed the accident while airborne and he then returned and landed and rendered assistance to the three occupants. The local temperature was 27 degrees C, and the aircraft was near its maximum gross weight. It was reported that the aircraft had a headwind in proximity to the forest fire on takeoff, and that it flew into the area of a tailwind during initial climb.", "probable_cause": null}