{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46e-1-cs-cheyenne-3-killed", "date": "Oct 9, 1949 at 1754 LT", "type": "Curtiss C-46 Commando", "operator": "Slick-Airways2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Las Vegas – Denver", "msn": "2939", "yom": 1945, "flight_number": "SL118", "city": "Cheyenne", "zone": "Wyoming", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 5514, "captain_hours_type": 2654, "copilot_hours": 4583, "copilot_hours_type": 2515, "aircraft_hours": 8585, "circumstances": "At Las Vegas, Trip 11-8 remained on the ground 35 minutes. During this time, the crew obtained weather forecasts for the trip to Denver and had the aircraft serviced with 370 gallons of fuel. These forecasts indicated that between south-western Utah and Denver there would be broken to overcast clouds with bases and tops ranging from 8,000 to 20,000 feet in altitude, and that below 8,000 feet there would be light rain showers with light snow showers above this level. The flight was cleared under Instrument Flight Rules to cruise at 13,000 feet to Grand Junction, Colorado, 14,000 feet to Eagle, Colorado, and 16,000 feet to the Dupont Intersection, 5 miles north of Denver, with Laramie, Wyoming, designated as the alternate airport The computed elapsed time was three hours and five minutes with sufficient fuel aboard to fly five hours and five minutes. A forecast for Denver, at 1700, when the flight was estimated to arrive, indicated a ceiling of 700 feet with icing in the clouds above 8,000 feet. At Laramie, the chosen alternate airport, a ceiling of 2,000 feet occasionally lowering to 1,000 feet was forecast with light rain showers expected to change to light snow showers after dark. At 1403, the flight departed Las Vegas, and two hours and two minutes later, at 1605, reported over Grand Junction at an altitude of 13,000 feet, climbing to 14,000. At this time the flight received from INSAC (Interstate Airways Communication) at Grand Junction the 1530 weather observations for Grand Junction, Denver, Eagle and Pueblo, Colorado. Denver was reported having a variable ceiling of 600 feet, overcast and lower broken clouds, visibility six miles, light rain and wind from the north-northwest at 12 miles per hour. When over Eagle, at 1637, the flight reported at an altitude of 14,000 feet and climbing to 16,000. Forty-five minutes later, at 1708, over the Dupont Intersection the flight reported to the Denver Tower and was given the Denver weather as ceiling 200 feet and visibility two miles. As the ceiling and visibility were expected to remain that way for several hours and as the company's landing minimums for Denver were ceiling 400 feet and visibility one mile, the crew requested a change of flight plan. Rock Springs, Wyoming, was chosen as the new alternate and permission was requested to land at Laramie, weather permitting. Denver Air Traffic Control approved and cleared the flight to Rock Springs to maintain 14,000 feet. Twenty-five miles south of Laramie, at 1732, Trip 11 called the Cheyenne Tower and asked permission to change course and to proceed direct to Cheyenne. This was approved by Denver ATC and the crew was further advised by the tower that there was a squall line between Laramie and Cheyenne. The Cheyenne weather reported to the flight at that time was ceiling 3,500 feet, overcast, lower broken clouds and visibility 20 miles. At 1740, the flight reported over the Cheyenne range at 14,000 feet and a special Cheyenne weather report was given the crew which showed the ceiling had lowered to 900 feet and that there was light sleet, and a visibility of 12 miles. Proceeding out the east course of the Cheyenne range, the flight notified the tower that it was low on fuel, taking on ice, and having difficulty in maintaining altitude. A few minutes later clearance was given the flight to descend to 8,000 feet on the north course of Cheyenne range. 2 This was acknowledged and seconds later it encountered severe turbulence. At approximately 1750, an unreadable transmission was heard by the tower. There was definite hysteria in the voice making this transmission. The tower then called the flight several times but no answer was received. Two minutes later at 1752, the tower received the following transmission \"We are O. K and are out of it now.\" About one-half minute later a noise believed to be caused by a surge of power of the aircraft's engines was heard northwest of the tower. Shortly after this a flash of light was seen about two miles northwest of the airport.", "probable_cause": "The Board determines that the probable cause of this accident was the loss of control of the aircraft during an instrument approach to Cheyenne, Wyoming, under conditions of heavy icing and severe turbulence.\r\nThe following findings were noted:\r\n- Wings and tail surfaces of the aircraft were not equipped with deicing boots, however, anti-icing equipment had been installed on the propellers,\r\n- Forecasts issued by the U. S. Weather Bureau and available to the crew before departure from Los Vegas, indicated icing conditions would be encountered enroute to Denver,\r\n- At the time the flight departed Las Vegas the weather at Denver was above the company's minimums and was expected to remain above these minimums until the arrival of the flight at Denver,\r\n- Being unable to land at Denver because of adverse weather conditions, the flight proceeded first to Laramie and then to Cheyenne where the weather had been reported as ceiling 3,500 feet, visibility 20 miles,\r\n- The front moved toward Cheyenne more rapidly than was anticipated by either the Weather Bureau or the captain, and it arrived at Cheyenne before a landing could be accomplished,\r\n- During the descent at Cheyenne, the flight encountered severe turbulence and heavy icing."}