{"url": "https://www.baaa-acro.com/crash/crash-cessna-t207a-turbo-stationair-8-near-uchuquinua-3-killed", "date": "Oct 9, 2016 at 0900 LT", "type": "Cessna 207 Skywagon/Stationair", "operator": "Air-Majoro.png", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Trujillo - Pucallpa", "msn": "207-0767", "yom": 1984, "flight_number": null, "city": "Uchuquinua", "zone": "Cajamarca", "country": "Peru", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The single engine aircraft was completing a charter flight from Trujillo to Pucallpa, carrying two pilots and pilot. While cruising over the Cajamarca Province, the pilot encountered poor weather conditions with heavy rain falls. He modified his route and was able to continue under VFR mode in good weather conditions. Nevertheless, he continued at an insufficient altitude when the aircraft impacted ground and crashed in a mountainous area. The aircraft was destroyed by impact forces and all three occupants were killed. There was no fire.", "probable_cause": "The accident was the consequence of a loss of situational awareness of the pilots, by not making a continuous surveillance during the VFR flight in good weather conditions, not determining timely the corrections of direction or altitude, which finally led them to fail to fly over the ground of the new route adopted in flight, generating a probable aerodynamic loss at the limit of the performance of the aircraft, occurring a CFIT accident.\r\nContributing factors:\r\n- Limited or poor use of the available GPS Terrain Proximity Warning system.\r\n- Poor or erroneous appreciation of the weather conditions at the beginning of the flight, which led them to vary the route to fly over terrain with higher elevation.\r\n- Limited appreciation of terrain height on the new route in relation to the selected cruising altitude."}