{"url": "https://www.baaa-acro.com/crash/crash-vickers-768d-viscount-near-agra-18-killed", "date": "Sep 11, 1963 at 0400 LT", "type": "Vickers Viscount", "operator": "Indian%20Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Madras – Nagpur – New Delhi", "msn": "192", "yom": 1957, "flight_number": null, "city": "Agra-Kheria (Pt. Deen Dayal Upadhyay)", "zone": "Uttar Pradesh", "country": "India", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 13, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 18, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 10 September 1963, Viscount aircraft VT-DIO was on a scheduled domestic flight, operating the Night Air Mail Service on the route Madras - Nagpur - New Delhi. It took off from Madras at 2240 hours Indian standard time and the flight to Nagpur was uneventful. The aircraft took off from Nagpur with another crew at 0237 hours on 11 September. Communications difficulties were encountered commencing at 0258 hours; the last message known to be sent by the aircraft was at 0336 hours; at that time VT-DIO was flying normally at an altitude of 16 500 ft, the sky was clear and the estimated time of arrival to the Delhi Control boundary was given as 0405. There was enough fuel in the aircraft to maintain flight until 0950 hours. At approximately 0400 hours, the aircraft crashed in a field near village Patti, 15 miles from Agra. The impact resulted in immediate explosion and fire, all aboard being killed.", "probable_cause": "The cause of the accident could not be established. Although there is little substantial evidence to support the assumption, it is possible that a sudden malfunctioning of the auto-pilot and/or a sudden failure of the electrical power may have created conditions which made it impossible for the crew to retain control of the aircraft, thus causing it to lose height rapidly and crash to the ground. "}