{"url": "https://www.baaa-acro.com/crash/crash-rockwell-gulfstream-690c-jetprop-840-wray-3-killed", "date": "Jan 15, 2009 at 0700 LT", "type": "Rockwell Gulfstream 690C Jetprop 840", "operator": "JW%20Operating%20Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Denver - Wray", "msn": "690-11734", "yom": 1978, "flight_number": null, "city": "Wray", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 10221, "captain_hours_type": null, "copilot_hours": 2728, "copilot_hours_type": null, "aircraft_hours": 7215, "circumstances": "The airplane, a Rockwell Grand Commander 690C Jetprop 840, was \"cleared for the approach\" and approximately eight minutes later was observed emerging from the clouds, flying from west to east. Witnesses reported that the nose of the airplane dropped and the airplane subsequently impacted terrain in a near vertical attitude. Impact forces and a post impact fire destroyed the airplane. Examination of the airplane's systems revealed no anomalies. Weather at the time of the accident was depicted as overcast with three to six miles visibility. An icing probability chart depicted the probability for icing during the airplane's descent as 76 percent. AIRMETS for moderate icing and instrument meteorological conditions had been issued for the airplane’s route of flight. Another airplane in the vicinity reported light to moderate mixed icing. It could not be confirmed what information the pilot had obtained in a weather briefing, as a briefing was not obtained through a recorded source. A weight  and balance calculation revealed that the accident airplane was 1,000 pounds over gross weight at the time of departure and 560 pounds over gross weight at the time of the accident. It was estimated that the center of gravity was at or just forward of design limitations.", "probable_cause": "The pilot’s failure to maintain aircraft control during the approach resulting in an aerodynamic stall and subsequent impact with terrain. Contributing to the accident was the pilot’s improper preflight planning and conditions conducive for structural icing."}