{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-30-dupage-2-killed", "date": "Dec 30, 1997 at 1705 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "PVS International", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "DuPage - DuPage", "msn": "530", "yom": 1971, "flight_number": null, "city": "DuPage", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1175, "captain_hours_type": 250, "copilot_hours": 4094, "copilot_hours_type": 10, "aircraft_hours": 6275, "circumstances": "The airplane departed runway 1L and radar data indicated the airplane maintained about a 110 knot ground speed for 37 seconds as it climbed to 1,400 feet msl (642 feet agl) with a 008 degree heading. The last radar 14 seconds later indicated the airplane's heading was 342 degrees and had a 130 knot ground speed. The winds were 290/11. Witnesses reported seeing the airplane flying low and slow, and then it made a turn like a \"barrel roll\" to the left before impacting the ground. Examination of the engines and airframe revealed no pre-existent anomalies. The left and right propellers exhibited leading edge damage and chordwise abrasions. The pilot had a total of about 1,175 flight hours with about 250 hours in the type and model aircraft. The copilot had 4,094 total hours, but had 10 hours of turbine time and no flight time in the type and model of aircraft. The pilot had indicated he was practicing simulated single engine failures. The gear was fully retracted. The trim settings were set for a right engine out situation. The flap selector was set to \"UP\" flaps, but the flaps were found in transit at approximately 2 degrees of flaps. The Airplane Flight Manual indicated that during \"Engine Failure in Takeoff-Gear Fully Retracted\" stated that the required airspeed before selecting flaps to 5 degrees was 140 KCAS. The Pilot's Operating Handbook stated the flaps take approximately 31 seconds to retract from 20 to 0 flaps, or 21 seconds to retract from 5 to 0 flaps. ", "probable_cause": "The pilot in command failed to maintain control of the aircraft. A factor was the lack of experience of the pilot and copilot in the type and model of aircraft. An additional factor was the pilot did not follow the proper procedure when the flaps were raised before 140 knots was attained during a simulated single engine failure. "}