{"url": "https://www.baaa-acro.com/crash/crash-canadair-cl-415-calvi-2-killed", "date": "Aug 1, 2005 at 1005 LT", "type": "Canadair CL-415", "operator": "Securite%20Civile", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Mountains", "schedule": "Ajaccio - Ajaccio", "msn": "2011", "yom": 1995, "flight_number": "Pélican 36", "city": "Calvi", "zone": "Haute-Corse", "country": "France", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After take-off from Ajaccio Airport and a first scooping, the fleet composed of three planes with respective callsigns Pelican 44, Pelican 36 and Pelican 37 intervened on a fire at Piétramaggiore, near Calvi, Corsica, France. A first sector of the fire zone was treated by six passes. During the two following passages, the fleet dropped on another sector of the fire. Pelican 36 began its last scooping in the Gulf of Revellata at heading 250°, three minutes and fourteen seconds before the accident. At the end, it gained height and continued the circuit to arrive on the drop axis. The \"doubling\" action consists of releasing the water load at the precise location of the previous aircraft's release. During the last turn, it reached an altitude of 2,160 feet. Pelican 36 was observed on a trajectory estimated to be consistent by the crew of the following aircraft (Pelican 37) a few seconds before it passed over the drop site. However, video evidence shows that the track of Pelican 36 is further west than that of Pelican 44, which preceded it, and over higher terrain. One and a half seconds before the flight recorder stopped, the aircraft was in a right turn at an altitude of 1,360 feet. The angle of roll to the right and increasing was then 17°. While the elevators were nearly stable, the altitude stored by the flight recorder increased to 1,500 feet in one and a half seconds. After that the tail section of the aircraft separated from the fuselage. The aircraft then impacted the side of a mountain and broke up. \r\nCrew:\r\nLudovic Piasentin, pilot, \r\nJean-Louis de Bénédict, copilot. ", "probable_cause": "Environmental area:\r\nThe load case studied during the investigations did not explain the observed fuselage failure. However, the characteristics of the upward aerological disturbance caused by the fire are likely to have generated airframe stresses of an order of magnitude close to that of the loads capable of causing the fuselage to fail. Given the uncertainties encountered during the evaluation of the parameters of the rising air column that affected the accuracy of the research results concerning the effects of the stresses on the airframe, the aerological phenomenon encountered represents a possible cause of the event.\r\nTechnical Area:\r\nThe research undertaken to find in-flight loads capable, in the context of the event, of breaking the intact fuselage without damaging the empennage was unsuccessful. Detailed observation of the airframe did not reveal any damage prior to the occurrence. However, the results of these investigations do not rule out the existence of such damage, so the hypothesis of prior damage to the airframe cannot be totally rejected."}