{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-chandigarh-2-killed", "date": "Oct 29, 2008 at 1125 LT", "type": "Beechcraft 90 King Air", "operator": "Government%20of%20Punjab", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Chandigarh - Ludhiana", "msn": "LJ-1008", "yom": 1982, "flight_number": null, "city": "Ludhiana", "zone": "Punjab", "country": "India", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3152, "captain_hours_type": 9, "copilot_hours": 664, "copilot_hours_type": 13, "aircraft_hours": 6530, "circumstances": "On 29.10.2008 Punjab Government King Air C90 aircraft, VT-EHY met with an accident while operating flight from Chandigarh to Ludhiana. This accident was notified to DGCA by ATC at Ludhiana and Punjab Government officials shortly after the occurrence. The accident occurred when the aircraft was in the process of making second attempt for landing at Ludhiana Airport. The accident was investigated by Inspector of Accident under Rule 71 of Aircraft Rules, 1937. As per the obligations under ICAO Annex 13, notification was sent to USA, the country of aircraft manufacture, Canada, the country of engine manufacture and ICAO. Transport Safety Board Canada appointed an accredited representative and authorized engine manufacturer M/s P&W to associate with investigation of engines. Low visibility conditions were prevailing at Ludhiana at the time of accident. Due to which the crew located the runway late. They were estimating their position based on GPS. Though they did spot the runway at some stage of the approach, they lost sight of it again and were unable to locate it subsequently. They carried out orbits on the right side (East Side) of R/w 12 in an effort to visually locate the runway and then followed non standard procedure to land. Not comfortable with the approach, the crew decided to go around. Due to low visibility and that they probably did not want to lose the sight of the airfield, carried out non-standard go around. In their anxiety not to lose the sight of the field they descended in three orbits in the vicinity of the airfield on the west side of R/w 12, perhaps to land after making the short circuit from the right. However, due to smoke in the cockpit, severe disorientation, lack of qualification & experience on type of aircraft and on sighting the communication tower, the panic gripped the crew. In their anxiety, the control was lost and aircraft impacted the ground in the steep left bank. Aircraft was destroyed in the crash due to impact and post impact fire. Both the occupant on board died due to fire and collapsing aircraft structure.", "probable_cause": "The accident occurred due to loss of control while in base leg for landing at R/W 12 after executing go around on R/W 12.\r\nContributory Factors:\r\n1) Low visibility reduced the margin of safety, may have caused severe disorientation, influenced their decision and played on crew for use of non standard procedures.\r\n2) Both the crew lacked qualification/experience and familiarity with the type of aircraft and terrain.\r\n3) Smoke in the cockpit further reduced the margin of safety and distracted the attention of the crew.\r\n4) Obstruction in the flight path made the crew to take severe action and led to loss of control.\r\n5) Lack of operational control and supervision by the organisation."}