{"url": "https://www.baaa-acro.com/crash/crash-grumman-c-1a-trader-near-skwentna-1-killed", "date": "Oct 15, 2012 at 1557 LT", "type": "Grumman C-1A Trader", "operator": "Fuel Services", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Wasilla – Nixon Fork Mine", "msn": "44", "yom": 1957, "flight_number": null, "city": "Skwentna", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 25000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane was destroyed when it collided with tree-covered terrain and incurred a postcrash fire and explosion about 19 miles west of Willow, Alaska. The airline transport rated\r\npilot, who was the only occupant, was fatally injured. The airplane was registered to Fuel Services, LLC, Anchorage, Alaska, and was being operated as a 14 CFR Part 91 visual flight rules (VFR) cross-country fuel transport flight when the accident occurred. Marginal visual meteorological conditions were reported at the airplane's point of departure. The accident flight originated from the Wasilla Airport, Wasilla, Alaska, about 1520, en route to the Nixon Fork Mine, about 28 miles northeast of McGrath, Alaska. According to the co-owner of the airplane, the purpose of the flight was to transport approximately 900 gallons of diesel fuel to a company owned tank that supplies fuel for a mining operation. When the airplane did not arrive at its destination, the co-owner of the airplane reported it overdue to the Federal Aviation Administration (FAA) at 1757. After being notified of the overdue airplane, personnel from the 11th Air Force's Rescue Coordination Center initiated a  search for the missing airplane along its supposed route of flight. On the morning of October 16, an Air National Guard C-130 Hercules was able to locate the wreckage. Rescue personnel aboard a HH-60G helicopter were able to reach the site later that morning, and confirmed the pilot was deceased. Two witnesses reported seeing the airplane fly over their locations. The first witness saw the airplane as it was flying northwest at an altitude that he estimated at 3,000 to 4,000 feet under an overcast layer. He stated that the airplane did not sound \"normal,\" but he did not notice anything unusual, like smoke, trailing the airplane. The second witness stated that he saw the airplane fly over his cabin headed southeast at an estimated altitude of 300 to 400 feet. He stated that the airplane sounded like it was \"struggling,\" but he could not see anything abnormal about the airplanes appearance. Primary radar data taken from the Anchorage Terminal Radar Approach Control Facility (TRACON), shows an unidentified aircraft, believed to be the accident airplane, depart the Wasilla airport about 1522. After departure, the track proceeded to the Northwest with cruising ground speeds of between 180 and 193 knots. No altitude or transponder code data was transmitted by the airplane. Around 1343 the radar track changed direction and proceeded to the southeast. Ground speeds after the track changed direction started at 143 knots, and gradually decreased to a low of 117 knots about 5 minutes before the accident. The last radar plot for the airplane was at 1556:47, approximately 5.5 nautical miles from the accident site, and showed a heading of 088 degrees, and a ground speed of 175 knots.", "probable_cause": "The pilot’s loss of control of the airplane for reasons that could not be determined because the wreckage was not recovered from the accident site."}