{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-ii-lafayette-5-killed", "date": "Dec 28, 2019 at 0921 LT", "type": "Piper PA-31 Cheyenne", "operator": "Cheyenne Partners", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "City", "schedule": "Lafayette - Atlanta", "msn": "31T-8020067", "yom": 1980, "flight_number": null, "city": "Lafayette-Paul Fournet", "zone": "Louisiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 1531, "captain_hours_type": 730, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5954, "circumstances": "The personal flight departed from Lafayette Regional Airport/Paul Fournet Field (LFT), Lafayette, Louisiana, and entered the clouds when the airplane was at an altitude of about 200 ft above ground level. Before takeoff, the controller issued an instrument flight rules clearance to the pilot, instructing him to turn right onto a heading of 240° and climb to and maintain an altitude of 2,000 ft mean sea level (msl) after takeoff. Automatic dependent surveillance-broadcast (ADS-B) data for the accident flight started at 0920:05, and aircraft performance calculations showed that the airplane was climbing through an altitude of 150 ft msl at that time. The calculations also showed that the airplane then turned slightly to the right toward the assigned heading of 240° and climbed at a rate that varied between 1,000 and 2,400 ft per minute and an airspeed that increased from about 151 to 165 knots. At 0920:13, the airplane started rolling back toward wings level and, 7 seconds later, rolled through wings level and toward the left. At that time, the airplane was tracking 232° at an altitude of 474 ft and an airspeed of 165 knots. The airplane’s airspeed remained at 165 knots for about 10 seconds before it started increasing again, and the airplane continued to roll steadily to the left at an average roll rate of about 2° per second. The aircraft performance calculations further showed that, at 0920:40, the airplane reached a peak altitude of 925 ft msl. At that time, the airplane was tracking 200°, its bank angle was about 35° to the left, and its airspeed was about 169 knots. The airplane then started to descend while the left roll continued. At 0920:55, the airplane reached a peak airspeed of about 197 knots, which then started decreasing. At 0920:57, the airplane descended through 320 ft at a rate of descent of about 2,500 ft per minute and reached a bank angle of 75° to the left. At 0920:58, the controller issued a low altitude alert, stating that the pilot should “check [the airplane’s] altitude immediately” because the airplane appeared to be at an altitude of 300 ft msl. The pilot did not respond, and no mayday or emergency transmission was received from the airplane. The last ADS-B data point was recorded at 0920:59; aircraft performance calculations showed that, at that time, the airplane was descending through an altitude of 230 ft msl at a flightpath angle of about -7°, an airspeed of 176 knots, and a rate of descent of about 2,300 ft per minute. (The flightpath angle is in the vertical plane—that is, relative to the ground. The ground track, as discussed previously, is in the horizontal plane—that is, relative to north.) The airplane struck trees and power lines before striking the ground, traveled across a parking lot, and struck a car. The car rolled several times and came to rest inverted at the edge of the parking lot, and a postcrash fire ensued. The airplane continued to travel, shedding parts before coming to rest at the far end of an adjacent field. At the accident site, the surviving passenger told a local police officer that “the plane went straight up and then straight down.”", "probable_cause": "The pilot’s loss of airplane control due to spatial disorientation during the initial climb in instrument meteorological conditions."}