{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-montevideo-2-killed", "date": "Jun 6, 2012 at 1955 LT", "type": "Swearingen SA227 Metro III", "operator": "Air%20Class", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Montevideo - Buenos Aires", "msn": "AC-482", "yom": 1982, "flight_number": null, "city": "Montevideo", "zone": "Montevideo City District", "country": "Uruguay", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 16177, "captain_hours_type": null, "copilot_hours": 406, "copilot_hours_type": null, "aircraft_hours": 26158, "circumstances": "The crew was performing a cargo flight from Montevideo to Buenos Aires on behalf of DHL. The aircraft departed runway 24 at Montevideo-Carrasco Airport at 1945LT and the crew was cleared to climb to FL080. While reaching a height of 4,500 feet, the aircraft entered an uncontrolled descent and crashed in the sea at a speed of 570 knots which caused its disintegration off Flores Island. Few debris were found the following day floating on water but the main wreckage was localized two weeks later about one NM south of Flores Island. The CVR was found on 02AUG2012 but was unreadable as the content was concerning the last 30 minutes of the precedent flight. On 11FEB2013, fishermen found the cargo door in their fishnet. No trace of the cargo nor the crew was ever found. ", "probable_cause": "Investigations determined that both engines were running normally at impact, that no propeller blades were lost during descent, that fuel was not contaminated and that no problems occurred on the on electrical system. Meteorological Office confirmed that severe icing conditions prevailed at the time of the accident between FL010 and FL150. The loss of control was the consequence of erroneous indications of the flight instruments, associated with the possible formation of crystalline ice on the aircraft' structure, causing a loss of situational awareness of the crew."}