{"url": "https://www.baaa-acro.com/crash/crash-canadair-cl-601-3a-challenger-marco-island", "date": "Mar 1, 2015 at 1615 LT", "type": "Canadair CL-601 Challenger", "operator": "Six Hundred NP", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Marathon – Marco Island", "msn": "3002", "yom": 1983, "flight_number": null, "city": "Marco Island", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8988, "captain_hours_type": 844, "copilot_hours": 18500, "copilot_hours_type": 1500, "aircraft_hours": 15771, "circumstances": "Earlier on the day of the accident, the pilot-in-command (PIC) and second-in-command (SIC) had landed the airplane on a 5,008-ft-long, asphalt-grooved runway. After touchdown with the flaps fully extended, the ground spoilers and thrust reversers were deployed, and normal braking occurred. The PIC, who was the flying pilot, and the SIC subsequently departed on an executive/corporate flight with a flight attendant, the airplane owner, and five passengers onboard. The PIC reported that he flew a visual approach to the dry, 5,000-ft-long runway while maintaining a normal glidepath at Vref plus 4 or 5 knots at the runway threshold with the flaps fully extended. He added that the touchdown was \"firm\" and between about 300 to 500 ft beyond the aiming point marking. After touchdown, the PIC tried unsuccessfully to deploy the ground spoilers. He applied \"moderate\" brake pressure when the nose landing gear (NLG) contacted the runway, but felt no deceleration. He also attempted to deploy the thrust reversers without success. The PIC then informed the SIC that there was no braking energy, released the brakes, and turned off the antiskid system. He then reapplied heavy braking but did not feel any deceleration, and he again tried to deploy the thrust reversers without success. He maintained directional control using the nosewheel steering and manually modulated the brakes. However, the airplane did not slow as expected. While approaching the runway end and realizing that he was not going to be able to stop the airplane on the runway, the PIC intentionally veered the airplane right to avoid water ahead. However, the airplane exited the runway end into sand, and the NLG collapsed. The airplane then came to rest about 250 ft past the departure end of the runway. The passengers exited the airplane, and shortly after, airport personnel arrived and rendered assistance. The airplane owner, who was a passenger in the cabin, stated that he left his seat and moved toward the cabin door when he realized that the airplane would not stop on the runway, and he sustained serious injuries. Examination of the airplane revealed that there was minimal pressure at the No. 2 (left inboard) brake due to failure of a spring in the upper brake control valve (BCV), and the coupling subassembly of the No. 1 wheel speed sensor (WSS) was fractured. A representative from the airplane manufacturer reported that, during certification of the brake system, the failure of the BCV spring was considered acceptably low and would be evident to flight crewmembers within five landings of the failure. Because the airplane did not pull while braking during the previous landing earlier that day to a similar length runway, the spring likely failed during the accident landing. Although the PIC was unable to manually deploy the ground spoilers and thrust reversers during the landing roll, they functioned normally during the landing earlier that day and during postaccident operational testing and examination, with no systems failures or malfunctions noted. Additionally, there were no malfunctions or failures with the weight-onwheels system found during postaccident examinations that would have precluded normal operation. Therefore, the PIC's unsuccessful attempts to deploy the ground spoilers and thrust reversers were likely due to errors made while multitasking when presented with an unexpected situation (inadequate deceleration) with little runway remaining. Airplane stopping distance calculations based on the airplane's reported weight, weather conditions, calculated and PIC-reported Vref speed, flap extension, and estimated touchdown point (300 to 500 ft beyond the aiming point marking as reported by the PIC and SIC and corroborated by security camera footage) and assuming the nonuse of the ground spoilers and thrust reversers, operational antiskid and steering systems, and the loss of one brake per side (symmetric half braking) showed that the airplane would have required 690 ft of additional runway; under the same conditions but with thrust reversers used, the airplane still would have required 27 ft of additional runway. Even though there were no antiskid failure annunciations, the PIC switched off the antiskid system, which led to the rupture of the Nos. 1, 3, and 4 tires and likely fractured the No. 1 WSS's coupling subassembly, both of which would have further contributed to the loss of braking action. Therefore, the combination of the failure of a spring in the No. 2 brake's upper BCV and the fracture of the coupling subassembly of the No. 1 WSS, the pilot's failure to attain the proper touchdown point, the slightly excess speed, and the subsequent failure of three of the tires resulted in there being insufficient runway remaining to avoid a runway overrun. Although the BCV manufacturer reported that there was 1 previous case involving a failed BCV spring and 43 instances of units with relaxed springs within the BCVs, none of these failed or relaxed springs would have been detected by maintenance personnel because a focused inspection of the BCV was not required.", "probable_cause": "The failure of a spring inside the No. 2 brake's upper brake control valve and the fracture of the coupling subassembly of the No. 1 wheel speed sensor during landing, which resulted in the loss of braking action, and the pilot-in-command's (PIC) deactivation of the antiskid system even though there were no antiskid failure annunciations, which resulted in the rupture of the Nos. 1, 3, and 4 tires, further loss of braking action, and subsequent landing overrun. Contributing to accident were the PIC's improper landing flare, which resulted in landing several hundred feet beyond the aiming point marking, and his unsuccessful attempts to deploy the thrust reversers for reasons that could not be determined because postaccident operational testing did not reveal any anomalies that would have precluded normal operation. Contributing to the passenger's injury was his leaving his seat intentionally while the airplane was in motion."}