{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-3m8-jauja", "date": "Mar 28, 2017 at 1628 LT", "type": "Boeing 737-300", "operator": "Peruvian-Airlines.png", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lima - Jauja", "msn": "25071/2039", "yom": 1991, "flight_number": "P9112", "city": "Jauja", "zone": "Junín", "country": "Peru", "region": "South America", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 142, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13504, "captain_hours_type": null, "copilot_hours": 7604, "copilot_hours_type": null, "aircraft_hours": 62817, "circumstances": "The aircraft departed Lima-Jorge Chavez Airport on a 20-minute flight to Jauja, carrying 142 passengers and 7 seven crew members. The approach to Jauja-Francisco Carlé was uneventful and completed in good weather conditions. Two seconds after the nose gear touched down on runway 31, the crew activated the reverse systems when he felt strong vibrations and oscillations. The aircraft started to bounce and became uncontrollable. The right main gear collapsed then the aircraft veered off runway to the right, lost its right engine and came to rest in a grassy area, bursting into flames. All 149 occupants evacuated safely and the aircraft was totally destroyed by fire.", "probable_cause": "Failure of the mechanical components of the shimmy damper system in each of the main landing gears which, being out of tolerance range, did not allow the correct damping of the vibrations and lateral oscillations of the wheels after touchdown, generating sequential shimmy events in both gears and causing their collapse. \r\nContributing factors:\r\n- Incorrect and probable absence of measurements on mechanical components of the 'cimmetic chain for shimmy damper operation', as indicated by the operator's PM AMM Task, which would have allowed for the timely detection and replacement of out-of-tolerance components, ensuring their integrity and correct operation.\r\n- The Service Letter 737-SL-32-057-E 'broken torsion link', does not provide for mandatory actions, it only recommends maintenance practices to prevent fractures in mechanical components of the 'cimmetic chain for shimmy damper operation'.\r\n- Service Letter 737-SL-32-057-E 'fractures in lower torsion link', makes a proper interpretation difficult; that could induce errors to choose the corresponding AMM Task and determine its scope."}