{"url": "https://www.baaa-acro.com/crash/crash-aviation-traders-atl-98-carvair-griffin-2-killed", "date": "Apr 4, 1997 at 0016 LT", "type": "Aviation Traders ATL-98 Carvair", "operator": "Custom Air Service", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Griffin – Americus – Rockford", "msn": "5/10365", "yom": 1944, "flight_number": null, "city": "Griffin", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 12000, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 50558, "circumstances": "During the airplane's takeoff roll, about 3/4 down the 3,700 foot runway, a witness reported that the color of the #1 exhaust flame changed from blue to yellow, accompanied by an audible change in the engine power level. The nose of the airplane yawed left and the left wing dipped. Directional control was regained and the takeoff continued. Skid marks were found about 650 feet before the departure end of the runway that continued about 1360 feet to an abandoned grocery store impacted by the plane. About 315 feet before the building, the left wing contacted a privacy fence, and a utility pole, resulting in a fire at the disrupted left wing main fuel tank. A pilot/mechanic who helped dispatch the airplane observed that the elevator was free as it taxied. Fire damage to all engines precluded a detailed post crash examination of essential fuel and ignition systems. The toxicological report regarding the second pilot indicated that 1.110 mcg/ml (ug/ml, ug/g) of Diphenhydramine, was detected in the blood. According to NTSB medical personnel, Diphenhydramine is a sedating antihistamine often found in over-the-counter allergy medications. A single oral dose of medication containing Diphenhydramine, at twice the recommended maximum of over-the-counter dosage, resulted in maximal blood levels of between 0.08 and 0.16 mcg/ml. The level of Diphenhydramine found during the toxicology examination of the second pilot approximated ten times the levels found following a dosage at twice the recommended strength. Diphenhydramine was also found in the urine. Additional prescription and nonprescription medications were also found during the toxicological examination of the second pilot. ", "probable_cause": "The flightcrew's inadequate procedures, during a rejected takeoff following a possible engine malfunction at a critical time in the takeoff, and the second pilot's physical impairment. "}