{"url": "https://www.baaa-acro.com/crash/crash-martin-404-las-vegas", "date": "Nov 15, 1956 at 1504 LT", "type": "Martin 404", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kansas City – Topeka – Wichita – Amarillo – Santa Fe – Albuquerque – Las Vegas – Los Angeles", "msn": "14104", "yom": 1951, "flight_number": "TW163", "city": "Las Vegas-McCarran", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 35, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9431, "captain_hours_type": 639, "copilot_hours": 9926, "copilot_hours_type": 105, "aircraft_hours": 10451, "circumstances": "Trans World Airlines Flight 163 is a regularly scheduled domestic operation between Kansas City, Missouri, and Los Angeles, California, with intermediate stops at Topeka and Wichita, Kansas; Amarillo, Texas; Santa Fe and Albuquerque, New Mexico; and Las Vegas, Nevada. A scheduled crew change is made at Albuquerque. There, on November 15, 1956. Captain Arthur G. deFabry, First Officer James P. Rapattoni, and Hostess Anne J. Zeman boarded Flight 163 as its crew to complete the remaining segments. The flight was routine to Las Vegas where it landed at 1440. During the short ground time at Las Vegas the aircraft was serviced and the crew performed routine duties for continuation of the flight to Los Angeles. There was no apparent need for maintenance on the aircraft and none was performed. An Instrument Flight Rules flight plan was prepared and filed because of instrument weather conditions over the latter portion of the flight segment to Los Angeles. Weather conditions at Las Vegas, however, were clear. At 1449 Captain deFabry, seated in the captain’s position, taxied N 40404 from the Las Vegas terminal to runup position beside runway 7 where the required pretakeoff checks were accomplished. The aircraft and equipment responded normally. The flight was issued an instrument clearance by Air Route Traffic Control. At this time, according to the company load manifest, the gross weight of the aircraft was 41.801 pounds, well under the maximum allowable for takeoff, 43,650 pounds. The load was properly distributed with respect to the center of gravity limitations of the aircraft. With Captain deFabry operating the aircraft, Flight 163 took off at 1456. The takeoff was routine and was followed by a climbing left turn to gain altitude and establish a southwesterly course toward Los Angeles. At 1501, when over the northern perimeter of the city, First Officer Rapattoni radioed the Las Vegas tower stating the flight was returning to the airport, engine out. The Las Vegas tower controllers immediately notified all other traffic to remain clear and alerted emergency equipment. Flight 163 was cleared to land, any runway, and informed that the wind was calm. Captain deFabry elected to use runway 7 and First Officer Rapattoni notified the tower. Emergency equipment was then dispatched into position on the taxiway parallel to that runway. N40404 was soon observed on a wide base leg for runway 7 and as it turned onto the final approach. Position and altitude of the flight seemed normal. As the aircraft drew closer its extended gear could be seen and its left propeller was clearly visible, stopped and feathered. As the aircraft passed over the runway threshold its alignment position, and altitude seemed good; however, to nearly all observers excessive speed was apparent. The aircraft floated a considerable distance down the runway before touching it. It then bounced several times, after which an application of power was heard, obviously :m an attempt to go around. The Martin climbed, veered to the left, and its left wing gradually lowered. It seemed to “struggle” to continue flight and its airspeed decreased visibly. Seconds later the aircraft struck the ground, left wing low, just inside the airport boundary. Weather conditions at the time of the accident were clear, visibility 65 miles, and the wind was calm. A large cloud of dust, raised by the accident, hung over the scene and gradually lifted nearly vertically in evidence of the calm wind.", "probable_cause": "The Board determines that the probable cause of this accident was that during an emergency situation the captain failed to reduce speed during the latter portion of a single-engine approach; this excessive speed resulted in an overshoot and an attempted go-around which was beyond the performance capability of the aircraft under existing conditions. The following findings were reported: \r\n- The prior segments of the flight, the pretakeoff cheeks, and the takeoff at Las Vegas were normal,\r\n- Shortly after takeoff the left engine No. 2 cylinder exhaust valve push rod failed causing backfiring, loss of power, and engine roughness; these conditions necessitated taking the engine out of operation by feathering its propeller,\r\n- Emergency single-engine operation was established, the McCarran tower was notified, and the flight returned to the airport to land,\r\n- The base leg and final approach to runway 7 were normal with respect; to alignment, position, and altitude,\r\n- The flight crossed the threshold with excessive airspeed and floated 2.749 feet before touching the runway,\r\n- A series of bounces occurred as unsuccessful attempts were made by Captain deFabry to force the aircraft on the runway,\r\n- Believing the aircraft could successfully go around at the speed and in the configuration which existed the captain attempted unsuccessfully to do so,\r\n- Prior to the accident company pilot training with respect to single-engine performance of the Martin 404 in the balked landing situation was inadequate,\r\n- Examination showed there was no malfunction of the right engine, landing gear and flap hydraulic systems, or the ADI system."}