{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-g200-abuja", "date": "Jan 29, 2018 at 1520 LT", "type": "Gulfstream G200", "operator": "Nestoil_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lagos - Abuja", "msn": "180", "yom": 2007, "flight_number": null, "city": "Abuja", "zone": "Abuja Federal Capital Territory", "country": "Nigeria", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5300, "captain_hours_type": 280, "copilot_hours": 5700, "copilot_hours_type": 93, "aircraft_hours": 1421, "circumstances": "On 25th January 2018 at 14:28 h, a Gulfstream 200 (G200) aircraft with nationality and registration marks 5N-BTF operated by Nestoil Plc, departed Murtala Mohammed International Airport, Lagos (DNMM) as a charter flight to Nnamdi Azikiwe International Airport, Abuja (DNAA) on an Instrument Flight Rules (IFR) flight plan. Onboard were four passengers and three flight crew members. The Pilot in command (PIC) was the Pilot Monitoring (PM) and the Co-pilot was the Pilot Flying (PF). The departure, cruise and approach to Nnamdi Azikiwe International Airport were normal. At 14:45 h, 5N-BTF contacted Abuja radar and was subsequently cleared for Radar vectors ILS approach Runway 22. Abuja Airport Automatic Terminal Information Service (ATIS) Papa for time 14:20 h was monitored as follows; “Main landing runway 22, wind 110/07 kt, Visibility 3,500 m in Haze, No Significant Clouds, Temperature/Dew point 33/- 01°C, QNH 1010 hPa, Trend No Significant Change, End of Information Papa”. At 15:17 h, 5N-BTF reported 4 NM on Instrument approach (ILS) and was requested to report 2 NM because there was a preceding aircraft (Gulfstream 5) on landing roll. Thereafter, 5N-BTF was cleared to land runway 22 with reported wind of 070°/07 kt. At 15:18 h, the aircraft touched down slightly left of the runway centre line. According to the PF, in the process of controlling the aircraft to the centre line, the aircraft skidded left and right and eventually went partly off the runway to the right where it came to a stop. In his report, the PM stated that on touchdown, he noticed the aircraft oscillating left and right as brakes were applied. The oscillation continued to increase and [the aircraft] eventually went off the runway to the right where the aircraft came to a stop, partially on the runway. During the post-crash inspection, the investigation determined that the skid marks on the runway indicated that the aircraft steered in an S-pattern continuously with increasing amplitude, down the runway. On the last right turn, the aircraft exited the right shoulderof the runway, the right main wheel went into the grass and on the final left turn, the right main landing gear strut detached from its main attachment point after which the aircraft finally came to a complete stop on a magnetic heading of 160°. The ATC immediately notified the Aircraft Rescue and Fire Fighting Services (ARFFS), Approach Radar Control, and other relevant agencies about the occurrence. All persons on board disembarked with no injuries. Instrument Meteorological Conditions (IMC) prevailed at the time of the occurrence. The serious incident occcurred in daylight.", "probable_cause": "Causal Factor:\r\nThe use of improper directional control techniques to maintain the aircraft on the runway. \r\nContributory Factor:\r\nImproper coordination in taking over control of the aircraft by the PM which was inconsistent with Nestoil SOP."}