{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-200-whittier-12-killed", "date": "Jan 9, 1975 at 1607 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Golden%20West%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Ontario - Los Angeles", "msn": "83", "yom": 1967, "flight_number": "GW261", "city": "Whittier", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 9366, "captain_hours_type": 2774, "copilot_hours": 2555, "copilot_hours_type": 2065, "aircraft_hours": 10092, "circumstances": "Golden West Flight 261 departed Ontario, CA at 15:56PST for a VFR flight to Los Angeles. At 16:04 the crew contacted LAX arrival and reported over Rose Hills. The flight was then cleared for the Terminal Control Area (TCA) and no. 2 arrival to runway 24L. At 16:05 the crew were advised that they had traffic 5,5nm in front of them climbing from 1500 to 3000 feet which was a police helicopter on a VFR flight. The arrival controller transmitted another advisory about the helicopter at 16:06, but there was no response. It appeared the Twin Otter had collided in flight at 2200 feet with a Cessna 150 aircraft (N11421). The Twin Otter was flying on a 250deg heading descending 300 feet/min at 146 knots airspeed while the Cessna was flying at 94 kts; the closing speed was 174 kts. The Cessna, operated by CessnAir Aviation had departed from Long Beach on a local training flight at 15:46. Both aircraft crashed. Debris caused some damage to houses and lawns near the crash site.", "probable_cause": "The failure of both flight crews to see the other aircraft in sufficient time to initiate evasive action. The Board is unable to determine why each crew failed to see an avoid the other aircraft; however, the Board believes that the ability of both crews to detect the other aircraft in time to avoid a collision was reduced because of the position of the sun, the closure angle of the aircraft, and the necessity for the Twin Otter's fight crew to acquire visual contact with radar-reported traffic directly in front of them."}