{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-61f-miami-5-killed", "date": "Aug 7, 1997 at 1236 LT", "type": "Douglas DC-8", "operator": "Fine%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Miami - Santo Domingo", "msn": "45942", "yom": 1968, "flight_number": "FB101A", "city": "Miami-Intl", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 1, "total_fatalities": 5, "captain_hours": 12154, "captain_hours_type": 2522, "copilot_hours": 2641, "copilot_hours_type": 1592, "aircraft_hours": 46825, "circumstances": "Fine Air Flight 101 was originally scheduled to depart Miami for Santo Domingo at 09:15 using another DC-8 airplane, N30UA, to carry cargo for Aeromar. Due to a delay of the inbound aircraft, Fine Air substituted N27UA for N30UA and rescheduled the departure for 12:00. N27UA arrived at Miami at 09:31 from San Juan, Puerto Rico, and was parked at the Fine Air hangar ramp. The security guard was not aware of the airplane change, and he instructed Aeromar loaders to load the airplane in accordance with the weight distribution form he possessed for N30UA. The first cargo pallet for flight 101 was loaded onto N27UA at 10:30 and the last pallet was loaded at 12:06. The resulting center of gravity (CG) of the accident airplane was near or even aft of the airplane’s aft CG limit. After the three crew members and the security guard had boarded the plane, the cabin door `was closed at 12:22. Eleven minutes later the flight obtained taxi clearance for runway 27R. The Miami tower controller cleared flight 101 for takeoff at 12:34. Takeoff power was selected and the DC-8 moved down the runway. The flightcrew performed an elevator check at 80 knots. Fourteen seconds later the sound of a thump was heard. Just after calling V1 a second thump was heard. Two seconds later the airplane rotated. Immediately after takeoff the airplane pitched nose-up and entered a stall. The DC-8 recovered briefly from the stall, and stalled again. The airplane impacted terrain in a tail first, right wing down attitude. it slid west across a road (72nd Avenue) and into the International Airport Center at 28th Street and burst into flames. Investigation showed that the center of gravity resulted in the airplane’s trim being mis-set by at least 1.5 units airplane nose up, which presented the flightcrew with a pitch control problem on takeoff.", "probable_cause": "The probable cause of the accident, which resulted from the airplane being misloaded to produce a more aft center of gravity and a correspondingly incorrect stabilizer trim setting that precipitated an extreme pitch-up at rotation, was \r\n1) The failure of Fine Air to exercise operational control over the cargo loading process; and \r\n2) The failure of Aeromar to load the airplane as specified by Fine Air. \r\nContributing to the accident was the failure of the FAA to adequately monitor Fine Airs operational control responsibilities for cargo loading and the failure of the FAA to ensure that known cargo-related deficiencies were corrected at Fine Air."}