{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-1245-clarenville", "date": "May 18, 1998 at 1741 LT", "type": "Pilatus PC-12", "operator": "V. Kelner Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Saint John’s – Goose Bay", "msn": "151", "yom": 1996, "flight_number": "FKL151", "city": "Clarenville", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4700, "captain_hours_type": 800, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3913, "circumstances": "The aircraft, a Pilatus PC-12, serial number 151, was on a scheduled domestic flight from St. John's, Newfoundland, to Goose Bay, Labrador, with the pilot, a company observer, and eight passengers on board. Twenty-three minutes into the flight, the aircraft turned back towards St. John's because of a low oil pressure indication. Eight minutes later, the engine(Pratt & Whitney PT6A-67B) had to be shut down because of a severe vibration. The pilot then turned towards Clarenville Airport, but was unable to reach the airfield. The aircraft was destroyed during the forced landing in a bog one and a half miles from the Clarenville Airport. The pilot, the company observer, and one passenger sustained serious injuries. The Board determined that the pilot did not follow the prescribed emergency procedure for low oil pressure, and the engine failed before he could land safely. The pilot's decision making was influenced by his belief that the low oil pressure indications were not valid. The engine failed as a result of an interruption of oil flow to the first-stage planet gear assembly; the cause of the oil flow interruption could not be determined.", "probable_cause": "The pilot did not follow the prescribed emergency procedure for low oil pressure, and the engine failed before he could land safely. The pilot's decision making was influenced by his belief that the low oil pressure indications were not valid. The engine failed as a result of an interruption of oil flow to the first-stage planet gear assembly; the cause of the oil flow interruption could not be determined."}