{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-c-benalla", "date": "Jul 16, 1986 at 1818 LT", "type": "Piper PA-31-310 Navajo", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Benalla – Bankstown", "msn": "31-7712029", "yom": 1977, "flight_number": null, "city": "Benalla", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At the time of the attempted take-off, the night was dark, with overcast cloud conditions and light rain falling. Wind conditions were light and variable. The pilot reported that initial acceleration was normal, and the aircraft became airborne at about 95 knots. A positive rate of climb was established and the landing gear was selected up. The pilot subsequently advised that the speed then decayed to 90 knots. At this time there was nothing unusual in the engine noise and the controls felt normal. Shortly afterwards the propellers struck the ground 116 metres beyond the end of the runway. The aircraft then struck an embankment and passed through a fence before coming to rest 247 metres from the initial ground strike. All four occupants escaped with minor injuries and the aircraft was destroyed. ", "probable_cause": " Although wind conditions were light and variable when the engines were started, shortly after the accident the wind was moderate from the west/south-west. A detailed analysis conducted by the Bureau of Meteorology indicated that while the pilot was preparing for take-off, a cold front with winds in excess of 20 knots had probably passed over the aerodrome. As the pilot had conducted the take-off on runway 08, there was probably a substantial tailwind component. Conditions were also assessed as suitable for the development of microbursts, but the lack of recording instruments in the area prevented confirmation that this type of phenomenon had in fact occurred. The pilot had been deprived of the opportunity to observe changing wind conditions at the aerodrome. The wind direction indicator adjacent to the threshold of runway 08 was not lit, and the illuminated wind direction indicator was not visible from the point where the aircraft was lined up for take-off. "}