{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-sitka-4-killed", "date": "Aug 6, 2007 at 1255 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Hendrickson Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Victoria - Sitka", "msn": "46-36127", "yom": 1997, "flight_number": null, "city": "Sitka", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1800, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2042, "circumstances": "The private, instrument-rated pilot, was on an IFR cross-country flight, and had been cleared for a GPS approach. He reported that he was 5 minutes from landing, and said he was circling to the left, to land the opposite direction from the published approach. The traffic pattern for the approach runway was right traffic. Instrument meteorological conditions prevailed, and the weather conditions included a visibility of 3 statute miles in light rain and mist; few clouds at 400 feet, 1,000 feet overcast; temperature, 55 degrees F; dew point, 55 degrees F. The minimum descent altitude, either for a lateral navigation approach, or a circling approach, was 580 feet, and required a visibility of 1 mile. The missed approach procedure was a right climbing turn. A circling approach north of the runway was not approved. Witnesses reported that the weather included low clouds and reduced visibility due to fog and drizzle. The airplane was heard, but not seen, circling several times over the city, which was north of the runway. Witnesses saw the airplane descending in a wings level, 30-45 degree nose down attitude from the base of clouds, pitch up slightly, and then collide with several trees and an unoccupied house. A postcrash fire consumed the residence, and destroyed the airplane. A review of FAA radar data indicated that as the accident airplane flew toward the airport, its altitude slowly decreased and its flight track appeared to remain to the left side (north) of the runway. The airplane's lowest altitude was 800 feet as it neared the runway, and then climbed to 1,700 feet, where radar contact was lost, north of the runway. During the postaccident examination of the airplane, no mechanical malfunction was found. Given the lack of any mechanical deficiencies with the airplane, it is likely the pilot was either confused about the proper approach procedures, or elected to disregard them, and abandoned the instrument approach prematurely in his attempt to find the runway. It is unknown why he decided to do a circle to land approach, when the tailwind component was slight, and the shorter, simpler, straight in approach was a viable option. Likewise, it is unknown why he flew towards rising terrain on the north side of the runway, contrary to the published procedures. From the witness statements, it appears the pilot was \"hunting\" for the airport, and intentionally dove the airplane towards what he perceived was an area close to it. In the process, he probably saw\r\ntrees and terrain, attempted to climb, but was too low to avoid the trees.", "probable_cause": "The pilot's failure to maintain altitude/distance from obstacles during an IFR circling approach, and his failure to follow the instrument approach procedure. Contributing to the accident was clouds."}