{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-near-nightmute-1-killed", "date": "Sep 2, 2011 at 1335 LT", "type": "Cessna 208B Grand Caravan", "operator": "Grant%20Aviation-2_0", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Toksook Bay - Bethel", "msn": "208B-0859", "yom": 2000, "flight_number": null, "city": "Nightmute", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3719, "captain_hours_type": 875, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8483, "circumstances": "A Cessna 208B and a Cessna 207 collided in flight in daylight visual meteorological conditions. The Cessna 208B and the Cessna 207 were both traveling in an easterly direction. According to the Cessna 207 pilot, the airplanes departed from two neighboring remote Alaskan villages about the same time, and both airplanes were flying along similar flight routes. While en route, the Cessna 207 pilot talked with the Cessna 208B pilot on a prearranged, discreet radio frequency, and the two agreed to meet up in flight for the return to their home airport. The Cessna 207 pilot said that the pilot of the Cessna 208B flew his airplane along the left side of her airplane while she was in level cruise flight at 1,200 feet mean sea level and that they continued to talk via the radio. Then, unexpectedly and unannounced, the pilot of the Cessna 208B maneuvered his airplane above and over the top of her airplane. She said that she immediately told the Cessna 208B pilot that she could not see him and that she was concerned about where he was. She said that the Cessna 208B pilot then said, in part: \"Whatever you do, don't pitch up.\" The next thing she recalled was seeing the wings and cockpit of the descending Cessna 208B pass by the right side of her airplane, which was instantly followed by an impact with her airplane's right wing. She said that after the collision, the Cessna 208B passed underneath her airplane from right-to-left before beginning a gradual descent that steepened as the airplane continued to the left. It then entered a steep, vertical, nose-down descent before colliding with the tundra-covered terrain below followed by a postcrash fire. Unable to maintain level cruise flight, the Cessna 207 pilot selected an area of rolling, tundra-covered terrain as a forced landing site. An examination of both airplanes revealed impact signatures consistent with the Cessna 208B's vertical stabilizer impacting the Cessna 207's right wing. A portion of crushed and distorted wreckage, identified as part of the Cessna 208B's vertical stabilizer assembly, was found embedded in the Cessna 207's right wing. The Cessna 208B's severed vertical stabilizer and rudder were found about 1,000 feet west of the Cessna 208B's crash site. ", "probable_cause": "The pilot's failure to maintain adequate clearance while performing an unexpected and unannounced abrupt maneuver, resulting in a midair collision between the two airplanes."}