{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-500-phenom-100-sedona", "date": "May 25, 2011 at 1550 LT", "type": "Embraer EMB-500 Phenom 100", "operator": "JetSuite", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Jose - Sedona", "msn": "500-00057", "yom": 2009, "flight_number": "RSP240", "city": "Sedona", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 23970, "captain_hours_type": 570, "copilot_hours": 1886, "copilot_hours_type": 74, "aircraft_hours": 1052, "circumstances": "Following an uneventful flight, the flight crew briefed the arrival to the destination airport and set the calculated landing speeds. The captain and the first officer reported that during final approach, it felt like the airplane was “pushed up” as the wind shifted to a tailwind or updraft before landing near the runway number markings. Upon touchdown, the captain applied the brakes and thought that the initial braking was effective; however, he noticed the airplane was not slowing down. The captain applied maximum braking, and the airplane began to veer to the right; he was able to correct back to the runway centerline, but the airplane subsequently exited the departure end of the runway and traveled down a steep embankment. A pilot-rated passenger reported that throughout the approach to landing, he thought the airplane was high and thought that the excessive altitude continued through and into the base-to-final turn. He added that the bank angle of this turn seemed greater than 45 degrees. Recorded communication from the cockpit voice and data recorder (CVDR) revealed that during the approach to landing, the flight crew performed the landing checks, and the captain noted difficulty judging the approach. About 1 minute later, the recording revealed that the ground warning proximity system reported “five hundred” followed by a “sink rate, pull up” alert about 16 seconds later. Data from the CVDR revealed that about 23 seconds before weight-on-wheels was recorded, the airplane was at an indicated airspeed of about 124 knots and descending. The data showed that this approximate airspeed was maintained until about 3 seconds before weight-on-wheels. The recorded data further showed that the approach speed was set to 120 knots, and the landing reference speed (vREF) was set to 97 knots.  Using the reported airplane configuration and the 3.5-knot headwind that was reported at the time of the approach and landing, calculations indicate that the vREF speed should have been about 101 knots indicated airspeed, which would have required a landing distance of about 3,112 feet. Utilizing the same airplane configuration and wind condition with the flight’s reported 124 knot indicated airspeed just before touchdown, the landing distance was calculated to be about 5,624 feet. The intended runway for landing was 5,132-feet long with a 1.9 percent downward slope gradient, and a 123-foot long overrun area. A postaccident examination of the airplane, including the braking system, revealed no evidence of mechanical malfunctions or failures that would have precluded normal operation. The pilot misjudged the airplane’s speed during the final approach, which resulted in runway overrun.", "probable_cause": "The pilots’ unstabilized approach and excessive airspeed during approach, which resulted in an insufficient landing distance to stop the airplane before overrunning the runway.\n"}