{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-chicoutimi-2-killed", "date": "Dec 9, 2009 at 2250 LT", "type": "Beechcraft 100 King Air", "operator": "Exact%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Val d'Or - Chicoutimi", "msn": "B-215", "yom": 1975, "flight_number": "ET822", "city": "Chicoutimi", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3500, "captain_hours_type": 1000, "copilot_hours": 1000, "copilot_hours_type": 150, "aircraft_hours": null, "circumstances": "The Beechcraft was on an instrument flight rules flight between Val-d’Or and Chicoutimi/Saint-Honoré, Quebec, with 2 pilots and 2 passengers on board. At 2240 Eastern Standard Time, the aircraft was cleared for an RNAV (GNSS) Runway 12 approach and switched to the aerodrome traffic frequency. At 2250, the International satellite system for search and rescue detected the aircraft’s emergency locator transmitter signal. The aircraft was located at 0224 in a wooded area approximately 3 nautical miles from the threshold of Runway 12, on the approach centreline. Rescuers arrived on the scene at 0415. The 2 pilots were fatally injured, and the 2 passengers were seriously injured. The aircraft was destroyed on impact; there was no post-crash fire. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\nFor undetermined reasons, the crew continued its descent prematurely below the published approach minima, leading to a controlled flight into terrain (CFIT). \r\nFindings as to Risk:\r\n1. The use of the step-down descent technique rather than the stabilized constant descent angle (SCDA) technique for non-precision instrument approaches increases the risk of an approach and landing accident (ALA).\r\n2. The depiction of the RNAV (GNSS) Runway 12 approach published in the Canada Air Pilot (CAP) does not incorporate recognized visual elements for reducing ALAs, as recommended in Annex 4 to the Convention, thereby reducing awareness of the terrain.\r\n3. The installation of a terrain awareness warning system (TAWS) is not yet a requirement under the Canadian Aviation Regulations (CARs) for air taxi operators. Until the changes to regulations are put into effect, an important defense against ALAs is not available.\r\n4. Most air taxi operators are unaware of and have not implemented the FSF ALAR task force recommendations, which increases the risk of a CFIT accident.\r\n5. Approach design based primarily on obstacle clearance instead of the 3° optimum angle increases the risk of ALAs.\r\n6. The lack of information on the SCDA technique in Transport Canada reference manuals means that crews are unfamiliar with this technique, thereby increasing the risk of ALAs.\r\n7. Use of the step-down descent technique prolongs the time spent at minimum altitude, thereby increasing the risk of ALAs.\r\n8. Pilots are not sufficiently educated on instrument approach procedure design criteria. Consequently, they tend to use the CAP published altitudes as targets, and place the aircraft at low altitude prematurely, thereby increasing the risk of an ALA.\r\n9. Where pilots do not have up-to-date information on runway conditions needed to check runway contamination and landing distance performance, there is an increased risk of landing accidents.\r\n10. Non-compliance with instrument flight rules (IFR) reporting procedures at uncontrolled airports increases the risk of collision with other aircraft or vehicles.\r\n11. If altimeter corrections for low temperature and remote altimeter settings are not accurately applied, obstacle clearance will be reduced, thereby increasing the CFIT risk.\r\n12. When cockpit recordings are not available to an investigation, this may preclude the identification and communication of safety deficiencies to advance transportation safety.\r\n13. Task-induced fatigue has a negative effect on visual and cognitive performance which can diminish the ability to concentrate, operational memory, perception and visual acuity.\r\n14. Where an emergency locator transmitter (ELT) is not registered with the Canadian Beacon Registry, the time needed to contact the owner or operator is increased which could affect occupant rescue and survival.\r\n15. If the tracking of a call to 911 emergency services from a cell phone is not accurate, search and rescue efforts may be misdirected or delayed which could affect occupant rescue and survival.\r\nOther Findings:\r\n1. Weather conditions at the alternate airport did not meet CARs requirements, thereby reducing the probability of a successful approach and landing at the alternate airport if a diversion became necessary.\r\n2. Following the accident, none of the aircraft exits were usable."}