{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-340-pretoria-1-killed", "date": "Jul 10, 2018 at 1639 LT", "type": "Convair CV-340", "operator": "Rovos%20Air_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pretoria - Sun City", "msn": "215", "yom": 1954, "flight_number": null, "city": "Pretoria-Wonderboom", "zone": "Gauteng", "country": "South Africa", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 17, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 18240, "captain_hours_type": 63, "copilot_hours": 19616, "copilot_hours_type": null, "aircraft_hours": 18115, "circumstances": "On Tuesday 10 July 2018, at approximately 1439Z, two crew members and 17 passengers took off on a ZS-BRV aircraft for a scenic flight from Wonderboom Aerodrome (FAWB) destined for Pilanesberg Aerodrome (FAPN) when the accident occurred. During take-off, the left engine caught fire, however, the crew continued with the flight. They declared an emergency by broadcasting ‘MAYDAY’ and requesting to return to the departure aerodrome. The crew turned to the right with the intention of returning to the aerodrome. However, the left engine fire intensified, causing severe damage to the left wing rear spar and left aileron system, resulting in the aircraft losing height and the crew losing control of the aircraft and colliding with power lines, prior to crashing into a factory building. The footage taken by one of the passengers using their cellphone showed flames coming from the front top side of the left engine cowling and exhaust area after take-off. The air traffic control (ATC) on duty at the time of the accident confirmed that the left engine had caught fire during take-off and that the crew had requested clearance to return to the aerodrome. The ATC then activated the crash alarm and the aircraft was prioritized for landing. During the accident sequence that followed, one passenger (engineer) occupying the jump seat in the cockpit was fatally injured and 18 others sustained injuries. The investigation revealed that during take-off, the left engine had caught fire and the crew had continued with the flight without securing the left engine as prescribed in the aircraft flight manual (AFM). The crew had then declared an emergency and attempted to return to the aerodrome, however, they lost control of the aircraft and collided with power lines prior to crashing into a factory building. Owned by Rovos Air (part of the South African Rovos Rail Group), the aircraft was donated to the Dutch Museum Aviodrome based in Lelystad and has to be transferred to Europe with a delivery date on 23 July 2018. For this occasion, the aircraft was repaint with full Martin's Air Charter colorscheme. Part of the convoy program to Europe, the airplane was subject to several test flights, carrying engineers, technicians, pilots and also members of the Aviodrome Museum. ", "probable_cause": "During take-off, the left engine caught fire and the crew continued with the flight without securing the left engine as prescribed in the aircraft flight manual (AFM). The crew declared an emergency and attempted to return to the aerodrome, however, they lost control of the aircraft and collided with power lines prior to crashing into a factory building. The following contributing factors were reported:\r\n- Pre-existing damage to the cylinder No 13 piston and ring pack deformation and, most probably, the cylinder No 7’s fractured exhaust valve head that were not detected during maintenance of the aircraft,\r\n- Substandard maintenance for failing to conduct compression tests on all cylinders during the scheduled maintenance prior to the accident,\r\n- Misdiagnosis of the left engine manifold pressure defect as it was reported twice prior to the accident,\r\n- The crew not aborting take-off at 50 knots prior to reaching V1; manifold pressure fluctuation was observed by the crew at 50 knots and that should have resulted in an aborted take-off,\r\n- Lack of crew resource management; this was evident as the crew ignored using the emergency checklist to respond to the in-flight left engine fire,\r\n- Lack of recency training for both the PF and PM, as well as the LAME,\r\n- Non-compliance to Civil Aviation Regulations by both the crew and the maintenance organisation."}