{"url": "https://www.baaa-acro.com/crash/crash-embraer-erj-145-beaumont", "date": "Feb 11, 1998 at 1216 LT", "type": "Embraer ERJ-145", "operator": "Continental%20Express", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Beaumont - Beaumont", "msn": "145-013", "yom": 1997, "flight_number": "CO910", "city": "Beaumont-Jack Brooks", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10800, "captain_hours_type": 800, "copilot_hours": 1932, "copilot_hours_type": 15, "aircraft_hours": 1844, "circumstances": "The pilot-in-command (PIC) was administering a proficiency check flight to the first officer (FO) in a regional jet. One of the required check items was the loss of an engine at \"V1\" speed. While on takeoff roll with the FO at the controls, the PIC retarded the left engine throttle to idle when \"V1\" speed was attained. The FO called, \"check max thrust,\" and then called, \"positive rate gear up.\" As the PIC reached for the gear lever, he noticed the airplane roll to the left at a rate which he felt was \"excessive and dangerous.\" He then reached for the flight controls and felt the left rudder \"go all the way to the floor.\" As the PIC took control of the airplane, he applied full right rudder and right aileron. The airplane began recovering from the bank and impacted the ground. Flight recorder data revealed that the time interval between the throttle retarded to idle and ground impact was about 8 seconds. The data showed that the airplane became airborne about 2 seconds after the throttle was retarded, and that the airplane had rolled to a 71 degree left bank within 6 seconds from the throttle reduction. Ground scars and wreckage distribution revealed that the left wing had contacted the ground first and then the right wing prior to the airplane coming to rest. The FO had a total of 15 hours in the type aircraft in the last 90 days. Examinations of the airframe, engines, and flight control system did not reveal any anomalies that could have contributed to the accident. Company flight training policy stated that all check airmen should be ready to take control of the airplane while practicing these types of training maneuvers.", "probable_cause": "The first officer's improper use of the rudder when given a simulated engine failure on takeoff and the pilot-in-command's delayed remedial action which resulted in a loss of control. A factor was the first officer's lack of experience in the regional jet airplane."}