{"url": "https://www.baaa-acro.com/crash/crash-embraer-erj-145lu-vitoria-da-conquista", "date": "Aug 25, 2010 at 1440 LT", "type": "Embraer ERJ-145", "operator": "Passaredo", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "São Paulo – Vitoria da Conquista", "msn": "145-351", "yom": 2000, "flight_number": "PTB2231 ", "city": "Vitória da Conquista", "zone": "Bahia", "country": "Brazil", "region": "South America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 35, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4400, "captain_hours_type": 3100, "copilot_hours": 1373, "copilot_hours_type": 813, "aircraft_hours": null, "circumstances": "While approaching Vitoria da Conquista Airport runway 15, the crew failed to realize his altitude was too low. On short final, the aircraft impacted a small mound located few metres short of runway threshold. On impact, both main landing gears were torn off. The aircraft slid on runway for about 300 metres then veered off runway to the left and came to rest in a grassy area some 35 metres left of the runway with the right engine on fire. All 38 occupants escaped uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "The following factors were identified:\r\n- During the approach, the flight crew's attention was focused on the characteristics of the geographical relief and presence of birds, reducing their awareness as to the maintenance of the approach slope.\r\n- The group culture of maintaining a low angle of approach led the crew to choose the runway aspect instead of the VASIS as a reference for the approach, making them susceptible to various types of spatial illusion.\r\n- Taking into account copilot's report that he was not succeeding in correcting the aircraft glide path relative to the runway, one may suppose that he was not applying the appropriate amplitude for such correction.\r\n- The physical characteristics of the runway 15 (the active one) contributed to a wrong perception of the ideal glide path. The pronounced acclivity of the runway, its width (narrower than the runways on which the crew was accustomed to operate), and the low terrain near the threshold, caused in the pilots a perception that they were above the ideal approach slope, leading them to seek correction, which resulted in an angle of approach below the ideal one.\r\n- For the flight in question, the company chose two pilots who had never operated in SBQV. A crewmember with previous experience in the locality would have a higher level of awareness in relation to the specific characteristics of the aerodrome.\r\n- No company publications were found that could provide the pilots with guidance on the specifics of SBQV, capable of helping with the management of the risks associated with the operation in that aerodrome."}