{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-38j-bucharest", "date": "Dec 30, 2007 at 1127 LT", "type": "Boeing 737-300", "operator": "Tarom-2", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bucharest – Sharm el-Sheikh", "msn": "27181/2662", "yom": 1994, "flight_number": "RO3107", "city": "Bucharest-Otopeni-Henri Coandă", "zone": "București", "country": "Romania", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 117, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13497, "captain_hours_type": 5671, "copilot_hours": 2260, "copilot_hours_type": 1531, "aircraft_hours": null, "circumstances": "Around 1100LT, an airport maintenance team consisting of four people in two cars (Kia minivan) was cleared to enter runway 08R to perform maintenance work on the runway lighting system. Two of the men were working at about 600 meters from the threshold and the two other men were working at about 1500 meters from the threshold. Visibility at the time was poor due to thick fog. At 11:04 the runway was vacated by both vehicles due to landing traffic. At 11:06 they were recleared to enter the runway. At 11:25:13 flight ROT3107, a Boeing 737-300, was cleared to enter runway 08R for takeoff. The flight was cleared for takeoff at 11:26:07. Between 11:26:40 and 11:26:50 the control tower asked the maintenance workers if the runway was clear but got no reply. During the takeoff roll, at a speed of 90 knots, the aircraft collided with one of the van that was 'parked' about 600 metres from the threshold with its left engine and left main gear. The van was totally destroyed upon impact and the aircraft veered off runway to the left and came to rest 137 metres to the left of the centerline and 950 metres from the threshold. All 123 occupants evacuated safely and there were no injuries with ground maintenance personnel.", "probable_cause": "The accident occurred due to incorrect authorization of the turnover and aircraft takeoff RO3107 , without runway clearance. The following contributing factors were reported:\r\n- Error to allow the taking off of ROT 3107 was possible because of disruption in the activity of CTA EXE TWR, misperceptions regarding the clearance status of the runway and cumulative lack of coordination between CTA EXE TWR and CTA GND/TAXI to release the track,\r\n- Provisions RCAST and LVO were incompletely applied by the traffic controllers involved . Team supervisor who was responsible for direct supervision of applying this procedure did not notice this fact and did not take corrective action,\r\n- Progressive evidence bands used were inconsistent with the procedures and regulations,\r\n- When they realized that the track is not free, CTA EXE TWR and CTA GND / TAXI focused on calling on the radio frequency of beaconing team instead of initiating immediate cancellation of the takeoff by,\r\n- Transmission to crew aircraft \"stop the takeoff\",\r\n- Stop & start the runway lights,\r\n- Previous findings highlight gaps in the training of CTA personnel and the full and correct knowledge of procedures,\r\n- Mismanagement of human resources at TWR OTP , which led to an insufficient number of CTA personnel present in the shift and absence of the supervisor from operating room at the time the accident occurred, given that accepted shift personnel number was 4,\r\n- \"Rules of movement of vehicles and people ,\" \"Rules of organizing and development of ground-to-ground radio communications system with multiple access\" and \"Low Visibility Procedures Operations (LVO)\" were not strictly applied. They contain unrelated or unclear provisions that can be interpreted differently and make it difficult to apply them rigorously."}