{"url": "https://www.baaa-acro.com/crash/crash-consolidated-pb4y-2-super-privateer-near-estes-park-2-killed", "date": "Jul 18, 2002 at 1840 LT", "type": "Consolidated PB4Y-2 Privateer", "operator": "Hawkins-Powers-Aviation-2", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Mountains", "schedule": "Broomfield - Broomfield", "msn": "66260", "yom": 1944, "flight_number": "Tanker 123", "city": "Estes Park", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3658, "captain_hours_type": 1328, "copilot_hours": 6689, "copilot_hours_type": 913, "aircraft_hours": 8346, "circumstances": "The airplane was maneuvering to deliver fire retardant when its left wing separated. Aircraft control was lost and the airplane crashed into mountainous terrain. A witness on the ground took a series of photographs that showed the air tanker's left wing separating at the wing root and the remaining airplane entering a 45-degree dive to the ground in a counterclockwise roll. An examination of the airplane wreckage revealed extensive areas of preexisting fatigue in the left wing's forward spar lower spar cap, the adjacent spar web, and the adjacent area of the lower wing skin. The portion of the wing containing the fatigue crack was obscured by the retardant tanks and would not have been detectable by an exterior visual inspection. An examination of two other air tankers of the same make and model revealed the area where the failure occurred on the accident airplane was in a location masked by the airplane's fuselage construction. The airplane was manufactured in 1945 and was in military service until 1956. It was not designed with the intention of operating as a firefighting airplane. In 1958, the airplane was converted to civilian use as an airtanker and served in that capacity until the time of the accident. The investigation revealed that the owner developed service and inspection procedures for the airtanker; however, the information contained in the procedures did not adequately describe where and how to inspect for critical fatigue cracks. The procedures were based on U.S Navy PB4Y-2 airplane structural repair manuals that had not been revised since 1948.", "probable_cause": "The inflight failure of the left wing due to fatigue cracking in the left wing's forward spar and wing skin. A factor contributing to the accident was inadequate maintenance procedures to detect fatigue cracking."}