{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-382g-23c-hercules-kelly-afb-3-killed", "date": "Oct 4, 1986 at 0410 LT", "type": "Lockheed C-130 Hercules", "operator": "Southern-Air-Transport-2", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Kelly AFB - Robins AFB", "msn": "4391", "yom": 1970, "flight_number": "SJ015", "city": "Kelly AFB (ex Brooks Field, San Antonio)", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 7000, "captain_hours_type": 1400, "copilot_hours": 4100, "copilot_hours_type": 107, "aircraft_hours": 45622, "circumstances": "Southern Air Transport’s LOGAIR 15 flight, a Lockheed L-382G, was cleared for takeoff from Kelly Air Force Base, Texas, on an instrument flight plan to Robins Air Force Base, Georgia, at about 0405 on October 4, 1986. Visual meteorological conditions prevailed. There were three flightcrew members aboard the military contracted domestic cargo flight operating under 14 CFR Part 121. All communications with the air traffic control tower were routine. Radar recorded that the airplane reached an altitude of about 700 feet above ground level. Witnesses reported an abnormally steep climb attitude. followed by a turn and/or bank to the left, after which the airplane continued to roll to the left and struck the ramp area at about a 90° angle to the departure runway in a near-inverted attitude between two hangars and exploded. A severe ground fire ensued. All three flightcrew members were killed.", "probable_cause": "The probable cause of this accident was the use by the carrier of a non approved device designed to raise the elevator during loading operations which was not properly stowed by the flightcrew and which lodged in the Controls, preventing the flightcrew from controlling the airplane during takeoff."}