{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-g18s-lanseria", "date": "Mar 14, 2001 at 1240 LT", "type": "Beechcraft G18S", "operator": "Saxon Wings", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lanseria - Lanseria", "msn": "BA-474", "yom": 1959, "flight_number": null, "city": "Lanseria", "zone": "Gauteng", "country": "South Africa", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 19639, "captain_hours_type": 24, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 671, "circumstances": "The instructor was accompanied by a trainee pilot and two passengers (also pilots) on a local training flight and was in the process of doing type conversion training when the accident happened. On the third circuit after a touch and go landing on runway 06L, the right-hand engine failed soon after take-off. The aircraft was flown at low altitude in a left-hand circuit in an attempt to land onto runway 17. During this circuit the left-hand engine also failed. The aircraft collided with, and severed, three 11kV electrical conductors and executed a forced landing with the gear retracted to the North of FALA approximately 1 km from threshold of runway 17. The pilot only sustained minor injuries with no one else injured. The initial on-site inspection revealed that both front tanks, which were selected at the fuel tank selector, were empty. The pilot who was undergoing conversion training refueled the aircraft prior to the accident and stated that 70 litres of fuel was uplifted into each \"inboard auxiliary\" tank and that what he presumed to be the \"main\" tanks were filled to capacity. The instructor stated that upon his arrival, the pilot who refueled the aircraft told him that he had filled the \"mains\" and that the \"centre aux. tanks\" were partially filled. The instructor further stated that the \"main\" tanks were selected for the duration of the flight. The aircraft is equipped with three fuel tanks in each wing. These tanks are: Front, Rear Auxiliary and Auxiliary tanks. Only one fuel quantity gauge is installed in the aircraft. A seven position selector knob above the fuel quantity gauge determines the tank to which the gauge is connected which then indicates the amount of fuel in that respective tank. The left and right front tanks were selected on the fuel gauge selector knob.", "probable_cause": "Poor preflight inspection. Miscommunication between instructor and student pilot resulting in fuel mismanagement and depletion of the front tanks' fuel supply and subsequent engine failure. A contributory factor is that both the instructor and the student were relatively unfamiliar with the aircraft and its systems."}