{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-leningrad-1-killed", "date": "Feb 17, 1970 at 1850 LT", "type": "Lisunov LI-2", "operator": "Aviant", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Leningrad - Minsk - Kiev", "msn": "2 34 416 10", "yom": 1952, "flight_number": null, "city": "Leningrad-Shosseynaya", "zone": "Leningrad oblast", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7123, "circumstances": "The aircraft was engaged in a cargo flight from Leningrad to Kiev with an intermediate stop in Minsk-1, carrying a load of 1,151 kg of glue. Following a normal takeoff roll, the pilot-in-command started the rotation at a speed of 130 km/h. Immediately after liftoff, the aircraft had a tendency to veer left so the pilot compensate to the right when the tail wheel struck the ground 35 meters to the left of the runway and was torn off. The airplane continued for dozen meters then crashed into the snow some 245 meters to the left of the runway. All six occupants were seriously injured and the aircraft was destroyed. Few hours later, the radio operator died from his injuries. ", "probable_cause": "It was determined that the loss of control was the consequence of an overloaded aircraft by 687 kilos. The following factors were considered as contributing:\r\n- The rotation was completed at an insufficient speed considering the total weight of the aircraft,\r\n- The airplane was trimmed 3° down prior to takeoff, \r\n- The CofG was far aft, \r\n- The copilot and the flight engineer were overduty, \r\n- Reception, delivery and loading of cargo were made by the copilot and the flight engineer which adversely affected their working capabilities during takeoff."}