{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c-45h-expeditor-kodiak-1-killed", "date": "Jun 14, 2004 at 1137 LT", "type": "Beechcraft C-45 Expeditor", "operator": "Bellair", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Anchorage – Kodiak", "msn": "AF-60", "yom": 1952, "flight_number": null, "city": "Kodiak", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 18600, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The solo airline transport pilot departed on a commercial cargo flight in a twin-engine, turboprop airplane. As the flight approached the destination airport, visibility decreased below the 2 mile minimum required for the initiation of the approach. The pilot entered a holding pattern, and waited for the weather to improve. After holding for about 45 minutes, the ceiling and visibility had improved, and the flight was cleared for the ILS 25 instrument approach. After the pilot's initial contact with ATCT personnel, no further radio communications were received. When the flight did not reach the destination airport, it was reported overdue. A search in the area of an ELT signal located the accident airplane on a hilly, tree-covered island. A witness located to the north of the airport reported seeing a twin-engine turboprop airplane flying very low over the water, headed in an easterly direction, away from the airport. The witness added that the weather at the time consisted of very low clouds, fog, and rain, with zero-zero visibility. A local resident also stated that the weather conditions were often much lower over the water adjacent to the approach end of the airport than at the airport itself. The missed approach procedure for the ILS 25 approach is a climbing left turn to the south. About one minute after the accident, a special weather observation was reporting, in part: Wind, 060 degrees (true) at 11 knots; visibility, 2 statute miles in light rain and mist; clouds and sky condition, 500 feet broken, 900 feet broken, 1,500 feet overcast; temperature, 46 degrees F; dew point, 44 degrees F. According to FAA records, the company was not authorized to conduct single pilot IFR operations in the accident airplane, and that the accident pilot was the operator's chief pilot. Toxicology tests revealed cocaethylene and chlorpheniramine in the pilot's blood and urine. ", "probable_cause": "The pilot's failure to follow proper IFR procedures by not adhering to the published missed approach procedures, which resulted in an in-flight collision with tree-covered terrain. Factors contributing to the accident were a low ceiling, fog, rain, and the insufficient operating standards of company management by allowing unauthorized single pilot instrument flight operations. Additional factors were the pilot's impairment from cocaine, alcohol, and over the counter cold medication, and the FAA's inadequate medical certification of the pilot and follow-up of his known substance abuse problems. "}