{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-windhoek-3-killed", "date": "Nov 15, 2009 at 0658 LT", "type": "Cessna 208B Grand Caravan", "operator": "Aviation%20at%20Work", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Windhoek – Ondjiva – Lubango – Luanda", "msn": "208B-0513", "yom": 1996, "flight_number": null, "city": "Windhoek-Eros", "zone": "Khomas Region", "country": "Namibia", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 671, "captain_hours_type": 206, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12469, "circumstances": "On 15 November 2009, at about 0458Z, and aircraft a Cessna Caravan 208B, with a pilot and three passengers on board, took off from Eros Airport for a flight to Ondjiva, Lubango and Luanda. On board the aircraft were a substantial amount of cargo, which included building materials, meat, paints, bottles of wine etc. which was placed between and on top of the seats as well as in the cargo-pod. The cargo inside the cabin area was not secured. Shortly after takeoff from runway 19, the aircraft turned to the right and then pitched nose up. According to the passenger who survived, the aircraft entered into a left spin shortly after the nose pitched up and second later impacted with terrain, coming to rest facing the direction it took off from. The pilot and two passengers were fatally injured during the accident. One of the passengers survived the accident and was admitted to a local hospital with s spinal injury. The pilot-in-command was a holder of a commercial pilot licence. His medical certificate was valid with restrictions (to wear corrective lenses). Fine weather was reported during the time of the accident with surface wind of 180° at 8 knots.", "probable_cause": "The investigations revealed that during this operation the aircraft's take-off weight was exceeded by 629 pounds. The aircraft failed to maintain flying speed and stalled shortly after takeoff, rendering ground impact inevitable. \r\nThe following contributing factors were identified:\r\n- This was the pilot's first flight from Eros Airport therefore being unfamiliar with the airport and the environmental phenomena's associated with it (especially taking off from runway 19),\r\n- The pilot made one fundamental error in his weight calculation that he used the incorrect aircraft empty weight,\r\n- The cargo that was in the cabin was packed between and underneath and on top of the seats and was not secured, \r\n- The aircraft took off from runway 19, which was an upslope runway,\r\n- Taking off from runway 19 the terrain kept rising with mountains straight ahead as well as to the left and right, \r\n- The pilot retracted the flaps shortly after rotation, which resulted in an attitude change and performance (aircraft lost altitude), which should be regarded as a significant contributory factor to this accident, \r\n- The pilot was observed to turn to the right shortly after takeoff, which increased the drag on the aircraft as well as the stall speed, \r\n- Harsh anti-erosion rubber paint that was sprayed onto the leading edge of the wings resulted in an increased stall speed, \r\n- Inadequate oversight by the regulatory authority should be regarded as a significant contributory factor to this accident. "}