{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154b-2-chita", "date": "Oct 8, 1980", "type": "Tupolev TU-154", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Almaty - Barnaul - Chita - Khabarovsk", "msn": "79A321", "yom": 1979, "flight_number": null, "city": "Chita-Kadala", "zone": "Zabaykalsky Krai", "country": "Russia", "region": "Asia", "crew_on_board": 10, "crew_fatalities": 0, "pax_on_board": 174, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On final approach to Chita-Kadala Airport, the aircraft was too high on the glide and the captain did not want to initiate a go-around. So, he pushed on the control column and the aircraft nosed down and struck the ground 240 meters past the runway 11 threshold. Upon impact, the nose gear was torn off. The aircraft continued for few hundred meters then veered off runway to the right and came to rest in flames in a grassy area, broken in two. All 184 occupants were rescued, among them four were injured. The aircraft ", "probable_cause": "Wrong approach configuration on part of the crew who failed to perform a go around manoeuvre while the position of the aircraft on the glide was against published procedures. The following contributing factors were reported:\r\n- The crew made an incomplete approach briefing, \r\n- The crew failed to follow the points mentioned on the approach charts prior to reach the approach circuit,\r\n- The crew failed to follow the procedures related to flaps and undercarriage,\r\n- The altitude of the aircraft over the inner marker was 1,030 meters instead of the prescribed 750 meters, \r\n- The speed of the aircraft was 90 km/h over the prescribed approach speed, \r\n- Wrong decisions on part of the crew, \r\n- Poor crew coordination. "}