{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6-mobile-46-killed", "date": "Feb 14, 1953 at 1710 LT", "type": "Douglas DC-6", "operator": "National-Airlines-4", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Miami – Tampa – New Orleans", "msn": "43057", "yom": 1947, "flight_number": "NA470", "city": "Mobile", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 41, "pax_fatalities": 41, "other_fatalities": 0, "total_fatalities": 46, "captain_hours": 17000, "captain_hours_type": 4110, "copilot_hours": 4485, "copilot_hours_type": 184, "aircraft_hours": 15994, "circumstances": "Flight 470 departed Tampa at 1543LT. Its flight plan, filed previously at Miami, specified a cruising altitude of 14,500 feet according to Instrument Flight Rules and an estimated elapsed tune of two hours for the direct 498 statute miles to New Orleans. Included among the weather data attached to the captain's copy of the flight plan was a forecast of thunder-storms attended by moderate to severe turbulence in the vicinity of New Orleans, the destination. The CAA Air Route Traffic Control cleared the flight at the 14,500-foot level direct to New Orleans. Flight 470 passed over NA-3 at its cruising altitude of 14,500 feet at 1614, estimating over NA-2 at 1642, and so reported to Radio-Tampa one minute later. At that time the flight also gave the local weather: broken clouds at 6,000 feet, broken clouds at 20,000 feet and temperature 4 degrees Centigrade. Meanwhile, Flight 917 landed at New Orleans at 1612. It reached the ramp at 1617 and at 1624, its captain sent the following message to Miami flight Control and to all company stations between New Orleans and Jacksonville, Florida, including Pensacola, Florida: \"Flight 917 advises extreme turbulence all altitudes just east of New Orleans.\" At 1636, the captain sent the following message to the same stations: \"Reference extreme conditions stop at present time severe turbulence No. 1. check (NA-1) to New Orleans weather looks better to west of New Orleans.\" At 1649, Flight 470 reported passing over NA-2 at 1645 at 14,500 feet, and estimated being over NA-l at 1710. It also reported, \"Thunderstorms all quadrants . . .\" Pensacola radio received and acknowledged this message, and advised the flight of \"severe turbulence\" between NA-l and New Orleans as reported by Flight 917. Flight 470 acknowledged, asked what altitude Flight 917 reported turbulence, and was informed \"severe turbulence at all altitudes.\" Again Flight 470 acknowledged. At 1654, the flight advised Pensacola that it was reducing power because of turbulence and five minutes later requested Air Route Traffic Control clearance to descend from 14,500 feet to 4,500 feet. This was granted within a minute or so, with the provision that descent between 10,000 feet and 8,000 feet be visual. At 1703, the Flight advised Pensacola of passing through 10,000 feet, and at 1712 (recorded), advised that it had reached 4,500 feet at 1710. Pensacola repeated this message back to the flight and gave it the 1648 New Orleans special weather. This was: measured 800, overcast, visibility 10 miles, wind north-northeast 25 m.p.h., with gusts to 34, the altimeter 29.61; barometer unsteady. The flight acknowledged and there were no further radio contacts. An attempt by New Orleans at 1718 to contact Flight 470 was unsuccessful, as were subsequent attempts by several other stations, and at 1840 the Coast Guard's air-sea rescue service was alerted. Low clouds and heavy seas hampered the search both by air and sea. However, on the following day (February 15) floating debris and 17 bodies were recovered from a fairly localized area in the Gulf of Mexico at about 30 degrees 38' North Latitude and 87 degrees 46' West Longitude. This position is approximately 38 miles to the right of the aircraft's direct course and is about 20 miles southeast of Mobile Point at the easterly mouth of Mobile Bay. Two wrist watches on bodies were impact stopped at 1710LT.", "probable_cause": "The Board determines that the probable cause of this accident was the loss of control followed by the in-flight failure and separation of portions of the airframe structure while the aircraft was traversing an intense frontal-wave type storm of extremely severe turbulence, the severity and location of which the pilot had not been fully informed. The following findings were pointed out:\r\n- After passing the NA-2 check point, the flight reported thunderstorms in all quadrants,\r\n- The flight requested and was granted clearance to descend to 4,500 feet due to turbulence,\r\n- Its last message reported reaching 4,500 feet at 1710LT,\r\n- The aircraft penetrated a storm system of unusual severity,\r\n- Tornadic conditions including high winds, violent gusts, and possible waterspouts were occurring in the storm system,\r\n- The storm's movement had not been adequately anticipated in current weather forecasts,\r\n- Although a special Severe Weather Bulletin issued at Washington, D.C., was received by National Airlines and the Weather Bureau at Miami and New Orleans, no U. S. Weather Bureau advisory weather reports were issued to ARTC to report the unexpected development and movement of the storm to en route flights; nor did National Airlines attempt to relay this information to Flight 470,\r\n- Flight 470 entered the storm system without full knowledge of its severity,\r\n- The aircraft's structure failed at a moment when, in all probability, gusts loads combined with violent maneuvering loads were being imposed to maintain or regain control,\r\n- The main wreckage was located in the Gulf of Mexico 3.8 miles offshore and about 52 miles to the right of course; the left wing was found 2,100 feet from the main wreckage,\r\n- Examination of the recovered parts revealed no indication of malfunctioning control, fatigue failure, fire, explosion, or lightning strike while in flight."}