{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c18s-near-chepo-1-killed", "date": "Aug 1, 1967", "type": "Beechcraft C18S", "operator": "Aerovias Darienitas SA", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Panama City - Panama City", "msn": "7730", "yom": 1944, "flight_number": null, "city": "Chepo", "zone": "Panamá", "country": "Panama", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "High over the Panama jungle one August afternoon flew a twin engine plane with seven people aboard. The six passengers had been surveying for a possible sea-level canal across the Darien Province of Panama. They were tired and very anxious to get back to Panama City. Then one engine sputtered and quit. They became alarmed but relaxed when they noticed the plane was holding altitude. A small jungle airfield was not far away. The passengers saw the airstrip and they felt sure there would be a safe landing. Soon the plane was past it and the passengers wanted to know what was going on. The pilot said, \"I am going to fly to Panama City.\" The passengers begged him to land and he refused. The pilot noticing the concern of the passengers and wanting to get the plane back to Panama City for repairs, tried to start the dead engine. With all hopeful eyes fixed on the prop, it turned over a few times. Suddenly the other engine stopped. Down they went into the mangrove swamp. Later in the afternoon a report went out that a twin engine plane was missing. There were two radios on board with direct connection to the home office and an air traffic control tower. The weather was clear. No one heard any distress call. Pilots in other planes flew over jungle airfields in the area and did not see the missing plane. The search went on for five days when one pilot saw something shinning for a moment in the mangrove swamp. He circled around again, hoping to get another glimpse of whatever it was he saw. When he was over the spot, the pilot saw the missing plane hidden under the jungle trees. Within minutes, the U.S. Air Force flew a rescue party in by helicopter. The passengers were badly broken up and hungry, but still alive. After crashing, the pilot stepped out of the plane and sank up to his waist in the muddy swamp. He lived in the mud for three days until he died. The passengers were unable to help because of their broken bones and they feared the same fate. The pilot was trying to save the company money by flying the plane back to Panama City. If he landed at a jungle airfield, the cost of repairs would skyrocket. Men, tools, and parts would have to be flown to the plane.\n\r\nSource : Robert L. Webb, Goose Creek, South Carolina\n", "probable_cause": "Double engine failure. Investigators found the company did minimum maintenance on their planes."}