{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-188pf-electra-rea-point-32-killed", "date": "Oct 30, 1974 at 0020 LT", "type": "Lockheed L-188 Electra", "operator": "Panarctic%20Oils", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Calgary – Edmonton – Rea Point", "msn": "1141", "yom": 1961, "flight_number": "PAO416", "city": "Rea Point (Melville Island)", "zone": "Nunavut", "country": "Canada", "region": "North America", "crew_on_board": 4, "crew_fatalities": 2, "pax_on_board": 30, "pax_fatalities": 30, "other_fatalities": 0, "total_fatalities": 32, "captain_hours": 8143, "captain_hours_type": 1792, "copilot_hours": 5100, "copilot_hours_type": 160, "aircraft_hours": 19133, "circumstances": "Lockheed L-188 Aircraft CF-PAB operated as Panarctic flight 416 and departed Calgary International Airport at 18:05 hours 29 October 1974. The aircraft was on a routine positioning flight to Edmonton with a pilot-in-command, co-pilot and flight engineer on board. The 30-minute flight was uneventful with no unserviceabilities reported by the crew. The aircraft was prepared for the continuing flight north with the loading of 20000 lb of baggage and freight and 21000 lb of jet B fuel. The aircraft pilot-in-command and flight engineer were replaced by those scheduled for the Edmonton to Rea Point leg. The pilot-in-command received a weather briefing; an IFR flight plan was filed at an initial cruising altitude of 18000 ft with Pedder Point as the alternate. The estimated time en-route was 4 hours 12 minutes. After loading 30 passengers and a fourth crew man, the loadmaster/flight attendant, the aircraft departed the Edmonton International Airport at 20:04 hours. The flight proceeded uneventfully, cruising at 18 000ft to Fort Smith where it was cleared to flight level 210. The aircraft reported over Byron Bay at 23:04 hours with an estimated time of arrival at Rea Point of 00:16. About 100 miles north of Byron Bay the aircraft was cleared to flight level 250. Radio contact was established with Rea Point about 150 miles out and a descent was started for a straight-in VOR/DME approach to runway 33. The descent was smooth except for some turbulence at 4000 ft. The aircraft levelled at 17 miles DME from Rea Point at 2000 ft for a period of 1 minute 45 seconds. The aircraft then slowly descended to about 875 ft ASL at 6 miles DME. A call was made to Rea Point advising them of the DME range on final. There was light turbulence. Fifteen hundred horsepower was selected on the engines; both the VHF navigation radios were selected to the Rea Point VOR frequency and both ADF's were selected to the Rea Point OX nondirectional beacon. Both cockpit barometric altimeters were set to 29.91 in of mercury, the latest Rea Point setting. The airspeed was indicating 150 kt which, with a 30 kt headwind component, resulted in a ground speed of 120 kt. The pre-landing check had been completed, 100 per cent flap selected and the landing gear was down. The landing lights were extended but were off, the wing leading edge lights as well as the alternate taxi lights were on. Glare had been experienced from external lights early in the descent from 10000 ft, but not thereafter. There was no pre-landing briefing conducted by the pilot-in-command. The flight engineer was able to see what appeared to be open water below with ice. The co-pilot set his radio altimeter warning to 450 ft and the pilot-in-command set his to 300 ft. When the warning light came on the co-pilot's radio altimeter, he advised the pilot-in-command. As the descent continued through the minimum descent altitude of 450 ft, the co-pilot reset his radio altimeter to 300 ft and so advised the pilot-in-command. The aircraft was still in a shallow descent. At 300 ft radio altitude the co-pilot checked the DME reading as 3 miles, saw a dark area of open water and an ice line and reported to the pilot-in-command that they seemed to be approaching an ice ridge and that they had visual contact. The pilot-in-command reset his radio altimeter to about 150 ft. Also, close to this time the pilot-in-command said he believed they were on top of a layer of cloud, repeated the statement, following which he retarded the throttles and pushed forward on the control column with sufficient force to produce perceptible negative G. The rate of descent increased rapidly to between 1700 and 2000 ft a minute. The co-pilot shouted at the pilot-in-command reporting their descent through 200 ft at 2 miles DME but there was no response. The flight engineer and the co-pilot both called through 50 ft without an observed reaction from the pilot-in-command. The co-pilot reached for the right side power levers and found the flight engineer's hands already on them. On impact, the cockpit area broke away from the remainder of the fuselage and with the cargo continued along the ice surface for 900 ft. After the cockpit came to rest, the flight engineer undid his seat belt and saw both the pilot-in-command and co-pilot in their seats. The co-pilot although injured was able to undo his seat belt and the flight engineer pulled him on to the ice before the cockpit section sank completely.", "probable_cause": "The following findings were reported:\r\n- The approach was continued below the company approved minimum descent altitude, \r\n- The pilot-in-command reacted inappropriately to a visual cue and suddenly initiated the final rapid descent, \r\n- Partial incapacitation of the pilot-in-command was a factor in the failure to recover from the high rate of descent, \r\n- Crew coordination in the cockpit in the final stages of the flight was inadequate, \r\n- No company Flight Operations Manual or similar document was available to adequately prescribe the aircraft crew's duties and responsibilities, \r\n- This operation was in the private category and was not operated or required to operate to the established commercial standards, \r\n- The established aerodrome emergency response procedures were inadequate. "}