{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-klawock-8-killed", "date": "Dec 9, 1982 at 1310 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Tyee%20Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Ketchikan - Craig", "msn": "906", "yom": 1956, "flight_number": null, "city": "Klawock", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 3683, "captain_hours_type": 1105, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12735, "circumstances": "At 1236 the flight departed Ketchikan seaplane base with a special VFR clearance and at 1240 reported clear of the control zone. The next and last transmission by the pilot was made to the company via FM radio at about 1340. This report was issued in the vicinity of Happy Harbor (passing over Kasaan Island) and was the approximate mid-point of the flight to Craig. Witnesses reported seeing the aircraft flying southwest over Twelvemile arm toward Hollis. Upon reaching Hollis the flight would be expected to turn west and cross inland over Prince of Wales Island until reaching the west shoreline and thence directly to Craig. There was a fog bank about 2 miles prior to Hollis in Twelvemile arm and the aircraft was observed to reverse course as the weather was approached and proceed north. The aircraft was lost from sight due to trees and rapidly upsloping terrain. An increase in engine sound was heard prior to the crash. Witnesses described the clouds as essentially broken with bases at about 1,000 feet over the water and obstructing the tops of some of the higher islands. All eight occupants were killed in the crash.", "probable_cause": "Occurrence #1: in flight collision with terrain/water\r\nPhase of operation: maneuvering - turn to reverse direction\r\nFindings\r\n1. (f) weather condition - fog\r\n2. (f) weather condition - clouds\r\n3. (f) terrain condition - mountainous/hilly\r\n4. (f) terrain condition - rising\r\n5. (c) in-flight planning/decision - improper - pilot in command"}