{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-canaima-1-killed", "date": "Apr 17, 2009 at 1545 LT", "type": "Cessna 208B Grand Caravan", "operator": "Linea%20Turistica%20Aerotuy", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Canaima – Ciudad Bolívar", "msn": "208B-0695", "yom": 1998, "flight_number": null, "city": "Canaima", "zone": "Bolívar", "country": "Venezuela", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3404, "captain_hours_type": 1021, "copilot_hours": 269, "copilot_hours_type": 59, "aircraft_hours": 15753, "circumstances": "After takeoff from runway 36 at Canaima Airport, while in initial climb, the single engine aircraft encountered difficulties to gain height. It collided with power lines and crashed in bushes located 80 metres past the runway end. A young boy aged 6 was killed while all other occupants were injured, seven seriously. The aircraft was destroyed.", "probable_cause": "The accident occurred as a result of the inability of the aircraft to take off, affected by the tailwind and water puddles that covered part of the runway, which did not allow speed to build up, crashing into the ground. It is considered that the most likely cause of the accident was mismanagement by the crew, in the sense of failing to make adequate planning and analysis, coupled with overconfidence and lack of identification of hazardous conditions at that time of takeoff. Based on our [JIAAC] investigations, we can infer that there were several contributing causes for the occurrence of this accident. In this order, we can state the following:\r\n- Adverse weather and tailwind conditions associated with the phenomenon.\r\n- Incorrect management by the crew to use only the last third of the runway with the meteorological conditions prevailing at that time.\r\n- Failure of the aerodrome administration to identify and correct poor drainage of the runway.\r\n- Failure of the Autoridad Aeronáutica to monitor safety.\r\n- Rejection by the crew of the concatenated form in which the factors involved in this event developed.\r\nAfter all the analysis to different causes involved in this accident, we can point to as the main Causal Factor: Human Factor, due to the mismanagement by the flight crew upon takeoff in these conditions. Physical and Material factors included everything related to the prevailing weather conditions, road conditions and lack of services at the aerodrome by the authorities; all of them are considered Contributing Factors."}