{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1011-tristar-200-riyadh-301-killed", "date": "Aug 19, 1980 at 2205 LT", "type": "Lockheed L-1011 TriStar", "operator": "Saudia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Karachi - Riyadh - Jeddah", "msn": "193U-1169", "yom": 1979, "flight_number": "SV163", "city": "Riyadh-King Khaled", "zone": "Manţiqat ar Riyāḍ (منطقة الرياض)", "country": "Saudi Arabia", "region": "Asia", "crew_on_board": 14, "crew_fatalities": 14, "pax_on_board": 287, "pax_fatalities": 287, "other_fatalities": 0, "total_fatalities": 301, "captain_hours": 7674, "captain_hours_type": 388, "copilot_hours": 1615, "copilot_hours_type": 125, "aircraft_hours": 3023, "circumstances": "About 2108LT, the airplane departed Riyadh Airport en route to Jeddah, Saudi Arabia. Six minutes and 54 seconds after takeoff, while climbing to FL350, visual and aural warnings indicated smoke in the aft cargo compartment C-3. Climbing through FL220, a return to Riyadh was initiated. About two minutes later smoke was noted in the aft of the cabin, and passengers were panicking. At 18:25:26 the no. 2 engine throttle was stuck. The flight landed at about 2136LT and then taxied clear of the runway and came to a stop on an adjacent taxiway. While parked on the taxiway, the aircraft was destroyed by the fire and the three hundred and one persons on board the flight were killed. \r\nSurvival aspects:\r\nThe accident was survivable. The first door was opened about 23 min after all engines had been shutdown. The first rescue attempt was conducted at L-1 door. Most witness statements agree in content but differ slightly in the time factor element. A witness who participated in the first two efforts to open the doors stated that he was aboard fire truck n°4 was it was positioned near the left rear portion of the aircraft. He observed thick white smoke flowing from the bottom rear fuselage. At that time the aircraft engines were still running. A few seconds later, he observed smoke near the top of the fuselage, forward of the n°2 engine inlet. According to him, this smoke was followed almost immediately by flames in the same area. As the driver of n°4 started applying agent via the monitor, the witness dismounted and moved toward exit L-1. His route was outboard of n°1 engine which he thought was still running. On approaching L-1, he observed the fire chief and other people attempting to reach the L-1 emergency handle via a ladder which was placed on top of fire truck n°6. While fire personnel steadied the ladder, he climbed up and pulled the emergency handle. He was not certain if the door moved or not. An additional effort was attempted while he held onto and rode the monitor. While on the monitor, he pushed on the door to no avail. Most of :he group then moved to R-2 where another ladder had been positioned by other firemen. A firemen then climbed the ladder, operated the handle and the door opened in the emergency mode. The cabin was observed to be full of smoke and no life was observed nor were any human sounds heard. R-2 door was opened at 1905, 26 min after the aircraft came to a stop and 23 min after the shutdown of all engines. Shortly after (about 3 min) R-2 was opened, flames were seen progressing forward from the rear section of the cabin. ", "probable_cause": "The initiation of a fire in the C-3 cargo compartment. The source of the ignition of the fire is undetermined. Factors contributing to the fatal results of this accident were:\r\n- The failure of the captain to prepare the cabin crew for immediate evacuation upon landing and his failure in not making a maximum stop landing on the runway, with immediate evacuation, \r\n- The failure of the captain to properly utilize his flight crew throughout the emergency,\r\n- The failure of C/F/R headquarters management personnel to ensure that its personnel had adequate equipment and training to function as required during an emergency."}