{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-221f-accra-10-killed", "date": "Jun 2, 2012 at 1910 LT", "type": "Boeing 727-200", "operator": "Allied%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lagos - Accra", "msn": "22540/1796", "yom": 1982, "flight_number": "DHC111", "city": "Accra-Kotoka", "zone": "Greater Accra", "country": "Ghana", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 10, "total_fatalities": 10, "captain_hours": 14000, "captain_hours_type": 1464, "copilot_hours": 22463, "copilot_hours_type": 4180, "aircraft_hours": 40251, "circumstances": "On 2nd June, 2012 at 1828hrs Allied Air Ltd Flight DHV 111, a Boeing 727-221 Cargo aircraft, Registration: 5N-BJN, departed Murtala Muhammed International Airport, Ikeja, Lagos-Nigeria to Kotoka International Airport, estimating Accra, Ghana at 1904hrs, en-route to Abidjan. While taxiing for take-off, the Flight Engineer observed that the CSD amber light (caution) had illuminated on the panel. With the Captain’s permission, it was disconnected. The flight was cleared Flight Level 240 and to maintain by Accra Area Control on 130.9MHz. The Flight was operating under Instrument Flight Rules (IFR) conditions and the flight was turbulent, the aircraft was cruising at a speed of 280kts which is the recommended turbulence speed. On the descent into Accra, the aircraft was cleared by Accra Approach on 119.5MHz initially to Flight Level 50 and later cleared to 2000ft. It was again instructed to climb to 3000ft due to high ground. On arrival at Accra, the Captain flew an Instrument Landing System (ILS) coupled approach, until he saw the runway. He then disconnected the autopilot at 500ft and manually flew the aircraft. After disconnecting the auto-pilot, he came into heavy IMC conditions in rain. The aircraft experienced an unstable approach at a high speed of 167kts and landed with a wind of 050/15kts at 154 kts and about 5807 ft from Runway 21 in nil visibility. The crew deployed thrust reversers and applied the normal brakes as well as the emergency pneumatic brakes but these actions were ineffective to stop the aircraft. Normally deploying the thrust reversers or applying the brakes would bring the nose wheel down. However, the nose gear was kept up. The speed brakes were not deployed. The crew reported seeing red lights rushing towards them soon after the main wheels touched the ground for the landing run. The aircraft nose gear never touched the ground until the aircraft went over the fence wall. A Lufthansa Flight DLH 566 operated on behalf of Lufthansa (LH) by Private Air which had landed earlier at 1902hrs reported a wind of 050/15kts and visibility of 3800m in rain. From the 2nd intersection where DLH 566 had stopped, ready to backtrack Runway 21, the crew observed Allied Air appeared to have landed at very high speed when the aircraft went past and could not determine whether the aircraft was taking off. A Lufthansa ground engineer who was waiting at the intersection to receive DLH 566 indicated the approximate touchdown point of DHV 111. Both the controller at the Tower and the Marshaller in the “follow me” vehicle waiting at the 1st Intersection saw Allied Air land between the 1st and 2nd intersections. The FDR indicated that the aircraft landed 4000 ft to the end of Runway 21. The full length of Runway 21 is 3403 m (11,162ft for take-off) but available for landing is 2990 m (9,807 ft). The FDR readout showed that the aircraft landed at 150 kts, and at 1.6 G, 5807 ft from the beginning of Runway 21 and 4000ft from the threshold of the Runway 03. The runway surface condition for braking as described by DLH crew was good. Shortly after Turkish Airline (THY 629) had landed, DLH 566 also landed followed by DHV 111. The aircraft over-run the runway and destroyed the Threshold Lights and the Approach lights on Runway 03. It knocked out the ILS Localizer transmitter structure and mounts, broke through the airport perimeter wall. The aircraft crossed Giffard Road, collided with a passenger mini bus killing all ten (10) persons on board. It uprooted a tree by the road side before finally coming to a stop at an open space near El-Wak Sport Stadium. The Emergency Locator Transmitter (ELT) was triggered by the impact.  The right side of a taxi cab on the road was grazed by flying debris from the localizer transmitter structures carried along by the right wing of the aircraft. The leading edge of the wing was extensively damaged. The aircraft came to a rest outside the airport perimeter wall 1171 ft (350m) from the Threshold of Runway 03, heading 215° southwest, coordinates 05 35 13.67N 000o 10 29.20W. The four (4) crew members sustained minor injuries. The aircraft and the mini bus were all destroyed. At 1910hrs, RFFS was alerted by the Tower Controller through the crash alarm bell. It took 9 minutes for the firemen to get to the crash site. The Airport was closed for 45minutes during which runway inspection was carried out. No pool of water was found anywhere on the runway. Approximately one hour after the aircraft had over-run the runway, the Airport was re-opened to traffic. Other airlines including KLM and British Airways, landed. Even though the Technical Log Book had no records of deferred defect, the Captain in an interview said the windshield wipers where switched on during the landing phase but were unable to clear the rain. It was observed during the investigation that the windshield wipers were rather ¾ switched on.", "probable_cause": "The probable causes of the accident were:\r\nThe decision of the Captain to continue with the landing instead of aborting at the missed approach point especially when he could hardly see through the windshield and when he did not know how far he had gone down the runway because of the rain and the tail wind components.\r\nContributory factors:\r\na. The Captain disconnected the auto-pilot and flew the aircraft manually in an unstable approach.\r\nb. The Captain landed the aircraft at 4000ft to the threshold of Runway 03, 6060ft from Runway 21. He could not stop within the available distance.\r\nc. The Captain chose to land with a tailwind of 050/15Kts in excess of maximum allowable tailwind of 10Kts.\r\nd. The crew concentrated on tracking the Localizer rather than watching for threshold and runway edge lights. They suffered from fixation.\r\ne. The Captain did not deploy speed brakes on landing."}