{"url": "https://www.baaa-acro.com/crash/crash-rockwell-gulfstream-695-jetprop-980-ogawa-2-killed", "date": "Mar 24, 2003 at 1052 LT", "type": "Rockwell Gulfstream 695 Jetprop 980", "operator": "Asia%20Air%20Survey", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Tokyo-Chōfu - Tokyo-Chōfu", "msn": "695-95044", "yom": 1980, "flight_number": null, "city": "Ogawa", "zone": "Kantō", "country": "Japan", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 11473, "captain_hours_type": 300, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6029, "circumstances": "The aircraft departed Chofu Aerodrome at 10:26 (JST) with the captain and a mechanic on board for a company test flight prior to an airworthiness certification inspection. During the flight at around 10:52, the aircraft crashed into woods at Nishine, Kamiose, Ogawa, Naka County, Ibaraki Prefecture. The two persons on board the aircraft, the captain and the mechanic, both sustained fatal injuries. A fire broke out and the aircraft was destroyed. ", "probable_cause": "It is estimated that in this accident, while the aircraft was on a company test flight prior to an airworthiness certification inspection, it entered spin and because it was unable to recover, it crashed, destroying the fuselage and killing the captain and the passenger. Because the left engine’s oil tank cap had not been normally locked, abnormal engine oil temperature and pressure occurred, and it is estimated that the aircraft’s airspeed decreased to near the stall speed. The captain increased power on the right engine to regain airspeed, which induced a yawing moment. It is considered possible that the aircraft then entered a spin because either it was uncontrollable due to being below the minimum control speed and safe one engine inoperative speed, or the captain had been incapacitated by hypoxia and was unable to cope with the loss of airspeed. \r\nThe following are considered possible reasons as to why the aircraft did not recover from the spin; however, the precise cause could not be clarified.\r\n① Because the aircraft type is prohibited from spins, the captain could not have been practiced in spin recovery for the aircraft.\r\n② The spin developed without being arrested in the early stages, until flight conditions exceeding the aircraft’s design limits so that the aircraft could not be recovered by normal control forces.\r\n③ The aircraft was in a state of spinning without a reduction of engine power, which made recovery difficult.\r\n④ The captain had been incapacitated. "}