{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-277b-shedden-20-killed", "date": "Oct 30, 1941 at 2210 LT", "type": "Douglas DC-3", "operator": "American-Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "La Guardia – Newark – Buffalo – Detroit – South Bend – Chicago", "msn": "2207", "yom": 1940, "flight_number": "AA001", "city": "Shedden", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 16, "pax_fatalities": 16, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": 5929, "captain_hours_type": 3702, "copilot_hours": 1065, "copilot_hours_type": 25, "aircraft_hours": 11027, "circumstances": "While descending to Detroit, the crew was instructed by ATC to abandon the approach due to poor weather conditions. The crew completed several circuits over Detroit to expect a weather improvement without success. After several minutes, due to fuel shortage, the captain decided to divert to London Airport, Ontario. Suddenly, the airplane entered an uncontrolled descent and crashed at an angle of 70° in an open field. All 20 occupants were killed. ", "probable_cause": "During its descent the airplane apparently was partially but not completely out of control. There was no fire in or about the airplane prior to impact. No evidence of sabotage was discovered. There was no power plant failure prior to the accident, and the engines were functioning normally at the time the airplane struck the ground. Nothing was found to indicate that there had been any structural failure or failure of the control system of the airplane. As a result of the complete destruction of some portions of the airplane, however, it is impossible to eliminate completely the possibility that such failure occurred. Now, therefore, the Board finds that the evidence presently available and in possession of the Board is not sufficient to permit determination of the probable cause of this accident.\n\n"}