{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601-lakeway-6-killed", "date": "Aug 3, 2004 at 1159 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Aviation Flight Standards", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Lakeway – Oklahoma City", "msn": "61-0272-058", "yom": 1976, "flight_number": null, "city": "Lakeway", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 3500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4483, "circumstances": "The commercial pilot, who managed the airplane and jointly owned it with one of the passengers, departed from a 3,930-foot-long, asphalt runway on a warm day. Weight and balance calculations, which investigators derived from estimated weights for total fuel, passengers, and cargo loads, determined that the airplane was likely within center of gravity limitations and about 208 pounds below its maximum gross weight. One witness stated that the airplane became airborne near the end of the runway before it began a shallow climb and clipped small branches on the tops of trees that were about 30 feet tall. That witness and others observed that the airplane continued past the trees, made a steep bank to the left, rolled inverted, and nose-dived to the ground. The witnesses' descriptions of the airplane's flightpath and the examination of the debris path and wreckage at the accident site are consistent with an impact following an aerodynamic stall. According to calculations performed using the airplane's published performance data chart, for the airplane's configuration and estimated weight and the density altitude conditions at the time of the accident, the airplane would have required about 3,800 feet on a paved, level runway to clear a 50-foot obstacle with the pilot using the short-field takeoff technique. Although the chart does not make any allowances for an upsloping runway or provide data for a 30-foot obstacle, the runway slope is slight (a 27-foot rise over the entire length) and likely did not significantly increase the airplane's takeoff roll, and interpolation of the data revealed no significant distance differences for the shorter obstacle. However, according to the chart, the 3,800-foot distance is contingent upon the pilot holding the airplane's brakes, applying full engine power with the brakes set, and then releasing the brakes to initiate the takeoff roll. In addition, the airplane's ability to achieve its published performance parameters (which are derived from test flights in new airplanes) can be degraded by a number of factors, such as pilot deviations from the published procedures, reduced engine performance, or increased aerodynamic drag associated with minor damage and wear of the airframe. It could not be determined where on the runway the pilot initiated the takeoff roll or at what point full engine power was applied. However, because the runway was only 130 feet longer than the airplane required (according to its published performance data), there was little margin for any deviations from the published takeoff procedure. Although examination of the engines, propellers, and related systems revealed no evidence of precrash anomalies, postaccident damage precluded engine performance testing to determine whether the engines were capable of producing their full-rated power. Therefore, the significance of maintenance issues with the airplane (in particular, a mechanic's assessment that the turbochargers needed to be replaced and that the airplane's required annual inspection was not completed) could not be determined with respect to any possible effect on the airplane's ability to perform as published. A review of Federal Aviation Administration (FAA) and insurance records revealed evidence that the pilot may have been deficient with regard to his ability to safely operate a PA 60-601P. For example, according to FAA records, as a result of an April 2004 incident in which the pilot landed the accident airplane on a wet grassy runway with a tailwind, resulting in the airplane going off the runway and striking a fence, the FAA issued the pilot a letter of reexamination to reexamine his airman competency. However, the pilot initially refused delivery of the letter; he subsequently accepted delivery of a second letter (which gave the pilot 10 days to respond before the FAA would suspend his certificate pending compliance) and contacted the FAA regarding the matter on Monday, August 2, 2004 (the day before the accident), telling an FAA inspector to \"talk to his lawyer.\" In addition, as a result of the same April 2004 incident, the pilot's insurance company placed a limitation on his policy that required him to either attend a certified PA-60-601P flight-training program before he could act as pilot-in-command of the accident airplane or have a current and properly certificated pilot in the airplane with him during all flights until he completed such training. There was no evidence that the pilot adhered to either of the insurance policy requirements. In addition, the FAA had a previous open enforcement action (a proposed 240-day suspension of the pilot's commercial certificate) pending against the pilot for allegedly operating an airplane in an unsafe manner in September 2003; that case was pending a hearing with an NTSB aviation law judge at the time of the accident. Although the FAA's final rule for Part 91, Subpart K, \"Fractional Ownership Operations,\" became effective on November 17, 2003, the regulations apply to fractional ownership programs that include two or more airworthy aircraft. There was no evidence that the pilot had a management agreement involving any other airplane; therefore, the rules of Part 91, Subpart K, which provide a level of safety for fractional ownership programs that are equivalent to certain regulations that apply to on-demand operators, did not apply to the accident flight. In the year before the accident, the FAA had conducted a ramp check of the pilot and the accident airplane and also conducted an investigation that determined there was not sufficient evidence that the pilot was conducting any illegal for-hire operations. ", "probable_cause": "The pilot's failure to successfully perform a short-field takeoff and his subsequent failure to maintain adequate airspeed during climbout, which resulted in an aerodynamic stall."}