{"url": "https://www.baaa-acro.com/crash/crash-avro-748-1-105-lerwick-17-killed", "date": "Jul 31, 1979 at 1601 LT", "type": "Avro 748", "operator": "Dan-Air%20Services", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Lerwick - Aberdeen", "msn": "1542", "yom": 1962, "flight_number": "DA0034", "city": "Sumburgh", "zone": "Shetland (Zetland)", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 44, "pax_fatalities": 15, "other_fatalities": 0, "total_fatalities": 17, "captain_hours": 6487, "captain_hours_type": 4403, "copilot_hours": 4563, "copilot_hours_type": 57, "aircraft_hours": 29007, "circumstances": "The aircraft was engaged on a series of charter flights, carrying oil company personnel between Aberdeen, Scotland and Sumburgh, Shetland Islands. The inbound flight to Sumburgh had been made without incident and no significant malfunction of the aircraft had been reported. The crew, consisting of two pilots and a stewardess, then had a stopover of nearly seven hours before departing on the return flight, Dan-Air 0034, with 44 passengers on board. It has not been established who was the handling pilot on this sector. At 15:48 hrs, in conditions of moderate visibility, but with low cloud, rain and a fresh easterly wind, the aircraft was taxied out to the holding point 'India', the intersection of the disused runway and runway 15/33. Meanwhile the stewardess gave the company's standard safety briefing, using a megaphone because the passenger address (PA) system was 'screeching'. The briefing included mention of the location of the lifejackets, how they should be put on, and the method of inflation; also mentioned was the location of the emergency exits. A diagram displaying the method of donning the jackets was fixed to the forward bulkhead of the cabin. Because of other aircraft movements, 'KF' was held at point 'India' for six minutes before being cleared, at 15:57 hrs, to 'enter and backtrack' for a take-off on runway 09, which was virtually into wind. Whilst the aircraft was backtracking, ATC passed the crew the en route clearance, which was read back correctly by the co-pilot. The aircraft was seen to turn close to the western end of the runway and line up on the runway heading. At 15:59 hrs the flight received take-off clearance from ATC and this was acknowledged by the co-pilot. There is evidence to show that the engines were accelerated whilst the aircraft was held stationary on the brakes and that full take-off power, using watermethanol, was achieved on the take-off run, which commenced at almost exactly 16:00 hrs. Evidence from the aircraft's Flight Data Recorder (FDR) shows that the aircraft accelerated normally through the decision speed, V1 (92 kts), to the rotation and safety speed VR/2 (99 kts). No rotation was carried out and even though the aircraft reached a speed significantly higher than VR of the order of 113 kts, it failed to become airborne. About 5 seconds after reaching the scheduled rotation speed, and after passing the intersection with the disused runway, the aircraft began to decelerate. Veering gradually to the left as it crossed the grass overrun area, it then made contact with a discontinuity or 'step', approximately 40 centimetres high, at the edge of the airfield perimeter road and partial collapse of the undercarriage followed. After crossing the road in a left wing low and nose down attitude the aircraft passed over the inclined sea defences and came to rest in the sea some 50 metres from the shore line. The emergency services arrived at the point on the road adjacent to the crash site within two minutes of the accident. However, about a minute later the aircraft sank, nose first, in some ten metres of water, leaving only the rear section of the fuselage visible. Twenty-nine passengers and the stewardess were rescued, or managed to swim to the shore, under adverse weather conditions. Despite rescue attempts mounted from the shore, by small craft and by helicopters summoned to the scene, fifteen passengers and the two pilots died by drowning.", "probable_cause": "It was concluded that the accident was caused by the locked condition of the elevators which prevented the rotation of the aircraft into a flying attitude. It is likely that the elevator gust-lock became re-engaged during the pilot's pre-take-off check, and that this condition was not apparent to either pilot until the take-off was so far advanced that a successful abandonment within the overrun area could not be reasonably have been made. The re-engagement of the gust-lock was made possible by the condition of the gust-lock lever gate plate and gate-stop strip."}