{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh104-dove-1-baragwanath", "date": "Feb 28, 1951", "type": "De Havilland DH.104 Dove", "operator": "Central Mining Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Baragwanath - Baragwanath", "msn": "04087", "yom": 1947, "flight_number": null, "city": "Baragwanath", "zone": "Gauteng", "country": "South Africa", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5000, "captain_hours_type": null, "copilot_hours": 5000, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft with two commercial licensed pilots as sole occupants took off from Baragwanath Airfield for the purpose of pilot familiarization on with the aircraft. After a short period of single-engined flying with the star board propeller feathered, two landings and take-offs were performed successfully. During the approach for the third landing with the landing gear extended and locked and with flaps in the 60° position, a noise was heard on the port side. The pilots associated the noise with the undercarriage and decided to go round again with 85 - 90 mph IS, the throttles were opened with the propellers set in fine pitch. There was no response from the port engine. Height was being lost so the undercarriage lever was placed in the up position and the port propeller feathered. The ASI fellt to 70 - 80 mph. The flaps were raised to 20° and the aircraft sank and yawed to the left. Shortly after clearing some trees, the aircraft stalled and struck the ground with the starboard engine under full power.\r\nPhotos:\r\nhttp://www.dehavilland.co.za/DH104_Dove_cn_04087.htm", "probable_cause": "The probable cause of the accident was failure of the port engine caused by the vibration damper bolt partially unscrewing from the roller until the rear damper ring was operating on the bolt shank which eventually failed under excessive loading."}