{"url": "https://www.baaa-acro.com/crash/crash-partenavia-p68b-tangalooma", "date": "Nov 22, 1995 at 2110 LT", "type": "Partenavia P.68", "operator": "Island Air Gold Coast", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tangalooma – Coolangatta", "msn": "33", "yom": 1975, "flight_number": null, "city": "Tangalooma", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 905, "captain_hours_type": 57, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was the second to take off in a stream of six on a night flight from the Tangalooma Resort strip to Coolangatta aerodrome. Shortly after takeoff it struck the ground, nosed over and was consumed by a fuel-fed fire. The take-off run appeared normal but the initial climb was shallow according to the witnesses, some of whom were pilots waiting their turn to take off. At about 150 ft above ground level the aircraft entered a descent which continued until ground impact, 164 m beyond the departure end of the strip. The nose gear collapsed at impact but the aircraft remained upright and skidded along the ground on its main gear and front fuselage. It traversed a low sand dune, fell 10 ft to the beach and overturned. The aircraft came to rest 112 m beyond the first ground contact. All four passengers were able to evacuate the aircraft which had started to burn. The pilot was rescued by her passengers.", "probable_cause": "The following factors were reported:\r\n1. The takeoff direction was dark and had no visible horizon.\r\n2. The elevator trim was not set for takeoff.\r\n3. The elevator load on takeoff was high.\r\n4. The pilot did not monitor the aircraft attitude after lift-off.\r\n5. The flap was retracted in one movement, increasing the elevator load.\r\n6. The pilot may have been affected by somatogravic illusion to the extent that she thought the climb attitude was adequate."}