{"url": "https://www.baaa-acro.com/crash/crash-vickers-fb27-vimy-commercial-westwoodside-3-killed", "date": "Jan 12, 1931", "type": "Vickers FB.27 Vimy Commercial", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Delivery", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Brooklands – Digby", "msn": null, "yom": null, "flight_number": null, "city": "Westwoodside", "zone": "South Yorkshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew departed Brooklands Airport on a night delivery flight to Digby. On board were four crew members and the aircraft was coming out from the Vickers-Armstrong facilities at Brooklands Airport. En route, the crew apparently lost his orientation. The pilot reduced his altitude when the aircraft struck a bank and crashed in an open field. A crew member was injured while three others were killed. \r\nCrew:\r\nF/Lt Geoffrey Maynard Edward Shaw, †\r\nP/O John Edward Furlong Chapman, †\r\nF/Sgt Alfred George Rogers, †\r\nAC1 Cecil Alfred James Jones.", "probable_cause": "An inquest was held at Westwoodside on January 13 on the bodies of Flt Lt G. M. E. Shaw, Pilot Officer J. E. F. Chapman and Flt Sgt A. G. Rogers who were killed on the night of January 11 during a flight from Brooklands to Digby. Aircraftman Cecil Jones, who was the only survivor of the accident, said that they were flying low in the bad light to try and read the name of the railway station. They ascended again and prepared to land on what appeared to be a green field. The aeroplane overshot this field and landed in a ploughed field. It struck a bank only about a foot high and turned up on its nose, crushing the three men who were in the front. Flying Officer H. Bailey said that Flight Lieutenant Shaw had lost his way. A verdict of misadventure was returned."}