{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-near-payson-1-killed", "date": "Dec 18, 2012 at 1825 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Ameriflight2", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Holbrook - Payson - Phoenix", "msn": "31-7752008", "yom": 1977, "flight_number": "AMF3853", "city": "Payson", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1908, "captain_hours_type": 346, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 19188, "circumstances": "The pilot began flying the twin piston-engine airplane model for the cargo airline about 11 months before the accident. Although he had since upgraded to one of the airline’s twin turboprop airplane models, due to the airline’s logistical needs, the pilot was transferred back to the piston-engine model about 1 week before the accident. The flight originated at one of the airline’s outlying destination airports and was planned to stop at an interim destination to the southwest before continuing to the airline’s base as the final destination. The late afternoon departure meant that the flight would arrive at the interim destination about 10 minutes after sunset. That interim destination was situated in a sparsely populated geographic bowl just south of terrain that was significantly higher, and the ceilings there included multiple broken and overcast cloud layers near, or lower than, the surrounding terrain. Although not required by Federal Aviation Administration (FAA) regulations, the airline employed dedicated personnel who performed partial dispatch-like activities, such as providing relevant flight information, including weather, to the pilots. Before takeoff on the accident flight, the pilot conferred briefly with the dispatch personnel by telephone, and, with little discussion, they agreed that the flight would proceed under visual flight rules to the interim destination. Information available at the time indicated that the cloud cover almost certainly precluded access to the airport without an instrument approach; however, the airplane was not equipped to conduct the only available instrument approach procedure for that airport. Additionally, the pilot did not have in-flight access to any GPS or terrain mapping/database information to readily assist him in either locating the airport or remaining safely clear of the local terrain. Although the airplane was not being actively tracked or assisted by air traffic control (ATC) early in the flight, review of ground tracking radar data showed that the flight initially headed directly toward the interim destination but then began a series of turns, descents, and climbs. The airplane then disappeared from radar as the result of radar coverage floor limitations due to high terrain and radar antenna siting. The airplane reappeared on radar about 24 minutes after it disappeared and about 9 minutes after the FAA-defined beginning of night. Based on the flight track, it is likely that the pilot made a dedicated effort to access the airport, while concurrently remaining clear of the clouds and terrain, strictly by visual means. This task was made considerably more difficult and hazardous by attempting it in dusk conditions, and then darkness, instead of during daylight hours. About 15 minutes after the airplane reappeared on radar, when it was at an altitude of about 13,500 ft, the pilot contacted ATC and requested and was granted an instrument flight rules clearance to his final destination. About 3 minutes later, the controller cleared the flight to descend to 10,000 ft, and the airplane leveled off at that altitude about 6 minutes later. However, upon reaching 10,000 ft, the pilot requested a lower altitude to escape “heavy” upand down-drafts, but the controller was unable to comply because the ATC minimum vectoring altitude was 9,700 ft in that region. About 1 minute later, radar contact was lost. Shortly thereafter, the airplane impacted terrain in a steep nose-down attitude in a near-vertical trajectory. Although examination of the wreckage did not reveal any preimpact mechanical deficiencies that would have prevented normal operation and continued flight, the extent of the damage precluded, except on a macro scale, any determination of the preimpact integrity or functionality of any systems, subsystems, or components, including the ice protection systems, autopilot, and nose baggage door. Analysis of the radar data indicated that the airplane was above 10,000 ft for at least 41 minutes (possibly in two discontinuous periods) and above 12,000 ft (in two discontinuous periods) for at least 18 minutes. Although the airplane was reportedly equipped with supplemental oxygen, the investigation was unable to verify either its presence or its use by the pilot. Lack of supplemental oxygen at those altitudes for those periods could have contributed to a decrease in the pilot’s mental acuity and his ability to safely conduct the light. Analysis of air mass data revealed that mountain-wave activity and up- and downdrafts with vertical velocities of about 1,000 ft per minute (fpm) were present near the accident site and that the largest and most rapid transitions from up- to down-drafts occurred near the accident site, which was also supported by the airplane’s altitude data trace. The analysis also indicated that the last radar target from the airplane was located in a downdraft with a velocity of between 600 and 1,000 fpm. Other meteorological analysis indicated that the airplane encountered icing conditions, likely in the form of supercooled large droplets (SLD), several minutes before the accident. Aside from pilot reports from aircraft actually encountering SLD, no tools currently exist to detect airborne SLD. Further, the tools and processes to reliably forecast SLD do not exist. SLD is often associated with rapid ice accumulation, especially on portions of the airplane that are not served by ice protection systems. Airframe icing, whether due to accumulation rates or locations that exceed the airplane’s deicing system capabilities, mechanical failure, or the pilot’s failure to properly use the system, can impose significant adverse effects on airplane controllability and its ability to remain airborne. Because of the pilot’s recent transition from the Beechcraft BE-99, in which the pitot heat was always operating during flight, he may have forgotten that the accident airplane’s pitot heat procedures were different and that the pitot heat had to be manually activated when the airplane encountered the icing conditions. If the pitot heat is not operating in icing conditions, the airspeed information becomes unreliable and likely erroneous. Erroneous airspeed indications, particularly in night instrument meteorological conditions when the pilot has no outside references, could result in a loss of control. The investigation was unable to determine whether the pitot heat was operating during the final portion of the flight. The investigation was unable to determine whether the pilot used the autopilot during the last portion of the flight. If he was using the autopilot, it is possible that, at some point, he was forced to revert to flying the airplane manually due to the unit’s inability and to a corresponding Pilot’s Operating Handbook prohibition against using it to maintain altitude in the strong up- and downdrafts, which would increase the pilot’s workload. Another possibility is that the autopilot was unable to maintain altitude, and, instead of disconnecting it, the pilot overpowered it via the control wheel. If that occurred and the pilot overrode the autopilot for more than 3 seconds, the pitch autotrim system would have activated in the direction opposite the pilot’s input, and, when the pilot released the control wheel, the airplane could have been significantly out of trim, which could result in uncommanded pitch, altitude, and speed excursions and possible loss of control. Whether the pilot was hand-flying the airplane or was using the autopilot, the encounter with the strong up- and downdrafts and consequent altitude loss likely prompted the pilot to input corrective actions to regain the lost altitude, specifically increasing pitch and possibly power. Such corrections typically result in airspeed losses; those losses can sometimes be significant as a function of downdraft strength and the airplane’s climb capability. If that capability is compromised by the added weight, drag, and other adverse aerodynamic effects of ice, aerodynamic stall and a loss of control could result. Radar tracking data and ATC communications revealed that another, similar-model airplane flew a very similar track about 6 minutes behind the accident airplane, except that that other airplane was at 12,000 ft not 10,000 ft. The 10,000-ft ATC-mandated altitude placed the accident airplane closer to the underlying high terrain and into the clouds with the icing conditions and the strong vertical air movements. In contrast, the pilot of the second airplane reported that he was in and out of the cloud tops and did not report any weather-induced difficulties. The accident pilot did not have any efficient in-flight means for accurately determining the airborne meteorological conditions ahead, and the ATC controller did not advise him of any adverse conditions. Therefore, the pilot did not have any objective or immediate reason to refuse the ATC-assigned altitude of 10,000 ft. Ideally, based on both the AIRMET and the ambient temperatures, the pilot should have been aware of the likelihood of icing once he descended into clouds. That, particularly combined with his previously expressed lack of confidence in the airplane’s capability in icing conditions, could have prompted him to request either an interim stepdown altitude of 12,000 ft or an outright delay in a direct descent to 10,000 ft, but, for undetermined reasons, the pilot did not make any such request of ATC. Based on the available evidence, if the ATC controller had not descended the airplane to 10,000 ft when he did, either by delaying or by assigning an interim altitude of 12,000 ft, it is likely that the airplane would not have encountered the icing conditions and the strong up- and downdrafts. In addition, if the presence of SLD and/or strong up- and downdrafts had been known or explicitly forecast and then communicated to the pilot either via his weather briefing, his onboard equipment, or by ATC, it is likely that the pilot would have opted to avoid those phenomena to the maximum extent possible. The flight’s encounter with airframe icing and strong up-and downdrafts placed the pilot and airplane in an environment that either exacerbated or directly caused a situation that resulted in the loss of airplane control.", "probable_cause": "The airplane’s inadvertent encounter, in night instrument meteorological conditions, with unforecast strong up- and downdrafts and possibly severe airframe icing conditions (which\r\nlikely included supercooled large droplets that the airplane was not certificated to fly in) that led to the pilot's loss of airplane control."}