{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-414-08-hudson-iva-tennant-creek-6-killed", "date": "Sep 24, 1966 at 0915 LT", "type": "Lockheed L-414 Hudson", "operator": "Adastra%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Topographic", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Tennant Creek - Tennant Creek", "msn": "414-6039", "yom": 1941, "flight_number": null, "city": "Tennant Creek", "zone": "Northern Territory", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft had been carrying out magnetometer survey flights from the airport for several weeks. It departed at 06:30 hours local time, reaching the survey area an hour later. At 07:50 the Doppler equipment became unserviceable and a little later light rain was encountered. The survey work was abandoned and the flight returned to Tennant Creek. At 09:14 the crew radioed that they were in the circuit area. Wind was reported to be from 070° at 14 knots. The acknowledgement of this information was the last contact with the flight. A minute later, the twin engine aircraft crashed in a prairie located 2 miles west of the runway 07 threshold.The aircraft was totally destroyed and all six on board were killed, among them a child aged 11. An examination of wreckage showed that one of the duplicated aileron control chains in the pilot's control column was broken in the region of the control wheel sprocket. A link pin had failed and this pin might have subsequently jammed the assembly as the control wheel was being rotated. Control could not be taken over by the copilot, as there was no copilot on the flight. The right hand cockpit seat and rudder pedals were removed so a crew member was able to gain access to the nose area of the aircraft for the survey work.", "probable_cause": "The cause of this accident was a loss of control of the aircraft, and although the evidence available does not permit the reason for the loss of control to be determined, the possibility can not be eliminated that the pilot suffered an impairment of ability and, coincidentally, was deprived temporarily of aileron control."}