{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa26t-merlin-ii-winchester-1-killed", "date": "Mar 18, 1994 at 0050 LT", "type": "Swearingen SA26T Merlin II", "operator": "Eagle%20Aviation%20Kenya", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Washington DC - Winchester", "msn": "T26-128", "yom": 1969, "flight_number": null, "city": "Winchester", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3382, "captain_hours_type": 568, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5869, "circumstances": "While on approach at night, in VMC, the left engine lost power due to fuel starvation. The propeller was not feathered, the l/g was left down, and the aircraft drifted left of crs, struck trees, and then the ground. One gallon of fuel was drained from the right wing, engine and fuel line. No fuel was found in the left wing, engine and fuel line. The copilot said the fuel quantity system was erratic with the left side more erratic, and the right side reading about 10 gallons more than the left side. Testing found the right side indicated about 45 gallons more than was present while the left side was inoperative. There was no requirement for periodic recalibration of the fuel quantity system. The owner/pilot had operated the aircraft on 32 flights, over 23 hours, and refueled 23 times using partial fills, since he had full tanks. The pilot was checked out 17 months prior and the instructor said the pilot was fine, however, he was cautioned him to enroll in recurrent training. There was no record he did. The pilot had received an FAA checkride 19 months prior to the accident, which he passed.", "probable_cause": "The pilot's decision to operate the airplane with known deficiencies in the fuel quantity measuring system which resulted in a power loss due to fuel starvation, followed by improper emergency procedures which resulted in a loss of control inflight and uncontrolled contact with the ground. Factors were the lack of a requirement for periodic calibration of the fuel quantity measuring system from the manufacturer, and the erratic and inaccurate fuel quantity measuring system."}