{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-63cf-kansas-city-3-killed", "date": "Feb 16, 1995 at 2027 LT", "type": "Douglas DC-8", "operator": "ATI", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Kansas City - Westover", "msn": "45929", "yom": 1968, "flight_number": null, "city": "Kansas City", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 9741, "captain_hours_type": 4483, "copilot_hours": 4460, "copilot_hours_type": 218, "aircraft_hours": 77096, "circumstances": "The airplane crashed immediately after liftoff during a three-engine takeoff. Flightcrew had shortened rest break; rest periods not required for ferry flights. Flight crew fatigue from lack of rest, sleep, and disruption of circadian rhythms. Flightcrew did not have adequate, realistic training in three-engine takeoff techniques or procedures. Flight crew did not adequately understand three-engine takeoff procedures, including significance of vmcg. Flight engineer improperly determined vmcg speed, resulting in value 9 knots too low. During first takeoff attempt, captain applied power to asymmetrical engine too soon, was unable to maintain directional control, and rejected the takeoff. Captain agreed to modify procedure by allowing flight engineer to advance throttle, a deviation of  prescribed procedure. FAA oversight of operator was inadequate because the poi and geographic inspectors were unable to effectively monitor domestic crew training and international operations. Existing far part 121 flight time limits & rest requirements that pertained to the flights that the flightcrew flew prior to the ferry flights did not apply to the ferry flights flown under far part 91. Current one-engine inoperative takeoff procedures do not provide adequate rudder availability for correcting directional deviations during the takeoff roll compatible with the achievement of maximum asymmetric thrust at an appropriate speed greater than ground minimum control speed. All three crew members were killed. ", "probable_cause": "The accident was the consequence of the following factors:\r\n- The loss of directional control by the pilot in command during the takeoff roll, and his decision to continue the takeoff and initiate a rotation below the computed rotation airspeed, resulting in a premature liftoff, further loss of control and collision with the terrain. \r\n- The flightcrew's lack of understanding of the three-engine takeoff procedures, and their decision to modify those procedures. \r\n- The failure of the company to ensure that the flightcrew  had adequate experience, training, and rest to conduct the nonroutine  flight. Contributing to the accident was the inadequacy of Federal Aviation Administration oversight of air transport international and federal aviation administration flight and duty time regulations that permitted a substantially reduced flightcrew rest  period when conducting a non revenue ferry flight under 14 code of federal regulations part 91."}