{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1649-starliner-near-milan-68-killed", "date": "Jun 26, 1959 at 1735 LT", "type": "Lockheed L-1649 Starliner", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Athens – Rome – Milan – Paris – Shannon – Gander – Chicago", "msn": "1015", "yom": 1957, "flight_number": "TW891", "city": "Milan", "zone": "Lombardy", "country": "Italy", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 59, "pax_fatalities": 59, "other_fatalities": 0, "total_fatalities": 68, "captain_hours": 25514, "captain_hours_type": 682, "copilot_hours": 12150, "copilot_hours_type": 76, "aircraft_hours": 6671, "circumstances": "About fifteen minutes after it departed Milan-Malpensa Airport, while cruising at an altitude of 10,000 feet, the crew encountered poor weather conditions with thunderstorm activity. It is believed the airplane was hit by lightning when the right wing broke off shortly later. Out of control, the airplane entered a dive and eventually crashed in a field located 32 km northwest of Milan. The aircraft was totally destroyed and all 68 occupants have been killed. \r\nMore info on https://www.olgiateolona26giugno1959.org/cra_e.html", "probable_cause": "The breaking-up in flight was due to the explosion of the fuel vapours contained in tank No.7, followed immediately by either an explosion of pressure or a further explosion in tank no.6. In the absence of other significant concrete evidence, taking into account the stormy weather conditions, with frequent electric discharges, existing in the area at the time of the crash, it may be assumed that the explosion of the fuel vapours contained in tank No.7 was set off, through the outlet pipes, by igniting of the gasoline vapours issuing from these pipes as a consequence of static electricity discharges (streamer corona) which developed on the vent outlets."}