{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-near-rock-2-killed", "date": "Nov 4, 1998 at 2058 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "LW Aviation", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Augusta - Augusta", "msn": "799", "yom": 1980, "flight_number": null, "city": "Rock", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3136, "captain_hours_type": 300, "copilot_hours": 22770, "copilot_hours_type": 420, "aircraft_hours": 4712, "circumstances": "The airplane's left engine had been overhauled and required an in-flight Negative Torque Sensing (NTS) check. The procedures required that the left engine be shut down during the test flight. The test flight was conducted at night. The pilots were briefed that there was icing and moderate rime icing mixed below 15,000 feet in clouds and precipitation. The cloud bases were between 2,500 to 2,900 feet agl. After departure, the pilot reported to ATC that they were clear and on top of the clouds at about 6,500 feet msl. N5LN was assigned a 180 degree heading at an assigned altitude of 8,000 feet. Without notification to ATC, N5LN turned to a southeast heading, descended from 7,700 feet to about 5,500 feet, and decelerated from about 182 kts to about 138 kts. ATC assigned N5LN a block altitude of 6,000 to 8,000 feet and a VFR-On-Top clearance. ATC instructed N5LN to turn right to stay in the assigned airspace. N5LN turned right but continued to descend from about 5,500 feet to the last radar indication of 4,500 feet. The airplane impacted the ground in a steep attitude. The inspection of the wreckage indicated the landing gear was down, and with full right rudder trim and about six degrees nose up trim. The examination of the engines indicated both engines were rotating and operating at the time of impact. The examination of the airframe and propellers found no pre-existing anomalies that would have precluded normal operation. ", "probable_cause": "The pilot failed to maintain control of the aircraft and made an improper evaluation of the weather. Additional factors were flying a test flight at night with the icing conditions in the clouds. "}