{"url": "https://www.baaa-acro.com/crash/crash-avro-685-york-c1-near-karaj-4-killed", "date": "Mar 15, 1963 at 0910 LT", "type": "Avro 685 York", "operator": "Middle%20East%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Tehran – Beirut", "msn": "1218", "yom": 1945, "flight_number": null, "city": "Karaj", "zone": "Alborz", "country": "Iran", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 16553, "captain_hours_type": 6000, "copilot_hours": 4714, "copilot_hours_type": 4000, "aircraft_hours": null, "circumstances": "The Avro York plane carried out a freight flight from Beirut to Tehran via Kuwait. On the Kuwait-Tehran leg of the flight several test manoeuvres were carried out by a check pilot who was examining the pilot in command and co-pilot for renewal of their licenses. Shortly after takeoff, while climbing, the airplane went out of control and crashed in a huge explosion 11 km southeast of Karaj, west of Tehran. The aircraft was completely destroyed upon impact and all four crew members were killed. ", "probable_cause": "The position of the propellers at the time of impact would indicate that, at a time when the no. 4 engine power was off, an emergency condition developed which necessitated the feathering of no. 3 engine and the unfeathering of no. 4. Alternatively, a loss of power on the starboard engines could have occurred from an erroneous manipulation of the feathering switches during the course of this assumed crew checking exercise. In view of the fact that the fully loaded aircraft was flying at a low altitude after taking off from Mehrabad Airport which has an elevation of 3900 feet, it is evident that at the aircraft would not have sufficient altitude for the pilot to take effective recovery action and so avoid a crash resulting from the above mentioned loss-of-power conditions."}