{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2-anapolis", "date": "Dec 19, 2000 at 1200 LT", "type": "PZL-Mielec AN-2", "operator": "Augusto César Lemos Belo", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Canarana – Anápolis", "msn": "1G237-33", "yom": 1989, "flight_number": null, "city": "Anápolis", "zone": "Goiás", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": 250, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After being ferried from Alta Floresta following maintenance, the pilot was completing a flight from Canarana to Anápolis with two passengers on board. Upon touchdown on runway 07, he encountered crosswinds from the left and lost control of the airplane that veered off runway to the right. It flew over a ravine, struck irregularities in the terrain and came to rest. All three occupants escaped with minor injuries and the aircraft was damaged beyond repair. The aircraft was still operated under a Polish registration SP-FLU while this was already cancelled. The owner was in the process of applying for a Brazilian certificate of registration.", "probable_cause": "The following findings were identified:\r\n- It was not possible to determine the contribution of the physiological aspect because the pilot was not found and his license had expired.\r\n- At the critical moment of landing, a state of indecision was triggered in the pilot regarding the procedure to be adopted (landing or going around), impairing its decision-making capacity and causing delay in decision making.\r\n- The pilot did not act adequately on the aircraft controls in order to counteract the action of the crosswind, allowing the aircraft to stand to the right of the approach axis and touch the right side of the runway. Subsequently, he was unable to prevent the left wings from climbing, causing the lower right wing to touch the ground and exit the runway.\r\n- The pilot's decision not to go around immediately when he noticed the first signs of the aircraft's turning tendency, forced by the wind effect and, consequently, having lost full control of the aircraft, contributed to the worsening of the subsequent facts. The pilot acted belatedly when he decided to go around.\r\n- The owner of the aircraft no longer verified that the technical qualification and the Certificate of Physical Capacity of the pilot were up to date for the performance of the air activity, as well as the certificates necessary for the operation of the aircraft. It also went against what prescribes the CTA certification, which establishes two pilots as the minimum crew for the aircraft.\r\n- The left cross wind, associated with the inadequacy of the pilot's controls to counteract it, resulted in the right wing touching the ground, with consequent loss of control of the aircraft.\r\n- The pilot failed to carry out a readaptation flight in the aircraft with a qualified instructor, being for more than three years without flying in the equipment."}