{"url": "https://www.baaa-acro.com/crash/crash-rockwell-sabreliner-65-near-new-albany-3-killed", "date": "Apr 13, 2019 at 1514 LT", "type": "Rockwell Sabreliner 65", "operator": "Classic Aviation", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Broomfield - Oxford - Hamilton", "msn": "465-45", "yom": 1980, "flight_number": null, "city": "New Albany", "zone": "Mississippi", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 22200, "captain_hours_type": null, "copilot_hours": 2250, "copilot_hours_type": null, "aircraft_hours": 10754, "circumstances": "Two instrument-rated commercial pilots and one passenger were conducting a cross-country flight in instrument meteorological conditions when they began discussing an electrical malfunction; they then reported the electrical problem to air traffic control. The airplane subsequently made a descending right turn and impacted wooded terrain at a high speed. Most components of the airplane were highly fragmented, impact damaged, and unidentifiable. Based on the limited discussion of the electrical problem on the cockpit voice recorder and the damage to the airplane, it was not possible to determine the specific nature of the electrical malfunction the airplane may have experienced. While it was not possible to determine which systems were impacted by the electrical malfunction, it is possible the flight instruments were affected. The airplane's descending, turning, flight path before impact is consistent with a system malfunction that either directly or indirectly (through a diversion of attention) led to the pilot's loss of awareness of the airplane's performance in instrument meteorological conditions and subsequent loss of control of the airplane.", "probable_cause": "An unidentified electrical system malfunction that led to the pilots losing awareness of the airplane's performance in instrument meteorological conditions and resulted in a loss of control of the airplane."}