{"url": "https://www.baaa-acro.com/crash/crash-let-l-410uvp-yirol-20-killed", "date": "Sep 9, 2018 at 0845 LT", "type": "Let L-410", "operator": "South%20West%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Juba - Yirol", "msn": "84 13 28", "yom": 1984, "flight_number": null, "city": "Yirol", "zone": "Lakes (البحيرات)", "country": "South Sudan", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 20, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 20, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On approach to Yiral Airport in poor visibility due to fog, the twin engine aircraft descended too low, impacted the surface of the Yirol Lake and crashed about 2 km north of the airfield. The aircraft was destroyed upon impact and four occupants were rescued while 19 others were killed. A day later, one of the survivor died from his injuries. The three survivors are two children and a Italian doctor. The flight was completed on behalf of the Slaver Company based in Ukraine. ", "probable_cause": "The committee for the investigations of Slav air let410 aircraft registration UR-TWO has finally concluded that the cause of the accident at Yirol Eastern Lake State Republic of South Sudan was caused by a combination of the following factors:\r\n1. Severely bad weather in the morning of the accident.( Not making a decision to return back to Juba or diverting to the nearest airportRumbek).\r\n2. Pilot incompetency and error in setting the altimeter for Yirol airstrip before the crash. (Causing variations in altitude- flying at false altitude actually below the actual flight level).\r\n3. Replacement of a faulty propeller in Pibor and not informing the safety department of the changes and not being given the release document for operations."}