{"url": "https://www.baaa-acro.com/crash/crash-lockheed-18-lodestar-washington-dc-6-killed", "date": "Apr 27, 1945 at 1240 LT", "type": "Lockheed 18 LodeStar", "operator": "Page%20Airways", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Washington DC – New York", "msn": "18-2221", "yom": 1942, "flight_number": null, "city": "Washington DC", "zone": "District of Columbia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 11, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 3115, "captain_hours_type": null, "copilot_hours": 2600, "copilot_hours_type": null, "aircraft_hours": 1730, "circumstances": "Take-off was started on Runway 33 and the aircraft became airborne after traveling approximately 1,000 feet. Upon gaining an altitude of 10 or 15 feet the captain ordered \"gear up\" and the copilot complied. A few seconds later, when the gear was up, or nearly up, the captain sensed a power interruption with the aircraft yawing to the left. Concurrently he called out \"Single engine\", throttled both engines, ordered the landing gear down and lowered the nose of the aircraft slightly. After a few seconds had elapsed the landing gear was fully down. At the time of throttling the engines the aircraft was approximately one-half way down the 5200-foot run way and was at an altitude of which the most plausible consensus is 30 feet. First contact with the ground was made on the same runway at a speed the pilot estimated as 100 miles per hour. The aircraft bounced to an estimated height of 15 or 20 feet and made contact again on the sodded ground a few feet to the right side of the same runway. From this point on it twice again left the ground for distances of 189 and 728 feet. Brakes were applied intermittently during the second, the third, and the final contact with the ground. At some undetermined point following initial contact the captain applied 20 degrees of flap. Decelerating rapidly after the final contact the aircraft continued to roll to the right of the runway, diverging slightly, for a total distance of about 535 feet. It passed beyond the end of the runway and when an estimated 60 or 70 feet from a large drainage ditch nearly at right angles to the course, the pilot attempted to groundloop to the right. However, the plane turned only about 20 degrees to the right and rolled into the ditch, left wheel first, at an estimated speed of 10 or 15 m.p.h., about 95 feet to the left of a boundary marker. It rolled down the sloping side turning parallel with the ditch and stopped abruptly at the concrete-lined bottom where it immediately burned.", "probable_cause": "On the basis of all the evidence available the Board determines that the probable cause of this accident was engine failure during a critical point in the take-off following which the pilot executed an emergency landing under unfavorable conditions. Contributing factors were the strong gusts and ground turbulence which prevailed at the time. However, the seriousness of the accident was due to the presence of a deep ditch near the runway."}