{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-groton-2-killed-0", "date": "Aug 4, 2003 at 0639 LT", "type": "Learjet 35", "operator": "Air East Management", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Farmingdale - Groton", "msn": "35-509", "yom": 1983, "flight_number": null, "city": "Groton", "zone": "Connecticut", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4300, "captain_hours_type": null, "copilot_hours": 9000, "copilot_hours_type": null, "aircraft_hours": 9287, "circumstances": "About 5 miles west of the airport, the flightcrew advised the approach controller that they had visual contact with the airport, canceled their IFR clearance, and proceeded under visual flight rules. A witness heard the airplane approach from the east, and observed the airplane at a height consistent with the approach minimums for the VOR approach. The airplane continued over the runway, and entered a \"tight\" downwind. The witness lost visual contact with the airplane due to it \"skimming\" into or behind clouds. The airplane reappeared from the clouds at an altitude of about 200 feet above the ground on a base leg. As it overshot the extended centerline for the runway, the bank angle increased to about 90-degrees. The airplane then descended out of view. The witness described the weather to the north and northeast of the airport, as poor visibility with \"scuddy\" clouds. According to CVR and FDR data, about 1.5 miles from the runway with the first officer at the controls, and south of the extended runway centerline, the airplane turned left, and then back toward the right. During that portion of the flight, the first officer stated, \"what happens if we break out, pray tell.\" The captain replied, \"uh, I don't see it on the left side it's gonna be a problem.\" When the airplane was about 1/8- mile south of the runway threshold, the first officer relinquished the controls to the captain. The captain then made an approximate 60-degree heading change to the right back toward the runway. The airplane crossed over the runway at an altitude of 200 feet, and began a left turn towards the center of the airport. During the turn, the first officer set the flaps to 20 degrees. The airplane reentered a left downwind, about 1,100 feet south of the runway, at an altitude of 400 feet. As the airplane turned onto the base leg, the captain called for \"flaps twenty,\" and the first officer replied, \"flaps twenty coming in.\" The CVR recorded the sound of a click, followed by the sound of a trim-in-motion clicker. The trim-in-motion audio clicker system would not sound if the flaps were positioned beyond 3 degrees. About 31 seconds later, the CVR recorded a sound similar to a stick pusher stall warning tone. The airplane impacted a rooftop of a residential home about 1/4-mile northeast of the approach end of the runway, struck trees, a second residential home, a second line of trees, a third residential home, and came to rest in a river. Examination of the wreckage revealed the captain's airspeed indicator reference bug was set to 144 knots, and the first officer's was set to 124 knots. The flap selector switch was observed in the \"UP\" position. A review of the Airplane Flight Manual revealed the stall speeds for flap positions of 0 and 8 degrees, and a bank angle of 60 degrees, were 164 and 148 knots  respectfully. There were no charts available to calculate stall speeds for level coordinated turns in excess of 60 degrees. The flightcrew was trained to apply procedures set forth by the airplane's Technical Manual, which stated, \"…The PF (Pilot Flying) will call for flap and gear extension and retraction. The PNF (Pilot not flying) will normally actuate the landing gear. The PNF will respond by checking appropriate airspeed, repeating the flap or gear setting called for, and placing the lever in the requested position... The PNF should always verify that the requested setting is reasonable and appropriate for the phase of flighty and speed/weight combination.\"", "probable_cause": "The first officer's inadvertent retraction of the flaps during the low altitude maneuvering, which resulted in the inadvertent stall and subsequent in-flight collision with a residential home. Factors in the accident were the captain's decision to perform a low altitude maneuver using excessive bank angle, the flight crews inadequate coordination, and low clouds surrounding the airport."}