{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-kettwig-21-killed", "date": "Feb 8, 1988 at 0758 LT", "type": "Swearingen SA227 Metro III", "operator": "NFD", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Hanover - Düsseldorf", "msn": "AC-500", "yom": 1982, "flight_number": "NS108", "city": "Kettwig", "zone": "North Rhine-Westphalia", "country": "Germany", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 19, "pax_fatalities": 19, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": 2473, "captain_hours_type": 277, "copilot_hours": 2544, "copilot_hours_type": 1344, "aircraft_hours": 9184, "circumstances": "The twin engine aircraft departed Hanover Airport at 0715LT on a schedule service to Düsseldorf Airport, carrying 19 passengers and a crew of two. Following an uneventful flight at FL140, the crew started the descent at 0739LT. After being cleared to descend to 3,000 feet, the crew was informed about thunderstorm activity in the area and ATC informed the crew about a possible alternate route to avoid the area. This offer was denied by the crew who continued the descent. While flying in thunderstorm activity, the aircraft became unstable due to turbulences and lightnings strikes near the aircraft. After the failure of the electrical system, the crew lost control of the airplane that entered a dive, partially disintegrated in the air and eventually crashed in an open field located about 2 km north of Kettwig, near the airport of Essen-Mülheim. All 21 occupants were killed. ", "probable_cause": "The accident was caused by the combination of the followings: \r\n- The flight crew had continued into an area in which the occurrence of electrical discharge was to be expected, although avoiding the area would have been possible,\r\n- The total electricity supply failed due to a lightning strike in significant instrument flight conditions, causing the failure of the cockpit- and instrument lighting and making it impossible to use the flaps and stabilizer trim,\r\n- The plane had entered a largely uncontrolled flight after the power failure,\r\n- The aircraft became overloaded during the uncontrolled flight aircraft during and disintegrated.\r\nThe following contributing factors were reported: \r\n- The crew did not agree on the flight path in the area of the thunderstorm,\r\n- The crew were not prepared for a lightning strike,\r\n- The crew possibly became physically and mentally impaired for a short time after the lightning strike,\r\n- The crew could not understand each other for a short time after a short power failure because they wore headsets,\r\n- When the lightning struck, the plane was in an unstabilized flight condition with nose trimmed down and flaps half way down,\r\n- The crew was not able to restore power, probably because of the damage in the electrical wiring,\r\n- The crew did not have sufficient means for orientation in order to transfer the plane back from a predominantly uncontrolled flight to controlled flight."}