{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-santa-ana-5-killed", "date": "Aug 5, 2018 at 1229 LT", "type": "Cessna 414 Chancellor", "operator": "Category III Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Concord – Santa Ana", "msn": "414-0385", "yom": 1973, "flight_number": null, "city": "Santa Ana-John Wayne", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 980, "captain_hours_type": 120, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3963, "circumstances": "The pilot and four passengers were nearing the completion of a cross-county business flight. While maneuvering in the traffic pattern at the destination airport, the controller asked the pilot if he could accept a shorter runway. The pilot said he could not, so he was instructed to enter a holding pattern for sequencing; less than a minute later, the pilot said he could accept the shorter runway. He was instructed to conduct a left 270° turn to enter the traffic pattern. The pilot initiated a left bank turn and then several seconds later the bank increased, and the airplane subsequently entered a steep nose-down descent. The airplane impacted a shopping center parking lot about 1.6 miles from the destination airport. A review of the airplane's flight data revealed that, shortly after entering the left turn, and as the airplane’s bank increased, its airspeed decreased to about 59 knots, which was well below the manufacturer’s published stall speed in any configuration. Postaccident examination of the airframe and engines revealed no anomalies that would have precluded normal operation. It is likely that the pilot failed to maintain airspeed during the turn, which resulted in an exceedance of the aircraft's critical angle of attack and an aerodynamic stall.", "probable_cause": "The pilot’s failure to maintain adequate airspeed while maneuvering in the traffic pattern which resulted in an aerodynamic stall and subsequent spin at a low altitude, which the pilot was unable to recover from. "}