{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-8hg-kozhikode-21-killed", "date": "Aug 7, 2020 at 1941 LT", "type": "Boeing 737-800", "operator": "Air%20India%20Express", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dubai - Kozhikode", "msn": "36323/2109", "yom": 2006, "flight_number": "IX1344", "city": "Kozhikode-Calicut", "zone": "Kerala", "country": "India", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 2, "pax_on_board": 184, "pax_fatalities": 19, "other_fatalities": 0, "total_fatalities": 21, "captain_hours": 10848, "captain_hours_type": 4612, "copilot_hours": 1989, "copilot_hours_type": 1723, "aircraft_hours": 43691, "circumstances": "Air-India Express Limited B737-800 aircraft VT-AXH was operating a quick return flight on sector Kozhikode-Dubai-Kozhikode under ‘Vande Bharat Mission’ to repatriate passengers who were stranded overseas due to closure of airspace and flight operations owing to the Covid-19 pandemic. The aircraft departed from Kozhikode for Dubai at 10:19 IST (04:49 UTC) on 07 August 2020 and landed at Dubai at 08:11 UTC. The flight was uneventful. There was no change of crew and no defect was reported on the first sector. The aircraft departed from Dubai for Kozhikode at 10:00 UTC as flight AXB 1344 carrying 184 passengers and six crew members. AXB 1344 made two approaches for landing at Kozhikode. The aircraft carried out a missed approach on the first attempt while coming into land on runway 28. The second approach was on runway 10 and the aircraft landed at 14:10:25 UTC. The aircraft touched down approximately at 4,438 ft on 8,858 ft long runway, in light rain with tailwind component of 15 knots and a ground speed of 165 knots. The aircraft could not be stopped on the runway and this ended in runway overrun. The aircraft exited the runway 10 end at a ground speed of 84 knots and then overshot the RESA, breaking the ILS antennae and a fence before plummeting down the tabletop runway. The aircraft fell to a depth of approximately 110 ft below the runway elevation and impacted the perimeter road that runs just below the tabletop runway, at a ground speed of 41 knots and then came to an abrupt halt on the airport perimeter road just short of the perimeter wall. There was fuel leak from both the wing tanks; however, there was no postcrash fire. The aircraft was destroyed and its fuselage broke into three sections. Both engines were completely separated from the wings.  The rescue operations were carried out by the ARFF crew on duty with help of Central Industrial Security Force (CISF) personnel stationed at the airport and several civilians who rushed to the crash site when the accident occurred. Upon receipt of the information about the aircraft crash the district administration immediately despatched fire tenders and ambulances to the crash site. Nineteen passengers were fatally injured and Seventy Five passengers suffered serious injuries in the accident while Ninety passengers suffered minor or no injuries. Both Pilots suffered fatal injuries while one cabin crew was seriously injured and three cabin crew received minor injuries. The rescue operation was completed at 16:45 UTC (22:15 IST).", "probable_cause": "The probable cause of the accident was the non adherence to SOP by the PF, wherein, he continued an unstabilized approach and landed beyond the touchdown zone, half way down the runway, in spite of ‘Go Around’ call by PM which warranted a mandatory ‘Go Around’ and the failure of the PM to take over controls and execute a ‘Go Around’.\n\r\nThe following contributing factors were identitified: \n\r\nThe investigation team is of the opinion that the role of systemic failures as a contributory factor cannot be overlooked in this accident. A large number of similar accidents/incidents that have continued to take place, more so in AIXL, reinforce existing systemic failures within the aviation sector. These usually occur due to prevailing safety culture that give rise to errors, mistakes and violation of routine tasks performed by people operating within the system. Hence, the contributory factors enumerated below include both the immediate causes and the deeper or systemic causes.\n\r\n(i) The actions and decisions of the PIC were steered by a misplaced motivation to land back at Kozhikode to operate next day morning flight AXB 1373. The unavailability of sufficient number of Captains at Kozhikode was the result of faulty AIXL HR policy which does not take into account operational requirement while assigning permanent base to its Captains. There was only 01 Captain against 26 First Officers on the posted strength at Kozhikode.\n\r\n(ii) The PIC had vast experience of landing at Kozhikode under similar weather conditions. This experience might have led to over confidence leading to complacency and a state of reduced conscious attention that would have seriously affected his actions, decision making as well as CRM.\n\r\n(iii) The PIC was taking multiple un-prescribed anti-diabetic drugs that could have probably caused subtle cognitive deficits due to mild hypoglycaemia which probably contributed to errors in complex decision making as well as susceptibility to perceptual errors.\n\r\n(iv) The possibility of visual illusions causing errors in distance and depth perception (like black hole approach and up-sloping runway) cannot be ruled out due to degraded visual cues of orientation due to low visibility and suboptimal performance of the PIC’s windshield wiper in rain.\n\r\n(v) Poor CRM was a major contributory factor in this crash. As a consequence of lack of assertiveness and the steep authority gradient in the cockpit, the First Officer did not take over the controls in spite of being well aware of the grave situation. The lack of effective CRM training of AIXL resulted in poor CRM and steep cockpit gradient.\n\r\n(vi) AIXL policies of upper level management have led to a lack of supervision in training, operations and safety practices, resulting in deficiencies at various levels causing repeated human error accidents in AIXL\n\r\n(vii) The AIXL pilot training program lacked effectiveness and did not impart the requisite skills for performance enhancement. One of the drawbacks in training was inadequate maintenance and lack of periodic system upgrades of the simulator. Frequently recurring major snags resulted in negative training. Further, pilots were often not checked for all the mandatory flying exercises during simulator check sessions by the Examiners.\n\r\n(viii) The non availability of OPT made it very difficult for the pilots to quickly calculate accurate landing data in the adverse weather conditions. The quick and accurate calculations would have helped the pilots to foresee the extremely low margin for error, enabling them to opt for other safer alternative.\n\r\n(ix) The scrutiny of Tech Logs and Maintenance Record showed evidence of nonstandard practice of reporting of certain snags through verbal briefing rather than in writing. There was no entry of windshield wiper snag in the Tech log of VT-AXH. Though it could not be verified, but a verbal briefing regarding this issue is highly probable.\n\r\n(x) The DATCO changed the runway in use in a hurry to accommodate the departure of AIC 425 without understanding the repercussions on recovery of AXB 1344 in tail winds on a wet runway in rain. He did not caution AXB 1344 of prevailing strong tail winds and also did not convey the updated QNH settings.\n\r\n(xi) Accuracy of reported surface winds for runway 10 was affected by installation of wind sensor in contravention to the laid down criteria in CAR. This was aggravated by frequent breakdown due to poor maintenance.\n\r\n(xii) The Tower Met Officer (TMO) was not available in the ATC tower at the time of the accident. The airfield was under two concurrent weather warnings and it is mandatory for the TMO to be present to update and inform the fast changing weather variations to enhance air safety. During adverse weather conditions the presence of the TMO in the ATC tower was even more critical.\n\r\n(xiii) The AAI has managed to fulfil ICAO and DGCA certification requirements at Kozhikode aerodrome for certain critical areas like RESA, runway lights and approach lights. Each of these, in isolation fulfils the safety criteria however, when considered in totality, this left the aircrew of AXB 1344 with little or no margin for error. Although not directly contributory to the accident causation, availability of runway centreline lights would have certainly enhanced the spatial orientation of the PIC.\n\r\n(xiv) The absence of a detailed proactive policy and clear cut guidelines by the Regulator on monitoring of Long Landings at the time of the accident was another contributory factor in such runway overrun accidents. Long Landing has been major factor in various accidents and incidents involving runway excursion since 2010 and has not been addressed in CAR Section 5, Series F, Part II.\n\r\n(xv) DGCA did not comprehensively revise CAR Section 5, Series F, Part II Issue I, dated 30 Sep 99 (Rev. on 26 Jul 2017) on ‘Monitoring of DFDR/QAR/PMR Data for Accident/Incident Prevention’ to address the recommendations of the COI of 2010 AIXL Managlore Crash regarding the exceedance limits, resulting in the persisting ambiguities in this matter.\n\r\n(xvi) DFDR data monitoring for prevention of accidents/incidents is done by AIXL. However 100% DFDR monitoring is not being done, in spite of the provisions laid down in the relevant CAR and repeated audit observations by DGCA. DFDR data monitoring is the most effective tool to identify exceedance and provide suitable corrective training in order to prevent runway accidents like the crash of AXB 1344. However, ATR submitted by AIXL on the said findings were accepted by DGCA year after year without ascertaining its implementation or giving due importance to its adverse implications."}