{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-178-near-palm-springs-12-killed", "date": "Oct 23, 1942 at 1715 LT", "type": "Douglas DC-3", "operator": "American-Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Burbank – Phoenix", "msn": "1555", "yom": 1936, "flight_number": "AA028", "city": "Palm Springs", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 17155, "captain_hours_type": 5000, "copilot_hours": 863, "copilot_hours_type": 353, "aircraft_hours": null, "circumstances": "While cruising on airway 5 at an altitude of 9,000 feet, the DC-3 collided with a USAAF Lockheed B-34 Ventura II registered 41-38116 and performing a flight from Long Beach to Palm Springs with two pilots on board. Following the collision, the DC-3 dove into the ground and crashed 3 miles north of Palm Springs, killing all 12 occupants. The Ventura was able to land safely at Palm Springs Airport. The American composer Ralph Rainger was among the passengers.\r\nCrew:\r\nCharles Fred Pedley, pilot,\r\nLouis Frederick Reppert Jr., copilot,\r\nEstelle Frances Regan, stewardess.", "probable_cause": "The evidence of the record leaves no doubt as to the cause of, or the responsibility for, this accident. The pilot of the Bomber testified with great frankness to the facts, which showed that no diverged from his military mission to fly the Bomber in close proximity to the Airliner for the express purpose of signalling friend in the copilot's seat of the letter plane. Such conduct was wholly without justification. The investigation discloses no basis for any inference that the pilot in command of the Airliner was aware of the reason for Lieutenant Wilson's conduct or that he sought in any manner to cooperate with Lieutenant Wilson in any plan of reciprocal solution. Both the pilot and copilot of the Bomber testified that they observed no maneuver of recognition from the Airlines in response to the Bomber's wing-dip salute. Board is driven to the conclusion that this collision resulted from the reckless and irresponsible act of the Bomber pilot and that the captain of the Airliner was without fault. \n\n"}