{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3a-los-angeles-1-killed", "date": "Jun 29, 1953 at 1726 LT", "type": "Douglas DC-3", "operator": "Western%20Airlines-2", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Los Angeles - Los Angeles", "msn": "4887", "yom": 1942, "flight_number": null, "city": "Los Angeles", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 30793, "circumstances": "The airplane was cleared by the tower at 1723 for takeoff on Runway 25R, for a local VFR flight. On takeoff run at 1725, just when becoming airborne, and near the intersection of Runway 25R with Runway 22-4, it appeared that control of the aircraft had been lost. The right wing dropped and shortly struck the ground. The aircraft was then 15-20 feet high and the right wing remained down and the tail rose. It then veered to the right of the runway cartwheeled over its nose, and came to rest upside down. Fire broke out a few seconds later in the forward portion of the fuselage. Captain Johnson received minor injuries, Copilot Williams was seriously burned, and Company Chief Inspector Stromisky, sitting in the jump seat, was killed. Tower personnel had alerted emergency equipment when the aircraft first appeared to be in trouble, and fire apparatus arrived at the scene within a few minutes and extinguished the fire. The gross weight of the aircraft at the time of takeoff was 21,203 pounds, well below the prescribed maximum of 25,346 pounds, which was distributed within the approved C. G. limits. Weather at the time and place was good, with unlimited ceiling and visibility and a southwest wind at 10 mph.", "probable_cause": "The Board determines that the probable cause of this accident was reversed installation of aileron control cables and pulleys, and failure of the inspection department to detect this mistake. The following findings were pointed out:\r\n- During overhaul, aileron control cables were improperly connected,\r\n- Inspection, or lack of inspection, failed to detect this error,\r\n- Lateral control was lost during takeoff and the aircraft overturned,\r\n- Weather at the time was good and had no bearing on the accident."}