{"url": "https://www.baaa-acro.com/crash/crash-cessna-401-near-chanute-4-killed", "date": "May 11, 2012 at 1630 LT", "type": "Cessna 401", "operator": "DRDJ Sales", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Tulsa - Council Bluffs", "msn": "401-0123", "yom": 1991, "flight_number": null, "city": "Chanute", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 613, "captain_hours_type": 13, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2455, "circumstances": "While en route to the destination airport, the pilot turned on the cabin heater and, afterward, an unusual smell was detected by the occupants and the ambient air temperature increased. When the pilot turned the heater off, dark smoke entered the cabin and obscured the occupants' vision. The smoke likely interfered with the pilot’s ability to identify a safe landing site. During the subsequent emergency landing attempt to a field, the airplane’s wing contacted the ground and the airplane cartwheeled. Examination of the airplane found several leaks around weld points on the combustion chamber of the heater unit. A review of logbook entries revealed that the heater was documented as inoperative during the most recent annual inspection. Although a work order indicated that maintenance work was completed at a later date, there was no logbook entry that returned the heater to service. There were no entries in the maintenance logbooks that documented any testing of the heater or tracking of the heater's hours of operation. A flight instructor who flew with the pilot previously stated that the pilot used the heater on the accident airplane at least once before the accident flight. The heater’s overheat warning light activated during that flight, and the heater shut down without incident. The flight instructor showed the pilot how to reset the overheat circuit breaker but did not follow up on its status during their instruction. There is no evidence that a mechanic examined the airplane before the accident flight. Regarding the overheat warning light, the airplane flight manual states that the heater “should be thoroughly checked to determine the reason for the malfunction” before the overheat switch is reset. The pilot’s use of the heater on the accident flight suggests that he did not understand its status and risk of its continued use without verifying that it had been thoroughly checked as outlined in the airplane flight manual. A review of applicable airworthiness directives found that, in comparison with similar combustion heater units, there is no calendar time limit that would require periodic inspection of the accident unit. In addition, there is no guidance or instruction to disable the heater such that it could no longer be activated in the airplane if the heater was not airworthy.", "probable_cause": "The malfunction of the cabin heater, which resulted in an inflight fire and smoke in the airplane. Contributing to the accident was the pilot’s lack of understanding concerning the status of the airplane's heater system following and earlier overheat event and risk of its continued use. Also contributing were the inadequate inspection criteria for the cabin heater.\n"}