{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-a100-king-air-margaree", "date": "Aug 16, 2015 at 1616 LT", "type": "Beechcraft 100 King Air", "operator": "Maritime%20Air%20Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Halifax – Margaree", "msn": "B-103", "yom": 1972, "flight_number": null, "city": "Margaree", "zone": "Nova Scotia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1723, "captain_hours_type": 298, "copilot_hours": 532, "copilot_hours_type": 70, "aircraft_hours": 14345, "circumstances": "On 16 August 2015, a Maritime Air Charter Limited Beechcraft King Air A100 (registration C-FDOR, serial number B-103) was on a charter flight from Halifax Stanfield International Airport, Nova Scotia, to Margaree Aerodrome, Nova Scotia, with 2 pilots and 2 passengers on board. At approximately 1616 Atlantic Daylight Time, while conducting a visual approach to Runway 01, the aircraft touched down hard about 263 feet beyond the threshold. Almost immediately, the right main landing gear collapsed, then the right propeller and wing contacted the runway. The aircraft slid along the runway for about 1350 feet, then veered right and departed off the side of the runway. It came to rest about 1850 feet beyond the threshold and 22 feet from the runway edge. There were no injuries and there was no post-impact fire. The aircraft was substantially damaged. The occurrence took place during daylight hours. The 406-megahertz emergency locator transmitter did not activate.", "probable_cause": "Findings:\r\nFindings as to causes and contributing factors:\r\n1. Neither pilot had considered that landing on a short runway at an unfamiliar aerodrome with known high terrain nearby and joining the circuit directly on a left base were hazards that may create additional risks, all of which would increase the crew’s workload.\r\n2. The presence of the tower resulted in the pilot not flying focusing his attention on monitoring the aircraft’s location, rather than on monitoring the flight or the actions of the pilot flying.\r\n3. The crew’s increased workload, together with the unexpected distraction of the presence of the tower, led to a reduced situational awareness that caused them to omit the Landing Checks checklist.\r\n4. At no time during the final descent was the engine power increased above about 400 foot-pounds of torque.\r\n5. Using only pitch to control the rate of descent prevented the pilot flying from precisely controlling the approach, which would have ensured that the flare occurred at the right point and at the right speed.\r\n6. Neither pilot recognized that the steep rate of descent was indicative of an unstable approach.\r\n7. Advancing the propellers to full would have increased the drag and further increased the rate of descent, exacerbating the already unstable approach. \r\n8. The aircraft crossed the runway threshold with insufficient energy to arrest the rate of descent in the landing flare, resulting in a hard landing that caused the right main landing gear to collapse.\r\nFindings as to risk:\r\n1. If data recordings are not available to an investigation, then the identification and communication of safety deficiencies to advance transportation safety may be precluded.\r\n2. If organizations do not use modern safety management practices, then there is an increased risk that hazards will not be identified and risks will not be mitigated.\r\n3. If passenger seats installed in light aircraft are not equipped with shoulder harnesses, then there is an increased risk of passenger injury or death in the event of an accident.\r\n4. If the experience and proficiency of pilots are not factored into crew selection, then there is a risk of suboptimal crew pairing, resulting in a reduction of safety margins.\r\n5. If pilots do not carry out checklists in accordance with the company’s and manufacturer’s instructions, then there is a risk that a critical item may be missed, which could jeopardize the safety of the flight.\r\n6. If crew resource management is not used and continuously fostered, then there is a risk that pilots will be unprepared to avoid or mitigate crew errors encountered during flight.\r\n7. If organizations do not have a clearly defined go-around policy, then there is a risk that flight crews will continue an unstable approach, increasing the risk of an approach-and-landing accident.\r\n8. If pilots are not prepared to conduct a go-around on every approach, then there is a risk that they may not respond to situations that require a go-around.\r\n9. If operators do not have a stable approach policy, then there is a risk that an unstable approach will be continued to a landing, increasing the risk of an approach-andlanding accident. \r\n10. If an organization’s safety culture does not fully promote the goals of a safety management system, then it is unlikely that it will be effective in reducing risk.\r\nOther findings:\r\n1. There were insufficient forward impact forces to automatically activate the emergency locator transmitter."}