{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-stony-rapids", "date": "Feb 27, 2000 at 2200 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Athabaska%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Edmonton - Stony Rapids", "msn": "31-7952072", "yom": 1979, "flight_number": null, "city": "Stony Rapids", "zone": "Saskatchewan", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7850, "captain_hours_type": 1450, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Piper Navajo Chieftain PA-31-350, serial number 31-7952072, departed Edmonton, Alberta, on an instrument flight rules charter flight to Stony Rapids, Saskatchewan, with one pilot and six passengers on board. The pilot conducted a non-directional beacon approach at night in Stony Rapids, followed by a missed approach. He then attempted and missed a second approach. At about 2200 central standard time, while manoeuvring to land on runway 06, the aircraft struck trees 3.5 nautical miles west of the runway 06 button and roughly one quarter nautical mile left of the runway centreline, at an altitude of 1200 feet above sea level. The aircraft sustained substantial damage, but no fire ensued. The pilot and one passenger were seriously injured, and the remaining five passengers sustained minor injuries. Canadian Forces search and rescue specialists were air-dropped to the site at 0300 and provided assistance to the pilot and passengers. Local ground search parties later assisted with the rescue.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The pilot executed a missed approach on his first NDB approach, and, during the second missed approach, after momentarily seeing the runway, he decided to conduct a visual approach, descending below MDA in an attempt to fly under the cloud base.\r\n2. In flying under the cloud base during the visual portion of his approach, the pilot likely perceived the horizon to be lower on the windscreen than it actually was.\r\n3. There was no indication that there was any form of pressure from management to influence the pilot to land at the destination airport. However, the pilot may have chosen to land in Stony Rapids because he had an early flight the following day, and he did not have the keys for the accommodations in Fond-du-Lac.\r\nFindings as to Risk:\r\n1. No scale was available to the pilot in Edmonton for weighing aircraft loads.\r\n2. The maximum allowable take-off weight of the aircraft was exceeded by about 115 pounds, and it is estimated that at the time of the crash, the aircraft was 225 pounds below maximum landing weight. The aircraft's centre of gravity was not within limits at the time of the crash.\r\n3. The rear baggage area contained 300 pounds of baggage, 100 pounds more than the manufacturer's limitation.\r\n4. Two screws were missing from each section of the broken seat track to which the anchor points were attached.\r\n5. Cargo net anchorage system failure contributed to passenger injuries.\r\n6. The stitching failed on the seat belt's outboard strap that was mounted on the right, middle, forward-facing cabin seat.\r\nOther Findings:\r\n1. Hand tools were required to access the ELT panel, since the cockpit remote switch could not be accessed."}