{"url": "https://www.baaa-acro.com/crash/crash-boeing-377-stratocruiser-10-29-pacific-ocean", "date": "Oct 16, 1956 at 0615 LT", "type": "Boeing 377 Stratocruiser", "operator": "Pan%20Am.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Honolulu – San Francisco", "msn": "15959", "yom": 1949, "flight_number": "PA006", "city": "Pacific Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 24, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13089, "captain_hours_type": 738, "copilot_hours": 7576, "copilot_hours_type": 3674, "aircraft_hours": 19820, "circumstances": "Trip 6 of October 13 was a regularly scheduled “around-the-world” flight eastbound from Philadelphia, Pennsylvania. to San Francisco, California. with en route stops in Europe, Asia. and various Pacific Islands. All prior segments had been routine and the flight departed Honolulu on the last leg of the -trip on October 15. It was cleared to San Francisco Airport via Green Airway 9, then track to position 30 degrees N. 140 degrees W. at 13,000 feet. the 21,000 feet to San Francisco. There were 24 passengers aboard., including 3 infants, and a crew consisting of Richard N. Ogg, Captain; George L. Haaker. First Officer; Frank Garcia. Jr., Flight Engineer; Richard L. Brown, Navigator; Patricia Reynolds, Purser Mary Ellen Daniel and Katherine S. Araki, Stewardesses. The 8-hour, 54-minute flight was planned IFR and the aircraft carried sufficient fuel for 12 hours. 18 minutes. The gross takeoff weight of the aircraft was 138,903 pounds (maximum allowable 144,000) and the center of gravity was located within limits. N 90943 departed Honolulu at 2026. The climb to initial altitude was normal and the flight proceeded in a routine manner. At OLO2, the approximate midpoint of the flight, a request for VFR climb to its secondary altitude of 21,000 feet was approved by ATC. After reaching 21,000 feet and simultaneously with the reduction of power, the No. 1 engine oversped. Airspeed was immediately reduced by the use of flaps and reduction of power. Attempts were also made to feather the No. 1 propeller. It was impossible to control the engine or to feather the propeller and the captain decided to freeze the engine by cutting off the oil supply. Shortly after this was done there was a momentary decrease in the r. p. m., followed by a heavy thud. The propeller continued to windmill. At this time airspeed had slowed to 150 knots and the aircraft was losing altitude at a rate of approximately 1.000 feet per minute. The captain contacted the U. S. Coast Guard weather station “November” at 0122., alerted it to a possible ditching. and asked assistance. He also alerted the pas angers to the emergency and told them to prepare for a possible water landing. The flight course was altered to \"home in” on station “November” and climb power applied to engines Nos. 2, 3, and 4 to cheek the rate of descent. At this time it was noticed that No. 4 engine was only developing partial power at full throttle. At 0125 the flight notified “November” that ditching was imminent and received a ditching heading from the cutter. During the descent the crew found they could maintain altitude at an airspeed of 135 knots with rated power on engines Nos. 2 and 3 and the partial power on No. 4. About 0137 the flight overheated the cutter. Prior to overheating the cutter the maximum range with the fuel remaining had been computed and it was determined to be insufficient either to complete the flight to San Francisco or return to Honolulu. Mortar flares had been fired by the cutter and electric water lights laid to illuminate a ditching track for the aircraft. However, it was decided to postpone the ditching until daylight, if possible. meanwhile remaining close to the cutter. About 0245 the No. 4 engine backfired and power dropped off. Its propeller was feathered normally. The flight was still able to maintain altitude and continued to orbit “November” to burn the fuel aboard down to a minimum while awaiting daylight. At 0540 Captain Ogg notified the U. S. S. Pontchartrain he was preparing to ditch the aircraft. A foam path was laid along the ditching heading of 3150 by the cutter and the aircraft was ditched at 0615. Passengers and crew safely evacuated the aircraft, boarded liferafts, and were completely clear of the aircraft at 0632. The aircraft sank at 0635 at position 30 degrees 01.5’ N. 140 degrees 09’ W.", "probable_cause": "The Board determines that the probable cause of this accident was an initial mechanical failure which precluded feathering the No. 1 propeller and a subsequent mechanical failure which resulted in a complete loss of power from the No. 4 engine. the effects of which necessitated a ditching. The following findings were reported:\r\n- The flight was normal until the control of the No. 1 propeller was lost and the engine oversped,\r\n- It was impossible to control the engine speed or to feather the propeller,\r\n- The engine was frozen, however. the propeller became decoupled from the engine and continued to windmill,\r\n- There was a partial power loss on engine No. 4; it subsequently failed completely and the propeller was feathered,\r\n- Airspeed was restricted to 145 knots to prevent the windmilling Propeller from overspeeding,\r\n- Range of the aircraft was so reduced that it was impossible to reach land,\r\n- The passengers were thoroughly instructed in correct emergency procedures and the aircraft was ditched under control with no fatalities,\r\n- Evacuation of the aircraft was well planned and orderly."}