{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-10-dk-mt-paku-24-killed", "date": "Jan 2, 1969 at 2012 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "China-Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Hualien – Taitung – Kaohsiung", "msn": "12541", "yom": 1944, "flight_number": "CI227", "city": "Mt Paku", "zone": "Pingtung County (屏東縣)", "country": "Taiwan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 19, "pax_fatalities": 19, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": 7283, "captain_hours_type": 3260, "copilot_hours": 6106, "copilot_hours_type": 2607, "aircraft_hours": 37587, "circumstances": "Flight 226/227 was a scheduled domestic flight from Kaohsiung to Hualien and return with an intermediate stop at Taitung. It departed Kaohsiung at 1704 hours GMT on a VFR flight plan valid for the whole journey: after a 15-minute stop at Taitung it arrived at Hualien at 1829 hours. It departed Hualien at 1905 hours, arrived at Taitung at 1940 hours and departed Taitung at 1954 hours with an estimated time of arrival at Kaohsiung of 2040 hours. When the aircraft became overdue at Kaohsiung Airport the tower controller started calling the aircraft but in vain. He immediately notified Taipei Area Control Centre and requested it to initiate search action by radio communications. This was done without success. On the following day a T-33 of the Chinese Air Force Academy was instructed to undertake a search mission. It discovered the wreckage of the aircraft at 1855 hours. The coordinates of the accident site were 22° 31'N - 120° 44' 45\" E, at an elevation of 6 420 ft. The accident occurred at 2012 hours. All 24 occupants were killed. ", "probable_cause": "The aircraft, while flying in a downdraught of the mountain area, suddenly met turbulence and a down current so that its altitude abruptly dropped, and it hit the trees and crashed. It was believed that the accident occurred in visual flight when the pilot- in-command altered his course to avoid cumulus cloud and after having done so found himself in area of higher mountains which he could not clear."}