{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-18v-moscow-25-killed", "date": "Mar 3, 1973 at 1245 LT", "type": "Ilyushin II-18", "operator": "Balkan%20Bulgarian%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sofia - Moscow", "msn": "182 0056 02", "yom": 1962, "flight_number": "LZ307", "city": "Moscow-Sheremetyevo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 17, "pax_fatalities": 17, "other_fatalities": 0, "total_fatalities": 25, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During an approach to Moscow-Sheremetyevo Airport in marginal weather conditions, the crew initiated a go-around for unknown reason. During the second approach, at a distance of 5 km from the runway 07 threshold, the crew was informed by ATC that his position was 15 meters below the glide. Shortly later, the airplane nosed down then crashed in a huge explosion 4,330 meters short of runway. The aircraft disintegrated on impact and all 25 occupants were killed. ", "probable_cause": "The commission considered that the most probable cause of the accident was an adverse combination of the following factors: \r\n- Icing of the stabilizer (probably due to lack of heating in the leading edge), \r\n- A pitch manoeuvre executed to correct a deviation from the glide path which resulted in a g-loading of 0,6 - 0,5,\r\n- Extension of the flaps to the full landing setting, which had the effect of degrading the airflow over the lower surface of the stabilizer and, consequently, of producing loads on the control column which promoted a further increase in the negative g-loading and prevented recovery of the aircraft from the developing nosedive. \r\nOwing the destruction of the aircraft it was not possible to check the actual functioning of the stabilizer deicing system. "}