{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dash-8-q402-aalborg", "date": "Sep 9, 2007 at 1557 LT", "type": "De Havilland DHC-8-400 (Dash-8)", "operator": "SAS.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Copenhagen - Aalborg", "msn": "4025", "yom": 2000, "flight_number": "SK1209", "city": "Aalborg", "zone": "Nordjylland", "country": "Denmark", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 69, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17000, "captain_hours_type": 1000, "copilot_hours": 6540, "copilot_hours_type": 1085, "aircraft_hours": 12141, "circumstances": "The accident flight was a scheduled domestic flight from Copenhagen Airport, Kastrup (EKCH) to Aalborg Airport (EKYT). The flight was uneventful until the landing gear was selected down during the approach to EKYT runway 26R. The nose landing gear and the left main landing gear (MLG) indicated down and locked. The right MLG indicated “in transit” (not down and locked). The Aalborg Tower was informed about the problem with the right MLG indication. A go-around was initiated at 1100 feet MSL with a climb towards 2000 ft. The flight crew consulted the Quick Reference Handbook (QRH). An alternate landing gear procedure was initiated. The right MLG indication remained in “transit”. A mayday call was made to Aalborg Tower and they were informed about the unsafe landing gear. The flight crew reset the alternate gear extension system and subsequently they tried to make a normal gear up selection. The nose landing gear and the left MLG retracted normally, however the right main landing gear indication remained in “transit”. A second attempt to use the alternate landing gear extension procedure was performed without any changes to the right MLG indication. The aircraft entered a holding pattern in order to reduce the amount of fuel and at the same time to brief the passengers about the situation and to prepare the passengers for an emergency landing. Passengers seated at rows 6, 7 and 8 seats D and F were reseated away from the right propeller area. During the approach the flaps were selected to 10° and the landing gear horn started. The warning horn continued throughout the remaining flight. During the emergency landing the left MLG touched down on the runway first, followed by the right MLG. Shortly after the right MLG contacted the runway the right MLG collapsed. The aircraft departed the runway to the right and came to rest on a heading of 340° at 1357:26 hrs. ", "probable_cause": "There were five factors’ leading to the accident:\r\n1. There were no specified inspection tasks for inspection of the MLG retraction/extension actuator and rod end either in the MRB’s report or in the Maintenance Requirement Manual in so far as “L”, “A” and “C” checks.\r\n2. The right and left MLG retraction/extension actuator piston and rod end were made of noble martensitic stainless steel and the less noble 4340 steel material, respectively.\r\n3. Severe corrosion in the threaded connection between the right MLG actuator rod and rod end.\r\n4. Separation of the right MLG retraction/extension actuator from the actuator piston rod end.\r\n5. The right MLG stabilizer joint lugs failed. "}