{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-mansfield-4-killed", "date": "Jan 2, 1989 at 1643 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Baronco Aire", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Greenville - Mansfield", "msn": "379", "yom": 1973, "flight_number": null, "city": "Mansfield-Lahm", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 11700, "captain_hours_type": 2860, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3288, "circumstances": "During arrival, the flight was vectored for an ILS runway 32 approach. As the arrival continued, the ATC controller provided the latest info on cloud tops and in-cloud icing. The pilot acknowledged, then inquired about the status of the 'locator.' The controller advised that all components of the ILS, including the outer marker locator, were monitoring normal. Four miles from the outer marker/faf, the pilot was given a final vector, was cleared for the approach and was cleared to circle and land on runway 23. He acknowledged, then radio and radar contact with the aircraft were lost. The aircraft crashed approximately 2 miles southeast of the faf, while in a steep descent on a heading of 140°. No preimpact part failure/malfunction of the aircraft was found, though it was extensively damaged. About three weeks after a boating accident on 7/2/88, the pilot was admitted to a hospital and treated for a stroke, but an autopsy and toxicological checks failed to reveal any condition which would have prevented the pilot from performing his duties. Ad 88-13-01, concerning aircraft equipped with m-4c/d autopilots, was not complied with. All four occupants were killed. ", "probable_cause": "Failure of the pilot to maintain control of the aircraft, due to spatial disorientation, at about the time he was changing radio frequencies during an IFR approach. \r\nOccurrence #1: loss of control - in flight\r\nPhase of operation: approach - iaf to faf/outer marker (ifr)\r\nFindings\r\n1. Weather condition - clouds\r\n2. Weather condition - icing conditions\r\n3. Weather condition - low ceiling\r\n4. (c) aircraft control - not maintained - pilot in command\r\n5. (c) spatial disorientation - pilot in command\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled"}