{"url": "https://www.baaa-acro.com/crash/crash-airspeed-as10-oxford-i-near-upper-hutt-2-killed", "date": "Nov 20, 1941", "type": "Airspeed AS.10 Oxford", "operator": "Royal-New-Zealand-Air-Force-3", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Mountains", "schedule": "Ohakea - Ohakea", "msn": "2670", "yom": 1940, "flight_number": null, "city": "Upper Hutt", "zone": "Greater Wellington Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was performing a training mission on behalf of the 3rd Army Training Unit and departed Ohakea AFB at 1045LT. While cruising in low visibility due to poor weather conditions, the twin engine aircraft impacted the slope of a mountain located between Upper Hutt and Waikanae, northeast of Wellington. As the crew failed to announce their position at the reporting point at 1315LT, SAR operations were initiated, but eventually suspended after few days as no trace of the aircraft nor the crew was found. The wreckage was found by a hunter on April 10, 1943. \r\nCrew (3rd SFTS):\r\nLAC Charles William Baker,\r\nLAC Winston Stanley Cannel.\r\nSource: http://www.parawaitc.org.nz/Other/Oxford1245.pdf", "probable_cause": "The Court concluded its inquiry with the following findings:\r\n1) From the evidence available, the Court can only assume that the loss of Oxford NZ1245 is attributable mainly to the bad weather conditions prevailing in part of the route to be flown.\r\n2) The Court is of the opinion that the aircraft and equipment was in serviceable condition prior to the exercise.\r\n3) The weather conditions immediately prior to setting out on the exercise were such that the Flight Commander was justified in authorizing the flight."}