{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-21-near-berlin-3-killed", "date": "Nov 15, 1966 at 0242 LT", "type": "Boeing 727-100", "operator": "Pan%20Am.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Frankfurt - Berlin", "msn": "18995", "yom": 1966, "flight_number": "PA708", "city": "Berlin-Tegel", "zone": "Berlin", "country": "Germany", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 14212, "captain_hours_type": 58, "copilot_hours": 17542, "copilot_hours_type": 32, "aircraft_hours": 1804, "circumstances": "Pan Am's scheduled cargo flight 708 from Frankfurt to Berlin usually lands at Tempelhof Airport. However because of resurfacing of the runways at Tempelhof, Pan Am operated in and out of Tegel Airport since the evening of November 13th. Flight 708 departed Frankfurt at 02:04 and climbed to the cruising altitude of FL90. At 02:35 the flight reported leaving this altitude for FL30. Three minutes later Berlin Control cleared the flight to \"turn left heading zero three zero, descend and maintain two thousand\". When 6,5 miles from the Outer Marker, the controller cleared the flight to \"turn right heading zero six zero cleared ILS runway eight right approach\". Immediately after the acknowledgment from the flight crew, the aircraft struck the ground and crashed about 10 miles from the airport in the Soviet occupation zone. Weather was poor with 2,6 km visibility in snow; cloud coverage 3/8 at 500 feet and overcast a 600 feet with a temperature of -1deg C. The Soviet authorities returned about 50 percent of the wreckage. Some major components were not returned which included the flight data and cockpit voice recorders, flight control systems, navigation and communication equipment.", "probable_cause": "The descent of the flight below its altitude clearance limit, but the Board has been unable to determine the cause of such descent."}