{"url": "https://www.baaa-acro.com/crash/crash-handley-page-hp81-hermes-iv-near-atar-1-killed", "date": "May 26, 1952 at 0845 LT", "type": "Handley Page H.P.81 Hermes", "operator": "BOAC-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Desert", "schedule": "London – Tripoli – Kano", "msn": "81/15", "yom": 1950, "flight_number": "BA251", "city": "Atar", "zone": "Adrar", "country": "Mauritania", "region": "Africa", "crew_on_board": 8, "crew_fatalities": 1, "pax_on_board": 10, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off on a scheduled service from Tripoli to Kano with a crew of eight and ten passengers. The weather forecast indicated fine weather en route and thunderstorms in the Kano area. Due to faulty use of the variation setting control on the Gyrosyn compass and the inability of the crew to determine the aircraft's position properly by the standard methods, the aircraft, with practically no fuel and over the desert, made a wheels-up landing in a wide depression littered with shifting sand-dunes surrounded by rocky escarpments. The port wing was torn off and the remainder of the aircraft slewed left and came to a standstill without breaking up. No fire resulted and all passengers and crew were evacuated without difficulty. Six were slightly injured but the copilot died five days later as a result of exhaustion brought about by strain and heat.", "probable_cause": "Causes of the accident, in chronological order, are set out by the report as follows: \r\n- Faulty use by the navigator of the variation setting control on the CL2 Gyrosyn compass,\r\n- Faulty checking of compasses by incorrect astral bearing and without the aid of radio bearings,\r\n- Incorrect inference drawn by the captain in pronouncing the CL2 Gyrosyn compass correct and the P.12 magnetic compass unserviceable,\r\n- Fault on the part of the captain in not returning to Tripoli when the P.12 compass was regarded as unserviceable (in breach of BOAC regulations),\r\n- Inability of the crew to realize that astro shots were being taken on the wrong stars,\r\n- Inability of the crew to determine the aircraft's position properly by the standard methods when the VSC setting error was discovered,\r\n- Lack of decisive action on the part of the captain once he knew he had lost his way,\r\n- Ignorance, on the part of those on board, of the assistance which could have been afforded by Atar airfield. "}