{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-16k-near-zavitinsk-6-killed", "date": "Aug 24, 1981 at 1521 LT", "type": "Tupolev TU-16", "operator": "Soviet%20Union%20Air%20Force.gif", "flight_phase": "Flight", "flight_type": "Meteorological / Weather", "survivors": "No", "site": "Plain, Valley", "schedule": "Zavitinsk - Zavitinsk", "msn": "6203106", "yom": 1974, "flight_number": null, "city": "Zavitinsk", "zone": "Amur oblast", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Two Tupolev TU-16K of the Soviet Air Force departed Zavitinsk Air Base on a weather reconnaissance mission. Registered CCCP-07034 and CCCP-07514, both military airplanes were carrying a crew of six. While cruising at an altitude of 5,220 meters in good weather conditions, the TU-16 registered CCCP-07514 collided with an Aeroflot Antonov AN-24. Registered CCCP-46653, the AN-24 was completing flight SU811 from Yuzhno-Sakhalinsk to Blagoveshchensk with an intermediate stop in Komsomolsk-on-Amur, carrying 27 passengers and five crew members. It departed Komsomolsk-on-Amur Airport at 1456LT for the second leg of the trip and was cleared to climb to 5'200 meters. Both aircraft entered an uncontrolled descent and crashed in an uninhabited area located about 70 km east of Zavitinsk. Both aircraft were totally destroyed. All six crew members of the TU-16 were killed as well as 31 occupants on board the AN-24. Three days after the accident, a man aged 20 who was seating in the AN-24 was found slightly injured in the taiga.", "probable_cause": "It was determined that the collision was the consequence of a poor organization and management of flights in the area of the Zavitinsk and the non-compliance of the published procedures. The collision was made possible by a lack of interaction, coordination and communication between the civilian and military air controllers."}