{"url": "https://www.baaa-acro.com/crash/crash-bae-146-100-cap-de-trois-fourhces-38-killed", "date": "Sep 25, 1998 at 0750 LT", "type": "BAe 146", "operator": "Paukn%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Málaga – Melilla", "msn": "E1007", "yom": 1983, "flight_number": "PV4101", "city": "Cap de Trois Fourches", "zone": "Oriental", "country": "Morocco", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 34, "pax_fatalities": 34, "other_fatalities": 0, "total_fatalities": 38, "captain_hours": 7818, "captain_hours_type": 1648, "copilot_hours": 3501, "copilot_hours_type": 408, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Málaga-Pablo Ruiz Picasso Airport, the crew initiated the descent to Melilla Airport in marginal weather conditions. After being cleared to descend to 7,000 feet from Sevilla ATC, the crew contacted Melilla Tower and was cleared to descend to 5,000 feet. Melilla Tower then reported that runway 33 was in use and reported wind at 270° at 5 knots, visibility 8 km with few clouds at 1,000 feet. At 0645LT the copilot reported that they were at 22 nm at an altitude of 3,000 feet. From this point, the crew descended below the minimum safe altitude of 4,000 feet and crossed the coast line in limited visibility due to low clouds. At 0749 and 52 seconds, the GPWS alarm sounded twice in the cockpit. Few seconds later, the aircraft struck the slope of a mountain located near Cap de Trois Fourche. The aircraft disintegrated on impact and all 38 occupants were killed. ", "probable_cause": "Given the facts and analysis conducted, the Commission concluded that the accident was caused by a collision with terrain in IMC conditions. This confirms the hypothesis put forward by members of the committee of investigation from the beginning of their investigations, it is a type of CFIT accident (collision with the ground without loss of control) due to the combination of the following factors:\r\n- Non application of the arrival procedure, including descending below the minimum safe altitude,\r\n- Inadequate crew coordination,\r\n- Non application of company procedures regarding the GPWS alarm."}