{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-437-mont-blanc-117-killed", "date": "Jan 24, 1966 at 0802 LT", "type": "Boeing 707", "operator": "Air-India", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Bombay - New Delhi - Beirut - Geneva - Paris - London - New York", "msn": "18055", "yom": 1961, "flight_number": "AI101", "city": "Mont-Blanc", "zone": "Haute-Savoie", "country": "France", "region": "Europe", "crew_on_board": 11, "crew_fatalities": 11, "pax_on_board": 106, "pax_fatalities": 106, "other_fatalities": 0, "total_fatalities": 117, "captain_hours": 14664, "captain_hours_type": 2651, "copilot_hours": 12899, "copilot_hours_type": 290, "aircraft_hours": 16188, "circumstances": "The aircraft christened 'Kanchenjunga' was on a flight from Bombay to New York with intermediate stops in New Delhi, Beirut, Geneva, Paris and London, carrying 106 passengers and 11 crew members. The airplane departed Beirut with one VOR inoperative and while approaching Geneva at an altitude of 15,000 feet, the crew contacted ATC and requested the permission to perform a 'VMC on top' descent, about 1,000 feet above the cloud layer. Twenty minutes before its ETA at Geneva-Cointrin Airport, the four engine aircraft struck the Mont Blanc at an altitude of 4,677 meters. The airplane disintegrated on impact and debris scattered in deep snow near the 'Rocher de la Tournette'. Among the victims were Giani Bertoli, Director of Air India for Europe and the Indian Atomist Homi Bhabba who was travelling to Geneva for a conference, accompanied with 20 monkeys. At the time of the accident, the airplane should be at an altitude of 17,500 feet but the crew failed to follow this procedure, probably following misunderstanding with ATC. ", "probable_cause": "The commission concluded that the most likely hypothesis was the following: \r\na) The pilot-in-command, who knew on leaving Beirut that one of the VORs was unserviceable, miscalculated his position in relation to Mont Blanc and reported his own estimate of this position to the controller; the radar controller noted the error, determined the position of the aircraft correctly and passed a communication to the aircraft which, he believed, would enable it to correct its position; \r\nb) For want of a sufficiently precise phraseology, the correction was misunderstood by the pilot who, under the mistaken impression that he had passed the ridge leading to the summit and was still at a flight level which afforded sufficient safety clearance over the top of Mont Blanc, continued his descent.\r\nc) The low position of the sun created a certain light that may cause a misinterpretation of the natural environment. "}