{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-600-wichita", "date": "Jul 1, 2021 at 1908 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "JA Mach 3", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sioux Falls – Wichita", "msn": "60-0715-8061222", "yom": 1980, "flight_number": null, "city": "Wichita-Colonel James Jabara", "zone": "Kansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 420, "captain_hours_type": 95, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2744, "circumstances": "The pilot was conducting a cross-country flight when, about 8 miles north of his intended destination, he reduced engine power, pitched for level flight, and waited for indicated airspeed to drop below 174 kts to add 20° of flaps. As soon as the drag was introduced, the airplane began to “buck back and forward,” and the two engines were “throttling up and down on their own.” He noted that the right engine seemed to be “sputtering and popping” more than the left engine, so he decided to raise the flaps and to shut down and feather the right engine. He declared an emergency to air traffic control. The pilot then noticed that the left engine was “slowly spooling down” and the airplane was not able to maintain airspeed and altitude. The pilot performed a forced landing to a flat, muddy wheat field about 4 nautical miles from the airport. The airplane sustained substantial damage to the fuselage and to both wings. A Federal Aviation Administration inspector traveled to the accident site to examine the airplane. Flight control and engine control continuity were confirmed. The master switch was turned on and the fuel gauges showed a zero indication. There was no evidence of fuel at the accident site or in the airplane. During the recovery of the airplane from the field, no fuel was found in the three intact fuel tanks, nor in any of the engine fuel lines. The pilot later stated that he ran the airplane out of fuel during the accident flight. The pilot reported that, during the preflight checks and twice during the accident flight, he activated the low fuel warning light, and no anomalies were noted. Postaccident testing of the low fuel warning light in an exemplar Piper Aerostar 602P revealed no anomalies.", "probable_cause": "The pilot’s improper fuel planning and management, which resulted in a total loss of engine power due to fuel exhaustion."}