{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-441-near-lima-97-killed", "date": "Nov 27, 1962 at 0340 LT", "type": "Boeing 707", "operator": "Varig.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Rio de Janeiro – Porto Alegre – Lima – Bogotá – Panama City – Mexico City – Los Angeles", "msn": "17906", "yom": 1960, "flight_number": "RG810", "city": "Lima-Callao-Jorge Chávez", "zone": "Lima", "country": "Peru", "region": "South America", "crew_on_board": 17, "crew_fatalities": 17, "pax_on_board": 80, "pax_fatalities": 80, "other_fatalities": 0, "total_fatalities": 97, "captain_hours": 13640, "captain_hours_type": 1641, "copilot_hours": 16304, "copilot_hours_type": 642, "aircraft_hours": 6326, "circumstances": "A Boeing 707-441 passenger jet, operated by Varig, was destroyed when it crashed into the side of La Cruz Peak, near Lima, Peru. All 80 passengers and 17 crew members were killed. Flight RG810 departed Rio de Janeiro-Galeão Airport at 03:53 hours UTC on a scheduled flight to Los Angeles (LAX) with en route stops at Lima (LIM), Peru , Bogotá (BOG), Colombia, Panama City (PTY), Panama and Mexico City (MEX), Mexico. At 08:09 the flight reported to Air Traffic Control, Lima, at 36 000 feet, estimating Pisco at 08:13 and Lima-Callao Airport at 08:36 and requested permission to descend. Lima ATC advised of a DC-6, which had departed Lima at 07:35 and was also estimating Pisco at 08:13 when it would be cruising at 13500 feet. After passing Pisco at 08:13, the crew started their descent. At 08:19 hours RG-810 reached 26000 feet. Authorization was granted to continue descending for a straight-in approach to runway 33. At 08:24 it reported to Approach Control ten minutes from the station, at 15 000 feet, still in descent. By 08:30 hours it had reached 12000 feet over Las Palmas. As it was too high for a straight-in approach to runway 33, Approach Control suggested that it make a 360-degree turn over Las Palmas and report again overhead Las Palmas. The aircraft continued descending. It turned slightly right of its 330 degree heading, passing east of Lima Airport, then made a left turn and passed over Lima-Callao Airport. It continued turning until it was headed south, passing west of Las Palmas in order to initiate the outbound procedure from the ILS back course, and then made a 180 degree turn to intercept the ILS back course (327 degrees). However, it kept to the normal intercept course for almost three minutes before starting its turn to the north. Its heading was 333 degrees when it hit La Cruz Peak, about 8 miles east of the approach track of the Morro Solar ILS back course.", "probable_cause": "A deviation, for reasons unknown, from the track prescribed for the instrument approach along the ILS back course of Lima-Callao Airport."}