{"url": "https://www.baaa-acro.com/crash/crash-grumman-s-2f-3s-tracker-jervis-bay", "date": "Feb 10, 1975 at 0325 LT", "type": "Grumman S-2 Tracker", "operator": "Royal%20Australian%20Navy", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "HMAS Melbourne - HMAS Melbourne", "msn": "340C", "yom": 1957, "flight_number": null, "city": "Jervis Bay", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Tracker N12-153608 was catapulted from the carrier at 2200 hours on 9 February 1975 to carry out an anti-submarine warfare close support task. The night was unusually dark with no visible horizon so that approximately three hours of the flight were spent in Instrument Meteorological Conditions (IMC). At 0323 hours the following morning, the aircraft attempted a routine landing using the mirror landing system as an approach aid. In the days preceding the accident, the mirror setting had been changed from an approach slope of 4° to 4.5° but the pilot had not been informed of this. In consequence, the approach was slightly high and fast, the aircraft failed to pick up an arrester wire, an event known as a \"bolter\", and it subsequently crashed into the sea approximately ten seconds later. All four crew members managed to escape from the sinking aircraft and were rescued uninjured. Accident occurred off the Jervis Bay, in the Tasman Sea. \r\nSource: Phil Thompson", "probable_cause": "Applied Report 78 concluded that the most probable cause of the accident was that the pilot was affected by unrecognized disorientation associated with somatogravic illusion and flew the aircraft into the sea. Factors thought to have contributed were:\r\na. the exceptionally dark night,\r\nb. the pilot's unawareness of the change of settings to the mirror landing aid,\r\nc. the pilot's lack of any previous bolter experience,\r\nd. the need to monitor engine instruments instead of the VGI as the aircraft was rotated."}