{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-8bk-georgetown", "date": "Jul 30, 2011 at 0132 LT", "type": "Boeing 737-800", "operator": "Caribbean%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York - Port of Spain - Georgetown", "msn": "29635/2326", "yom": 2007, "flight_number": "BW523", "city": "Georgetown-Cheddi Jagan (ex Timehri)", "zone": "Demerara-Mahaica", "country": "Guyana", "region": "South America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 157, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9600, "captain_hours_type": 5000, "copilot_hours": 1400, "copilot_hours_type": 350, "aircraft_hours": 14861, "circumstances": "The flight originated in New York as BW 523, and made a passenger and fuel stop in Port-of-Spain, Trinidad where there was also a change of crew comprising two pilots and four flight attendants before proceeding to Georgetown, Guyana. The flight departed Piarco at 04:36UTC. The aircraft proceeded to Georgetown from Port of Spain at Flight Level (FL) 330, was given descent clearance and was cleared for an RNAV (GPS) approach to RWY 06, landing at 05:32 UTC. There were no reported anomalies in the en-route profile, although during the transition from cruise to approach to RWY 06 the aircraft deviated to avoid some thunderstorm cells north and east of the Airport. The reported visibility was 9,000m. Light rain was encountered during the approach. The pilot reported that after visual contact was made and after crossing the Final Approach Fix (FAF), he disengaged the auto pilot and configured the aircraft for landing. The Flight Data Recorder (FDR) indicated that the flight was normal until the aircraft was approaching the runway. Even before the aircraft was over the threshold, the captain commented that he was not landing here. As the flight continued over the runway, comments on the Cockpit Voice Recorder (CVR), revealed that the captain indicated to the First Officer (FO) that the aircraft was not touching down. A go-around call was made by the Captain and acknowledged by the First Officer, however three seconds elapsed and the aircraft subsequently touched down approximately 4700ft from the threshold of RWY06, leaving just over 2700 feet of runway surface remaining. Upon touchdown, brake pressure was gradually increased and maximum brake pressure of 3000psi was not achieved until the aircraft was 250ft from the end of the runway or 450ft from the end of the paved area. The ground spoilers were extended on touchdown. The thrust reversers were partially deployed after touchdown. The aircraft did not stop and overran the runway. It then assumed a downward trajectory followed by a loud impact.", "probable_cause": "The probable cause of the accident was that the aircraft touched down approximately 4,700 feet beyond the runway threshold, some 2,700 feet from the end of the runway, as a result of the Captain maintaining excess power during the flare, and upon touching down, failure to utilize the aircraft’s full deceleration capability, resulted in the aircraft overrunning the remaining runway and fracturing the fuselage. \r\nContributory Factors:\r\nThe Flight Crew’s indecision as to the execution of a go-around, failure to execute a go-around after the aircraft floated some distance down the runway and their diminished situational awareness contributed to the accident."}