{"url": "https://www.baaa-acro.com/crash/crashf-consolidated-pby-5a-catalina-kodiak-8-killed", "date": "Oct 3, 1945 at 1331 LT", "type": "Consolidated PBY Catalina", "operator": "US%20Navy", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Mountains", "schedule": "Cold Bay – Kodiak", "msn": "1748", "yom": 1944, "flight_number": null, "city": "Kodiak", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 3, "pax_on_board": 9, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 1397, "captain_hours_type": 1236, "copilot_hours": 822, "copilot_hours_type": 6, "aircraft_hours": 1125, "circumstances": "At 0930, Alaskan Standard Time, 3 October 1945, Lieutenant Commander George Richard SMITH, USN, (82426) Commanding Officer, Patrol Bombing Squadron SIXTY-TWO, took off from Army Air Base, Cold Bay, Alaska, in a PBY-5A airplane on an administrative flight carrying messengers and material to Kodiak, Alaska, for Commandant, SEVENTEENTH Naval District. No other plane accompanied him. At this time, Cold Bay had scattered clouds at 1500 - 2000 feet with higher alto-cumulus at 6000 - 7000 feet. The route forecast gave lowering ceilings to 1000 feet at Chirikof. Terminal forecast for Kodiak gave 500-600 feet ceiling visibility 4 miles in light rain. The flight plan gave Anchorage, Alaska, as alternate airport. The 1330 weather sequency for Anchorage gave an estimated 5000 feet overcast with lower broken clouds at 2000 feet, wind north-northwest six knots, visibility unrestricted. At 1246 Lieutenant Commander SMITH contacted Kodiak Flight Control and reported his position at Black Point Intersection, cruising 3200 feet. Kodiak Flight Control cleared him to Kodiak Range Station to climb 4000 feet and notified him that the present Kodiak ceiling was 500 feet, visibility 2-1/2 miles. This message was acknowledged. At 1252 Kodiak Flight Control cleared him from his present position to Kodiak Range Station for standard instrument approach, final approach on east leg, initial approach at 4000 feet. He acknowledged this message and requested permission for needle approach. Kodiak Flight Control cleared him for needle approach. At 1317 he contacted Kodiak Tower and reported over Point ABLE (Kodiak Range Station) and requested present wind direction and velocity. Kodiak Tower reported wind east-southease 20 knots with gusts to 28. This report was acknowledged. While Lieutenant Commander SMITH was making his needle approach, Kodiak Tower reported to him that visibility was now two miles, bartow lights on runway 25, and that he would be landing with approximately 20 knots downwind. This was acknowledged. The plane was first sighted by the tower operators approximately 1/4 mile north of runway 25 at an altitude of approximately 400 feet. No voice contact was made. He continued downwind on the north side of an paralleling runway 25 in an attempt to land on runway 7. The 400-500 feet ceiling and the hills back of runway 7 made this approach impossible even though he appeared to make an \"S\" turn in an attempt to get into position for a landing. He continued the traffic circle upwind on the south side of runway 7 for a downwind landing on runway 25. As he flew over the tower at an altitude of approximately 300 feet, he contacted Kodiak Tower and said, \"Am going to land on runway 25 this pass.\" The approach turn was started too soon for a downwind landing and the plane crossed the end of runway 25 at approximately 100 fet and came closest to the runway (estimated 0-10 feet) at approximately 130 feet beyond the intersection of runways 25 and 28. The plane either bounced or was pulled up and a normal power climb was started straight ahead until the end of runway 7 was crossed at which point a steep climbing turn to the left was started. Insufficient altitude was obtained to clear the surrounding hills and the plane crashed from an apparent power on. Immediately after the airplane crashed at 1331, the Kodiak Control Tower Operator sounded the crash alarm and directed the crash truck and fire trucks by radio to proceed to disabled aircraft on hillside at end of runway 7. As the trucks proceeded to the end of runway 7, the Control Tower gave them more specific instructions as to the location of crash stating that the disabled aircraft was on the hillside at the end of runway 7 in back of SeaBee Hill. The trucks were directed up SeaBee Hill to SeaBee buildings then just beyond to the plane on the northeast slope of Old Woman Mountain. The vehicles could proceed to within approximately 150 yards of the crash. From this point a path was made through the thickly-growing scrub trees to the scene. A fire hose was run to the scene from the SeaBee buildings, but was not used since the plane did not burn. Ambulances, doctors, and hospital corps men from the dispensary proceeded to the scene immediately. The first fire and rescue personnel arrived at eh crash at approximately 1340. Personnel from the SeaBee buildings arrived at approximately 1334. The victims were removed as quickly as possible.  The plane came to rest on the starboard side of the fuselage. The starboard wing was broken off at the root and was lying parallel to the fuselage. Both engines were broken loose from their mountings and were 20 25 feet from the wreckage, partly buried in the ground. The plane from No. 4 bulkhead  forward was completely demolished and was piled in a twisted heap under the wings and cabane section. The starboard wing was broken and twisted about six feet from the wing tip and wa also broken near the center. The port wing was broken off at the root. Little visible damage was done to the fuselage aft of number four bulkhead, except that the tail section was twisted, apparently by being struck by the starboard wing. Both wheels, sidema, and tires appeared to be undamaged. The keep aft of number four bulkhead was undamaged. No evidence of engine failure was observed by the surviving crew members or passengers. Salvage operations carried on until the following day recovering all plane parts and confidential radio equipment. All classified publications and charts were recovered. Examination of the wreckage disclosed no evidence of material failure or sabotage.\r\nThose killed were:\r\nLt Cdr George Richard Smith, \r\nLt (jg) John Kenneth McNeil,\r\nEns Willard Edwin Tostman,\r\nRichard Knightly,\r\nJewell Franklin,\r\nRoy George Nelson, \r\nKeith Eugene Dugger,\r\nLT Paul Porter Butler.", "probable_cause": "It is believed that during the steep climbing turn to the left after over shooting a downwind attempt to land on runway 25, Lt.Comdr. SMITH, in an attempt to gain sufficient altitude to clear the surrounding hills, pulled the nose of the plane too high and the plane stalled. There was insufficient altitude to recover from the stall and the plane crashed nose first. "}