{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-33cf-charlotte-amalie-23-killed", "date": "May 2, 1970 at 1549 LT", "type": "Douglas DC-9", "operator": "ALM%20Antillean%20Airlines.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "New York - Saint Marteen", "msn": "47407/457", "yom": 1969, "flight_number": "LM980", "city": "Charlotte Amalie-Cyril E. King (ex Harry S. Truman)", "zone": "All US Virgin Islands", "country": "US Virgin Islands", "region": "Central America", "crew_on_board": 6, "crew_fatalities": 1, "pax_on_board": 57, "pax_fatalities": 22, "other_fatalities": 0, "total_fatalities": 23, "captain_hours": 12000, "captain_hours_type": 1700, "copilot_hours": 3500, "copilot_hours_type": 600, "aircraft_hours": 2505, "circumstances": "ALM flight 980, from New York-JFK International Airport to Juliana Airport, St.Maarten, was being operated under terms of a lease agreement, utilizing an ONA aircraft and flight crew, and an ALM cabin crew. ALM 980 established radio contact with Juliana Tower and received clearance for an Automatic Direction Finding (ADF) approach to runway 09. The weather was reported as scattered clouds at 800 feet, estimated ceiling 1,000 feet broken, 5,000 feet overcast, and visibility 2 to 3 miles. The crew sighted the runway too late to land successfully on this approach, and attempted two left turn, visual circling approaches. The first circling approach was abandoned because of poor alignment with the runway again and on the second one the captain was unable to maintain the proper descent profile without reducing power and increasing the sink rate beyond acceptable limits. The captain executed a missed approach, made a low altitude return to the St. Maarten Radio Beacon, and was given clearance to St. Thomas at an assigned altitude of 4,000 feet. The fuel gauges were reported to have been acting erratically during the climb, but momentarily stabilized at 850 pounds of fuel remaining. A higher altitude was requested and a course adjustment was made for St. Croix, which was closer. Although the captain doubted the accuracy of the fuel gauge reading, he decided to descend in order to establish visual contact with the water. He also advised the purser that they were low on fuel, and to prepare the cabin for ditching. The purser made this announcement, and no other warning was given to the passengers prior to impact. The ditching site was confirmed on radar with the assistance of a PanAm flight that diverted for that purpose. Other fixed-wing aircraft orbited the area until the US Coast Guard, Navy, and Marine Corps helicopters began picking up survivors. Weather in the area during the rescue operation was estimated to be 400 to 500 feet overcast and visibility as low as three-eighths of a mile in rain. The aircraft sank in water more than 5,000 feet deep, and was not recovered.", "probable_cause": "The Board determines that the probable cause of this accident was fuel exhaustion which resulted from continued, unsuccessful attempts to land at St. Maarten until insufficient fuel remained to reach an alternate airport. A contributing factor was the reduced visibility in the approach zone because of rain showers, a condition not reported to the flight. The Board also finds that the probability of survival would have been increased substantially in this accident if there had been better crew coordination prior to and during the ditching."}