{"url": "https://www.baaa-acro.com/crash/crash-avro-504k-hildenborough", "date": "Nov 26, 1921", "type": "Avro 504", "operator": "Stallard Airways", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Penshurst - Ashford", "msn": "E4180", "yom": 1919, "flight_number": null, "city": "Hildenborough", "zone": "Kent", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Showing off to a crowd often leads to embarrassment, as the pilot of an Avro 504 K discovered back in 1921. G-EAFQ was supposed to be flying from Penshurst to Ashford on the afternoon of 26th November - at the controls was Mr. R.H. Leavy, with a Mr. T. Baden-Powell as passenger. After making a short test flight the pilot took off again with the intention of heading for a temporary aerodrome at Ashford. On climbing to about 600 feet in an easterly direction, Leavy commenced a gradual turn to port until the Avro 504 arrived over a football ground on which a game was in progress. The machine was then banked vertically and the pilot, at 400 feet, waved his arm at the spectators. Unfortunately G-EAFQ fell rapidly into a side-slip and only partially recovered before striking the ground about 200 yards outside the touchline. The aircraft was fitted with dual controls - the passenger had not, however, interfered with them in any way. The men scrambled from the wreckage, Mr. Leavy having received nothing worse than cuts to the face, and Mr. Baden-Powell was unhurt.", "probable_cause": "Investigators were a bit peeved that no log books had been kept for the machine, and the owners (Stallard Airways) had no records for the life of the machine. In the opinion of the AIB, the accident was due to \"..the pilot's carelessness in paying more attention to the spectators on the ground than to the conduct of his machine.\""}