{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-orlando-1-killed", "date": "Nov 12, 1993 at 0629 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Cherokee Express Air Cargo", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Orlando - Tampa", "msn": "31-7852107", "yom": 1978, "flight_number": null, "city": "Orlando-Executive (Herndon)", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2465, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8393, "circumstances": "Cargo was not weighed and weight and balance calculations were not performed. The airplane was about 321 pounds over gross. While taxiing, a witness reported seeing black smoke trailing the left engine which had been worked on the night before the accident. Two cylinders were worked on and a fuel injector nozzle was cleaned. The climb after takeoff was 'low and slow' during which the airplane rolled left, pitched nose down, and impacted the ground coming to rest adjacent to a house. Examination of each engine revealed no evidence of internal mechanical failure or malfunction. Heat damage precluded testing of the magnetos, turbocharger components, and fuel servos of each engine. Examination of each propeller revealed no evidence of preimpact failure or malfunction. The fuel nozzles from the left engine were examined which revealed that they were blocked in various places due to contaminants. After the accident the faa performed a focused inspection of the operator revealing that the cargo was not being weighed, the chief pilot of the company was in name only, and load manifests were not being kept by the company. The pilot, sole on board, was killed. ", "probable_cause": "In flight loss of control for failure of the pilot-in-command to maintain vmc shortly after takeoff. Contributing to the accident was partial loss of engine power from the left engine due to partial blockage of several of the fuel injector nozzles. Also contributing to the accident was weight and balance exceeded by the pilot-in-command and inadequate surveillance by the company and by the FAA."}