{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-clayton-1-killed", "date": "Jul 26, 2014 at 0850 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Max Two", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Clayton - Aurora", "msn": "46-8608024", "yom": 1986, "flight_number": null, "city": "Clayton", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4200, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3593, "circumstances": "The pilot was departing the private, fly-in community airport on a personal flight. He was familiar with the airport/fly-in community and was instrumental in its development. Fog was present at the time, and, according to witnesses, it was \"rolling up the valley,\" which was a frequent event at the airport. The witnesses observed the airplane lift off the runway, drift to the left, and disappear into the fog with the landing gear extended. They heard the engine running normally, with no change in sound, until the crash. They heard two distinct \"booms\" about 4 to 6 seconds apart. They ran down to the departure end of the runway to look for a crash site and could not see the wreckage or any smoke or fire due to the fog. The wreckage was located on elevated terrain in a heavily wooded area, about 1,500 feet north of the departure end of the runway. The elevation at the crash site was about 250 feet higher than the elevation at the departure end of runway. A swath through the treetops leading to the main wreckage was indicative of a near-level flight path at impact. An examination of the airframe and engine did not reveal any evidence of a preexisting mechanical malfunction or failure. A review of the weather by a NTSB meteorologist revealed that the departure airport was at the edge of an area of low-topped clouds. Airport remarks included \"Mountainous terrain all quadrants.\" ", "probable_cause": "The pilot's decision to begin a flight with fog and low clouds present at the airport, which resulted in an encounter with instrument meteorological conditions immediately after takeoff and a controlled flight into terrain. "}