{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-wilmington", "date": "Jan 4, 2009 at 0209 LT", "type": "Cessna 550 Citation II", "operator": "Caribair-SA1", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "La Isabela - Wilmington", "msn": "550-0406", "yom": 1982, "flight_number": null, "city": "Wilmington-New Hanover County", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6914, "captain_hours_type": 1400, "copilot_hours": 1717, "copilot_hours_type": null, "aircraft_hours": 11123, "circumstances": "During a night, northbound, international over water flight that paralleled the east coast of the southeast United States, the airplane encountered headwinds. Upon arrival at the intended destination, the weather was below forecasted conditions, resulting in multiple instrument approach attempts. After the first missed approach, the controller advised the crew that there was an airport 36 miles to the north with \"much better\" weather, but the crew declined, citing a need to clear customs. During the third missed approach, the left engine lost power, and while the  airplane was being vectored for a fourth approach, the right engine lost power. Utilizing the global positioning system, the captain pointed the airplane toward the intersection of the airport's two runways. Approximately 50 feet above the ground, he saw runway lights, and landed. The captain attempted to lower the landing gear prior to the landing, but it would not extend due to a lack of hydraulic pressure from the loss of engine power, and the alternate gear extension would not have been completed in time. The gear up landing resulted in damage to the underside of the fuselage and punctures of the pressure vessel. The captain stated that the airplane arrived in the vicinity of the destination with about 1,000 pounds of fuel on board or 55 minutes of fuel remaining. However, air traffic and cockpit voice recordings revealed that the right engine lost power about 14 minutes after arrival, and the left engine, about 20 minutes after arrival. Federal air regulations require, for an instrument flight rules flight plan, that an airplane carry enough fuel to complete the flight to the first airport of landing, fly from that airport to an alternate, and fly after that for 45 minutes at normal cruising speed. The loss of engine power was due to fuel exhaustion, with no preaccident mechanical anomalies noted to the airplane. ", "probable_cause": "A loss of engine power due to the crew's inadequate in-flight fuel monitoring."}