{"url": "https://www.baaa-acro.com/crash/crash-cessna-560xls-citation-excel-aarhus", "date": "Aug 6, 2019 at 0036 LT", "type": "Cessna 560XLS Citation Excel", "operator": "Aerowest", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Oslo - Aarhus", "msn": "560-6002", "yom": 2008, "flight_number": null, "city": "Aarhus-Tirstrup", "zone": "Midtjylland", "country": "Denmark", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The accident occurred during an IFR air taxi flight from Oslo (ENGM) to Aarhus (EKAH). The flight was uneventful until the landing phase. The commander was the pilot flying, and the first officer was the pilot monitoring. En route, the flight crew set the Vapp 15° to 123 knots (kt) and the Vref 35° to 116 kt and agreed upon, if foggy at EKAH, to pull the curtains between the cockpit and the passenger cabin in order to avoid blinding from lights in the passenger cabin. During the descent, the flight crew decided not to descend below Flight Level (FL) 170, if the weather did not allow an approach and landing in EKAH. Instead they would continue to a pre-planned destination alternate. The pre-planned and nearest useable destination alternate was Billund (EKBI) at a great circle distance of 60 nautical miles southwest of EKAH. At 22:09 hrs, the first officer established preliminary radio contact with Aarhus Tower (118.525 MegaHertz (MHz)) in order to obtain the latest weather report for EKAH. The air traffic controller at Aarhus Tower communicated the following landing details: \r\n- Expected landing on runway 10R. \r\n- Wind conditions to be 140° 2 kt. \r\n- Meteorological visibility to be 250 meters (m).\r\n- Runway Visual Range (RVR) at landing to be 900 m, 750 m, and 400 m in fog patches.\r\n- Few clouds at 200 feet (ft), few clouds at 6500 ft.\r\n- Temperature 16° Celcius (C) and Dewpoint 15° C.\r\n- QNH 1008 Hectopascal (hPa).\r\nThe first officer read back a meteorological visibility of 2500 m to the commander. The flight crew discussed the reported RVR values and agreed that runway 10R would be the preferable landing runway. The commander made an approach briefing for the Instrument Landing System (ILS) for runway 10R including a summary of SOP in case of a missed approach. The first officer pulled the curtain between the cockpit and the passenger cabin. At established radio contact with Aarhus Approach (119.275 MHz) at 22:20 hrs, the air traffic controller instructed the flight crew to descend to altitude 3000 feet on QNH 1008 hPa and to expect radar vectors for an ILS approach to runway 10R. The flight crew performed the approach checklist. The flight crew discussed the weather situation at EKAH with expected shallow fog and fog patches at landing. At 22:28 hrs, the air traffic controller instructed the flight crew to turn right by 10°, descend to 2000 ft on QNH 1008 hPa, and informed that Low Visibility Procedures (LVP) were in operation at EKAH. Due the weather conditions, the air traffic controller radar vectored the aircraft for a long final allowing the flight crew to be properly established before the final approach. The commander called out the instrument presentation of an operative radio altimeter. At 22:31 hrs, the air traffic controller instructed the flight crew to turn left on heading 130° and cleared the flight crew to perform an ILS approach to runway 10R. The commander armed the approach mode of the aircraft Automatic Flight Control System and ordered a flap setting of 15°. When established on the LLZ for runway 10R and shortly before leaving 2000 ft on the GS, the commander through shallow fog obtained and called visual contact with the approach and runway lighting system. At that point, the first officer as well noted the approach and runway lighting system including the position of the green threshold identification lights. The commander ordered a landing gear down selection. The flight crew observed that a fog layer was situated above the middle of the runway. Though visual contact with the approach and runway lighting system, the commander requested altitude call-outs on approach. The commander ordered a flap setting of 35°. The aircraft was established on the ILS (LLZ and GS) for runway 10R in landing configuration. At 22:32 hrs, the first officer reported to Aarhus Approach that the aircraft was established on the ILS for runway 10R. The air traffic controller reported the wind conditions to be 150° 2 kt and cleared the aircraft to land on runway 10R. The flight crew initiated the final checklist. The landing lights were on. The first officer noted two white and two red lights of the Precision Approach Path Indicator (PAPI) to the left of runway 10R. Passing approximately 1500 ft Radio Height (RH), the first officer reported to the commander visual contact with the approach and runway lighting system, fog above the middle of the runway, and that the touchdown zone and the runway end were both visible. The commander confirmed. At approximately 900 ft RH, the commander disengaged the autopilot, and the flight crew completed the final checklist. The aircraft was established on the ILS (LLZ and GS) for runway 10R in landing configuration at a recorded computed airspeed of approximately 128 kt. The first officer called: 500 to minimum (passing approximately 800 ft RH), and the commander called: Runway in sight. The commander confirmed that the intensity of the approach and runway lighting system was okay. The commander informed the first officer that the intention was to touch down at the beginning of the runway. In order to avoid entering fog patches during the landing roll, the commander planned flying one dot below the GS, performing a towed approach, and touching down on the threshold. However, the commander did not communicate this plan of action to the first officer. The aircraft started descending below the GS for runway 10R. The first officer asked the commander whether to cancel potential Enhanced Ground Proximity Warning System (EGPWS) GS warnings. The commander confirmed. At approximately 500 ft RH, the Solid State Flight Data Recorder (SSFDR) recorded cancellation of potential EGPWS GS warnings. The aircraft aural alert warning system announced passing 500 feet RH. The recorded computed airspeed was 125 kt, the recorded vertical speed was approximately 700 ft/minute, and the GS deviation approached one dot below the GS. The commander noted the PAPI indicating the aircraft flying below the GS (one white and three red lights). The first officer called: Approaching minimum. Shortly after, the aircraft aural alert warning system announced: Minimums Minimums. The SSFDR recorded a beginning thrust reduction towards flight idle and a full scale GS deviation (flying below). The commander called: Continue. The commander had visual contact with the approach and runway lighting system. It was the perception of the first officer that the commander had sufficient visual cues to continue the approach and landing. The first officer as pilot monitoring neither made callouts on altitude nor deviation from GS. The commander noticed passing a white crossbar, a second white crossbar and then red lights. To the commander, the red lights indicated the beginning of runway 10R, and the commander initiated the flare. The aircraft collided with the antenna mast system of the LLZ for runway 28L, touched down in the grass RESA for runway 28L, and the nose landing gear collided with a near field antenna (LLZ for runway 28L) and collapsed. The aircraft ended up on runway 10R. Throughout the sequence of events and due to fog, the air traffic controller in the control tower (Aarhus Approach) had neither visual contact with the approach sector, the threshold for runway 10R nor the aircraft on ground, when it came to a full stop. Upon full stop on runway 10R, the first officer with a calm voice reported to Aarhus Approach: Aarhus Tower, Delta Whiskey Mike, we had a crash landing. The air traffic controller did not quite perceive the reporting and was uncertain on the content of the reporting and replied: Say again. The cabin crewmember without instructions from the flight crew initiated the evacuation of the passengers via the cabin entry door. The aircraft caught fire. Aarhus Approach and the Aerodrome Office in cooperation activated the aerodrome firefighting services and the area emergency dispatch centre. Upon completion of the on ground emergency procedure and the evacuation of the aircraft, the flight crew met the cabin crewmember and the passengers at a safe distance in front of the aircraft.", "probable_cause": "The following factors were identified:\r\n1. Deviations from SOP in dark night and low visibility combined with the cancellation of a hardware safety barrier compromised flight safety.\r\n2. The commander started flying below the GS. \r\n3. Both pilots accepted and instituted a deactivation of a hardware safety barrier by cancelling potential EGPWS GS alerts for excessive GS deviations.\r\n4. Both pilots accepted and instituted a deviation from SOP by not maintaining the GS upon runway visual references in sight.\r\n5. At low altitude, the first officer made no corrective call-outs on altitude, GS deviation or unstabilized approach.\r\n6. The confusion over and misinterpretation of the CAT 1 approach and runway lighting system resulted in a too early flare and consequently a CFIT."}