{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-recife", "date": "Oct 21, 1999 at 0745 LT", "type": "Rockwell Shrike Commander 500", "operator": "Celso Tinoco Taxi Aéreo", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Recife – Patos – Sousa – Mossoró – Caicó – Currais Novos – Recife", "msn": "500-1801-16", "yom": 1968, "flight_number": null, "city": "Recife-Guararapes", "zone": "Pernambuco", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4000, "captain_hours_type": 600, "copilot_hours": 500, "copilot_hours_type": 100, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Recife-Guararapes Airport in the early morning on a round cargo trip with a load of medicines. Complete stops were made in Patos, Sousa, Mossoró, Caicó and Currais Novos. On the last leg from Currais Novos to Recife, while approaching Recife-Guararapes Airport, both engines failed simultaneously after a total flight of 3 hours and 50 minutes. The crew declared an emergency and attempted to land immediately when the aircraft collided with trees and power cables before crashing in a wooded area located 17 km short of runway 18. Both pilots were injured and the aircraft was damaged beyond repair. ", "probable_cause": "Double engine failure on final approach due to fuel exhaustion. The following contributing factors were identified:\r\n- Poor flight preparation and planning, \r\n- The crew was overconfident,\r\n- The crew miscalculated the total fuel quantity needed for the entire mission, \r\n- Wrong fuel consumption calculation, \r\n- Taxing time and wind component were not taken into consideration in the fuel consumption calculation, \r\n- Incorrect values relative to the aircraft performances, \r\n- Poor crew resources management. "}