{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200-super-king-air-atqasuk", "date": "May 16, 2011 at 0218 LT", "type": "Beechcraft 200 Super King Air", "operator": "North%20Slope%20Borough", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Barrow - Atqasuk - Anchorage", "msn": "BB-1016", "yom": 1982, "flight_number": null, "city": "Atqasuk", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9000, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9847, "circumstances": "The pilot had worked a 10-hour shift the day of the accident and had been off duty about 2 hours when the chief pilot called him around midnight to transport a patient. The pilot accepted the flight and, about 2 hours later, was on an instrument approach to the airport to pick up the patient. While on the instrument approach, all of the anti-ice and deice systems were turned on. The pilot said that the deice boots seemed to be shedding the ice almost completely. He extended the flaps and lowered the landing gear to descend; he then added power, but the airspeed continued to decrease. The airplane continued to descend, and he raised the flaps and landing gear and applied full climb power. The airplane shuddered as it climbed, and the airspeed continued to decrease. The stall warning horn came on, and the pilot lowered the nose to increase the airspeed. The airplane descended until it impacted level, snow-covered terrain. The airplane was equipped with satellite tracking and engine and flight control monitoring. The minimum safe operating speed for the airplane in continuous icing conditions is 140 knots indicated airspeed. The airplane's IAS dropped below 140 knots 4 minutes prior to impact. During the last 1 minute of flight, the indicated airspeed varied from a high of 124.5 knots to a low of 64.6 knots, and the vertical speed varied from  1,965 feet per minute to -2,464 feet per minute. The last data recorded prior to the impact showed that the airplane was at an indicated airspeed of 68 knots, descending at 1,651 feet per minute, and the nose was pitched up at 20 degrees. The pilot did not indicate that there were any mechanical issues with the airplane. The chief pilot reported that pilots are on call for 14 consecutive 24-hour periods before receiving two weeks off. He said that the accident pilot had worked the previous day but that the pilot stated that he was rested enough to accept the mission. The chief pilot indicated he was aware that sleep cycles and circadian rhythms are disturbed by varied and prolonged activity. An NTSB study found that pilots with more than 12 hours of time since waking made significantly more procedural and tactical decision errors than pilots with less than 12 hours of time since waking. A 2000 FAA study found accidents to be more prevalent among pilots who had been on duty for more than 10 hours, and a study by the U.S. Naval Safety Center found that pilots who were on duty for more than 10 of the last 24 hours were more likely to be involved in pilot-at-fault accidents than pilots who had less duty time. The operator’s management stated that they do not prioritize patient  transportation with regard to their medical condition but base their decision to transport on a request from medical staff and availability of a pilot and aircraft, and suitable weather. The morning of the accident, the patient subsequently took a commercial flight to another hospital to receive medical treatment for his non-critical injury/illness. Given the long duty day and the early morning departure time of the flight, it is likely the pilot experienced significant levels of fatigue that substantially degraded his ability to monitor the airplane during a dark night instrument flight in icing conditions. The NTSB has issued numerous recommendations to improve emergency medical services aviation operations. One safety recommendation (A-06-13) addresses the importance of conducting a thorough risk assessment before accepting a flight. The safety recommendation asked the Federal Aviation Administration to \"require all emergency medical services (EMS) operators to develop and implement flight risk evaluation programs that include training all employees involved in the operation, procedures that support the systematic evaluation of flight risks, and consultation with others trained in EMS flight operations if the risks reach a predefined level.\" Had such a thorough risk assessment been performed, the decision to launch a fatigued pilot into icing conditions late at night may have been different or additional precautions may have been taken to alleviate the risk. The NTSB is also concerned that the pressure to conduct EMS operations safely and quickly in various environmental conditions (for example, in inclement weather and at night) increases the risk of accidents when compared to other types of patient transport methods, including ground ambulances or commercial flights. However, guidelines vary greatly for determining the mode of and need for transportation. Thus, the NTSB recommended, in safety recommendation A-09-103, that the Federal Interagency Committee on Emergency Medical Services (FICEMS) \"develop national guidelines for the selection of appropriate emergency transportation modes for urgent care.\" The most recent correspondence from FICEMS indicated that the guidelines are close to being finalized and distributed to members. Such guidance will help hospitals and physicians assess the appropriate mode of transport for patients.", "probable_cause": "The pilot did not maintain sufficient airspeed during an instrument approach in icing conditions, which resulted in an aerodynamic stall and loss of control. Contributing to the accident were the pilot’s fatigue, the operator’s decision to initiate the flight without conducting a formal risk assessment that included time of day, weather, and crew rest, and the lack of guidelines for the medical\r\ncommunity to determine the appropriate mode of transportation for patients."}