{"url": "https://www.baaa-acro.com/crash/crash-bristol-170-freighter-32-saint-peter", "date": "Sep 24, 1963 at 1123 LT", "type": "Bristol 170 Freighter", "operator": "British United Air Ferries - BAF", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Saint Peter - Bournemouth", "msn": "13073", "yom": 1953, "flight_number": null, "city": "Saint Peter-La Villiaze", "zone": "Channel Islands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8500, "captain_hours_type": 5000, "copilot_hours": 7800, "copilot_hours_type": 1600, "aircraft_hours": null, "circumstances": "The aircraft was returning to Bournemouth from Guernsey on a passenger and vehicle service flight. The copilot was flying the aircraft from the left-hand seat, and the pilot-in-command was performing the duties of the copilot. The engines were started at 1112 hours GMT. The brakes operated satisfactorily at this time. Following a normal run-up and check of the engines and the throttles were opened slowly because of a 17 kt crosswind component. The aircraft' reached a speed of 50 kt, and the rpm of the port engine began to rise. The pilot-in-command tried to control it by moving back the propeller control lever. The rpm commenced to surge and, as the aircraft's speed was then about 4 kt less than the single-engine safety speed (84 kt), the pilot-in-command ordered the copilot to abandon the takeoff. According to the testimony of the pilot-in-command following the accident, the brakes had little or no effect, and realizing that the aircraft would overrun the runway, he pulled back both propeller pitch control levers in order to stop the engines. Shortly before reaching the end of the runway the aircraft was turned to the left to avoid the approach lights. The aircraft became airborne for about 33 yd, then passed through the boundary fence of the stopway and struck a bank surmounted by a hedge where its port landing gear collapsed. Thereafter it crossed a hedge-lined road, and the starboard landing gear was deflected rearward. Finally it slid about 60 yd on its belly and stopped near a house. The accident occurred at 1123 hours GMT. ", "probable_cause": "The pilot-in-command abandoned the take-off due to a malfunction of the port power unit but was unable to bring the aircraft to a stop on the runway remaining. "}