{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-30-fukuoka-3-killed", "date": "Jun 13, 1996 at 1208 LT", "type": "Douglas DC-10", "operator": "Garuda-Indonesia", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fukuoka – Denpasar – Jakarta", "msn": "46685", "yom": 1979, "flight_number": "GA865", "city": "Fukuoka", "zone": "Kyūshū", "country": "Japan", "region": "Asia", "crew_on_board": 15, "crew_fatalities": 0, "pax_on_board": 260, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 10263, "captain_hours_type": 2641, "copilot_hours": 3910, "copilot_hours_type": 1437, "aircraft_hours": 46325, "circumstances": "During the takeoff roll at Fukuoka-Itazuke Airport runway 16, at a speed of 158 knots, the captain started the rotation. During initial climb, at a height of about 3 metres, the right engine suffered a loss of power after a fan blade located on the 1st stage of the high pressure compressor disk separated. The N1 dropped to 23,7% and five seconds later, the flight engineer informed the crew about the failure of the engine n°1. The captain decided to abort the takeoff and landed back on runway. The aircraft contacted ground with a vertical acceleration of 2,1 g then thrust reversers were deployed and ground spoilers were extended. Unable to stop within the remaining distance, the aircraft overran, crossed a road, skidded for about 620 metres before coming to rest in an open field, bursting into flames. Three passengers were killed. ", "probable_cause": "Although the CAS was well in excess of V1 and the aircraft had already lifted off from the runway, the takeoff was aborted. Consequently the aircraft departed the end of the runway, came to rest and caught fire. It is estimated that contributing to the rejection of the takeoff under this circumstance was the fact that the CAP's judgement in the event of the engine failure was inadequate. Investigation revealed that the turbine blade that failed, had operated for 30913 hours and 6182 cycles. General Electric had advised customers to discard blades after about 6000 cycles."}