{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-gii-logan", "date": "Jan 19, 2005 at 2030 LT", "type": "Gulfstream GII", "operator": "CFS Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kansas City – Logan", "msn": "113", "yom": 1972, "flight_number": null, "city": "Logan-Cache", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5320, "captain_hours_type": 1253, "copilot_hours": 8000, "copilot_hours_type": 3000, "aircraft_hours": 12011, "circumstances": "The captain stated they had flown the GPS approach to runway 35. When they did not see the runway or runway environment they initiated a missed approach. During the missed approach, they were able to see the first 4 to 5 thousand feet on the approach end of runway 17. They \"elected to circle to the north west to set up for a visual approach to runway 17.\" The captain stated that the approach was \"slightly high and as a result, the flare was a bit higher than normal.\" The airplane entered the fog layer just prior to touchdown. The captain stated that during the landing flare the airplane had drifted to the left and \"the aircraft settled onto the runway to the left of centerline and shortly thereafter the left main gear impacted a snow berm.\" The airplane turned hard to the left and departed the runway. The nose gear separated, the radome was crushed and the cockpit pressure bulkhead was broken open. The routine aviation weather report (METAR) at LGU reported the weather as follows: wind, calm; visibility, 1/4 statute mile in freezing fog; sky condition, vertical visibility 100 feet agl; temperature, minus 7 degrees Celsius (C), dewpoint, minus 7 degrees C; altimeter, 30.45 inches.", "probable_cause": "The pilot's improper IFR operation by which he failed to comply to the missed approach procedure, and his improper evaluation of the weather resulting in an encounter with fog and his loss of visual contact with the runway during the landing."}