{"url": "https://www.baaa-acro.com/crash/crash-ryan-b-5-brougham-liard-river-1-killed", "date": "Oct 10, 1930", "type": "Ryan B-5 Brougham", "operator": "Canadian Aerial Explorations", "flight_phase": "Flight", "flight_type": "Geographical / Geophysical / Scientific", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Atlin - Liard Post", "msn": "189", "yom": 1929, "flight_number": null, "city": "Liard River", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On October 9, 1930 Captain E. J. 'Paddy' Burke departed Atlin in his float-equipped aircraft with two passengers on board, bound for Liard Post. On the return flight the next day, snow squalls forced the trio to land on the Liard River to await better weather. When persistent weather problems forced a third landing Liard River, a float was damaged, leaving the aircraft and its three occupants stranded, considerably off course from the straight line track between Atlin and Liard Post. A massive search was launched, and eventually abandoned. By November 12, only one search plane doggedly persisted. It was Everett Wasson and trapper Joe Walsh in the Treadwell Yukon Fairchild G-CARM. On November 24 Walsh and Wasson spotted the abandoned, snow covered aircraft, and 12 days later discovered two survivors forty miles up the Liard River from the plane. Pilot Paddy Burke had died of exposure and starvation. Aircraft mechanic Emil Kading and passenger Bob Martin had survived 2 months in the winter wilderness with very little food or equipment. The nearest suitable landing site for Wasson's ski equipped Fairchild was 10 miles from the starving survivor's camp. After three days of snowshoeing, sledding and back-packing, Wasson and Walsh had Kadding and Martin safely aboard the Fairchild, on there way to Whitehorse. Six days later Wasson returned to the Liard River and retrieved the body of Paddy Burke. And so ended on of the longest air search in Canadian history. The Following spring a salvage crew removed the Junkers from its ice bound floats, installed a set of skies, and flew the aircraft out. In the original text, the aircraft involved was mentioned as being a Junkers F.13.\n\r\nSource: Yukon Transportation Museum, Whitehorse, Yukon Territory", "probable_cause": null}