{"url": "https://www.baaa-acro.com/crash/crash-cessna-525a-citationjet-cj2-dexter", "date": "Oct 7, 2002 at 1017 LT", "type": "Cessna 525 CitationJet CJ2", "operator": "Exec-Jet", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Plainville - Dexter", "msn": "525A-0057", "yom": 2002, "flight_number": null, "city": "Dexter", "zone": "Maine", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2450, "captain_hours_type": 872, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 113, "circumstances": "The pilot/owner initiated a VFR approach and landing in a Cessna 525A, to a 3,009-foot long runway with a tailwind of about 7 knots. The touchdown was 642 feet past the approach end of the runway. Vref was calculated to be 108 kts; however, data from the EGPWS showed the ground speed was about 137 kts, 9 seconds before touchdown, and at touchdown, the speed was estimated to be about 130 kts. After touchdown, the pilot selected ground flaps, which moved the flaps from 35 degrees to 60 degrees, the spoilers auto-deployed, and the speed brakes were extended. The pilot said that after applying the brakes, he felt the brakes pedals pulsing, and did not think the airplane was slowing. He released the brakes for a few seconds and then reapplied them. Again, he felt the pulsing in the pedals, but the airplane was not slowing as he expected. He released the brakes, reset the flaps to takeoff, and applied power to abort the landing when he was about halfway down the runway. The airplane departed the end of the runway and traveled for about 300 feet. Skid marks revealed the initial touchdown was most like made with brakes applied, and no locked wheel crossover protection. Additional skid marks revealed the airplane became airborne after touchdown, and in the next 750 ft, touched down 3 more times, each subsequent touchdown occurring without the full weight of the airplane on the wheels. Tire marks on the last half of the runway were consistent with brakes applied and anti-skid operative. Using the approved flight manual standards, the airplane would have required 3,155 feet to stop. This was predicated on crossing the threshold at 50 feet, at Vref, and included a ground roll of 1,895 feet. However, the pilot touched down at 642 feet from the threshold, which left sufficient runway for stopping. Using the pilot's touchdown point of 642 feet, the airplane was capable of stopping on the runway with a Vref as high as 120 kts. The approach was unstabilized with 4 aural warnings, including 2 sink rate warnings on final approach, the last of which occurred with a descent rate of over 1,700 fpm down, 19 seconds prior to touchdown, and about 400 feet above the ground. The last airborne GPS position was about 2,000 ft from runway touchdown. This would have required a flight path angle of about 3.8 degrees to achieve the reported touchdown position.", "probable_cause": "The pilot's improper decision to land with excessive speed, and his delayed decision to perform an aborted landing, both of which resulted in a runway overrun. A factor was the tailwind."}