{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-freeport-4-killed", "date": "Aug 18, 2014 at 1002 LT", "type": "Cessna 340", "operator": "Aqua Sun Investments", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Ormond Beach - Freeport", "msn": "340A-0635", "yom": 1978, "flight_number": null, "city": "Freeport", "zone": "West Grand Bahama", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5572, "circumstances": "On 18 August, 2014 at 10:02am local time (1402Z) UTC a fixed wing, twin-engine, Cessna 3 4 0 A aircraft, United States registration N340MM, serial number 340A0635, crashed into waters while on a left base to runway 06 at Grand Bahama International Airport (MYGF) Freeport, Grand Bahama, Bahamas. The aircraft departed Ormond Beach Municipal Airport (KOMN) at 8:51am local time (1251Z) for Grand Bahama International Airport (MYGF) on an Instrument Flight Rules (IFR) flight plan with the pilot and three passengers aboard. Sometime after 9:00am (1300Z) an IFR inbound flight plan on N340MM was received by Freeport Approach Control from Miami Center. Upon initial contact with Freeport Approach Control the pilot was given weather advisory, re-cleared to Freeport VOR and told to maintain four thousand feet and report at JAKEL intersection. He was also advised to expect an RNAV runway six approach. After the pilot’s acknowledgement of the information he later acknowledged his position crossing JAKEL. Freeport Approach then instructed the aircraft to descend to two thousand feet and cleared him direct to JENIB intersection for the RNAV runway six (6) approach. After descending to two thousand feet the pilot indicated to Freeport Approach that he had the field in sight and was able to make a visual approach. Freeport Approach re-cleared the aircraft for a visual approach and instructed the pilot to contact Freeport Control Tower on frequency 118.5. At 9:57am (1357Z) N340MM established contact with Freeport Tower and was cleared for the visual approach to runway six; he was told to join the left base and report at five (5) DME. At 10:01am (1401Z) the pilot reported being out of fuel and his intention was to dead stick the aircraft into the airport from seven miles out at an altitude of one thousand five hundred feet. A minute later the pilot radioed ATC to indicate they “were going down and expected to be in the water about five miles north of the airport.” Freeport Tower tried to get confirmation of the last transmission but was unable to. Several more calls went out from Freeport Tower to N340MM but communication was never reestablished. Freeport Control Tower then made request of aircrafts departing and arriving to assist in locating the lost aircraft by over flying the vicinity of the last reported position to see if visual contact could be made. An inbound aircraft reported seeing an aircraft down five miles from the airport on the 300 degree radial of the ZFP VOR. Calls were made to all the relevant agencies and search and rescue initiated. The aircraft was located at GPS coordinates 26˚ 35.708’N and 078˚ 47. 431 W. The aircraft received substantial damage as a result of the impact and crash sequence. There were no survivors.", "probable_cause": "The probable cause of this accident has been determined as a lack of situational awareness resulting in a stalled condition and loss of control while attempting to remedy a fuel exhaustion condition at a very low altitude.\r\nContributing factors:\r\n- The pilot’s incorrect fuel calculations which resulted in fuel exhaustion to both engines.\r\n- Stalled aircraft.\r\n- Loss of situational awareness."}