{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-ii-xl-harrison-1-killed", "date": "Dec 4, 2009 at 1845 LT", "type": "Piper PA-31 Cheyenne", "operator": "Cheyenne Sales & Leasing", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Plain, Valley", "schedule": "Charlevoix - Tiffin", "msn": "31-8166055", "yom": 1981, "flight_number": null, "city": "Harrison", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 13000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9436, "circumstances": "Shortly after takeoff in the pressurized twin-engine airplane, the pilot was cleared to climb and maintain 16,000 feet. The pilot reported passing through instrument conditions with heavy snow and that he cleared the tops of the clouds at 7,000 feet. The pilot was then cleared to climb and maintain flight level (FL) 230. Radar data showed the airplane's altitude and course varied throughout the flight after having reached FL 230. Several times during the flight the air traffic controller questioned the pilot regarding his altitude and/or course. Each time the pilot responded that he was at the correct altitude and/or course. The radar data showed that after each of these conversations, the airplane would return to the assigned altitude and/or course. The controller then informed the pilot that, because radar showed the airplane’s altitude fluctuating between FL 224 and FL 237, he was going to have to descend out of positive controller airspace. The pilot acknowledged this transmission. The controller instructed the pilot to descend to 17,000 feet. The last transmission from the pilot was when he acknowledged the descent. Radar data showed that one minute later the airplane was at FL 234. During the last minute and 12 seconds of radar data, the airplane reversed its course and descended from FL 233 to FL 214, at which time radar data was lost. Witnesses reported hearing loud engine sounds and seeing the airplane in a spiraling descent until ground impact. Post accident inspection of the engines did not identify any anomalies that would have precluded normal operation. Most of the fuselage was consumed by fire; however, flight control continuity was established. Given the pilot’s experience and the flight’s altitude and course variations the investigation considered that the pilot may have suffered from hypoxia; however, due to the post impact fire the functionality of the airplane’s pressurization system could not  be observed and no conclusive determination could be made that the pilot as impaired.\n", "probable_cause": "A loss of aircraft control for undetermined reasons."}