{"url": "https://www.baaa-acro.com/crash/crash-cessna-208a-caravan-jacareacanga-2-killed", "date": "Apr 26, 1994 at 0740 LT", "type": "Cessna 208A Caravan", "operator": "Penta", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Itaituba - Jacareacanga", "msn": "208-0039", "yom": 1986, "flight_number": null, "city": "Jacareacanga", "zone": "Pará", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6000, "captain_hours_type": 2000, "copilot_hours": 800, "copilot_hours_type": 350, "aircraft_hours": null, "circumstances": "Five minutes after takeoff from Itaituba Airport, the crew was informed about weather conditions at destination with ceiling at ground and a visibility less than 300 metres which means that the conditions were below minimums. Upon arrival, the crew was unable to establish a visual contact with the airport and decided to circle for weather improvement. Few minutes later, the single engine aircraft crashed near the airport, killing both pilots. ", "probable_cause": "The accident was the consequence of the following factors:\r\n1) Adverse Weather Conditions - Contributed\r\nWeather conditions were unfavorable at the destination location for visual flight. There was a layer of fog near the forest.\r\n2) Poor Instruction - Contributed\r\nThe Commander was not qualified to fly that type of aircraft and was not instrument cleared.\r\n3) Disabled Judge - Contributed\r\nThe pilots continued the flight, even knowing the adverse weather conditions at their destination.\r\n4) Flight Indiscipline - Contributed\r\nOne of the pilots was not qualified to fly that aircraft and, in addition, there was intentional disobedience to the air traffic rules and regulations, regarding the non observance of the minimum IFR flight level in the industry.\r\n5) Disabled Oversight - Contributed\r\nThere was poor oversight of the responsible company by letting an unqualified pilot operate the aircraft.\r\n6) Weak Cabin Coordination - Contributed\r\nIFR flight without complying with IMA 100-12 rules, conducted below the limits and outside the descent profile are indications that there was no planning/coordination in the operations performed in the cockpit."}