{"url": "https://www.baaa-acro.com/crash/crash-embraer-erj-190-100-igw-santa-marta", "date": "Jul 17, 2007 at 1519 LT", "type": "Embraer ERJ-190", "operator": "AeroRepublica", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cali - Santa Marta", "msn": "190-00076", "yom": 2007, "flight_number": "RPB7330", "city": "Santa Marta-Simón Bolívar", "zone": "Magdalena", "country": "Colombia", "region": "South America", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 54, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13737, "captain_hours_type": 238, "copilot_hours": 2148, "copilot_hours_type": 233, "aircraft_hours": 998, "circumstances": "Following an uneventful flight from Cali, the crew started the approach to Santa Marta-Simón Bolívar Airport runway 01. On final approach, the crew encountered poor weather conditions with heavy rain falls, turbulences and windshear. As the aircraft was unstable, the captain decided to abandon the approach and initiated a go-around procedure. Few minutes later, the crew started a second approach. Still unstable, the aircraft landed too far down the wet runway 01 at an excessive speed, about 490 metres from the runway end. Unable to stop within the remaining distance, the aircraft overran, went through a fence, collided with pylons, went down a concrete embankment and came to rest with the cockpit in the sea. All 60 occupants evacuated safely while the aircraft was damaged beyond repair. ", "probable_cause": " Continuation of the approach and landing without being stabilized on finals with an excessive speed caused the aircraft to cross the threshold of the runway with an additional 41 knots during a low angle approach, which caused the aircraft wheels to touch down positively when there were only 490 meters of runway available, an insufficient distance to stop the aircraft within the runway.\r\nThe following contributing factors were identified:\r\n- Lack of situational awareness regarding the approach and landing speed, after having disconnected the automated systems of the aircraft.\r\n- Omission of call outs by the Pilot Monitoring to warn the pilot in control of speeding in order to persuade him to execute a missed approach.\r\n- The delay in initiating a missed approach procedure / interrupted landing in circumstances that indicated the desirability to take such a measure during a destabilized approach.\r\n- Misperception to believe that the aircraft could be stopped within the limited remaining available runway without analyzing the status and distance without having positive contact due to speeding."}