{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-mount-hotham-3-killed", "date": "Jul 8, 2005 at 1725 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "RL%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Melbourne - Mount Hotham", "msn": "31-8252021", "yom": 1982, "flight_number": null, "city": "Mount Hotham", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4770, "captain_hours_type": 1269, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9137, "circumstances": "On 8 July 2005, the pilot of a Piper PA-31-350 Navajo Chieftain, registered VH-OAO, submitted a visual flight rules (VFR) flight plan for a charter flight from Essendon Airport to Mount Hotham, Victoria. On board the aircraft were the pilot and two passengers. At the time, the weather conditions in the area of Mount Hotham were extreme. While taxiing at Essendon, the pilot requested and was granted an amended airways clearance to Wangaratta, due to the adverse weather conditions at Mount Hotham. The aircraft departed Essendon at 1629 Eastern Standard Time. At 1647 the pilot changed his destination to Mount Hotham. At 1648, the pilot contacted Flightwatch and requested that the operator telephone the Mount Hotham Airport and advise an anticipated arrival time of approximately 1719. The airport manager, who was also an accredited meteorological observer, told the Flightwatch operator that in the existing weather conditions the aircraft would be unable to land. At 1714, the pilot reported to air traffic control that the aircraft was overhead Mount Hotham and requested a change of flight category from VFR to instrument flight rules (IFR) in order to conduct a Runway 29 Area Navigation, Global Navigation Satellite System (RWY 29 RNAV GNSS) approach via the initial approach fix HOTEA. At 1725 the pilot broadcast on the Mount Hotham Mandatory Broadcast Zone frequency that the aircraft was on final approach for RWY 29 and requested that the runway lights be switched on. No further transmissions were received from the aircraft. The wreckage of the aircraft was located by helicopter at 1030 on 11 July. The aircraft had flown into trees in a level attitude, slightly banked to the right. Initial impact with the ridge was at about 200 ft below the elevation of the Mount Hotham aerodrome. The aircraft had broken into several large sections and an intense fire had consumed most of the cabin. The occupants were fatally injured.", "probable_cause": "Findings:\r\n• There were no indications prior to, or during the flight, of problems with any aircraft systems that may have contributed to the circumstances of the occurrence.\r\n• The pilot continued flight into forecast and known icing conditions in an aircraft not approved for flight in icing conditions.\r\n• The global navigation satellite constellation was operating normally.\r\n• The pilot did not comply with the requirements of the published instrument approach procedure.\r\n• The pilot was known, by his Chief Pilot and others, to adopt non-standard approach procedures to establish his aircraft clear of cloud when adverse weather conditions existed at Mount Hotham.\r\n• The pilot may have been experiencing self-imposed and external pressures to attempt a landing at Mount Hotham.\r\n• Terrain features would have been difficult to identify due to a heavy layer of  snow, poor visibility, low cloud, continuing heavy snowfall, drizzle, sleet and approaching end of daylight.\r\n• The pilot’s attitude, operational and compliance practices had been of concern to some Airservices’ staff.\r\n• The operator’s operational and compliance history was recorded by CASA as being of concern, and as a result CASA staff continued to monitor the operator. However, formal surveillance of the operator in the preceding two years had not identified any significant operational issues.\r\nSignificant factors:\r\n• The weather conditions at the time of the occurrence were extreme.\r\n• The extreme weather conditions were conducive to visual illusions associated with a flat light phenomenon.\r\n• The pilot did not comply with the requirements of flight under either the instrument flight rules (IFR) or the visual flight rules (VFR). \r\n• The pilot did not comply with the requirements of the published instrument approach procedure and flew the aircraft at an altitude that did not ensure terrain clearance.\r\n• The aircraft accident was consistent with controlled flight into terrain. "}