{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh106-comet-4c-mt-khao-yai-26-killed", "date": "Jul 19, 1962 at 2244 LT", "type": "De Havilland DH.106 Comet", "operator": "United-Arab-Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Tokyo – Hong Kong – Bangkok – Bombay – Bahrain – Cairo", "msn": "6464", "yom": 1962, "flight_number": "MS869", "city": "Mt Khao Yai", "zone": "Nakhon Nayok (นครนายก)", "country": "Thailand", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 18, "pax_fatalities": 18, "other_fatalities": 0, "total_fatalities": 26, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Flight UA869 departed from Hong Kong for Bangkok, an intermediate stop, on a scheduled service to Cairo. Takeoff time was 13:30 UTC. The flight climbed to 31000 ft, the selected cruising altitude. At 15:14 UA869 advised Bangkok ATC that the flight had crossed the Bangkok FIR boundary at 15:08 and passed over Ubol NDB at 15:13 and requested to fly direct from Ubol NDB to Bangkok VOR. This request was granted by Bangkok ATC. At this time UA869 advised Bangkok ATC that the ETA for Bangkok VOR would be 15:47. At 15:27 the flight advised Bangkok ATC that it would be over the 100 mile perimeter at 15:30. After reporting that it was 90 miles out the crew requested descent clearance to a lower altitude. Bangkok control cleared the flight to descend to 4000 ft on the Bangkok VOR radial of 073 degrees and to report when commencing descent from 31000 ft. The flight was instructed to contact Bangkok approach control at 15:39. At 15:35 the flight was cleared to 3000 ft and informed that the altimeter setting was 1007.8 mb. At 15:40 the flight transferred to the Bangkok approach control. Immediately after this UA869 reported to approach control that it was descending from 13000 ft and estimating Bangkok VOR at 15:44. Approach control advised the flight to adjust the altimeter setting to 1007.8 mb and then cleared the flight to cross Bangkok VOR for final approach on runway 21R and report immediately on descending from 3000 ft. This was the last contact with the flight. The Comet flew into the side of Khao Yai Mountain, 52 nm NE of Bangkok.", "probable_cause": "The principal cause of the accident was the pilot's action in commencing descent at 1530 hours when the aircraft was 137 miles and not 90 miles from the Bangkok VOR as reported to Bangkok Control, and the aircraft, therefore, collided with a mountain at a point 52 miles distant. It is probable that the pilot-in-command did not actually pass over the point he reported to the Flight Control Units, but only estimated he had passed three points which resulted in grave errors of time and distance in his computations. It is also probable that the pilot-in-command had been too self-confident so that his actions were not according to the fundamental principles of air navigation."}