{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-18v-forchheim-52-killed", "date": "Mar 28, 1961 at 2009 LT", "type": "Ilyushin II-18", "operator": "CSA-Czech-Airlines-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Prague – Zurich – Rabat – Dakar – Conakry – Bamako", "msn": "180 0021 02", "yom": 1960, "flight_number": "OK511", "city": "Forchheim", "zone": "Bavaria", "country": "Germany", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 44, "pax_fatalities": 44, "other_fatalities": 0, "total_fatalities": 52, "captain_hours": 8572, "captain_hours_type": 354, "copilot_hours": 11019, "copilot_hours_type": 179, "aircraft_hours": null, "circumstances": "While cruising at an altitude of 20,000 feet over Bavaria, the four engine aircraft disappeared from radar screens at 2009LT and crashed in a field located near Forchheim, north of Nuremberg. The crew was unable to send any distress call prior to the crash. The airplane disintegrated on impact and all 52 occupants were killed. ", "probable_cause": "In the light of the investigations undertaken, it is probable that the accident occurred in one of the following ways, although the possibility of other causes cannot be ruled out:\r\na) Forced descent causing the aircraft to exceed the structural stress factor in the approach manoeuvre or during the pull-out owing to: \r\n1) The aircraft falling into an uncontrollable flight position because of a defect in an artificial horizon or an electric instrument of equal importance. In air transport flight incidents throughout the world, where unintentional steep dives have occurred, such incidents can be explained by a defect in an artificial horizon,\r\n2) An unnoticed over control of the electrical rudder or aileron trim adjustment occurring when the automatic pilot was operating with flight movements resulting therefrom after the automatic pilot was disconnected. The automatic pilot was not equipped with a trim servo-indicator to give warning of excessive trim adjustment,\r\n3) Physical incapacity of one or both pilots.\r\nb) Intentional descent owing to the presence of smoke, fire or similar emergency, during which the structural stress factor was exceeded in the approach manoeuvre or in the pull-out."}