{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-i-sault-sainte-marie", "date": "Feb 26, 2001 at 1030 LT", "type": "Cessna 500 Citation", "operator": "Marlin-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Detroit – Sault Sainte Marie", "msn": "500-0105", "yom": 1973, "flight_number": null, "city": "Sault Sainte Marie", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2770, "captain_hours_type": 1410, "copilot_hours": 3142, "copilot_hours_type": 300, "aircraft_hours": 8329, "circumstances": "The captain said that he flew the VOR approach to runway 32. At 2,500 feet, the captain said that they were out of the clouds and initiated a visual straight-in approach. After aligning the airplane with the runway, the captain said he noticed that there was contamination on the runway, \"maybe compacted snow or maybe ice with fresh snow over it.\" The captain briefed that they would perform a go-around if by midfield they were not decelerating adequately. The captain said that they touched down within the first third of the runway. Close to midfield the airplane fishtailed. Past midfield, the captain called a go-around. The first officer said that the captain added power and he retracted the airbrakes. The first officer exclaimed, \"There is not enough runway! I braced myself as the aircraft went into the snow.\" The first officer said that at about 2 miles out from the runway, the unicom called and said that braking action was nil. A Notice to Airman, in effect at the time of the accident for the airport stated, \"icy runway, nil braking.\" ", "probable_cause": "The pilot exceeding the available runway distance during landing and the pilot's delay in executing a go-around. Factors relating to the accident were, the pilots improper in-flight planning/decision, the pilot disregarding the NOTAMS for the airport, the pilot failing to properly consider the warning given by the Unicom operator regarding the icy runway and nil braking action, the icy runway, and the drop-off/descending embankment."}