{"url": "https://www.baaa-acro.com/crash/crash-cessna-208a-caravan-675-abbotsford", "date": "Dec 28, 1999 at 0917 LT", "type": "Cessna 208A Caravan", "operator": "Seair%20Seaplanes", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Abbotsford - Billings - Nassau", "msn": "208-0310", "yom": 1999, "flight_number": null, "city": "Abbotsford", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12000, "captain_hours_type": 85, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At 0916 Pacific standard time, the Seair Cessna 208 Caravan amphibious aircraft, serial number 20800310, took off from runway 19 at Abbotsford Airport, British Columbia, on the first leg of a private flight to the Bahamas. One pilot and five passengers were on board. About one minute later, as the aircraft was climbing through an altitude of about 400 feet above ground level and as the pilot retracted flaps from 10 to zero degrees, the aircraft became uncontrollable. The aircraft banked left, descended rapidly, and crashed in a field about one-half mile south of the runway threshold, in a left bank with a near-level pitch attitude. The aircraft was destroyed, and the pilot received serious injuries. Two passengers were also seriously injured, and three passengers received minor injuries. Daylight visual meteorological conditions prevailed at the time of the accident. There was no fire.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The pilot took off with frost adhering to the aircraft's lifting surfaces, which increased drag and reduced the ability of the wings to produce lift.\r\n2. At take-off, the aircraft was about 510 pounds in excess of its maximum take-off weight, adversely affecting aircraft performance.\r\n3. The aircraft experienced an aerodynamic stall and loss of control when the flaps were retracted from 10 degrees to zero. Retracting the flaps reduced the amount of lift being produced by the wing, already performing poorly because of contamination.\r\nOther Findings:\r\n1. Appropriate entries were not recorded in the aircraft=s journey and maintenance logs, and the weight and balance documentation was not amended.\r\n2. The floats absorbed much of the impact energy and likely enhanced survivability of the accident."}