{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-worcester", "date": "Feb 2, 2021 at 1655 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Forza Management Company", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Martha’s Vineyard – Worcester", "msn": "46-36651", "yom": 2014, "flight_number": null, "city": "Worcester", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot reported that, while descending through clouds and beginning the instrument approach, some ice accumulated on the wings and he actuated the deice boots twice. The pilot saw the deice boots functioning normally on the wings and could not see the tail; however, the elevator began to shake, and he lost elevator control. The pilot applied forward pressure on the yoke and had to trim nose-down to avoid a stall. There were no cockpit caution indications and the pilot had disengaged the autopilot before descent. The airplane descended through the clouds and impacted a tree before coming to rest upright in a grass area. Postaccident examination of the wreckage, including component testing of the deice system, did not reveal any preimpact mechanical malfunctions. The flap jackscrew position suggested that the flaps were likely in transit between 0° and 10° flap extension at the time of impact. Review of radar data revealed that, during the 2 minutes before the accident, the airplane’s groundspeed averaged about 82 knots; or an approximate average airspeed of 94 knots when accounting for the winds aloft. Current weather observations and forecast weather products indicated that the airplane was likely operating in an area where moderate and potentially greater structural icing conditions prevailed, and where there was the potential for the presence of supercooled liquid droplets. Review of the pilot operating handbook for the airplane revealed that the minimum speed for flight in icing conditions was 130 knots indicated airspeed. It is likely that the pilot’s failure to maintain an appropriate speed for flight in icing conditions resulted in insufficient airflow over the ice contaminated elevator and the subsequent loss of elevator control.", "probable_cause": "The pilot’s failure to maintain the minimum airspeed for flight in icing conditions, which resulted in a loss of elevator control during approach due to ice accumulation."}