{"url": "https://www.baaa-acro.com/crash/crash-bombardier-bd-700-1a11-global-express-5000-fox-harbour", "date": "Nov 11, 2007 at 1434 LT", "type": "Bombardier Global Express/XRS", "operator": "Jetport", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hamilton – Fox Harbour", "msn": "9211", "yom": 2006, "flight_number": null, "city": "Fox Harbour", "zone": "Nova Scotia", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9188, "captain_hours_type": 64, "copilot_hours": 6426, "copilot_hours_type": 9, "aircraft_hours": 92, "circumstances": "The aircraft, operated by Jetport Inc., departed Hamilton, Ontario, for Fox Harbour, Nova Scotia, with two crew members and eight passengers on board. At approximately 1434 Atlantic standard time, the aircraft touched down seven feet short of Runway 33 at the Fox Harbour aerodrome. The main landing gear was damaged when it struck the edge of the runway, and directional control was lost when the right main landing gear collapsed. The aircraft departed the right side of the runway and came to a stop 1000 feet from the initial touchdown point. All occupants evacuated the aircraft. One crew member and one passenger suffered serious injuries; the other eight occupants suffered minor injuries. The aircraft sustained major structural damage. ", "probable_cause": "Findings as to Risk:\r\n1. Because aircraft EWH information is not readily available to pilots, crews may continue to conduct approaches with an aircraft mismatched to the visual glide slope indicator (VGSI) system, increasing the risk of a reduced TCH safety margin.\r\n2. Due to limited knowledge of the various VGSI systems in operation and their limitations, flight crews will continue to follow visual guidance that might not provide for safe TCH.\r\n3. Jetport did not develop an accurate company risk profile. This precluded identification of systemic safety deficiencies and development of appropriate mitigation strategies.\r\n4. If adequate safety oversight of POC operators is not maintained by the regulator, or the delegated organization, especially during SMS implementation, there is an increased risk that safety deficiencies will not be identified.\r\n5. The fact that the Canadian Business Aviation Association (CBAA) did not insist that milestones for SMS implementation and development be followed may result in some POC operators never reaching full SMS compliance.\r\n6. If Transport Canada does not ensure that the CBAA fulfills its responsibilities for adequate oversight of the Canadian Aviation Regulations (CARs) subpart 604 community, safety deficiencies will not be identified and addressed.\r\n7. The audit of Jetport’s SMS, conducted by the CBAA–accredited auditor, did not identify the deficiencies in the program or make any suggestions for improvement. Without a comprehensive audit of an operator’s SMS, deficiencies could exist resulting in the operator’s inability to implement an effective mitigation strategy.\r\n8. Contrary to the recommendations made in the Transport Canada/CBAA feasibility studies, the CBAA did not have a quality assurance program for its audit process. As a result, there is a risk that the CBAA will fail to identify weaknesses in the POC audit program.\r\n9. At the time of the accident, no one at Fox Harbour (CFH4) had been assigned responsibility for regular maintenance of the APAPI, therefore preventing timely identification of APAPI equipment misalignment.\r\n10. Jetport’s risk analysis before the introduction of the Global 5000 did not identify the incompatibility between the EWH of the aircraft and the APAPI at CFH4.\r\n11. Not wearing shoulder harnesses during landings and take-offs increases the potential risk of passenger injuries.\r\n12. Passengers not wearing footwear could impede evacuation, increase the risk of injury, and reduce post-crash mobility and (potentially) survival. \r\nOther Findings:\r\n1. A SMS integrates sound risk management policies, practices, and procedures into day-to-day operations and, properly implemented, offers great potential to reduce accidents.\r\n2. Contrary to its own assessment protocol, Transport Canada did not document its decision to close off the CBAA assessment even though the CBAA had not submitted an acceptable corrective action plan.\r\n3. Depiction of the different types of VGSIs differs, depending on the publication."}