{"url": "https://www.baaa-acro.com/crash/crash-airbus-a320-212-bahrain-143-killed", "date": "Aug 23, 2000 at 1930 LT", "type": "Airbus A320", "operator": "Gulf%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Cairo - Bahrain - Muscat", "msn": "481", "yom": 1994, "flight_number": "GF072", "city": "Bahrain", "zone": "All Bahrain", "country": "Bahrain", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 135, "pax_fatalities": 135, "other_fatalities": 0, "total_fatalities": 143, "captain_hours": 4416, "captain_hours_type": 1083, "copilot_hours": 608, "copilot_hours_type": 408, "aircraft_hours": 17370, "circumstances": "On 23 August 2000, at about 1930 local time, Gulf Air flight GF072, an Airbus A320-212, a Sultanate of Oman registered aircraft A4O-EK, crashed at sea at about 3 miles north-east of Bahrain International Airport. GF072 departed from Cairo International Airport, Egypt, with two pilots, six cabin crew and 135 passengers on board for Bahrain International Airport, Muharraq, Kingdom of Bahrain. GF072 was operating a regularly scheduled international passenger service flight under the Convention on International Civil Aviation and the provisions of the Sultanate of Oman Civil Aviation Regulations Part 121 and was on an instrument flight rules (IFR) flight plan. GF072 was cleared for a VOR/DME approach for Runway 12 at Bahrain. At about one nautical mile from the touch down and at an altitude of about 600 feet, the flight crew requested for a left hand orbit, which was approved by the air traffic control (ATC). Having flown the orbit beyond the extended centreline on a south-westerly heading, the captain decided to go-around. Observing the manoeuvre, the ATC offered the radar vectors, which the flight crew accepted. GF072 initiated a go-around, applied take-off/go-around thrust, and crossed the runway on a north-easterly heading with a shallow climb to about 1000 feet. As the aircraft rapidly accelerated, the master warning sounded for flap over-speed. A perceptual study, carried out as part of the investigation, indicated that during the go-around the flight crew probably experienced a form of spatial disorientation, which could have caused the captain to falsely perceive that the aircraft was ‘pitching up’. He responded by making a ‘nose-down’ input, and, as a result, the aircraft commenced to descend. The ground proximity warning system (GPWS) voice alarm sounded: “whoop, whoop pull-up …”. The GPWS warning was repeated every second for nine seconds, until the aircraft impacted the shallow sea. The aircraft was destroyed by impact forces, and all 143 persons on board were killed. ", "probable_cause": "The factors contributing to the above accident were identified as a combination of the individual and systemic issues. Any one of these factors, by itself, was insufficient to cause a breakdown of the safety system. Such factors may often remain undetected within a system for a considerable period of time. When these latent conditions combine with local events and environmental circumstances, such as individual factors contributed by “frontline” operators (e.g.: pilots or air traffic controllers) or environmental factors (e.g.: extreme weather conditions), a system failure, such as an accident, may occur.\r\nThe investigation showed that no single factor was responsible for the accident to GF072. The accident was the result of a fatal combination of many contributory factors, both at the individual and systemic levels. All of these factors must be addressed to prevent such an accident happening again.\r\n(1) The individual factors particularly during the approach and final phases of the flight were:\r\n(a) The captain did not adhere to a number of SOPs; such as: significantly higher than standard aircraft speeds during the descent and the first approach; not stabilising the approach on the correct approach path; performing an orbit, a non-standard manoeuvre, close to the runway at low altitude; not performing the correct go-around procedure; etc.\r\n(b) In spite of a number of deviations from the standard flight parameters and profile, the first officer (PNF) did not call them out, or draw the attention of the captain to them, as required by SOP’s.\r\n(c) A perceptual study indicated that during the go-around after the orbit, it appears that the flight crew experienced spatial disorientation, which could have caused the captain to perceive (falsely) that the aircraft was ‘pitching up’. He responded by making a ‘nose-down’ input, and as a result, the aircraft descended and flew into the shallow sea.\r\n(d) Neither the captain nor the first officer perceived, or effectively responded to, the threat of increasing proximity to the ground, in spite of repeated hard GPWS warnings.\r\n(2) The systemic factors, identified at the time of the above accident, which could have led to the above individual factors, were:\r\n(a) Organisational factors (Gulf Air): \r\n(i) A lack of training in CRM contributing to the flight crew not performing as an effective team in operating the aircraft.\r\n(ii) Inadequacy in the airline's A320 training programmes, such as: adherence to SOPs, CFIT, and GPWS responses.\r\n(iii) The airline’s flight data analysis system was not functioning satisfactorily, and the flight safety department had a number of deficiencies.\r\n(iv) Cases of non-compliance, and inadequate or slow responses in taking corrective actions to rectify them, on the part of the airline in some critical regulatory areas, were identified during three years preceding the accident.\r\n(b) Safety oversight factors:\r\nA review of about three years preceding the accident indicated that despite intensive efforts, the DGCAM as a regulatory authority could not make the operator comply with some critical regulatory\r\nrequirements."}