{"url": "https://www.baaa-acro.com/crash/crash-fairchild-c-119c-17-fa-flying-boxcar-near-frazier-park-2-killed", "date": "Jul 8, 1981 at 0927 LT", "type": "Fairchild C-119 Flying Boxcar", "operator": "Hemet%20Valley%20Flying%20Service", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Plain, Valley", "schedule": "Santa Barbara - Santa Barbara ", "msn": "10431", "yom": 1949, "flight_number": "Tanker 88", "city": "Frazier Park", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5014, "circumstances": "The airplane departed Santa Barbara Airport at 0857LT, heading for a fire burning on the Los Padres National Forest. The airtanker arrived at the fire location and was given direction for the drop by the Incident Commander (IC). The IC instructed the airtanker pilots to keep the drop high because of steep terrain and snags. They were also instructed to drop only one-half the retardant, saving the remainder for another run. The airtanker pilots acknowledged the instructions. The airtanker pilots notified the IC that they were on final approach. As the airtanker approached the intended drop area, the IC noted from the sound of the engines that they were \"revved up.\" He also heard cracking and popping sounds. When the airtanker came into his sight, the IC and another person noticed that the drop doors on the airtanker were not open and that the landing gear was retracted. The IC had worked with this airtanker and its crewmembers on several previous occasions. The IC noted that the airtanker was lower than he had expected, traveling at an air speed higher than he had observed on previous drops, and that the airtanker was in a descending attitude. The IC and one other person observed the airtanker continue past the intended drop site and then suddenly drop vertically approximately 50 to 100 feet. At that moment, the left wing tip (approximately half of the total left wing span) flexed downward, snapped off, and began cartwheeling along behind the airtanker. The airtanker began to roll left, its nose began to drop, it began to strike trees, and then it struck ground at 0927. The captain and copilot were fatally injured upon impact. The aircraft was totally destroyed.\r\nSource: USDA & USFS", "probable_cause": "Ground investigation confirmed the loss of the left wing prior to impact. Portions of the left wing, left flap, left inboard aileron, and approximately 20 feet of intact left wing tip were recovered between 50 to 800 feet in front of the impact point. Investigation by the National Transportation Safety Board (NTSB) and Forest Service teams showed definite pre-mishap cracks in the inner left wing aileron bell crank control assembly. The possibility of a bell crank failure could have induced aileron flutter, which in turn could have contributed to wing destruction causing the wing to separate from the airtanker."}