{"url": "https://www.baaa-acro.com/crash/crash-dornier-do228-202-bodo", "date": "Dec 4, 2003 at 0909 LT", "type": "Dornier DO228", "operator": "Kato%20Airline", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Røst – Bodø", "msn": "8127", "yom": 1987, "flight_number": "KAT603", "city": "Bodø", "zone": "Nordland", "country": "Norway", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6400, "captain_hours_type": 700, "copilot_hours": 1450, "copilot_hours_type": 260, "aircraft_hours": 11069, "circumstances": "Kato Airline flight KAT603, an aircraft of the type Dornier 228-202 with registration LN-HTA, was to fly a regular scheduled flight from Røst airport (ENRS) to Bodø airport (ENBO). There were two passengers and two pilots on board. There was a strong westerly wind, and when the plane approached Bodø extensive lightning activity developed quickly. The aircraft was struck by a very powerful lightning. The lightning struck the aircraft’s nose area and passed to the tail. Boundings between the fuselage and tail surface and a wire between the tail surface and the elevator were burned off. A powerful electric energy passed through the elevator rod in the tail section. A rod end came loose, resulting in a breach in the control rod. Thus the only connection between the control column in the cockpit and the elevator was lost. This aircraft type has electric pitch trim which adjusts the tail surface angle of attack and after a period the pilots regained limited control of the aircraft’s nose position by using this. When the lightning struck the aircraft, the pilots were blinded for approximately 30 seconds. They lost control of the aircraft for a period and the aircraft came very close to stalling. The pilots declared an emergency. The aircraft’s remaining systems were intact and the pilots succeeded in bringing the plane in for landing. During the first landing attempt the airspeed was somewhat high. The aircraft hit the ground in an approximate three-point position and bounced into the air. The pilots concluded that the landing was uncontrollable because the elevator was not working. The landing was aborted and the aircraft circled for a new attempt. Wind conditions were difficult and the next attempt was also unstable in terms of height and speed. At short final the aircraft nosed down and the pilots barely managed to flare a little before the aircraft hit the ground. The point of impact was a few metres before the runway and the aircraft slid onto the runway. Emergency services quickly arrived at the scene. The two pilots were seriously injured while both passengers suffered only minor physical injuries. No fuel leakage or fire occurred. The aircraft was written off. ", "probable_cause": "Significant investigation results:\r\na) The air traffic control service did not have equipment for integrated weather presentation on the radar display.\r\nb) The aircraft’s weather radar did not indicate precipitation cells and was therefore not functioning correctly. \r\nc) Up to 30% of the wires on individual bondings between the fuselage, horizontal stabilizer and elevator may have been broken before the lightning struck. \r\nd) The aircraft was hit by lightning containing a very large amount of energy. The aircraft’s bondings were not able to conduct the electric energy from the lightning and the transfer rod from the cockpit to the elevator was broken.\r\ne) As a result of the reduced control of the aircraft’s pitch and difficult wind conditions, the sink rate was not sufficiently stabilized on short final. The crew were unable to prevent the aircraft from hitting the ground. "}