{"url": "https://www.baaa-acro.com/crash/crash-learjet-25d-washington-dc-12-killed", "date": "Jun 18, 1994 at 0625 LT", "type": "Learjet 25", "operator": "TAESA2", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Mexico City – New Orleans – Washington DC", "msn": "25-223", "yom": 1977, "flight_number": null, "city": "Washington-Dulles", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 1706, "captain_hours_type": 1314, "copilot_hours": 852, "copilot_hours_type": 426, "aircraft_hours": 6118, "circumstances": "The airplane crashed 0.8 nm south of the threshold of the runway during an ILS approach in instrument meteorological conditions. The captain was not authorized to attempt the approach and was relatively inexperienced for an approach under the weather conditions. The captain failed to adhere to acceptable standards of airmanship during two unstabilized approaches. After the unsuccessful ils approach to runway 01R, the captain should have held for improvements in the weather, requested the runway 19L ILS, or proceeded to his alternate. An operating gpws aboard the airplane would have provided continuous warning to the crew for the last 64 seconds of flight and might have prevented the accident. All 10 passengers were Mexican citizens flying to Washington DC to assist a game of the World Football Championship. ", "probable_cause": "Poor decision making, poor airmanship, and relative inexperience of the captain in initiating and continuing an unstabilized instrument approach that led to a descent below the authorized altitude without visual contact with the runway environment. Contributing to the cause of the accident was the lack of a GPWS on the airplane. "}