{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-340c-near-taif-156-killed", "date": "Nov 26, 1979 at 0204 LT", "type": "Boeing 707", "operator": "Pakistan%20International%20Airlines-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Desert", "schedule": "Kano - Jeddah - Karachi", "msn": "20275/844", "yom": 1970, "flight_number": "PK740", "city": "At Ta'if", "zone": "Makkah l-Mukarramah (مكة المكرمة)", "country": "Saudi Arabia", "region": "Asia", "crew_on_board": 11, "crew_fatalities": 11, "pax_on_board": 145, "pax_fatalities": 145, "other_fatalities": 0, "total_fatalities": 156, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 30710, "circumstances": "The airplane was completing a schedule service from Kano to Karachi with an intermediate stop at Jeddah, carrying 145 passengers and a crew of 11. It departed Jeddah-King Abdulaziz Airport at 0129LT and continued to climb by night and good weather conditions. While cruising at an altitude of 37,000 feet, the captain informed ATC about an in-flight fire and was cleared to descent to 30,000 feet then 4,000 feet at his discretion. Seventeen minutes later, the situation on board became very critical with heavy smoke spreading in the cabin and the crew declared an emergency. While attempting an emergency landing in a desert area, the airplane struck the ground and disintegrated on impact. The wreckage was found about 48 km north of At Ta'if, in a rocky area. None of the 156 occupants survived the crash. ", "probable_cause": "An in-flight fire in the cabin area which, through its intensity and rapid extension, resulted in panic among the passengers and smoke in the cockpit, eventually incapacitating the flight crew. The cause of the cabin fire was not determined. It was considered that the origin of the cabin fire could have been a leaking gasoline or kerosene stove, carried aboard by Haj pilgrim passengers. Pressure differential could have caused a poorly sealed gasket to leak fuel. A second possibility is an electrical fire, but the rapid extension of the fire was considered difficult to explain because of the electrical circuit protection devices of the Boeing 707. Sabotage was considered as another possibility, but no evidence of use of an incendiary device was found."}