{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-near-mareeba-11-killed", "date": "May 11, 1990 at 1740 LT", "type": "Cessna 500 Citation", "operator": "Air%20North%20NZ", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Proserpine – Mareeba – Cairns", "msn": "500-0283", "yom": 1975, "flight_number": null, "city": "Mareeba", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 10, "pax_fatalities": 10, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": 14150, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Cessna 500 VH-ANQ was operating the Proserpine to Mareeba leg of a charter flight The aircraft departed Proserpine at 16:35 hours. The charter flight had been organised to transport members of five local government authorities from the Cairns/Atherton Tablelands area to a Local Government Association Conference at Airlie Beach, Queensland. The flight plan indicated that the flight would follow Instrument Flight Rules (IFR) with a planned cruising altitude of FL330. The aircraft was planned to track via overhead Townsville then direct to Mareeba with a flight time interval of 68 minutes. The flight apparently continued normally and at 17:26 the aircraft was cleared to descend to FL170 and instructed to call Cairns Approach. On first contact with Cairns Approach, the pilot advised that the aircraft was tracking for Mareeba via the 163 radial at 41 miles (76 kilometres) DME from Biboohra. (There are no radio navigational aids at Mareeba, the nearest aids for tracking and instrument approach purposes are at Biboohra, about 16 kilometres north of Mareeba). The aircraft was advised to maintain FL170 but a short time later was cleared to descend to FL120. The pilot stated that he would not be closing down the engines at Mareeba and that his estimated departure time was 17:50. At 17:35 hours VH-ANQ was cleared to descend to 10,000 feet and one minute later the pilot advised that the aircraft was \"approaching over Mareeba and visual\". Cairns Approach advised VH-ANQ that there would be a short delay at 10,000 feet and following a request from the pilot gave approval for the aircraft to circle over Mareeba. At 17:40 hours, Cairns Approach instructed the aircraft to descend to 7,000 feet. This transmission, and other subsequent transmissions to the aircraft, went unanswered. The wreckage of VH-ANQ was ultimately located on the eastern slopes of Mt Emerald, 15 kilometres south of Mareeba Airport, by searching helicopters at 0240 hours on 12 May 1990. The aircraft initially impacted the mountainside with the left wingtip, while travelling on a track of about 340 degrees Magnetic. At the time it was in a wings level attitude at an angle of descent of eight degrees. It then struck the ground just below the apex of a ridge and the wreckage spread in a fan shape, at an angle of 30 degrees, along a centreline track of 350 degrees Magnetic.", "probable_cause": "This accident was unusual in that the last report by the pilot indicated that the aircraft was at 10,000 feet and on a track that was 55 kilometres to the east of the accident site. There was no substantiated, and very little circumstantial evidence to suggest what caused the aircraft to descend 6,400 feet and to be displaced a considerable distance to the west of track. As a result the causal factors associated with this accident remain undetermined."}