{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh106-comet-1a-rome", "date": "Oct 26, 1952 at 1756 LT", "type": "De Havilland DH.106 Comet", "operator": "BOAC-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "London – Rome – Cairo – Johannesburg", "msn": "6012", "yom": 1952, "flight_number": null, "city": "Rome-Ciampino", "zone": "Lazio", "country": "Italy", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 35, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was operating a scheduled passenger service from London to Johannesburg. The flight from London Airport to Rome was without incident. During the take-off from Rome on the second stage, the aircraft's normal speed failed to build up and after becoming airborne for a few seconds, the Captain's immediate reaction was that there was a lack of engine thrust. He throttled back the engines at the same time as the aircraft came to rest near the airport boundary, and the aircraft sustained considerable damage and two passengers were slightly injured. For take-off the aircraft was taxied to Runway 16 and lined up on the centre line; all pre-take-off checks were made and the elevator, aileron and rudder trim were set at the neutral position. The Captain's estimation of runway visibility was 5 miles but with no horizon. The flaps were lowered to 15\" and the windscreen wipers were both operating. The engines were opened up to full power and the isolation switches were set to \"Isolate'. The RPM were checked at 10 250 on all engines; fuel flows, engine temperatures and pressures were reported to be correct. The brakes were released and the aircraft made a normal acceleration. At an IAS of 75-80 knots, the nose wheel was lifted from the runway and a slight tendency to swing to starboard was corrected. At an IAS of 112 knots, the Captain lifted the aircraft from the ground by a positive backward movement of the control column and when he considered that the aircraft had reached a safe height he called for \"undercarriage up\". At about the same instant the port wing dropped rather violently and the aircraft swung to port; the controls gave normal response and lateral level was regained. At this point the Captain realized that the aircraft's speed was not building up, although he made no reference to the ASI. A pronounced buffeting was felt which he associated with the onset of a stall and in spite of two corrective movements of the control column the buffeting continued. Before the First Officer had time to select undercarriage up, the aircraft came down on its main landing wheels and bounced. It was now plainly evident to the Captain that the aircraft's speed was not increasing and he was convinced that there was a considerable loss of engine thrust. He was also aware that the aircraft was rapidly approaching the end of the runway and a decision to abandon the take-off was made. The undercarriage struck a mound of earth as he was closing the throttles and the aircraft slid for some 270 yards over rough ground. The main undercarriages were wrenched off and considerable damage resulted; a large spillage of fuel occurred but fire did not break out. One passenger suffered slight shock and another sustained a cut finger. ", "probable_cause": "The accident was due to an error of judgment by the Captain in not appreciating the excessive nose-up attitude of the aircraft during the take-off. "}