{"url": "https://www.baaa-acro.com/crash/crash-xian-ma60-mong-hsat", "date": "May 16, 2013 at 1148 LT", "type": "Xian MA60", "operator": "Myanma-Airways-21", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yangon - Heho - Mong Hsat", "msn": "08 08", "yom": 2010, "flight_number": "UB646", "city": "Mong Hsat", "zone": "Shan State", "country": "Myanmar", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 51, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9066, "captain_hours_type": 2377, "copilot_hours": 3414, "copilot_hours_type": 1871, "aircraft_hours": 3457, "circumstances": "On 16 May 2013 at 08:00 local Time, Myanma Airways MA-60 aircraft registered XY- AIQ (MSN-0808) departed Yangon International Airport (VYYY) to Monghsat Airport. For this flight captain assigned FO to line training (Command) pilot and aircraft landed to Monghsat at about 09:25 local time. After passengers disembarked and boarded, aircraft departed to Heho at 09:55 local time and landed at about 10:40 local time. Aircraft refueled at Heho and departed to Monghsat at 11:10 local time with 4 crews and 51 passengers. First officer was designated as the Pilot flying for this flight. Captain contacted to Monghsat ATC weather information, and aircraft climbed to 15000-ft with indicated airspeed 200 knots. Where reaching 40 Miles to Monghsat airfield, Captain request descent clearance and descent to 8000 ft. After passing transition level 125 Monghsat airfield, QNH setting and performed approach check. During approach to Monghsat airfield, weather was fine and visibility was 4-5 Miles (8- km). When reaching 3 Miles distance to runway 12, approach speed was 120 knots IAS. At about 11:47:59 local time, aircraft first touchdown to runway 12 with IAS 114 knots, vertical speed -288, flap 30 degree. During landing roll, aircraft over run to runway 30. At about (11:48:33) local time, aircraft struck to tree stump with IAS 40 knots and passing across to water drainage (gutter) located 110 meters from runway 30. After striking, aircraft turned to left 80 degree and came to rest. Cabin crews performed emergency evacuation, one passenger suffered serious injury, other one suffered minor injury and 53 of the occupants were survived.  One passenger was serious injury ( back pain) and one passenger was minor injury (shoulder joint injury) due to accident.  The left main leading gear and nose landing gear strut broken, left engine propeller blades broken, left wing tip broken and lower fuselage frame dents. The aircraft was substantially damaged. ", "probable_cause": "Primary Cause:\r\n- During landing roll FO retracted PIA to GI position, its remain above Ground Idle position (36.8/ 36.6) degree. After (18) seconds flap position changed to retract and both engines torque start to increase.\r\n- Aircraft IAS unable to rapid decelerate during crews applied braking.\r\nSecondary Cause:\r\n- Both crews are not initiated power lever reversing position.\r\n- Crews need multi-crew operation."}