{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-40-solitaire-woodlands-2-killed", "date": "May 1, 2001 at 1241 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Jerry L. Fambrough", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Conroe – Alamogordo", "msn": "418", "yom": 1980, "flight_number": null, "city": "The Woodlands", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2839, "captain_hours_type": 1108, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2439, "circumstances": "Visual meteorological conditions prevailed for the planned cross-country flight for which the pilot obtained a weather briefing, filed an IFR flight plan, and received an ATC clearance. Approximately 8 minutes after takeoff, radar indicated the airplane was at 11,200 feet msl, heading 241 degrees, with a ground speed of 180 knots. No distress calls or additional communications with the pilot were recorded, and radar contact was lost. The airplane impacted the ground in an uncontrolled descent. The right wing tip tank separated from the airplane and was found 0.18 nautical miles from the main wreckage. The teardown and examination of both engines disclosed that the type and degree of damage was indicative of engine power section rotation and operation at the time of impact. There were no complete systems intact at the accident site due to the impact sequence and post-impact fire which consumed the aircraft. The landing gear and flaps were found in the retracted position. The portion of the right propeller shaft coupling found at the site was fractured through 360 degrees. Metallurgical examination revealed that the propeller shaft coupling failed in fatigue. The presence of the fatigue cracks indicated the coupler fractured in fatigue in service, and the fatigue cracks were not the result of ground impact. The circumferential fracture intersected the ends of several internal spline teeth. The origin of the fatigue crack could not be determined because of severe corrosion damage on the fracture surface. Fatigue propagation was in the aft direction and from the inside to the outside of the coupling. The engine core rotating components would have bee free to rotate when uncoupled from the propeller shaft. The maintenance records indicated that the failed coupling had accumulated approximately 4,000 hours since new, and 1,250 hours since engine overhaul in 1989. Since 1990, as a result of fatigue fractures, the manufacturer introduced several design changes for the propeller shaft coupling via optional Service Bulletins to be accomplished at the next access or hot section inspection (HSI). Impact and thermal damage of the right propeller precluded a determination of the in-flight blade angles. The calculations by the airplane manufacturer indicated that \"the [intact] airplane was capable of continued flight\" with the right propeller feathered, and that the \"airplane can keep attitude, but cannot climb and cannot maintain altitude\" with the right propeller in the flat pitch or wind milling positions, respectively. Metallurgical examination of the component brackets and associated bolts from the right tip tank revealed the separation of the tip tank resulted from a single-event overstress fracture of both the forward and aft tank  attachment fittings. Calculations showed that a 3.763 radians per second (35.9 RPM) spin rate would cause the failure of the forward wing fuel tank attachment fitting. There had not been a previous in-flight separation of a wing tip fuel tank on this model airplane. ", "probable_cause": "The pilot's failure to maintain airplane control following a loss of right engine power, which resulted in impact with terrain in an uncontrolled descent. A contributing factor was the loss of right engine power as a result of the fatigue failure of the propeller shaft coupling.\n"}