{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-orland", "date": "May 21, 1999 at 1725 LT", "type": "Cessna 414 Chancellor", "operator": "Robert J. Scott", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Jose – Redding", "msn": "414-0053", "yom": 1970, "flight_number": null, "city": "Orland", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12000, "captain_hours_type": 480, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4471, "circumstances": "The pilot refueled the auxiliary tanks of the airplane at a different airport 1 month prior to the accident, and had not flown on the auxiliary tanks since that time. He was repositioning the airplane back to home base after a series of revenue flights when the accident occurred. About 20 minutes after takeoff he positioned the left and right engines to their respective auxiliary fuel tanks, and then returned to the mains 30 minutes later. The right engine began to surge and subsequently stopped running. Turning on the fuel boost pump restarted the engine. Five minutes later the engine quit and he secured it after unsuccessful restart attempts. Then the left engine began to surge and was developing only partial power. He diverted to an alternate airport with decaying altitude and power in the remaining engine. Crossing the airport, he saw he was too high to land with a tailwind so he circled to land into the wind. On the base leg he made the decision to land straight ahead in a field due to power lines in his path, rapidly decaying altitude, and power. During the landing roll, the airplane collided with a ditch. The left and right main fuel filters contained a foreign substance, which upon laboratory examination, was found to be a polyacrylamide. This is a manmade synthetic polymer that is used as an agricultural soil amendment that aids in reducing soil erosion. Distribution of the polymer is typically not done by aircraft. Inspection of the fueling facility revealed that the employees who do refueling did not have any formal or on-the-job training. There was no record that the delivery system filters had been examined or changed. The maintenance to the truck, delivery system, and storage facility are done by the employees on an as needed, time permitted basis. The fuel truck was found to be improperly labeled, and the fuel nozzle was lying in a compartment amid dirt, gravel, and other contaminates with no caps or covers for protection. ", "probable_cause": "A loss of engine power in both engines due to fuel contamination, which resulted from the fueling facilities improper quality control procedures. "}