{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-kiowa-2-killed", "date": "Jun 5, 2000 at 1031 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Key%20Lime%20Air-2", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Denver - Denver", "msn": "31-7952250", "yom": 1979, "flight_number": null, "city": "Kiowa", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3900, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 11279, "circumstances": "The purpose of the flight was for the instructor pilot to administer second-in-command (SIC) flight training to the commercial pilot in the twin-engine aircraft. According to the training manual, SIC training encompassed 4 hours of normal and emergency flight maneuvers to include stalls in the landing and takeoff configuration and while turning at a 15-30 degree bank. A witness heard the airplane's engines and observed the airplane from her driveway. The witness stated that as \"the [engine] noise was getting louder and louder, I spotted it spiraling downward.\" The witness thought that the airplane was performing aerobatics; however, the airplane was getting too close to the ground. The witness heard a loud thud, and approximately 3 seconds later, she heard a loud boom and saw black smoke billow up. Another witness stated that she observed the airplane \"going nose first straight down and spinning...counterclockwise.\" She thought the airplane was performing aerobatic maneuvers; however, the airplane did not stop descending. The airplane disappeared behind trees and the witness heard a loud explosion and saw smoke. She added that she did not observe what the airplane was doing prior to seeing it in a \"downward spiral.\" Radar data depicted the airplane at 8,400 feet msl for the last 2 minutes and 26 seconds of the flight. The recorded aircraft ground speed during that time period fluctuated between 75 and 59 knots. The final radar returns depicted the airplane as making a 180 degree turn before radar contact was lost. No mayday calls were received from the airplane. The airplane impacted the ground in a near wings level attitude and was consumed by a post-crash fire. No anomalies were noted with the airplane or its engines during a post-accident examination. It is unknown which of the pilots was flying the airplane at the time of the accident.", "probable_cause": "The flight instructor's failure to maintain aircraft control while practicing stall maneuvers, which resulted in an inadvertent spin."}