{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-otamauri-1-killed", "date": "Jul 15, 1960 at 1530 LT", "type": "Fletcher FU-24", "operator": "Sherwood Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Otamauri - Otamauri", "msn": "11", "yom": 1954, "flight_number": null, "city": "Otamauri", "zone": "Hawke's Bay Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was on the take off run when two cattle beasts suddenly appeared from sloping ground on the left of the strip and ran across. The pilot attempted to lift off to avoid a collision and the plane adopted a steep nose-high attitude, with the tail cone hitting the ground, before striking the animals. The impact caused the aircraft's elevators to separate from the airframe. The calculated ground speed at this stage was 71 mph and the aircraft overran the sloping end of the airstrip. It was thought that the pilot, unaware of the loss of the elevators, attempted to continue the take off in order to retrieve the situation, rather than trying to stop in the limited distance available on the sloping runway. The plane appears to have lofted, out of control, for a distance of 264 feet (80 meters) before striking the ground at angle of 70 degrees, and sliding another 66 feet (20 meters). The aircraft was wrecked and a fire broke out in the engine bay and was fed by the gradual discharge of fuel from the fractured outlets of the wing tanks. The loader driver and two others were quickly at the scene and the only fire extinguisher available, a 20-pound (9 kg) foam-type was used in an effort to blanket the pilot, whose leg was trapped, from the flames. Three other persons who had been working nearby arrived and assisted by bringing water from a pond close by. These commendable efforts were insufficient to quell the blaze and the pilot had suffered severe burns before he was finally removed from the wreckage. The pilot William George Jackson Deller died as the result of his injuries. \nSource: https://aviation-safety.net/wikibase/wiki.php?id=63366", "probable_cause": "Ground collision with cattle during takeoff. "}