{"url": "https://www.baaa-acro.com/crash/crash-gippsland-ga8-airvan-buckingham-bay-1-killed", "date": "Oct 16, 2008 at 0945 LT", "type": "GippsAero GA8 Airvan", "operator": "Arnhem Land Community Airlines", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Elcho Island – Mata Mata – Muthamul –Nyinyikay – Rurruwuy – Elcho Island", "msn": "GA8-05-005", "yom": 2001, "flight_number": null, "city": "Buckingham Bay", "zone": "Northern Territory", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1300, "captain_hours_type": 300, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4750, "circumstances": "On the morning of 16 October 2008, a Gippsland Aeronautics GA8 Airvan, registered VH-WRT, was being operated on a freight charter flight from Elcho Island and return, Northern Territory. At about 1230, it was realised that the aircraft was missing. A witness reported seeing the aircraft during the early stages of the flight and, shortly afterwards, a column of dark black smoke rising from the eastern side of the Napier Peninsula. On 17 October 2008, items of wreckage from the aircraft were found in the south-western part of Buckingham Bay. The pilot, who was the sole occupant of the aircraft, and the main wreckage of the aircraft have not been found. After consideration of the available evidence, the investigation was unable to identify any factor that contributed to the accident.", "probable_cause": "Following a review of the available evidence covering:\r\n• Witness information,\r\n• The pilot's fatigue and health,\r\n• The airworthiness of the aircraft,\r\n• Aircraft fuel,\r\n• The weather affecting the flight, and\r\n• The aircraft’s loading and weight and balance,\r\nThe investigation was unable to identify any factors that may have contributed to the accident. From the evidence available, the following findings are made with respect to the missing aircraft at Buckingham Bay, Northern Territory on 16 October 2008 involving Gippsland Aeronautics GA8 Airvan aircraft, registered VH-WRT. They should not be read as apportioning blame or liability to any organisation or individual. No contributing safety factors were identified.\r\nOther safety factors:\r\n• The main vertical net and the throwover net were not used to restrain the cargo.\r\n• The full jerry cans were not secured in the aircraft cabin.\r\n• At the time of departure, the aircraft’s centre of gravity (c.g) was probably to the rear of the permitted c.g limit that was published in the Aircraft Flight Manual.\r\n• There was no record that the pilot lodged a flight notification for the flight with Airservices Australia."}