{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-500-near-rodez-5-killed", "date": "Jan 28, 1979 at 1726 LT", "type": "Fokker F27 Friendship", "operator": "Air Rouergue", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Mountains", "schedule": "Rodez - Rodez", "msn": "10570", "yom": 1978, "flight_number": null, "city": "Rodez", "zone": "Aveyron", "country": "France", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 4, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 6367, "captain_hours_type": 1021, "copilot_hours": 1991, "copilot_hours_type": 1178, "aircraft_hours": 1704, "circumstances": "The crew departed Rodez-Marcillac Airport at 1715LT on a local test flight following a two-month maintenance period after the aircraft was suffering vibrations during preceding flights. On board were two pilots of Air Rouergue, two engineers from the same operator, a Fokker technician and one pilot from Air Alpes. The test program was short, about 15 minutes, with two circuits planned at an altitude of 7,000 feet over the Rodez beacon. On approach to runway 31, the crew was supposed to complete a level off at 4,400 feet QNH but continued the descent until the airplane struck a mountain shrouded in clouds and located about 17 km from the airport. One of the passenger was seriously injured while five other occupants were killed. ", "probable_cause": "Failure of the crew to level off at the prescribed altitude either due to inadequate monitoring when passing through 4,400 feet or an altimeter setting error by confusion between QNH and QFE. Other factors were a lack of flight preparation; non use of the radio altimeter and a possible CofG outside limits affecting the longitudinal maneuverability. Also, no approach card was evident in the cockpit for this aerodrome and the presence of an additional person on the flight deck may have distracted the crew."}