{"url": "https://www.baaa-acro.com/crash/crash-levasseur-pl8-atlantic-ocean-2-killed", "date": "May 9, 1927", "type": "Levasseur PL.8", "operator": "Charles Nungesser", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Paris - New York", "msn": "PL.8-01", "yom": 1927, "flight_number": null, "city": "Atlantic Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Named L'Oiseau Blanc, the aircraft took off at 0517LT on 8 May 1927 from Paris-Le Bourget Airport, heading for New York with two French aviators on board: Charles Nungesser and François Coli. They tried to make the first transatlantic non stop flight from Paris to New York counting for the Orteig Prize. The biplane weighed 5,000 kg (11,000 lb) on takeoff, extremely heavy for a single-engined aircraft. The intended flight path was a great circle route, which would have taken them across the English Channel, over the southwestern part of England and Ireland, across the Atlantic to Newfoundland, then south over Nova Scotia, to Boston, and finally to a water landing in New York. L'Oiseau Blanc had been carrying a sizable load of fuel, 4,000 liters (1,056.7 US gal), which would have given them approximately 42 hours of flight time. Crowds of people gathered in New York to witness the historic arrival, with tens of thousands of people crowding Battery Park in Manhattan to have a good view of the Statue of Liberty, where the aircraft was scheduled to touch down. After their estimated time of arrival had passed, with no word as to the aircraft's fate, it was realized that the aircraft had been lost. Rumors circulated that L'Oiseau Blanc had been sighted along its route, in Newfoundland, or over Long Island, and despite the launch of an international search, further search efforts were eventually abandoned on 09JUN1927. As of 2008, the landing gear is the only confirmed part of the L'Oiseau Blanc remaining, and is on display at the Musée de l'Air et de l'Espace (French Air and Space Museum), in Le Bourget Airport in Paris, the location from which L'Oiseau Blanc took off. This landing gear was dropped by the crew shortly after takeoff from Le Bourget. ", "probable_cause": null}