{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-4t-caribou-near-ilaga-4-killed", "date": "Oct 31, 2016 at 0830 LT", "type": "De Havilland DHC-4 Caribou", "operator": "Perkumpulan Penerbangan Alfa Indonesia", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Timika - Ilaga", "msn": "303", "yom": 1972, "flight_number": null, "city": "Ilaga", "zone": "Special Region of West Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 9336, "captain_hours_type": 38, "copilot_hours": 3636, "copilot_hours_type": 17, "aircraft_hours": 2748, "circumstances": "A DHC-4 Caribou aircraft, registered PK-SWW was being operated by Perkumpulan Penerbangan Alfa Indonesia, on 31 October 2016 on an unscheduled cargo flight from Moses Kilangin Airport Timika, with intended destination to Kaminggaru Aerodrome, Ilaga Papua. On board on this flight was 4 persons consisted of two pilots, one company engineer and one flight operation officer. At 2257 UTC, the aircraft departed Timika with intended cruising altitude of 12,500 feet and estimated time of arrival Ilaga at 2327 UTC. At 2323 UTC, the pilot made initial contact with Ilaga Aerodrome Flight Information Services (AFIS) officer and reported that the aircraft position was at Ilaga Pass and informed the estimate time of arrival Ilaga would be on 2327 UTC. Ilaga Aerodrome Flight Information Services (AFIS) officer advised to continue descend to circuit altitude and to report when position on downwind. At 2330 UTC, the AFIS officer called the pilot and was not replied. The AFIS officer asked pilot of another aircraft in the vicinity to contact the pilot of the DHC-4 Caribou aircraft and did not reply. At 0020 UTC, Sentani Aeronautical Information Service (AIS) officer declared the aircraft status as ALERFA. At 0022 UTC, Timika Tower controller received information from a pilot of an aircraft that Emergency Locator Transmitter (ELT) signal was detected approximately at 40 – 45 Nm with radial 060° from TMK VOR (Very High Frequency Omni Range) or approximately at coordinate 4°7’46” S; 137°38’11” E. This position was between Ilaga Pass and Jila Pass. At 0053 UTC, the aircraft declared as DETRESFA. On 1 November 2016, the aircraft wreckage was found on a ridge of mountain between Ilaga Pass and Jila Pass at coordinate 4°5’55.10” S; 137°38’47.60” E with altitude approximately of 13,000 feet. All occupants were fatally injured and the aircraft destroyed by impact force.", "probable_cause": "Controlled flight into terrain."}