{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-100-chicago-30-killed", "date": "Aug 16, 1965 at 2120 LT", "type": "Boeing 727-100", "operator": "United-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "New York – Chicago", "msn": "18328", "yom": 1965, "flight_number": "UA389", "city": "Chicago", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 24, "pax_fatalities": 24, "other_fatalities": 0, "total_fatalities": 30, "captain_hours": 17142, "captain_hours_type": 59, "copilot_hours": 8466, "copilot_hours_type": 363, "aircraft_hours": 611, "circumstances": "A United Air Lines, Inc., Boeing 727-22, N7036U, Flight 389 (UAL 389) was a regularly scheduled domestic passenger/cargo flight from LaGuardia Airport, New York to O'Hare International Airport, Chicago, Illinois. The aircraft had arrived at LaGuardia, on the date of the accident, following a trip from Los Angeles, California, with stops at Sacramento, California, Reno, Nevada, Denver, Colorado, and Chicago, Illinois. The flight crew of UAL 389 reported for duty at LaGuardia Airport one hour before scheduled departure where they prepared for the flight to Chicago. The stewardesses arrived with the aircraft from Chicago. Persons known to have been in contact with the crew prior to their departure from New York noticed nothing unusual about their behavior or appearance. UAL 389 departed LaGuardia at 1952 on an Instrument Flight Rules (IFR) flight plan at FL 350 and estimated their arrival time at O'Hare to be 2127. The crew reported at FL 350 at 2011.35. At 2102 UAL 389 came under control of the Chicago Air Route Traffic Control Center (ARTCC) reporting its altitude as FL 350 and was cleared to the O'Hare Airport via Pullman VORTAC direct to the Northbrook VORTAC, direct O'Hare and to maintain FL 350. This clearance was acknowledged correctly and the crew was advised that radar contact had been established. At 2103 the ARTCC controller cleared UAL 389 to descend to FL 240 and to \"start descent now through 31\" (FL 310). UAL 389 replied \"...down to 240, leaving three five.\" At 2106 UAL 389 was cleared to continue its descent to 14,000 feet and given an altimeter setting of 29.90 inches for O'Hare. This message was acknowledged immediately and in reply to the controller's inquiry the crew reported they were leaving FL 280 \"now.\" At 2109 the flight was instructed to change frequencies and within the same minute reported out of FL 260 descending to fourteen thousand. This was the last altitude information received from the crew. At 2111 the flight was cleared to descend to 6,000 feet and the clearance was immediately acknowledged correctly. At 2118:35 control of the flight was passed to Chicago Approach Control (ORD). The radar target of UAL 389 was in the vicinity of the Sturgeon Intersection (intersection of the 011 radial of Chicago Heights and 076 radial of Northbrook VORTAC, 28 miles east of Northbrook VORTAC). At 2118:38 the target was observed approximately 2 miles east of the intersection. At 2119:36 the crew contacted ORD and was advised that radar contact had been established. At this time the aircraft target was 2-3 miles west of Sturgeon. UAL 389 was cleared to maintain 6,000 feet and to depart the Northbrook VORTAC on a heading of 240 degrees. The flight was advised that instrument landing system approaches were in progress on runway 14R at O'Hare and that the current O'Hare altimeter setting was 29.93. The pilot read back the altimeter setting incorrectly, the controller corrected him, and the pilot repeated it correctly. This was the last communication received from the flight and ended at 2120:03. The airplane crashed into Lake Michigan and exploded upon impact. All 30 occupants were killed. ", "probable_cause": "The Board is unable to determine the reason for the aircraft not being leveled off at its assigned altitude of 6,000 feet."}