{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-690c-jetprop-840-myrtle-beach", "date": "Nov 12, 2018 at 1415 LT", "type": "Rockwell Gulfstream 690C Jetprop 840", "operator": "C&C Flying", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Greater Cumberland - Myrtle Beach", "msn": "690-11676", "yom": 1981, "flight_number": null, "city": "Myrtle Beach", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 22335, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8441, "circumstances": "The airplane sustained substantial damage when it collided with terrain during an approach to landing at the Myrtle Beach International Airport (MYR), Myrtle Beach, South Carolina. The commercial pilot was seriously injured. The airplane was privately owned and operated under the provisions of Title 14 Code of Federal Regulations Part 91 as a personal flight. Instrument meteorological conditions prevailed, and an instrument flight rules flight plan was filed for the flight that departed Greater Cumberland Regional Airport (CBE), Cumberland, Maryland. According to the pilot, he was following radar vectors for the downwind leg of the traffic pattern to runway 36 at MYR. He turned for final approach and was inside the outer marker, when he encountered heavy turbulence. As he continued the approach, he described what he believed to be a microburst and the airplane started to descend rapidly. The pilot added full power in an attempt to climb, but the airplane continued to descend until it collided with the Atlantic Ocean 1 mile from the approach end of runway 36. A review of pictures of the wreckage provided by a Federal Aviation Administration inspector revealed the cockpit section of the airplane was broken away from the fuselage during the impact sequence. At 1456, the weather recorded at MYR, included broken clouds at 6,000 ft, few clouds at 3,500 ft and wind from 010° at 8 knots. The temperature was 14°C, and the dew point was 9°C. The altimeter setting was 30.27 inches of mercury. The airplane was retained for further examination.", "probable_cause": "An encounter with low-level windshear and turbulence during the landing approach, which resulted in a loss of airplane control."}