{"url": "https://www.baaa-acro.com/crash/crash-fairchild-c-119g-flying-boxcar-edelweiler-46-killed", "date": "Aug 11, 1955 at 1420 LT", "type": "Fairchild C-119 Flying Boxcar", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Dreux - Stuttgart", "msn": "11258", "yom": 1953, "flight_number": "Chalk 9 ", "city": "Edelweiler", "zone": "Baden-Württemberg", "country": "Germany", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 41, "pax_fatalities": 41, "other_fatalities": 0, "total_fatalities": 46, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A group of nine Fairchild C-119G Flying Boxcar left Dreux, Eure-et-Loir, on a flight to Stuttgart-Echterdingen Airport in southwest Germany under flight code 'Chalk'. Enroute, the pilot of C-119 registered 53-3222 (Chalk 8) called the leader and informed the rest of the formation he lost his left engine and elected to land asap. While trying to leave the formation, 53-3222 made a turn to the left when the top of its empennage hit the base of the cockpit of C-119 registered 53-7841 (Chalk 9). Both aircraft went out of control, dove into the ground and crashed in a wooded area and a field located near Edelweiler. Both aircraft disintegrated on impact and all 66 crew members on both aircraft were killed.", "probable_cause": "Failure of the left engine in flight. It was also determined that the collision was due to the wrong position of 53-7841 because his crew failed to respect the assigned altitude in the formation. In conclusion, the board finds that the primary cause of the accident was pilot error. It is the opinion of the board that if the left wingman (aircraft 53-7841) had held his proper position instead of dropping down and out, the accident would not have occurred. It was established that just prior to the accident, aircraft 7841 had overrun his element leader. Evidence was found that the right wingman (aircraft 53-3222) was in process of losing his left engine and was given instructions to leave the formation. He was in the process of leaving the formation by descending and turning to the left according to normal procedures when the collision occurred. After considering all the available evidence, the board feels that the accident would not have happened if engine malfunction had not occurred, causing the right wingman to break formation. The board found evidence of supervisory error in that the pilot responsible for the accident had not had proper crew rest and his copilot’s experience was extremely low."}