{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-104a-ust-orda-3-killed", "date": "Oct 21, 1960 at 2114 LT", "type": "Tupolev TU-104", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow – Omsk – Irkutsk – Khabarovsk", "msn": "9 66 017 01", "yom": 10, "flight_number": "SU005", "city": "Ust-Orda", "zone": "Irkutsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 3, "pax_on_board": 61, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1071, "circumstances": "On the leg from Omsk to Irkutsk, at a distance of 160 km from the destination, the crew was informed about the deterioration of the weather conditions at Irkutsk Airport and was then diverted to Ust-Orda Airport. At this time, weather at Ust-Orda was as follow: cloud base at 250 meters, snow falls and a visibility of 3 km. On approach by night, the nose gear light was unserviceable so the captain decided to make a go around. For unknown reason, this procedure was delayed and he completed a low pass over the runway for about two km before making a turn to the left at a height of 10-15 meters when the airplane struck power cables. The aircraft stalled and crashed in flames on a hilly terrain near the airport. 46 passengers were uninjured while 19 occupants were injured. Three crew members were killed, the navigator, the radio operator and the mechanic. The aircraft was totally destroyed by a post crash fire. ", "probable_cause": "The decision of the captain to perform a go around was comprehensive but the very low pass (10-15 meters) above the runway was unacceptable. Investigations were able to determine that weather conditions at Irkutsk Airport were not as bad and the decision of the ATC to divert the crew to Ust-Orda was not necessary. Also, it was the first time that the pilot was flying to Ust-Orda and he did not have any knowledge about the environment at this airport, which was considered as a contributing factor. "}