{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-ii-near-mckinleyville-4-killed", "date": "Jul 29, 2016 at 0105 LT", "type": "Piper PA-31 Cheyenne", "operator": "Cal-Ore-Life-Flight", "flight_phase": "Flight", "flight_type": "Ambulance", "survivors": "No", "site": "Plain, Valley", "schedule": "Crescent City – Oakland", "msn": "31-8120022", "yom": 1981, "flight_number": null, "city": "McKinleyville", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 7300, "captain_hours_type": 125, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7309, "circumstances": "About 13 minutes after takeoff for a medical transport flight, while climbing through about 14,900 ft mean sea level (msl), the pilot reported to air traffic control (ATC) that he was smelling smoke in the cockpit and would be returning to the originating airport. The flight was cleared to return with a descent at pilot's discretion to 9,000 ft msl. The pilot replied, \"okay,\" and said that it looked like he was going to lose some power shortly. The pilot then stated that he had smoke in the cockpit, declared an emergency, and requested that ATC contact the fire department. About 1 minute 15 seconds after the initial report of smelling smoke, the pilot made the last radio transmission of the flight stating that he had three people on board. The wreckage was located about 9 hours later in an area of brush and heavily forested terrain. Portions of the burned and fragmented wreckage were scattered along a debris path that measured about 2,400 ft in length, which is consistent with an inflight breakup. The center fuselage and cockpit areas were largely intact and displayed no evidence of fire; however, there was an area of thermal damage to the forward fuselage consistent with an inflight fire. The thermal damage was primarily limited to the floor area between the two forward seats near the main bus tie circuit breaker panel and extended to the forward edge of the wing spar. All exposed surfaces were heavily sooted. Some localized melting and thermal-related tearing of the aluminum structure was present. The primer paint on the floor panels under the right aft corner of the pilot seat and the left aft corner of the co-pilot seat was discolored dark brown. An aluminum stringer in this location exhibited broomstrawing indicating that the stringer material was heated to near its melting point prior to impact. A single wire located in the area exhibited notching consistent with mechanical rubbing. The main bus tie circuit breakers were partially missing. The remaining breakers were heavily sooted on their aft ends, and one breaker was thermally discolored. Areas of charring were on the backside of the panel. Examination of the wiring in this area showed evidence of electrical arcing damage. Four hydraulic lines servicing the landing gear system were located in this area, and all the lines exhibited signs of thermal exposure with melting and missing sections of material. Six exemplar airplanes of the same make and model as the accident airplane were examined, and instances of unsafe conditions in which electrical lines and hydraulic lines in the area of the main bus tie circuit breaker panel were in direct contact were found on all six airplanes. Some of the wires in the exemplar airplanes showed chafing between hydraulic lines and the electrical wires, which, if left uncorrected, could have led to electrical arcing and subsequent fire. Based on the unsafe conditions found during examination of the exemplar airplanes and the thermal damage to the area near the main bus tie circuit breaker panel on the accident airplane, including broomstrawing of the aluminum structure, electrical arcing damage to the wiring, and melting of the hydraulic lines, it is likely that an electrical wire near the tie bus circuit breakers chafed on a hydraulic line and/or airplane structure, which resulted in arcing and a subsequent in-flight fire that was fed by the hydraulic fluid.", "probable_cause": "An inflight fire in the floor area near the main bus tie circuit breaker panel that resulted from chafing between an electrical wire and a hydraulic line and/or airplane structure.\n"}