{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-mt-masin", "date": "Oct 12, 1998", "type": "PZL-Mielec AN-2", "operator": "Bashkirian%20Airlines", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Sibay - Ufa", "msn": "1G234-17", "yom": 1989, "flight_number": null, "city": "Mt Masim", "zone": "Republic of Bashkortostan", "country": "Russia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 13, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Sibay Airport with 13 passengers and a crew of three including one inspector. Despite marginal weather conditions, the crew initiated the flight under VFR mode. After takeoff, the crew failed to follow the departure route and deviated from the published one. About half an hour into the flight, weather conditions deteriorated with low clouds. After the aircraft entered clouds, the captain decided to return to Sibay but this decision was taken too late. At this time, the aircraft was off course by 45 km to the northeast of the initial route. While making a turn to the left, still in the clouds, the crew failed to realize his altitude was too low when, at an altitude of 980 metres, the aircraft collided with trees and crashed on the slope of Mt Masim (1,040 metres high). All 16 occupants were rescued, among them three passengers were injured. ", "probable_cause": "The following findings were identified:\r\n- Poor flight planning and preparation, \r\n- The crew decided to continue the flight under VFR mode in IMC conditions, \r\n- The crew deviated from the initial course and then continued over mountainous terrain below the minimum prescribed altitude,\r\n- The flight inspector failed to verify that the crew prepared the flight according to published procedures,\r\n- Lack of ATC assistance,\r\n- Lack of visibility due to low clouds. "}