{"url": "https://www.baaa-acro.com/crash/crash-antonov-24b-cairo", "date": "Sep 30, 1966 at 1402 LT", "type": "Antonov AN-24", "operator": "United-Arab-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Luxor – Cairo", "msn": "67302809", "yom": 1966, "flight_number": "MS322", "city": "Cairo-Intl", "zone": "Cairo", "country": "Egypt", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 37, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3304, "captain_hours_type": 675, "copilot_hours": 1233, "copilot_hours_type": 807, "aircraft_hours": 201, "circumstances": "Flight 322 was a scheduled domestic flight from Cairo to Aswan and return with an intermediate stop at Luxor. It departed Cairo at 0700 hours GMT and the sectors Cairo - Luxor, Luxor - Aswan and Aswan - Luxor were uneventful. At 1128 hours the aircraft was ready for the last sector Luxor - Cairo and at 1130 hours it entered the second taxiway to Runway 20 at Luxor and shortly thereafter it was cleared for take-off. Instead of back-tracking on Runway 20 the pilot took off directly from the point he entered the runway, approximately 400 m from its threshold. During the take-off run the pilot-in-command and the co-pilot saw a camel entering the runway from east to west approximately 700 m in front of them. The speed of the aircraft at that time was about 160 km/h. In an attempt to avoid a collision with the camel, the pilot-in-command deviated the aircraft slightly to the right and took off as soon as he could; however, the right wheel struck the camel while the aircraft was about 2 m above the ground. The right landing gear bracing was broken by the impact and although several attempts to retract the undercarriage were made the right gear could not be retracted whilst the left and nose gears were locked in the \"up\" position. The pilot-in-command decided to complete the flight and to carry out a wheels-up landing at Cairo Airport where more ground facilities were available. He landed the aircraft wheels up at 1402 hours on a sand strip to the right of Runway 34 at Cairo Airport. There were no injuries among the 43 occupants while the aircraft was damaged beyond repair. ", "probable_cause": "Collision of the aircraft with a camel which entered the runway during take-off because neither the pilot-in-command nor the tower controller noticed the camel in proper time. In addition, attempts of the pilot-in-command to avoid the collision after he first saw the camel were unsuccessful."}