{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-anchorage", "date": "Dec 23, 1983 at 1406 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Southcentral%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Anchorage - Kenai", "msn": "31-7952193", "yom": 1979, "flight_number": "XE059", "city": "Anchorage-Ted Stevens Intl", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5115, "captain_hours_type": 3550, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A Piper PA-31, N35206, (South Central Air flight 59) was cleared to taxi to runway 06L. The weather at that time was foggy with about 1/8 mile visibility, but the RVR was improving and the airport was expected soon to be acceptable for takeoffs. The PA-31 crew taxied and waited in the holding area for the visibility to improve. A Douglas DC-10, HL7339, Korean Air Lines flight 084, was cleared to runway 32; however, while taxiing in the fog, the DC-10 crew inadvertently taxied to runway 06L/24R. Tower personnel were unable to see the aircraft in the fog and were unaware of the DC-10's position. The DC-10 was cleared to take-off on runway 32 and the PA-31 was cleared to hold on runway 06L. The DC-10 crew taxied on runway 24R and began taking off toward the PA-31 with 2,400 feet of runway remaining. Its estimated takeoff distance was 8,150 feet. Subsequently, the DC-10 collided with the PA-31, continued off the runway and hit stanchion lights, small trees and rough terrain. An investigation revealed the DC-10 pilot did not confirm his position by using his compass and that there was a lack of legible taxiway and runway signs.", "probable_cause": "The failure of the pilot of Korean Air Lines Flight 084 to follow accepted procedures during taxi, which caused him to become disoriented while selecting the runway; the failure of the pilot to use the compass to confirm his position; and the decision of the pilot to take off when he was unsure that the aircraft was positioned on the correct runway. Contributing to the accident was the fog, which reduced visibility to a point that the pilot could not ascertain his position visually and the control tower personnel could not assist the pilot. Also contributing to the accident was a lack of legible taxiway and runway signs at several intersections passed by Flight 084 while it was taxiing."}