{"url": "https://www.baaa-acro.com/crash/crash-boeing-720-040b-near-cairo-121-killed", "date": "May 20, 1965 at 0148 LT", "type": "Boeing 720", "operator": "Pakistan%20International%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Desert", "schedule": "Karachi – Dhahran – Cairo – Geneva – London", "msn": "18379", "yom": 1962, "flight_number": "PK705", "city": "Cairo-Intl", "zone": "Cairo", "country": "Egypt", "region": "Africa", "crew_on_board": 13, "crew_fatalities": 13, "pax_on_board": 114, "pax_fatalities": 108, "other_fatalities": 0, "total_fatalities": 121, "captain_hours": 13142, "captain_hours_type": 2214, "copilot_hours": 6754, "copilot_hours_type": 148, "aircraft_hours": null, "circumstances": "Flight 705 was a scheduled international public transport flight from Karachi to Dhahran, Cairo, Geneva and London. No defects were reported by the crew at Dhahran. The flight departed Dhahran at 2122 hours W. It reported abeam Aqaba, 196 MM from the Cairo omni at 2313 hours, leaving FL 360 at 2322 hours, RD fix at 2330 hours and approaching Ft 130 and one minute away from the field at 2338 hours. The flight was then cleared dm to FL 65 and was given a QNH of 1 014 mb. It reported coming overhead at 2339 hours, passing FL 100 and was instructed to maintain FL 65. It then made a holding turn in the Cairo range pattern, descending to FL 65. On reporting overhead Cairo range station, after completing one holding at 2340 hours the flight was cleared to join left-hand circuit for runway 34 and to report downwind. The crew then informed the tower that they would carry out an instrument let-down and would call when commencing the procedure turn. The flight was then cleared to descend to FL 45 and was told to report procedure turn inbound descending to 2 500 ft. At 2345 hours the crew informed the tower that they were in a position for reporting downwind for runway 34 and, on being asked by the control tower about their intention, they requested a clearance to proceed downwind. During this period the aircraft continued on a southerly heading towards a downwind position for a left-hand circuit for runway 34. Cairo approach control then cleared the flight to descend to circuit height for final approach to runway 34 and to change over to tower frequency 118,1 Mc/s for landing, At 2345 hours the crew reported that they would be turning on final and changing to tower frequency. The flight was then cleared to continue approach and to report on short final. It was given weather information for landing and was asked whether it was turning on to final. At 2348:30 hours the crew acknowledged: \"affirmative\" and finally, at 2348~55 hours, a scratching noise was heard on the control tower receiver and nothing further was heard from the aircraft. Six passengers survived while 121 other occupants were killed. The aircraft was totally destroyed. ", "probable_cause": "The aircraft did not maintain the adequate height for the circuit and continued to descend until it contacted the ground. The reason for that abnormal continuation of descent is unknown."}