{"url": "https://www.baaa-acro.com/crash/crash-cessna-680a-citation-latitude-elizabethton", "date": "Aug 15, 2019 at 1537 LT", "type": "Cessna 680 Citation Latitude", "operator": "JRM%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Statesville - Elizabethton", "msn": "680A-0010", "yom": 2015, "flight_number": null, "city": "Elizabethton", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5800, "captain_hours_type": 765, "copilot_hours": 11000, "copilot_hours_type": 1165, "aircraft_hours": 1165, "circumstances": "The pilots were conducting a visual flight rules cross-country flight with three passengers onboard. The preflight, departure, and cruise portions of the flight were uneventful. During the initial approach to the airport, the flight crew discussed having some difficulty visually acquiring the airport. They also discussed traffic in the area and were maneuvering around clouds, which may have increased the pilots' workload. As the approach continued, the airplane crossed a ridgeline at 710 ft above ground level (agl), which triggered a terrain awareness and warning system (TAWS) alert. Further, the flight crew made several comments about the airplane flying too fast and allowed the airspeed to increase well above the reference speed (Vref) for the approach. At 1535:57 (about 1 minute 52 seconds before landing), the pilot pulled back the throttles to idle, where they stayed for the remainder of the approach. In an attempt to slow the airplane for landing, the pilot partially extended the speedbrakes when the airplane was below 500 ft agl, which is prohibited in the airplane flight manual (AFM). Five seconds before touchdown, the airplane's descent rate was 1,500 ft per minute (fpm), which exceeded the maximum allowed for landing per the AFM of 600 fpm. When the airplane first touched down, it was traveling about 18 knots above Vref. The pilot did not extend the speedbrakes upon touchdown, which the landing checklist required, but instead attempted to deploy the thrust reversers immediately after touchdown, which was a later item on the landing checklist. However, the thrust reversers did not unlock because the airplane bounced and was airborne again before the command could be executed, which was consistent with system design and logic: the thrust reversers will not unlock until all three landing gear are on the ground. The airplane touched down four times total; on the third touchdown (after the second bounce), when all three landing gear contacted the runway, the thrust reversers unlocked as previously commanded during the first touchdown. Although the pilot subsequently advanced the throttles to idle, which would normally stow the thrust reversers, the airplane had bounced a third time and had already become airborne again before the thrust reversers could stow. When the airplane became airborne, the system logic cut hydraulic power to the thrust reverser actuators; thus the reversers would not stow. The thrust reversers were subsequently pulled open due to the aerodynamic forces. The pilot attempted to go around by advancing the throttles when the airplane was airborne. However, the electronic engine controls prevented the increase in engine power because the thrust reversers were not stowed. When the airplane touched down the fourth and final time, the pilot attempted to land straight ahead on the runway; the airplane touched down hard and the right main landing gear then collapsed under the wing. The airplane departed the paved surface and came to rest about 600 ft beyond the runway threshold. The passengers and crew eventually evacuated the airplane through the main cabin door, and the airplane was destroyed in a postaccident fire. A postaccident examination of the airplane systems, structure, powerplants, and landing gear revealed no evidence of mechanical malfunctions or anomalies that would have precluded normal operation. The airplane's approach was unstabilized: its airspeed during the approach and landing well exceeded Vref and its descent rate exceeded the maximum allowed for landing just seconds before touchdown. Both the pilot and copilot commented on the airplane's high speed several times during the approach. During short final, the pilot asked the copilot if he should go around, and the copilot responded, \"no.\" Although the copilot was the director of operations for the flight department and the direct supervisor of  the pilot, the pilot stated that the copilot's position did not influence his decisions as pilot-in-command nor did it diminish his command authority. Neither the pilot nor copilot called for a go-around before landing despite awareness that the approach was unstabilized. As the airplane touched down, the pilot failed to follow the AFM guidance and used the thrust reversers before the speedbrakes. According to the airplane manufacturer's calculations, the airplane could have stopped within the length of runway available if the airplane had not bounced and the speedbrakes and wheel brakes were used at the point of the first touchdown. After the third touchdown, when the airplane became airborne again, the pilot attempted a go-around; the AFM prohibits touch-and-go landings after the thrust reversers are deployed. It is critical for pilots to know the point at which they should not attempt a go-around; a committed-to-stop (CTS) point is the point at which a go-around or rejected landing procedure will not be initiated and the only option will be bringing the aircraft to a stop. Establishing a CTS point eliminates the ambiguity for pilots making decisions during time-critical events. The FAA issued Information for Operators 17009, \"Committed-toStop Point on Landings,\" to inform operators and pilots about the importance of establishing a CTS point; however, the director of operations was not aware of the concept of a CTS point during landing.", "probable_cause": "The pilot's continuation of an unstabilized approach despite recognizing associated cues and the flight crew's decision not to initiate a go-around before touchdown, which resulted in a bounced landing, a loss  of airplane control, a landing gear collapse, and a runway excursion. Contributing to the accident was the pilot's failure to deploy the speedbrakes during the initial touchdown, which may have prevented the runway excursion, and the pilot's attempt to go around after deployment of the thrust reversers."}