{"url": "https://www.baaa-acro.com/crash/crash-antonov-12-lensk-6-killed", "date": "Nov 2, 1968 at 1200 LT", "type": "Antonov AN-12", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Ust-Kut - Mirny", "msn": "4 018 05", "yom": 1964, "flight_number": null, "city": "Lensk", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Ust-Kut Airport on a cargo flight to Mirny, carrying a load of 18 tons of cement. Few minutes after takeoff, the crew was informed that a landing at Mirny Airport was impossible due to technical problems and the captain decided, without referring to his operations, to divert to Lensk Airport where the weather conditions were considered as poor. At that time, the sky was overcast with clouds down to 600 meters, an horizontal visibility of 2,500 meters with rain and snow. The flight was continued at an altitude of 8,000 meters then the crew was cleared to descent to 3,000 meters and to start the approach to Lensk. On final, the pilot-in-command failed to realize his altitude was insufficient when the airplane struck tall trees (20 meters high) in a flat attitude, continued the descent and crashed 420 meters further in a wooded area. The wreckage was found 15,6 km short of runway threshold. The aircraft was totally destroyed and all six crew members were killed. ", "probable_cause": "The accident was the consequence of a premature descent and a controlled flight into terrain for undetermined reason. Nevertheless, the assumption that an engine may have failed on approach was not ruled out. At the time of the accident, Lensk Airport was not equipped with an ILS system or any kind of ground guidance assistance system. "}