{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31p-pressurized-navajo-augusta-2-killed", "date": "Jun 16, 2003 at 1302 LT", "type": "Piper PA-31-310 Navajo", "operator": "Gold Wing Transportation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Augusta – Belmont", "msn": "31-7730008", "yom": 1977, "flight_number": null, "city": "Augusta-Bush Field", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4412, "circumstances": "A witness at the airport stated the airplane appeared to use half of the 8,000-foot runway on takeoff roll, and the climb out appeared \"very flat.\" During climbout, the pilot reported to the tower controller the airplane \"lost an engine,\" and he announced intentions to return to the runway. The controller stated he noticed the airplane continued straight out and appeared to be losing altitude. Witnesses north of the airport observed the airplane flying low and described its engine noises as \"erratic,\" \"skipping,\" \"sputtering,\" and \"some sort of backfire.\" One witness stated the airplane was moving slowly to the north with a high nose-up angle, and the airplane \"appeared to stall\" then dove vertically into the trees. Examination of the accident site revealed wreckage debris and broken trees were scattered approximately 120 feet. The airframe, engines, and the right propeller sustained fire damage. The left propeller, top forward portion of the left engine case, and the left propeller gear shaft and bearings were not located. Examination of recovered components revealed no evidence of mechanical malfunction could be determined. According to the Pilot's Operating Handbook for the Piper PA-31P, the stall speed for the airplane with the gear and flaps up is: \"(7800 lbs) 80 KCAS, 81 KIAS.\"", "probable_cause": "The pilot's failure to maintain airspeed while maneuvering on initial take off climb resulting in an inadvertent stall, loss of control, and subsequent in-flight collision with trees and a swamp. A factor in the accident was a reported loss of engine power for undetermined reasons."}