{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-near-lake-siljan-kuel-2-killed", "date": "Aug 30, 2019 at 0730 LT", "type": "Antonov AN-2", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Mountains", "schedule": "Us-Khatyn – Suordakh", "msn": "1G218-48", "yom": 1986, "flight_number": null, "city": "Lake Siljan-Kuel", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 12500, "captain_hours_type": 3806, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3848, "circumstances": "The single engine airplane departed Us-Khatyn on a flight to Suordakh, carrying five passengers, two pilots and a load consisting of 600 kilos of various goods. While cruising at an altitude of about 1,450 metres, the crew encountered moderate atmospheric turbulences and was unable to maintain the altitude. The aircraft lost height and crashed on the rocky slope of amountain located 15 km southeast from the Lake Siljan-Kuel, some 250 km from the destination. Two passengers were killed while five others occupants were injured. The aircraft was destroyed. ", "probable_cause": "The accident was caused by the fact that the PIC did not maintain a safe flight altitude in mountainous terrain, which led to the aircraft getting into strong downdrafts while flying over the leeward side of the ridge, uncontrolled descent and collision with the top of the mountain.\r\nThe contributing factors of AP, most likely, were:\r\n- insufficient analysis of meteorological conditions and the possibility of the formation of strong ascending and descending air currents in the mountains;\r\n- Failure of the PIC to take safety measures when flying in the mountains and to act in case of falling into downward air currents when crossing a mountain ridge;\r\n- the use of motor gasoline with an octane rating of less than 95, which led to a decrease in engine power;\r\n- performing a mission on the An-2 aircraft without the procedure for restoring skills and admission to flights on this type after a significant break in flights (about 15 years)."}