{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh89-dragon-rapide-milngavie-7-killed", "date": "Sep 27, 1946 at 1340 LT", "type": "De Havilland DH.89 Dragon Rapide", "operator": "Railway-Air-Services-1", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Port Ellen – Glasgow", "msn": "6386", "yom": 1938, "flight_number": null, "city": "Milngavie", "zone": "Dunbartonshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The descent to Glasgow-Renfrew Airport was started in poor weather conditions with a visibility of 3 km in drizzle. The crew passed over the airport at 1320LT without seeing the airfield and continued to the northwest. Three minutes later, the contact between the crew and local ATC was interrupted by a distress call from another DH.89 of Railway Air Services registered G-ADAJ. His copilot sent a mayday message and obtained the priority to land as he was short of fuel. As G-AFFF failed to arrive, SAR operations were conducted and its wreckage was found on the slope of Mt Craighton, near Milngavie, north of Glasgow. The aircraft was destroyed by impact forces and a post crash fire and all 7 occupants were killed. \r\nCrew:\r\nFredrick Stephens, pilot,\r\nAlexander M. Calvert, navigator.\r\nPassengers:\r\nAlexander Jamieson, \r\nJames Crombie,\r\nJohn McKay,\r\nGeorge Beattie,\r\nDerek Miles.", "probable_cause": "The crew probably lost his orientation on approach to Renfrew Airfield and continued to the northwest without making any visual contact with the airport. At the time of the accident, weather conditions were poor with low visibility. However, it was determined that the distress call from the copilot of the second aircraft was unfounded as there was sufficient fuel in the tanks for at least one hour flight. The captain of G-ADAJ asked his copilot to cancel the distress call but he failed to do so and obtained the priority to land. In the meantime, as the radio contact was lost with the first aircraft, it is believed that his crew misinterpreted some instructions transmitted from ATC to the second aircraft and continued to the north without knowing his real position. "}