{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-28-mezhdurechenskoye-5-killed", "date": "Oct 4, 2017 at 1853 LT", "type": "PZL-Mielec AN-28", "operator": "East-Wing", "flight_phase": "Flight", "flight_type": "Ambulance", "survivors": "No", "site": "Plain, Valley", "schedule": "Almaty - Shymkent", "msn": "1AJ007-14", "yom": 1990, "flight_number": null, "city": "Mezhdurechenskoye", "zone": "Almaty Province", "country": "Kazakhstan", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 12000, "captain_hours_type": 2930, "copilot_hours": 486, "copilot_hours_type": 110, "aircraft_hours": 3631, "circumstances": "The twine engine airplane departed Almaty Airport at 1835LT on an ambulance flight to Shymkent, carrying two doctors, two pilots and one flight mechanic. About 22 minutes into the flight, while cruising by night and poor weather conditions, the crew encountered an unexpected situation and was forced to shut down the right engine. Shortly later, the aircraft crashed near the village of Mezhdurechenskoye, some 28 km northwest of Almaty Airport, bursting into flames. The aircraft was totally destroyed by impact forces and a post crash fire and all five occupants were killed. ", "probable_cause": "The probable cause of the accident was the shut down of the right engine and then the left engine, possibly due to a faulty shut down on part of the crew. In the course of the subsequent emergency descent due to complete loss of power of the engines with no radio communication with air traffic controllers, as well as possibly due to the resulting confusion and nervousness, the crew unintentionally forgot to switch the pressure value on the mechanical barometric altimeter of the aircraft to the pressure on the landing airfield (704 mm Hg), leaving the pressure value of 760 mm Hg, which led to incorrect readings of true altitude of the flight. Subsequently, the crew was able to start the engines and attempt to make a forced landing at a distance of 28 km from the airfield of Almaty at night in poor weather conditions in an unlit area. Incorrect readings on the barometric altimeter of the true flight altitude (the radio altimeter showed 750 m) resulted in the aircraft colliding with a power line, causing a fire, as well as colliding with the ground, as a result of which the aircraft structure completely collapsed and burned down."}