{"url": "https://www.baaa-acro.com/crash/crash-vickers-724-viscount-noiretable-60-killed", "date": "Oct 27, 1972 at 1918 LT", "type": "Vickers Viscount", "operator": "Air%20Inter", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Lyon – Clermont-Ferrand – Bordeaux", "msn": "50", "yom": 1955, "flight_number": "IT696", "city": "Noirétable", "zone": "Loire", "country": "France", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 63, "pax_fatalities": 55, "other_fatalities": 0, "total_fatalities": 60, "captain_hours": 14849, "captain_hours_type": null, "copilot_hours": 2154, "copilot_hours_type": null, "aircraft_hours": 31413, "circumstances": "During a short flight from Lyon to Clermont-Ferrand by night, the crew was briefed about poor weather conditions en route and at destination with storm activity, turbulences, heavy rain falls, icing conditions and low ceiling. The crew was cleared to start an ILS approach to Clermont-Ferrand and received the permission to descend to 3,600 feet. In clouds, the four engine airplane struck trees then crashed inverted on the Pic du Picot (1,100 meters high) located in the Forez Mountain Range, near Noirétable. The wreckage was localized seven hours later in the Faye forest. Eight passengers were evacuated while 60 other occupants were killed. ", "probable_cause": "According to the investigating committee, the accident was the direct result of a collision with the terrain, which occurred at night in stormy conditions in the vicinity of a cold front, while the aircraft was following a seemingly normal approach procedure but deviated to the east about 30 km. The genesis of the accident has two anomalies. The first consists in the fact that the crew was convinced to be really vertical of Clermont-Ferrand whereas this beacon was, in fact, more than 30 km away. It can only be explained by a frank rotation of the radiocompass whose crew did not detect the aberrant character. It must also be admitted, moreover, that the radiocompass indications subsequently showed consistent variations with the successive positions of the aircraft during the double descent circuit and with the second overflight of the Clermont-Ferrand beacon. The second anomaly is characterized by the announcement of the aircraft flying over the beacon, with more than three minutes ahead of an estimated eight minutes. This difference may have been neglected by the crew because of their reliance on the radiocompass indication. We can also think that this difference went unnoticed by the crew either by forgetting to check the time, or by a reading error, the crew having to cope with a difficult steering because of the turbulence and the presence of an instructor who could also be a factor of concern and distraction at this time. The commission's work has made it possible to rule out the assumption of a pirate transmitter, the erroneous indication of the radiocompass could have come from either a fault in the installation of the on-board antenna system associated with certain conditions of the electric field , or more likely very localized precipitation that accompanied the cold front in the area of ​​the accident and that could constitute a kind of transmitter (series of micro discharges) powerful enough to be during all this phase of flight detected by the radiocompass of the plane while stifling the field of the beacon of Clermont-Ferrand. The interception of the ILS alignment plan probably reinforced the crew's conviction. In addition, it is not impossible that the luminous halo of the city of Thiers, perhaps visible at certain times, could constitute an additional factor of motivation. Although the instructor pilot had the reputation of attaching great importance to a cross-checking of positions, which was possible in particular by the radial of Moulins, it seems that the crew did not do anything about it. The commission ultimately accepts the possibility of an aberrant indication of a radiocompass, but can not explain the reasons which prevented the crew from properly controlling the point from which the descent was started and continued. In conclusion, it is understood that the accident was the consequence of a controlled flight into terrain. "}