{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-oklahoma-city", "date": "May 20, 2002 at 0801 LT", "type": "Cessna 550 Citation II", "operator": "Airlease", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Oklahoma City - Greeley", "msn": "550-0263", "yom": 1981, "flight_number": null, "city": "Oklahoma City-Wiley Post", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13000, "captain_hours_type": 150, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2956, "circumstances": "The twin-tubofan airplane overran the runway during an aborted takeoff, impacting two fences before coming to rest. The pilot reported experiencing no anomalies with the airplane during the preflight inspection and taxi portion of the flight. During takeoff roll, at V1 (103 knots), the pilot began to pull aft on the control yoke. The pilot noticed the nose landing gear was not coming off of the runway and at 120 knots, with full aft control input, elected to abort the takeoff. He pulled the power to idle and applied maximum braking. Upon seeing the localizer antennas approaching the airplane at the departure end of the runway, the pilot veered the airplane to the right of centerline. The airplane departed the runway surface and impacted the fences. Post-accident examination of the runway revealed tire skid marks on the runway that led to the airplane's final resting place. The tire skid marks measured 1,765 feet in length. Examination of the wreckage revealed no pre-existing brake system anomalies that would have hindered the airplane's braking capability. Examination of the elevator trim system revealed it was 12 degrees out of trim in the nose down direction. The airplane underwent a Phase B and Phase 1 through 5 inspections approximately 5 months prior to the accident. The manufacturer's inspection manual indicates the elevator system should be examined every Phase 5 inspection. The aircraft's flight manual informs the pilot that the right elevator and trim tab should be inspected during the exterior inspection to ensure the elevator trim tab position matches its indicator.", "probable_cause": "The anomalous elevator trim system and the pilot's failure to note its improper setting prior to takeoff."}