{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46a-36-cu-commando-dyess-afb-2-killed", "date": "Sep 2, 1959 at 1716 LT", "type": "Curtiss C-46 Commando", "operator": "Aaxico%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Carswell - Dyess", "msn": "26809", "yom": 1944, "flight_number": "AAX7002", "city": "Dyess AFB", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7294, "captain_hours_type": 3656, "copilot_hours": 4839, "copilot_hours_type": 287, "aircraft_hours": null, "circumstances": "The aircraft crashed on runway 16 at Dyess AFB, Abilene, Texas. The crash occurred while the pilots were attempting to land the aircraft with the elevator controls inoperative. The captain and copilot, the only persons aboard, were killed. The aircraft was demolished. Examination of the longitudinal control system of the aircraft disclosed that the aft end of the aft link assembly was disconnected from the clevis in the elevator control horn assembly. This condition would render the elevator control inoperative. From irrefutable physical evidence the Board concludes that the bolt which normally secures the link assembly-clevis attachment was not in place at impact. It concludes that the bolt worked out following departure from Dyess AFB, resulting in the loss of control which caused the accident. The Board further concludes that the bolt worked out because it was improperly secured, a condition which should have been detected during a No. 2 maintenance inspection completed just prior to the origination of Trip 7002. The inspection was performed by Associated Airmotive., Inc., a certificated repair station which performed under contract the maintenance work for AAXICO.", "probable_cause": "The Board determines that the probable cause of this accident was loss of elevator control because of an improperly secured bolt, a condition which was undetected because of an inadequate inspection."}