{"url": "https://www.baaa-acro.com/crash/crash-antonov-32a-popayan-3-killed", "date": "Apr 19, 2002 at 0853 LT", "type": "Antonov AN-32", "operator": "Selva%20Colombia2", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Popayán – Medellín", "msn": "2508", "yom": 1991, "flight_number": null, "city": "Popayán-Guillermo León Valencia", "zone": "Cauca", "country": "Colombia", "region": "South America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 9798, "captain_hours_type": 1548, "copilot_hours": 1069, "copilot_hours_type": 855, "aircraft_hours": 3153, "circumstances": "The aircraft was chartered to transfer groups of prisoners from Medellín to Popayán on behalf of the National Penitentiary and Prison Institute. Fifty prisoners just disembarked at Popayán Airport when the crew departed on a ferry flight to Medellín for a second similar rotation. Popayán Airport is located at an altitude of 1,733 metres and its runway is 1,906 metres long. For unknown reasons, the crew decided to start the takeoff procedure from the intersection, reducing the available takeoff distance to 910 metres. Also, the flaps were deployed to an angle of 25° instead of 15° and the engine power was set at 95% instead of 100% as stipulated in the company procedures for airport located above the altitude of 1,400 metres. During the takeoff roll, at a distance of 150 metres from the runway end, the pilot realized he could not make it so he rejected the takeoff procedure and started an emergency braking manoeuvre. Unable to stop within the remaining distance, the aircraft overran, struck trees and came to rest, broken in two. Three passengers were killed while five other occupants were injured. ", "probable_cause": "Improper execution by the crew by not following the procedures, instructions and manuals of the aircraft manufacturer and approved to the SELVA company by the UAEAC, specifically when attempting to perform a takeoff in a wrong configuration, with a reduced power setting and an insufficient runway length for the execution of the procedure."}