{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-10-memphis", "date": "Dec 18, 2003 at 1226 LT", "type": "Douglas DC-10", "operator": "FedEx", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Oakland – Memphis", "msn": "46600", "yom": 1971, "flight_number": "FDX647", "city": "Memphis", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 21000, "captain_hours_type": 2602, "copilot_hours": 15000, "copilot_hours_type": 1918, "aircraft_hours": 65375, "circumstances": "On December 18, 2003, about 1226 central standard time, Federal Express Corporation (FedEx) flight 647, a Boeing MD-10-10F (MD-10), N364FE, crashed while landing at Memphis International Airport (MEM), Memphis, Tennessee. The right main landing gear collapsed after touchdown on runway 36R, and the airplane veered off the right side of the runway. After the gear collapsed, a fire developed on the right side of the airplane. Of the two flight crewmembers and five non revenue FedEx pilots on board the airplane, the first officer and one non revenue pilot received minor injuries during the evacuation. The post crash fire destroyed the airplaneís right wing and portions of the right side of the fuselage. Flight 647 departed from Metropolitan Oakland International Airport (OAK), Oakland, California, about 0832 (0632 Pacific standard time) and was operating under the provisions of 14 Code of Federal Regulations (CFR) Part 121 on an instrument flight rules flight plan. ", "probable_cause": "The National Transportation Safety Board determines that the probable causes of the accident were:\r\n1) the first officerís failure to properly apply crosswind landing techniques to align the airplane with the runway centerline and to properly arrest the airplaneís descent rate (flare) before the airplane touched down; and \r\n2) the captain's failure to adequately monitor the first officerís performance and command or initiate corrective action during the final approach and landing. "}