{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-bullhead-city", "date": "Jan 5, 1997 at 1243 LT", "type": "Swearingen SA227 Metro III", "operator": "Skylink Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Long Beach - Grand Canyon", "msn": "AC-514", "yom": 1982, "flight_number": null, "city": "Bullhead City", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 19, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3200, "captain_hours_type": 300, "copilot_hours": 640, "copilot_hours_type": 56, "aircraft_hours": 25111, "circumstances": "After executing a missed approach at the Grand Canyon Airport, the pilots diverted to the Bullhead City Airport. The pilots reported that minimal icing conditions were encountered with about 1/8 inch of ice accumulating on the aircraft wings. The pilots stated they cycled the deice boots to shed ice. They did not observe ice on the propeller spinners, and they did not activate the engines' 'override' ignition systems, as required by the airplane's flight manual. Use of 'override' ignition was required for flight into visible moisture at or below +5 degrees Celsius (+41 degrees Fahrenheit) to prevent ice ingestion/flameouts. Subsequently, both engines flamed out as the airplane was on about a 3 mile final approach for landing with the landing gear and flaps extended. The aircraft was destroyed during an off-airport landing. ", "probable_cause": "Failure of the pilot(s) to use 'override' ignition as prescribed by checklist procedures during an encounter with icing conditions, which subsequently led to ice ingestion and dual engine flame-outs. Factors related to the accident were: the adverse weather (icing) conditions, the accumulation of airframe/engine ice, and lack of suitable terrain in the emergency landing area. "}