{"url": "https://www.baaa-acro.com/crash/crash-consolidated-b-24j-15-fo-liberator-near-glossop", "date": "Oct 11, 1944 at 1045 LT", "type": "Consolidated B-24 Liberator", "operator": "USAAF", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "Yes", "site": "Mountains", "schedule": "Burtonwood – Hardwick", "msn": "3534", "yom": null, "flight_number": null, "city": "Glossop", "zone": "Derbyshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was being ferried from Burtonwood to Hardwick by a two man ferry crew on the 11th October 1944, the two men took off in the aircraft from Burtonwood near Warrington at 1032LT. They set a course of 135° and climbed to an indicated altitude of 2,800 feet. At approximately 1045LT, while in cloud and moderate to severe turbulence, Lt Houpt spotted a small gap in the cloud and saw the ground was only about 150 feet below him. He then applied full power and began to climb, but before they could gain any meaningful height the aircraft struck the ground on Mill Hill some 1.5 mile from the Grouse Inn between Hayfield and Glossop. The two men extricated themselves from the shattered cockpit and walked along one of the streams until they reached the Hayfield to Glossop road. A passing lorry driver stopped and picked them up and took them to a nearby pub where Lt Houpt telephoned Burtonwood to report the accident. They were then retrieved by an Ambulance from Burtonwood and their injuries were then treated. These were mainly cuts & bruises but Lt Houpt did suffer a broken jaw.\r\nCrew (310th FS):\r\n2nd Lt Creighton R. Houpt, pilot,\r\nS/Sgt Jerome M. Najvar, flight engineer.\r\nSource & photo:\r\nhttp://www.peakdistrictaircrashes.co.uk/pages/peakdistrict/peakdistrict42-52003.htm", "probable_cause": null}