{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-11f-seoul", "date": "Jun 6, 2016 at 2243 LT", "type": "McDonnell Douglas MD-11", "operator": "UPS", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Seoul - Anchorage", "msn": "48578/588", "yom": 1995, "flight_number": "UPS061", "city": "Seoul-Incheon", "zone": "Incheon (인천)", "country": "South Korea", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7769, "captain_hours_type": 6152, "copilot_hours": 4236, "copilot_hours_type": 3491, "aircraft_hours": 63195, "circumstances": "The crew started the takeoff procedure from runway 33L at Seoul-Incheon Airport and reached V1 speed after a course of 6,413 feet. At a speed of 182 knots, the crew heard a noise corresponding to the failure of both tires n°9 and 10 located on the central landing gear. The captain decided to abandon the takeoff procedure and initiated an emergency braking maneuver. Unable to stop within the remaining distance of 4,635 feet (in relation with the total weight of 629,600 lbs), the airplane overran. While contacting a grassy area, the nose gear collapsed then the airplane struck various equipment of the localizer antenna and came to rest 485 meters past the runway end. All four crew members escaped uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "The decision of the crew to abandon the takeoff procedure at a speed slightly above V1 due to the failure of both tyres n°9 & 10 located on the central landing gear. The aircraft then overran due to the combination of the following factors: \r\n- Limited time and information available to the crew to evaluate the situation,\r\n- Dynamic instability of the central landing gear caused by both tyres' failure,\r\n- Decrease of 48% of the braking performances due to the rupture of a hydraulic pipe located on the primary braking system."}