{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61p-aerostar-ted-smith-601-burlington", "date": "Oct 12, 2000 at 0931 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Air Capital Enterprises", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Burlington – Toronto", "msn": "61-0629-7963287", "yom": 1979, "flight_number": null, "city": "Burlington", "zone": "Vermont", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15000, "captain_hours_type": 30, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot reported that after rotation, he obtained a positive rate of climb. At 110 knots, with the landing gear retracted and the wing flaps at 10 degrees, he noticed a right roll, a drop in climb performance, and a drop of manifold pressure on the right engine to at least 34 inches. The left engine maintained 42 inches. The pilot decided that, due to a \"very minimum climb rate, rising terrain ahead, [and] airspeed not increasing,\" he would land the airplane in a small field about 1/4 mile and 50 degrees to the left. The pilot abruptly lowered the nose of the airplane and raised the flaps to gain airspeed, then landed with a nose-high attitude and the landing gear partially extended. Post-accident examination of the airplane revealed there was vertical compression to the belly area, the fuselage was spilt across the top at the aft end of the cabin, and both wings were damaged, with the left wing buckled downward just inboard of the engine. Examination also revealed that a clamp on the right engine intake manifold was loose. An estimated takeoff weight placed the airplane 74 pounds over the maximum allowed of 6,200 pounds. The type certificate holder estimated that with the airplane at 6,400 pounds, climbing at 110 kts, and with a partial power loss down to 26 inches on one engine, the rate of climb should have been 1,150 fpm with flaps and landing gear up, and 830 fpm with flaps 10 degrees and landing gear down. Higher terrain was to the east, and lower terrain was to the west. Terrain elevation for a straight-out departure was 25 feet above the runway at 0.5 nm, and 70 feet above the runway at 2.8 nm. The pilot reported his total flight experience as 15,000 hours, which included 13,000 hours in multi-engine airplanes, and 30 hours in make and model, all with the preceding 90 days. ", "probable_cause": "The pilot's improper in-flight decision to perform a precautionary landing, and his failure to maintain airspeed after he experienced a partial loss of power on one engine. A factor was the partial loss of power on one engine due to an induction air leak. "}