{"url": "https://www.baaa-acro.com/crash/crash-casa-nurtanio-cn235-100m-iptn-ankara-4-killed", "date": "May 18, 2001", "type": "Casa-Nurtanio CN-235 (IPTN)", "operator": "Sahil%20G%C3%BCvenlik", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Ankara - Ankara", "msn": "C-153", "yom": 2000, "flight_number": null, "city": "Ankara-Mürted AFB (Akinci)", "zone": "Central Anatolia Region (İç Anadolu Bölgesi)", "country": "Turkey", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was engaged in a local test flight at Ankara-Mürted AFB. Shortly after takeoff, while climbing to a height of about 100 feet, the aircraft went out of control and crashed, bursting into flames. All four crew members were killed. According to Turkish Authorities, this aircraft was the last of a series of eight CN-235 intended for the Turkish Navy and was still operated under the Turkish Coast Guard, taking part to a certification program. Several modifications have been made on this model by technicians from Turkish Aerospace Industries (TAI) and the crew consisted of four pilots, one Turkish and three Spanish from the Casa/EADS Consortium.", "probable_cause": "In a report published at the end of June 2001, the Turkish and Spanish Authorities confirmed that despite the care taken in the quality control systems, the Turkish engineers were unable to detect a malfunction of the aileron control system probably stemming from an error made during the mounting. Despite the fact that the accident was attributable to the negligence of engineers at Turkish Aerospace Industries (TAI), investigators believe that the three accidents involving Casa CN-235s in Turkey in five months are likely to have resulted from three different causes."}