{"url": "https://www.baaa-acro.com/crash/crash-avro-748-george-3-killed", "date": "Jun 1, 2002 at 0715 LT", "type": "Avro 748", "operator": "AirQuarius", "flight_phase": "Landing (descent or approach)", "flight_type": "Postal (mail)", "survivors": "No", "site": "Mountains", "schedule": "Bloemfontein - George", "msn": "1782", "yom": 1980, "flight_number": null, "city": "George", "zone": "Western Cape", "country": "South Africa", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 20963, "captain_hours_type": 1819, "copilot_hours": 1099, "copilot_hours_type": 518, "aircraft_hours": 14226, "circumstances": "The aircraft was on a scheduled freight flight from Bloemfontein to George. Poor weather conditions prevailed over the George area and the pilots had to execute an instrument guided approach for the landing. The ground based Instrument Landing System (ILS) on Runway 29 at George Aerodrome was intermittently unreliable during the approach. The pilots decided to execute a missed approach. During the missed approach the pilots did not comply with the published missed approach procedure and with a combination of strong winds and possible erroneous heading indications they lost situational awareness. They flew the aircraft into a valley and crashed into the side of the mountains North-East of the George Aerodrome. The passenger was Hansie Cronje, a former South African cricket captain who had missed a South African Airlines flight.\n", "probable_cause": "The crew deviated from the prescribed missed approach procedure during an attempted Instrument Landing System landing on Runway 29 at George in Instrument Meteorological Conditions and lost situational awareness aggravated by the presence of strong upper SouthWesterly winds. They allowed the aircraft to drift off course resulting in a controlled impact with terrain 6.7 nm North-East of the aerodrome. Contributing factors to the probable cause were the weather conditions, the intermittent unreliability of the Instrument Landing System, the serviceability of the directional gyro and the uncleared defects."}