{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh34b-croydon-8-killed", "date": "Dec 24, 1924 at 1200 LT", "type": "De Havilland DH.34", "operator": "Imperial%20Airways-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Croydon - Paris", "msn": "36", "yom": 1922, "flight_number": null, "city": "Croydon", "zone": "Surrey", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after takeoff from Croydon Airport, while climbing to a height of 300 feet, the aircraft suffered a technical problem, stalled and crashed in an open field located in Purley, some 2,4 km south of the airport, bursting into flames. SAR arrived quickly on the scene but it was impossible to rescue the eight occupants who were prisoner of the fire. The pilot and five passengers were British citizens, another was Brazilian and the last was a Chilean. ", "probable_cause": "The report into the inquiry was published on 10FEB1925. The inquiry concluded that the aircraft was airworthy at the time of departure. There was no blockage in the petrol pipe, such damage being as a result of the firefighting operations subsequent to the crash. The use of unarmored pipe had been allowed by Air Ministry officials who were unaware of an instruction issued on 6 December 1923 that armored piping was to be used. Such usage of non-armored piping had no relevance to the accident. The then-current conditions existing at Croydon Airport meant that pilots were unable to comply with certain parts of the Air Navigation (Consolidation) Order, 1923 and that the condition of the airfield was at least a contributory factor in the accident. It also found that clarification of the meaning of the word \"flight\" in parts of the order was needed. No negligence was found on the part of the Air Ministry or Imperial Airways. The pilot was cleared of blame for the accident. The aircraft was found to have crashed due to an unknown mechanical defect and subsequent stall whilst an emergency landing was being attempted. In conclusion, it was determined that G-EBBX had experienced some type of mechanical malfunction prior to the accident, but the nature of the problem could not be determined. The fact that Croydon had been listed as an ‘unsatisfactory’ airport, because of its wind conditions, could have been a contributing factor, according to the investigative report."}