{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-bethel", "date": "Jul 8, 2019 at 1505 LT", "type": "Cessna 208B Grand Caravan", "operator": "Grant%20Aviation-2_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Newtok – Bethel", "msn": "208B-0121", "yom": 1988, "flight_number": "GV262", "city": "Bethel", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2258, "captain_hours_type": 787, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 21206, "circumstances": "The commercial pilot was conducting a visual flight rules scheduled passenger flight with five passengers. During the return leg to the company’s base airport, the pilot requested, and was given clearance to, a short gravel runway of 1,858 ft that terminated at parallel cross-runways and had inbound airplanes. The wind was reported as variable at 3 knots, and the outside air temperature was 88°F which was 25° warmer than usual. The pilot stated that he conducted a steeper than normal approach and performed a normal 30° flap landing flare; however, the airplane floated halfway down the runway. He initiated a go-around by advancing the throttle to takeoff power and retracting the flaps to 20° as the main landing gear briefly touched down. Automatic dependent surveillance-broadcast (ADS-B) data indicated that the airplane arrived 0.1 mile from the runway threshold at 149 ft above ground level (agl) and 110 knots of ground speed, which was 32 knots faster than the short field landing approach speed listed in the pilot operating handbook. A witness in the air traffic control tower (the ground controller) stated that the airplane “bled off a lot of airspeed,” during the landing attempt and climbed out in a very flat profile. The tower local controller stated that after liftoff, the airplane’s right wing dropped and the airplane appeared to be turning right into conflicting landing traffic, so he twice instructed the airplane to “left turn out immediately.” The pilot stated that he attempted to comply with the tower controller’s instruction, but when he applied left aileron, the airplane appeared to stall, rolled rapidly right, and descended in a right-wing-low attitude. It subsequently impacted the surface between runways. A postimpact fire ensued, and the pilot helped the passengers egress. The airplane was destroyed by postimpact fire. Given the evidence, it is likely that the pilot decided to land on the short runway to expedite the arrival and did not perform an appropriate short field landing approach, which resulted in excessive airspeed and altitude over the runway threshold, a long landing flare, rapid deceleration, and a self-initiated go-around from a slow airspeed. Had the pilot initiated the go-around as he approached the runway with indications of an unstable visual approach, the airspeed would have been well above stall speed, which would have allowed for the desired positive climb out on runway heading. The pilot likely attempted to comply with the tower local controller’s urgent commands to turn while the airplane was near the limit of performance (the temperature was about 25 degrees warmer than average, which would have resulted in a higher density altitude than the pilot was accustomed to and degraded aircraft and engine performance). The pilot’s maneuvering resulted in the exceedance of the critical angle-of-attack of the high wing (right wing) during the left turn, and an aerodynamic stall.", "probable_cause": "The pilot’s failure to maintain adequate airspeed while maneuvering during an attempted go around, which resulted in an exceedance of the airplane's critical angle of attack and an aerodynamic stall at low altitude. Contributing to the accident, was the pilot’s decision to perform an approach to a short runway at an excessive airspeed and his late decision to perform a go-around, which resulted in a slow climb at a reduced safe margin above stall airspeed."}