{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-squaw-lake-5-killed", "date": "Sep 4, 1979", "type": "De Havilland DHC-3 Otter", "operator": "Labrador%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Schefferville - Squaw Lake", "msn": "194", "yom": 1957, "flight_number": null, "city": "Squaw Lake", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft had deployed to Schefferville to support the annual caribou hunt with a second aircraft, a Cessna 180 registered C-FHWR. Both aircraft were equipped with floats and were on converging courses towards the same seaplane base at Squaw Lake. The Cessna overtook and passed the Otter on the right and then crossed in front to establish a right hand circuit to the lake. The pilot of the Cessna had transmitted his landing intentions, which were interpreted by the Otter pilot to mean a bay in front of the company's base. Consequently, as the Cessna proceeded out of view to the left, the Otter pilot concentrated on his own approach to the lake. The Cessna however had turned to the right and was also making an approach to the same landing area - the two aircraft were again on converging courses. Some four to five seconds after the Cessna had landed, the left float of the Otter struck the Cessna's right wing and cowling. The Otter continued another 200 feet before touching down and as it did it overturned and sank because the left float and strut collapsed. Five of the eight people aboard the Otter perished in the crash. The right wing and cowling of the Cessna were damaged, but the aircraft stayed afloat with no injuries to pilot or passengers. While on final approach, the pilot of the Cessna saw the Otter to the right and slightly behind him and assumed it was on an approach parallel to him. The pilot of the Otter did not see the Cessna at any time during the approach.\r\n(Courtesy of Karl E. Hayes).", "probable_cause": "Pilot error. "}