{"url": "https://www.baaa-acro.com/crash/crash-short-s25-sunderland-abu-qir-3-killed", "date": "Sep 30, 1942 at 0620 LT", "type": "Short S.25 Sunderland", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Abu Qir - Abu Qir", "msn": null, "yom": null, "flight_number": null, "city": "Abukir (Abū Qīr)", "zone": "Alexandria", "country": "Egypt", "region": "Africa", "crew_on_board": 12, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The seaplane left Abu Qir seaplane base at 0545LT on a maritime patrol flight. After 35 minutes into the flight, the engine number one failed. The captain decided to stall the aircraft that broke its back while hitting the water surface. Three crew members were killed while all nine others were rescued. The aircraft was lost.\nCrew (230th Squadron):\nF/O R. J. Murphy, pilot,\nP/O R. C. Scott, pilot,\nF/O T. W. Sanderson, pilot,\nP/O A. H. Matthews, navigator,\nF/Sgt J. Harkins, wireless operator and air gunner,\nSgt K. J. Carlsson, wireless operator and air gunner, †\nSgt J. Adam, wireless operator and air gunner, †\nSgt J. Groleau, wireless operator and air gunner,\nSgt G. Lindsay, wireless operator and air gunner, †\nSgt D. Hall, flight engineer, \nLAC D. McLean, fitter, \nLAC N. Kelly, rigger.\nSource by Alan Storr: \nhttp://static.awm.gov.au/images/collection/pdf/RC09125_007--1-.pdf", "probable_cause": "The aircraft was forced to return from patrol owing to failure of the port outer engine. There was no indication from any member of the crew including the fitter that any other engine appeared to be giving trouble. When the Captain thought the port engine was failing he should have immediately checked his engine instrument readings. Although he approach appears to have been normal, the Captain did in fact make an error as he did not allow for the facts that there was a flat calm or that he was making an approach off a flare path. Finally the pilot made the fatal mistake of attempting to look at the water. Such an act especially on a glassy sea is nearly always disastrous. The accident appears to have been brought about by the fact that the pilot attempted to land when a landing was unnecessary, and he made an error in his landing in that he appears to have used insufficient engine to flatten his approach. He also attempted to carry out a landing on a glassy sea at night by looking at the water. The Group Commander in his remarks stated ; “ I consider this accident was primarily due to the fact that there had been a fatal accident in the Squadron a few days previously due to an engine catching fire in the air and the resulting smoke filled the cockpit, making it impossible for the pilot to make a safe landing. In this case, the pilot after flying for 35 minutes on thee engines, states that he suddenly noticed a bright glow and small burst of flame on another engine and decided to land immediately, in so doing he stalled the aircraft which broke its back on hitting the water. I consider the pilot, FO Murphy, made a wrong decision in deciding to land and was guilty of an error of judgement in making the actual landing. AVM Slatter 201 Group” ."}