{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-85c-manila", "date": "Aug 16, 2018 at 2355 LT", "type": "Boeing 737-800", "operator": "Xiamen%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Xiamen – Manila", "msn": "37574/3160", "yom": 2010, "flight_number": "MF8667", "city": "Manila-Ninoy Aquino", "zone": "Metro Manila", "country": "Philippines", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 157, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On August 16, 2018, about 1555UTC/2355H local time, a Boeing 737-800 type of aircraft with Registry No. B-5498 operating as flight CXA 8667 sustained substantial damage following a runway excursion after second approach while landing on Runway 24 of Ninoy Aquino International Airport (NAIA), Manila, Philippines. The flight was a scheduled commercial passenger from Xiamen, China and operated by Xiamen Airlines. The one hundred fifty-seven (157) passengers and two (2) pilots together with the five (5) cabin crew and one air security officer did not sustain any injuries while the aircraft was substantially damaged. An instrument flight rules flight plan was filed. Instrument Meteorological Conditions (IMC) prevailed at the time of the accident. During the first approach, the Captain who was the pilot flying aborted the landing at 30 feet Radio Altitude (RA) due to insufficient visual reference. A second approach was considered and carried out after briefing the First Officer (FO) of the possibility of another aborted landing should the flight encounter similar conditions. The briefing included a diversion to their planned alternate airfield. The flight was “stabilized” on the second approach with flaps set at 30 degrees landing position, all landing gears extended and speed brake lever appropriately set in the ARM position. On passing 1,002 feet Radio Altitude (RA), the autopilot was disengaged; followed by the disengagement of the auto-throttle, three (3) seconds later. The ILS localizer lateral path and Glide slope vertical path were accurately tracked and no deviations were recorded. The “reference” landing speed for flaps 30 for the expected aircraft gross weight at the time of landing was 145 knots and a target speed of 150 knots was set on the Mode Control Panel (MCP). The vertical descent rate recorded during the approach was commensurate with the recommended descent rate for the profile angle and ground speed; and was maintained throughout the approach passing through the Decision Altitude (DA) of 375 feet down to 50 feet radio altitude (RA). As the aircraft passed over the threshold, the localizer deviation was established around zero dot but indicated the airplane began to drift to the left of the centerline followed by the First Officer (FO) making a call out of “Go-Around” but was answered by the Captain “No”. The throttle levers for both engines were started to be reduced to idle position at 30 feet RA and became fully idle while passing five (5) feet RA. At this point, the aircraft was in de-crab position prior to flare. At 13 feet RA, the aircraft was rolling left and continuously drifting left of the runway center line. At 10 feet RA another call for go-around was made by the FO but was again answered by the Captain with “No” and “It’s Okay”. At this point, computed airspeed was approximately 6 knots above MCP selected speed and RA was approaching zero feet. Just prior to touchdown, computed airspeed decreased by 4 knots and the airplane touched down at 151 knots (VREF+6). The wind was recorded at 274.7 degrees at 8.5 knots. Data from the aircraft’s flight data recorder showed that the aircraft touched down almost on both main gears, to the left of the runway centerline, about 741 meters from the threshold of runway 24. Deployment of the speed brakes was recorded and auto brakes engagement was also recorded. The auto brakes subsequently disengaged but the cause was undetermined. Upon touchdown, the aircraft continued on its left-wards trajectory while the aircraft heading was held almost constant at 241 degrees. After the aircraft departed the left edge of the runway, all landing gears collided with several concrete electric junction boxes that were erected parallel outside the confines of the runway pavement. The aircraft was travelling at about 147 knots as it exited the paved surface of the runway and came to rest at approximately 1,500 meters from the threshold of Runway 24, with a geographical position of 14°30’23.7” N; 121°0’59.1” E and a heading of 120 degrees. Throughout the above sequence of events from touchdown until the aircraft came to a full stop, the CVR recorded 2 more calls of “GO-AROUND” made by the FO. Throughout the landing sequence, the thrust reversers for both engines were not deployed. Throttle Lever Position (TLP) were recorded and there was no evidence of reverse thrust being selected or deployment of reversers. After the aircraft came to a complete stop, the pilots carried out all memory items and the refence items in the evacuation non-normal checklist, which includes extending the flaps to a 40 degrees position. The aircraft suffered total loss of communication and a failure in passenger address system possibly due to the damage caused by the nose gear collapsing rearwards and damaging the equipment in the E/E compartment or the E-buss wires connecting the Very High Frequency (VHF) 1 radio directly to the battery was broken. The Captain then directed the FO to go out of the cockpit to announce the emergency evacuation. The cabin crew started the evacuation of the passengers utilizing the emergency slides of the left and right forward doors. There were no reported injuries sustained by the passengers, cabin crew, flight crew or the security officer.", "probable_cause": "Primary causal factors:\r\na. The decision of the Captain to continue the landing on un-stabilized approach and insufficient visual reference.\r\n- The Captain failed to maintain a stabilized landing approach moments before touchdown, the aircraft was rolling left and continuously drifting left of the runway centerline.\r\n- The Captain failed to identify correctly the aircraft position and status due to insufficient visual reference caused by precipitation.\r\nb. The Captain failed to apply sound CRM practices.\r\n- The Captain did not heed to the First Officer call for a Go-Around.\r\nContributory factors:\r\na. Failure to apply appropriate TEM strategies. Failure of the Flight Crew to discuss and apply appropriate Threat and Error Management (TEM) strategies for the following:\r\n- Inclement weather.\r\n- Cross wind conditions during approach to land.\r\n- Possibility of low-level wind shear.\r\n- NOTAM information on unserviceable runway lights.\r\nb. Inadequate Company Policy on Go-Around:\r\n- Company’s Standard Operation Procedures were less than adequate in terms of providing guidance to the flight crew for call out of \"Go-Around\" during landing phase of the flight.\r\nc. Runway strip inconsistent with CAAP MOS for Aerodrome and ICAO Annex 14:\r\n- The uneven surface and concrete obstacles contributed to the damage sustained by the aircraft."}