{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-580-hirtshals-55-killed", "date": "Sep 8, 1989 at 1638 LT", "type": "Convair CV-580", "operator": "Partnair", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Oslo - Hamburg", "msn": "56", "yom": 1960, "flight_number": "PD394", "city": "Hirtshals", "zone": "Nordjylland", "country": "Denmark", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 50, "pax_fatalities": 50, "other_fatalities": 0, "total_fatalities": 55, "captain_hours": 16779, "captain_hours_type": 1200, "copilot_hours": 16731, "copilot_hours_type": 675, "aircraft_hours": 36943, "circumstances": "On September 8, 1989, LN-PAA was on a charter flight to Hamburg. The flight was due to depart at 1500 hrs. The call sign was Partnair (PAR) 394. The departure was delayed by almost an hour due to the Civil Aviation Administration, Norway (CAA/N) and the catering company having suspended PAS' credit. Once the financial problem was settled the crew was given permission to depart. During the period September 6-8, 1989 LN-PAA experienced some technical problems with the left AC power system. The AC generator was replaced, but the malfunction in the system remained. On the flight to Hamburg it was decided to use the APU generator as the electrical power source for the left AC system. LN-PAA took off at 1559:50 hrs. The flight proceeded normally to the planned cruise level, which was FL220. At 1604 hrs PAR 394 was cleared direct to AAL VOR/DME (Aalborg). When the aircraft climbed through FL 180 at 1616 hrs, the crew was informed by Oslo ACC about strong westerly winds at altitude. The air traffic controller suggested a 100 heading change to the right. At 1622 hrs PAR 394 was informed that the radar service from Oslo Ace terminated and that the flight would enter Danish-controlled air space in 2 minutes. PAR 394 was then requested to contact Copenhagen ACC. According to the aircraft's Flight Data Recorder (FOR), LNPAA reached its cruising level at 1623 hrs. Half a minute later the crew established contact with Copenhagen ACC and informed them that PAR 394 was maintaining FL220, whereupon Copenhagen ACC confirmed that they had radar contact. This was the last radio contact anyone had with PAR 394. The next control point was AAL VOR/DME. Apparently, the flight proceeded normally until the air traffic controller at Copenhagen ACC observed that the radar signals from PAR 394 showed an unexpected right turn and then disappeared from the radar scope. At 1640 hrs the air traffic controller tried to contact PAR 394, but there was no reply. He tried again several times. At 1642 hrs the ATS in both Denmark and Norway initiated an investigation to locate the aircraft. At 1659 hrs it was decided to inform the rescue authorities in Norway and Denmark. It turned out that a serious accident had occurred. None of the 55 persons on board survived.", "probable_cause": "The accident was caused by loss of control due to the destruction of primary control surfaces in the tail section, which, in turn, was caused by aeroelastic oscillations initiated by abnormal clearances in the vertical stabiliser attachments to the fuselage structure. The condition of the attachments was a result of excessive wear in pins and sleeves used in this structural joint. The pins and sleeves were of an inferior quality and did not satisfy specified values for hardness and tensile strength. They had also been installed and inspected using sub-standard maintenance procedures. Undamped oscillations in the elevator contributed to the structural failure of the empennage."}