{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-orleans", "date": "Aug 10, 2020 at 1355 LT", "type": "Cessna 340", "operator": "Prive", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Perpignan – Orléans", "msn": "340A-0746", "yom": 1979, "flight_number": null, "city": "Orléans-Loiret (Saint-Denis-de-l'Hôtel)", "zone": "Loiret", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2635, "captain_hours_type": 41, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Then twin engine airplane departed Perpignan-La Llabanère Airport on a private flight to Orléans, carrying one passenger and one pilot. On final approach to Orléans-Loiret Airport (ex Saint-Denis-de-l’Hôtel), the pilot encountered a loss of power on the left engine. He attempted an emergency landing when the airplane impacted trees and crash landed in a wooded area located about 3 km short of runway 23, bursting into flames. Both occupants escaped uninjured while the airplane was totally destroyed by a post crash fire.  ", "probable_cause": "The exact cause of the loss of power on the left engine could not be determined. The pilot, concentrating on monitoring the approach parameters, did not immediately realize the left engine malfunction. He noticed that the aircraft's rate of descent was too high to follow the standard approach slope. The pilot first attempted to go around and reconfigured the aircraft to do so by retracting the landing gear and flaps. In spite of these actions, the pilot noticed that the power delivered by the aircraft's engines did not allow him to recover the plane and understood, by being aware of the action of his right foot on the rudder pedal, that the power delivered by the left engine was abnormally low. Given the low height of the plane at the time of this observation, the pilot decided to land in the country. Contributing to the high rate of descent after the occurrence of the left engine malfunction was the fact that the drags were extended at the time the engine power decreased and the fact that the left propeller probably windmilling until the landing."}