{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-hawthorne", "date": "Sep 29, 2002 at 0913 LT", "type": "Swearingen SA227 Metro III", "operator": "Skylink Charter", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hawthorne – Grand Canyon", "msn": "AC554", "yom": 1983, "flight_number": null, "city": "Hawthorne", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 19, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2858, "captain_hours_type": 2212, "copilot_hours": 4462, "copilot_hours_type": 612, "aircraft_hours": 30660, "circumstances": "The airplane veered off the runway during a rejected takeoff, overran an airport sign, and impacted a hangar. The captain stated that during the after start checklist he moved the power levers to disengage the start locks on the propellers. Post accident examination found that the left propeller was still in the start lock position, while the right propeller was in the normal operating range. The captain was the pilot flying (PF) and the second-in-command (SIC) was the non flying pilot (NFP). After receiving their clearance, the PF taxied onto the runway and initiated the takeoff sequence. The SIC did not set and monitor the engine power during takeoff, as required by the company procedures. During the takeoff acceleration when the speed was between 40 and 60 knots, the captain released the nose gear steering control switch as the rudder became aerodynamically effective. When the switch was released, the airplane began immediately veering left due to the asymmetrical thrust between the left and right engine propellers. The PIC did not advise the SIC that he had lost directional control and was aborting the takeoff, as required by company procedures. The distance between where the PIC reported that he began the takeoff roll and where the first tire marks became apparent was about 630 feet, and the distance between where the marks first became apparent and where the airplane's left main landing gear tire marks exited the left side of the runway was about 220 feet. Thereafter, marks (depressions in the dirt) were noted for a 108-foot-long distance in the field located adjacent to the runway. Medium intensity tire tread marks were apparent on the parallel taxiway and the adjacent vehicle service road. These tread marks, over a 332-foot-long distance, led directly to progressively more pronounced marks and rubber transfer, and to the accident airplane's landing gear tires. Based on an examination of tire tracks and skid marks, the PIC did not reject the takeoff until the airplane approached the runway's edge, and was continuing its divergent track away from the runway's centerline. The airplane rolled on the runway through the dirt median and across a taxiway for 850 feet prior to the PIC applying moderate brakes, and evidence of heavier brake application was apparent only a few hundred feet from the impacted hangar. No evidence of preimpact mechanical failures or malfunctions was found with the propeller assemblies, nose wheel steering mechanism, or brakes.", "probable_cause": "The pilot-in-command's failure to maintain directional control during the rejected takeoff. The loss of directional control was caused by the crew's failure to follow prescribed pre takeoff and takeoff checklist procedures to ensure the both propellers were out of the start locks. Contributing factors were the failure of the crew to follow normal company procedures during takeoff, the failure of the flightcrew to recognize an abnormal propeller condition during takeoff, and a lack of crew coordination in performing a rejected takeoff. "}