{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-325-navajo-cr-tuscaloosa-6-killed", "date": "Aug 14, 2016 at 1115 LT", "type": "Piper PA-31-310 Navajo", "operator": "Oxford University Aircraft Charters", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Kissimmee – Oxford", "msn": "31-8312016", "yom": 1983, "flight_number": null, "city": "Tuscaloosa", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 749, "captain_hours_type": 48, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3447, "circumstances": "The private pilot and five passengers departed on a day instrument flight rules cross-country flight in the multiengine airplane. Before departure, the airplane was serviced to capacity with fuel, which corresponded to an endurance of about 5 hours. About 1 hour 45 minutes after reaching the flight's cruise altitude of 12,000 ft mean sea level, the pilot reported a failure of the right engine fuel pump and requested to divert to the nearest airport. About 7 minutes later, the pilot reported that he \"lost both fuel pumps\" and stated that the airplane had no engine power. The pilot continued toward the diversion airport and the airplane descended until it impacted trees about 1,650 ft short of the approach end of the runway; a postimpact fire ensued. Postaccident examination of the airframe and engines revealed no preimpact failures or malfunctions that would have precluded normal operation. The propellers of both engines were found in the unfeathered position. All six of the fuel pumps on the airplane were functionally tested or disassembled, and none exhibited any anomalies that would have precluded normal operation before the accident. Corrosion was noted in the right fuel boost pump, which was likely the result of water contamination during firefighting efforts by first responders. The airplane was equipped with 4 fuel tanks, comprising an outboard and an inboard fuel tank in each wing. The left and right engine fuel selector valves and corresponding fuel selector handles were found in the outboard tank positions. Given the airplane's fuel state upon departure and review of fuel consumption notes in the flight log from the day of the accident, the airplane's outboard tanks contained sufficient fuel for about 1 hour 45 minutes of flight, which corresponds to when the pilot first reported a fuel pump anomaly to air traffic control. The data downloaded from the engine data monitor was consistent with both engines losing fuel pressure due to fuel starvation. According to the pilot's operating handbook, after reaching cruise flight, fuel should be consumed from the outboard tanks before switching to the inboard tanks. Two fuel quantity gauges were located in the cockpit overhead switch panel to help identify when the pilot should return the fuel selectors from the outboard fuel tanks to the inboard fuel  tanks. A flight instructor who previously flew with the pilot stated that this was their normal practice. He also stated that the pilot had not received any training in the accident airplane to include single engine operations and emergency procedures. It is likely that the pilot failed to return the fuel selectors from the outboard to the inboard tank positions once the outboard tanks were exhausted of fuel; however, the pilot misdiagnosed the situation as a fuel pump anomaly.", "probable_cause": "A total loss of power in both engines due to fuel starvation as a result of the pilot's fuel mismanagement, and his subsequent failure to follow the emergency checklist. Contributing to the pilot's failure to follow the emergency checklist was his lack of emergency procedures training in the accident airplane."}