{"url": "https://www.baaa-acro.com/crash/crash-rockwell-690b-turbo-commander-butternut-lake-3-killed", "date": "Sep 28, 2021 at 0900 LT", "type": "Rockwell Grand Commander 690", "operator": "Surdex%20Corporation_1", "flight_phase": "Flight", "flight_type": "Geographical / Geophysical / Scientific", "survivors": "No", "site": "Plain, Valley", "schedule": "Rhinelander - Rhinelander", "msn": "690-11475", "yom": 1978, "flight_number": null, "city": "Butternut Lake", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On September 28, 2021, about 0900 central daylight time, a Rockwell International 690B airplane, N690LS, was destroyed when it was involved in an accident near Hiles, Wisconsin. The pilot and two passengers sustained fatal injuries. The airplane was operated as a Title 14 Code of Federal Regulations Part 91 aerial imagery survey flight. According to the operator, the flight mission was to obtain aerial imagery of the forest vegetation for the Wisconsin Department of Natural Resources. Preliminary automatic dependent surveillance-broadcast information (ADS-B) revealed the airplane departed the Rhinelander-Oneida County Airport, Rhinelander, Wisconsin, about 0850. About 0858, the airplane began to level off about 15,600 ft with a maximum groundspeed of 209 knots (kts). Between 0858 and 0900, the airplane continued level flight; however, the groundspeed decreased to about 93 kts. The ADS-B data ended at 0900:56. According to air traffic control, a “mayday, mayday, mayday…we’re in a spin” transmission was broadcast. The airplane was not under air traffic control during the flight or at the time of the accident. A witness, located about one mile from the accident site, reported he heard a “loud, strange sounding airplane.” He looked up and noticed an airplane “nose down at high rate of speed spinning about its longitudinal axis at about 30 to 60 rpm.” The witness lost sight of the airplane behind some trees and then heard an impact. The airplane wreckage was located during an aerial and ground search in wetlands and wooded terrain about 10 miles east of Eagle River, Wisconsin, and 1 mile west of Butternut Lake, in the Chequamegon-Nicolet National Forest. The wreckage was distributed in a diameter of about 50 yards. A majority of the main wreckage was found beneath the water surface with some debris located in the trees.", "probable_cause": null}