{"url": "https://www.baaa-acro.com/crash/ground-fire-transall-c-160-fort-de-france", "date": "May 6, 2004 at 1358 LT", "type": "Transall C-160", "operator": "Armee-de-lAir-2", "flight_phase": "Taxiing", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort-de-France - Fort-de-France", "msn": "F100", "yom": 1970, "flight_number": null, "city": "Fort-de-France", "zone": "Martinique", "country": "Martinique", "region": "Central America", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4306, "captain_hours_type": null, "copilot_hours": 2564, "copilot_hours_type": null, "aircraft_hours": 18530, "circumstances": "The aircraft was engaged in a local post maintenance test flight at Fort-de-France-Le Lamentin Airport, carrying five technicians and three crew members on behalf of the Escadron de Transport Outremer 58. After engine startup, the crew started to taxi when a fire erupted. The aircraft was stopped on the ramp and all eight occupants escaped uninjured. Within three minutes, fire bombers were on site and extinguished the fire. Nevertheless, the aircraft was damaged beyond repair. ", "probable_cause": "The accident was caused by electrical arcing at the power cable to a submersible fuel pump. This arcing occurred above the kerosene liquid inside the tank full of fuel vapors. The cable type used was chosen at the time of the design of the aircraft. Atmospheric conditions on the apron of Fort de France have raised the temperature of the reservoir beyond the flash point kerosene. The vapors contained in this tank were explosive, and the arc was enough to initiate the blast. As such, atmospheric conditions are a certain cause of environmental origin of the accident. The appearance of the arc is, in turn, has only technical causes:\r\n- The quality of cable used and age are in fact responsible for the creation of the electric arc.\r\n- The formation of the insulating sheath of this type of cable is not likely to ensure an absolute seal. This quality is also not claimed by its manufacturer.\r\nIndeed, the analysis carried out show a porosity of electrical cable, even nine, therefore that it is soaked in kerosene. The presence of kerosene increases the phenomenon of porosity of old cables. Degradation characteristics of dielectric strength of the cable insulation explains the appearance of the arc. The accident occurred while the cable was over 19 years old. The fuel pumps wiring has never been a problem. But there has not been a cable that had reached the age of 19 years. The aging of the cable could still degrade the seal. Finally, maintaining this type of cable on the first C160 series until this accident was part of a complex process in which traceability has not been formally established. Doubts indeed appeared in 1969 on the quality of these cables, doubts that can be considered today as precursors. Measures had been adopted precisely to overcome these deficiencies. In this regard, the replacement of the fuel pump wiring of the second series C 160 of these cables with a newer type and considered more efficient is particularly significant. Its extension to the first series aircraft might have seemed relevant, and would probably have prevented the accident. The reasons which led to the maintenance of such cables on the C 160 series first held in both the human factor (underestimation of risk, lack of global view on the issue) and organizational factors, which can be seen as a lack of traceability of technical and logistic actions, a lack of consistency of the measures adopted, and probable deficiencies in the information flow."}