{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh106-comet-1-elbe-island-35-killed", "date": "Jan 10, 1954 at 1105 LT", "type": "De Havilland DH.106 Comet", "operator": "BOAC-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Singapore – Beirut – Rome – London", "msn": "6003", "yom": 1951, "flight_number": "BA781", "city": "Elbe Island", "zone": "Tuscany", "country": "Italy", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 29, "pax_fatalities": 29, "other_fatalities": 0, "total_fatalities": 35, "captain_hours": 6566, "captain_hours_type": 291, "copilot_hours": 4915, "copilot_hours_type": 262, "aircraft_hours": 3681, "circumstances": "About twenty minutes after its takeoff from Rome-Ciampino Airport, while cruising at an altitude of 27,000 feet between the islands of Elbe and Montecristo, the airplane suffered a brutal decompression, disappeared from radar screens and crashed into the Tyrrhenian Sea. Some debris were found floating about 16 km south of Elbe Island and the main wreckage sank by a depth of 600 meters. All 35 occupants were killed. About 70% of the debris were recovered and the airplane was rebuilt in UK for investigations. As there were suspicions of technical issues, BOAC, Air France and SAA decided to suspend all Comet flights. After fifty modifications and improvements, the airplane started to fly again two months later. It was eventually discovered that the airplane suffered a structural failure and exploded in flight. ", "probable_cause": "It was the opinion of the Board that the accident was caused by structural failure of the pressure cabin, brought about by fatigue. Investigators reach this opinion for the following reasons:\r\n- The low fatigue resistance of the cabin has been demonstrated by the test described in Part 3, and the test result is interpretable as meaning that there was, at the age of the Elba aeroplanes a definite risk of fatigue failure occurring,\r\n- The cabin was the first part of the aeroplane to fail in the Elba accident,\r\n- The wreckage indicates that the failure in the cabin was of the same basic type as that produced in the fatigue test,\r\n- This explanation seems to us to be consistent with all the circumstantial evidence,\r\n- The only other defects found in the aeroplane were not concerned at Elba, as demonstrated by the wreckage."}