{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-300-super-king-air-near-donaueschingen-4-killed", "date": "Oct 24, 2000 at 1716 LT", "type": "Beechcraft 300 Super King Air", "operator": "Flight Inspection International", "flight_phase": "Landing (descent or approach)", "flight_type": "Calibration", "survivors": "No", "site": "Mountains", "schedule": "Donaueschingen - Donaueschingen", "msn": "FA-104", "yom": 1986, "flight_number": null, "city": "Donaueschingen-Villingen", "zone": "Baden-Württemberg", "country": "Germany", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft departed Donaueschingen-Villingen Airport in the afternoon on a local calibration mission. After several circuits over the area at an altitude of 7,000 feet, both NDB and DME systems have been calibrated and the crew was returning to the airport at the end of the afternoon. While approaching runway 36 in marginal weather conditions, the crew failed to realize his altitude was insufficient when the aircraft struck trees and crashed in a wooded area located about 15 km from the airport. The aircraft was destroyed and all four occupants were killed. According to published procedures, the crew was supposed to continue the approach at a minimum altitude of 4,500 feet until 11 km from the runway threshold then descending to 2,650 feet. For unknown reasons, the crew started the descent prematurely, causing the aircraft to impact terrain.", "probable_cause": "Controlled flight into terrain after the crew descended too low under VFR mode in IMC conditions. The following contributing factors were identified:\r\n- The crew canceled the IFR flight plan for an approach under VFR mode despite weather conditions were marginal and the visibility was insufficient, \r\n- The crew failed to follow the approach checklist, \r\n- The crew failed to complete an approach briefing,\r\n- The crew did not proceed to any callouts on approach, \r\n- The second pilot was procedurally not involved in cockpit work processes and decision-making,\r\n- On approach, the crew referred to the Flight Management System (FMS type III series) which was initially dedicated to flight inspection purposes only,\r\n- Measurement was performed by the flight engineer."}