{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-yellowknife-2-killed", "date": "Sep 22, 2011 at 1318 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Arctic%20Sunwest%20Charters.jpf", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "City", "schedule": "Thor Lake - Yellowknife", "msn": "367", "yom": 1973, "flight_number": null, "city": "Yellowknife", "zone": "Northwest Territories", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5817, "captain_hours_type": 1037, "copilot_hours": 570, "copilot_hours_type": 323, "aircraft_hours": 33355, "circumstances": "The float-equipped de Havilland DHC-6-300 Twin Otter (registration C-GARW, serial number 367) was landing at the float-plane base (CEN9) located in Yellowknife, Northwest Territories, along the western shore of Great Slave Lake, beside the area known as Old Town. There were 2 crew members and 7 passengers on board, and the first officer was the pilot flying. On touchdown, the aircraft bounced, porpoised and landed hard on the right float. The flight crew initiated a go-around; the aircraft lifted off at low speed in a nose-high, right-wing-low attitude, and it continued in a right turn towards the shore. As the turn continued, the aircraft’s right wing contacted power lines and cables before the float bottoms impacted the side of an office building. The aircraft then dropped to the ground on its nose and cart-wheeled into an adjacent parking lot. Both crew members were fatally injured, 4 passengers were seriously injured, and 3 passengers sustained minor injuries. The aircraft was substantially damaged. The 406-megahertz emergency locator transmitter activated. There was no fire. The accident occurred at 1318 Mountain Daylight Time. \n", "probable_cause": "Findings as to Causes and Contributing Factors:  \r\n1. Airspeed fluctuations at touchdown, coupled with gusty wind conditions, caused a bounced landing.  \r\n2. Improper go-around techniques during the recovery from the bounced landing resulted in a loss of control.  \r\n3. It is possible that confused crew coordination during the attempted go-around contributed to the loss of control. "}