{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-500rf-kinston", "date": "Mar 8, 2003 at 1027 LT", "type": "Fokker F27 Friendship", "operator": "FedEx", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Greensboro - New Bern", "msn": "10613", "yom": 1981, "flight_number": null, "city": "Kinston-Stallings Field", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8130, "captain_hours_type": 1450, "copilot_hours": 2911, "copilot_hours_type": 955, "aircraft_hours": 26665, "circumstances": "According to the pilot, an unsafe right gear indication was received during the approach, and the control tower controller confirmed the right gear was not fully extended. On landing roll the right main landing gear collapsed and the airplane slid off of the runway. Examination of the right main landing gear revealed the drag brace was fractured. The fracture was located at the lower side of a transition from a smaller internal diameter on the upper piece to a larger internal diameter on the lower piece. The region of the fracture surface was flat and perpendicular to the tube longitudinal axis. The region had a smooth, curving boundary, also consistent with fatigue. The fatigue features emanated from multiple origins at the inner surface of the tube. The Federal Aviation Administration (FAA) issued an Airworthiness Directive (AD) requiring an inspections of main landing gear drag stay units. The AD was prompted by the fracture of a drag stay tube from fatigue cracking that initiated from an improperly machined transition radius at the inner surface of the tube. According to Fokker ,the Fokker F27 Mark 500 airplanes (such as the incident airplane) were not equipped with drag stay units having part number 200261001, 200485001, or 200684001. One tube, part number 200259300, had a change in internal diameter (stepped bore), and the other tube, part number 200485300, had a straight internal bore. AD 97-04-08 required an ultrasonic inspection to determine if the installed tube had a straight or stepped bore. A review of maintenance records revealed that the failed drag stay tube had accumulated 28, 285 total cycles.", "probable_cause": "The fatigue failure of the main drag stay tube. A factor is no inspection procedure required."}