{"url": "https://www.baaa-acro.com/crash/crash-learjet-23a-windsor-locks-3-killed", "date": "Jun 4, 1984 at 2341 LT", "type": "Learjet 23", "operator": "Air Continental", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cleveland – Syracuse – Windsor Locks", "msn": "23-085", "yom": 1966, "flight_number": "Night Air 4", "city": "Windsor Locks-Bradley", "zone": "Connecticut", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 11039, "captain_hours_type": 1130, "copilot_hours": 5263, "copilot_hours_type": 189, "aircraft_hours": 8393, "circumstances": "On June 4, 1984, an unmodified Gates Learjet 23A, N101PP, was being operated by Air Continental, Inc., Elyria, Ohio, on a regularly scheduled cargo flight transporting cancelled bank checks under 14 CFR 135. The flight departed Cleveland-Hopkins International Airport, Ohio, as Night Air 4 at 2200 eastern daylight time. After an uneventful flight, Night Air 4 arrived at Syracuse-Hancock International Airport, New York, at 2245. There was routine ground cargo handling at Syracuse; the airplane was not refueled. Night Air 4 departed Syracuse at 2311, was cleared to climb to 17,000 feet, and was handed off to Boston Air Route Traffic Control Center (Boston Center) at 2314. Boston Center cleared Night Air 4 to its requested altitude of FL290 and the en route portion of the flight was uneventful. At 2332, Night Air 4 was handed off at 16,000 feet during its descent to Bradley International Airport, Windsor Locks, Connecticut Approach Control. Approach control identified the airplane, cleared it for a visual approach to runway 33, and at 2336 gave Night Air 4 a turn to position the airplane on final approach at 10 miles from the airport. At 2338:22, Night Air 4 reported that the airplane was on final approach for runway 33, and at 2338:25 the air traffic control tower operator cleared the flight to land. At 2341:18, the control tower operator reported to approach control that there had been an accident at the airport. Fifteen witnesses, who either heard and/or saw the accident, were interviewed, and with the exception of a few minor points, all of the witnesses described basically the same accident sequence. The airplane was on a normal approach to runway 33 with no apparent abnormalities. When the airplane was about 200 feet over the approach lights, an increase in engine thrust was heard and the airplane halted its rate of descent in what two pilot witnesses thought was an apparent attempt to go-around. Immediately afterward, Night Air 4 began what appeared to be a level turn to the right. As the airplane went through about 90° of turn, the wings of the aircraft were nearly vertical to the ground. The airplane's nose dropped below the horizon and the airplane descended into the ground in a nose low attitude. The witnesses stated that they saw an explosion which was followed by intense ground fire. None of the witnesses reported any significant lateral or vertical changes while the aircraft was on short final or during the 90' right turn prior to its descent into the ground. Many witnesses stated that they saw some lights illuminated on the aircraft but none reported seeing the landing lights, located on the landing gear, or the landing gear in the extended position. Witnesses reported no inflight fire, smoke, or airframe separation before the crash. All three occupants were killed. \r\nCrew:\r\nCharles Huffman, pilot,\r\nRonald Dulay, copilot.\r\nPassenger:\r\nEldridge Sheetz.", "probable_cause": "An uncommanded roll to the right which caused the airplane to roll about 90°and descend into the ground. The cause of the uncommanded roll was an asymmetric retraction of the flight spoilers wherein the left spoiler retracted and the right spoiler did not. The Safety Board could not determine the reason for the right spoiler malfunction."}