{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-227-near-arlington-4-killed", "date": "Oct 19, 1959 at 1620 LT", "type": "Boeing 707", "operator": "Boeing", "flight_phase": "Flight", "flight_type": "Test", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Seattle - Seattle", "msn": "17691", "yom": 1959, "flight_number": null, "city": "Arlington", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 8, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 5015, "captain_hours_type": 369, "copilot_hours": 23563, "copilot_hours_type": null, "aircraft_hours": 173, "circumstances": "A Boeing Airplane Company test pilot was acting as an instructor-pilot on a demonstration and acceptance flight prior to the aircraft being delivered to the customer. The company was also utilizing this flight time for flight instruction purposes in qualifying airline personnel in the aircraft. The instructor-pilot demonstrated several maneuvers, including Dutch Rolls, to a pilot-trainee, an airline captain who was making his first training flight training flight prior to checkout on the Boeing 707. The instructor-pilot initiated a Dutch Roll in which the roll-park angle of the aircraft reached 40 to 60 degrees. This bank angle is in excess of limitation set by the company for demonstration of his maneuver. The pilot-trainee, who was to make the recovery, rolled full right aileron control while the right rank was still increasing. The instructor-pilot immediately rolled in full opposite aileron. The airplane stopped its right roll at a point well past a vertical bank and then rolled to the left even more violently. Several gyrations followed and after control of the aircraft was regained, it was determined that three of the four engines had separated from the aircraft and it was on fire. The fire rapidly reduced controllability of the aircraft and an emergency landing was attempted, however, the aircraft struck trees and crashed short of the intended landing area because power on the engine remaining had to be shut down to keep the aircraft wings level. The aircraft was destroyed and four crew members were killed while four others were injured. ", "probable_cause": "The Board determines that the probable cause of this accident was the structural failures induced during an improper recovery attempt from a Dutch Roll which exceeded the angle-of-bank limits prescribed by the company."}