{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b60-duke-gainesville-3-killed", "date": "Apr 16, 2006 at 1153 LT", "type": "Beechcraft 60 Duke", "operator": "Ocem Avionics", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Gainesville - Gainesville", "msn": "P-447", "yom": 1978, "flight_number": null, "city": "Gainesville", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2901, "circumstances": "The airplane crashed into the terminal building following a loss of control on takeoff initial climb from runway 25. Witnesses reported that shortly after takeoff, the airplane banked sharply to the left, then it seemed to momentarily stabilize and commence a climb before beginning to roll to the left again. The airplane rolled to an inverted position, entered a dive, collided with the airport terminal building and exploded on impact. The entire airplane sustained severe fire and impact damage. Examination of the engines and propellers revealed no evidence of any discrepancies that would preclude normal operation. All the propeller blades displayed signatures indicative of high rotational energy at the time of impact, indicating that both propellers were rotating, not feathered, and the engines were operating at high power at the time of impact. Components of the autopilot system, specifically the pitch servo assembly and a portion of the roll servo assembly, were identified in the wreckage. The portion of the roll servo assembly found remained attached to a piece of skin torn from the airframe and consisted of the mounting bracket for the roll servo with the capstan bolted to the bracket, clearly indicating that this component had been reinstalled and strongly suggesting that the pilot reinstalled/reactivated all of the removed autopilot components the day before the accident. Maintenance personnel started an annual inspection on the airplane the month prior to the accident and found an autopilot installed in the airplane without the proper paperwork. The pilot explained to them that he designed and built the autopilot and was in the process of getting the proper paperwork for the installation of the system in his airplane. During the inspection, a mechanic found the aileron cable rubbing on the autopilot's roll servo capstan so the mechanic removed the roll servo along with the capstan. Additionally, mechanics disabled the autopilot's pitch servo and removed the autopilot control head. They were in the process of completing the inspection when the pilot asked for the airplane stating that he needed it for a trip. The pilot also asked that the airplane be returned to him without the interior installed. Two days before the accident, the airplane was returned to the pilot with the annual inspection incomplete. The autopilot control head, roll servo and capstan were returned to the pilot in a cardboard box on this date. A friend of the pilot reported that the day before the accident, the pilot completed reinstalling the seats and \"other things\" in order to fly the airplane the next day. It is possible that improper installation or malfunction of the autopilot resulted in the loss of control; however, the extent of damage and fragmentation of  the entire airplane wreckage precluded detailed examination of the flight control and autopilot systems and hence a conclusive determination of the reason for the loss of control.", "probable_cause": "The loss of control for an undetermined reason."}