{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-mt-bel-aut-11-killed", "date": "Mar 12, 1949 at 1115 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Leninabad – Samarkand – Stalinabad", "msn": "184 279 07", "yom": 1947, "flight_number": null, "city": "Mt Bel'-Aut", "zone": "Surxondaryo Province (Surxondaryo viloyati)", "country": "Uzbekistan", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 11, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1366, "circumstances": "En route, the crew was informed that weather conditions were poor in Samarkand and received the autorisation to fly directly to Stalinabad. The crew decided to change his route and while flying in cloudy conditions, the pilot in command mistook the Chakchar Mountain Range with the Kush-Tang Mountain Range and started the descent prematurely. At an altitude of 2,600 meters, the right wing hit a rocky peak and the aircraft crashed about 400 meters lower and came to rest at an altitude of 2,270 meters. SAR operations were conducted but eventually suspended few days later as no trace of the aircraft nor the 11 occupants was found. On May 8, 1949, the wreckage was found on the slope of Mt Bel'-Aut located in a mountain range of the Surxondaryo province in east Uzbekistan. ", "probable_cause": "It was determined that the crew cut the route and then followed a wrong track after he mistook two mountain ranges. As the descent was started prematurely, the aircraft was flying at an insufficient altitude at the time of the accident. Poor visibility due to clouds was considered as a contributory factor, as well as wrong decisions on part of the flight operations, lack of discipline on part of the flying crew, lack of organization and communication between the crew and the operations and inappropriate information regarding the weather forecast (information transmitted to the crew had expired). "}