{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-12-near-zugdidi-18-killed", "date": "Jun 14, 1953 at 1635 LT", "type": "Ilyushin II-12", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Moscow – Rostov-on-Don – Tbilisi", "msn": "30103", "yom": 28, "flight_number": "SU229", "city": "Zugdidi", "zone": "Samegrelo-Zemo Svaneti", "country": "Georgia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 18, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3204, "circumstances": "The crew departed Moscow-Vnukovo Airport at 0520LT on a flight to Tbilisi with an intermediate stop scheduled at Rostov-on-Don. Due to the deterioration of the weather conditions and the presence of a storm between Krasnodar and Sukhumi, the crew decided to modify his route and obtained the permission from ATC to divert to Krasnodar. The crew and the passengers waited for few hours at Krasnodar Airport and the aircraft took off at 1507LT bound for Tbilisi. While cruising under VFR at an altitude of 2,400 meters, the crew encountered poor weather conditions with thunderstorm activity, heavy rain falls, turbulence, hail and lightning. Within few minutes, the aircraft was hit by lightning and suffered heavy turbulence so went out of control and entered a dive. At an altitude of 300 meters, the crew elected to regain control but high g forces exceeded the design of the wings that were torn off. Out of control, the airplane crashed in flames in a wooded and hilly terrain located near the village of Grigorishi, about 15 km northeast of Zugdidi. The aircraft was totally destroyed and all 18 occupants were killed. ", "probable_cause": "Loss of control caused by poor weather conditions consisting of thunderstorm activity with heavy rain falls, hail, turbulence and lightning. "}