{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-524-denver", "date": "Dec 20, 2008 at 1818 LT", "type": "Boeing 737-500", "operator": "Continental%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Denver - Houston", "msn": "27324/2621", "yom": 1994, "flight_number": "CO1404", "city": "Denver-Intl", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 110, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13100, "captain_hours_type": 6300, "copilot_hours": 8000, "copilot_hours_type": 1500, "aircraft_hours": 40541, "circumstances": "On December 20, 2008, about 1818 mountain standard time, Continental Airlines flight 1404, a Boeing 737-500, N18611, departed the left side of runway 34R during takeoff from Denver International Airport (DEN), Denver, Colorado. A postcrash fire ensued. The captain and 5 of the 110 passengers were seriously injured; the first officer, 2 cabin crewmembers, and 38 passengers received minor injuries; and 1 cabin crewmember and 67 passengers (3 of whom were lap-held children) were uninjured. The airplane was substantially damaged. The scheduled, domestic passenger flight, operated under the provisions of 14 Code of Federal Regulations Part 121, was departing DEN and was destined for George Bush Intercontinental Airport, Houston, Texas. At the time of the accident, visual meteorological conditions prevailed, with strong and gusty winds out of the west. The flight operated on an instrument flight rules flight plan.", "probable_cause": "The captain’s cessation of right rudder input, which was needed to maintain directional control of the airplane, about 4 seconds before the excursion, when the airplane encountered a strong and gusty crosswind that exceeded the captain’s training and experience. \r\nContributing to the accident were the following factors: \r\n1) an air traffic control system that did not require or facilitate the dissemination of key, available wind information to the air traffic controllers and pilots; and \r\n2) inadequate crosswind training in the airline industry due to deficient simulator wind gust modeling."}