{"url": "https://www.baaa-acro.com/crash/crash-cessna-441-conquest-ii-renmark-3-killed", "date": "May 30, 2017 at 1630 LT", "type": "Cessna 441 Conquest", "operator": "Rossair-Charter", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Renmark - Adelaide", "msn": "441-0113", "yom": 1980, "flight_number": null, "city": "Renmark", "zone": "South Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 14751, "captain_hours_type": 987, "copilot_hours": 5000, "copilot_hours_type": 1000, "aircraft_hours": 13845, "circumstances": "On 30 May 2017, a Cessna 441 Conquest II (Cessna 441), registered VH-XMJ (XMJ) and operated by AE Charter, trading as Rossair, departed Adelaide Airport, South Australia for a return flight via Renmark Airport, South Australia. On board the aircraft were: \r\n• an inductee pilot undergoing a proficiency check, flying from the front left control seat\r\n• the chief pilot conducting the proficiency check, and under assessment for the company training and checking role for Cessna 441 aircraft, seated in the front right control seat\r\n• a Civil Aviation Safety Authority flying operations inspector (FOI), observing and assessing the flight from the first passenger seat directly behind the left hand pilot seat.\r\nEach pilot was qualified to operate the aircraft. There were two purposes for the flight. The primary purpose was for the FOI to observe the chief pilot conducting an operational proficiency check (OPC), for the purposes of issuing him with a check pilot approval on the company’s Cessna 441 aircraft. The second purpose was for the inductee pilot, who had worked for Rossair previously, to complete an OPC as part of his return to line operations for the company. The three pilots reportedly started their pre-flight briefing at around 1300 Central Standard Time. There were two parts of the briefing – the FOI’s briefing to the chief pilot, and the chief pilot’s briefing to the inductee pilot. As the FOI was not occupying a control seat, he was monitoring and assessing the performance of the chief pilot in the conduct of the OPC. There were two distinct exercises listed for the flight (see the section titled Check flight sequences). Flight exercise 1 detailed that the inductee pilot was to conduct an instrument departure from Adelaide Airport, holding pattern and single engine RNAV2 approach, go around and landing at Renmark Airport. Flight exercise 2 included a normal take-off from Renmark Airport, simulated engine failure after take-off, and a two engine instrument approach on return to Adelaide. The aircraft departed from Adelaide at 1524, climbed to an altitude about 17,000 ft above mean sea level, and was cleared by air traffic control (ATC) to track to waypoint RENWB, which was the commencement of the Renmark runway 073 RNAV-Z GNSS approach. The pilot of XMJ was then cleared to descend, and notified ATC that they intended to carry out airwork in the Renmark area. The pilot further advised that they would call ATC again on the completion of the airwork, or at the latest by 1615. No further transmissions from XMJ were recorded on the area frequency and the aircraft left surveillance coverage as it descended towards waypoint RENWB. The common traffic advisory frequency used for air-to-air communications in the vicinity of Renmark Airport recorded several further transmissions from XMJ as the crew conducted practice holding patterns, and a practice runway 07 RNAV GNSS approach. Voice analysis confirmed that the inductee pilot made the radio transmissions, as expected for the check flight. At the completion of the approach, the aircraft circled for the opposite runway and landed on runway 25, before backtracking and lining up for departure. That sequence varied from the planned exercise in that no single-engine go-around was conducted prior to landing at Renmark. At 1614, the common traffic advisory frequency recorded a transmission from the pilot of XMJ stating that they would shortly depart Renmark using runway 25 to conduct further airwork in the circuit area of the runway. A witness at the airport reported that, prior to the take-off roll, the aircraft was briefly held stationary in the lined-up position with the engines operating at significant power. The take-off roll was described as normal however, and the witness looked away before the aircraft became airborne. The aircraft maintained the runway heading until reaching a height of between 300-400 ft above the ground (see the section titled Recorded flight data). At that point the aircraft began veering to the right of the extended runway centreline (Figures 1 and 15). The aircraft continued to climb to about 600 ft above the ground (700 ft altitude), and held this height for about 30 seconds, followed by a descent to about 500 ft (Figures 2 and 13). The information ceased 5 seconds later, which was about 60 seconds after take-off. A distress beacon broadcast was received by the Joint Rescue Coordination Centre and passed on to ATC at 1625. Following an air and ground search the aircraft was located by a ground party at 1856 about 4 km west of Renmark Airport. All on board were fatally injured and the aircraft was destroyed.", "probable_cause": "Findings: \r\nFrom the evidence available, the following findings are made with respect to the collision with terrain involving Cessna 441, registered VH-XMJ, that occurred 4 km west of Renmark Airport,\r\nSouth Australia on 30 May 2017. These findings should not be read as apportioning blame or liability to any particular organisation or individual.\r\nContributing factors:\r\n• Following a planned simulated engine failure after take-off, the aircraft did not achieve the expected single engine climb performance, or target airspeed, over the final 30 seconds of the flight. \r\n• The exercise was not discontinued when the aircraft’s single engine performance and airspeed were not attained. That was probably because the degraded aircraft performance, or the\r\nassociated risk, were not recognised by the pilots occupying the control seats. \r\n• It is likely that the method of simulating the engine failure and pilot control inputs, together or in isolation, led to reduced single engine aircraft performance and asymmetric loss of control.\r\n• Not following the recommended procedure for simulating an engine failure in the Cessna 441 pilot’s operating handbook meant that there was insufficient height to recover following the loss of control.\r\nOther factors that increased risk:\r\n• The Rossair training and checking manual procedure for a simulated engine failure in a turboprop aircraft was inappropriate and, if followed, increased the risk of asymmetric control loss. \r\n• The flying operations inspector was not in a control seat and did not share a communication systems with the crew. Consequently, he had reduced ability to actively monitor the flight and\r\ncommunicate any identified performance degradation.\r\n• The inductee pilot had limited recent experience in the Cessna 441, and the chief pilot had an extended time period between being training and being tested as a check pilot on this aircraft. While both pilots performed the same exercise during a practice flight the week before, it is probable that these two factors led to a degradation in the skills required to safely perform and monitor the simulated engine failure exercise.\r\n• The chief pilot and other key operational managers within Rossair were experiencing high levels of workload and pressure during the months leading up to the accident.\r\n• In the 5 years leading up to the accident, the Civil Aviation Safety Authority had conducted numerous regulatory service tasks for the air transport operator and had regular communication with the operator’s chief pilots and other personnel. However, it had not conducted a systemic or detailed audit during that period, and its focus on a largely informal and often undocumented approach to oversight increased the risk that organisational or systemic issues associated with the operator would not be effectively identified and addressed. \r\nOther findings:\r\n• A lack of recorded data from this aircraft reduced the available evidence about handling aspects and cockpit communications. This limited the extent to which potential factors contributing to the accident could be analysed."}