{"url": "https://www.baaa-acro.com/crash/crash-antonov-12bp-colombo-9-killed", "date": "Mar 24, 2000 at 1804 LT", "type": "Antonov AN-12", "operator": "Sky%20Cabs", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bangkok - Colombo", "msn": "8 3 460 04", "yom": 1968, "flight_number": "SCB702", "city": "Colombo-Bandaranaike", "zone": "Western Province (மேல் மாகாணம்)", "country": "Sri Lanka", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 3, "total_fatalities": 9, "captain_hours": 6719, "captain_hours_type": 961, "copilot_hours": 10802, "copilot_hours_type": 1702, "aircraft_hours": 7241, "circumstances": "The Sky Cabs flight SCB701 originated in Colombo (Bandaranaike International Airport Colombo - hereinafter known as BIA Colombo), Sri Lanka at 1940 hours on 23rd March 2000. It landed in Bangkok, Thailand at 0120 hours on the following day after an uneventful flight. The alternate airport for Bangkok was Rayong/Ban U-Taphao (VTBU). The crew had recent experience in operating AN 12 flights between BIA Colombo and Bangkok International Airport, Thailand. The same flight crew made the return flight back to BIA Colombo after 4 hours and 20 minutes ground time in Bangkok. The crew had received the weather report from Aero Meteorological Division (AMD), prior to departure. An air traffic control flight plan was filed to BIA Colombo, the filed alternate airport was Male International (VRMM) in the Republic of Maldives. The aircraft was refueled adding 6681 kgs of fuel to the remaining 8300 kgs bringing the total fuel onboard to 14981 kg. Flight SCB702, cargo flight, departed Bangkok at 0540 hours on 24th March 2000 to BIA Colombo. The scheduled flight time for Bangkok – BIA Colombo was five hours and twenty minutes with a scheduled time of arrival of 1100 hours (17:00 hours Sri Lanka time). SCB702 made the first radio contact with Sri Lanka air traffic control at 1016 hours. The area controller passed SCB702 the latest weather report effective for BIA Colombo and later, a Sigmet valid at the time. When the control of the flight was handed to the approach radar controller (Director) by the area controller, at 1042 hours SCB 702 was asked to report his radial and DME from Colombo, (i.e. from “DVOR/DME KAT”). SCB702 reported as saying “074 radial and 55 DME ready for descent”, thus the two-way communication was established. Later, the flight SCB702 made two unsuccessful ILS approaches to runway 04. While on a radar heading to get established on the ILS to Runway 22 for a third attempt to land, the aircraft crashed 1.2 N.M. north-northwest of the threshold of Runway 22 (3.2 N.M. north-northeast of the DVOR/DME 'KAT') at BIA Colombo at 1204 hours (or 1804 hours in the evening, local time) on 24th March 2000. Six crew members and three people on the ground were killed. \n", "probable_cause": "The aircraft accident occurred due to fuel starvation. Contributory factors to the accident are as follows:\r\ni) Violation of Air Navigation Regulations on fuel planning;\r\nii) Failure of the flight crew to declare an emergency;\r\niii) Being unable to land due to adverse weather situation;\r\niv) Lack of communicability of the flight crew in English language;\r\nv) Non-availability of established air traffic control procedures to assist an aircraft in distress;\r\nvi) Failure of Sky Cabs (Pvt.) Ltd. to comply with the Air Navigation Regulations and the Conditions set-forth in Schedules issued with the Airline Lisence; and\r\nvii) Absence of an effective Safety Oversight Program implemented by the Department of Civil Aviation, Sri Lanka. "}