{"url": "https://www.baaa-acro.com/crash/crash-sud-aviation-se210-caravelle-iii-rabat-77-killed", "date": "Sep 12, 1961 at 2109 LT", "type": "Sud-Aviation SE-210 Caravelle", "operator": "Air-France-31", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Paris – Rabat – Casablanca", "msn": "68", "yom": 1961, "flight_number": "AF2005", "city": "Rabat", "zone": "Rabat-Salé-Zemmour-Zaer", "country": "Morocco", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 71, "pax_fatalities": 71, "other_fatalities": 0, "total_fatalities": 77, "captain_hours": 10693, "captain_hours_type": 344, "copilot_hours": 3858, "copilot_hours_type": 988, "aircraft_hours": 688, "circumstances": "After a normal flight from Orly Airport, Paris, Flight 2005, Paris-Rabat-Casablanca, reported over the Rabat-Sale Airport, where meteorological conditions were unfavorable owing to thick, low fog which reduced horizontal visibility and ceiling. The pilot reported his intention to attempt a break-through over the non directional beacon; the control tower immediately replied that that facility was not in line with the runway, but the message was not acknowledged. The aircraft crashed to the ground at 2109 hours GMT. The aircraft was completely destroyed by impact and the fire which followed.\r\nCrew:\r\nMr. Seaume, pilot,\r\nMr. Simeoni, copilot,\r\nMr. Nicora, mechanic, \r\nMrs. Metenier, stewardess,\r\nMr. Duhamel, steward, \r\nMr. Jacomon, steward.", "probable_cause": "In the opinion of the board of inquiry of all the theories listed above, those related related to material failure appear the least likely. On the other hand, the theory regarding an error in instrument reading appears more probable than the others. Therefore, the Board explained the failure: \r\n1) by the fact that reading of the Kollsman window altimeter, with which this Caravelle was equipped, may be delicate, as demonstrated by some systematic tests carried out by highly trained crews of various European airlines ; \r\n2) by the possibility that the pilot made that error of 1,000 feet at the beginning of the descent, retaining it, then gave his full attention to reading the pointer, which seemed to him to be of prime importance, in order to bring in the aircraft at the minimum authorized altitude."}