{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t3-t1040-cheyenne-iii-homer-1-killed", "date": "Dec 22, 1989 at 1810 LT", "type": "Piper PA-31 Cheyenne", "operator": "Southcentral%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Kenai - Homer", "msn": "31-8275004", "yom": 1982, "flight_number": null, "city": "Homer", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2500, "captain_hours_type": 40, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9266, "circumstances": "The aircraft was on an IFR flight from Kenai to the Beluga Airport. The airport did not have an instrument approach procedure, a co-located navaid or a co-located intersection or fix. Reportedly, pilots would routinely file IFR for the route, fly outbound from Kenai for 34.5 miles, then atmt visibility acquisition of the airport. On this flight, ARTCC cleared the pilot to fly direct to the airport at an altitude of 2,000 feet. Before reaching the airport, the pilot acknowledged receipt of a clearance to cruise at 2,000 feet and to report cancellation of IFR, then there was no further communication between ARTCC and the flight. Mode C radar data showed the aircraft descended to 600 feet as it was approaching about 5 miles south of the Beluga Airport. Subsequently, the aircraft flew past the uncontrolled airport and crashed into trees about 8 miles northwest of the airport. Marks on the trees showed the aircraft was in a right descending turn on an easterly heading, when it crashed. Elevation of the crash site was 560 feet. Minimum safe (IFR) altitude for the Beluga Airport area was 2,000 feet. There were indications that the destination weather was below VFR conditions. No preimpact mechanical problem was found that would have resulted in the accident. The pilot, sole on board, was killed. ", "probable_cause": "Failure of the pilot to maintain proper altitude. Darkness and adverse weather conditions were related factors."}