{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-ii-fort-lauderdale-3-killed", "date": "Mar 15, 2013 at 1621 LT", "type": "Piper PA-31 Cheyenne", "operator": "Miami Aviation Specialist", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "No", "site": "City", "schedule": "Fort Lauderdale - Fort Lauderdale", "msn": "31-7820033", "yom": 1978, "flight_number": null, "city": "Fort Lauderdale-Executive", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 10000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5006, "circumstances": "The multiengine airplane had not been flown for about 4 months and was being prepared for export. The pilot was attempting a local test flight after avionics upgrades had been performed. Shortly after takeoff, the pilot transmitted that he was experiencing an \"emergency\"; however, he did not state the nature of the emergency. The airplane was observed experiencing difficulty climbing and entered a right turn back toward the airport. It subsequently stalled, rolled right about 90 degrees, and descended. The airplane impacted several parked vehicles and came to rest inverted. A postcrash fire destroyed the airframe. Both engines were destroyed by fire and impact damage. The left propeller assembly was fire damaged, and the right propeller assembly remained attached to the gearbox, which separated from the engine. Examination of wreckage did not reveal any preimpact malfunctions. It was noted that the left engine displayed more pronounced rotational signatures than the right engine, but this difference could be attributed to the impact sequence. The left propeller assembly displayed evidence of twisting and rotational damage, and the right propeller assembly did not display any significant evidence of twisting or rotational damage indicative of operation with a difference in power. The lack of flight recorders and the condition of the wreckage precluded the gathering of additional relevant information.", "probable_cause": "The pilot's failure to maintain airplane control following an emergency, the nature of which could not be determined because of crash and fire damage, which resulted in an aerodynamic stall."}