{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601p-springfield-3-killed", "date": "Jan 28, 2020 at 1503 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "LKJ Properties", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Huntsville – Springfield", "msn": "61P-0686-7963324", "yom": 1979, "flight_number": null, "city": "Springfield-Abraham Lincoln", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 5500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3542, "circumstances": "The pilot was conducting an instrument landing system (ILS) approach in instrument meteorological conditions at the conclusion of a cross-country flight. The airplane had been cleared to land, but the tower controller canceled the landing clearance because the airplane appeared not to be established on the localizer as it approached the locator outer marker. The approach controller asked the pilot if he was having an issue with the airplane’s navigation indicator, and the pilot replied, “yup.” Rather than accept the controller’s suggestion to use approach surveillance radar (ASR) approach instead of the ILS approach, the pilot chose to fly the ILS approach again. The pilot was vectored again for the ILS approach, and the controller issued an approach clearance after he confirmed that the pilot was receiving localizer indications on the airplane’s navigation equipment. The airplane joined the localizer and proceeded toward the runway while descending. The pilot was instructed to contact the tower controller; shortly afterward, the airplane entered a left descending turn away from the localizer centerline. At that time, the airplane was about 3 nautical miles from the locator outer marker. The pilot then told the tower controller, “we’ve got a prob.” The tower controller told the pilot to climb and maintain 3,000 ft msl and to turn left to a heading of 180°. The pilot did not respond. During the final 5 seconds of recorded track data, the airplane’s descent rate increased rapidly from 1,500 to about 5,450 ft per minute. The airplane impacted terrain about 1 nm left of the localizer centerline in a left-wing-down and slightly nose down attitude at a groundspeed of about 90 knots. A postimpact fire ensued. Although the pilot was instrument rated, his recent instrument flight experience could not be determined with the available evidence for this investigation. Most of the fuselage, cockpit, and instrument panel was destroyed during the postimpact fire, but examination of the remaining wreckage revealed no anomalies. Acoustic analysis of audio sampled from doorbell security videos was consistent with the airplane's propellers rotating at a speed of 2,500 rpm before a sudden reduction in propeller speed to about 1,200 rpm about 2 seconds before impact. The airplane’s flightpath was consistent with the airplane’s avionics receiving a valid localizer signal during both instrument approaches. However, about 5 months before the accident, the pilot told the airplane’s current maintainer that the horizontal situation indicator (HSI) displayed erroneous heading indications. The maintainer reported that a replacement HSI was purchased and shipped directly to the pilot to be installed in the airplane; however, the available evidence for the investigation did not show whether the malfunctioning HSI was replaced before the flight. The HSI installed in the airplane at the time of the accident sustained significant thermal and fire damage, which prevented testing. During both ILS approaches, the pilot was cleared to maintain 3,000 ft mean sea level (msl) until the airplane was established on the localizer. During the second ILS approach, the airplane descended immediately, even though the airplane was below the lower limit of the glideslope. Although a descent to the glideslope intercept altitude (2,100 ft msl) would have been acceptable after joining the localizer, such a descent was not consistent with how the pilot flew the previous ILS approach, during which he maintained the assigned altitude of 3,000 ft msl until the airplane intercepted the glideslope. If the HSI provided erroneous heading information during the flight, it could have increased the pilot’s workload during the instrument approach and contributed to a breakdown in his instrument scan and his ability to recognize the airplane’s deviation left of course and descent below the glideslope; however, it is unknown if the pilot had replaced the HSI.", "probable_cause": "The pilot’s failure to follow the instrument landing system (ILS) course guidance during the instrument approach."}