{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-uc-45-j-expeditor-swan-lake-3-killed", "date": "Sep 13, 2001 at 1735 LT", "type": "Beechcraft C-45 Expeditor", "operator": "Aircraft%20Guaranty%20Corp%20Trustee", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Swan Lake – Mayo", "msn": "5715", "yom": 1943, "flight_number": null, "city": "Swan Lake", "zone": "Yukon", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 700, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The privately owned and operated Beech UC45-J was flying out of an outfitter's camp located near Swan Lake, Yukon Territory. The aircraft departed the clay-and-gravel strip for Mayo with one pilot, two passengers, luggage, and a reported load of 800 pounds of moose and caribou meat. The aircraft accelerated down the runway in a normal fashion, with the tail becoming airborne first. The aircraft left the surface of the runway and began a steep climb, followed by a yaw and bank to the left. The aircraft entered the Pleasant Creek valley off the end of the runway in a near-vertical, nose-down attitude. An explosion occurred, followed by a plume of smoke. Two persons immediately attempted to rescue the pilot and the passengers but discovered the aircraft partly submerged in the creek and engulfed in flames from the post-crash fire. There were no survivors.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. The meat was loaded into the aircraft on a slippery surface and not adequately secured.\r\n2. The manner in which the meat was loaded and secured most likely allowed the load to shift to the rear of the cabin during take-off. This rearward shift resulted in the loss of pitch control and an aerodynamic stall from which the pilot could not recover.\r\nOther Findings:\r\n1. The aircraft's C of G was most likely at or aft of the aft limit before engine start."}