{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950m-mairoa-1-killed", "date": "Dec 19, 2003 at 1500 LT", "type": "Fletcher FU-24", "operator": "Super%20Air", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": null, "msn": "65", "yom": 1960, "flight_number": null, "city": "Mairoa", "zone": "Waikato Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 14335, "captain_hours_type": 5000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the morning of 19 December 2003, the pilot began work about 0630 hours, flying from Te Kuiti aerodrome to an agricultural airstrip about eight nautical miles to the west. At that strip he completed a 150 tonne lime contract that had been started by two other aircraft the day before. Refuelling of the aircraft was completed approximately every hour, and the pilot stopped for a break with about four loads remaining. At 1400 hours, with the job completed, he flew to the strip from which he operated until the time of the accident. On arrival at this strip, the pilot completed a reconnaissance flight with the pilot of ZK-EMW, discussed their sowing plan, and agreed on a 1.1 tonne load with the loader driver. Take-offs were made to the south-west, landings in the opposite direction. The loader driver reported that the job was going smoothly, and that the pilot seemed in good spirits, at one stage miming wiping his brow, which the loader driver took to be a comment on the heat of the day. During this time, a third company aircraft, ZK-JAL, arrived at the strip and shut down, as the loader driver was able to handle only two aircraft at a time. The pilot of ZK-JAL flew a briefing sortie with the pilot of ZK-BXZ prior to the planned departure of ZK-BXZ. After each take-off, ZK-BXZ would turn left on to a downwind leg and then cross over the top (loading) end of the strip on the way to the sowing area. ZK-BXZ was working inward from the eastern boundary of the property, and ZK-EMW from the western boundary. While topdressing was in progress, fresh lime was being trucked to the strip and placed in the large fertilizer bin from which the loader was replenishing the aircraft. The lime was received directly from the processing plant, and was dry and free-flowing. As each load arrived, the farmer would mix a cobalt supplement with it in the bin. One of the truck drivers, who himself held a Commercial Pilot Licence (Aeroplane), took several photographs of the aircraft landing and taking off. One photograph showed ZK-BXZ leaving the end of the strip on probably its penultimate take-off, with ZK-EMW on final approach on the reciprocal heading. On this occasion ZK-EMW passed over ZK-BXZ just after the latter became airborne. The next photograph showed ZK-BXZ approximately two thirds of the way down the strip, with 20° of flap set on its final take-off, with dirt being thrown up by the wheels as it hit the soft spots in the strip. The driver did not watch the take-off beyond this point. The pilot of ZK-EMW initially reported that on his landing approach, he flew over ZK-BXZ while it was still on its take-off run. He later disputed this and claimed that ZK-BXZ had just become airborne when it disappeared from view under his right wing. In any event, ZK-BXZ only flew approximately 170 metres, so the proximity of these two aircraft was very close if ZK-BXZ was already airborne at this point in time. The close proximity of the two aircraft is significant as it is possible that ZKBXZ, being the lower of the two aircraft, may have encountered wake turbulence from ZK-EMW. All aircraft produce wake turbulence as a by-product of generating lift from their wings, the intensity varying with the aircraft’s speed, weight and configuration. The weather conditions, as discussed in the article appended to this report, were favourable for ZK-BXZ to encounter the wake vortices from the aircraft passing above. The first indication of the accident was a loud bang heard by the farmer – he was in the bin mixing in the cobalt supplement, and initially thought he had heard a truck tailgate slamming. Looking towards the end of the strip, he saw a plume of smoke and immediately went by motorcycle to investigate. On arrival at the scene, he found the aeroplane well ablaze, and was unable to get close because of the heat. As the accident occurred, a fourth company aircraft, ZK-EGV, arrived at the strip. The pilot did not see the actual impact, but flew over the burning wreckage on approach. As soon as he landed he went by foot to the accident site, as he had arrived too late to join those that had gone on board the loading vehicle. The loader driver used his fire extinguisher to quell the flames, but could do nothing to assist the pilot. After the extinguisher ran out, the fire flared up again, and all those present could do was to await the arrival of the Fire Service. The accident occurred in daylight, at approximately 1500 hours NZDT, at Mairoa, 10 nm south-west of Te Kuiti aerodrome, at an elevation of 1150 ft. Latitude: S 38° 22.9', longitude: E 174° 57.0'; grid reference: 260-R16-806117. ", "probable_cause": "Conclusions:\r\n- The pilot was properly licensed, rated, and fit for the flight undertaken.\r\n- The aircraft had been subjected to regular maintenance and appeared to be airworthy prior to the accident.\r\n- The engine strip found no reason why the engine would not be producing full power.\r\n- The aircraft was operating to the limits of its performance for the given conditions.\r\n- The accident was not survivable.\r\n- It has not been possible to determine a conclusive cause for the accident. "}