{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-rochester-3-killed", "date": "Nov 20, 1985 at 1848 LT", "type": "Piper PA-31-310 Navajo", "operator": "Oxaero", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Paris – Southend – Rochester", "msn": "31-672", "yom": 1970, "flight_number": null, "city": "Rochester", "zone": "Kent", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 5525, "captain_hours_type": 3000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was returning to Rochester after an overnight business trip to Paris. It landed at Southend Airport at 1815 hours where HM customs clearance was obtained. The aircraft left Southend at 1831 hours for the 14 mile flight to Rochester. It was dark with snow, frost and fog warnings in force. The stratus cloud base at Rochester was estimated to be 600 feet and visibility was estimated to be 2,000 meters in rain and snow. Having established RTF communications with Rochester AFIS the aircraft was seen in the downwind position for runway 03 left hand at a height of 3-400 feet. This visual contact was confirmed at the pilot's request. The aircraft was next seen overhead the airfield at a similar height. When the pilot again reported 'downwind' he said that if he was not happy with his approach he might attempt an approach to the reciprocal runway 21. Eye witnesses in the village of Burham, which lies 1.5 nautical miles southwest of the airfield, saw the aircraft making a left handed approach over the River Medway valley at low level. It then headed over the centre of Burham towards the airfield and shortly afterwards crashed into the steep upper slopes of Blue Bell Hill some 45 feet below the ridge summit of 510 feet. The elevation of Rochester aerodrome is 436 feet. A severe fire followed the impact and the three occupants were killed. ", "probable_cause": null}