{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-mineral-wells", "date": "Nov 18, 2003 at 1410 LT", "type": "Cessna 550 Citation II", "operator": "Haalo", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Worth – Mineral Wells", "msn": "550-0144", "yom": 1980, "flight_number": null, "city": "Mineral Wells", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16500, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A designated pilot examiner (DPE) was administering a type-rating check ride from the jump seat (located behind co-pilot's seat), and instructed the second-in-command (SIC) (required for the check ride and occupying the front right seat) to reduce the power on one engine to simulate a single engine approach. Approximately 23 seconds later, the airplane began to \"drop rapidly.\" To arrest the descent, both pilots simultaneously applied full power on both engines, and the applicant (occupying the front left seat) increased the airplane's pitch attitude to 12 degrees. However, the airplane continued to descend and touched down short of the landing threshold for the runway. A post-impact fire consumed the airplane. According to the applicant, after takeoff, he demonstrated several maneuvers, and was then provided vectors for a VOR instrument approach. While executing the approach, it was \"really bumpy\", and they hit a gust of wind, which resulted in him having to correct the airplane's attitude back to straight and level flight. When the airplane was approximately one mile from the end of the runway, he looked outside and saw that he was high on the approach and extended the flaps to 40 degrees. Shortly after, the PIC reduced power on the left engine to simulate a single-engine approach. When the airplane was approximately 1/4 to 1/2-mile from the end of the runway, at 400 feet mean sea level (msl) (about 366 feet above ground level), Vref 110, the airplane began to sink rapidly, and it impacted the ground. The applicant said that he, \"never experienced wind shear like that before...and in hindsight it would have been more helpful if they had a better understanding of the wind conditions before they tried to land.\" Under current FAA regulations, even though the pilot in the right seat (the applicant's flight instructor) acted as the SIC for the purpose of the check ride, the applicant was not type rated in the airplane, and technically, could not be designated as the pilot-in-command (PIC). The instructor was type rated in the airplane; and therefore, was the PIC. ", "probable_cause": "The pilot-in-command's failure to maintain control of the airplane while executing a simulated engine failure on final approach. A factor was the windshear.\n"}