{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-33rc-carswell-afb-2-killed", "date": "Mar 18, 1989 at 0216 LT", "type": "Douglas DC-9", "operator": "Evergreen-2", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Carswell - Tinker", "msn": "47192", "yom": 1968, "flight_number": "EV417", "city": "Carswell AFB (Fort Worth)", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7238, "captain_hours_type": 1938, "copilot_hours": 10863, "copilot_hours_type": 1213, "aircraft_hours": 41931, "circumstances": "The DC-9 arrived at Carswell AFB at 01:12 CST after a flight from Kelly AFB. The aircraft was off-loaded and re-loaded with cargo by USAF personnel. The engines were then started at 02:04. The crew received taxi instructions for runway 17 and took off from this runway at 02:09. At (or immediately after) rotation, the main cargo door opened. An emergency was declared and the crew climbed to 2500 feet msl before entering a right turn. When about 5nm north of the airport the captain began a shallow turn to the right (for base leg). The aircraft crossed the extended centreline and the captain tightened the turn to establish their position relative to the runway threshold. In doing so, the air load on the door probably caused it to rapidly move to its full open over the top position. A sudden opening of the door would also have produced an unexpected change in the yawing and rolling moments. The captain, possibly partially disoriented, may not have sensed the increasing roll and nose tuck and thus failed to correct a changing attitude until a critical bank angle and loss of altitude had occurred. The DC-9 struck the ground in an inverted, nose down, left wing low attitude and disintegrated. It appeared that the first officer, when closing the main cargo door, didn't hold the door control valve 'T' handle in the closed position long enough for the latching hooks to move into place over the door sill spools. External latched and locked indicators were applied incorrectly, so the first officer thought the door was latched properly when the handle was pointed more toward the 'locked' than the 'unlocked' chevron. It also appeared that one of the two open door warning light switches was malfunctioning. Because of their wiring, this malfunction made the entire door warning system ineffective.", "probable_cause": "The loss of control of the airplane for undetermined reasons following the in-flight opening of the improperly latched cargo door. Contributing to the accident were inadequate procedures used by Evergreen Airlines and approved by the FAA for pre-flight verification of external cargo door lock pin manual control handle, and the failure of McDonnell Douglas to provide flight crew guidance and emergency procedures for an in-flight opening of the cargo door. Also contributing to the accident was the failure of the FAA to mandate modification to the door-open warning system for DC-9 cargo-configured airplanes, given the previously known occurrences of in-flight door openings."}