{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-26-islander-moss-town", "date": "May 16, 2005 at 1230 LT", "type": "Britten-Norman Islander", "operator": "Flamingo%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Freeport – South Bimini – Moss Town", "msn": "599", "yom": 1970, "flight_number": null, "city": "Moss Town", "zone": "Exuma", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 16711, "circumstances": "On May 16, 2005 about 1230EST (1845Z), a Britten Norman Islander aircraft, registration C6-ASA crashed approximately 3nm northeast of the Moss Town International Airport. The Pilot reported, “about 35 minutes south of Nassau International Airport [MYNN] I noticed that my ground speed was very low. I continued with my flight to MYEF because I should have had 1 hour and 30 minutes of fuel. About 10 miles from MYEF my right engine quit then 2 minutes later my left engine quit. I then look a suitable place to land three miles from the airport.” The one (1) pilot and two (2) passengers received no serious injuries. The aircraft was destroyed from impact sustained as it contacted the trees. The accident flight originated from Freeport, Grand Bahama, Bahamas to Moss Town, Exuma, Bahamas with an intermediate stop in South Bimini, Bahamas. Visual Flight Rules Conditions existed at the time of the accident. The aircraft was operated by Flamingo Air Limited, a Bahamian Air Operator Certificate holder. Flamingo Air Limited operated as a Commuter, Unscheduled / On Demand Operator in commercial air transport. Flamingo Air Limited operated under the provision of the Bahamas Aviation Safety Regulations (BASR 2001). Its aircraft are maintained under the provision of Bahamas Aviation Safety Regulations (BASR 2001). The aircraft had flown a total of 2 flights including the accident flight. The pilot flew both flights [the same pilot later flew the accident flight]. The pilot reported no problems with the aircraft prior to the accident. There were no open MEL items. There were no open (uncorrected) mechanical irregularities written in the Technical and Journey Log. On May 15, 2005 the pilot uplifted a total of 130 gallons of fuel, which is the maximum capacity for this aircraft. Prior to the accident flight, the aircraft completed two flights, MYAM to MYGF [flown on May 15, 2005] which lasted 45 minutes and MYGF to MYBS [flown on May 16, 2005] which lasted 30 minutes. No fuel was uplifted prior to the next flight which was MYBS to MYEF, the accident flight [flown on May 16, 2005]. During post accident interviews, the pilot confirmed that he had not noticed anything unusual about the airplane. The pilot later surmised that he had simply run out of fuel.", "probable_cause": "The Flight Standards Inspectorate determined that the probable cause of this accident as Fuel Exhaustion. The Pilot could not calculate the fuel for the intended journey. The Pilot used poor judgment when he elected to continue on to Moss Town International Airport rather than returning back to Nassau International Airport when he first experienced the problem."}