{"url": "https://www.baaa-acro.com/crash/crash-socata-tbm-900-fairoaks", "date": "Oct 15, 2016 at 0732 LT", "type": "Socata TBM-900", "operator": "Sterna Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Douglas - Fairoaks", "msn": "1097", "yom": 2016, "flight_number": null, "city": "Fairoaks", "zone": "Surrey", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5272, "captain_hours_type": 1585, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The accident occurred as the aircraft was preparing to land at Fairoaks Airport at the end of a private flight from Ronaldsway Airport on the Isle of Man. On board were the aircraft commander and a passenger who occupied the front right seat. As the aircraft neared Fairoaks, the pilot listened to the Farnborough ATIS broadcast, which reported a visibility of 4,000 m in mist. He and the passenger discussed the visibility, and agreed that they would proceed to Fairoaks while retaining the option to divert to Farnborough Airport (9 nm to the south-west) if a landing was not possible. The visibility at Fairoaks was recorded as 4,500 m, with ‘few’ clouds at 4,000 ft and a surface wind of 3 kt from 240°. Runway 24 was in use with a left-hand circuit. The circuit height, based on the Fairoaks QNH was 1,100 ft (the elevation of Fairoaks Airport is 80 ft amsl). Runway 24 is a hard runway, 813 m long and 27 m wide. The pilot identified the airfield visually, although there was low lying mist in the area. In order to maintain visual contact with the landing area he joined the circuit and flew a downwind leg that was closer to the runway than usual. He recalled carrying out the pre-landing checks while downwind, including lowering the landing gear and extending the flaps to the takeoff position2 . Based on a final approach with flaps at the landing setting, the pilot planned for an initial approach speed of 90 kt, reducing to a final approach speed of 80 kt. The pilot recalled the aircraft being slightly low as it turned from the downwind leg onto its final approach track. He believed he had selected flaps to the landing position, and recalled seeing the airspeed just below 90 kt, which prompted him to increase power slightly. The aircraft flew through the extended runway centreline and the pilot increased the bank angle to regain it. The pilot’s next recollection was of being in a right bank and seeing only sky ahead. He pushed forward on the control column and attempted to correct the bank with aileron. The aircraft then rolled quickly in the opposite direction and he again applied a correction. He became aware of being in an approximately wings-level attitude and seeing the ground approaching rapidly. He responded by pulling back hard on the control column, but was unable to prevent the aircraft striking the ground. He did not recall hearing a stall warning, or any other audio warning, before the loss of control occurred. The aircraft struck flat ground and slid for about 85 m before coming to rest against a treeline, about 500 m from Runway 24 and approximately on the extended centreline. The propeller was destroyed in the accident sequence and the landing gear legs detached, causing damage to the wings which included a ruptured fuel tank. In the latter stages of the slide the aircraft yawed right, coming to rest heading approximately in the direction from which it had come. The pilot and passenger remained conscious but had both suffered injury. The passenger saw flames from the region of the engine and warned the pilot that they needed to evacuate. He went to the rear of the cabin, opened the main door and left the aircraft. The pilot initially attempted to open his side door, but his right arm was injured and he was unable to open the door with only his left. He therefore followed the passenger out of the rear door.", "probable_cause": "There were no indications that the aircraft had been subject to any defects or malfunctions that may have contributed to the accident. Reports from the two occupants, eye witness accounts and radar data all confirm that the aircraft commenced its final turn from a position closer to the runway than usual. This would have required a sustained moderate angle of bank through about 180° of turn. The radar data indicates that the turn onto the final approach was initially flown with less angle of bank than required. The pilot therefore either lost visual contact with the runway or did not fully appreciate the turn requirements. An explanation for the latter might be that the low height on the downwind leg combined with the relatively poor visibility to produce a runway visual aspect that gave a false impression that the aircraft spacing was not abnormal. As the finals turn progressed, there was a need to increase the angle of bank to a relatively high value. With the flaps remaining at the takeoff setting, and maintaining level flight, this placed the aircraft close to its stalling speed. Any increase in angle of bank or ‘g’ loading (as may have occurred when it became evident that the aircraft would fly through the extended centreline) risked a stall. The available evidence indicates that the aircraft stalled during the turn onto the final approach. Recovery actions taken by the occupants appear to have been partially successful, but there was evidently insufficient height in which to effect a full recovery."}