{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-near-port-moresby-4-killed", "date": "Sep 20, 2014 at 0935 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Hevilift", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "Woitape - Port Moresby", "msn": "528", "yom": 1977, "flight_number": null, "city": "Port Moresby", "zone": "National Capital District", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 19290, "captain_hours_type": 5980, "copilot_hours": 432, "copilot_hours_type": 172, "aircraft_hours": 34327, "circumstances": "A DHC-6 Twin Otter aircraft was returning from Woitape, Central Province, to Jacksons Airport, Port Moresby on the morning of 20 September 2014 on a charter flight under the instrument flight rules (IFR). The weather at Woitape was reported to have been clear, but at Port Moresby the reported weather was low cloud and rain. Witnesses reported that the summit of Mt Lawes (1,700 ft above mean sea level (AMSL)) was in cloud all morning on the day of the accident. When the aircraft was 36 nm (67 km) from Port Moresby, air traffic control gave the flight crew a clearance to descend maintaining visual separation from terrain and to track to a left base position for runway 14 right (14R) at Jacksons Airport, Port Moresby. The clearance was accepted by the crew. When the aircraft was within 9.5 nm (17.5 km) of the airport, the pilot in command (PIC) contacted the control tower and said that they were “running into a bit of cloud” and that they “might as well pick up the ILS [instrument landing system] if it’s OK”. The flight crew could not have conducted an ILS approach from that position. They could have discontinued their visual approach and requested radar vectoring for an ILS approach. However, they did not do so. The Port Moresby Aerodrome Terminal Information Service (ATIS), current while the aircraft was approaching Port Moresby had been received by the flight crew. It required aircraft arriving at Port Moresby to conduct an ILS approach. The PIC’s last ILS proficiency check was almost 11 months before the accident flight. A 3-monthly currency on a particular instrument approach is required under PNG Civil Aviation Rule 61.807. It is likely the reason the PIC did not request a clearance to intercept the ILS from 30 nm (55.5 km) was that he did not meet the currency requirements and therefore was not authorized to fly an ILS approach. During the descent, although the PIC said to the copilot ‘we know where we are, keep it coming down’, it was evident from the recorded information that his assessment of their position was incorrect and that the descent should not have been continued. The PIC and copilot appeared to have lost situational awareness. The aircraft impacted terrain near the summit of Mt Lawes and was substantially damaged by impact forces. Both pilots and one passenger were fatally injured in the impact, and one passenger died on the day after the accident from injuries sustained during the accident. Of the five passengers who survived the accident, three were seriously injured and two received minor injuries. One of the fatally injured passengers was not wearing a seat belt.", "probable_cause": "The following contributing factors were identified:\r\n- The flight crew continued the descent in instrument meteorological conditions without confirming their position.\r\n- The flight crew’s assessment of their position was incorrect and they had lost situational awareness\r\n- The flight crew deprived themselves of the “Caution” and “Warning” alerts that would have sounded about 20 sec and about 10 sec respectively before the collision, by not deactivating the EGPWS Terrain Inhibit prior to departure from Woitape. "}