{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-butler", "date": "Jan 24, 2007 at 0905 LT", "type": "Cessna 550 Citation II", "operator": "Air%20Ambulance%20by%20Air%20Trek", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Winchester - Butler", "msn": "550-0472", "yom": 1983, "flight_number": null, "city": "Butler", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 22700, "captain_hours_type": 1200, "copilot_hours": 1758, "copilot_hours_type": 85, "aircraft_hours": 10735, "circumstances": "The Citation 550 was being repositioned for an air ambulance transportation flight, and was on approach to land on a 4,801-foot-long, grooved, asphalt runway. The airplane was being flown manually by the copilot, who reported that the landing approach speed (Vref) was 106 knots. The pilot-in-command (PIC) estimated that the airplane \"broke out\" of the clouds about two miles from the runway. Both pilots stated that the airplane continued to descend toward the runway, while on the glide slope and localizer. Neither pilot could recall the airplane's touchdown point on the runway, or the speed at touchdown. Witnesses observed the airplane, \"high and fast\" as it crossed over the runway threshold. The airplane touched down about halfway down the runway, and continued off the departure end. It then struck a wooden localizer antenna platform, and the airport perimeter fence, before crossing a road, and coming to rest about 400 feet from the end of the runway. Data downloaded from the airplane's Enhanced Ground Proximity Warning System (EGPWS) revealed that the airplane's groundspeed at touchdown was about 140 knots. Review of the cockpit voice recorder suggested that the PIC failed to activate the airplane's speed brake upon touchdown. Braking action was estimated to be \"fair\" at the time of the accident, with about 1/4 to 1/2 inches of loose, \"fluffy\" snow on the runway. The PIC reported that he thought the runway might be covered with an inch or two of snow, which did not concern him. The copilot reported encountering light snow during the approach. Both pilots stated that they were not aware of any mechanical failures, or system malfunctions during the accident; nor were any discovered during post accident examinations. According to the airplane flight manual, the conditions applicable to the accident flight prescribed a Vref of 110 knots, with a required landing distance on an uncontaminated runway of approximately 2,740 feet. The prescribed landing distance on a runway contaminated with 1-inch of snow, at a Vref of 110 knots was approximately 5,800 feet. At Vref + 10 knots, the required landing distance increased to about 7,750 feet.\n", "probable_cause": "The copilot's failure to maintain the proper airspeed, and failure to obtain the proper touchdown point, and the pilot-in-command's inadequate supervision, which resulted in an overrun. Contributing to the accident was the PIC's failure to activate the speed brake upon touchdown and the snow contaminated runway."}