{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3t-otter-george-inlet-1-killed", "date": "May 13, 2019 at 1221 LT", "type": "De Havilland DHC-3 Otter", "operator": "Taquan%20Air-2", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Ketchikan - Ketchikan", "msn": "159", "yom": 1956, "flight_number": null, "city": "Ketchikan", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 25000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 30296, "circumstances": "On May 13, 2019, about 1221 Alaska daylight time, a float-equipped de Havilland DHC-2 (Beaver) airplane, N952DB, and a float-equipped de Havilland DHC-3 (Otter) airplane, N959PA, collided in midair about 8 miles northeast of Ketchikan, Alaska. The DHC-2 pilot and four passengers sustained fatal injuries. The DHC-3 pilot sustained minor injuries, nine passengers sustained serious injuries, and one passenger sustained fatal injuries. The DHC-2 was destroyed, and the DHC-3 sustained substantial damage. The DHC-2 was registered to and operated by Mountain Air Service LLC, Ketchikan, Alaska, under the provisions of Title 14 Code of Federal Regulations (CFR) Part 135 as an on-demand sightseeing flight. The DHC-3 was registered to Pantechnicon Aviation LTD, Minden, Nevada, and operated by Venture Travel, LLC, dba Taquan Air, Ketchikan, Alaska, under the provisions of Part 135 as an on-demand sightseeing flight. Visual meteorological conditions prevailed in the area at the time of the accident. According to information provided by the operators, both airplanes had been conducting sightseeing flights to the Misty Fjords National Monument area. They were both converging on a scenic waterfall in the Mahoney Lakes area on Revillagigedo Island before returning to the Ketchikan Harbor Seaplane Base (5KE), Ketchikan, Alaska, when the accident occurred. According to recorded avionics data recovered from the DHC-3, it departed from an inlet (Rudyerd Bay) in the Misty Fjords National Monument area about 1203 and followed the inlet westward toward Point Eva and Manzanita Island. At 1209, at an altitude between 1,900 and 2,200 ft, the DHC-3 crossed the Behm Canal then turned to the southwest about 1212 in the vicinity of Lake Grace. Automatic dependent surveillance-broadcast (ADS-B) tracking data for both airplanes, which were provided by the Federal Aviation Administration (FAA), began at 1213:08 for the DHC-3, and at 1213:55 for the DHC-2. At 1217:15, the DHC-3 was about level at 4,000 ft mean sea level (msl) over Carroll Inlet on a track of 225°. The DHC-2 was 4.2 nautical miles (nm) south of the DHC-3, climbing through 2,800 ft, on a track of 255°. The DHC-3 pilot stated that, about this time, he checked his traffic display and “there were two groups of blue triangles, but not on my line. They were to the left of where I was going.” He stated that he did not observe the DHC-2 on his traffic display before the collision. The ADS-B data indicated that, about 1219, the DHC-3 started a descent from 4,000 ft, and the DHC-2 was climbing from 3,175 ft. During the next 1 minute 21 seconds, the DHC-3 continued to descend on a track between 224° and 237°, and the DHC-2 leveled out at 3,350 ft on a track of about 255°. Between 1220:21 and 1221:14, the DHC-3 made a shallow left turn to a track of 210°, then a shallow right turn back to a track of 226°. The airplanes collided at 1221:14 at an altitude of 3,350 ft, 7.4 nm northeast of 5KE. The ADS-B data for both airplanes end about the time of the collision. The DHC-2 was fractured into multiple pieces and impacted the water and terrain northeast of Mahoney Lake. Recorded avionics data for the DHC-3 indicate that at 1221:14, the DHC-3 experienced a brief upset in vertical load factor and soon after entered a right bank, reaching an attitude about 50° right wing down at 1221:19 and 27° nose down at 1221:22. The DHC-3 began descending and completed a 180° turn before impacting George Inlet at 1222:15 along a northeast track.", "probable_cause": "The NTSB determines that the probable cause of this accident was the inherent limitations of the see-and-avoid concept, which prevented the two pilots from seeing the other airplane before the collision, and the absence of visual and aural alerts from both airplanes’ traffic display systems, while operating in a geographic area with a high concentration of air tour activity. \r\nContributing to the accident were \r\n1) the Federal Aviation Administration’s provision of new transceivers that lacked alerting capability to Capstone Program operators without adequately mitigating the increased risk associated with the consequent loss of the previously available alerting capability and \r\n2) the absence of a requirement for airborne traffic advisory systems with aural alerting among operators who carry passengers for hire."}