{"url": "https://www.baaa-acro.com/crash/crash-boeing-377-stratocruiser-10-30-seattle-5-killed", "date": "Apr 2, 1956 at 0810 LT", "type": "Boeing 377 Stratocruiser", "operator": "Northwest%20Airlines2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Seattle – Portland – Chicago – New York", "msn": "15954", "yom": 1949, "flight_number": "NW002", "city": "Seattle", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 1, "pax_on_board": 32, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 14030, "captain_hours_type": 1557, "copilot_hours": 7297, "copilot_hours_type": 1143, "aircraft_hours": 18489, "circumstances": "Flight 2 was scheduled daily between Seattle, Washington. and New York, New York, with intermediate stops at Portland, Oregon, and Chicago., Illinois. It departed Seattle-Tacoma Airport at 0806 on an IFR flight plan to Portland, Oregon, via Victor Airway 23 to cruise at 6,000 feet. There were 32 passengers arid a crew of six consisting of Captain Robert Reeve Heard, First Officer Gene Paul Johnson, Flight Engineer Carl Vernon Thomsen, Flight Service Attendant David V. Razey, Senior Stewardess Elinor A. Whitacre. and Junior Stewardess Dorothy L. Oetting. Takeoff was made on runway 20 and the flight climbed to an altitude of 1,000 to 1,200 feet. At this time power reduced and the wing flaps which had been set at the normal 25-degree takeoff position, were retracted at an airspeed of 145 knots. Immediately the crew became aware of severe buffeting and a strong tendency of the aircraft to roll to the left. Because the buffeting began almost immediately after the flaps ware retracted, the captain believed that it was due to a split-flap condition, i. e., the wing flaps on one side of the aircraft being retracted while the flaps on the other side remained partially or fully down. Power was reduced momentarily in an attempt to alleviate the buffeting but this was not effective and maximum continuous power was again restored. After being cleared by the Seattle tower for return the captain decided not to turn the aircraft because of control difficulty and advised that he would proceed to McChord Air Force Base at Tacoma. Thereafter, the captain testified the trouble became worse and the aircraft continued to lose altitude. The captain elected to ditch and did so at approximately 0810. Touchdown was on smooth water at an airspeed of approximately 120 knots and there was no abrupt deceleration. Passengers and crew members, except the captain and first officer, left the aircraft through the main cabin door and emergency exits. The captain and first officer, after a passenger count, left the aircraft through cockpit windows and swam to the left and right wings, respectively. The aircraft sank in approximately 15 minutes and by that time all persons on the wings had been supplied with buoyant cushions from the cabin seats. Those who survived were rescued by surface craft from the 42-degree F. water within 30 to 35 minutes from the time of ditching.", "probable_cause": "The Board determines that the probable cause of the accident Was the incorrect analysis of control difficulty which occurred on retraction of the wing flaps as a result of the flight engineer's failure to close the engine cowl flaps - the analysis having been made under conditions of great urgency and within an extremely short period of time available for decision. The following findings were reported:\r\n- Two minutes after takeoff an emergency was declared because of severe buffeting and control difficulty,\r\n- The flight engineer did not close the cowl flaps to takeoff position,\r\n- The cause of the buffeting and control difficulty was not determined by the flight crew and the captain made a decision to ditch the aircraft in Puget Sound,\r\n- The ditching was made under favorable circumstances. The aircraft sank in about 15 minutes and all survivors were rescued from the water shortly thereafter,\r\n- The aircraft was recovered from aver 400 feet of water and examination disclosed that all engine cowl flaps were approximately full-open,\r\n- The buffeting and control difficulty was caused by the improper setting of the engine cowl flaps,\r\n- There was no failure or malfunction of the aircraft, the powerplants, or control systems prior to the ditching."}