{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-near-eatonton-5-killed", "date": "Jun 5, 2020 at 1520 LT", "type": "Piper PA-31 Cheyenne", "operator": "Larry Ray Pruitt", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Williston – New Castle", "msn": "31-7520024", "yom": 1975, "flight_number": null, "city": "Eatonton", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 2000, "captain_hours_type": null, "copilot_hours": 15, "copilot_hours_type": null, "aircraft_hours": 7749, "circumstances": "Before the personal instrument flight rules flight began, the pilot obtained a preflight weather briefing that indicated that instrument meteorological conditions, convective activity, and moderate-to-severe icing conditions would be occurring along the route of flight. According to track data, while the pilot was navigating to avoid weather, the pilot was using the autopilot for maneuvering. After the pilot reported to air traffic control that the airplane would be turning direct to its destination, the performance analysis of track data showed that the airplane began a slight left turn with a bank angle of about 10°, which was consistent with the intended route of flight. However, the turn then reversed, and the airplane began banking to the right, reaching about 120° right wing down during the next 70 seconds and showing a slow oscillation in pitch attitude. Satellite imagery showed that the airplane was likely in instrument meteorological conditions when it began a rapid descent, and the airplane’s descent rate was about 7,000 feet per minute. Postaccident examination of the airplane and right engine (the left engine was not recovered) revealed no evidence of any preimpact mechanical malfunctions or failures that would have precluded normal operation. The dynamics of the airplane’s movements after the right turn began indicated that the airplane likely was not being actively controlled when it diverted from the intended flightpath. The circumstances of this accident were thus consistent with the pilot’s lack of timely recognition that the autopilot was disengaged. The available evidence for this accident precluded a determination of where the pilot’s attention was directed while navigating direct to the destination. However, the turbulence would have increased the pilot’s workload, and the restricted visibility conditions would have prevented the pilot’s use of outside cues to detect deviations in the airplane’s attitude. Also, the initial roll rates might not have been sufficient to provide reliable cues to the pilot of the developing bank, and the convective conditions would likely have made it difficult for the pilot to detect and recover from the fully developed unusual attitude.", "probable_cause": "The pilot’s failure to maintain control of the airplane while maneuvering in instrument meteorological conditions, which placed the airplane in an unusual attitude from which the pilot could not recover. Contributing to the accident was the convective and turbulent weather."}