{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-thorne-bay", "date": "Jul 24, 2013 at 1140 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Promech-Air-2", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Ketchikan – Shipley Bay", "msn": "1330", "yom": 1959, "flight_number": null, "city": "Thorne Bay", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 19500, "captain_hours_type": 600, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 33326, "circumstances": "The pilot reported that, while the float-equipped airplane was in cruise flight about 1,200 ft above ground level, the engine made a loud noise and lost partial power, so he maneuvered the airplane to land on a nearby lake. During the approach, the engine lost total power, and the airplane descended into an area of trees before reaching the lake, which resulted in substantial damage to the wings, fuselage, and empennage. The operator reported that the engine had been overhauled (zero-timed) 31 hours before the accident. A postaccident engine examination revealed metal fragments and heavy gouging damage to the rotating components within the crankcase. The bottom portion (crankshaft end) of the n°1 linkrod and its respective bushing were missing from the n°1 linkpin; the oil sump contained metal debris consistent with heavily damaged remnants of these (and other) components. The n°2 cylinder barrel and linkrod and the n°3 linkrod showed deformation to the left (in the direction of engine rotation). Based on the damage observed in the engine, it is likely that the event that initiated the engine failure involved either the the n°1 linkrod bushing or the bottom portion of the n°1 linkrod; however, the extensive damage to these components precluded determination of the failure mode.", "probable_cause": "The failure of the n°1 linkrod bushing or the bottom portion of the linkrod, which resulted in a total loss of engine power."}