{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-lake-brooks", "date": "Sep 24, 1996 at 1015 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Branch-River-Air-Service", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Lake Brooks - King Salmon", "msn": "305", "yom": 1952, "flight_number": null, "city": "Lake Brooks", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5000, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10869, "circumstances": "The pilot and three passengers were departing a remote lake in a float equipped airplane. The pilot positioned the hydraulic actuated flaps to 20 degrees. After takeoff, about 150 ft above the water, the pilot positioned the flap lever to the 'UP' position in preparation of pumping the flaps up, but said he did not move the pump handle. Turbulence was present during the takeoff, and during a left turn, the pilot encountered a severe gust at the time he positioned the flap lever. The airplane stalled in a left turn that steepened to almost a 90 degree bank. The airplane descended and the left wing contacted the surface of the lake. The left wing was torn off the fuselage, and the floats were crushed upward. Both flaps are activated by a common torque tube connected to a double-acting flap actuating cylinder. At the accident scene, the right wing flap and right aileron were observed to be extended to an intermediate position. The weather conditions included 20 kts of wind, turbulence, and rain. The pilot expressed a concern that the flaps may have retracted without being pumped to the up position. An examination of the flap system and the ratchet valve assembly was conducted after the airplane was recovered and the wings were removed. Leakage of hydraulic fluid and air was observed through the ratchet valve. Additional testing of the ratchet valve at an overhaul facility did not reveal any leakage. ", "probable_cause": "Failure of the pilot to maintain sufficient airspeed during the initial climb after takeoff, which resulted in an inadvertent stall and collision with the terrain (water). Turbulence was a related factor. "}