{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-manteo-1-killed", "date": "Dec 25, 2002 at 0100 LT", "type": "Cessna 208B Grand Caravan", "operator": "Telford%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Elizabeth City - Manteo", "msn": "208B-0392", "yom": 1994, "flight_number": null, "city": "Manteo", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 19091, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5229, "circumstances": "At 0029, the pilot contacted Norfolk Approach and stated he was ready for takeoff on runway 01 at Elizabeth City. The controller instructed the pilot to fly runway heading and climb to 3,000 feet. At 0032, the controller advised the pilot that the flight was radar contact and for the pilot to fly heading 160 degrees. At 0034, the Norfolk Approach controller instructed the pilot to contact the FAA Washington Air Route Traffic Control Center. At 0034, the pilot of N1122Y contacted the controller at Washington Center, stating he was coming up on 3,000 feet. The controller acknowledged, and the pilot requested the non-directional beacon (NDB) approach to runway 5 at Dare County Airport, Manteo. At 0036, the controller instructed the pilot to fly heading 145 degrees for Manteo and fly direct to the NDB when he receives the signal. The pilot acknowledged and the controller also asked the pilot if he had the current weather for Manteo. The pilot responded that he did have the current weather. At 0043, the controller cleared the pilot for the NDB runway 5 approach at Manteo and to maintain 2,000 feet until the flight crossed the beacon outbound. The pilot acknowledged. At 0046, the controller informed the pilot that radar contact with the flight was lost and for the pilot to report a cancellation or a downtime on his radio frequency. The pilot acknowledged. At 0057:21, the controller called the pilot and the pilot responded by reporting the flight was procedure turn inbound. No further transmissions were received from the pilot. When the pilot did not report that he was on the ground, and further radio contact could not be established, controllers initiated search and rescue efforts. The wreckage of the airplane was located in the waters of Croatan Sound, about 1.5 miles west of the Dare County Regional Airport about 1000. The pilot was not located in the airplane. The body of the pilot was located in the waters of Croatan Sound on February 11, 2003. Post crash examination of the airplane, flight controls, and engine showed no evidence of precrash failure or malfunction. The propeller separated from the airplane and was not located after the accident. Damage to the mounting bolts for the propeller was consistent with the propeller separating due to impact with the water. Postmortem examination of the pilot showed no findings which could be considered causal to the accident.", "probable_cause": "The pilot's continued descent below the minimum descent altitude, for undetermined reasons, while performing a NDB approach, resulting in the airplane crashing into water 1.5 miles from the airport. A factor in the accident was a cloud ceiling below the minimum descent altitude and low visibility.\n"}