{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b100-king-air-pearland-1-killed", "date": "Feb 19, 2014 at 0845 LT", "type": "Beechcraft 100 King Air", "operator": "TDC Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Austin – Galveston", "msn": "BE-15", "yom": 1976, "flight_number": null, "city": "Pearland", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1281, "captain_hours_type": 192, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The non-instrument-rated pilot departed on a cross-country flight in a twin-engine turboprop airplane on an instrument flight plan. As the pilot neared his destination airport, he received heading and altitude vectors from air traffic control. The controller cleared the flight for the approach to the airport; shortly afterward, the pilot radioed that he was executing a missed approach. The controller then issued missed approach instructions, which the pilot acknowledged. There was no further communication with the pilot. The airplane collided with terrain in a near-vertical angle. About the time of the accident, the automated weather reporting station recorded a 300-foot overcast ceiling, and 5 miles visibility in mist. Examination of the wreckage did not reveal any anomalies that would have precluded normal operation. Additionally, both engines displayed signatures consistent with the production of power at the time of impact. The pilot's logbook indicated that he had a total of 1,281.6 flight hours, with 512.4 in multi-engine airplanes and 192.9 in the accident airplane. The logbook also revealed that he had 29.7 total hours of actual instrument time, with 15.6 of those hours in the accident airplane. Of the total instrument time, he received 1 hour of instrument instruction by a flight instructor, recorded about 3 years before the accident. The accident is consistent with a loss of control in instrument conditions.\n", "probable_cause": "The noninstrument-rated pilot's loss of airplane control during a missed instrument approach. Contributing to the accident was the pilot's decision to file an instrument flight rules flight plan and to fly into known instrument meteorological conditions."}