{"url": "https://www.baaa-acro.com/crash/crash-cessna-404-titan-ii-glasgow-8-killed", "date": "Sep 3, 1999 at 1236 LT", "type": "Cessna 404 Titan", "operator": "Edinburgh Air Charter", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Glasgow – Aberdeen", "msn": "404-0690", "yom": 1980, "flight_number": "Saltire 3W", "city": "Glasgow", "zone": "Strathclyde", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 9, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 4190, "captain_hours_type": 173, "copilot_hours": 2033, "copilot_hours_type": 93, "aircraft_hours": 6532, "circumstances": "The aircraft had been chartered to transport an airline crew of nine persons from Glasgow to Aberdeen. The aircraft was crewed by two pilots and, so far as could be determined, its take-off weight was between 8,320 and 8,600 lb. The maximum permitted take-off weight was 8,400 lb. ATC clearance for an IFR departure was obtained before the aircraft taxied from the business aviation apron for take-off from runway 23, with a take-off run available of 2,658 metres. According to survivors, the take-off proceeded normally until shortly after the aircraft became airborne when they heard a thud or bang. The aircraft was then seen by external witnesses at low height, to the left of the extended runway centerline, in a wings level attitude that later developed into a right bank and a gentle descent. Witnesses reported hearing an engine spluttering and saw at least one propeller rotating slowly. There was a brief 'emergency' radio transmission from the commander and the aircraft was seen entering a steep right turn. It then entered a dive. A witness saw the wings levelled just before the aircraft struck the ground on a northerly track. Three survivors were helped from the wreckage by a nearby farm worker before flames from a severe post-impact fire engulfed the cabin. ", "probable_cause": "The following causal factors were identified:\r\n- The left engine suffered a catastrophic failure of its accessory gear train leading to a progressive but complete loss of power from that engine,\r\n- The propeller of the failed engine was not feathered and therefore the aircraft was incapable of climbing on the power of one engine alone, \r\n- The commander feathered the propeller of the right-hand engine, which was mechanically capable of producing power resulting in a total loss of thrust, \r\n- The commander attempted to return to the departure airfield but lost control of the aircraft during a turn to the right. "}