{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-83-kiev", "date": "Jun 14, 2018 at 2040 LT", "type": "McDonnell Douglas MD-83", "operator": "Bravo%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Antalya - Kiev", "msn": "49946/1898", "yom": 1991, "flight_number": "BAY4406", "city": "Kiev-Zhuliany-Igor Sikorsky", "zone": "Kiev oblast", "country": "Ukraine", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 160, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11548, "captain_hours_type": 5580, "copilot_hours": 12514, "copilot_hours_type": 3580, "aircraft_hours": 43105, "circumstances": "On June 14, 2018, according to the flight assignment, BAY 4406 charter flight en-route Antalya - Kyiv (Zhulyany) on MD-83 aircraft, state and registration number UR-CPR of Bravo Airways, was operated by PIC, co-pilot and five flight attendants. According to PIC’s Statement, the flight was delayed by 6 hours (departure time - 03:30 pm.) The Investigation Team did not establish the departure time from Antalya Airport. According to the PIC, the crew arrived at the airport at 02:00 pm. The takeoff time was 03:41 pm. The airline said the flight was delayed because of the aircraft non-arrival. Bravo Airways is the aircraft operator responsible for the flight and technical operation of the aircraft, maintaining its airworthiness and ensuring the flight safety. The Pilot Flying duties were performed by the PIC, and the Pilot Monitoring was the co-pilot. In accordance with the flight assignment, the PIC cross checked the copilot. According to his Statement, the flight preparation of the crew was carried out one and a half hours before the actual departure at Antalya Airport (PIC received aeronautical and meteorological information from a representative of Turkish Ground Services), after which, the PIC took a decision to perform the flight. Climb and level flight were performed in a normal mode. Landing approach was carried out to RW08 in the conditions of thunderstorm activity with ILS system. At 05:40 pm, at landing on the aerodrome of the Kyiv International Airport (Zhulyany) (hereinafter – Kyiv (Zhulyany) Aerodrome), during the landing run, at the distance of 1260 m from the entrance threshold, the aircraft suffered a runway excursion to the left of the air strip and stopped outside the cleared and graded area of the air strip at the distance of 123 m from the runway center line (according to the tire footprints at the occurrence site.) As a result of the accident, the aircraft has sustained substantial damage, in particular, to the structural elements. None of passengers or crew members received serious injuries.", "probable_cause": "The cause of the accident, i.e. runway excursion of MD-83 UR-CPR aircraft operated by Bravo Airways, which took place on June 14, 2018 at the Kyiv (Zhulyany) Aerodrome at performance of flight BAY 4406 en-route Antalya-Kyiv (Zhulyany) – was the PIC’s decision to continue the landing at the Kyiv (Zhulyany) Aerodrome in the thunderstorm conditions with the following main factors:\r\n- non-stabilized approach for landing, starting from the height of 1,000 feet;\r\n- spoiler non-deployment by the crew;\r\n- incorrect crew actions in application of the reverse thrust on a wet runway (EPR>1.3).\r\nContributing Factors:\r\n- Air traffic control service in the classified airspace of Ukraine, which is required by the Order of the Ministry of Transport of Ukraine dated April 16, 2003, No. 293, was not provided to the crew in full;\r\n- Wind variable in strength and direction;\r\n- Probably, the crew’s failure to listen to the latest ATIS reports for the Kyiv (Zhulyany) Aerodrome;\r\n- Bravo Airways Operator's Manual does not contain landing approach procedures;\r\n- Low-quality pre-flight preparation, pre-landing preparation, checklist reading and completion at all flight stages."}