{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61p-aerostar-ted-smith-601p-waterford-2-killed", "date": "Apr 27, 1997 at 2052 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "Gary L. Blackman", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Allentown – Leesburg", "msn": "61-0826-8163434", "yom": 1981, "flight_number": null, "city": "Waterford", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1600, "captain_hours_type": 525, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During arrival at night, the flight was being controlled by a developmental controller (DC), who was being supervised by an instructor (IC). The pilot (plt) was instructed to descend & cross the STILL Intersection (Int) at 3,000 ft. STILL Int was aligned with the localizer (loc) approach (apch) course, 10.1 mi from the apch end of runway 17 (rwy 17); the final apch fix (FAF) was 3.9 mi from the rwy. About 5 mi before reaching STILL Int, while on course & level at 3,000 ft, the plt was cleared for a Loc Rwy 17 Apch. Radar data showed the aircraft (acft) continued to STILL Int, then it turned onto the loc course toward the FAF. Shortly after departing STILL Int, while inbound on the loc course, the acft began a descent. Before the acft reached the FAF, the DC issued a frequency change to go to UNICOM. During this transmission, the IC noticed a low altitude alert on the radar display, then issued a verbal low altitude alert, saying, 'check altitude, you should be at 1,500 ft (should have said '1,800 ft' as that was the minimum crossing altitude at the FAF), altitude's indicating 1,200, low altitude alert.' There was no response from the plt. This occurred about 2 mi before the FAF. Minimum descent altitude (MDA) for the apch was 720 ft. The acft struck tree tops at 750 ft, about 1/2 mi before the FAF. The IC's remark 'you should be at 1,500 ft' was based on an expired apch plate with a lower FAF minimum crossing altitude; the current minimum crossing altitude at the FAF was 1,800 ft. Apch control management had not made the current plate available to the controllers. Investigation could not determine whether a current apch plate would have prompted an earlier warning by the controllers. ", "probable_cause": "Failure of the pilot to follow the published instrument (IFR) approach procedure, by failing to maintain the minimum altitude for that segment of the approach. "}