{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-near-brisbane-1-killed", "date": "Jul 20, 1993 at 1546 LT", "type": "Piper PA-31-310 Navajo", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Brisbane – Caboolture", "msn": "31-7712060", "yom": 1977, "flight_number": null, "city": "Brisbane", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 531, "captain_hours_type": 35, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft, with only the pilot on board, was being flown from Archerfield to Caboolture via the light aircraft lane to the west of Brisbane in company with another aircraft. About five minutes after departing Archerfield, the pilot radioed that he was experiencing problems with both engines and that he was in an emergency situation. The pilot of the other aircraft advised him that there were suitable forced landing areas in and around a nearby golf course. However, the aircraft continued and slowly lost altitude before rolling inverted and diving steeply into the ground. Ground witnesses reported hearing loud backfiring and fluctuating engine RPM from the aircraft. These sounds were accompanied by erratic rolling and yawing of the aircraft before it rolled to the left and inverted. The right wing was severed outboard of the engine as the aircraft impacted a large tree before crashing onto a road.", "probable_cause": "Wreckage examination revealed that the fuel selectors for both engines were set at the auxiliary tank positions, causing fuel for each engine to be drawn from the corresponding auxiliary tank in each wing. It was established that the aircraft had been refuelled to full main tanks prior to the flight. Further, the pilot had advised in a telephone conversation with an engineer before the flight that the contents of both auxiliary tanks was 60 litres or less. All fuel tanks except the left auxiliary tank were ruptured during the impact sequence. About one litre of fuel was recovered from this\r\ntank. Examination of the aircraft engines indicated that the right engine was under power at impact while the left engine was not. The mechanical condition of the engines indicated that they were capable of normal operation.\r\nThe following factors are considered relevant to the development of the accident:\r\n- The pilot did not use a written checklist.\r\n- The pilot operated the aircraft with the auxiliary tanks selected when the fuel contents of these tanks was low.\r\n- The pilot failed to conduct a forced landing. "}