{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54b-20-do-skymaster-near-blyn-5-killed", "date": "Mar 2, 1957 at 1719 LT", "type": "Douglas C-54 Skymaster", "operator": "Alaska%20Airlines-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Fairbanks – Seattle", "msn": "27239", "yom": 1944, "flight_number": "AS100", "city": "Blyn", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 12033, "captain_hours_type": 8023, "copilot_hours": 10791, "copilot_hours_type": 4532, "aircraft_hours": 28835, "circumstances": "Alaska Airlines, Inc., is an air carrier certificated to conduct scheduled operations within the Territory of Alaska and between Alaska and the continental United States. Flight 100 of March 2 originated at Fairbanks, Alaska, as a regularly scheduled nonstop flight to Seattle, Washington. The aircraft, N 90449, had arrived from Seattle at 0717 March 2 as Trip 101/1. Two minor discrepancies reported by the inbound crew were corrected during a turnaround inspection and by 0930 that morning the aircraft was ready for the return flight to Seattle. The crew assigned to Flight 100, Captain Lawrence F. Currie, Copilot Lyle O. Edwards, and Stewardess Elizabeth Goods, arrived at operations and made the normal routine preparations for the flight. The pilots discussed the flight with the station agent and all necessary flight papers were completed. Weather for the route was given to the pilots. The weight and balance were determined and both were well within allowable limits. The aircraft was serviced with 2,380 gallons of fuel. The following IFR flight plan was filed with Fairbanks ARTC (Air Route Traffic Control): Alaska 100, a DC-4, departing 10,000 feet Amber 2 Snag, 12,000 Blue 79 Haines, 10,000 Blue 79 Annette, 9,500 direct Port Hardy, 10,000 Amber 1 Seattle; airspeed 185; estimating 7 hours, 44 minutes en route; proposing 0955. At 0940 the two passengers and crew boarded the aircraft. Takeoff was made in VFR weather conditions at 0958. Shortly thereafter Fairbanks center called N 90449 and relayed the ATC clearance, approving the flight plan as filed. The weather conditions at Fairbanks and en route were forecast to be generally good and the flight proceeded in the clear as planned, making routine position reports as it progressed. At 1240, when over Haines, Alaska, at 12,000 feet, Flight 100 canceled its instrument flight plan and informed ARTC that they would proceed VFR to Annette and would file DVFR 2 (Defense Visual Flight Rule) after Annette and before entering the CADIZ (Canadian Air Defense Identification Zone). Thereafter the flight proceeded, reporting its position as DVFR at 1,000 feet. The flight was observed at Patricia Bay, British Columbia, at an estimated 3,000 feet m. s. l. by a tower operator. It was also observed leaving the CADIZ. At 1717 the Alaska Airlines Seattle dispatch office received the following position report by radio from Flight 100: \"Dungeness at 16 VFR estimating Seattle at 34.\" This was the last contact with the flight, which crashed shortly thereafter. All five occupants were killed. N 90449 crashed in heavily timbered mountainous terrain March 2 and was not located until March 3, 1957. The crash occurred approximately in the center of the \"on course\" zone of the northwest leg of the Seattle low frequency radio range, about 11 nautical miles southeast of the Dungeness fan marker. This leg of the Seattle range defines the center of Amber Airway 1 between the Dungeness intersection and the range station. The minimum instrument en route altitude for this segment is 5,000 feet. Because of adverse weather and inaccessibility of the location, CAB investigators were unable to reach the scene until March 6. The investigators noted that the wreckage had been disturbed prior to their arrival; some components were missing, presumably carried away by persons unknown. The path of the aircraft during the final seconds of flight was clearly defined in the heavy timber growing on the steep slope against the aircraft smashed. The aircraft’s first contact with the trees was at a point 650 feet from the wreckage. From this point it cut a level swath on a heading of 106 degrees magnetic, the width of its wing span, into the steeply rising wooded slope at an elevation of approximately 1,500 feet m. s. l. The terrain immediately ahead of the aircraft‘s path rose to an altitude of 2,000. 2,100 feet MSL. ", "probable_cause": "The Board determines that the probable cause of this accident was a navigational error and poor judgment exhibited by the pilot in entering an overcast in a mountainous area at a dangerously low altitude. The following findings were reported:\r\n- No malfunction or emergency existed and the aircraft was intact prior to its initial contact with the mountain,\r\n- Several errors and omissions in the course of the flight Indicate the crew was lax and not giving proper attention to their duties,\r\n- A navigational error resulted in the aircraft being three to four miles west of the flight path assumed by the crew,\r\n- The pilot flew into instrument weather without obtaining a proper clearance,\r\n- The aircraft crashed in terrain obscured by clouds."}