{"url": "https://www.baaa-acro.com/crash/crash-embraer-er-145li-shanghai", "date": "Jun 7, 2013 at 1725 LT", "type": "Embraer ERJ-145", "operator": "China-Eastern-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Huai’an – Shanghai", "msn": "145-905", "yom": 2006, "flight_number": "MU2947", "city": "Shanghai-Hongqiao", "zone": "Shanghai", "country": "China", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 44, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Huai'an-Lianshui Airport, the crew initiated the approach to Shanghai-Hongqiao Airport in marginal weather conditions with light rain showers. After touchdown ont runway 18L, the crew started the braking procedure when the aircraft deviated to the left and veered off runway. While contacting soft ground, the nose gear collapsed and the aircraft slid for few dozen metres before coming to rest. All 49 occupants evacuated safely and the aircraft was damaged beyond repair. ", "probable_cause": "The cause of the runway excursion was foreign object debris inside the electrohydraulic servo valve (EHSV) that blocked a hydraulic port and caused an uncommanded nose wheel deflection to the left. Prior to the disassembly of the EHSV and discovery of the debris the unit had passed an acceptance test as performed on any newly manufactured unit. The NTSB reported that a number of pilots use binder brackets instead of the chart holders installed by Embraer to hold their binders (containing charts) etc., these binder brackets not having been approved by Embraer. The binder is directly above the nosewheel steering tiller, the NTSB wrote: \"The NTSB is concerned that a binder being held by an unapproved bracket may become dislodged, fall, and strike the tiller, engaging the nosewheel steering system and possibly providing a nosewheel steering input. If this happens during the landing roll, the nosewheel steering input could cause a runway excursion.\" The NTSB therefore recommended to study and revise the acceptance tests and to issue an operational bulletin to inform flight crew that the use of binder brackets is not approved and could create a hazardous situation if the binder becomes dislodged."}