{"url": "https://www.baaa-acro.com/crash/crash-yakovlev-yak-40-bratsk-18-killed", "date": "May 4, 1972 at 2334 LT", "type": "Yakovlev Yak-40", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Irkutsk - Bratsk", "msn": "9 04 03 14", "yom": 1970, "flight_number": "SU608", "city": "Bratsk", "zone": "Irkutsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 14, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 18, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1667, "circumstances": "The three engine aircraft departed Irkutsk-Magan Airport at 2229LT bound to the north, cruising at an altitude of 6,000 meters. Weather conditions en route were good. While descending to Bratsk Airport, the crew was informed about the last weather bulletin with no precipitations and a visibility of 50 km. However, during the night approach, weather conditions deteriorated with heavy mixed rain/snow showers and a visibility limited to one km. On short final, the airplane lost height then struck trees and crashed in flames 225 meters further, about 1,250 meters short of runway threshold. The airplane was destroyed by impact forces and a post crash fire and all 18 occupants were killed. ", "probable_cause": "It was determined that ATC in Bratsk transmitted to the crew a wrong weather bulletin that was referring to weather conditions at 2315LT. Unfortunately, ATC attempted without success to obtain an updated weather briefing and transmitted inaccurate information to the crew. On final, heavy snow/rain showers associated with downdraft and unfavorable winds caused the aircraft to lose height and to crash. The assumption that the crew inadvertently selected the reverse thrust during final approach was not ruled out. "}