{"url": "https://www.baaa-acro.com/crash/crash-lockheed-p2v-5-neptune-japan-sea-1-killed", "date": "Sep 4, 1954 at 1812 LT", "type": "Lockheed P-2 Neptune", "operator": "US%20Navy", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Atsugi - Atsugi", "msn": "426-5203", "yom": null, "flight_number": null, "city": "Japan Sea", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 10, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Lockheed P2V-5 Neptune was shot down by Soviet fighter airplanes. The aircraft operated on a routine patrol mission over the Sea of Japan. At 1758LT while the airplane was flying on a course of 090 degrees magnetic, over the high seas of the Sea of Japan, its position was approximately 41 degrees 51 minutes north and 132 degrees 47 minutes east. At 1807LT, the course was changed to 067 degrees magnetic. The ground speed of the aircraft at the time continued at approximately 180 knots and its altitude was approximately 8,000 feet. The course of 067 degrees had been continued for approximately five minutes, when at least two Soviet MiG fighter aircraft came up behind the Neptune aircraft, and opened fire. The pilot of the Neptune turned sharply to the right and went simultaneously into a steep dive at a rate of descent of approximately 2,000 to 3,000 feet per minute, attempting to fly farther and farther away from the Soviet land mass and seeking the protective cover of a cloud bank approximately ten miles farther away. The MiG aircraft again opened fire. The Neptune continued its steep dive and made evasive maneuvers to the right and left. The left wing was hit and a fire erupted. The fire continued to spread quickly through the wing to the fuselage, and when the Neptune had reached an altitude of 400 feet over water, the pilot determined that it was necessary to abandon the aircraft in the. The Neptune was landed on the sea and came to a complete stop within 50 to 70 yards after the initial impact. Of the ten members of the crew on board the Neptune aircraft, nine succeeded in making their way out of the aircraft to the surface of the sea and entered a survival raft which had been carried aboard. The United States claimed that the point of the first attack was over the high seas to the southeast of Cape Ostrovnoi, in the neighborhood of 42 degrees 22 minutes north and 134 degrees and 11 minutes east, or further to the south and east of that position, approximately 33 to 40 nautical miles from Soviet territory. All survivors were rescued by the crew of a USN SA-16 Albatross. \nCrew:\nRoger H. Reid, †\nJohn B. Wayne, \nJohn C. Fischer, \nWilliam A. Bedard, \nFrank E. Petty, \nAnthony P. Granera, \nTexas R. Stone, \nPaul R. Mulmollem, \nErnest L. Pinkevich,\nDavid A. Atwell.", "probable_cause": "Shot down by two Soviet MiG-15. "}