{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-90-dl-mt-bucks-elbow-26-killed", "date": "Oct 30, 1959 at 2040 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Piedmont%20Airlines2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Richmond – Charlottesville – Lynenburg – Roanoke", "msn": "20447", "yom": 1944, "flight_number": "PI349", "city": "Mt Bucks Elbow", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 24, "pax_fatalities": 23, "other_fatalities": 0, "total_fatalities": 26, "captain_hours": 5101, "captain_hours_type": 4771, "copilot_hours": 2858, "copilot_hours_type": 1678, "aircraft_hours": 26339, "circumstances": "About 2040, October 30, 1959, Piedmont Airlines Flight 349 crashed on Bucks Elbow Mountain located about 13 miles west of the Charlottesville-Albemarle County, Virginia, Airport. The crew of 3 and 23 of 24 passengers were killed; the sole survivor was seriously injured. The aircraft, a DC-3, N55V, was demolished by impact. From the available evidence it is the determination of the Board that this accident occurred during an intended instrument approach. More specifically, it occurred during the inbound portion of the procedure turn which was being flown 6 to 11 miles west of the maneuvering area prescribed by the instrument approach procedure. The Board concludes that the lateral error resulted from a navigational omission which took place when the pilot did not turn left about 20 degrees in conformity to V-140 airway at the Casanova omni range station. Consequently, when the pilots believed the flight was over the Rochelle intersection it was in fact 13 files northwest of tract position. As a result of this position, when the pilot turned left and flew the heading normally flown from Rochelle intersection, the path of the aircraft over the ground was displaced 8 to 11 miles west of the prescribed track. The Board further concludes that the error was undetected because tracking and other instrument approach requirements were not followed precisely. From information regarding the personal background of Captain and expert medical analysis of this information, it is the Board's opinion that preoccupation resulting from mental stress may have been a contributing factor in the accident cause.", "probable_cause": "The Board determines that the probable cause of this accident was a navigational omission which resulted in a lateral course error that was not detected and corrected through precision instrument flying procedures. A contributing factor to the accident may have been preoccupation of the captain resulting from mental stress."}