{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-eagle-pass", "date": "Oct 18, 1998 at 0600 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Critical%20Air%20Medicine", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Eagle Pass - San Antonio", "msn": "421C-1008", "yom": 1980, "flight_number": null, "city": "Eagle Pass-Maverick County", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2095, "captain_hours_type": 120, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4071, "circumstances": "During takeoff climb, the twin-engine airplane encountered a strong downdraft and impacted trees and terrain. The pilot reported that while taxiing to the runway, he scanned the sky with the monochrome weather radar, which was set at the 40-mile range. 'No weather was shown behind the runway and a cell was shown 15 miles from the runway.' The takeoff roll was 'uneventful,' and the airplane was rotated at 95 knots. Climb out was accomplished at 110 knots, the engines were at maximum power, the propellers at maximum RPM, and the manifold pressure was indicating maximum. A 10-degree turn towards the Cotulla VOR was being made when at 1,500 feet msl, a sharp descent was felt with the VSI indicating an 800 ft/min rate of descent. The wings were leveled and the airspeed was slowed to 85 knots. 'The rate of descent slowed to 400 ft/min and then finally to 300 ft/min until impact...' The airplane was destroyed by fire that erupted on impact. A review of doppler weather radar images showed thunderstorms in the vicinity of the airport. ", "probable_cause": "A downdraft, which exceeded the aircraft's climb performance. A factor was the thunderstorms in the vicinity of the airport. "}