{"url": "https://www.baaa-acro.com/crash/ground-accident-rockwell-sabreliner-80-fort-lauderdale", "date": "Feb 1, 2008 at 1542 LT", "type": "Rockwell Sabreliner 75", "operator": "Qualint", "flight_phase": "Taxiing", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Lauderdale - Brooksville", "msn": "380-42", "yom": 1976, "flight_number": null, "city": "Fort Lauderdale-Executive", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8500, "captain_hours_type": 350, "copilot_hours": 14400, "copilot_hours_type": 360, "aircraft_hours": 5825, "circumstances": "The Rockwell International Sabreliner had just been released from the repair station following several months of maintenance, primarily for structural corrosion control and repair. According to the pilots, they began to taxi away from the repair station. Initially, the brakes and steering were satisfactory, but then failed. The airplane then contacted several other airplanes and a tug with an airplane in tow, before coming to a stop. The airplane incurred substantial damage as a result of the multiple collisions. Neither crewmember heard or saw any annunciations to alert them to a hydraulic system problem. Postaccident examination revealed that there was no pressure in the normal hydraulic system, as expected, and that the auxiliary system pressure was adequate to facilitate emergency braking. Additional examination and testing revealed that the aural warning for low hydraulic system pressure was inoperative, but all other hydraulic, steering, and braking systems functioned properly. Both the pilot and copilot were type-rated in the Sabreliner, and each had approximately 350 hours of flight time in type. Neither crewmember had any time in Sabreliners in the 90 days prior to the accident. Operation of the emergency braking system in the airplane required switching the system on, waiting for system pressure to decrease to 1,700 pounds per square inch (psi), pulling the \"T\" handle, and then pumping the brake pedals 3 to 5 times. In addition, the system will not function if both the pilot's and copilot's brake pedals are depressed simultaneously. The investigation did not uncover any evidence to suggest the crew turned on the auxiliary hydraulic system, or waited for the system pressure to decrease to 1,700 psi  in their attempt to use the emergency braking system.", "probable_cause": "The depletion of pressure in the normal hydraulic system for an undetermined reason, and the pilots' failure to properly operate the emergency braking system. Contributing to the accident was an inoperative hydraulic system aural warning."}