{"url": "https://www.baaa-acro.com/crash/crash-iai-1125-astra-apx-atlanta", "date": "Sep 14, 2007 at 1719 LT", "type": "IAI 1125 Astra", "operator": "Hawk Flight", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Coatesville - Atlanta", "msn": "092", "yom": 1998, "flight_number": null, "city": "Atlanta-DeKalb-Peachtree", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10800, "captain_hours_type": 2200, "copilot_hours": 16042, "copilot_hours_type": 1500, "aircraft_hours": 4194, "circumstances": "The pilot-in-command (PIC) of the of the airplane was the flight department's chief pilot, who was in the right seat and monitoring the approach as the non-flying pilot. The second-in-command (SIC) was a captain for the flight department, who was in the left seat and the flying pilot. On arrival at their destination, they were vectored for an instrument-landing-system (ILS) approach to a 6,001-foot-long runway. Visibility was 1-1/4 miles in rain. The autopilot was on and a coupled approach was planned. After the autopilot captured the ILS, the airplane descended on the glideslope. The PIC announced that the approach lights were in sight and the SIC stated that he also saw the lights and disengaged the autopilot. The SIC turned on the windshield wipers and then lost visual contact with the runway. He announced that he lost visual contact, but the PIC stated that he still saw the runway. The SIC considered a missed approach, but continued because the PIC still had visual contact. The PIC stated, \"I have the lights\" and began to direct the SIC. He then \"took over the controls.\" The airplane touched down, the speed brakes extended and, approximately 1,000 feet later, the airplane overran the runway. The PIC stated that he was confused as to who was the PIC, and that he and the SIC were \"co-captains.\" When asked about standard operating procedures (SOPs), the PIC advised that they did not have any. They had started out with one pilot and one airplane, and they now had five pilots and two airplanes. The PIC later stated that they probably should have gone around when the flying pilot could not see out the window. The PIC added that the windshields had no coating and did not shed water. One year prior, while flying in rain, his vision through the windshield was blurred but he did not report it to their maintenance provider. Manufacturer's data revealed that the windshield was coated to enhance vision during rain conditions. The manufacturer advised that the coating might not last the life of the windshield and provided guidance to determine both acceptable and unacceptable rain repellent performance.", "probable_cause": "The pilot's failure to initiate a missed approach and his failure to obtain the proper touchdown point while landing in the rain. Contributing to the accident were the operator's lack of standard operating procedures and the inadequate maintenance of the windshield."}