{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-10-30-ilorin", "date": "Jan 10, 1987 at 1350 LT", "type": "Douglas DC-10", "operator": "Nigeria%20Airways-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lagos - Ilorin", "msn": "46968", "yom": 1977, "flight_number": null, "city": "Ilorin", "zone": "Kwara", "country": "Nigeria", "region": "Africa", "crew_on_board": 9, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 29487, "circumstances": "The flight originated from Lagos, Nigeria, at 1320LT hours local time as a training flight. The training flight commenced from Lagos with the trainee Captain on the left seat as the Pilot Flying while the Instructor Captain was on the right seat as Pilot-in-Command. The point of intended landing and subsequent trainings was Ilorin Airport. Flight preparation was completed by the crew and ground dispatchers with 60.3 metric tonnes of fuel up-lift giving an estimated endurance of 8 hours. The flight was normal up till the altitude of 3,000 feet when the aircraft was inside the control zone of Ilorin Control Tower which had cleared the aircraft for a touch and go on runway 05. At 1,000 feet agl the aircraft had its landing gears in the down position and landing flaps set at 35°. At 400 feet agl the autopilot was disconnected and later at 80 feet the autothrottles were also disconnected. The aircraft was fully established on the ILS. As the trainee captain was on his very first flight on the aircraft type, the Nigeria Airways DC-10 flight transition syllabus item 9 has it that the sequence of training at this point in time should be '3 engine or single land demonstration-Full stop'. As the aircraft had already requested and cleared for a touch and go and established on ILS, it was clear that item 9 had been skipped and item 10 '3 engine Flight Director ILS approach -Touch and Go' was in progress. The trainee captain crossed the 05 threshold rather high at about 60 feet or more and a long time, interspersed with instructions by the instructor captain, was spent before the aircraft had its main landing gears on the ground at about 2,913 feet (888 m) from the threshold. Runway 05 had a Landing Distance Available if 3,100 meters. It appeared that the trainee captain did not recede the throttles fully back for the touchdown and the Instructor had to assist in doing so. The trainee captain then appeared to be holding the nosewheel off the ground and again the Instructor had to push the control column down. On nosewheel touchdown, the trainee immediately requested for takeoff power. The Instructor went into the aircraft reconfiguration procedure after the landing and was still busy on the required settings when the trainee Pilot raised an alarm as the runway threshold was approaching. The Instructor looked out into the 900m of slight haze visibility, felt that the aircraft would not takeoff with the limited runway available and immediately reached out to deploy the spoilers at the same time stepped on the brakes. Abort takeoff was not announced. At this point in time the engine throttles had already been advanced for takeoff. The aircraft was on heavy braking from about 1,390 feet (424 meters) before runway end as it overran the runway. The aircraft made significant impacts with the ILS antenna bars, electrical switch posts and the approach light support structures of runway 23 all located on the runway 05 clearway before it came to a halt. The location of the accident site was 44 meters to the left of the centreline and 649 meters along the extended centreline. A fire erupted and consumed the fuselage. All nine crew members escaped uninjured. ", "probable_cause": "The probable cause of the accident is primarily the amount of runway consumed in effecting the landing coupled with the lack of knowledge, with certainty of the position of the throttle levers by both the instructor and the trainee pilot in a crucial moment of deciding either to continue the takeoff or abort. The breakdown of communication and coordination between the instructor, the trainee pilot and the trainee flight engineer led to the subsequent overrun.\r\nThe following contributing factors were reported:\r\n- The absence of uniform flight standards especially on procedures, within the Nigeria Airways Ltd. in that simulator trainings are not a progressive and logical sequence to flying the live aircraft.\r\n- The extent of the accident was aggravated by the repeated collisions with solidly constructed approach light supporting structures which caused the fire and the shoddy performance of the airport fire services.\r\n- The visibility was too close to the minima for a training flight."}