{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46e-1-cs-commando-chatsworth-35-killed", "date": "Jul 12, 1949 at 0743 LT", "type": "Curtiss C-46 Commando", "operator": "Standard%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "New York – Chicago – Kansas City – Albuquerque – Hollywood – Long Beach", "msn": "2936", "yom": 1945, "flight_number": "SD897R", "city": "Chatsworth", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 44, "pax_fatalities": 32, "other_fatalities": 0, "total_fatalities": 35, "captain_hours": 6038, "captain_hours_type": 2760, "copilot_hours": 4445, "copilot_hours_type": 30, "aircraft_hours": 1515, "circumstances": "Flight 897R originated at New York, New York, for Long Beach, California, with stops at Chicago, Illinois, Kansas City, Kansas, Albuquerque, New Mexico, and Burbank, California. A crew change was made at Kansas City. Departure from Kansas City was at 2321, July 11, and the flight proceeded through thunderstorm conditions to Albuquerque. Departure from Albuquerque, New Mexico, was at 0424, with 44 passengers, including two infants; 4 crew members, 875 gallons of gasoline, and 60 gallons of oil, and with a visual flight rules clearance. The total weight at time of departure was 39,746 pounds, which was within the certificated gross weight of the aircraft, and all disposable load was properly distributed so that the center of gravity of the aircraft was within the certificated limits. After leaving Albuquerque, considerable turbulence and thunderstorm conditions were encountered before clear weather was entered. At 0722 the flight contacted Riverside, California, INSAC, advised that at 0720 it was over Riverside at 9,000 feet, 500 on top, and requested a top report 2 for the vicinity of Burbank (about 67 miles to the west) which was given as 2,200 feet MSL. 3 The flight then filed an Instrument Flight Rules plan from its position direct to Burbank estimating arrival there at 0740. Clearance was issued by the Los Angeles Air Route Traffic Control Center as follows. \"ATC clears N79978 from present position to Simi Intersection direct cruise 500 on top, maintain 500 on top until advised by Burbank Control on 248 Kes., no delay--contact Burbank Approach Control when approaching Burbank.\" The first radio contact with the Burbank Tower was at 0735, at which time the flight reported its position as west of Riverside, and upon request the latest (0725) Burbank weather observation was given the pilot as \"measured ceiling 800 overcast, thin obscurement, visibility two miles, smoke.\" The tower advised the flight that another aircraft, a Cessna, was then over Chatsworth 4 inbound and that no delay was anticipated. At 0736 the Cessna reported that it was contact and was cleared to land. Immediately N79978 was contacted \"cleared to make straight-in approach to the aerodrome, Runway 7, Burbank altimeter three zero zero two, time cheek three six.\" The pilot acknowledged and advised that his position was \"approaching Burbank Range,\" but did not give his altitude. This was the last radio contact with the flight. No position report was made as actually over Burbank Range. At 0745, a California Central Airlines' DC-3, Flight 81, reported over the Burbank Range, and was directed to hold north-west of Simi, 500 on top, pending the landing of N79978. When N79978 failed to arrive, several calls were initiated to it by the tower but no response was heard. California Central's flight was then requested to search for the aircraft and sighted the burning wreckage about three miles west of the town of Chatsworth, California, in the Santa Susana Mountains at 0800. At that time, 17 minutes after the accident, the weather at the crash site was clear with a former cloud layer rapidly dissipating. The aircraft was destroyed by impact forces and a post crash fire and three crew members and 32 passengers were killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the pilot's action in descending below the prescribed minimum altitude while executing an instrument approach to the Burbank Airport.\r\nThe following findings were pointed out:\r\n- The passenger altercation had no direct effect on the safe operation of the aircraft,\r\n- The flight descended below the prescribed minimum altitude just before starting, or during, a procedure turn preparatory to letting down to Burbank Airport,\r\n- The aircraft struck terrain during the procedure turn while it was approximately 1,000 feet lower than it should have been under the prevailing weather conditions."}