{"url": "https://www.baaa-acro.com/crash/crash-bristol-175-britannia-313-nicosia-126-killed", "date": "Apr 20, 1967 at 0113 LT", "type": "Bristol Britannia", "operator": "Globe%20Air-1", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bangkok - Colombo - Bombay - Cairo - Zurich - Basel", "msn": "13232", "yom": 1957, "flight_number": null, "city": "Nicosia", "zone": "Nicosia", "country": "Cyprus", "region": "Europe", "crew_on_board": 10, "crew_fatalities": 9, "pax_on_board": 120, "pax_fatalities": 117, "other_fatalities": 0, "total_fatalities": 126, "captain_hours": 8285, "captain_hours_type": 1493, "copilot_hours": 9680, "copilot_hours_type": 49, "aircraft_hours": 20632, "circumstances": "The aircraft was on a non-scheduled flight from Bangkok to Base1 with scheduled stops at Colombo, Bombay and Cairo. The aircraft departed Bombay for Cairo on 19 April at 1312 hours GMT, with 11 hours and 10 minutes of fuel endurance and an estimated flight time for Cairo of 9 hours. According to the flight plan time, it was due to arrive in Cairo at 2212 hours. The alternate airport for the above sector was given as Beirut. At 2215 hours the aircraft was heard calling Nicosia but, due to distance and height, two-way communication with Nicosia on VHF could not be established until 2234 hours. In the meantime a message was received from Beirut advising Nicosia that the aircraft had entered the Nicosia FIR and had reported over position Red 18A at 2229 hours. From the Area Control radiotelephony tape recording, it is evident that the actual weather conditions at Nicosia at 2145 hours and 2245 h~.:rs were passed to the aircraft at 2238 hours and 2254 hours respectively. Details of the latter actual weather were passed again to the aircraft at 2300 hours by Approach Control. The aircraft came over the field at 2306 hours and was cleared for a right- hand circuit. At 2310 hours, when over the threshold of runway 32, the aircraft was slightly high and the captain decided to overshoot. He informed the tower and was cleared for a left-hand circuit. He further informed the tower that he would carry out a low circuit. The aircraft was momentarily seen by the controller during its final approach and the glare of its landing lights was visible through the low cloud when it made a pass over the runway in use and disappeared from view over the upwind end of the runway in the low cloud to the north-west. On his second attempt to land and while executing a low circuit, the aircraft collided with the ground at 0113LT, 3,5 km short of runway threshold. A crew member and three passengers were seriously injured while 126 other occupants were killed. The aircraft was totally destroyed by impact forces and a post crash fire. ", "probable_cause": "The accident resulted from an attempt to make an approach at a height too low to clear rising ground. The following findings were reported:\r\n- The reason why Captain Muller chose to land at Nicosia instead of Beirut which was on his flight plan and where the weather conditions were much better than Nicosia cannot be determined,\r\n- From date available concerning Capt. H.M. Day, it is obvious that he must be considered as a pilot under training in view of his limited hours on Britannias and as neither his Swiss nor his British licence was valid,\r\n- Under these conditions the flight time limitations for two pilots for turboprop aircraft had been exceeded by 2 hours and 47 minutes at the time of the accident. Furthermore this excess would be augmented to 4 hours and 17 minutes, taking into consideration the fact that the company considered the if hour preceding the scheduled take-off time on duty for flight time limitation purposes,\r\n- From the tape recordings it has been possible to establish,with the help of Globeair technical personnel who could recognize the speech recorded,the fact that during the flight of HB-ITB from Cairo to Nicosia, Capt. Muller and F/O Hippemeyer were in the flight deck,\r\n- From the data made available it can be said that the aircraft was airworthy and properly maintained and correctly loaded in Bombay for the flight,\r\n- No evidence of pre-crash failure was discovered and the radiotelephony contact with the tower from initial contact and up to the time of the crash was normal,\r\n- After overshoot procedures the pilot decided to make a visual low circuit,\r\n- The company's weather minima for circling at Nicosia are given as 1 000 ft cloud base and 4 km visibility. Using the Nicosia NDB for runway 27, the minima are 500 ft cloud base and 2.4 km visibility. "}