{"url": "https://www.baaa-acro.com/crash/crash-fairchild-c-123b-13-fa-provider-near-empire-9-killed", "date": "Sep 11, 1960 at 0830 LT", "type": "Fairchild C-123 Provider", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Mountains", "schedule": "Pope - Lowry - Hill - Hamilton", "msn": "20200", "yom": 1955, "flight_number": "USAF998", "city": "Empire", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was performing a flight from Pope AFB to Hamilton AFB with intermediate stops at Lowry AFB and Ogden-Hill AFB. The aircraft departed Lowry AFB at 0801LT. The crew completed to successives turns to the left then to the right and continued heading 270°. Few minutes later, the airplane entered a box canyon and was unable to gain sufficient height when it struck the slope of Mt Vasquez Peak (3,414 meters high). The aircraft was destroyed and all nine occupants were killed. ", "probable_cause": "It was determined that the accident was the consequence of wrong decision on part of the pilot who violated paragraph 12A (4), AF Reg 60-16 and entered a box canyon with insufficient altitude and lateral clearance from which to effect a safe recovery. The following contributing factors were reported:\r\n- A breach of air discipline, in that the pilot operated his aircraft for a distance of thirty-two miles at altitudes ranging from 500 feet down to 50 feet above the immediate terrain, in violation of Para 12A (3) AF regs 60-16,\r\n- Weather conditions may have been a contributing factor in that the forecast winds and turbulence indicate a probable adverse mountain wave effect on the aircraft immediately prior to impact."}