{"url": "https://www.baaa-acro.com/crash/crash-bac-111-529fr-buenos-aires-31-killed", "date": "May 7, 1981 at 1053 LT", "type": "BAc 111", "operator": "Austral-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "San Miguel de Tucumán - Buenos Aires", "msn": "212", "yom": 1970, "flight_number": "AU901", "city": "Buenos Aires-Aeroparque-Jorge Newbery", "zone": "Buenos Aires City", "country": "Argentina", "region": "South America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 26, "pax_fatalities": 26, "other_fatalities": 0, "total_fatalities": 31, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 21729, "circumstances": "Following an uneventful flight from San Miguel de Tucumán, the crew started the descent to Buenos Aires-Aeroparque-Jorge Newbury Airport. At 1035LT the Tower controller cleared the flight to descend to 750 metres to the San Fernando VOR and cleared the flight for a direct approach to runway 13 from the VOR. At 1040LT the flight reported over the OP VOR and was cleared to land. The wind had shifted from 6 knots at 60° to 12 knots at 030°. Visibility was reducing. At 1042LT the crew reported the runway in sight and obtained the current weather information, which included heavy rainfall, wind 360 degrees at 10 knots. The pilots lost sight of the runway and decided to abort the approach. The One-Eleven continued South to the Quilmes (ILM) NDB. The Tower controller cleared the flight to hold over the ILM beacon at 900 metres. Because of Cumulonimbus clouds over the NDB, the crew requested a holding pattern over the Río de la Plata at 600 metres. At 10:52 they were cleared for another straight in approach to runway 31. Shortly afterwards the pilots lost control of the plane, which crashed into the river. Just 55-65% of the wreckage was recovered; both FDR and CVR were not found after 42 days of searching. All 31 occupants were killed. ", "probable_cause": "Loss of control of the aircraft and impact with the water by an error of appreciation by the pilot in assessing the meteorological conditions on crossing through a zone of influence of an extremely violent cumulonimbus."}