{"url": "https://www.baaa-acro.com/crash/crash-consolidated-pb2b-1-canso-near-shearwater-1-killed", "date": "Jul 30, 1943 at 0557 LT", "type": "Consolidated Canso", "operator": "Royal-Canadian-Air-Force-31", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Shearwater - Shearwater", "msn": "22018", "yom": 1943, "flight_number": null, "city": "Shearwater", "zone": "Nova Scotia", "country": "Canada", "region": "North America", "crew_on_board": 8, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1065, "captain_hours_type": 84, "copilot_hours": 536, "copilot_hours_type": 241, "aircraft_hours": null, "circumstances": "The crew was briefing at 0500 hrs, started engines at 0540 and started the takeoff run at 0552. The aircraft take off weight was 33,426 lbs which was near the maximum allowable takeoff weight of 34,500. The aircraft became airborne after an abnormally long run and circled the area while climbing to 700’. As the direct route to the patrol area, Seaforth Channel, was closed by weather PO Joseph headed south via the west side of Lama Passage. The ceiling lowered so he descended to stay under the cloud. Suddenly the fog closed in and Joseph turned the aircraft to the left attempting to return to Base on a reciprocal course. His airspeed was 120 knots but altitude could not be maintained in the 35 degree turn like he used to do in a Stranraer. The aircraft was leveled off after turning through 120 degrees as they were getting close to the water. The aircraft was put into a steep climbing position at full power. They had started climbing in the patchy fog when the pilot saw a wooded ridge. They increased the rate of climb and the speed dropped to 70 knots and was down to 50 knots by the time they mushed into the 700’ mark on an 800’ ridge. On impact the a/c caught fire. They had been airborne a total of five minutes. \nCrew:\nP/O J. A. Joseph, pilot,\nF/Sgt K. L. Brown, copilot,\nP/O J. L. Jones, navigator,\nF/O R. B. Shirra, wireless operator and air gunner,\nSgt H. A. S. Rawlinson, wireless operator and air gunner,\nSgt E. A. Kershsaw,\nSgt J. A. Cowman, flight engineer, †\nLAC W. J. Johnston, flight engineer. \nSource: http://www.101nisquadron.org/?page_id=1539", "probable_cause": "The cause of the crash was assessed as pilot error because of an inability through the lack of experience on the type of aircraft, the pilot was unable to control the aircraft during the turn and was obliged to straighten out. He then realized the presence of hills ahead and attempted to clear them by climbing but was unable to. It would have been advisable to have landed straight ahead when he encountered the fog or to have climbed to 2,000’ and then proceeded to sea rather than attempting a turn at low altitude in a narrow channel with a heavily laden aircraft."}