{"url": "https://www.baaa-acro.com/crash/crash-sino-swearingen-sj30-2-near-loma-alta-1-killed", "date": "Apr 26, 2003 at 1005 LT", "type": "Sino Swearingen SJ30-2", "operator": "Sino%20Swearingen", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "San Antonio - San Antonio", "msn": "SJ-30-0002", "yom": 2000, "flight_number": "SSAC231", "city": "Loma Alta", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 12000, "captain_hours_type": 625, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 284, "circumstances": "The corporate jet was in a descent to attain a Mach 0.884 target speed during an airplane type certification flutter test. The airplane (a unique test bed) had a known speed-dependent tendency to roll right which was attributed to wing and aileron twist deviations. As the speed increased during the accident flight, the pilot had to apply full left aileron to be able to maintain airplane control. The airplane completed the test point about 30-degrees right-winglow, and subsequently began to roll to the right, \"like a barrel roll...not real fast,\" that the pilot reported he could not stop. Although the manufacturer’s engineering analysis (which did not include any high-speed wind tunnel testing) predicted positive lateral stability up to Mach 0.90, lateral control was lost during the accident flight, and the airplane rolled about 7 times during a 49-second timeframe, from about 30,500 feet until a near-vertical ground impact. A review of telemetry data revealed that, just before the rolls began, the airplane's elevator moved to the 3.5 degrees trailing-edge-up (TEU) position, and the airplane's heading deviated right. Less than 1 second later, the rudder moved from 2 degrees trailing-edge-left (TEL), to 6.5 degrees TEL, and the combination of the TEU elevator and the left rudder input coincided with a marked increase in airplane's right deviation. Elevator-up deflection and rudder-left defection were maintained, with some variation in magnitude, to nearly the end of the data. Because the known speed-dependent tendency to roll right had created significant control problems on a previous flight, the ailerons were removed, modified and replaced, and a Gurney flap was added to the right wing. After the addition of the Gurney flap, the lateral trim margin improved to about 40 percent required (where 50 percent was neutral) up to 305 KCAS. It was then determined that flutter testing could continue to higher airspeeds if the pilot needed to apply a \"small\" wheel force to augment the trim. The pilot had been instructed to reduce airspeed if there was a problem during the flutter testing, and had done so during an uncommanded roll to the left on the previous flight. Telemetry data from the accident flight revealed that at initiation of the upset, the pilot attempted to level the wings and raise the nose, but the airplane continued to diverge from stable flight, and it continued to accelerate beyond the airplane’s demonstrated flight diving speed. It is undetermined if the pilot could have reduced the speed of the airplane in time, during the initiation of the upset, so that the airplane would not diverge. After the accident, the company conducted high-speed wind tunnel tests, and found that lateral stability decreased with increasing Mach and angle of attack (AOA).  Lateral stability became negative (unstable) above Mach 0.83, and rudder input intended to augment lateral trim above a certain Mach could aggravate the situation. In addition, a TEU elevator input would increase AOA, and also result in deteriorated lateral stability. High speed wind tunnel data also revealed that roll authority deteriorated above Mach 0.86, and by Mach 0.88, the aileron upper and lower surfaces were both in separated flow regions. The follow-on flutter test airplane, which successfully completed the certification requirements, was equipped with vortex generators and thicker trailing-edge ailerons. It also did not require the external trim device needed on the accident airplane due to improvements in manufacturing.", "probable_cause": "The manufacturer's incomplete high-Mach design research, which resulted in the airplane becoming unstable and diverging into a lateral upset."}