{"url": "https://www.baaa-acro.com/crash/crash-learjet-23-detroit-3-killed", "date": "Jul 22, 1991 at 2115 LT", "type": "Learjet 23", "operator": "Jetstream International Inc.", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Detroit - Chicago", "msn": "23-045", "yom": 1965, "flight_number": null, "city": "Detroit-City (Coleman A. Young)", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 9000, "captain_hours_type": 2600, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A lineman noted parking brake (p/b) was set before flight. Pilots began takeoff on 5,147 feet runway with 10 knots crosswind. A witness said aircraft rotated for takeoff about 4,500 feet down runway and lifted off about 50 feet later. Reportedly, it remained low and slow (20-60 feet agl) after lift-off, then banked (rocked) left and right in nose high attitude, settled, hit trees and crashed abt 200 feet beyond runway. One person said aircraft went out of control before impact; another said it was 'in or on the edge of stalled flight.' Examination showed rotational damage occurred in both engines during impact. The braking systems had evidence that p/b control valve was partially on; brake torque tube contained heat blueing. On this early model (Learjet 23/sn: 23-45a), p/b had to be released by depressing brake pedals first; pilot handbook did not address this. On later models (sn: 23-050 and up), p/b needed only to be moved 'off.' Investigations showed left seat pilot had training in later models (Learjet 24/25); but only a biennial flight review was noted in the model 23. Company dispatcher said no training would have been performed on accident flight (with passenger aboard). Aircraft was about 430 lbs over max weight limit. All three occupants were killed. ", "probable_cause": "Improper preflight by the pilot, his failure to abort the takeoff while there was sufficient runway remaining, and his failure to assure that the aircraft attained sufficient airspeed for lift-off and climb. Factors related to the accident were: the pilot's failure to assure the aircraft was within its maximum weight limitation, his improper use of the parking brake, and insufficient information in the pilot operating handbook concerning the aircraft parking brake."}