{"url": "https://www.baaa-acro.com/crash/crash-avro-748-2-207-bangkok-44-killed", "date": "Apr 27, 1980 at 0655 LT", "type": "Avro 748", "operator": "Thai-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Nakhon Phanom – Udon – Khon Kaen – Bangkok", "msn": "1568", "yom": 1964, "flight_number": "TG231", "city": "Bangkok", "zone": "Bangkok City District", "country": "Thailand", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 49, "pax_fatalities": 40, "other_fatalities": 0, "total_fatalities": 44, "captain_hours": 18096, "captain_hours_type": 7796, "copilot_hours": 24372, "copilot_hours_type": 11899, "aircraft_hours": 12791, "circumstances": "On 27 April 1980, HS-748 Series 11, HS-THB was on a scheduled domestic passenger flight. The flight operated the route Bangkok - Khon Kaen - Udon - Nakhon Phanom - Udon - Khon Kaen - Bangkok. The departure flight was flight number TG221 which departed Bangkok International Airport at 0101 h, arrived Khon Kaen Airport at 0210 h, departed Khon Kaen Airport at 0233 h, arrived Udon Airport at 0251 h, departed Udon Airport at 0309 h, arrived Nakhon Phanom Airport at 0349 h. The return flight, flight number TG231, departed Nakhon Phanom Airport at 0408 h, arrived Udon Airport at 0448 h, departed Udon Airport at 0507 h, arrived Khon Kaen Airport at 0532 h, departed Khon Kaen Airport at 0550 h, ETA Bangkok International Airport at 0656 h. At 0559 h, after take-off from Khon Kaen Airport, the pilot reported to Bangkok Area Control Centre that he was climbing to 6 000 ft, ETA Korat at 0626 h, ETA Bangkok International Airport at 0656 h and requested ATC clearance to Bangkok International Airport via W6 - KT - W1 - BKK. Bangkok Area Control Centre cleared HS-THB to Bangkok International Airport via this route, to maintain FL 120 and asked the pilot to report when the aircraft reached FL 120.\r\n- At 0614 h the pilot reported that HS-THB reached FL 120. \r\n- At 0626 h the pilot reported that the aircraft was over KT. \r\n- AT 0627 h Bangkok Area Control Centre informed the pilot that HS-THB was in radar contact, 5 miles northwest of KT. \r\n- At 0642 h Bangkok Area Control Centre cleared HS-THB to descend to 8 000 ft and informed the pilot that the altimeter setting was 1 008 mb. This was acknowledged by the pilot. \r\n- At 0644 h, Bangkok Area Control Centre advised the pilot to contact Bangkok Approach Control on 119.1 MHz. \r\n- At 0644 h, the pilot contacted Bangkok Approach Control and reported that he was maintaining 8 000 ft. Bangkok Approach Control advised the pilot to descend to 6 000 ft and informed him that the altimeter setting was 1 008 mb. This was acknowledged by the pilot. \r\n- At 0648 h Bangkok Approach Control advised HS-THB to descend to 6 000 ft. \r\n- At 0651 h Bangkok Approach Control advised HS-THB to descend to 1 500 ft. \r\n- At 0653 h the pilot reported that HS-THB had reached 1 500 ft. \r\n- At 0654 h Bangkok Approach Control informed the pilot that HS-THB was 7 miles from the Outer Marker and cleared the aircraft to make an ILS approach to runway 21R. This was acknowledged by the pilot. \r\n- At 0656 h Bangkok Approach Control advised the pilot to contact Bangkok Tower on 118.1 MHz but no answer from the pilot was received. Bangkok Approach Control tried to contact HS-THB until 0709 h but no answer was received. HS-THB operated in good weather conditions on both the outbound and return flights until, descending to runway 21R nearly at the airport, it encountered an area of rain. Later, HS-THB lost altitude rapidly. Many things in the passenger cabin fell to the cabin floor. It was raining with hail. Looking through the windows, some passengers saw grey clouds. Then the aircraft could maintain altitude. Thirty seconds later it again lost altitude, more severely than the first time. Finally it crashed into a paddy field and skidded forward about 510 feet. Fire occurred in both wings for a while. The accident site was 8 NM northeast of Bangkok International Airport. ", "probable_cause": "The pilot directed the aircraft into a thunderstorm in an early dissipating stage. The aircraft was severely affected by a downdraft and lost altitude rapidly. At that time the altitude of the aircraft was only 1500ft and the pilot could not maintain altitude of the aircraft. The aircraft crashed into the ground and ran forward.\r\nFactors which caused the pilot to direct the aircraft into the thunderstorm were:\r\n1. During flight prior to the accident, the pilot did not tune his radio to the ATIS frequency, so he did not receive the special weather report (SPECI) broadcast four minutes before the accident advising that there was a thunderstorm in the area he would soon encounter.\r\n2. The pilot did not make use of airborne weather radar.\r\n3. While the pilot was approaching at high altitude, he could see the thunderstorm, but it was not in his flight path to Bangkok International Airport. When the pilot was descending in compliance with Bangkok Approach Control instruction, he was not aware that the rain area which he was entering was a thunderstorm which was moving and developing severely. The thunderstorm which had developed to the severe stage was moving and intercepted the aircraft.\r\n4. The pilot assumed that flying by radar vector would be safe as he thought that the Approach Control Radar could detect the thunderstorm and Bangkok Approach Control would not vector the aircraft into the thunderstorm."}