{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-near-clarksville-1-killed", "date": "Mar 5, 1998 at 0519 LT", "type": "Cessna 208B Grand Caravan", "operator": "FedEx", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Memphis - Bowling Green", "msn": "208B-0142", "yom": 1988, "flight_number": "FDX8315", "city": "Clarksville", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 8398, "captain_hours_type": 5198, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4079, "circumstances": "The flight was in radio contact with air traffic controllers at the FAA Memphis Air Route Traffic Control Center (ARTCC), and was level at 9,000 feet, when the pilot checked in on frequency. The last radio contact with the flight was at 0447. At 0520, radar contact was lost. The airplane impacted in rough terrain, at a steep angle of impact. Two other company pilots flying in trail of the accident aircraft said, they had radio contact with the pilot of N840FE about 5 minutes before the accident. They said he sounded fine and did not say anything about any problems. Radar data showing the flight's ground speed indicated that at 0512, the ground speed was 158 knots (182 mph). The ground speed then decreased to 153 (176 mph), 143 (165 mph), 138 (159 mph), and 132 (152 mph), until at 0519:40, when the ground speed of the flight was 125 knots (144 mph). After the radar read out at 0519:40, the next radar hit was coast (no information), and then the flight disappeared from the radar scope. The airplane's heading and altitude did not change during the decrease in ground speed. According to the NTSB Radar Data Study, calculated flight parameters indicated the airplane \"...experienced a slow reduction of airspeed in the final 8 minutes of flight at altitude, and then abruptly exhibited a sharp nose down pitch attitude with a rapid increase in airspeed.\" About the time of the reduction in airspeed, pitch angle began to slowly increase also. When radar contact was lost, the calculated airspeed had reduced to less then 102 knots [118 mph], and calculated body angle of attack [AOA] had increased to 8.8 degrees. A large reduction in pitch angle, angle of attack, and flight path angle as the airspeed increases after peak AOA was reached. Examination of the engine Power Analyzer and Recorder (PAR) revealed that no exceedences were in progress at the time power was removed from the PAR. It was determined that no caution timing events were in progress. The PAR computer appeared to be operating correctly until power was removed at impact. Examination of the airplane's autopilot were not conclusive due to impact damage. Determination of whether the autopilot was engaged or not engaged at the time of the accident could not be determined. The NTSB Meteorological Factual Report revealed that at 0515, about 7 minutes before the flight was lost on radar, the radiative temperature in an area centered at Clarksville (4 kilometer resolution data), showed that the Mean Radiative Temperature was -6.26 degrees C (21F). The Minimum Radiative Temperature was -6.66 degrees C (19F). The Maximum Radiative Temperature was -6.06 degrees C (21F). According to the Archive Level II Doppler weather radar tape for a beginning sweep time of 0508:10, showed that N840FE had tracked into a weather echo from 0510:34, to 0516:28. The Doppler Weather Radar data, revealed that N840FE, had entered a weak weather echo about the same time that the airspeed of the airplane started to decrease, at an altitude of about 9,000 feet, and the airplane was in the weak weather echo for a few minutes. Based on the weather data, it was determined that in-flight airplane icing conditions were encountered by N840FE. Cessna Aircraft Company Airworthiness Directive (AD) 96-09-15; Amendment 39-9591; Docket No. 96-CE-05-AD, applicable to this airplane and complied with by the company, on December 12, 1996, stated: \"...to minimize the potential hazards associated with operating the airplane in severe icing conditions by providing more clearly defined procedures and limitations associated with such conditions... operators must initiate action to notify and ensure that flight crewmembers are apprised of this change...revise the FAA-approved Airplane Flight Manual (AFM) by incorporating the following into the Limitation Section of the AFM. This may be accomplished by inserting a copy of this AD in the AFM....\" The airplane was equipped with leading edge deicing boots on the wings, elevators, struts, and had a cargo pod deicing capability. Lights were installed to illuminate the leading edge of the wings, to aid the pilot in detecting ice on the leading edges of the wings during night operations. The airplane was not equipped with an ice detection device. ", "probable_cause": "The pilot did not maintain control of the airplane due to undetected airframe ice, resulting in an inadvertent stall, and subsequent impact with the ground. Factors in this accident were; flight into clouds, below freezing temperatures, and the inability of the pilot to detect ice, due to the lack of an ice detection system to determine ice build up on portions of the airframe that are not visible from the cockpit. "}