{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-25-marquise-hillsboro-4-killed", "date": "May 24, 2005 at 1752 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "Max Aviation - USA", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Hillsboro – Salem", "msn": "266", "yom": 1973, "flight_number": null, "city": "Hillsboro", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 2170, "captain_hours_type": 551, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3970, "circumstances": "Witnesses observed the aircraft perform a rolling takeoff and it was airborne by the crossing runway (1,300 feet down the 6,600 foot runway). The aircraft entered an approximate 40 degree nose high climb rate to about 1,000 feet. The aircraft then entered a steep left hand banking turn. The nose dropped and the aircraft rotated up to about 4 times before colliding with the flat terrain adjacent to the departure end of the runway threshold. On site documentation of the airframe found no evidence of a flight control malfunction. An engine examination and teardown found that the gearbox section of the left engine experienced a high cycle fatigue failure of the high speed pinion journal bearing oil supply tube and subsequent degradation of the high speed pinion journal bearings. This failure resulted in a partial power loss to the left engine. The pilot had recently purchased this aircraft and he had accumulated approximately 11 hours since the purchase. The pilot had stated to personnel at the place where he purchased the aircraft that he had not received, nor did he need recurrent training in this aircraft as he had several thousand hours in the aircraft. Flight logs provided by the family indicated that the pilot had accumulated about 551 hours in a Mitsubishi, however, the last time that the pilot had flown this make and model was 14 years prior to the accident. Logbook entries indicated that only a few hours of flight time had been accumulated in all aircraft during the approximately 2 years prior to the accident. Personnel that flew with the pilot in the make and model aircraft involved in the accident described the pilot as \"proficiency lacking.\" Normal takeoff calculations for the aircraft with the flaps configured to 5 degrees, indicated a ground run of 2,900 feet, with a rotation speed of 106 KCAS, and 125 KCAS for the climb out. A maximum pitch attitude of 13 degrees maximum is indicated. Performance calculations indicated that the aircraft was capable of lifting off where the witnesses observed and climbing to 1,000 feet agl by the end of the runway. To achieve this performance the aircraft would have rotated at approximately 84 KCAS and climbed at an airspeed below Vmc (100 KCAS) and close to power-off stall speed (86 KCAS) with 5 degrees of flaps. The airplane's flight manual indicated that if an engine failure occurs in the takeoff climb and the landing gear is fully retracted, the emergency procedures is to maintain 140 KCAS, flaps to 5 degrees, the failed engine condition lever to EMERGENCY STOP, and failed engine power lever to TAKEOFF. On site documentation found the left side condition lever in the takeoff/land position and the power lever was found half-way between takeoff and flight idle.", "probable_cause": "The pilot's failure to obtain minimum controllable airspeed during the takeoff climb, which resulted in a loss of aircraft control when the left engine lost partial power. A fatigue failure to an oil tube, which resulted in the partial power loss to the left engine, procedures/directives not followed by the pilot, and the pilot's lack of recent experience and no recurrent training in the type of aircraft were factors."}