{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh84-dragon-near-borumba-dam-6-killed", "date": "Oct 1, 2012 at 1413 LT", "type": "De Havilland DH.84 Dragon", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Monto - Caboolture", "msn": "6077", "yom": 1934, "flight_number": null, "city": "Borumba Dam", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 1134, "captain_hours_type": 662, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At about 1107 Eastern Standard Time on 01OCT2012, a de Havilland Aircraft Pty Ltd DH-84 Dragon, registered VH-UXG (UXG), took off from Monto on a private flight to Caboolture, Queensland under the visual flight rules (VFR). On board the aircraft were the pilot/owner and five passengers. The weather conditions on departure were reported to include a light south-easterly wind with a high overcast and good visibility. Sometime after about 1230, the aircraft was seen near Tansey, about 150 km north-west of Caboolture on the direct track from Monto to Caboolture. The aircraft was reported flying in a south-easterly direction at the time, at an estimated height of 3,000 ft and in fine but overcast conditions. At 1315, the pilot contacted Brisbane Radar air traffic control (ATC) and advised that the aircraft’s position was about 37 NM (69 km) north of Caboolture and requested navigation assistance. At 1318, the pilot advised ATC that the aircraft was in ‘full cloud’. For most of the remainder of the flight, the pilot and ATC exchanged communications, at times relayed through a commercial flight and a rescue flight in the area due to the limited ATC radio coverage in the area at low altitude. At about 1320, a friend of one of the aircraft’s passengers received a telephone call from the passenger to say that she was in an aircraft and that they were ‘lost in a cloud’ and kept losing altitude. Witnesses in the Borumba Dam, Imbil and Kandanga areas 70 to 80 km north-north-west of Caboolture later reported that they heard and briefly saw the aircraft flying in and out of low cloud between about 1315 and 1415. At 1348, the pilot advised ATC that the aircraft had about an hour’s endurance remaining. The pilot’s last recorded transmission was at 1404. A search for the aircraft was coordinated by Australian Search and Rescue (AusSAR).  The aircraft wreckage was located on 3 October 2012, about 87 km north-west of Caboolture on the northern side of a steep, densely wooded ridge about 500 m above mean sea level. The Australian Transport Safety Bureau (ATSB) later determined that the aircraft probably impacted terrain at about 1421 on 01OCT2012. Preliminary analysis indicated that the aircraft collided with trees and terrain at a moderate to high speed, with a left angle of bank. The aircraft’s direction of travel at impact was toward the south-south-west.", "probable_cause": "From the evidence available, the following findings are made with respect to the visual flight rules into instrument meteorological conditions accident involving de Havilland Aircraft Pty Ltd DH-84 Dragon, registered VH-UXG, that occurred 36 km south-west of Gympie, Queensland, on 1 October 2012. These findings should not be read as apportioning blame or liability to any particular organisation or individual. Safety issues, or system problems, are highlighted in bold to emphasize their importance. A safety issue is an event or condition that increases safety risk and (a) can reasonably be regarded as having the potential to adversely affect the safety of future operations, and (b) is a characteristic of an organisation or a system, rather than a characteristic of a specific individual, or characteristic of an operating environment at a specific point in time.\r\nContributing factors:\r\n- The pilot unintentionally entered instrument meteorological conditions and was unable to reattain and maintain visual conditions.\r\n- It is likely that the pilot became spatially disoriented and lost control due to a combination of factors such as the absence of a visible horizon, cumulative workload, stress and/or distraction.\r\nOther factors that increased risk:\r\n- Though it probably did not have a significant bearing on the event, the aircraft was almost certainly above its maximum take-off weight (MTOW) on take-off, and around the MTOW at the time of the accident.\r\n- Though airborne search and rescue service providers were regularly tasked to provide assistance to pilots in distress, there was limited specific guidance on the conduct of such assistance. Other findings:\r\n- The aircraft wreckage was not located for 2 days as the search was hindered by difficult local weather conditions and terrain, and the cessation of the aircraft’s emergency beacon due to impact damage."}