{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-209f-brussels", "date": "May 25, 2008 at 1331 LT", "type": "Boeing 747-200", "operator": "Kalitta%20Air-2", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Brussels – Bahrain", "msn": "22299/462", "yom": 1980, "flight_number": "CKS207", "city": "Brussels", "zone": "Flemish Brabant", "country": "Belgium", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15000, "captain_hours_type": 3000, "copilot_hours": 7000, "copilot_hours_type": 200, "aircraft_hours": 108560, "circumstances": "The flight crew arrived at Brussels the day before the accident, with a flight from Bahrain. The crew rested until the Sunday morning. The aircraft arrived at Brussels on Sunday with another crew; the two crews exchanged some information regarding the airplane. There were no mechanical problems reported. Runway 20 was in service for take-offs, while Runway 25L was mostly used for landings. The pilot performed the pre-flight inspection; he found only minor discrepancies (left inner tire check and E&E door latch down). The pre-flight briefing covered the standard departure call-outs, the runway incursion information, a discussion on the Runway 20 length, etc.. The crew also briefed about the engine failure procedures for an engine failure prior to V1, and they also briefed about an abort takeoff after V1 if there was a dangerous situation that would not allow the airplane to fly. After completing the flight documents, the crew requested an early departure, which they received. For the computation of the take-off parameters, the crew used the Kalitta Air On-board Performance System (OPS computer). The crew determined they needed the full length of the runway for take-off. The airplane taxied towards the B1 intersection for the Runway 20. After a few minutes, waiting for another airplane to land on Runway 25, they lined up on Runway 20, making a tight turn, in order to gain a few meters with respect to the usual departure position. The airplane was cleared for take-off at 11:29. The pilot pushed the throttles forward and checked the engines were stable. The Flight Engineers then set the engine power for take-off (setting “normal”, also known as “reduced thrust”). The aircraft started to accelerate. The standard call-out were made when the speed reached the determined value. \r\n- “airspeed”\r\n- 80 knots\r\n- V1\r\nA few seconds after reaching V1, the engine N°3 ingested a bird. Approximately 5 seconds after V1, the engine N°3 stalled and caused a loud “bang”, and a vibration felt in the cockpit. The pilot stated he had the feeling that the aircraft was no longer accelerating, and decided to abort the take-off. Two seconds after having heard the detonation, the thrust levers were brought back to idle, and braking action was initiated. The thrust reversers were not deployed. The FO called the tower, and notified the aircraft was going to the overrun. The pilot turned the aircraft a few degrees to the right, in order to avoid the approach lights at the end of the runway. The aircraft left the runway at a speed of approximately 72 Knots. The aircraft reached a first embankment, dropping from a height of 4 m, and broke in three parts. The aircraft came to a stop just above the top of the railroad embankment. The crew exited the airplane through the service door since the L1 door normally used was blocked due to deformation of the structure.", "probable_cause": "The accident was caused by the decision to reject the takeoff 12 knots after passing V1 speed. The following factors contributed to the accident:\r\n- Engine Nr 3 experienced a bird strike, causing it to stall. This phenomenon was accompanied by a loud bang, noticed by the crew.\r\n- The aircraft line up at the B1 intersection although the take-off parameters were computed with the full length of the runway.\r\n- The situational awareness of the crew,\r\n- Less than maximum use of deceleration devices.\r\n- Although the RESA conforms to the minimum ICAO requirement, it does not conform to the ICAO recommendation for length. "}