{"url": "https://www.baaa-acro.com/crash/crash-handley-page-hp137-jetstream-iii-loveland-13-killed", "date": "Apr 17, 1981 at 1601 LT", "type": "Handley Page H.P.137 Jetstream", "operator": "Air US", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Denver - Gillette", "msn": "238", "yom": 1969, "flight_number": "US716", "city": "Loveland", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": 4784, "captain_hours_type": 1784, "copilot_hours": 2280, "copilot_hours_type": 210, "aircraft_hours": 3795, "circumstances": "Air US Flight 716 departed Denver-Stapleton, CO at 15:46 for a flight to Gillette, WY. At 15:59 Flight 716 contacted Denver Center to request to maintain FL130, which was approved. In the same area a Cessna TU206 (N4862F, operated by Sky's West Parachute Center) was climbing in a racetrack pattern over Fort Collins/Loveland Municipal Airport to an altitude of FL155. The Cessna had departed this airport at 15:30 for the second parachute jump flight of the day. The Cessna was in a climbing left turn on a north-westerly heading when it was hit by the Air US Jetstream. The No. 1 propeller of the Jetstream cut through the aft fuselage section of the Cessna resulting in immediate loss of control to both aircraft. Two of the skydivers were killed inside the aircraft during the collision. The pilot and three parachutists fell free of the aircraft and parachuted to the ground. The remains of the Cessna descended out of control and crashed in an open field. The Jetstream impacted the ground in a nearly vertical pitch attitude in an open field about 4,000 feet northeast of the Cessna wreckage.", "probable_cause": "The failure of the Cessna pilot to establish communications with the Denver Center and his climbing into controlled airspace above 12,500 feet without an authorised deviation from the altitude encoding transponder (Mode-C) requirement, the practice of the Denver Center of routinely condoning Sky's West parachute jump operations above 12,500 feet without a Mode-C transponder and the failure of the pilots of both aircraft to \"see and avoid\" each other. Contributing to the accident was the fact that existing regulations do not prohibit parachute jumping in, or immediately adjacent to, Federal airways."}