{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh4a-folkestone-1-killed", "date": "Jan 25, 1921 at 1433 LT", "type": "De Havilland DH.4", "operator": "SNETA", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Croydon - Brussels", "msn": "H5915", "yom": 1920, "flight_number": null, "city": "Folkestone", "zone": "Kent", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot Prosper Georges was performing a cargo flight from Croydon to Brussels on behalf of SNETA, the Syndicat National pour l'Étude du Transport Aérien. The aircraft departed Croydon Airport at 1343LT and continued towards the east. While approaching The Channel, the visibility dropped due to mist and the pilot decided to return. During the last turn, the aircraft hit a hill near the pub called 'The Valiant Sailor' and crashed. The pilot was seriously injured and died from his injuries three days later.", "probable_cause": "The Investigation Report for the incident says that the cargo was a mere 8.5lbs in weight and 150lbs of ballast. Mons.George was a very experienced pilot and had flown that type of aircraft on the same route many times before. O-BAIN was seen approaching the Dover-Folkestone road from the west and was dimly seen passing just over the roof of a farmhouse. It then turned to starboard, towards rising ground, and crashed in a field 546 feet above sea level. Just before impact it was noted that the engine appeared to be running satisfactorily. Examination of the wrecked Airco showed that the starboard plane had struck the ground first, an interplane and part of the bottom wing tip being embedded in the earth. From that point to where the main wreckage lay, a distance of 90 yards, the collapse of the parts of the machine could be traced from the marks on the ground. The entire fuselage was shattered as far back as the passengers cabin. All control cables were found to be intact and in serviceable condition. The accident was blamed on poor visibility. \n\r\nSource: ASN."}