{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-11f-riyadh", "date": "Jul 27, 2010 at 1138 LT", "type": "McDonnell Douglas MD-11", "operator": "Lufthansa%20Cargo", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Frankfurt - Riyadh", "msn": "48431/534", "yom": 1993, "flight_number": "LH8460", "city": "Riyadh-King Khaled", "zone": "Manţiqat ar Riyāḍ (منطقة الرياض)", "country": "Saudi Arabia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8270, "captain_hours_type": 4466, "copilot_hours": 3444, "copilot_hours_type": 219, "aircraft_hours": 73247, "circumstances": "The airplane operated on Flight LH8460, a scheduled cargo service operating from Frankfurt (FRA) to Riyadh (RUH). It carried 80 tons of cargo. The accident flight departed Frankfurt about 05:16 local time (03:16 UTC), 2.5 hours later than originally scheduled due to minor maintenance issues. The accident flight was the first time the captain and first officer had flown together. The captain decided that the first officer, who had been employed with Lufthansa Cargo for 7 months and had not flown into Riyadh before, would fly the leg because he believed it would be an easy leg appropriate for the first officer. Cruise flight and approach to Riyadh were uneventful. The first officer indicated that he completed the approach briefing about 25 minutes before landing, calculating that he would use a flap setting of 35°, target 72 percent N1 rpm on final approach, expect a pitch attitude of about 4.5° on final approach, and commence the flare about 40 feet above ground level (agl). The flight was radar vectored to the instrument landing system of runway 33L, and the first officer flew the approach with a planned Vref of 158 knots. Convective conditions prevailed, with a temperature of 39°C and winds at 15 to 25 knots on a heading closely aligned with the landing runway. The aircraft was centered on the glide slope and localizer during the approach, until 25 seconds before touchdown when it dipped by half a dot below the glide slope. During that period, the indicated airspeed oscillated between 160 and 170 kt, centered about 166 kt. The ground speed was 164 kt until 20 sec. prior to touchdown, when it began to increase and reached 176 kt at touchdown. The flare was initiated by the first officer between 1.7 and 2.0 sec. before touchdown, that is: 23 to 31 feet above the runway. The main gear touchdown took place at 945 ft from the runway threshold at a descent rate of -13 ft/sec. (780 ft/min) resulting in a normal load factor of 2.1g. The aircraft bounced with the main gear reaching a maximum height of 4ft above the runway with the spoilers deployed to 30 degrees following main-wheel spin up. During this bounce, the captain who was the Pilot Monitoring (PM) pushed on the control column resulting in an unloading of the aircraft. The aircraft touched down a second time in a flat pitch attitude with both the main gear and nose gear contacting the runway, at a descent rate of -11 ft/sec. (660 ft/min), achieving a load factor of 3.0g. Just prior to this second touchdown, both pilots pulled on the control column, which combined with the rebound of the nose gear from the runway, resulted in a 14° pitch angle during the second bounce. Additionally, the spoilers reached their full extension of 60° following the compression of the nose gear strut during the second touchdown. During this second bounce, the main gear reached a height of 12 ft above the runway. Early in this second bounce, the captain pushed the control column to its forward limit and the elevators responded accordingly. Prior to the third and final touchdown, both pilots pulled back on the control column at slightly different times. Although the elevators responded accordingly and started to reduce the nose-down pitch rate, the aircraft was still pitching down at the third touchdown. During this third touchdown, the aircraft contacted the runway at a descent rate of -17 ft/sec (1020 ft/min), thus achieving a load factor of 4.4g. At this point, the aft fuselage ruptured behind the wing trailing edge. Two fuel lines were severed and fuel spilled within the left hand wheel well. A fire ignited and travelled to the upper cargo area. The captain attempted to maintain control of the aircraft within the runway boundaries. Not knowing about the aft fuselage being ruptured and dragging on the runway, the captain deployed the engine thrust reversers, but only the no. 1 and the no. 3 engines responded. The captain maintained directional control of the aircraft as best he could and requested the First Officer to declare a Mayday. The aircraft then went towards the left side of the runway as the captain attempted, without success, to maintain the aircraft on the runway. As the aircraft departed the runway, the nose gear collapsed and the aircraft came to a full stop 8800 ft from the threshold of the runway and 300 ft left from the runway centerline. The fuel to the engines was cut off and both pilots evacuated the aircraft by using the slide at the Left One (L1) door. The mid portion of the aircraft was on fire.\n", "probable_cause": "Cause Related Findings:\r\n1. The flight crew did not recognize the increasing sink rate on short final.  \r\n2. The First officer delayed the flare prior to the initial touchdown, thus resulting in a bounce. \r\n3. The flight crew did not recognize the bounce.  \r\n4. The Captain attempted to take control of the aircraft without alerting the First Officer resulting in both flight crews acting simultaneously on the control column. \r\n5. During the first bounce, the captain made an inappropriate, large nose-down column input that resulted in the second bounce and a hard landing in a flat pitch attitude. \r\n6. The flight crew responded to the bounces by using exaggerated control inputs.  \r\n7. The company bounced-landing procedure was not applied by the flight crew."}