{"url": "https://www.baaa-acro.com/crash/crash-cessna-525-citationjet-cj1-payson-1-killed", "date": "Aug 13, 2018 at 0230 LT", "type": "Cessna 525 CitationJet CJ1", "operator": "VanCon", "flight_phase": "Flight", "flight_type": "Illegal (smuggling)", "survivors": "No", "site": "City", "schedule": null, "msn": "525-0099", "yom": 1995, "flight_number": null, "city": "Payson", "zone": "Utah", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Owned by a construction company and registered under Vancon Holdings LLC (VanCon Inc.), the aircraft was parked at Spanish Fork-Springville Airport when it was stolen at night by a private pilot. After takeoff, hew flew southbound to Payson, reduced his altitude and voluntarily crashed the plane onto his house located in Payson. The airplane disintegrated on impact and was destroyed by impact forces and a post crash fire. The pilot was killed. His wife and daughter who were in the house at the time of the accident were uninjured despite the house was also destroyed by fire. Local Police declared that the pilot intentionally flew the airplane into his own home hours after being booked for domestic assault charges. An examination of the airplane found no anomalies with the flight controls that would have contributed to the accident. Toxicology testing revealed the presence of a medication used to treat depression, obsessive-compulsive disorder, some eating disorders, and panic attacks; the pilot did not report the use of this medication to the Federal Aviation Administration. The pilot had a known history of depression, anxiety, and anger management issues. The circumstances of the accident were consistent with the pilot's intentional flight into his home.", "probable_cause": "The pilot's intentional flight into his residence."}