{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c99-airliner-near-shelton-2-killed", "date": "Apr 28, 1993 at 2350 LT", "type": "Beechcraft 99 Airliner", "operator": "GP-Express%20Airlines", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Grand Island - Grand Island", "msn": "U-228", "yom": 1986, "flight_number": null, "city": "Shelton", "zone": "Nebraska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5611, "captain_hours_type": 2200, "copilot_hours": 1666, "copilot_hours_type": 44, "aircraft_hours": 6962, "circumstances": "The flight was a part 135 six-month proficiency check for the pilot in the left seat. Both pilots were check airmen for the commuter air carrier. The flight took off at 2343 after cessation of company revenue operations. The cockpit voice recorder recorded conversation of both pilots discussing aerobatics. The pilot in the left seat started to describe the performance of a prohibited maneuver (apparently a barrel roll). The recording ended before description of the maneuver was completed. The airplane impacted in a nose level attitude with the left wing slightly down. There was evidence the maneuver was performed at an altitude insufficient to assure recovery of the airplane. A filled out grade sheet for the flight being flown was found in the check airman's mailbox. Both pilots were killed. ", "probable_cause": "The deliberate disregard for the federal aviation regulations, gp express procedures, and prudent concern for safety by the two pilots in their decision to execute an aerobatic maneuver during a scheduled check ride flight, and the failure of gp express management to establish and maintain a commitment to instill professionalism in their pilots consistent with the highest levels of safety necessary for an airline operating scheduled passenger service."}