{"url": "https://www.baaa-acro.com/crash/crash-learjet-60-troy", "date": "Jan 14, 2001 at 1345 LT", "type": "Learjet 60", "operator": "Ark-Air Flight", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dallas - Troy", "msn": "60-035", "yom": 1994, "flight_number": null, "city": "Troy", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 20750, "captain_hours_type": 800, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2325, "circumstances": "According to witnesses, the airplane collided with two deer shortly after touchdown. Following the collision, the airplane continued down the runway with the tires smoking, veered off the right side of the runway near the end, crossed a taxiway, impacted into a ditch and burst into flames. After the accident, the captain and first officer both reported that the thrust reversers failed to operate after they were deployed during the landing. Examination of the landing gear found all three gear collapsed. The right and left main tires had areas of rubber that were worn completely through. The flaps were found extended, and both thrust reversers were found in the stowed position. Examination of the cockpit found the throttles in the idle position, and the thrust reverser levers in the stowed position. Aircraft performance calculations indicate that the airplane traveled 1,500 feet down the runway after touchdown, in 4.2 seconds, before striking the deer. The calculations also indicate that the airplane landed with a ground speed of 124 knots. At 124 knots and maximum braking applied, the airplane should have come to a complete stop in about 850 feet. However, investigation of the accident site and surrounding area revealed heavy black skid marks beginning at the first taxiway turnoff about 1,500 feet down the 5,010 foot runway. The skid marks continued for about 2,500 feet, departed the right side of the runway and proceeded an additional 500 feet over grass and dirt. The investigation revealed that deer fur was found lodged in the squat switch on the left main landing gear, likely rendering the squat switch inoperative after the impact with the deer, and prior to the airplane’s loss of control on the runway. Since a valid signal from the squat switch is required for thrust reverser deployment, the loss of this signal forced the thrust reversers to stow. At this point, the electronic engine control (EEC) likely switched to the forward thrust schedule and engine power increased to near takeoff power, which led to the airplane to continue down the runway, and off of it. Following the accident, the manufacturer issued an Airplane Flight Manual revision that  Page 2 of 8 ATL01FA021 changed the name of the “Inadvertent Stow of Thrust Reverser During Landing Rollout” abnormal procedure to “Inadvertent Stow of Thrust Reverser After a Crew-Commanded Deployment” and moved it into the emergency procedures section.\r\n[This Brief of Accident was modified on April 5, 2010, based on information obtained during NTSB Case No. DCA08MA098.]\n", "probable_cause": "On ground collision with deer during landing roll, and the inadvertent thrust reverser stowage caused by the damage to the landing gear squat switch by the collision, and subsequent application of forward thrust during rollout. "}