{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46r-350t-matrix-tehachapi-1-killed", "date": "Feb 13, 2021 at 1627 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "IST Solutions", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Camarillo – Mammoth Lakes", "msn": "46-92156", "yom": 2010, "flight_number": null, "city": "Tehachapi", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On February 13, 2021, about 1627 Pacific standard time, a Piper PA46R-350T airplane, N40TS, was destroyed when it was involved in an accident near Tehachapi, California. The pilot was fatally injured. The airplane was operated by the pilot as a Title 14 Code of Federal Regulations Part 91 personal flight. Preliminary flight track data revealed the airplane departed from Camarillo Airport (CMA), Camarillo, California, earlier that afternoon and traveled northeast climbing to about 10,000 ft mean sea level (msl). About 20 minutes into the flight, the airplane’s ground speed decreases followed by the airplane’s altitude decreasing to about 8,000 ft msl. The flight continued for about 12 minutes before dropping off radar. The final portion of the track showed the airplane in a steep descending left spiral. Weather in the area of the accident site was reported as marginal visual flight rules (mvfr) due to low ceilings and visibility in light rain and mist with winds reported at 40 knots. The National Weather Service had advisories current for turbulence over the region and included G-AIRMET Tango and a Center Weather Advisory (CSA) which bordered the area for severe turbulence below 15,000 ft. Concerned family members contacted the Federal Aviation Administration the following day and an Alert Notice (ALNOT) was issued for the missing airplane. The airplane was found on the morning of February 15th, in rugged steep terrain. According to a family member, the pilot had flown this regular flight to Mammoth Yosemite Airport (MMH), Mammoth Lakes, California, where he had a home in the area. The family member also stated that the pilot had flown his helicopter for about an hour with his flight instructor before departing on the accident flight. A postaccident examination of the accident site revealed that the airplane impacted a steep north facing slop. The airplane was found in several sections and postcrash fire damage was concentrated to the cabin section and inboard wings. All of the airplane’s flight controls were found at the accident site.\n", "probable_cause": null}