{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-10-dk-sachigo-lake", "date": "Jan 19, 1986", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Austin%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": null, "msn": "12483", "yom": 1944, "flight_number": null, "city": "Sachigo Lake", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft, with two crew members, two passengers, and a load of cargo, struck a 150-foot-high radio tower, while the crew was manoeuvring to land in poor weather. As the aircraft then became difficult to control, the crew carried out a wheels-up forced landing. During the landing, the cargo of drums containing automotive gasoline broke free, causing damage and trapping the passengers. Once the drums were moved, the passengers were able to leave the aircraft through the cockpit escape hatch. The pilot-in-command and a passenger were seriously injured. The Canadian Aviation Safety Board determined that the flight was continued into below VFR weather conditions. In addition, it was determined that the cargo had not been secured in accordance with the requirements of the company's operating certificate.", "probable_cause": "The following findings were reported:\r\n- The crew initiated a VFR flight based on weather forecasts indicating that suitable weather conditions would exist for the duration of the flight.\r\n- En route weather conditions deteriorated below those required for VFR flight.\r\n- The flight was continued into below VFR weather conditions.\r\n- During an attempt to navigate using the automatic direction finding equipment and to maintain visual reference with the ground, the pilot manoeuvred at a low altitude, and the aircraft struck the NDB tower.\r\n- A wheels-up forced landing was carried out because the crew was having difficulty controlling the aircraft and was uncertain about the damage sustained in the collision.\r\n- The passenger's injuries would have been reduced had a shoulder harness been worn."}