{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-188c-electra-manado-22-killed", "date": "Feb 16, 1967 at 1321 LT", "type": "Lockheed L-188 Electra", "operator": "Garuda-Indonesia", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jakarta – Surabaya – Ujung Pandang – Manado", "msn": "2021", "yom": 1960, "flight_number": "GA708", "city": "Manado-Sam Ratulangi", "zone": "North Sulawesi", "country": "Indonesia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 84, "pax_fatalities": 22, "other_fatalities": 0, "total_fatalities": 22, "captain_hours": 8054, "captain_hours_type": 718, "copilot_hours": 8336, "copilot_hours_type": 505, "aircraft_hours": 12359, "circumstances": "Flight 708 was a scheduled domestic flight from Jakarta to Manado, with intermediate stops at Surabaya and Makassar. It departed Djakarta at 0030 hours GMT on 15 February and proceeded on an IFR flight plan to Surabaya. While en route to Surabaya No. 4 engine would not synchronize. The flight landed at 0200 hours at Surabaya where an oil leak on No. 1 propeller was found. After rectifying these faults the flight departed from Surabaya at 0300 hours. On approaching Makassar bad weather was reported and after two attempts to land, the pilot-in-command elected to divert to another aerodrome. Two aerodromes were available - Denpasar, the first alternate and Surabaya. Although Surabaya was at a greater distance, the pilot-in-command decided for various reasons to return to Surabaya-Juanda and remain overnight. An oil leak on No. 1 propeller was again observed and noted for rectification. The flight departed the next morning at 0010 hours for Makassar where it landed without incident. After approximately a one hour stop at Makassar the flight proceeded to Menado with an estimated time of arrival there of 0512 hours GMT. On approaching Menado the pilot-in-command requested the weather conditions and was given a cloud base of 900 ft and a visibility of 2 km. At an altitude of 1 500 ft the town of Menado and the beach were visible and the aircraft made a 360° turn over the bay of Menado: the aircraft then descended to 900 ft and intercepted the beach on a heading of 120' intending to make an approach to runway 18. The pilot-in-command sighted the runway to his right, continued the approach through a gap between two hills, and called for the undercarriage to be lowered and completion of final checks. He instructed the flight engineer to stand by for an overshoot at which time the approach was being continued with the flaps in the landing position. The aircraft banked 15°-20° to the right, and the co-pilot monitored and called the airspeed. After passing a hill 200 ft above the runway elevation and some 2 720 ft before the runway threshold the pilot-in-command realized he was too high, also the aircraft was still to the left of the centre line and banked to the right. The nose of the aircraft was lowered and after intercepting the glide path at an indicated airspeed of 130 kt the control column was moved rearwards to a normal descent position. With the airspeed rapidly decreasing below the target threshold speed of 125 kt, and whilst still banked to the right, the aircraft landed heavily 3 ft short of the runway manoeuvring area and some 156 ft short of the runway threshold. The undercarriage collapsed and the aircraft skidded, caught fire and came to rest on the runway 1 442 ft after the threshold on a heading of 225°. 22 passengers were killed.", "probable_cause": "The Board determined that the probable cause of this accident was an awkward approach technique resulting in an excessive rate of sink on touchdown. Based on all available evidence the Board found that the following factors contributed to the accident:\r\n- The runway width of 98 ft which looks smaller from the pilot's point of view,\r\n- The uneven runway pavement which forces pilots to touchdown as close as possible to the threshold,\r\n- The marginal weather conditions prevailing at the time of the accident which forced the pilot to accomplish a tight circuit,\r\n- The relationship between the rate of sink and the negative thrust at low speed were not known to the pilot and the operator. "}