{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-stockton", "date": "Jun 14, 2001 at 0923 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "FL25 Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Stockton - Stockton", "msn": "46-22084", "yom": 1989, "flight_number": null, "city": "Stockton", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8927, "captain_hours_type": 598, "copilot_hours": 746, "copilot_hours_type": 156, "aircraft_hours": 1670, "circumstances": "During a forced landing the left wing struck a light standard pole, and the airplane came to rest inverted after colliding with a fence. The purpose of the flight was to conduct recurrent training to include emergency procedures. On the accident flight the certified flight instructor (CFI) initiated a simulated engine failure after takeoff during the initial climb out. The student advised the tower, and turned crosswind at 700 feet agl. The student set up for landing, which included lowering the landing gear and adding 10 degrees of flaps. On short final, descending through 400 feet agl, both the CFI and student realized they would not make the runway. Both pilot's advanced the throttle, to arrest the descent and perform a go-around. There was no corresponding response from the engine. During the final stages of the emergency descent, the pilot maneuvered the airplane to avoid a work crew at the airport boundary fence and the airplane collided with the light standard pole and a fence. An airframe and engine examination discovered no discrepancies with any system. Following documentation of the engine and related systems it was removed and installed in an instrumented engine test cell for a functional test. The engine started without hesitation and was operated for 44 minutes at various factory new engine acceptance test points. During acceleration response tests, technicians rapidly advanced the throttle to the full open position, and the engine accelerated with no hesitation. A second acceleration response test produced the same results. According to Textron Lycoming, there were no discrepancies that would have precluded the engine from being capable of producing power.", "probable_cause": "A loss of engine power for undetermined reasons. Also causal was the inadequate supervision of the flight by the CFI for allowing a simulated emergency maneuver to continue below an altitude which would not allow for recovery contingencies."}