{"url": "https://www.baaa-acro.com/crash/crash-cessna-650-citation-vii-fort-lauderdale", "date": "Dec 28, 2011 at 0951 LT", "type": "Cessna 650 Citation VII", "operator": "Citation 7063 Corporation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lauderdale – Teterboro", "msn": "650-7063", "yom": 1995, "flight_number": null, "city": "Fort Lauderdale-Executive", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14950, "captain_hours_type": 190, "copilot_hours": 19000, "copilot_hours_type": 100, "aircraft_hours": 5616, "circumstances": "The crew stated that the preflight examination, takeoff checks, takeoff roll, and rotation from runway 26 were \"normal.\" However, once airborne, and with the landing gear down and the flaps at 20 degrees, the airplane began a roll to the right. The captain used differential thrust and rudder to keep the airplane from rolling over, and as he kept adjusting both. He noted that as the airspeed increased, the airplane tended to roll more; as the airspeed decreased, the roll would decrease. The captain also recalled thinking that the airplane might have had an asymmetrical flap misconfiguration. Both pilots stated that there were no lights or warnings. As the airplane continued a right turn, runway 13 came into view. The captain completed a landing to the right of that runway, landing long and in the grass with a 9-knot, left quartering tailwind. The airplane then paralleled the runway and ran into an airport perimeter fence beyond the runway's end. The cockpit voice recorder revealed that the crew initially used challenge and reply checklists and that after completing the takeoff checklist, engine power increased. About 7 seconds after the first officer called \"V1,\" the captain stated an expletive, and the first officer announced \"positive rate.\" During the next 50 seconds, the captain repeated numerous expletives, an automated voice issued numerous \"bank angle\" warnings, and the first officer asked what he could do, to which the captain later told him to declare an emergency. There were no calls by either pilot for an emergency checklist nor were there callouts of any emergency memory items. Each of the airplane's wings incorporated four hydraulically-actuated spoiler segments. The outboard segment, the roll control spoiler, normally extends in conjunction with its wing aileron after the aileron has traveled more than about 3 degrees, and extends up to 50 degrees at full control wheel rotation. When the airplane was subsequently examined in a hangar, hydraulic power was applied to the airplane via a ground hydraulic power unit, and the right roll spoiler elevated to 7.9 degrees above the flush wing level. Multiple left/right midrange turns of the yoke, with the hydraulic ground power unit both on and off, resulted in the roll spoiler being extended normally, but still returning to a resting position of 7.8 to 7.9 degrees above the flush position. When the yoke was turned full right and left, whether the aileron  boost was on or off, both wings' roll spoilers extended to their full positions per specifications; however, once the full deflection testing was completed, the right roll spoiler returned to 6.1 degrees above the flush position. A final yoke turn resulted in the roll spoiler being elevated to 5.5 degrees. The right wing roll spoiler actuator was subsequently examined at the airplane manufacturer, and the roll spoiler was found to jam. The roll spoiler actuator was disassembled, but no specific reason(s) for the jamming were found. The roll spoiler parts were also examined and no indications of why the actuator may have jammed were found. According to the flight manual, if any of the spoiler segments should float, moving the spoiler hold down switch to \"Spoiler Hold Down\" locks all spoiler panels down. The roll control spoilers may then be used in the roll mode by turning on the auxiliary hydraulic pump. Also, an \"Aileron/Spoiler Disconnect\" T-handle is available to release the tie between the ailerons and the roll control spoilers in the event of a jam in either system. When used, the pilot's yoke controls only the ailerons, and the copilot's yoke controls only the roll control spoilers. Although the jamming of the right spoiler initiated the event, the crew's proper application of emergency procedures should have negated the adverse effects. Memory items for an uncommanded roll include moving the spoiler hold-down switch to the \"on\" position, which was not done; the spoiler hold-down switch was found in the \"off\" position. (The captain thought that he may have had an asymmetrical flap configuration; however, if an asymmetry had been the initiating event, the flap system would have been automatically disabled and the flap segments would have been mechanically locked in their positions.) The aileron/spoiler disconnect T-handle was found pulled up, which the crew indicated had occurred when the first officer's shoe hit it as he evacuated the airplane. While pulling the aileron/spoiler disconnect T-handle would have been appropriate for a different emergency procedure to release the tie between the ailerons and the roll control spoilers in the event of a jam in either system, it would have actually hindered the captain's attempts to control the airplane in this case because it would have disconnected the left roll spoiler from the captain's yoke, making it more difficult to counter the effects of the displaced right roll spoiler. Although the crew indicated that the t-handle was pulled during the first officer's exit of the airplane, its position, safety cover, and means of activation make this unlikely. In addition, precertification testing of the airplane showed that even with the right roll spoiler fully deployed, as long as the pilot had the use of the left roll spoiler in conjunction with that aileron, the airplane should have been easily controlled. ", "probable_cause": "The crew's failure to use proper emergency procedures during an uncommanded right roll after takeoff, which led to a forced landing with a quartering tailwind. Contributing to the accident was a faulty right roll spoiler actuator, which allowed the right roll spoiler to deploy but not close completely. "}