{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-100-new-york", "date": "Jan 13, 1984 at 1442 LT", "type": "Fokker F27 Friendship", "operator": "Pilgrim%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York - Ottawa", "msn": "10108", "yom": 1958, "flight_number": "PM035", "city": "New York-JFK", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 21, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7012, "captain_hours_type": 799, "copilot_hours": 3151, "copilot_hours_type": 197, "aircraft_hours": 42040, "circumstances": "At 1442 on January 13, 1984, Pilgrim Airline Flight 35, a scheduled 14 CFR Part 121 flight with 21 passengers and a crew of three took off from runway 04L at John F. Kennedy International Airport, Jamaica, New York, en route to Ottawa, Canada. The weather was, in part, ceiling 2,700 feet overcast, visibility 7 miles; wind, 050° at I4 knots; and temperature 26°. As the captain raised the landing gear, the propeller on the left engine autofeathered. The captain initiated emergency procedures and told the first officer that he was retarding the power lever for the left engine. Concurrently, according to the cockpit voice recorder, the right engine experienced a power loss, and the airplane began to descend. The first officer, who was flying the airplane, maintained directional control, and the captain immediately put the landing gear lever down. however, the airplane struck the runway before the landing gear extended fully, and slid about 1,200 feet before stopping near the intersection of taxiway \"G\" and runway 04L. The captain and 13 passengers incurred minor injuries, and the flight attendant incurred a fracture of the spine. The airplane was damaged substantially; there was no postcrash fire.", "probable_cause": "The flight crew's failure to use engine anti-ice on the inbound flight to JFK, the captain's failure to conduct a thorough pre-flight inspection, and the flight crew's decision to use engine anti-ice on take-off from JFK which led to power losses on both engines."}