{"url": "https://www.baaa-acro.com/crash/crash-rockwell-sabreliner-60sc-san-diego-4-killed", "date": "Aug 16, 2015 at 1103 LT", "type": "Rockwell Sabreliner 60", "operator": "BAe-Systems.png", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "San Diego - San Diego", "msn": "306-073", "yom": 1974, "flight_number": "Eagle 1", "city": "San Diego-Brown Field", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 4485, "captain_hours_type": 347, "copilot_hours": 6400, "copilot_hours_type": null, "aircraft_hours": 13418, "circumstances": "The Cessna 172 (N1285U) was conducting touch-and-go landings at Brown Field Municipal Airport (SDM), San Diego, California, and the experimental North American Rockwell NA265-60SC Sabreliner (N442RM, call sign Eagle1) was returning to SDM from a mission flight. SDM has two parallel runways, 8R/26L and 8L/26R; it is common in west operations for controllers to use a right traffic pattern for both runways 26R and 26L due to the proximity of Tijuana Airport, Tijuana, Mexico, to the south of SDM. On the morning of the accident, the air traffic control tower (ATCT) at SDM had both control positions (local and ground control) in the tower combined at the local control position, which was staffed by a local controller (LC)/controller-in-charge, who was conducting on-the-job training with a developmental controller (LC trainee). The LC trainee was transmitting control instructions for all operations; however, the LC was monitoring the LC trainee's actions and was responsible for all activity at that position. About 13 minutes before the accident, the N1285U pilot contacted the ATCT and requested touch-andgo landings in the visual flight rules (VFR) traffic pattern. About that time, another Cessna 172 (N6ZP) and a helicopter (N8360R) were conducting operations in the VFR traffic pattern, and a Cessna 206 Stationair (N5058U) was inbound for landing. Over the next 5 minutes, traffic increased, with two additional aircraft inbound for landing. (Figure 1 in the factual report for this accident shows the aircraft in the SDM traffic pattern about 8 minutes before the accident.) The LC trainee cleared the N1285U pilot for a touch-and-go on runway 26R; the pilot acknowledged the clearance and then advised the LC trainee that he was going to go around. The LC trainee advised the N1285U pilot to expect runway 26L on the next approach. At that time, three aircraft were using runway 26R (Global Express [N18WZ] was inbound for landing, N6ZP was on a right base for a touch-and-go, and a Cessna Citation [XALVV] was on short final) and three aircraft were using runway 26L (N1285U was turning right downwind for the touch-and-go, a Skybolt [N81962] was on a left downwind for landing, and N8360R was conducting a touch-and-go landing). After N1285U completed the touch-andgo on runway 26L, the pilot entered a right downwind for runway 26R. Meanwhile, Eagle1 was 9 miles west of the airport and requested a full-stop landing; the LC trainee instructed the Eagle1 flight crew to enter a right downwind for runway 26R at or above an altitude of 2,000 ft mean sea level. At this time, about 3 minutes before the accident, the qualified LC terminated the LC trainee's training and took over control of radio communications. From this time until the collision occurred, the LC was controlling nine aircraft. (Figure 2 and Figure 4 in the factual report for this accident show the total number of aircraft under ATCT control shortly before the accident.) During the next 2 minutes, the LC made several errors. For example, after N6ZP completed a touch-andgo on runway 26R, the pilot requested a right downwind departure from the area, which the LC initially failed to acknowledge. The LC also instructed the N5058U pilot, who had been holding short of runway 26L, that he was cleared for takeoff from runway 26R. Both errors were corrected. In addition, the LC instructed the helicopter pilot to \"listen up. turn crosswind\" before correcting the instruction 4 seconds later to \"turn base.\" (Figure 2 in the factual report for this accident shows the aircraft in the traffic pattern about 2 minutes before the accident.) About 1 minute before the collision, the Eagle1 flight crew reported on downwind midfield and stated that they had traffic to the left and right in sight. At that time, N1285U was to Eagle1's right, between Eagle1 and the tower, and established on a right downwind about 500 ft below Eagle1's position. N6ZP was about 1 mile forward and to the left of Eagle1, heading northeast and departing the area. Mistakenly identifying the Cessna to the right of Eagle1 as N6ZP, the LC instructed the N6ZP pilot to make a right 360° turn to rejoin the downwind when, in fact, N1285U was the airplane to the right of Eagle1. (The LC stated in a postaccident interview that he thought the turn would resolve the conflict with Eagle1 and would help the Cessna avoid Eagle1's wake turbulence.) The N6ZP pilot acknowledged the LC's instruction and began turning; N1285U continued its approach to runway 26R. However, the LC never visually confirmed that the Cessna to Eagle1's right (N1285U) was making the 360° turn. Ten seconds later, the LC instructed the Eagle1 flight crew to turn base and land on runway 26R, which put the accident airplanes on a collision course. The LC looked to ensure that Eagle1 was turning as instructed and noticed that the Cessna on the right downwind (which he still mistakenly identified as N6ZP) had not begun the 360° turn that he had issued. The LC called the N6ZP pilot, and the pilot responded that he was turning. In the first communication between the LC and the N1285U pilot (and the first between the controllers in the ATCT and that airplane's pilot in almost 6 minutes), the LC transmitted the call sign of N1285U, which the pilot acknowledged. N1285U and Eagle1 collided as the LC tried to verify N1285U's position. A postaccident examination of both airplanes did not reveal any mechanical anomalies that would have prevented the airplanes from maneuvering to avoid an impact.", "probable_cause": "The local controller's (LC) failure to properly identify the aircraft in the pattern and to ensure control instructions provided to the intended Cessna on downwind were being performed before turning Eagle1 into its path for landing. Contributing to the LC's actions was his incomplete situational awareness when he took over communications from the LC trainee due to the high workload at the time of the accident. Contributing to the accident were the inherent limitations of the see-and-avoid concept, resulting in the inability of the pilots involved to take evasive action in time to avert the collision."}