{"url": "https://www.baaa-acro.com/crash/crash-avro-652-anson-i-ont-mt-foel-fras", "date": "Aug 23, 1943 at 1025 LT", "type": "Avro 652 Anson", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Mountains", "schedule": "Llandwrog - Llandwrog", "msn": null, "yom": null, "flight_number": null, "city": "Mt Foel-fras", "zone": "Gwynedd", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew where on a daytime navigation training flight from Llandwrog near Caernarvon, during the the return leg from Shrewsbury while in cloud, and shortly before 10:30 am, the pilot saw a sheep go by beneath him.  He pulled the control yoke back in an instinctive effort to climb and successfully stalled the aircraft onto the rising ground but struck a large rock which spun the aircraft so it ended up facing downhill. Fortunately for the crew the fuselage remained intact, this was shown in a photograph published in 'Legend of Llandwrog', but the wing that hit the rock was destroyed, this is shown in 'No Landing Place' on page 41. After the crash the crew were able to transmit a wireless message to Llandwrog to report that they had crashed, using the Direction Finding equipment at the airfield the Flying Control Officer was able to estimate its position somewhere in the vicinity of Tal y Fan. However before a better fix could be made the remaining life in the aircraft's battery was exhausted, though the crew were advised to fire a red flare every half hour to aid the Mountain Rescue crew who departed base at 11:00. They drove their vehicles up the track from Rowen that runs around the southern side of Tal y Fan. However this track became narrow with overhanging trees and large boulders which caused some trouble for the team. Two flares were seen from towards Llyn Dulyn, but these had been fired by an 'Army Battle Unit' who were training in the area. They were also brought into the search and after only a short time reported sighting a crashed aircraft high up on Foel Fras. The Mountain Rescue Service then proceeded up the Dulyn valley and when they reached farm at Tan y Bwlch spotted a lift raft and the five crew with the aircraft. The crash site was reached at 15:00 and the crew were quickly evacuated from the site and were taken back to the Station Sick Quarters for medical assessment.\r\nCrew (9th AFU):\r\nSgt Arthur Bickerdike, pilot,\r\nP/O Oswald Ian Hamilton Stoeckel, navigator,\r\nSgt Laurence Tommie, wireless operator, \r\nSgt G. Martin, navigator  1.\r\nSource:\r\nhttp://www.peakdistrictaircrashes.co.uk/pages/wales/walesn5371.htm", "probable_cause": null}