{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-680fl-harrison", "date": "Oct 8, 2003 at 1825 LT", "type": "Rockwell Grand Commander 680", "operator": "War Eagle Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Springdale – Harrison", "msn": "680-1413-63", "yom": 1964, "flight_number": null, "city": "Harrison-Boone County", "zone": "Arkansas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 725, "captain_hours_type": 86, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9362, "circumstances": "The twin-engine airplane was on the base leg to final turn, about 1-1 1/2 miles from the approach end of the runway when the left engine lost power. Instantly after, the right engine lost power and the pilot feathered both engines. The airplane then impacted a 70-foot high tree and collided with the ground about 1,000 feet short of the runway. The 700-hour pilot reported that he activated the electric fuel boost pumps and switched the fuel selectors from the auxiliary fuel tank positions to the main fuel tank positions, about 17 miles from the airport. He recalled that the fuel gauges indicated approximately 70 gallons of fuel in the main tank and about 10-15 gallons of fuel in the auxiliary tanks. The original installed fuel system was configured with a center tank and two outboard tanks. The center tank was composed of five, interconnected rubber cells, having a total capacity of 150 to 159 US gallons. Each outboard fuel tank was composed of two fuel cells with a combined capacity of 33.5 gallons. The total of the two outboard fuel tanks (four cells) was 67 gallons, providing a total usable capacity of 233 gallons. Each engine had its own fuel shutoff switch. Rotating a switch to the RIGHT OUTBOARD or LEFT OUTBOARD position allows fuel from the outboard tanks to flow to the respective engine and shuts off fuel from the center tank. Rotating a fuel shutoff switch to the CENTER position allows fuel to flow from the center tank to the respective engine, and shuts off flow from the respective outboard tank. Rotating the switch to the OFF position shuts off all fuel flow to the respective engine. There was no cross-feed configuration of the switches. Documentation was found in the historical records that indicated extended range fuel system modifications, however, the information was incomplete. After review of all available records and examination of the wreckage, it was determined that the fuel system configuration/capacity of the airplane at the time of the accident was: 156 gallons for the center tank system; 67 gallons for the outboard wing tanks; and a set of auxiliary tanks capable of holding 21 gallons (records of installation unknown). The total usable fuel capacity was estimated at 244 gallons. Cockpit fuel selector positions were: LEFT Fuel Shut Off Valve Selector-LEFT HAND OUTBOARD; LEFT Fuel Boost Pump-OFF; LEFT Engine Primer-OFF; LEFT Ignition Switch-RIGHT; RIGHT Fuel Shut Off Valve Selector-RIGHT HAND OUTBOARD; RIGHT Fuel Boost Pump-ON; RIGHT Engine Primer-OFF; RIGHT Ignition Switch-BOTH. Airframe fuel shutoff valves were found in the following positions (Each valve  position corresponded to the cockpit selectors): Right Wing Auxiliary-OPEN; Right Wing Main-CLOSED; Left Wing Auxiliary-OPEN; Left Wing Main-CLOSED. A total of 37.5 gallons of usable fuel was drained from the uncompromised tanks (unknown amount had leaked at the accident site). Excerpts from the \" Normal Procedures\" section of the flight manual regarding fuel selector positions for take off and landing: \"CAUTION; Burn center tank fuel first, when 100 gallons is shown on center tank gauge, switch to outboard tanks. Do not allow engine to be starved of fuel when outboard tanks run dry. Select center tanks at first indication of fuel pressure loss. Fuel boost pumps must be on when switching tanks.\" The \"BEFORE LANDING CHECK\" procedures in the aircraft flight manual state that the Fuel Selector Valves must be in the \"CENTER TANK\" position before the approach. The manufacturer stated that the simultaneous loss of power of both engines was likely a result of the outboard fuel tanks unporting. No mechanical anomalies were found during examination of the engines or airframe, and usable fuel was available in the center tank at the time of the accident.", "probable_cause": "The loss of power to both engines due to fuel starvation as a result of the pilot's failure to complete the landing checklist while on final approach. A factor contributing to the accident was the lack of suitable terrain for the forced landing."}