{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-049-constellation-petrich-58-killed", "date": "Jul 27, 1955 at 0738 LT", "type": "Lockheed L-049 Constellation", "operator": "El%20Al", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "London – Paris – Vienna – Tel Aviv", "msn": "1968", "yom": 1945, "flight_number": "LY402", "city": "Petrich", "zone": "Blagoevgrad", "country": "Bulgaria", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 51, "pax_fatalities": 51, "other_fatalities": 0, "total_fatalities": 58, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off at 2015 GMT on 26 July from London for Tel Aviv with stops at Paris and Vienna. On 27 July it departed (0253 hours) Vienna with an estimated time of arrival over Belgrade of 0436 hours. While in the area of the Yugoslav-Bulgarian border at an altitude of approximately 18,000 feet the aircraft was fired upon by two Bulgarian fighters. Following two more attacks the aircraft broke up in mid-air at an altitude of 2,000 feet and fell to the ground in flames at a point 3,5 km southeast of the junction of the Rivers Strumica and Strumon in Bulgarian territory near the Bulgarian-Greek border. All 58 occupants have been killed.", "probable_cause": "The aircraft sustained a hit or hits which caused loss of pressurization and a fire in the heater compartment. The aircraft broke up in mid-air due to explosion caused by bullets hitting the right wing and probably the left wing together with a projectile or projectiles of large calibre bursting in the rear end of the fuselage. Nevertheless, it was determined that the airplane deviated from its route, violated the State frontier of Bulgaria and penetrated deep into the interior of the Bulgarian airspace without warning. Equipped as it was with perfect air navigation devices, the airplane cannot have been unaware of the fact that it violated the State frontier of Bulgaria. Even after it had been warned, it failed to comply and continued to fly southwards in the direction of the Bulgarian-Greek frontier. The Bulgarian air defense forces acted with some hastiness and did not take all necessary measures to compel the aircraft to surrender and land. The Bulgarian Government considers it necessary to draw attention also to the fact that, for many years, certain parties, failing to respect the sovereignty of the Bulgarian People's Republic, have systematically been violating the Bulgarian frontiers. In recent years many illegal crossings of the Bulgarian frontiers by airplanes 'of unknown nationality' have been recorded. During these illegal flights, subverters equipped with arms, radio stations and other supplies were parachuted into Bulgarian territory. The Government of the Bulgarian People's Republic protested several times to the Secretariat of the United Nations Organization. Unfortunately, however, this produced no results. All these factors created a tense atmosphere which made it necessary to take steps to safeguard the security of the State. It was this tense atmosphere that made possible the unfortunate accident to the Israeli airplane. "}