{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-4-bolivar-61-killed", "date": "Dec 8, 1957 at 1645 LT", "type": "Douglas DC-4", "operator": "Aerolineas-Argentinas-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Buenos Aires – San Carlos de Bariloche", "msn": "27227", "yom": 1944, "flight_number": "AR670", "city": "Bolívar", "zone": "Buenos Aires province", "country": "Argentina", "region": "South America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 55, "pax_fatalities": 55, "other_fatalities": 0, "total_fatalities": 61, "captain_hours": 10527, "captain_hours_type": 2196, "copilot_hours": 10088, "copilot_hours_type": 1253, "aircraft_hours": null, "circumstances": "The aircraft took off from Ezeiza Airport at 1554LT on a scheduled flight direct to San Carlos de Bariloche with Comodoro Rivadavia as alternate. Six crew and fifty-five passengers were aboard. Clearance was granted by the Regional Centre Control Area for an IFR flight outside airways, with 1 200 metres as safety height as far as Neuquén and 2 400 metres up to the destination aerodrome. The aircraft carried out routine communications with the airport control tower and with the approach control office until it reached Lobos, where it was authorized to use telegraphy. From that moment there was no further information available concerning the flight. It was later established that at 1645 hours the aircraft had crashed 25 km southeast of Bolivar. All occupants were killed and the aircraft was destroyed by the impact and the fire which broke out subsequently. ", "probable_cause": "The aircraft disintegrated in flight due to breakage of parts of the left wing followed by the falling off of the tail section when the equipment was subjected to stresses above those envisaged by the manufacturer. This was brought about as a direct result of the pilot's decision to attempt to cross a cold surface front under turbulent conditions of extreme severity. The following were contributing causes:\r\n- The pilot's recklessness in descending on a track well below the minimum safety flight altitude established for this type of operation,\r\n- The absence in the flight plan of a forecast showing the intensity of the meteorological phenomena encountered,\r\n- Inadequate ope rational dispatch of the aircraft. "}