{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-440-38-metropolitan-tortola-1-killed", "date": "Jul 12, 2004 at 0715 LT", "type": "Convair CV-440 Metropolitan", "operator": "Dodita Air Cargo", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "San Juan - Sint Maarten", "msn": "391", "yom": 1956, "flight_number": null, "city": "Tortola-Terrance B. Lettsome", "zone": "All British Virgin Islands", "country": "British Virgin Islands", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 27200, "captain_hours_type": 924, "copilot_hours": 256, "copilot_hours_type": null, "aircraft_hours": 45771, "circumstances": "The copilot stated that the pre-flight and run-up before takeoff were performed with no discrepancies noted. After leveling off at 5,500 feet they noticed that the right engine cylinder head temperature and oil temperature was about 10 degrees above the normal parameter for that engine. Shortly after, both pilot's noticed a sharp decrease in the right engine mean effective pressure followed by vibration in the engine. The co-pilot looked at the right engine and informed the pilot that it was on fire around the front lower cylinders. Attempts by the pilot to extinguish the engine fire were unsuccessful. The pilot advised Air Traffic Control of their intention to ditch due to the right engine uncontrolled fire. The co-pilot, handed a life jacket to the pilot and then put his on. The pilot placed his life preserver to the side and did not put it on. While descending the co-pilot opened his side window, but the pilot did not. According to the co-pilot, shortly before ditching the pilot requested 10-degrees of flaps but the flaps did not move. Both pilots were at the controls of the airplane for the ditching. A review of maintenance records revealed that the right engine was installed on the airframe on May 14, 2003 at 45,660.5 hours total airframe time. A complete \"C\" Check was accomplished on June 15, 2004 at a total time of 45,741.8 hours with no discrepancies noted. The airplane ditched into the Caribbean Ocean 29 miles southeast of Beef Island, Virgin Islands, in an undetermined depth of water, neither the pilot or the airplane wreckage was recovered.", "probable_cause": "The in-flight fire on the number two engine, for undetermined reasons."}