{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dash-8-103-koh-samui-38-killed", "date": "Nov 21, 1990 at 1815 LT", "type": "De Havilland DHC-8-100 (Dash-8)", "operator": "Bangkok%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bangkok - Koh Samui", "msn": "172", "yom": 1989, "flight_number": "PG125", "city": "Koh Samui", "zone": "Surat Thani (สุราษฎร์ธานี)", "country": "Thailand", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 33, "pax_fatalities": 33, "other_fatalities": 0, "total_fatalities": 38, "captain_hours": 14764, "captain_hours_type": 521, "copilot_hours": 674, "copilot_hours_type": 235, "aircraft_hours": 3416, "circumstances": "On final approach to Koh Samui Airport runway 35, the aircraft entered an area of heavy rain falls. As the crew was unable to locate the runway, the captain decided to initiate a go-around procedure. With flaps fully extended, the crew increased power and started to gain height when the aircraft rolled to the left to an angle of 75° then entered an uncontrolled descent and crashed at a speed of 147 knots about 5 km short of runway threshold. The aircraft disintegrated on impact and all 38 occupants were killed. ", "probable_cause": "The pilot suffered a spatial disorientation which resulted in an improper control of the aircraft. The following contributing factors were reported: \r\n- The pilot continued the approach in bad weather conditions with limited or no visual reference with the ground.\r\n- Both pilots attention was focused on trying to locate the runway, neglecting the standard cross checks and mutual checks on approach and failing to monitor the aircraft attitude.\r\n- Poor crew coordination, \r\n- Lack of teamwork, \r\n- Poor flight monitoring that contributed to the loss of situational awareness and improper control of the aircraft."}