{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa227ac-metro-iii-tamworth-2-killed", "date": "Sep 16, 1995 at 1957 LT", "type": "Swearingen SA227 Metro III", "operator": "Tamair", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tamworth - Tamworth", "msn": "AC-629B", "yom": 1985, "flight_number": null, "city": "Tamworth", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4132, "captain_hours_type": 1393, "copilot_hours": 1317, "copilot_hours_type": 1, "aircraft_hours": 15105, "circumstances": "Two company pilots were undergoing first officer Metro III type-conversion flying training. Both had completed Metro III ground school training during the week before the accident. A company check-and-training pilot was to conduct the type conversions. This was his first duty period after 2 weeks leave. Before commencing leave, he had discussed the training with the chief pilot. This discussion concerned the general requirements for a co-pilot conversion course compared to a command pilot course but did not address specific sequences or techniques. The three pilots met at the airport at about 1530 EST on 16 September 1995. During the next 2 hours and 30 minutes approximately, the check-and-training pilot instructed the trainees in daily and pre-flight inspections, emergency equipment and procedures, and cockpit procedures and drills (including the actions to be completed in the event of an engine failure), as they related to the aircraft type. The briefing did not include detailed discussion of aircraft handling following engine failure on takeoff. The group began a meal break at 1800 and returned to the aircraft at about 1830 to begin the flying exercise. The check-and-training pilot was pilot in command for the flight and occupied the left cockpit seat. One trainee occupied the right (co-pilot) cockpit seat while the other probably occupied the front row passenger seat on the left side. This person had the use of a set of head-phones to listen to cockpit talk and radio calls. The aircraft departed Tamworth at 1852, some 40 minutes after last light. Witnesses described the night as very dark, with no moon. Under these conditions, the Tamworth city lighting, which extended to the east from about 2 km beyond the end of runway 12, was the only significant visual feature in the area. The co-pilot performed the takeoff, his first in the Metro III. For about the next 30 minutes, he completed various aircraft handling exercises including climbing, descending, turning (including steep turns), and engine handling. No asymmetric flight exercises were conducted. The check-and-training pilot then talked the co-pilot through an ILS approach to runway 30R with an overshoot and landing on runway 12L. The landing time was 1940. The aircraft had functioned normally throughout the flight. After clearing the runway, the aircraft held on a taxiway for 6 minutes, with engines running. During this period, the crew discussed the next flight which was to be flown by the same co-pilot. The check-and-training pilot stated that he was going to give the co-pilot a V1  cut. The co-pilot objected and then questioned the legality of night V1  cuts. The check-and-training pilot replied that the procedure was now legal because the company operations manual had been changed. The co-pilot made a further objection. The check-and-training pilot then said that they would continue for a Tamworth runway 30R VOR/DME approach and asked the co-pilot to brief him on this approach. The crew discussed the approach and the check-and-training pilot then requested taxi clearance. The aircraft was subsequently cleared to operate within a 15-NM radius of Tamworth below 5,000 ft. The crew then briefed for the runway 12L VOR/DME approach. The plan was to reconfigure the aircraft for normal two-engine operations after the V1  cut and then complete the approach. The crew completed the after-start checks, the taxi checks, and then the pre-take-off checks. The checks included the co-pilot calling for one-quarter flap and the check-and-training pilot responding that one-quarter flap had been selected. The crew briefed the take-off speeds as V1 = 100 kts, VR = 102 kts, V2 = 109 kts, and Vyse = 125 kts for the aircraft weight of 5,600 kg. Take-off torque was calculated as 88% and watermethanol injection was not required. The aircraft commenced the take-off roll at 1957.05. About 25 seconds after brakes release, the check-and-training pilot called 'V1', and less than 1 second later, 'rotate'. The aircraft became airborne at 1957.32. One second later, the check-and-training pilot reminded the co-pilot that the aircraft attitude should be 'just 10 degrees nose up'. After a further 3 seconds, the check-and-training pilot retarded the left engine power lever to the flight-idle position. Over the next 4 seconds, the recorded magnetic heading of the aircraft changed from 119 degrees to 129 degrees. The co-pilot and then the check-and-training pilot called that a positive rate of climb was indicated and the landing gear was selected up 15 seconds after the aircraft became airborne. The landing gear warning horn began to sound at approximately the same time. After 19 seconds airborne, and again after 30 seconds, the check-and-training pilot reminded the co-pilot to hold V2. Three seconds later, the check-and-training pilot said that the aircraft was descending. The landing gear warning horn ceased about 1 second later. By this time, the aircraft had gradually yawed left from heading 129 degrees, through the runway heading of 121 degrees, to 107 degrees. After being airborne for 35 seconds, the aircraft struck a tree approximately 350 m beyond, and 210 m left of, the upwind end of runway 12L. It then rolled rapidly left, severed power lines and struck other trees before colliding with the ground in an inverted attitude and sliding about 70 m. From the control tower, the aerodrome controller saw the aircraft become airborne. As it passed abeam the tower, the controller directed his attention away from the runway. A short time later, all lighting in the tower and on the airport failed and the controller noticed flames from an area to the north-east of the runway 30 threshold. Within about 30 seconds, when the emergency power supply had come on line, the controller attempted to establish radio contact with the aircraft. When no response was received, he initiated call-out of the emergency services.", "probable_cause": "The following factors were reported:\r\n1. There was no enabling legislative authority for AIP (OPS) para. 77.\r\n2. CASA oversight, with respect to the company operations manual and specific guidance concerning night asymmetric operations, was inadequate.\r\n3. The company decided to conduct V1  cuts at night during type-conversion training.\r\n4. The check-and-training pilot was assigned a task for which he did not possess adequate experience, knowledge, or skills.\r\n5. The check-and-training pilot gave the co-pilot a night V1  cut, a task which was inappropriate for the co-pilot's level of experience.\r\n6. The performance of the aircraft during the flight was adversely affected by the period the landing gear remained extended after the simulated engine failure was initiated and by the control inputs of the co-pilot.\r\n7. The check-and-training pilot did not recognise that the V1 cut exercise should be terminated and that he should take control of the aircraft."}