{"url": "https://www.baaa-acro.com/crash/crash-bae-atp-wamena", "date": "May 31, 2013 at 0709 LT", "type": "BAe ATP", "operator": "Deraya-Air-Taxi", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jayapura - Wamena", "msn": "2027", "yom": 1990, "flight_number": null, "city": "Wamena", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3108, "captain_hours_type": 1366, "copilot_hours": 5648, "copilot_hours_type": 689, "aircraft_hours": 15755, "circumstances": "On 31 May 2013 aircraft BAe ATP freighter registered PK-DGI operated by PT. Deraya as scheduled cargo/ freight flight from Sentani Airport (WAJJ) to Wamena Airport (WAJW), Papua. On board in this flight were the Pilot in Command (PIC) acted as Pilot Flying (PF) and the Second in Command (SIC) acted as Pilot Monitoring (PM).  At 2127 UTC (0627 LT) the aircraft departed from Sentani Airport. The aircraft cruised at 12,000 feet (FL 120)and estimated time of arrival Wamena Airport was 2207 UTC (0707 LT).  The first pilot contact with Wamena Tower controller was at 2201 UTC, the aircraft position was approaching Pass Valley point, the controller informed that runway 15 expect to be used and the weather condition was wind calm, visibility 4 Km, low cloud at final area and QNH 1008 mbs. There was no specific of approach and landing briefing by pilot flying to the pilot non flying considering to such weather condition.  At 2207 UTC, the pilot reported the position was on final runway 15. The controller requested the information of the flight condition and the pilot reported that the runway has not insight.  At 2209 UTC, the pilot reported that the runway was insight and the controller provided the clearance to land and 25 seconds later the aircraft touched down on the centerline. During the landing roll at about 750 meters from the beginning of runway 15 the aircraft veered to the left of the runway shoulder, the pilot recovered by applying the right rudder and asymmetry reverses thrust but the aircraft continued veer to the left and stopped at about 10 meters on the left shoulder of the runway 15. On the landing roll, the FDR recorded that the left engine torque greater then right engine torque.  The pilot shutdown both engines normally and evacuated the aircraft safely. The nose landing gear detached and found on the shoulder at about 250 meter from the aircraft final position. The main landing gears broken and all the propellers bent.  No injured in this occurrence. ", "probable_cause": "The following contributing factors were identified:\r\n- The flight did not meet the criteria according to the recommended elements of stabilized approach which required go around.\r\n- The aircraft touched down with 2° misalignment with the runway direction then the aircraft veered off to the left.\r\n- The recovery action was not in accordance to the correct technique according to the ALAR Tool Kit. "}