{"url": "https://www.baaa-acro.com/crash/crash-avro-652-anson-i-mt-cairnsmore-fleet-3-killed", "date": "Feb 22, 1944 at 2340 LT", "type": "Avro 652 Anson", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Mountains", "schedule": "Dumfries - Dumfries", "msn": null, "yom": null, "flight_number": null, "city": "Newton Stewart", "zone": "Dumfries and Galloway", "country": "United Kingdom", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off from Dumfries at 2017LT on the 22nd February for a night navigation exercise around the northern Irish Sea / North Channel area. The intended route was Dumfries - Silloth - Mull of Galloway - Rathlin Island - 55'50\"N 06'40\"W (a point some 8 miles off the west coast of Islay) - Mull of Galloway - Silloth - Dumfries, a total distance of 380 miles. Also an Infra-Red bombing exercise was to be conducted at Whithorn (south of Wigtown on the Silloth - Mull of Galloway leg) on both the outward and return legs. The progress of the flight was reported by radio and ground tracking as being slightly off course to port between the Mull of Galloway and Rathlin and off course to starboard on he return leg to the Mull of Galloway from off Islay. The crew were able to use the Occult navigation light at West Freugh on the return leg to correct their course to arrive over Withorn for their second pass at the IR target but visibility was reported by them as poor so they did not carry out the IR bombing exercise. At this point they decided to set a direct course to Dumfries from the West Freugh Occult with radio navigation assistance from Wigtown. At 2336LT the aircraft was reported by West Freugh to be almost due North of them with the crew reporting that they were flying at 3,000 feet. A couple of minutes later the aircraft flew into the western side of Cairnsmore of Fleet at just over 2,100 feet and only a mile north of their intended track. The aircraft impacted a large patch of boulders and much of the forward end was badly damaged by the impact, the aircraft carried on up the slope for a short way before coming to a halt, there was no fire following the crash. When the aircraft did not arrive at Dumfries it was declared missing and a search was begun at dawn on the 23rd, in the mean time and despite his injuries the pilot Sgt McLeod set off on foot from the crash site, arriving at Bardrochwood Farm at the foot of Cairnsmore. It was 2100LT on the 23rd before the crash site was reached by the rescue party from Wigtown and Lalonde was rescued. The other crew members had either died in the crash or succumbed to their injuries and the cold before help arrived, both were recorded as having happened by the RAF Dumfries Medical Officer.\r\nCrew:\r\nSergeant N. J. McLeod, pilot\r\nP. J. Lalonde, navigator\r\nJohn Morgan Cooley, bomb aimer, †\r\nWarrant Officer Jack James Mount Ward, wireless operator, air gunner and instructor, †\r\nSergeant Mervyn Charles Simpson, wireless operator and air gunner, †\r\nSource: http://www.peakdistrictaircrashes.co.uk", "probable_cause": "It was the opinion of the Court of Inquiry that the aircraft had been caught up in turbulence between West Freugh and where it crashed and this caused the deviation in the course by a mile and that it was probably subject to a \"severe downdraft before action taken by the pilot to counteract the loss of height had taken effect\"."}