{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-walcha-1-killed", "date": "Dec 22, 1986", "type": "De Havilland DHC-2 Beaver", "operator": "Aerial%20Agriculture", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Winterbourne - Winterbourne", "msn": "136", "yom": 1951, "flight_number": null, "city": "Walcha", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Superphosphate spreading was being carried out, with the aircraft uplifting one tonne loads about every 6 minutes. Fuel endurance with both tanks full was approximately 2 hours. The pilot was conducting his 25th takeoff for the day, about one hour after refuelling. Witnesses observed that the aircraft did not become airborne at the usual point, two-thirds of the way along the 675 metre strip. Lift-off finally occurred at the end of the strip, but almost immediately afterwards the aircraft clipped a fence. It was seen to sink slightly, before climbing at a steeper than normal angle until some 250 metres beyond the fence. At this point the nose dropped suddenly and the aircraft dived into rising ground in a steep nose down attitude. Fire broke out on impact and consumed much of the wreckage. The pilot, sole on board, was killed.", "probable_cause": "Preliminary investigation revealed that the fuel selector was in the \"off\" position. This had been the first occasion that the pilot had flown this particular aircraft. The fuel selector in this aircraft was different to that in the other Beaver the pilot had operated. In the previous aircraft, rotating the fuel selector through 180 degrees anti-clockwise changed the selection from the rear to the forward fuel tanks. In the accident aircraft, a similar movement of the selector changed the selection from the rear tank to the \"off\" position. This difference had not been brought to the pilot's attention, and it was possible that he had not thoroughly familiarized himself with the aircraft prior to commencing operations. It was considered likely that the takeoff had been commenced with the fuel selector positioned to the almost empty rear tank. During the takeoff roll, the fuel low quantity bell and associated light had activated, and the pilot had changed the fuel selector by feel, while continuing with the takeoff. With the fuel supply turned off, the engine had failed from fuel starvation, and the aircraft had subsequently stalled at too low a height above the ground to permit recovery before impact. "}