{"url": "https://www.baaa-acro.com/crash/crash-atr72-500-magong-48-killed", "date": "Jul 23, 2014 at 1906 LT", "type": "ATR72-500", "operator": "TransAsia%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "City", "schedule": "Kaohsiung – Magong", "msn": "642", "yom": 2000, "flight_number": "GE222", "city": "Magong", "zone": "Penghu County (澎湖縣)", "country": "Taiwan", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 54, "pax_fatalities": 44, "other_fatalities": 0, "total_fatalities": 48, "captain_hours": 22994, "captain_hours_type": 19069, "copilot_hours": 2392, "copilot_hours_type": 2083, "aircraft_hours": 27039, "circumstances": "The aircraft was being operated on an instrument flight rules (IFR) regular public transport service from Kaohsiung to Magong in the Penghu archipelago. At 1906 Taipei Local Time, the aircraft impacted terrain approximately 850 meters northeast of the threshold of runway 20 at Magong Airport and then collided with a residential area on the outskirts of Xixi village approximately 200 meters to the southeast of the initial impact zone. At the time of the occurrence, the crew was conducting a very high frequency omni-directional radio range (VOR) non-precision approach to runway 20. The aircraft was destroyed by impact forces and a post-impact fire. Ten passengers survived the occurrence and five residents on the ground sustained minor injuries. The occurrence was the result of controlled flight into terrain, that is, an airworthy aircraft under the control of the flight crew was flown unintentionally into terrain with limited awareness by the crew of the aircraft’s proximity to terrain. The crew continued the approach below the minimum descent altitude (MDA) when they were not visual with the runway environment contrary to standard operating procedures. The investigation report identified a range of contributing and other safety factors relating to the flight crew of the aircraft, TransAsia’s flight operations and safety management processes, the communication of weather information to the flight crew, coordination issues at civil/military joint-use airport, and the regulatory oversight of TransAsia by the Civil Aeronautics Administration (CAA). ", "probable_cause": "- The flight crew did not comply with the published runway 20 VOR non-precision instrument approach procedures at Magong Airport with respect to the minimum descent altitude (MDA). The captain, as the pilot flying, intentionally descended the aircraft below the published MDA of 330 feet in the instrument meteorological conditions (IMC) without obtaining the required visual references. \r\n- The aircraft maintained an altitude between 168 and 192 feet before and just after overflying the missed approach point (MAPt). Both pilots spent about 13 seconds attempting to visually locate the runway environment, rather than commencing a missed approach at or prior to the MAPt as required by the published procedures. \r\n- As the aircraft descended below the minimum descent altitude (MDA), it diverted to the left of the inbound instrument approach track and its rate of descent increased as a result of the flying pilot’s control inputs and meteorological conditions. The aircraft’s hazardous flight path was not detected and corrected by the crew in due time to avoid the collision with the terrain, suggesting that the crew lost situational awareness about the aircraft’s position during the latter stages of the approach. \r\n- During the final approach, the heavy rain and associated thunderstorm activity intensified producing a maximum rainfall of 1.8 mm per minute. The runway visual range (RVR) subsequently reduced to approximately 500 meters. The degraded visibility significantly reduced the likelihood that the flight crew could have acquired the visual references to the runway environment during the approach.\r\n- Flight crew coordination, communication, and threat and error management were less than effective. That compromised the safety of the flight. The first officer did not comment about or challenge the fact that the captain had intentionally descended the aircraft below the published minimum descent altitude (MDA). Rather, the first officer collaborated with the captain’s intentional descent below the MDA. In addition, the first officer did not detect the aircraft had deviated from the published inbound instrument approach track or identify that those factors increased the risk of a controlled flight into terrain (CFIT) event.\r\n- None of the flight crew recognized the need for a missed approach until the aircraft reached the point (72 feet, 0.5 nautical mile beyond the missed approach point) where collision with the terrain became unavoidable. \r\n- The aircraft was under the control of the flight crew when it collided with foliage 850 meters northeast of the runway 20 threshold, two seconds after the go around decision had been  made. The aircraft sustained significant damage and subsequently collided with buildings in a residential area. Due to the high impact forces and post-impact fire, the crew and most passengers perished. \r\n- According to the flight recorders data, non-compliance with standard operating procedures (SOP's) was a repeated practice during the occurrence flight. The crew’s recurring non-compliance with SOP's constituted an operating culture in which high risk practices were routine and considered normal. \r\n- The non-compliance with standard operating procedures (SOP's) breached the obstacle clearances of the published procedure, bypassed the safety criteria and risk controls considered in the design of the published procedures, and increased the risk of a controlled flight into terrain (CFIT) event."}