{"url": "https://www.baaa-acro.com/crash/crash-bae-3101-jetstream-31-beckley", "date": "Jan 30, 1991 at 2355 LT", "type": "BAe Jetstream 31", "operator": "CC%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Charlotte - Beckley", "msn": "710", "yom": 1986, "flight_number": null, "city": "Beckley-Raleigh County", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 17, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5000, "captain_hours_type": 3400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8841, "circumstances": "Aircraft was dispatched with inoperative airframe deice system, tho an operational deice system was required for flight in known icing conditions. During descent to land, aircraft encountered light icing conditions. Capt believed aircraft could 'handle it' and continued descent. As he began ILS final approach, he noted significant increase of ice accumulation and used higher than normal approach speed. As full (50°) flaps were set, aircraft began buffet and pitched nose down. Capt corrected with full back pressure on control column, but aircraft landed hard, gear collapsed and aircraft slid about 3,600 feet to a stop. No preimpact mechanical anomaly was found, except for inoperative deice system. Investigation revealed pilots had received printout of weather from company computer system with surface observation and terminal forecast, but no area forecast (FA). Pilots and ground personnel were not aware that FA was available at company weather terminal. FA forecasted light and occasional moderate rime and mixed icing in clouds and precipitation above freezing level. Weather deteriorated, but pilots did not require inflight weather info or pireps. Flight mnl noted tailplane ice may cause nose down trim change with flap extension. There was evidence of tail plane stall, lack of company training in cold weather operations, deficiencies in use of deicing systems, and lack of FAA surveillance. ", "probable_cause": "Flight into known adverse weather conditions by the pilot, which resulted in ice accumulation on the aircraft and subsequent loss of aircraft control (tail plane stall) as the flaps were fully extended. Factors related to the accident were: the pilot's inadequate use of the preflight briefing service, inadequate training provided to the pilots by company/management personnel, inadequate surveillance by the faa, and icing conditions."}