{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-coldwater-1-killed", "date": "Sep 21, 1995 at 1145 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Hanseatic Air", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Coldwater - Elkhart", "msn": "421B-0373", "yom": 1973, "flight_number": null, "city": "Coldwater-Branch County", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1984, "captain_hours_type": 203, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5044, "circumstances": "The pilot obtained a preflight briefing and indicated that he would obtain an IFR clearance after becoming airborne; however, he took off and did not activate a flight plan. Witnesses observed the airplane flying north (away from the destination) about 200 to 300 feet above the ground below a low overcast sky condition. One witness said the airplane was flying very slow; he said he was almost able to keep up with it in his vehicle. The witnesses said they saw the airplane roll rapidly to the right and descend toward the ground. It collided with the ground in an approximate 50 degree pitch down attitude. An on-scene examination did not reveal any airframe or control anomaly that would have resulted in the accident. The engines and propellers were disassembled for inspection. Examination of the engines revealed they were capable of producing power. Examination of the propellers revealed both were operating at low pitch settings. About 25 miles north-northwest at Battle Creek, MI, the 1145 edt weather was, in part: 500 feet overcast, visibility 2 miles with fog, wind from 050 degrees at 10 knots. ", "probable_cause": "Failure of the pilot to maintain adequate airspeed, while maneuvering (turning) at low altitude, which resulted in an inadvertent stall and collision with the terrain. Factors relating to the accident were: the adverse weather conditions, and the lack of altitude for recovery from the stall. "}