{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900c-kendall-4-killed", "date": "Feb 11, 2015 at 1439 LT", "type": "Beechcraft 1900C", "operator": "Aeropanamericano", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Kendall - Procidenciales", "msn": "UC-47", "yom": 1988, "flight_number": null, "city": "Miami-Executive (Kendall-Tamiami)", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 19053, "captain_hours_type": 1476, "copilot_hours": 9529, "copilot_hours_type": 152, "aircraft_hours": 35373, "circumstances": "The accident flight was a repositioning flight being operated by two airline transport pilots, and it was the multiengine turboprop airplane's first flight after an aviation maintenance technician (AMT) had replaced the left engine propeller with an overhauled propeller. The AMT subsequently performed an engine run, which included verifying correct power settings and corresponding blade angles. A review of flight data recorder (FDR) data revealed that, about 2 seconds after rotation, the left engine propeller rpm decreased to 60 percent, and the left engine torque increased off-scale (beyond 5,000 ft lbs), which is consistent with the left propeller traveling to the feathered position and the engine torque increasing in an attempt to maintain propeller rpm. About 30 seconds later, the flight crew shut down the left engine and attempted to return to the departure airport. Postaccident examination of the rudder trim actuator revealed that the rudder trim was at its full-right limit, which would have occurred to counteract the left engine drag before its shutdown. Based on this evidence, it is likely that the flight crew did not readjust the trim when the drag was alleviated, which resulted in the airplane being operated in a crosscontrolled attitude for about 50 seconds with a left bank and full-right rudder trim. Although the airplane should have been able to climb about 500 ft per minute with one engine operating, it slowed and descended from 300 ft in the cross-controlled attitude until it stalled, as indicated by a stall warning recorded by the cockpit voice recorder, and subsequently impacted terrain. Examination of the wreckage, including teardown examination of the left engine and propeller, did not reveal any preimpact mechanical anomalies. Review of the airplane maintenance manual revealed instructions to check the propeller reversing linkage on the front end of the engine, which controlled the beta valve, for proper rigging during propeller installation. The manual also contained a warning that misadjustment of the beta valve can cause unplanned feathering of the propeller and result in a possible hazard to airplane operation and over torque damage to the engine; however, the beta valve rigging could not be verified postaccident due to impact damage. Additionally, the ground/flight idle solenoid energizes when weight becomes off wheels and further opens the beta valve, which could exacerbate an existing misrigged condition as soon as the airplane becomes airborne, which is when the airplane experienced the uncommanded propeller feathering. The FDR data were consistent with the flight crew not performing the Before Takeoff (Runup) checklist. One of the items on that checklist was a low-pitch solenoid test, which would have energized the solenoid and possibly driven the left propeller uncommanded to feather during ground operations rather than in flight. A similar test during the post maintenance engine-run would have had the same results.", "probable_cause": "The left engine propeller's uncommanded travel to the feathered position during takeoff for reasons that could not be determined due to impact damage. Contributing to the accident was the flight crew's failure to establish a coordinated climb once the left engine was shut down and the left propeller was in the feathered position. "}