{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-lorain", "date": "May 15, 2003 at 1710 LT", "type": "Cessna 208B Grand Caravan", "operator": "DK%26L%20Company", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lorain - Anderson", "msn": "208B-0063", "yom": 1987, "flight_number": null, "city": "Lorain", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3500, "captain_hours_type": 1500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12059, "circumstances": "The pilot departed in a Cessna 208B, and shortly after takeoff, he experienced a power loss. He set up for a forced landing and during the ground roll, the nose wheel sunk into the soft terrain and the airplane nosed over. Fuel was found in both wings; however, the fuel line between the fuel selector and the engine contained only trace amounts of fuel. One fuel selector was found in the OFF position, and the other fuel selector was mid-range between the OFF and ON positions. The airplane was equipped with an annunciator warning light and horn to warn if either fuel selector was turned off. The annunciator was popped out and did not make contact with the annunciator panel. The warning horn was checked and found to be inoperative, and the electrical circuitry leading to the horn was checked and found to be operative. The engine was test run with no problems noted. According to the Pilot's Operating Handbook, the position of the fuel selectors are to be checked three times before takeoff: including cabin preflight, before engine start, and before takeoff. The pilot reported that he departed with both fuel selectors on and had not touched them when the power loss occurred. A representative of Cessna Aircraft Company reported that there was sufficient fuel forward of the fuel selector valves to takeoff and fly for a few miles prior to experiencing fuel exhaustion.", "probable_cause": "The pilot's failure to verify the position of the fuel selectors prior to takeoff, which resulted in a power loss due to fuel starvation. A factor was the failure of the fuel selector warning horn."}