{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-6b2-h4-turbo-porter-near-yahatma-3-killed", "date": "Sep 22, 2011 at 1313 LT", "type": "Pilatus PC-6 (Porter & Turbo Porter)", "operator": "Yajasi%20Aviation", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Pagai - Wamena", "msn": "943", "yom": 2004, "flight_number": null, "city": "Yahatma", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 11312, "captain_hours_type": 2647, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5774, "circumstances": "On 22 September 2011, a PC 6 Pilatus Porter aircraft, registration PK-UCE was being operated by Yayasan Jasa Aviasi Indonesia (YAJASI) departed from Pagai to Wamena. The aircraft departed at 0403 UTC1 (1303 LT) and estimated to arrive at Wamena was at 0436 UTC. Aircraft cruise at altitude of 10,000 feet and conducted under Visual Flight Rules (VFR) and followed the visual route via North Gap corridor, which one of visual route to Wamena. Prior to enter the North Gap corridor at time 0413 UTC, the pilot sent a message via a system they called AFFIS to the company Flight Following Officer at Sentani Airport, which was the operation base. The pilot also sent a blind transmission message through Wamena Tower radio frequency. This was local procedure, to submit the message consists of position, altitude and destination to make the other aircraft pilots aware each other. As in the intern YAJASI flight following procedure, pilot should send message when the flying passes the North Gap corridor. In this flight, until the normal elapsed time, the pilot did not send any message to their Flight Following Officer at Sentani that the flight has passed the North Gap corridor. Since there was no message nor radio contact from the pilot until the ETA in Wamena, the Flight Following Officer at Sentani informed to the other personnel at the operation base, and alarmed to the other YAJASI aircraft which were flying in that area to start search the PK-UCE. Some other aircrafts which were flying in the vicinity also contacted to search the PKUCE. PK-UCE was found in mountain location adjacent to Pass Valley airstrip. The accident site was at coordinate S 030  54’ 54.4’’, E 1390  02’ 24.3”, the aircraft was hit the trees and the ground where the elevation was about 7500 feet , the propeller blades was not on feather and bent rearward, the left wing was broken and the aircraft stopped on heading about 85°. ", "probable_cause": "The pilot decided to descend from the cruise altitude 10000 feet to penetrate the area of marginal weather was most likely not as what his perceive. The pilot avoided the cloud to the left of the VFR route guidance and most likely that the space available was less than the requirement stated for the Weather Minimum class F. "}