{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-beechjet-400a-telluride", "date": "Dec 23, 2015 at 1415 LT", "type": "Beechcraft Beechjet 400", "operator": "Aerolineas-Ejecutivas", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Monterrey – El Paso – Telluride", "msn": "RK-396", "yom": 2004, "flight_number": null, "city": "Telluride", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7113, "captain_hours_type": 1919, "copilot_hours": 8238, "copilot_hours_type": 1412, "aircraft_hours": 5744, "circumstances": "The pilots were conducting an international chartered flight in the small, twin-engine jet with five passengers onboard. Since the weather at the destination was marginal, the flight crew had discussed an alternate airport in case weather conditions required a missed approach at their destination. As the airplane neared the non-towered destination airport, the flight crew received updated weather information, which indicated that conditions had improved. Upon contacting the center controller, the crew was asked if they had the weather and NOTAMS for the destination airport. The crew reported that they received the current weather information, but did not state if they had NOTAM information. The controller responded by giving the flight a heading for the descent and sequence into the airport. The controller did not provide NOTAM information to the pilots. About 2 minutes later, airport personnel entered a NOTAM via computer closing the runway, effective immediately, for snow removal. Although the NOTAM was electronically routed to the controller, the controller's system was not designed to automatically alert the controller of a new NOTAM; the controller needed to select a display screen on the equipment that contained the information. At the time of the accident, the controller's workload was considered heavy. About 8 minutes after the runway closure NOTAM was issued, the controller cleared the airplane for the approach. The flight crew then canceled their instrument flight plan with the airport in sight, but did not subsequently transmit on or monitor the airport's common traffic advisory frequency, which was reportedly being monitored by airport personnel and the snow removal equipment operator. The airplane landed on the runway and collided with a snow removal vehicle about halfway down the runway. The flight crew reported they did not see the snow removal equipment. The accident scenario is consistent with the controllers not recognizing new NOTAM information in a timely manner due to equipment limitations, and the pilots not transmitting or monitoring the common traffic advisory frequency. Additionally, the accident identifies a potential problem for flight crews when information critical to inflight decision-making changes while en route, and problems when controller workload interferes with information monitoring and dissemination.", "probable_cause": "The limitations of the air traffic control equipment that prevented the controller's timely recognition of NOTAM information that was effective immediately and resulted in the issuance of an approach clearance to a closed runway. Also causal was the pilots' omission to monitor and transmit their intentions on the airport common frequency. Contributing to the accident was the controller's heavy workload and the limitations of the NOTAM system to distribute information in a timely manner."}