{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46e-1-cs-burbank", "date": "Sep 17, 1947 at 1112 LT", "type": "Curtiss C-46 Commando", "operator": "Slick-Airways2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Denver – Hollywood", "msn": "2937", "yom": 1945, "flight_number": null, "city": "Burbank", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3311, "captain_hours_type": 1201, "copilot_hours": 3422, "copilot_hours_type": 258, "aircraft_hours": 3811, "circumstances": "Just before reaching Las Vegas, however, a distance of 268 miles from Burbank, Captain Clark stated that his fuel quantity gauges indicated that he had 360 gallons of fuel remaining. Since he believed this to be sufficient to reach destination, he did not land at Las Vegas which was generally used as a fueling stop for Slick Airways. From Las Vegas to Palmdale, lighter winds were encountered resulting in a ground speed averaging 180 miles per hour. Palmdale was flown over at 1025, at which time the aircraft had been in the air a total of 5 hours and 18 minutes. Three minutes after passing over Palmdale, which was clear, the left engine fuel pressure dropped to 3 pounds, the red fuel warning light came on, and the left engine stopped. Fuel selector valves were changed, and as a result power was restored to the left engine. Captain Clark suspected a fuel leak. He inspected the aircraft for visible loss of fuel or fire, found none, and continued on to Burbank. As the flight approached Newhall California, Burbank reported a ceiling of 1,600 feet with visibility of two and one-half miles. The flight was instructed by the Los Angeles Airways Traffic Control Center to hold on the northwest course of the Burbank range, and advised that the approach clearance Into Burbank could be expected at approximately 1052. Captain Clerk informed the Burbank control tower that he was losing fuel and wanted to land as soon as possible, however, he declined to declare an emergency. Shortly after this, the left engine stopped for the second time, but power was again restored by changing the positions of the fuel selector valves. At 1056, approach clearance into Burbank was given, and at 1058, the flight reported inbound over the Chatsworth fan marker, approximately 14 miles from the Lockheed Air Terminal. The ceiling over Burbank had by this time lowered to 1,000 feet, and rain showers had reduced visibility to about one mile. As the flight descended below 1,600 feet only intermittent bursts of power could be secured from the left engine. The “letdown” was continued, the Burbank radio range station and the Lockheed Air Terminal were passed. Upon completion of a right turn to return to the range station the right engine stopped, and the propeller was immediately feathered. At an altitude of 200 to 400 feet, Captain Clark recognized almost immediately underneath him a hangar on the Lockheed Air Terminal. He executed a sharp right turn of approximately 270 degrees, and landed on the north-south taxi way about 400 feet before crossing Runway 7, a distance of approximately 1,900 feet from the south boundary of the airport. Brakes were applied, but the aircraft could not be brought to a stop within the airport boundaries. It came to rest only after skidding across a highway and railroad line adjacent to the south boundary of the airport.", "probable_cause": "The Board determines that the probable cause of this accident was the exhaustion of fuel prior to landing at Burbank, California, due to failure of the pilot to compute properly his fuel consumption, and to provide for a safe fuel reserve.\r\nThe following factors were considered as contributory:\r\n- With the exception of “constant pressure charts” no weather data at altitudes of 15,000 to 17,000 feet, the intended altitudes of flight, was available to the flight crew prior to the time of their take-off from Denver, Colorado,\r\n- Head winds of unexpected velocities were encountered en route which resulted in an average ground speed of 148 miles per hour instead of the ground speed of 170 miles per hour used in the flight plan to estimate time en route,\r\n- During the course of the flight the crew made no computation of fuel consumed based on time in the air and on the company's fuel consumption data,\r\n- The flight encountered instrument weather conditions over the Burbank, California area, and was required to wait for an instrument approach clearance to the Lockheed Air Terminal for approximately 10 minutes. No emergency, however, was declared."}