{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-200-near-iliamna-13-killed", "date": "Sep 6, 1977 at 1452 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Alaska%20Aeronautical%20Industries", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Iliamna - Anchorage", "msn": "196", "yom": 1969, "flight_number": "AAI302", "city": "Iliamna", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": 4335, "captain_hours_type": 1124, "copilot_hours": 1380, "copilot_hours_type": 371, "aircraft_hours": 15369, "circumstances": "Flight 302 departed Iliamna at 1419LT with 11 passengers and 2 crew members on board. It was cleared to Anchorage on an instrument flight rules (IFR) flight plan via the low frequency airways--Red Airway 99 (Red 99) to the Kakon Intersection, and then Green Airway 8 (Green 8) to Anchorage. The flight was to maintain 7,000 ft. At 1425:20, the flight crew of Flight 302 established radio contact with Anchorage Air Route Traffic Control Center's (Anchorage Center) D2 nonradar sector controller. They reported that the flight was level at 7,000 ft and that they estimated arrival at Kakon Intersection at 1434. At 1428:35, Anchorage Center requested the flight's estimate for its arrival at Homer, Alaska. The flight crew responded that they estimated to be over Homer at 1515. The flight crew of Flight 302 did not make radio contact when they were over Kakon Intersection; however, at 1439:40 they requested of Anchorage Center, \"302, we would like to file Green 8 and intercept the 192° bearing from Wildwood.\" Fifteen seconds later, Anchorage Center cleared the flight to proceed along the new route of flight and to remain at 7,000 ft. At 1440:50, the flight crew of Flight 302 advised, \"302, we--we'll estimate Clams at 15 past the hour.\" Anchorage Center acknowledged the advisory. This was the last known radio transmission from Flight 302. At 1452:08, three abrupt, audible sounds were recorded on the Anchorage Center tape of incoming air-to-ground communications with Flight 302. These sounds were similar to those produced by a carrier frequency that was heard during the activation of Flight 302's radio transmitter during earlier radio communications with the Center. After several unsuccessful attempts to contact Flight 302 by several air traffic, control facilities between Iliamna and Anchorage and after the flight could not be detected on radar in the areas where radar coverage was available, Anchorage Center initiated the required actions to alert and notify appropriate authorities of a possible aircraft accident. U.S. Air Force search and rescue aircraft located the wreckage site at 1643 on September 7, 1977. The aircraft had struck a glacier face on the southwest side of Mt Iliamna at the 7,000 ft elevation. There were no survivors. Because of the rapidly changing environmental conditions on the glacier face of Mt Iliamna, recovery of bodies and wreckage was not possible. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of the accident was the failure of the flightcrew to use proper navigational procedures for the route to be flown, especially their failure to use the available backup means of navigation to verify the position and the progress of the flight."}