{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46a-60-cs-commando-near-planeta-rica-25-killed", "date": "Mar 19, 1960 at 1610 LT", "type": "Curtiss C-46 Commando", "operator": "SAM-Colombia-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Mountains", "schedule": "San Andrés – Medellín", "msn": "00384", "yom": 1945, "flight_number": "MM901", "city": "Planeta Rica", "zone": "Córdoba", "country": "Colombia", "region": "South America", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 42, "pax_fatalities": 22, "other_fatalities": 0, "total_fatalities": 25, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15876, "circumstances": "En route from San Andrés Island to Medellín, while cruising in bad weather conditions, the pilot informed ATC about technical problems on the left engine and elected to divert to Planeta Rica. On approach, the aircraft struck the slope of Mt Los Mellos located about 11 km from the airfield. Three crew members and 22 passengers were killed while 21 other occupants were injured. ", "probable_cause": "The accident was attributed to an error of judgement in that the pilot decided to land at an airport which was closed and where no radio aid was available at the time when he was in visual flight at an adequate altitude and close to several airports offering good characteristics and suitable weather conditions. In addition, the pilot underestimated the malfunction that at the time had developed in the left engine. The following contributing factors intervened:\r\n- Malfunction in the carburetor of the left engine resulting in intermittent overspeeding and slight coughing,\r\n- Adverse weather conditions (namely thick mist, rain, hail and electric storm) which prevailed in the area and in the vicinity of Planeta Rica Airport at the time of the accident,\r\n- The lack of communications which prevented the pilot from being briefed on the weather conditions at Planeta Rica Airport and from being informed of the absence of tower or radio facility services owing to the time-table in force at the airport."}