{"url": "https://www.baaa-acro.com/crash/crash-iai-1124-westwind-sydney-2-killed", "date": "Oct 10, 1985 at 0059 LT", "type": "IAI 1124 Westwind", "operator": "Pel-Air2", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Sydney – Brisbane – Cairns", "msn": "371", "yom": 1982, "flight_number": "QH474", "city": "Sydney-Kingsford Smith", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 9881, "captain_hours_type": 3101, "copilot_hours": 8091, "copilot_hours_type": 500, "aircraft_hours": 3105, "circumstances": "IAI 1124 Westwind aircraft, registered VH-IWJ, was operating under a current Certificate of Registration, the holder of which was Pel-Air Aviation Pty Ltd (Pe1-Air). The aircraft was operated by Pel-Air and, at the time of the accident, it was engaged on a regularly scheduled cargo service. This service was operated under the terms of a current Charter and Aerial Work Licence, and was flown on behalf of Ansett Air Freight, a subsidiary of Ansett Transport Industries Pty Ltd. The particular flight, designated Flight 474, was operated on 4 nights each week from Sydney to Brisbane and Cairns, Queensland. The aircraft had departed Cairns earlier in the evening and had flown via Brisbane to Sydney, arriving at 2336 hours. The arriving crew reported that the aircraft was performing normally. A total of 1,350 litres of fuel was added to the aircraft tanks and loading of general cargo was carried out by Ansett Air Freight personnel. The flight plan submitted to Air Traffic Control (ATC) indicated that the flight would follow the normal Instrument Flight Rules (IFR) procedures. The estimated time interval to Brisbane was 70 minutes at planned Flight Level 370 (approximate altitude of 37,000 feet). The aircraft carried sufficient fuel for 164 minutes of flight, and refuelling was planned to take place at Brisbane prior to departure for Cairns. Pel-Air intended to use the flight to assess the performance of the rostered co-pilot, who was being considered for upgrading to command status. He was to occupy the left hand control seat, while the right hand seat occupant was the Chief Pilot of the company. At 0033 hours the crew established radio contact on the Sydney ATC Clearance Delivery frequency, and were given a \"16 West Maitland One\" Standard Instrument Departure (SID). The flight pattern associated with this clearance requires the aircraft to maintain heading after take-off on Runway 16 until reaching a height of 500 feet, when a left turn is made to intercept the 126 radial of the Sydney VOR (Very High Frequency Omnidirectional Range). At a position of 6 nautical miles by Distance Measuring Equipment (DME) from the aerodrome, a left turn onto 357 degrees is made in order to continue tracking with reference to the West Haiti and VOR. A copy of the applicable SID chart is shown at Appendix A. Shortly before 0049 hours the crew contacted Sydney Control Tower, and the aircraft was directed to taxi for a departure from Runway 16. At the time the wind was light and variable. After receiving the appropriate clearance, an evidently normal take-off was made, and at 0056 hours contact was established with Sydney Departures Control. The pilot in command advised that the aircraft was on climb to Flight Level 370 , and requested the direct track to Brisbane. This was a standard request, to allow the aircraft to proceed directly to the destination rather than follow the various radio navigation aids along the route. Such a request was normally granted by ATC if the general traffic situation permitted use of the direct track, and provided the aircraft was equipped with a suitable navigation system. VH-IWJ was fitted with a VLF/Omega navigation system which was capable of direct tracking. After ascertaining this, the Departures controller advised the aircraft that the direct track to Brisbane would probably be available. The acknowledgment of this comment was the last recorded transmission from the aircraft. Shortly before 0059 hours the Departures controller broadcast the clearance for the aircraft to track direct to Brisbane at the planned cruising level. No response was received from the aircraft, although the controller noted that radar returns were still visible on his screen. Shortly afterwards, these returns faded, and the Distress Phase of Search and Rescue procedures was Instituted at 0100 hours. At about this time, a number of persons observed what appeared to be the lights of an aircraft descending rapidly towards the sea. The lights maintained their position relative to each other, indicating that the aircraft was not rotating as it descended. The aircraft had faded from the radar screen at a point about 11 kilometres south-east of Sydney Airport. A search of the area was commenced using helicopters and boats. Wreckage Identified as being from the aircraft was sighted by a helicopter at 0245 hours. Recovery of pieces of the aircraft structure, freight and human remains was effected by Police and Department of Aviation launches. The degree of destruction indicated that the aircraft had struck the water while travelling at high speed. The bulk of the wreckage was presumed to be lying in about 85 metres of water about 5 kilometres out to sea from Botany Bay. An Intensive search was carried out by vessels from the Royal Australian Navy, later assisted by a vessel from the NSW Department of Fisheries and Agriculture. Use was made of various underwater detection devices. Search efforts were hampered by persistent unfavourable sea conditions and no trace was found of the wreckage. Operations were finally suspended towards the end of November 1985. An Internationally recognised underwater location and salvage expert was then employed, and the wreckage was ultimately located and identified in 92 metres of water on 20 January 1986. Recovery of the Flight Data and Cockpit Voice Recorders, the major portions of both engines, and sundry other pieces of the aircraft structure, was effected the following month.\n", "probable_cause": "The following findings were reported:\r\n1.There was a known malfunction of the rate of turn indicator.\r\n2. The pilot in command possibly simulated simultaneous failures of all three flight attitude indicators.\r\n3. There were no external references by which the crew could assess the attitude of the aircraft.\r\n4. A loss of control of the aircraft occurred at a height of about 5000 feet.\r\n5. The crew did not recover control of the aircraft prior to impact with the sea."}