{"url": "https://www.baaa-acro.com/crash/crash-bae-125-700a-near-beaumont-3-killed", "date": "Sep 20, 2003 at 1854 LT", "type": "BAe 125", "operator": "StarFlite%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Houston - Beaumont", "msn": "257026", "yom": 1978, "flight_number": null, "city": "Beaumont-Jack Brooks", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 5230, "captain_hours_type": 3521, "copilot_hours": 3817, "copilot_hours_type": 2684, "aircraft_hours": 9781, "circumstances": "The purpose of the flight was for the instructor-pilot to prepare the first and second pilots for their FAA Part 135 competency and proficiency checks scheduled to be conducted in the accident airplane the following week, with operator proving tests to follow shortly thereafter. The first pilot obtained a computer science corporation (CSC) direct user access terminal service (DUATS) weather briefing and filed an instrument flight rules (IFR) flight plan. The instructor-pilot was listed as the pilot-in-command. The airplane took off and proceeded to its designated practice area. According to the cockpit voice recorder (CVR), the pilots practiced various maneuvers under the direction of the instructor-pilot, including steep turns and approaches to stalls. Then the first pilot was asked the to demonstrate an approach-to-landing stall. The first pilot asked the instructor-pilot if he had \"ever done stalls in the airplane?\" The instructor-pilot replied, \"It's been awhile.\" The first pilot remarked, \"This is the first time I've probably done stalls in a jet. Nah, I take that back, I've done them in a (Lear).\" The instructor pilot said he had stalled \"the JetStar on a [FAR] one thirty five ride.\" Flaps were extended and the landing gear was lowered. Digital electronic engine control (DEEC) recorded a power reduction that remained at idle. According to national track analysis program (NTAP) data, the stall was initiated from an altitude of 5,000 feet. The stick shaker sounded and shortly thereafter, the recording ended. The consensus of 25 witness' observations was that the airplane was flying at low altitude and doing \"erratic maneuvers.\" One witness said it \"seemed to stop in midair,\" then pitched nose down. Some witnesses said that the airplane was spinning. Other witnesses said it was in a flat spin. Still another witness said the airplane fell \"like a falling leaf.\" The airplane impacted marshy terrain in a nose-down, wings-level attitude. Wreckage examination revealed the landing gear was down and the flaps were set to 25 degrees. Both engines' compressor/turbine section blades were gouged and bent in the opposite direction of rotation, and there were rotational scoring marks on both cases. No discrepancies were noted.", "probable_cause": "The first pilot's failure to maintain aircraft control and adequate airspeed. Contributing factors included performing intentional stalls at too low an altitude to afford a safe recovery, the pilot's failure to add power in an attempt to recover, and the flight instructor's inadequate supervision of the flight.\n"}