{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3b-202-near-kerrville-3-killed", "date": "Feb 1, 1959 at 2350 LT", "type": "Douglas DC-3", "operator": "General Airways (USA)", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Boise – Pueblo – Kelly", "msn": "1924", "yom": 1937, "flight_number": null, "city": "Kerrville", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 25, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 15009, "captain_hours_type": 9373, "copilot_hours": 3872, "copilot_hours_type": 3100, "aircraft_hours": 49051, "circumstances": "A General Airways DC-3 crashed shortly before midnight near Kerrville, Texas, on February 1, 1959, during a civil air movement (CAM) of 25 military personnel from Boise, Idaho, to Lackland Air Force Base (Kelly AFB), San Antonio, Texas. Three of the 28 occupants, including the captain and the reserve captain, then acting as copilot, were killed, four were seriously injured, and 21 received minor injuries. The final segment of the flight was from Pueblo, Colorado, where the U. S. Weather Bureau Station furnished weather briefing. Icing prevailed and was to continue. An IFR flight plan specifying cruising at 9,000 feet was filed. Departure from Pueblo was at 1800 1 and at 1916 the flight requested an altitude change from 9,000 to 7,000 feet, reporting light icing. ARTC approved at 1945. Shortly thereafter the flight again reported light icing. An involved series of radio contacts ensued as ice accretion became worse, then critical, then incapacitating. A privately used airport at Kerrville, Texas, was staffed and lighted. An attempt to land there failed and the aircraft was crash-landed nearby. Previously alerted fire fighting apparatus and ambulances were sent to the site. Investigation revealed no significant mechanical defect and no unpredicted weather conditions. The Board believes that this accident resulted from the pilot pressing into known and dangerous icing conditions until the aircraft was crash-landed. General Airways, Inc., a CAB certificated supplemental air carrier, surrendered its FAA operating certificate shortly after the accident pending FAA re-evaluation of the carrier's operations. The FAA later restored the certificate.", "probable_cause": "The Board determines that the probable cause of this accident was the captain's poor judgment in continuing into known and dangerous icing conditions."}