{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-2b-60-marquise-sioux-falls-1-killed", "date": "Jun 7, 2020 at 0415 LT", "type": "Mitsubishi MU-2 Marquise", "operator": "McNeely%20Charter%20Service", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Everett – Huron - Kokomo", "msn": "1526", "yom": 1981, "flight_number": "MDS44", "city": "Sioux Falls", "zone": "South Dakota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 22000, "captain_hours_type": 10900, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12104, "circumstances": "The pilot departed on a cross country flight in a turbine-powered, multiengine airplane at night and in visual meteorological conditions. Recovered GPS data revealed that as the airplane accelerated down the runway, it drifted to the right of the runway centerline. A video recording showed that shortly after takeoff, the airplane rolled right, the nose dropped, and the airplane impacted the ground. It came to rest on its left side with both wings separated and the fuselage was highly fragmented forward of the main landing gear. A post-accident examination of the airframe and engines found no mechanical malfunctions or anomalies that would have precluded normal operation. A witness that spoke to the pilot shortly before the accident flight stated that the pilot exhibited difficulty in completing some paperwork; however, no medical reasoning for this difficulty could be determined based upon the available evidence. The investigation determined that at the time of the accident the pilot had been on duty for about 19 hours and 20 minutes, which was contrary to duty and rest regulations. At his estimated arrival time into the destination, the pilot would have accumulated about 20 hours and 54 minutes of duty time. The investigation was unable to determine if the pilot took advantage of the opportunity for rest that existed during the day, and therefore could not determine if fatigue contributed to the accident. Investigators were unable to determine the reason for the loss of control on takeoff with the available information.", "probable_cause": "The pilot’s failure to maintain control of the airplane during takeoff for reasons that could not be determined."}