{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-saint-marys-4-killed", "date": "Nov 29, 2013 at 1824 LT", "type": "Cessna 208B Grand Caravan", "operator": "ERA-Alaska2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bethel - Mountain Village - Saint Mary's", "msn": "208B-0697", "yom": 1998, "flight_number": "ERR1453", "city": "Saint Mary's", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 25000, "captain_hours_type": 1800, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 12653, "circumstances": "The scheduled commuter flight departed 40 minutes late for a two-stop flight. During the first leg of the night visual flight rules (VFR) flight, weather at the first destination airport deteriorated, so the pilot diverted to the second destination airport. The pilot requested and received a special VFR clearance from an air route traffic controller into the diversion airport area. Review of automatic dependent surveillance-broadcast data transmitted by the airplane showed that, after the clearance was issued, the airplane's track changed and proceeded in a direct line to the diversion airport. Postaccident examination of the pilot's radio showed that his audio panel was selected to the air route traffic control (ARTCC) frequency rather than the destination airport frequency; therefore, although the pilot attempted to activate the pilot-controlled lighting at the destination airport, as heard on the ARTCC frequency, it did not activate. Further, witnesses on the ground at St. Mary's reported that the airport lighting system was not activated when they saw the accident airplane fly over, and then proceed away from the airport. Witnesses in the area described the weather at the airport as deteriorating with fog and ice. About 1 mile from the runway, the airplane began to descend, followed by a descending right turn and controlled flight into terrain. The pilot appeared to be in control of the airplane up to the point of the right descending turn. Given the lack of runway lighting, the restricted visibility due to fog, and the witness statements, the pilot likely lost situational awareness of the airplane's geographic position, which led to his subsequent controlled flight into terrain. After the airplane proceeded away from the airport, the witnesses attempted to contact the pilot by radio. When the pilot did not respond, they accessed the company's flight tracking software and noted that the airplane's last reported position was in the area of the airplane's observed flightpath. They proceeded to search the area where they believed the airplane was located and found the airplane about 1 hour later. Postaccident examination of the airframe and engine revealed no mechanical malfunctions or anomalies that would have precluded normal operation. About 3/4 inch of ice was noted on the nonprotected surfaces of the empennage. However, ice formation on the airplane's inflatable leading edge de-ice boots was consistent with normal operation of the de-ice system, and structural icing likely was not a factor in the accident. According to the company's General Operations Manual (GOM), operational control was held by the flight coordinator for the accident flight, and the flight coordinator and pilot-in-command (PIC) were jointly responsible for preflight planning, flight delay, and release of the flight, which included the risk assessment process. The flight coordinator assigned the flight a risk level of 2 (on a scale of 1 to 4) due to instrument meteorological and night conditions and contaminated runways at both of the destination airports. The first flight coordinator assigned another flight coordinator to create the manifest, which listed eight passengers and a risk assessment level of 2. According to company risk assessment and operational control procedures, a risk level of 2 required a discussion between the PIC and flight coordinator about the risks involved. However, the flight coordinators did not discuss with the pilot the risks and weather conditions associated with the flight. Neither of the flight coordinators working the flight had received company training on the risk assessment program. At the time of the accident, no signoff was required for flight coordinators or pilots on the risk assessment form, and the form was not integrated into the company manuals.  A review of Federal Aviation Administration (FAA) surveillance activities revealed that aviation safety inspectors had performed numerous operational control inspections and repeatedly noted deficiencies within the company's training, risk management, and operational control procedures. Enforcement Information System records indicated that FAA inspectors observed multiple incidences of the operator's noncompliance related to flight operations and that they opened investigations; however, the investigations were closed after only administrative action had been taken. Therefore, although FAA inspectors were providing surveillance and noting discrepancies within the company's procedures and processes, the FAA did not hold the operator sufficiently accountable for correcting the types of operational deficiencies evident in this accident, such as the operator's failure to comply with its operations specifications, operations training manual, and GOM and applicable federal regulations.", "probable_cause": "The pilot's decision to initiate a visual flight rules approach into an area of instrument meteorological conditions at night and the flight coordinators' release of the flight without discussing the risks with the pilot, which resulted in the pilot experiencing a loss of situational awareness and subsequent controlled flight into terrain. Contributing to the accident were the operator's inadequate procedures for operational control and flight release and its inadequate training and oversight of operational control personnel. Also contributing to the accident was the Federal Aviation Administration's failure to hold the operator accountable for correcting known operational deficiencies and ensuring compliance with its operational control procedures."}