{"url": "https://www.baaa-acro.com/crash/crash-airbus-a310-204-surat-thani-101-killed", "date": "Dec 11, 1998 at 1910 LT", "type": "Airbus A310", "operator": "Thai-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bangkok - Surat Thani", "msn": "415", "yom": 1988, "flight_number": "TG261", "city": "Surat Thani", "zone": "Surat Thani (สุราษฎร์ธานี)", "country": "Thailand", "region": "Asia", "crew_on_board": 14, "crew_fatalities": 11, "pax_on_board": 132, "pax_fatalities": 90, "other_fatalities": 0, "total_fatalities": 101, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 23028, "circumstances": "Thai Airways International flight 261, an Airbus A310, left Bangkok-Don Mueang International Airport, Thailand at 17:54 hours local time for a domestic flight to Surat Thani. At 18:26 hours, the copilot first established contact with the Surat Thani approach controller while the aircraft was 70 nautical miles away from Surat Thani Airport. The controller radioed that the crew could expect a VOR/DME instrument approach to runway 22. At that time surface wind was calm with a visibility of 1500 meters, light rain and a cloud base of 1800 feet. At 18:39 hours the copilot contacted Surat Thani aerodrome controller and reported over the Intermediate Fix (IF). The controller informed him that the precision approach path indicators (PAPI) on the right side of runway 22 were unserviceable while the left lights were in use. At 18:41 hours, the copilot reported passing final approach fix (FAF). The controller informed the pilot that the aircraft was not in sight but it was cleared to land on runway 22. The surface wind was blowing from 310 degrees at a velocity of 5 knots so the pilots should be careful or the slippery runway. At 18:42 hours, the copilot reported that the runway was in sight and later on the controller also had the aircraft in sight. The pilot decided to go-around. The controller asked the pilot about the distance where the runway could be seen. The copilot reported that it could be seen at 3 nautical miles and requested for the second approach. The controller requested to report over FAF . When the copilot reported that the flight was over the FAF again, the controller cleared the flight to land although he again could not see the runway. When the flight crew failed to observe the runway lights, the captain decided to go around again. Again the controller instructed the flight to report over the FAF and reported that visibility had decreased to 1,000 meters in light rain. At 19:05, after reporting over the FAF, the flight was cleared to land on runway 22. The flight maintained the Minimum Descent Altitude (MDA) but the crew were unable to see the runway. The autopilot was disconnected and a little later the captain decided to go around. The pitch attitude increased continuously. The pitch attitude reached approximately 40°, when the pilot applied the elevator decreasing the pitch attitude to 32-33°. When he discontinued applying elevator the pitch increased to 47-48°. Consequently the speed decreased to 100 knots. The captain was not aware of the attitude due to stress and the expectation that the go around was flown exactly like the first two go-arounds. The airplane lost altitude until it impacted terrain to the left of the runway. 45 people survived and 101 others were killed, including 11 crew members. ", "probable_cause": "After careful consideration. the Aircraft Accident Investigation Committee of the Kingdom of Thailand ultimately came to the conclusion that the accident occurred because the aircraft entered into stall condition which might be caused by the followings:\r\n1. The pilot attempted to approach the airport in lower than minimum visibility with rain.\r\n2. The pilot could not maintain the VOR course as set forth in the approach chart. The aircraft flew left of VOR course on every approach.\r\n3. The pilots suffered from the accumulation of stress and were not aware of the situation until the aircraft emerged into the upset condition.\r\n4. The pilots had not been informed of the document concerning the wide-body airplane upset recovery provided by Airbus Industrie for using in pilot training.\r\n5. The lighting system and approach chart did not facilitate the low visibility approach.\r\n6. Stall warning and pitch trim systems might not fully function as described in the FCOM and AMM."}