{"url": "https://www.baaa-acro.com/crash/crash-cessna-340-garberville-3-killed", "date": "Nov 6, 2007 at 0855 LT", "type": "Cessna 340", "operator": "Roy E. Ladd", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Redding – Garberville", "msn": "340-0016", "yom": 1971, "flight_number": null, "city": "Garberville", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 18500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7691, "circumstances": "The pilot arrived in the vicinity of his destination airport, which was located in a narrow river valley. The airport was located within a large area of Visual Flight Rules (VFR) conditions with clear skies and almost unlimited visibility, but the pilot discovered that the airport was covered by a localized dense layer of fog about 200 to 250 feet thick. There were no instrument approaches to the non-controlled airport. Witnesses reported that the pilot flew at low-level up the valley, and eventually entered the fog as the flight approached the airport. About one mile prior to reaching the airport, the pilot attempted to climb out of the valley, but the airplane began impacting trees on the rising terrain. The airplane eventually sustained sufficient damage from impacting the trees that it descended into the terrain. Post-accident inspection of the airframe and engines found no evidence of a mechanical failure or malfunction.", "probable_cause": "The pilot's intentional visual flight rules (VFR) flight into instrument meteorological conditions (IMC), and his failure to maintain clearance from the trees and terrain during climb. Contributing to the accident were the weather conditions of fog and a low ceiling, and the mountainous/hilly terrain."}