{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130a-hercules-luanda-10-killed", "date": "Jun 10, 1991 at 1542 LT", "type": "Lockheed C-130 Hercules", "operator": "Angola%20Air%20Charter", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Luanda - Cafunfo", "msn": "3099", "yom": 1957, "flight_number": "AGO1228", "city": "Luanda-4 de Fevereiro", "zone": "Luanda", "country": "Angola", "region": "Africa", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The four engine aircraft leased from Carib Air Transport to Angola Air Charter was completing a cargo flight from Luanda to Cafunfo, carrying six passengers, four crew members and a load of various goods for the Luanda Norte Province. Shortly after takeoff from runway 24, while climbing to a height of about 50-60 meters, the aircraft banked right then to the left. It stalled and struck the ground on the right side of the runway and disintegrated. All 10 occupants were killed. ", "probable_cause": "The investigation into the cause of the crash was severely hampered by the fact that the wreckage had been moved from the scene by the orders of an Air Force official, without authorization of the civil aviation authorities (DNAC). Additionally, both flight recorders were not located in the wreckage. The commission found several pieces of debris along the right side of the runway, 300-400 meters from the crash site.\r\n\"The accident is deduced to have originated with a probable internal explosion of an unidentified foreign object that perhaps had as its site of action an area of the fuel storage area on the right wing of the aircraft. When the explosion occurred, it would have caused the craft to dip to the right owing to the lack of support on the aerodynamic planes on that side and then to fall to angle of more or less 45 degrees with runway 24 due to asymmetry in the weight of that wing. Greater weight on the [left] side' may have caused the aircraft to stall, because the first impact actually was made by the tip of the left wing striking the ground, prior to the fire that destroyed it totally.\""}