{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-near-ribnoye-9-killed", "date": "Nov 1, 1962 at 0503 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Plain, Valley", "schedule": "Chita – Krasnoyarsk – Novosibirsk – Omsk – Chelyabinsk – Kuybyshev – Minsk", "msn": "2 34 428 09", "yom": 23, "flight_number": null, "city": "Ribnoye", "zone": "Krasnoyarsk Krai", "country": "Russia", "region": "Asia", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 14950, "circumstances": "The aircraft departed Chita Airport on October 31 on a positioning flight to Minsk with intermediate stops at Krasnoyarsk, Novosibirsk, Omsk, Chelyabinsk and Kuybyshev, carrying a crew of five and four passengers, crew wife's and children. On the leg from Krasnoyarsk to Novosibirsk, weather conditions worsened and the crew elected to gain height due to icing conditions but this was denied by ATC. While cruising at an altitude between 900 and 1,500 meters, the airplane went out of control and entered a dive before crashing in flames in a dense wooded area located near Ribnoye, about 23 km east of Tamozhenka. Due to low clouds and snow falls, rescue teams could be dispatched only a day later but all SAR operations were suspended on November 22 as no trace of the aircraft nor the 9 occupants was found. These operations were restarted in May 1963 and the wreckage was eventually found on May 29, 1963. It was reported the aircraft struck the ground in a 70-80° nose down attitude and disintegrated on impact. Debris were found 200 meters around the point of impact, the engines were found three meters deep into the earth and a part of the right elevator was found 1 km  from the main wreckage. The accident was not survivable. ", "probable_cause": "The accident was the consequence of a loss of control in flight due to an excessive accumulation of ice on the aircraft. The following factors were considered as contributing: \r\n- The operator decided to dispatch a crew who was not familiar with such weather conditions (icing conditions),\r\n- The inexperience of the crew, \r\n- Poor flight organization,\r\n- Lack of coordination between Krasnoyarsk and Novosibirsk control center, \r\n- Lack of assistance from ATC who did not authorized the crew to climb above 2,700 meters where the weather conditions were more suitable. "}