{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-cordoba-6-killed", "date": "May 8, 2005 at 1926 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Borealis Taxi Aéreo", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Juan – Córdoba", "msn": "31-7552076", "yom": 1975, "flight_number": null, "city": "Córdoba-Ambrosio Taravella (Pajas Blancas)", "zone": "Córdoba", "country": "Argentina", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 5914, "captain_hours_type": 240, "copilot_hours": 485, "copilot_hours_type": 24, "aircraft_hours": null, "circumstances": "The twin engine aircraft was completing a charter flight from San Juan to Córdoba with seven passengers and two pilots on board. On approach to Córdoba-Ambrosio Taravella Airport by night, the crew encountered limited visibility due to poor weather conditions. The aircraft descended below the glide and collided with the inner marker antenna located about 700 metres short of runway 18 and crashed. Both pilots and four passengers were killed while three other passengers were seriously injured. Among those killed were the Argentinian racer Nicolas Vuyovich and Gustavo Ramonda, Director of the Toyota Corolla Racing Team who just won a race at the San Juan's autodrome. ", "probable_cause": "During a night approach in IMC conditions, the aircraft collided with the antenna of the inner marker after the crew descended below the MDA and deviated from the approach pattern. The following contributing factors were identified:\r\n- The adverse weather conditions probably produced an optical illusion among the crew,\r\n- The crew had only little training in instrument flights,\r\n- Wrong altimeter setting, \r\n- Absence of crew resources management,\r\n- Poor crew coordination. "}