{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-groton-2-killed", "date": "Jun 2, 2006 at 1440 LT", "type": "Learjet 35", "operator": "International%20Jet%20Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Atlantic City - Groton", "msn": "35-293", "yom": 1980, "flight_number": null, "city": "Groton", "zone": "Connecticut", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 18750, "captain_hours_type": 7500, "copilot_hours": 3275, "copilot_hours_type": 289, "aircraft_hours": 11704, "circumstances": "The crew briefed the Instrument Landing System approach, including the missed approach procedures. Weather at the time included a 100-foot broken cloud layer, and at the airport, 2 miles visibility. The approach was flown over water, and at the accident location, there was dense fog. Two smaller airplanes had successfully completed the approach prior to the accident airplane. The captain flew the approach and the first officer made 100-foot callouts during the final descent, until 200 feet above the decision height. At that point, the captain asked the first officer if he saw anything. The first officer reported \"ground contact,\" then noted \"decision height.\" The captain immediately reported \"I got the lights\" which the first officer confirmed. The captain reduced the power to flight idle. Approximately 4 seconds later, the captain attempted to increase power. However, the engines did not have time to respond before the airplane descended into the water and impacted a series of approach light stanchions, commencing about 2,000 feet from the runway. Neither crew member continued to call out altitudes after seeing the approach lights, and the captain descended the airplane below the decision height before having the requisite descent criteria. The absence of ground references could have been conducive to a featureless terrain illusion in which the captain would have believed that the airplane was at a higher altitude than it actually was. There were\r\nno mechanical anomalies which would have precluded normal airplane operation.", "probable_cause": "The crew's failure to properly monitor the airplane's altitude, which resulted in the captain's inadvertent descent of the airplane into water. Contributing to the accident were the foggy weather conditions, and the captain's decision to descend below the decision height without sufficient visual cues."}