{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1011-385-tristar-1-everglades-national-park-99-killed", "date": "Dec 29, 1972 at 2342 LT", "type": "Lockheed L-1011 TriStar", "operator": "Eastern-Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "New York - Miami", "msn": "N193A-1011", "yom": 1972, "flight_number": "EA401", "city": "Everglades National Park", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 13, "crew_fatalities": 5, "pax_on_board": 163, "pax_fatalities": 96, "other_fatalities": 0, "total_fatalities": 101, "captain_hours": 29700, "captain_hours_type": 280, "copilot_hours": 5800, "copilot_hours_type": 306, "aircraft_hours": 986, "circumstances": "The flight from New York-JFK was uneventful and the crew started the descent to Miami-Intl Airport by night and good weather conditions. On approach, the captain instructed 'gear down' but all three green lights failed to illuminate properly. The second officer was instructed to enter the forward electronics bay but the problem could not be resolved. The crew informed ATC about the situation and was cleared to climb to 2,000 feet. The crew then discussed to try to find a solution but failed to realize that the airplane was continuing to descend. When a warning sounded in the cockpit indicating a +/- 250 feet deviation from the selected altitude, none of the crew members react to the warning sound and no action was taken. At 2341LT, the crew was instructed by ATC to turn heading 180 and a minute later, the first officer realized that something was wrong with the altitude. Seven seconds later, while turning in a left angle of 28°, the left engine struck the ground then the aircraft crashed in the Everglades National Park, about 20 miles short of runway threshold, and disintegrated on impact. 77 people were rescued while 99 others were killed, among them five crew members. More than a week later, two survivors died from their injuries. ", "probable_cause": "Failure of the flight crew to monitor the flight instruments during the final 4 minutes of flight, and to detect an unexpected descent soon enough to prevent impact with the ground. Preoccupation with a malfunction of the nose landing gear position indicating system distracted the crew's attention from the instruments and allowed the descent to go unnoticed. The following findings were reported:\r\n- There was no failure or malfunction of the structure, powerplants, systems, or components of the aircraft before impact, except that both bulbs in the nose landing gear position indicating system were burned out.\r\n- The aircraft struck the ground in a 28' left bank with a high rate of sink.\r\n- There was no fire until the integrity of the left wing fuel tanks was destroyed after the impact.\r\n- The tumor in the cranial cavity of the captain did not contribute to the accident. \r\n- The autopilot was utilized in basic CWS.\r\n- The flight crew was unaware of the low force gradient input required to effect a change in aircraft attitude while in CWS.\r\n- The company training program met the requirements of the Federal Aviation Administration.\r\n- The three flight crewmembers were preoccupied in an attempt to ascertain the position of the nose landing gear.\r\n- The second officer, followed later by the jump seat occupant, went into the forward electronics bay to check the nose gear down position indices.\r\n- The second officer was unable visually to determine the position of the nose gear.\r\n- The flight crew did not hear the aural altitude alert which sounded as the aircraft descended through 1,750 feet msl.\r\n- There were several manual thrust reductions during the final descent.\r\n- The speed control system did not affect the reduction in thrust.\r\n- The flight crew did not monitor the flight instruments during the final descent until seconds before impact.\r\n- The captain failed to assure that a pilot was monitoring the progress of the aircraft at all times"}