{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1049e-55-super-constellation-montego-bay-37-killed", "date": "Jan 21, 1960", "type": "Lockheed L-1049 Super Constellation", "operator": "Avianca-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York – Montego Bay – Barranquilla – Bogotá", "msn": "4556", "yom": 1954, "flight_number": "AV671", "city": "Montego Bay", "zone": "Saint James", "country": "Jamaica", "region": "Central America", "crew_on_board": 7, "crew_fatalities": 2, "pax_on_board": 39, "pax_fatalities": 35, "other_fatalities": 0, "total_fatalities": 37, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Avianca Flight 671, a Lockheed Super Constellation, took off from New York-Idlewild for a flight to Bogotá via Montego Bay and Barranquilla. En route to Montego Bay, the no. 3 engine malfunctioned and was stopped. The flight diverted to Miami, arriving there at 16:57. A replacement propeller governor was fitted, but during pre-flight checks a further defect in the no. 2 engine was found. This was rectified and the flight departed Miami at 00:12, the copilot being the pilot flying. Upon arrival near Montego Bay, clearance was given for a standard instrument approach. The airfield was sighted following the procedure turn at 2,000 feet and the approach was continued visually. Following a heavy touchdown, the plane bounced and landed back on the runway and skidded down the runway in flames, coming to rest inverted, 1,900 feet from the runway threshold and 200 feet to the left. Five crew members and four passengers survived while 37 other occupants were killed. The airplane was destroyed by fire. ", "probable_cause": "The adoption of a final approach path resulting in a heavy landing during which a major structural failure occurred in the port wing in the immediate vicinity of Station 80 joint caused by the transmission of stresses through the undercarriage in excess of those which would be encountered if the rate of sink of the aircraft at the time of impact had been controlled within the designed maximum of 10 feet per second. The primary responsibility for the safety of an aircraft and its complement is vested in the captain. However, there is evidence of mitigating circumstances in that the errors of judgement that precipitated the disaster reflect some deficiency of knowledge which should have been instilled in the training and flight proficiency checking of the pilots of HK-177. A measure of responsibility for the accident must, therefore, devolve on the supervisory and advisory authorities for the overall conduct of the operation."}