{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-8f2-amsterdam-9-killed", "date": "Feb 25, 2009 at 1026 LT", "type": "Boeing 737-800", "operator": "Turkish-Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Istanbul - Amsterdam", "msn": "29789/1065", "yom": 2002, "flight_number": "TK1951", "city": "Amsterdam-Schiphol", "zone": "North Holland", "country": "Netherlands", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 4, "pax_on_board": 128, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 17000, "captain_hours_type": 10885, "copilot_hours": 4146, "copilot_hours_type": 44, "aircraft_hours": null, "circumstances": "Turkish Airlines Flight 1951, a Boeing 737-800, departed Istanbul-Atatürk International Airport (IST) for a flight to Amsterdam-Schiphol International Airport (AMS), The Netherlands. The flight crew consisted of three pilots: a line training captain who occupied the left seat, a first officer under line training in the right seat and an additional first officer who occupied the flight deck jump seat. The first officer under line training was the pilot flying. The en route part of the flight was uneventful. The flight was descending for Schiphol and passed overhead Flevoland at about 8500 ft. At that time the aural landing gear warning sounded. The aircraft continued and was then directed by Air Traffic Control towards runway 18R for an ILS approach and landing. The standard procedure for runway 18R prescribes that the aircraft is lined up at least 8 NM from the runway threshold at an altitude of 2000 feet. The glidepath is then approached and intercepted from below. Lining up at a distance between 5 and 8 NM is allowed when permitted by ATC. Flight 1951 was vectored for a line up at approximately 6 NM at an altitude of 2000 feet. The glide slope was now approached from above. The crew performed the approach with one of the two autopilot and autothrottle engaged. The landing gear was selected down and flaps 15 were set. While descending through 1950 feet, the radio altimeter value suddenly changed to -8 feet. And again the aural landing gear warning sounded. This could be seen on the captain’s (left-hand) primary flight display. The first officer’s (right-hand) primary flight display, by contrast, indicated the correct height, as provided by the right-hand system. The left hand radio altimeter system, however, categorised the erroneous altitude reading as a correct one, and did not record any error. In turn, this meant that it was the erroneous altitude reading that was used by various aircraft systems, including the autothrottle. The crew were unaware of this, and could not have known about it. The manuals for use during the flight did not contain any procedures for errors in the radio altimeter system. In addition, the training that the pilots had undergone did not include any detailed system information that would have allowed them to understand the significance of the problem. When the aircraft started to follow the glidepath because of the incorrect altitude reading, the autothrottle moved into the ‘retard flare’ mode. This mode is normally only activated in the final phase of the landing, below 27 feet. This was possible because the other preconditions had also been met, including flaps at (minimum) position 15. The thrust from both engines was accordingly reduced to a minimum value (approach idle). This mode was shown on the primary flight displays as ‘RETARD’. However, the right-hand autopilot, which was activated, was receiving the correct altitude from the right-hand radio altimeter system. Thus the autopilot attempted to keep the aircraft flying on the glide path for as long as possible. This meant that the aircraft’s nose continued to rise, creating an increasing angle of attack of the wings. This was necessary in order to maintain the same lift as the airspeed reduced. In the first instance, the pilots’ only indication that the autothrottle would no longer maintain the pre-selected speed of 144 knots was the RETARD display. When the speed fell below this value at a height of 750 feet, they would have been able to see this on the airspeed indicator on the primary flight displays. When subsequently, the airspeed reached 126 knots, the frame of the airspeed indicator also changed colour and started to flash. The artificial horizon also showed that the nose attitude of the aircraft was becoming far too high. The cockpit crew did not respond to these indications and warnings. The reduction in speed and excessively high pitch attitude of the aircraft were not recognised until the approach to stall warning (stick shaker) went off at an altitude of 460 feet. The first officer responded immediately to the stick shaker by pushing the control column forward and also pushing the throttle levers forward. The captain however, also responded to the stick shaker commencing by taking over control. Assumingly the result of this was that the first officer’s selection of thrust was interrupted. The result of this was that the autothrottle, which was not yet switched off, immediately pulled the throttle levers back again to the position where the engines were not providing any significant thrust. Once the captain had taken over control, the autothrottle was disconnected, but no thrust was selected at that point. Nine seconds after the commencement of the first approach to stall warning, the throttle levers were pushed fully forward, but at that point the aircraft had already stalled and the height remaining, of about 350 feet, was insufficient for a recovery. According to the last recorded data of the digital flight data recorder the aircraft was in a 22° ANU and 10° Left Wing Down (LWD) position at the moment of impact. The airplane impacted farmland. The horizontal stabilizer and both main landing gear legs were separated from the aircraft and located near the initial impact point. The left and right engines had detached from the aircraft. The aft fuselage, with vertical stabilizer, was broken circumferentially forward of the aft passenger doors and had sustained significant damage. The fuselage had ruptured at the right side forward of the wings. The forward fuselage section, which contained the cockpit and seat rows 1 to 7, had been significantly disrupted. The rear fuselage section was broken circumferentially around row 28.", "probable_cause": "During the accident flight, while executing the approach by means of the instrument landing system with the right autopilot engaged, the left radio altimeter system showed an incorrect height of -8 feet on the left primary flight display. This incorrect value of -8 feet resulted in activation of the ‘retard flare’ mode of the auto-throttle, whereby the thrust of both engines was reduced to a minimal value (approach idle) in preparation for the last phase of the landing. Due to the approach heading and altitude provided to the crew by air traffic control, the localiser signal was intercepted at 5.5 NM from the runway threshold with the result that the glide slope had to be intercepted from above. This obscured the fact that the auto-throttle had entered the retard flare mode. In addition, it increased the crew’s workload. When the aircraft passed 1000 feet height, the approach was not stabilized so the crew should have initiated a go around. The right autopilot (using data from the right radio altimeter) followed the glide slope signal. As the airspeed continued to drop, the aircraft’s pitch attitude kept increasing. The crew failed to recognize the airspeed decay and the pitch increase until the moment the stick shaker was activated. Subsequently the approach to stall recovery procedure was not executed properly, causing the aircraft to stall and crash."}