{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-244b-indian-ocean-159-killed", "date": "Nov 28, 1987 at 0407 LT", "type": "Boeing 747-200", "operator": "South%20African%20Airways2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Taipei – Port Louis – Johannesburg", "msn": "22171", "yom": 1980, "flight_number": "SA295", "city": "Indian Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 19, "crew_fatalities": 19, "pax_on_board": 140, "pax_fatalities": 140, "other_fatalities": 0, "total_fatalities": 159, "captain_hours": 13843, "captain_hours_type": 3884, "copilot_hours": 7362, "copilot_hours_type": 4096, "aircraft_hours": 26743, "circumstances": "On November 27th 1987 flight SA295 was scheduled to depart from Taipei's Chiang Kai Shek Airport at 13:00 UTC for Mauritius' Plaisance Airport and Johannesburg, South Africa on a scheduled international air transport service. Due to adverse weather and the late arrival of a connecting flight the departure time was delayed and the airplane took off at 14:23 UTC with 149000 kg of fuel, 43225 kg of baggage and cargo, 140 passengers and a crew comprising 5 flight crew members and 14 cabin crew members. The calculated flight time was 10 hours 14 minutes. The take-off was normal. At 14:56 UTC the crew communicated with Hong Kong Radar and thereafter routine position reports were given to the flight information centres (FICs) at Hong Kong, Bangkok, Kuala Lumpur, Colombo, Cocos Islands and Mauritius. At 15:55 a routine report was made to the Operator's base at Johannesburg. The information given was that the airplane had taken off from Taipei at 14:23, was flying at FL310 and that the arrival time at Mauritius was estimated as 00:35 UTC. At about 22:30 the pilot called Mauritius FIC, using HF radio, and advised that the aircraft had been at position 070° East at 22:29 at FL350 and that the time at position 065° East was estimated as 23:12. At 23:13 the position report of 065° East at FL350 was given to Mauritius FIC. The estimated time of arrival (ETA) over position 060° East was given as 23:58. About 23:45 the master fire warning alarm sounded on the flight deck. Somebody, probably the pilot, inquired where the warning had come from and received the reply that it had come from the main deck cargo. The pilot then asked that the check list be read. Some 30 seconds later somebody on the flight deck uttered an oath. The pilot called Mauritius Approach Control at 23:49 and said that they had a smoke problem and were doing an emergency descent to FL140. The approach controller gave clearance for the descent and the pilot asked that the fire services be alerted. The controller asked if full emergency services were required to which the pilot replied in the affirmative. At 23:51 the approach controller asked the pilot for his actual position. The pilot replied: \"Now we have lost a lot of electrics, we haven't got anything on the aircraft now\". At 23:52 the approach controller asked for an ETA at Plaisance and was given the time of 00:30. At 23:52:50 the pilot made an inadvertent transmission when he said to the senior flight engineer: \"Hey Joe, shut down the oxygen left\". From this time until 00:01:34 there was a period of silence lasting 8 minutes and 44 seconds. From 00:01:34 until 00:02:14 the pilot inadvertently transmitted instructions, apparently to the senior flight engineer, in an excited tone of voice. Most of the phrases are unintelligible. At 00:02:43 the pilot gave a distance report as 65 nautical miles. This was understood by the approach controller to be the distance to the airport. In fact it was the distance to the next waypoint, Xagal. The distance to the airport at that point was approximately 145 nautical miles. At 00:02:50 the approach controller recleared the flight to FL50 and at 00:03:00 gave information on the actual weather conditions at Plaisance Airport, which the pilot acknowledged. When the approach controller asked the pilot at 00:03: 43 which runway he intended to use he replied one three but was corrected when the controller asked him to confirm one four. At 00:03:56 the controller cleared the flight for a direct approach to the Flic-en-Flac (FF) non-directional beacon and requested the pilot to report on approaching FL50. At 00:04:02 the pilot said: \"Kay\". From 00:08:00 to 00:30:00 the approach controller called the aircraft repeatedly but there was no reply. The aircraft crashed into the Indian Ocean at a position determined to be about 134 nautical miles North-East of Plaisance Airport. The accident occurred at night, in darkness, at about 00:07 UTC. The local time was 04:07. Within a few days drifting pieces of wreckage were found, but it took until January 28th, 1988 for the main wreckage field to be found on the Ocean floor, at a depth of 4400 meters. The cockpit voice recorder was recovered on 6 January 1989.", "probable_cause": "Despite intensive investigation the Board was unable to find or conclude that fireworks or any other illegal cargo were carried in the aircraft. The accident followed an uncontrollable fire in the forward right pallet on the main deck cargo compartment. The aircraft crashed into the sea at high speed following a loss of control consequent on the fire. \r\nFire of an unknown origin had possibly: \r\n1) incapacitated the crew; \r\n2) caused disorientation of the crew due to thick smoke; \r\n3) caused crew distraction; \r\n4) weakened the aircraft structure, causing an in-flight break-up.; \r\n5) burned through several control cables; \r\n6) caused loss of control due to deformation of the aircraft fuselage."}