{"url": "https://www.baaa-acro.com/crash/crash-technoavia-smg-92-turbo-finist-casale-monferrato", "date": "Aug 29, 2015 at 1430 LT", "type": "Technoavia SM-92 Turbo Finist", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Casale Monferrato - Casale Monferrato", "msn": "02-001", "yom": 1993, "flight_number": null, "city": "Casale Monferrato", "zone": "Piedmont", "country": "Italy", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 10, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 600, "captain_hours_type": 35, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 800, "circumstances": "The single engine aircraft departed Casale Monferrato-Francesco Cappa Airfield on a local skydiving mission, the 13th sortie of the day, carrying seven skydivers, three tourists and one pilot). Shortly after rotation from a grassy runway, the pilot encountered engine problems. The aircraft continued in a flat attitude, collided with a hedge and few trees before coming to rest in a wooded area located 300 metres past the runway end. All 11 occupants were injured, some of them seriously. The aircraft was damaged beyond repair. ", "probable_cause": "The accident is the consequence of an engine failure caused by the loss of connection in the power module between the quill shaft and the PT shaft.\r\nThe following contributing factors were identified:\r\n- A control system of the aircraft as part of 'aircraft operator CAMO not sufficiently thorough,\r\n- The inaccurate, non-timely and incorrect reporting by the user of the aircraft of critical parameters for monitoring engine life,\r\n- A national regulation, in force at the time of the accident, relating to the flight activity for launching paratroopers, which did not provide, in fact, adequate surveillance technique by the aeronautical authority on the aircraft used in this activity,\r\n- The absence of adequate retention and safety devices for paratroopers on board the aircraft."}