{"url": "https://www.baaa-acro.com/crash/crash-partenavia-p68c-gainesville-3-killed", "date": "Nov 7, 2008 at 0246 LT", "type": "Partenavia P.68", "operator": "Air%20Key%20West", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Key West - Gainesville", "msn": "273", "yom": 1983, "flight_number": null, "city": "Gainesville", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 8300, "captain_hours_type": 1500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6971, "circumstances": "The pilot of the multiengine airplane was flying two passengers at night on an instrument-flight-rules flight plan. One of the passengers had been on an organ recipient waiting list and his wife was accompanying him. A viable matched organ was available at a distant hospital and the passenger had to arrive on short notice for surgery the following morning. All radio communications during the flight between the pilot and air traffic control (ATC), a flight service station (FSS), and a fixed-based operator (FBO) were routine. The pilot was aware of the weather at the destination airport, and had commented to ATC about 75 miles from the destination that the weather was \"going up and down…like a real thin fog layer.” Additionally, better weather conditions prevailed at nearby suitable airports. The pilot mentioned one of those airports to ATC in the event he decided to divert. According to an employee at an FBO located at the destination airport, the pilot contacted him via radio and asked about the current weather conditions. The employee replied that the visibility was low due to fog and that he could not see the terminal lights from the FBO. The pilot then asked which of the two alternate airports was closer and the employee stated that he did not know. The employee then heard the pilot “click” the runway lights and contact the local FSS. about 5 miles from runway 29, just prior to the initial approach fix, the pilot radioed on the common traffic advisory frequency and reported a 5-mile final leg for runway 29. The FSS reported that the current weather was automated showing an indefinite ceiling of 100 feet vertical visibility and 1/4 mile visibility in fog. The pilota cknowledged the weather information. The weather was below the minimum published requirements for the instrument-landing-system (ILS) approach at the destination airport. Radar data showed that the flight intercepted and tracked the localizer, then intercepted the glideslope about 1 minute later. There were a few radar targets without altitude data due to intermittent Mode C transponder returns. The last recorded radar target with altitude indicated the airplane was at 600 feet, on glideslope and heading for the approach; however, the three subsequent and final targets did not show altitude information. The last recorded radar target was about 1.4 miles from the runway threshold. The airplane flew below glideslope and impacted 100-foot-tall trees about 4,150 feet from the runway 29 threshold. On-ground facility checks and a postaccident flight check of the ILS runway 29 approach conducted by the Federal Aviation Administration did not reveal malfunctions with the ILS. The cabin and cockpit area, including the NAV/COMM/APP, equipment were consumed by a postimpact fire which precluded viable component testing. Detailed examination of the wreckage that was not consumed by fire did not reveal preimpact mechanical malfunctions that may have contributed to the accident. Given that the pilot was aware of the weather conditions before and during the approach, it is possible that the pilot’s goal of expeditiously transporting a patient to a hospital for an organ transplant may have affected his decision to initiate and continue an instrument approach while the weather conditions were below the published minimum requirements for the approach.", "probable_cause": "The pilot's failure to maintain the proper glidepath during an instrument-landing-system (ILS) approach. Contributing to the accident were the pilot's decision to initiate the ILS approach with weather below the published minimums, and the pilot's self-induced pressure to expeditiously transport an organ recipient to a hospital."}