{"url": "https://www.baaa-acro.com/crash/crash-vickers-viscount-exeter", "date": "Jul 17, 1980 at 1953 LT", "type": "Vickers Viscount", "operator": "Alidair Scotland", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Santander - Exeter", "msn": "10", "yom": 1953, "flight_number": null, "city": "Exeter", "zone": "Devonshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 58, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14487, "captain_hours_type": 1540, "copilot_hours": 3895, "copilot_hours_type": 1022, "aircraft_hours": 35121, "circumstances": "The Vickers Viscount aircraft was engaged upon a passenger charter flight from Santander (SDR), Spain to Exeter (EXT). The aircraft arrived at Santander 8 minutes ahead of schedule, at 16:22. The aircraft commander recorded in the Technical Log a fuel state on shut down of 3178 litres and ordered a total fuel load of 5902 litres for the return flight, that is 454 litres less than the figure for full tanks. Whilst the aircraft commander was with the handling agents, the co-pilot supervised the refuelling. He requested a total uplift of 2720 litres and wrote the figures down, showing them to the senior of the two operators of the refuelling vehicle, which was not the one that had refuelled the aircraft on its earlier flight that day. On this previous flight, intermittent contact at the external electrical supply socket caused the aircraft's refuelling valve to open and close intermittently, interrupting the refuelling process. The refuelling was therefore completed using electrical power from the aircraft batteries. With the aircraft obtaining its electrical power from the same ground power unit as before apparently quite satisfactorily, the operators then refuelled the two sides of the aircraft one after the other, using the same hose each time. When the refueller finished pumping, its indicators recorded a total delivery of 2720 litres and the co-pilot, who had watched the operation, checked the figures and signed the delivery note accordingly. Neither pilot made a physical check of the aircraft's tanks using the dripsticks. Both fuel contents gauges had a history of defects. A recurrent problem in the port fuel gauge was recorded in the Technical Log as a deferred defect, expressed as 'port fuel contents gauge fluctuating occasionally, ie full scale deflection; rectification being carried forward until the next check'. The starboard gauge also had a defect. The aircraft commander did not draw the co-pilot's attention to this entry, who remained unaware of it. Before starting engines the pilots again set the flow meter totals at zero. The aircraft left Santander at 17:33 and was shortly afterwards cleared to its planned cruising level of Flight Level 180. The planned flight time was 2 hours and 9 minutes, with an expected fuel consumption of 3375 litres, leaving a reserve of 2527 litres. At 18:46 the aircraft passed over Nantes. The flow meters then indicated that 1964 litres had been consumed, which was exactly according to the navigation plan and the crew therefore recorded that at that moment 3320 kg (4150 litres) remained in the aircraft tanks. At approximately 19:10 whilst in the area of Dinard, the fuel contents gauges began to cause them some concern. The port gauge, with various fluctuations, occasionally fell to zero, but sometimes read full. The starboard gauge gave a reading equivalent to 500 litres and continued to fall steadily as the flight progressed. The pilots reviewed the fuel situation and although uneasy, considered that in the light of the recorded uplift and the totals on the flow meters, that they must have ample fuel on board. As the aircraft approached Guernsey the aircraft commander considered diverting there in order to take on more fuel, but after further thought decided against this action. At 19:28 when the aircraft was between Guernsey and Berry Head, it received initial descent clearance and shortly afterwards was further cleared to Flight Level 40 on a direct track for the Exeter NDB. At 19:42 the crew changed frequency to Exeter approach and started to receive radar positioning for runway 26. The cloud was given as one okta at 700 feet, 5 oktas at 1000 feet, and 7 oktas at 2500 feet, with a visibility of 13 kilometres and a surface wind of 280 degrees at 7 knots. At 19:44 the crew performed the approach checks, which included selecting flap to 20 degrees and switching on the fuel heaters. As fuel heat was selected, there was momentary flash from one of the two low pressure warning lights and after a brief discussion the crew opened the fuel crossfeed cocks, which had been closed since their pre-flight checks at Exeter. At 19:50 the aircraft was at 2000 feet QFE, just below cloud and about 8 miles from touchdown. The flap was still at 20 degrees and the undercarriage was retracted. Suddenly both low pressure fuel warning lights illuminated and in rapid succession all four engines lost power. The aircraft commander made an immediate Mayday call to Exeter and at the same time gave a warning on the passenger address system. Knowing the local terrain, the commander turned left in the best hope of finding a suitable area for a forced landing. With the flap still set at 20 degrees, the aircraft descended on a heading of approximately 190 degrees (magnetic) along a small grassy valley studded with trees, the average elevation of which was 130 feet amsl. As the aircraft crossed the boundary of the field, the port wing struck a tree, damaging the underskin and removing the mid section of the port flap. It then touched down with the nose well up, with the stall warning in operation and the control column hard back. The rear of the fuselage struck the ground first and almost simultaneously the port wing struck a tree causing a noticeable yaw to the left as the nose pitched down. Without hitting any further obstruction the aircraft came to rest after 307 metres on a heading of 074 degrees (magnetic). The crew assisted with the subsequent evacuation, which was orderly and there were no injuries. The total flight time since takeoff from Santander had been 2 hrs 20 minutes, with a fuel consumption, according to the flow meters, of 3458 litres. On examination, all fuel tanks were found to be empty.", "probable_cause": "The accident was caused by the aircraft running out of fuel due to the crew's erroneous belief that there was on board sufficient fuel to complete the flight. The aircraft's unreliable fuel gauges, the company pilots' method of establishing the total fuel quantity and lack of precise company instructions regarding the use of dripsticks were major contributory factors. Meter indications on the refuelling vehicle at Santander, which cannot have reflected the quantity of fuel delivered, are also considered to have been a probable contributory factor."}