{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-leesburg-1-killed", "date": "Dec 24, 2012 at 1435 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "John Thomas Fetcko", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Crescent City - Leesburg", "msn": "31-7952047", "yom": 1979, "flight_number": null, "city": "Leesburg", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3000, "captain_hours_type": 900, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4912, "circumstances": "The pilot and the pilot-rated passenger were flying from their home, which was located at a residential airpark where no fuel services were available, to an airport located about 37 miles away. According to the passenger, shortly after departure, she queried the pilot about the airplane's apparent low fuel state. The pilot responded that one of the fuel gauges always indicated more available fuel than the other, and that if necessary they could use fuel from that tank. However, about 15 minutes after departure, the pilot advised air traffic control that the airplane was critically low on fuel. About 5 minutes later, both engines lost total power, and the airplane descended into trees and terrain. Examination of the airframe and engines after the accident confirmed that all of the airplane's fuel tanks were essentially empty, and that the trace amounts of fuel recovered were absent of contamination. Based on the autopsy and toxicology results, the pilot had emphysema, hypertension, dilated cardiomyopathy, and severe coronary artery disease; however, given that the passenger did not report any signs of acute incapacitation, and that the pilot did not communicate any medical issues to air traffic control, it does not appear that these conditions affected his performance on the day of the accident. The pilot did not report any chronically painful conditions to the FAA in his most recent medical certificate applications; however, postaccident toxicology tests indicated that the pilot was taking several pain medications (diclofenac, gabapentin, and oxycodone) and one illegal substance (marijuana). Based on the medications' Food and Drug Administration warnings, gabapentin and oxycodone may be individually impairing and sedating; their combined effect may be additive. The effects of the underlying conditions that necessitated the medication could not be determined. It is impossible to determine from the available information what direct effect the marijuana alone may have had on the pilot's judgment and psychomotor functioning; however, the combination of marijuana, oxycodone, and gabapentin likely significantly impaired the pilot's judgment and contributed to his failure to ensure the airplane had sufficient fuel to complete the planned flight.", "probable_cause": "The pilot's inadequate preflight planning, which resulted in fuel exhaustion and a subsequent total loss of power in both engines during cruise flight. Contributing to the accident was the pilot’s use of prescription and illicit drugs, which likely impaired his judgment.\n"}