{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-near-san-antonio-del-bravo-4-killed", "date": "Sep 14, 2008 at 1318 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Volare Air Charter Company", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Mountains", "schedule": "El Paso - Presidio", "msn": "421B-0346", "yom": 1973, "flight_number": null, "city": "San Antonio del Bravo", "zone": "Chihuahua", "country": "Mexico", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On September 15, 2008 Cessna 421B, N7560Q, was substantially damaged after it collided with mountainous terrain approximately 28 miles northwest of Ojinaga, Mexico, near the border town of Presidio, Texas. The air transport rated pilot and the three passengers were fatally injured. The pilot contacted the Fort Worth Automated Flight Service Station (AFSS), Fort Worth, Texas, at 1016, approximately 15 minutes after he departed El Paso International Airport, El Paso, Texas, and filed a visual flight rules flight plan to Presidio, Texas. The pilot informed an AFSS specialist that he intended to enter Mexican airspace for the purpose of flying over the Luis Leon Dam, but had no intentions of landing in Mexico. The pilot did not request a weather briefing for the flight however, he was informed by the specialist that visual flight rules were not recommended due to mountain obscuration. Onboard the airplane were the pilot, the United States and Mexican Commissioners of the International Boundary and Water Commission (IBWC), and the Executive Director for the Rio Grande Council of Governments. The purpose of the flight was to assess Rio Grande flood conditions at Presidio-Ojinaga and to coordinate joint US-Mexican efforts with local officials to address flood control concerns in the area due to heavy inflows to the Rio Grande from reservoirs inside Mexico as a result of recent storms. The airplane wreckage was located on September 17, 2008, by the Marfa Sector of the US Customs and Border Protection Air and Marine Division, on the west side of the Sierra Grande Mountains, at an approximate elevation of 6,500 feet mean sea level (msl). The airplane came to rest approximately 100-150 feet below the top of a ridgeline on a heading of 055 degrees along victor-airway V81.", "probable_cause": null}