{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-20-dl-perth-18-killed", "date": "Jul 2, 1949 at 0215 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "MMA-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Perth – Carnarvon – Darwin", "msn": "9350", "yom": 1943, "flight_number": "MV772", "city": "Perth", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 14, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 18, "captain_hours": 3500, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "After a night takeoff, while climbing to a height of 600 pieds, the aircraft christened 'Fitzroy' nosed down and plunged into the earth, crashing in a huge explosion with flaps and undercarriage retracted. The aircraft was totally destroyed and all 18 occupants were killed. ", "probable_cause": "The report confirmed that the crash occurred because the aircraft stalled and the pilots were unable to regain control. However, the evidence was not sufficient to allow determination of what caused the stall. The report conceded that over-loading of the aircraft's rear baggage compartment may have contributed to the stall. The inquiry was critical of the operator and the Department of Civil Aviation. In particular, it was critical of the operator's poor standards of maintenance of aircraft instruments. For this reason, the inquiry recommended the operator's airline licence should be suspended or cancelled. It also considered the Department should have made more checks of the operator's methods and record keeping. The Minister declined to take action against the operator, saying its maintenance record keeping had improved significantly since the accident. He also cited the hardship that would be inflicted on many remote communities in Western Australia if the operator's airline licence were to be suspended or cancelled."}