{"url": "https://www.baaa-acro.com/crash/crash-cessna-560-citation-v-ultra-fairoaks", "date": "Sep 26, 1998 at 0703 LT", "type": "Cessna 560 Citation V Ultra", "operator": "Gamston Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sheffield - Fairoaks", "msn": "560-0413", "yom": 1997, "flight_number": null, "city": "Fairoaks", "zone": "Surrey", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14500, "captain_hours_type": 400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew left Sheffield in VP-CKM at 0622 hrs for their flight planned destination of Fairoaks with London Heathrow Airport as an alternate. By 0650 hrs they were in contact with the Aerodrome Flight Information Service Officer (AFISO) at Fairoaks but the AFISO advised the crew not to land until the normal operating time at 0700 hrs when the airfield would have fire cover available. The current weather was reported to the crew by the AFISO as follows: Sky clear; mist with a visibility of 1,200 metres; surface wind 060° less than 5 kt; QNH 1002 mb and QFE 1005 mb. The commander, who was the handling pilot, approached the airfield on a track of 060° using the Fairoaks Non-directional Radio Beacon (NDB) and the aircraft's Flight Management System (FMS), and descended to 1,000 feet agl with the intention of landing on Runway 06. However, neither pilot saw the airfield until they were overhead and, in agreement with the AFISO, decided  to make an approach to Runway 24 because of better visibility in that direction. The AFISO switched on the Abbreviated Precision Approach Path Indicators (APAPIs) for Runway 24 and the commander flew a tear drop pattern to the east of the airfield and then established the aircraft on a track of 240° towards the airfield. During the pattern, the gear had been selected down and the flaps set to an intermediate position. At 1.8 nm DME range, the co-pilot saw the APAPIs slightly left of the aircraft nose and pointed them out to the commander; at the time, the co-pilot recalled that the APAPIs were showing 'two whites', the aircraft was at 1,000 feet agl and at 124 kt IAS. By now, the crew had been advised to land at their discretion with the wind calm. Subsequently, full flap was selected and the commander noted his speed on short finals as 104 kt. As VP-CKM approached the threshold, the commander called for the deployment of speedbrakes; as the co-pilot deployed the speedbrakes, he noted the DME range as 0.5 nm and that the FMS indicated a tailwind of 5 kt. The commander considered that touchdown was positive and just beyond the threshold; the co-pilot considered that touchdown was just past the APAPIs. Immediately after touchdown, the commander selected full thrust reverse on both engines and applied moderate wheel braking. Initially, he considered that the retardation seemed adequate but then seemed to reduce. The co-pilot was not aware of retardation and remembered applying maximum brake pedal pressure while noticing that the runway was damp and seemed \"shiny\". When he realised that he could not stop the aircraft before the end of the runway, the commander stowed the thrust reversers and attempted to close down the engines. During the later part of the landing run, the co-pilot heard a call of \"going round\" and saw the commander stow the thrust reversers. After leaving the runway, the aircraft travelled for 250 metres before coming to rest. The passenger evacuated through the cabin escape hatch and the co-pilot followed him after an unsuccessful  attempt to open the normal cabin door. The co-pilot was then able to open the cabin door from the outside and assist the commander to leave. The commander had sustained back injuries and the copilot had received some cuts and bruises.", "probable_cause": "Investigation indicated that there was no technical reason for the aircraft to overrun the runway. One factor outside the crew's control was that the APAPIs were not set at the glideslope angle described in the Jeppesen approach charts. However, the error was one quarter of one degree and should not have affected the touchdown point of the aircraft. Additionally, the crew stated that the APAPIs showed 'two whites' when first acquired and made no mention of them during the approach; it seems likely that the commander was flying his approach to land close to the threshold. Prior to departure, the commander checked the landing distance required for the expected weight of VP-CKM at Fairoaks and calculated that he had 30 to 40 metres longer than required based on zero surface wind. This calculation was subsequently confirmed as reasonable for a landing on Runway 24. However, the initial approach into Fairoaks was for Runway 06 which has a landing distance some 53 metres less than Runway 24. Therefore, the landing distance available on Runway 06 was less than that required by the Flight Manual by at least 13 metres. The commander was unable to land on Runway 06 because of the into sun visibility and so landed on Runway 24. For the approach to Runway 06, the surface wind was reported as 060° less than 5 kt and, for the subsequent approach to Runway 24 the surface wind was reported as calm. The landing distance available on Runway 24 was more than that required by the Flight Manual on a dry runway with no wind. However, the reported surface winds indicated a possibility that the aircraft could experience some tail wind component during the landing and the co-pilot also noted that the FMS displayed a tailwind of 5 kt as he deployed the speedbrakes. The presence of mist could indicate a runway surface other than dry and the co-pilot also noted that the runway was damp and seemed \"shiny\". Against these factors, the commander would have considered the added advantage of using thrust reversers. Nevertheless, since the commander was not applying any recommended safety factors, it would have been prudent for him to ensure that his approach and  touchdown were accurate. He considered that his speed was close to that required as he approached the threshold and that the landing was just beyond the threshold. However, the co-pilot considered that the touchdown was just past the APAPIs positioned 142 metres from the threshold. Outside observers noted the touchdown as between 1/3 and 1/2 way down the runway and this view was corroborated by calculations from the CVR and radar information. The speed on touchdown, as assessed from the recorded information, was close to that required. From touchdown to leaving the paved runway surface, took a period of 11.5 seconds. Thrust reverse was used for three seconds and deselected some 6 seconds before the aircraft left the runway. As thrust reverse was deselected, the commander called \"we're going round\". This would indicate that the commander became concerned during his landing roll that he would not be able to stop in the distance available and deselected thrust reverse in preparation for a Go-Around. However, the Flight Manual warns that a Go-Around should not be attempted once thrust reverse has been selected. Since there was no evidence from the CVR that power was subsequently advanced, it seems likely that the commander immediately decided against this option. However, the action of deselecting thrust reverse reduced the aircraft rate of deceleration as the runway end approached and resulted in a longer overrun. The commander subsequently stated that he cancelled reverse thrust to enable him to shut down the engines and reduce the risk of fire in what was, by then, obviously going to be an overrun. "}