{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-point-lookout-1-killed", "date": "Nov 15, 1996 at 1300 LT", "type": "De Havilland DHC-2 Beaver", "operator": "Leafair", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Kotupna - Kotupna", "msn": "1535", "yom": 1963, "flight_number": null, "city": "Point Lookout", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1400, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On the morning of the accident, the pilot and the loader-driver left Armidale in the aircraft between 0715 and 0730 and flew to the property \"KOTUPNA\". The task required the aircraft to operate from an agricultural strip 4,400 ft above mean sea level. Superphosphate spreading operations commenced between 0745 and 0800 and continued for approximately 1.5 hours after which the pilot and driver refuelled the aircraft and had a break. The pilot remarked to the driver that the aircraft was going very well and requested him to load a tonne of superphosphate. Operations resumed for about 1.5 hours and then ceased again whilst the aircraft was refuelled. After refuelling, the driver and the pilot had lunch and a break for about half an hour. The pilot again advised the loader driver that he would take a tonne, as the aircraft was performing well. After warming up the engine, the pilot made a normal take-off in a northeasterly direction and banked to the left to head southwest to the treatment area. The driver observed that the aircraft was lower and closer into the strip than had been the normal route to the treatment area. The aircraft did not seem to be climbing sufficiently to pass over the hill in front of it. The aircraft was then seen to be in a climbing left turn, toward the driver with superphosphate dumping from it. The aircraft's left wingtip contacted the ground after which the aircraft cartwheeled and came to rest 200-300 meters from the superphosphate dump. The driver ran down to the aircraft and found the pilot still strapped in the seat with no apparent sign of life. He moved the pilot clear of the aircraft in case of fire and then summoned help.", "probable_cause": "The following factors were reported:\r\n- Wind conditions, which were conducive to windshear and turbulence, were present in the area.\r\n- The aircraft was climbing at near maximum weight.\r\n- The aircraft was climbing into rising ground.\r\n- The aircraft was operating at a high-density altitude, which would have placed it near its performance limit.\r\n- Control of the aircraft was lost with insufficient height to effect recovery."}