{"url": "https://www.baaa-acro.com/crash/crash-hawker-siddeley-hs121-trident-1e-140-bilbao", "date": "Sep 15, 1975 at 1548 LT", "type": "Hawker Siddeley HS.121 Trident", "operator": "British%20Airways-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bilbao - London", "msn": "2138", "yom": 1969, "flight_number": "BA552", "city": "Bilbao-Sondica", "zone": "Basque Country", "country": "Spain", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 110, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10895, "captain_hours_type": 1685, "copilot_hours": 5359, "copilot_hours_type": 782, "aircraft_hours": 12892, "circumstances": "The taxi drills were actioned by the First Officer and the Flight Engineer during this time and \"runway items\" were completed after the Commander turned the aircraft through 180° close to the threshold of runway 28, aligned it on the runway centre line, and selected the wheel brakes to park. A power setting of 100 per cent thrust was made, all engine indications were checked as correct, and the engine relight switches were selected 'ON' before the wheel brakes were released and the takeoff run commenced at about 13:46 with the Commander piloting the aircraft. The aircraft accelerated normally ; the First Officer called out the indicated airspeeds at 80 knots and 100 knots and made a call of 'Wet V1' at 117 knots then removed his hand from the throttles. At the time or just after 'Wet V1' was called the Flight Engineer and the First Officer heard a noise which the latter crew member attributed to the aircraft's entry into standing water. According to the Flight Engineer the aircraft appeared to decelerate at the same time that he heard the noise. The Commander felt a marked deceleration consistent with a loss of engine power, whereupon he immediately closed the throttles, called \"Abandon\", deployed the airbrakes and lift dumpers and applied the wheel brakes fully. However according to the Flight Engineer all engine indications had been normal prior to the closing of the throttles. On seeing a hand close the throttles the First Officer selected emergency reverse thrust on the pod engines, checked the engine indications were correct and maintained the application of emergency reverse thrust until the aircraft eventually came to rest. The First Officer and the Commander checked the indicated pressures on the wheel brake gauges which showed the wheel brakes were fully applied. The initial deceleration felt satisfactory to the crew, then quickly deteriorated and the First Officer formed the impression that the aircraft was aquaplaning. The Flight Engineer then noticed that the aircraft had begun to drift gradually to the left of the runway centreline apparently as the result of a deliberate action by the Commander. Subsequently it became evident to the Commander that he could not bring the aircraft to a halt within the runway confines. Some 200 metres to 300 metres before the end of the runway he turned the aircraft to the left using nose-wheel steering and applied full left rudder. As the nose wheels ran off the runway onto the grass, the aircraft slewed to the left then skidded broadside to the right for a short distance before it came to an abrupt stop at the side of the runway in a right wing down attitude with the right wing tip close to the threshold lights of runway 10. Evacuation drills were initiated and the passengers left the aircraft in a reasonably orderly manner, the majority by slide from the main exit doors and foremost right overwing emergency exit. Catering equipment in the galleys came out of stowage during the accident obstructing access to the forward emergency exit door and preventing use of this exit and its slide during the evacuation. All 117 occupants escaped uninjured while the aircraft was considered as damaged beyond repair. ", "probable_cause": "The accident was caused by the Commander's decision to abandon take-off on a wet runway at or close to V 1 . Contributory factors were the low effective braking coefficient of friction achieved by the aircraft and the failure of the Commander to ascertain the extent and depth of water present on the runway prior to takeoff."}