{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh106-comet-4c-mumbai-63-killed", "date": "Jul 28, 1963 at 0150 LT", "type": "De Havilland DH.106 Comet", "operator": "United-Arab-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Tokyo – Hong Kong – Bangkok – Bombay – Bahreïn – Cairo", "msn": "6441", "yom": 1960, "flight_number": "MS869", "city": "Mumbai", "zone": "Maharashtra", "country": "India", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 55, "pax_fatalities": 55, "other_fatalities": 0, "total_fatalities": 63, "captain_hours": 14841, "captain_hours_type": 1473, "copilot_hours": 5463, "copilot_hours_type": 475, "aircraft_hours": null, "circumstances": "Flight 869 was a scheduled international flight from Tokyo, Japan to Cairo, United Arab Republic via Hong Kong, Bangkok, Bombay and Bahrain. A crew change was effected at Bangkok. Based on the tape recordings of messages exchanged between the aircraft and Santa Cruz approach and radar control, the flight was reconstructed. It was uneventful until 2016 hours GMT when it reported arriving over the Santa Cruz VOR at 7 000 ft. It was cleared to descend to 4 000 ft over the VOR and was requested to report what type of approach would be carried out for landing on runway 09. The aircraft reported it would follow the ILS back beam procedure. It was advised by Santa Cruz approach that the back beam of the ILS was not flyable but that it could home on the 270° radial of the VOR. The aircraft agreed to do a VOR letdown for runway 09, and shortly thereafter reported it was leaving 7 000 ft outbound over the sea on the 272° radial of the VOR. At 2018 Santa Cruz radar, which was monitoring the flight, warned it that if it flew more than 6 or 7 miles west of the field it would run into very heavy turbulence. Shortly thereafter the flight requested permission to make a left-hand procedure turn instead of the normal right-hand turn. This was granted. At 2019 the flight commenced the procedure turn inbound. Santa Cruz radar advised the flight that it was then 6 miles west-northwest of the field. Flight 869 acknowledged this message and was not heard from again. During the turn in severe turbulence and heavy rain the pilot lost control of the aircraft. It was found later on that the air- craft had crashed into the sea 9 NM west of Madh Island at approximately 2020 hours. ", "probable_cause": "The committee was faced with difficulties during the course of the investigation due to the fact that neither the exact location of the wreckage could be fixed no the wreckage salvaged. Moreover, the accident occurred suddenly with no airborne emergency reported and late at night over the sea in limited visibility. There were no eyewitnesses. However, in the presence of the facts available, it can be concluded that the accident was probably due to loss of control while turning in severe turbulence and heavy rain."}