{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-51-acapulco-6-killed", "date": "Aug 13, 1966 at 0215 LT", "type": "Douglas DC-8", "operator": "Aeronaves%20de%20Mexico", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Mountains", "schedule": "Acapulco - Acapulco", "msn": "45652", "yom": 1962, "flight_number": null, "city": "Acapulco", "zone": "Guerrero", "country": "Mexico", "region": "Central America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 15712, "captain_hours_type": 1256, "copilot_hours": 13630, "copilot_hours_type": 7, "aircraft_hours": 10030, "circumstances": "After an uneventful scheduled flight from New York, U.S.A. to Acapulco, Mexico, with an intermediate stop at Mexico City, the aircraft arrived at Acapulco International Airport at 0012 hours local time. It was then serviced and refuelled and took off from runway 10 at approximately 0114 hours on a local crew training flight. At about 0150 hours the aircraft reported over the station at 16 000 ft and requested clearance from the tower to carry out a simulated descent. Clearance was granted and the aircraft was instructed to report at 6 000 ft overhead which it did and was seen by the tower controller who then requested it to report on procedure turn. The aircraft reported on procedure turn at 2 500 ft and this was the last message received. At approximately 0215 hours explosions were heard and a fire was reported southeast of the airport. The wreckage was found on the slope of Mt El Salado, about 33 km from Acapulco Airport. The aircraft was totally destroyed and all six crew members were killed. ", "probable_cause": "Careless and untimely descent in the course of a procedure turn which wan continued below established minimum altitude. The following findings were reported:\r\n- Weather was not a factor in this accident,\r\n- The aircraft was carrying out a simulated descent approach procedure and the desCe2t from 2 500 ft was initiated in the middle of the procedure turn, whereas according to the standard procedure it should have been initiated on completion of the procedure turn when the aircraft was aligned with the runway. The aircraft's descent was continued below the minimum altitude limit until the aircraft struck the ground in a nearly level attitude, slightly banked to the right, with the undercarriage extended and 50° of flaps (instead of the normal 35°), \r\n- No evidence of a malfunction or failure of the aircraft, its engines or equipment, or of a loss of control of the aircraft was found,\r\n- Evidence of complacency in the supervision of the flight was found. "}