{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-13-san-juan", "date": "Sep 24, 1998 at 1319 LT", "type": "Convair CV-240", "operator": "Trans Florida Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Juan – Santiago de Cuba ", "msn": "140", "yom": 1949, "flight_number": "TFA237", "city": "San Juan-Luis Muñoz Marín (Isla Verde)", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7772, "captain_hours_type": 1409, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 33835, "circumstances": "During the initial takeoff roll, there was a fluctuation of Brake Mean Engine Pressure (BMEPa measurement of engine output) on #2 engine, and the pilot elected to abort the takeoff. The pilot completed two additional engine run-ups, and no abnormalities were noted. During the second attempted takeoff, and as the airplane climbed through 200 feet MSL, a loud bang or back fire from the #2 engine was heard. BMEP fluctuated and dropped showing about 150 BMEP difference with engine #1. The engine oil temperature started to rise rapidly, the engine oil pressure dropped and the airplane started to vibrate. The first officer reduced the #2 engine to 'dry' power, upon which a second bang or backfire was heard from the #2 engine. The #2 propeller was then feathered by the First Officer. Since altitude could not be maintained, the pilot ditched the airplane in the salt water lagoon. An FAA Inspector who examined the crash site noted that the right engine propeller was not fully feathered, and the wing flaps were extended about three degrees.. The airplane was recovered from the water 70 days after the accident. The flight crew completed the engine out emergency procedure in accordance with the prescribed checklist. ", "probable_cause": "The loss of power in the No. 2 engine for undetermined reasons, and the inability of the pilot to establish a climb and/or maintain altitude. A factor was the incompletely feathered No. 2 propeller."}