{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6-ndola-16-killed", "date": "Sep 17, 1961 at 2213 LT", "type": "Douglas DC-6", "operator": "Transair%20Sweden", "flight_phase": "Landing (descent or approach)", "flight_type": "Humanitarian", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Léopoldville - Ndola", "msn": "43559", "yom": 1952, "flight_number": "UNO001", "city": "Ndola", "zone": "Copperbelt", "country": "Zambia", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 11, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": 8000, "captain_hours_type": 1350, "copilot_hours": 2700, "copilot_hours_type": 720, "aircraft_hours": null, "circumstances": "The airplane was conducting a special flight (UNO001) from Léopoldville to Ndola on behalf of the United Nations Organizations, carrying five crew members and a 11 passengers, among them Dag Hammarskjöld, United Nations General Secretary. During the final approach to Ndola by night, the four engine aircraft was too low, struck trees and crashed in flames in a wooded area located 15 km short of runway. The aircraft was totally destroyed and all 16 occupants have been killed.  ", "probable_cause": "It was strongly urged that the Commission should not conclude that the accident was due to pilot error. Reasons have been given for saying that other suggested causes were not really possible. Reasons have also been given for concluding that the approach was made by a visual descent procedure in which the aircraft was brought too low. It could not be said whether that came about as a result of inattention to the altimeters or misreading of them. The Commission felt it must conclude that the aircraft was allowed, by the pilots, to descend too low. In so doing it struck trees and crashed.\r\nCOMMENTS FROM THE UNITED NATIONS:\r\nThe Commission has carefully examined all possible causes of the accident. It has considered the possibility of sabotage or of attack and the material or human failures which could have resulted in an accident. It has found no evidence to support any of the particular theories that have been advanced nor has it been able to exclude the possible causes which it has considered. In this connexion it notes that the United Nations and the Swedish Observers who participated in the work of the Rhodesian Board of Investigation also expressed the opinion that it was impossible to exclude any of the possible causes which they considered or to establish an order of priority among them. With respect to sabotage it has noted that the aircraft was without special guard while it was at N'Djili Airport in Léopoldville and access to it was not impossible. The Commission is aware that there are many possible methods of sabotage. No evidence of sabotage has come to its attention but the possibility cannot be excluded. The possibility of attack from either the air or the ground has also been fully examined. The Commission has found no evidence that an attack of any kind occurred It has also noted the opinion of experts that it is improbable that the plane would have been in the apparently normal approach position indicated by the crash path and wreckage analysis had it been under attack. Nevertheless, it cannot exclude attack as a possible cause of the crash. The Commission has also considered various possibilities of material failure, including technical or structural defects, altimeter failure or fire in flight. A thorough analysis of that part of the wreckage capable of being examined was made by technical experts, including members of the Rhodesian Board of Investigation and United Nations and Swedish observers. The altimeters were examined in the United States by the Civil Aeronautics Board and the manufacturer. No evidence of material failure of the aircraft was found, but this possibility cannot be excluded, mainly because of the destruction of a major part of the aircraft by fire. The Commission also considered various possibilities of human failure. It found no evidence that any of the pilots had been incapacitated. It cannot, however, completely exclude this possibility as some forms of incapacity might not be revealed by a post-mortem examination, It also considered various possibilities of pilot error, including the use of a wrong instrument approach chart or a misreading of altimeters. It noted that the Rhodesian inquiry, by eliminating to its satisfaction other possible causes, had reached the conclusion that the probable cause of the crash was pilot error. The Commission, while it cannot exclude this possibility, has found no indication that this was the probable cause of the crash. The Commission considered the possibility that during the course of a visual or semi-visual approach or through the use of an instrument procedure involving a descending turn, the aircraft might have come below the accepted safety margin of 1 000 ft above ground level. On some landing charts, information concerning exact elevations in the approach area is not provided and should the aircraft have descended below the accepted margin a momentary distraction, either from inside or outside the aircraft, might have caused the pilot to lose the remainder of his margin of safety. The Commission however, has found no evidence that this could have been a possible cause of the crash. The Commission considers it its duty to record that it has examined the various rumors that have come to it, attention concerning the cause of the crash and has found no evidence in their support."}