{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-5-do-skymaster-douala-5-killed", "date": "Jun 13, 1961 at 1933 LT", "type": "Douglas C-54 Skymaster", "operator": "Air Cameroon", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Douala - Douala", "msn": "7473", "yom": 1944, "flight_number": null, "city": "Douala", "zone": "Littoral", "country": "Cameroon", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 13412, "captain_hours_type": 212, "copilot_hours": 1142, "copilot_hours_type": 62, "aircraft_hours": null, "circumstances": "The crew as performing a local night training flight at Douala Airport. After completing several maneuvers at the end of the afternoon with departures alternately from runway 12 and 30, the crew started a new takeoff from runway 12. After liftoff, the airplane encountered difficulties to gain height when the propeller on engine number 2 struck a tree located 1,200 meters past the runway end. The airplane continued at low height and struck a second tree, causing a fuel tank to be ruptured and to catch fire. In the mean time, the propellers on engine number one, two and four detached and the airplane eventually crashed in a huge explosion 200 meters farther. All five crew members were killed. ", "probable_cause": "The accident was caused by flight at too low an altitude during a night training exercise. According to witnesses, the instructor had directed the pilot to circle the runway at an altitude of 150 ft during the first training exercise; it appears that this instruction was maintained for the same exercise by night. Assuming that take-off was made with flaps extended, it so happened that complete retraction of the flaps occurred practically at the time of impact with the first tree. In fact, it can be estimated that the flight lasted 30 - 40 seconds from the time of take-off to impact with the first tree. Retraction of the landing gear takes ' 15 seconds and of the flaps approximately 10 seconds. Rapid retraction of the flaps at low speed causes the aircraft to nose down, It is possible that the loss of altitude occurred just before reaching the curtain of trees. Flaps are normally retracted gradually after reaching an altitude of 200 feet in visual meteorological conditions and 400 ft in instrument meteorological conditions or at night. The normal path of a DC-4 with one engine on reduced-power at take-off, climbing speed 400 - 500 ft/min, made it impossible for the aircraft to clear the tops of the trees which it struck. Assuming the take-off was made without flaps - a manoeuvre not recommended during night flights at Douala - the path followed would have inevitably brought the aircraft into the trees. It should be noted that the Air France DC-4 Manual prohibits counter-rotating the engine propeller in case of hydraulic Iock; this manoeuvre merely forces the oil into the intake pipe and can render the engine inoperative. Even though this prohibited manoeuvre was followed, it does not appear that it was one of the causes of the accident; the incident would most certainly have occurred during the first aerodrome circuit after the return to the parking area. In conclusion, it appears that the accident should be ascribed to lack of seriousness and judgement on the part of the instructor. Pilot fatigue may also be invoked after a two-hour training flight at very low altitude under the constant supervision of the instructor. The pilot was a very serious, methodic and calm flier, but he did not have sufficient authority to disregard the unduly risky manoeuvres urged upon him, as confirmed orally by a flight mechanic who had flown with the crew involved in the accident. "}