{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-14p-moscow-4-killed", "date": "Nov 4, 1957 at 1758 LT", "type": "Ilyushin II-14", "operator": "Romanian Government", "flight_phase": "Landing (descent or approach)", "flight_type": "Government", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bucharest – Kiev – Moscow", "msn": "1460 010 10", "yom": 1956, "flight_number": null, "city": "Moscow-Vnukovo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 3, "pax_on_board": 10, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft, with TAROM color scheme but operated by the Romanian Government, was performing a flight from Bucharest to Moscow-Vnukovo with an intermediate stop at Kiev, carrying a Romanian delegation. The approach to Vnukovo was completed by night and after he cleared the inner marker, the pilot established a visual contact with the runway lights and continued the approach. At this time, he was contacted by ATC who instructed him to maintain level as his altitude was insufficient. Shortly later, at a height of about 10 to 15 meters, the airplane struck trees and crashed in a wooded area located 500 meters short of runway and 130 meters to the left of the extended centerline. Three crew members and one passenger, the Romanian Minister of Foreign Affairs Gregore Preoteasa were killed while 12 other occupants were injured, among them the futur President Nicolae Ceaucescu. ", "probable_cause": "The accident was the consequence of a succession of errors on part of the flying crew during the final approach that was continued at an insufficient altitude. The pilot-in-command took the decision to continue the approach procedure despite a warning message from ATC and because he established a visual contact with the runway lights. Due to low visibility and an insufficient height, this led the aircraft to struck trees and to crash. A lack of training and competences analysis was considered as a contributing factor. "}