{"url": "https://www.baaa-acro.com/crash/crash-hawker-siddeley-hs121-trident-3b-vrbovec-63-killed", "date": "Sep 10, 1976 at 1114 LT", "type": "Hawker Siddeley HS.121 Trident", "operator": "British%20Airways-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "London - Istanbul", "msn": "2320", "yom": 1972, "flight_number": "BA476", "city": "Vrbovec", "zone": "Zagreb County", "country": "Croatia", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 54, "pax_fatalities": 54, "other_fatalities": 0, "total_fatalities": 63, "captain_hours": 10781, "captain_hours_type": 399, "copilot_hours": 3655, "copilot_hours_type": 1592, "aircraft_hours": 8627, "circumstances": "Hawker Siddeley HS-121 Trident 3B operated by British Airways as flight BE476 and a McDonnell Douglas DC-9-32, operated by Inex-Adria Aviopromet, were destroyed when both aircraft crashed near Vrobec following a mid-air collision. All 176 on board both aircraft were killed. The Trident was on a scheduled flight from London-Heathrow Airport in England to Istanbul-Yesilköy Airport in Turkey, carrying 54 passengers and a crew of 9. The aircraft took off at 08:32 GMT and the flight proceeded normally. First contact with the Zagreb Area Control Centre was established on the Upper Sector frequency 134,45 MHz at 10:04 GMT. The flight was requested to report passing the Zagreb VOR at flight level 330. The aircraft flew along the centreline of airway UB5 with slight side deviation 1-2 km to the right due to wind. At 2 minutes and 50 seconds before the collision, the aircraft changed heading to 115° to head back towards the airway centreline. Airspeed was 295 Kts. The DC-9 departed Split Airport at 09:48 GMT to fly 108 West German tourists back to Cologne. Flight JP550 was issued instructions to climb to FL180. At 09:54 the flight, on passing flight level 130, switched to the Zagreb Area Control Centre lower sector east frequency of 124.6 MHz, receiving clearance to climb to FL240 and later to FL260. At 10:03 the crew switched to the frequency of the middle sector controller, responsible for safety and regulation of traffic between flight levels 250 and 310. This controller cleared to flight to FL350. The aircraft assumed a heading of 353° and a speed of 273 Kts as it passed a beam and to the west of the KOS NDB, approximately 2-3 km from the airway centreline. While heading towards the Zagreb VOR, the flight crew radioed the Upper Sector controller on frequency 134,45 MHz at 10:14:04 GMT and reported that they were climbing through FL325. The controller then requested, in Serbo-Croatian, flight JP550 to maintain their present altitude and report passing the Zagreb VOR. The controller stated that an aircraft was in front passing from left to right at FL335, while in fact BE476 was at FL330. At 10:14:38 the crew replied, also in Serbo-Croatian, that they where maintaining FL330. Three seconds later both aircraft collided. The outer five meters of the DC-9's left wing cut through the Trident's cockpit. Due to the sudden decompression, the forward part of the Trident's fuselage disintegrated. The remaining part of the fuselage struck the ground tail-first. With it's left wing torn off, the DC-9 tumbled down and hit the ground right-wing first.", "probable_cause": "Direct cause of the accident was the struck of the DC-9 wing into the middle side of the Trident 3B fuselage which occurred at the height of 33.000 feet above Zagreb VOR so that both aircraft became uncontrollable and fell on the ground.\r\n- Improper ATC operation,\r\n- Non-compliance with regulations on continuous listening to the appropriate radio frequency of ATC,\r\n- Non-performance of look-out duty from the cockpits of either aircraft."}