{"url": "https://www.baaa-acro.com/crash/crash-airbus-a300b-2-203-qeshm-island-290-killed", "date": "Jul 3, 1988 at 1024 LT", "type": "Airbus A300", "operator": "IranAir", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Bandar Abbas – Dubai", "msn": "186", "yom": 1982, "flight_number": "IR655", "city": "Qeshm Island", "zone": "Hormozgān", "country": "Iran", "region": "Asia", "crew_on_board": 16, "crew_fatalities": 16, "pax_on_board": 274, "pax_fatalities": 274, "other_fatalities": 0, "total_fatalities": 290, "captain_hours": 7000, "captain_hours_type": 2057, "copilot_hours": 220, "copilot_hours_type": 708, "aircraft_hours": 11497, "circumstances": "Flight IR451 arrived at Bandar Abbas (BND) from Tehran (THR) at 08:40. The Airbus A300 was to continue to Dubai (DXB) as flight IR655. Prior to departure the crew received an enroute clearance to Dubai via the flight planned route A59 and A59W at FL140. The flight took off from runway 21 at 10:17 hours and climbed straight ahead. Two minutes later, the crew reported leaving 3500 feet for FL140 on Airway A59, estimating MOBET at 06:53 UTC (10:23 Iran time). At 10:24:00 the aircraft passed MOBET out of FL120. At 10:24:43 two Airbus was hit by surface-to-air missiles. The tail and one wing broke off as a result of the explosions. Control was lost and the aircraft crashed into the sea. The missiles were fired by the US Navy cruiser USS Vincennes. It was operating in the area together with the frigates USS Elmer Montgomery and USS John H. Sides. They were to protect other ships in the area. At about the time the Airbus took off, the radar aboard the USS Vincennes picked up a brief IFF mode 2 response, which led to the mistaken identification of the Airbus as a hostile F-14 aircraft. The USS Vincennes issued 7 challenges on the Military Air Distress (MAD) frequency 243 MHz, addressed to 'Iranian aircraft', 'Iranian fighter' or 'Iranian F-14'. These messages were followed by three challenges on the IAD (International Air Defence) radio frequency. Due to increasing tension in the area - on May 17, 1987 an Iraqi Mirage had attacked USS Stark - all aircraft in the area had to monitor 121.5 Mhz: the International Air Defence - IAD radio frequency. There was no response. Meanwhile radar operators were monitoring the Aegis screens. They reported that the incoming plane was descending with an increasing speed. In fact, the Airbus was climbing. Considering itself and USS Montgomery under aggression, USS Vincennes took the ultimate decision to launch missiles against the perceived hostile target at 10:24:22.\r\nIt remains uncertain whether the IR655 flight crew (only able to monitor the IAD, not the MAD frequencies) would have been able to rapidly identify their flight as the subject of the challenges made by the USS Vincennes.", "probable_cause": "The aircraft was perceived as a military aircraft with hostile intentions and was destroyed by two surface-to-air missiles."}