{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-dubuque-1-killed", "date": "Oct 13, 2014 at 2305 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Grand River Emergency Department Consultants", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Ankeny – Dubuque", "msn": "46-08087", "yom": 1987, "flight_number": null, "city": "Dubuque", "zone": "Iowa", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1003, "captain_hours_type": 100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4785, "circumstances": "The instrument-rated private pilot was returning to his home airport after flying to another location to attend a meeting. At the departure airport, the pilot filed an instrument flight rules flight plan, had it activated, and then departed for his home airport. After reaching his assigned altitude, the pilot requested clearance directly to his destination with air traffic control, and he was cleared as requested. Before arriving at his airport, he requested off frequency to get the NOTAMs and weather conditions for his destination. The weather conditions at the arrival airport included a 200-ft overcast ceiling and 5 miles visibility with light rain and mist. The pilot then requested the instrument landing system (ILS) approach for landing. An air traffic controller issued vectors to the ILS final approach course and cleared the pilot to change off their frequency. Witnesses at the airport reported hearing and seeing the airplane break out of the clouds, fly over the runway about 100 ft above ground level (agl), and then disappear back into the clouds. Two witnesses stated that the engine sounded as if it were at full power and another witness stated that he heard the engine \"revving\" as if flew overhead. Shortly after the airplane was seen over the airport, it struck a line of 80-ft tall trees about 3,600 ft north-northwest of the airport and subsequently impacted the ground and a large tree near a residence. The published missed approach procedures required the pilot to climb the airplane to an altitude of 2,000 ft mean sea level (msl), or about 900 ft agl, while flying the runway heading. Upon reaching 2,000 ft msl, the pilot was required to begin a left turn to the northwest and then continue climbing to 3,300 ft msl. An examination of the airplane, the engine, and other airplane systems revealed no anomalies that would have precluded the airplane from being able to fully perform in a climb during the missed approach. It is likely that the pilot lost airplane control after initiating a missed approach in instrument meteorological conditions. Although it is possible that the pilot may have experienced spatial disorientation, there was insufficient evidence to conclude that spatial disorientation contributed to the accident.", "probable_cause": "The pilot's loss of airplane control while attempting to fly a missed approach procedure in instrument meteorological conditions."}