{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-waverley-1-killed", "date": "Feb 27, 1957 at 1700 LT", "type": "Fletcher FU-24", "operator": "Wanganui%20Aero%20Work", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Waverley - Waverley", "msn": "21", "yom": 1955, "flight_number": null, "city": "Waverley", "zone": "Taranaki Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "ZK-BHT had been fitted with a 6.6 hp Kohler 4-stroke, fan cooled, Auxiliary Power Unit. The purpose of this unit was to drive the aircraft's spray system. This arrangement was used with only moderate success in the application of non-inflammable liquids from the air. After trials final approval for the use of the system was granted by the Airworthiness Division of the CAA. At some point of time after the 15th of January 1957 the aircraft operator began to use the aircraft for the application, for burning-off purposes, of diesel fuel. At no point, it seems, did they inform or seek the approval of the Airworthiness Division of their intention to use the aircraft to spray an inflammable liquid. At 1345 on the day of the accident diesel oil was loaded into the plane in order to disperse the oil on a scrub-covered ravine on a farm in the Omahina Valley near Waverley. After the fifth sortie the pilot told his loader driver that during the flight he had operated the hopper jettison control briefly in order to put a heaver deposit of diesel on an area of thick scrub. The cockpit, he said, had immediately filled with dense, black smoke making him think the aircraft had caught fire. An inspection of the interior of the fuselage aft of the hopper showed that it was coated in a film of diesel oil extending back to the tail cone. There was an oil film also on the underside of the fuselage.The two mopped up the oil as best they could, tightened up a leaking connection in the supply pipe to one of the spray booms, and the operation was continued. Two further sorties were carried out uneventfully but on the eighth sortie as the Fletcher was climbing out of the ravine in order to land on the strip, which was located some 300 to 400 feet above the level of the ravine, two witnesses who had been observing the operation for some time saw a plume of flame being emitted from the underside of the fuselage about midway between the nose and the tail. At this point the aircraft was only seconds away from landing. The plane leveled out and turning 90 degrees to the right disappeared behind a ridge. After turning away from the approach to the airstrip the aircraft plowed through trees on steep tree-covered slope, then dived almost vertically to the ground before subsiding to a more level position. The right wing was detached and a small fire broke out in the engine bay. This ignited fuel flowing out of the broken fuel line from the right wing tank which in turn was augmented by diesel released from the hopper when the jettison system was sheared off. Also adding to the blaze was a quantity of petrol from the tank of the Kohler APU when the vent pipe from the small tank was broken off.", "probable_cause": "The accident inspector concluded that a fire had broken out in the air causing an emergency that affected the ability of the pilot to fully control the aircraft. This fire was most probably caused by the ignition of oil fumes and residue in the interior of the fuselage, the source of the ignition being the exhaust pipe of the APU which had been seen to become red hot at times. "}