{"url": "https://www.baaa-acro.com/crash/crash-epic-lt-egelsbach-3-killed", "date": "Mar 31, 2019 at 1527 LT", "type": "Epic LT", "operator": "Globus%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cannes - Egelsbach", "msn": "019", "yom": 2008, "flight_number": null, "city": "Egelsbach", "zone": "Hesse", "country": "Germany", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 11425, "captain_hours_type": 676, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2221, "circumstances": "At 1357 hrs the airplane had taken off from Cannes-Mandelieu Airport, France, to a private flight to Egelsbach Airfield, Germany. On board were the pilot and two passengers. According to the flight plan cruise flight was planned for Flight Level (FL)260. At 1519:03 hrs the pilot established contact with Frankfurt Radar, and informed the controller that the airplane was in descent to FL60 towards reporting point UBENO. The radar recordings show that the airplane was flying towards 335° and transmitted the transponder code 4065. The radar controller issued the descent clearance to 4,000 ft AMSL and conveyed a QNH of 1,020 hPa. At 1519:25 hrs the controller addressed the pilot: “[…] proceed direct DELTA, runway zero eight in use.” The pilot acknowledged the clearance. At 1520:20 hrs the controller instructed the pilot to descend to 3,500 ft AMSL. After the pilot had acknowledged the controller’s question, the change of flight rules from IFR to VFR was conducted at 1521 hrs about 16 NM south of Egelsbach Airfield. At the time, the airplane was at about 5,000 ft AMSL with a ground speed of approximately 240 kt. At 1522:34 hrs, the airplane was at 3,500 ft AMSL and about 14 NM from the airfield, the pilot established radio contact with Egelsbach Information with the words: “[…] inbound DELTA, descending VFR.” The Flugleiter (A person required by German regulation at uncontrolled aerodromes to provide aerodrome information service to pilots) answered: “Hello […] runway zero eight, QNH one zero two zero, squawk four four four one.” The pilot acknowledged the landing direction and the QNH. The communicated transponder code was not acknowledged, and did not change during the remainder of the flight, according to the radar recording. At 1524:34 hrs the Flugleiter gave the pilot the hint: “[…] the maximum altitude in this area is one thousand five hundred feet.” The pilot answered: “Roger, continue descent […].” At this time, altitude was still about 2,000 ft AMSL. According to the radar recording, at 1524:45 hrs the airplane turned right in northern direction toward the DELTA approach path to runway 08 of Egelsbach Airfield. Altitude was about 1,900 ft AMSL, and ground speed 170 kt. At 1526:30 hrs, at about the Tank- und Rastanlage Gräfenhausen (resting facility) at the Bundesautobahn A5 (motorway), it began to turn right up to north-eastern direction. At 1526:44 hrs the Flugleiter addressed the pilot: “[…] do you have the field in sight?” The pilot responded: “Ah, not yet […].” At the time, the airplane was about 1,000 m south-west of threshold 08 at the western outskirts of Erzhausen flying a northeastern heading. The Flugleiter added: “I suggest to reduce, you are now  in right base.” After the pilot had answered with “Roger”, the Flugleiter added: “You are number one to land. The wind is zero four zero, one zero knots.” At 1527:04 hrs, the airplane was about 300 m south of threshold 08 flying a northeastern heading, the radio message“[…] approach” of the pilot was recorded. From then on the airplane began to turn left. At 1527:11 hrs, the airplane crossed runway 08 with a ground speed of about 100 kt at very low altitude with northern heading. At 1527:24 hrs the pilot said: “[…] may I the […] make an orbit?” The Flugleiter answered: “Yes, do it to your left-hand side and do not overfly the highway westbound.” At 1527:31 hrs, the last radar target was recorded at approximately 600 m north-west of threshold 08 indicating an altitude of about 425 ft AMSL. About 100 m south-west of it the airplane crashed to the ground and caught fire. All three occupants suffered fatal injuries. At the time of the accident, three persons were in the Tower of the airfield. The Flugleiter, as tower controller, his replacement, and the apron controller. They observed that the airplane flew directly towards the tower coming from the DELTA approach in descent with north-eastern heading, i.e. diagonal to the landing direction. In this phase the landing gear extended. Two witnesses, who were at the airport close to the tower, stated that they had seen the airplane during the left-hand turn. They estimated the bank angle during the turn with 30-45°. The two occupants of a Piper PA-28, which had been on approach to runway 08, stated that they had become aware of the other airplane, before changing from downwind leg to final approach. They also stated that during the turn the airplane went into a dive and impacted the ground after about a half turn. Approximately 330 m north-east of the accident site, persons had been walking in a forest. One of them recorded a video. This recording was made available for investigation purposes. The video shows the shadow of the airplane moving west immediately prior to the accident. Consistent engine sounds and, 8 seconds after the shadow passed, the crash of the airplane can be heard. The aircraft was totally destroyed by a post crash fire and all three occupants were killed, among them Natalia Fileva, co-owner of the Russian Operator S7 Airlines. ", "probable_cause": "The accident was caused by the pilot steering the airplane during a turn in low altitude in an uncontrolled flight attitude, the airplane then banked over the wing and impacted the ground in a spinning motion.\r\nContributing factors:\r\n- The decision of the pilot to conduct a non-standard approach to runway 08 without visual contact with the runway and contrary to the SOP and to continue the unstabilized approach,\r\n- The complex airspace structure surrounding Frankfurt-Egelsbach Airfield,\r\n- The late recognition of the airport and the pilot’s decision for an inappropriate manoeuvre close to the ground,\r\n- The insufficient attention distribution of the pilot in combination with the missing stall warning of the airplane."}