{"url": "https://www.baaa-acro.com/crash/crash-mitsubishi-mu-300-diamond-ia-dallas", "date": "Jan 27, 2000 at 1015 LT", "type": "Mitsubishi MU-300 Diamond", "operator": "Matrix Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Austin - Dallas", "msn": "A028SA", "yom": 1982, "flight_number": null, "city": "Dallas-Love Field", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5960, "captain_hours_type": 770, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5266, "circumstances": "Freezing rain, mist, and ice pellets were forecast for the destination airport with temperatures 34 to 32 degrees F. During the daylight IMC descent and vectors for the approach, the airplane began to accumulate moderate clear ice, and a master warning light illumination in the cockpit indicated that the horizontal stabilizer heat had failed. The airplane was configured at 120 knots and 10 degrees flaps in accordance with the flight manual abnormal procedures checklist; however, the crew did not activate the horizontal stabilizer deice backup system. The aircraft touched down 1,500 ft down the runway, which was contaminated with slush, and did not have any braking action or antiskid for 3,000 ft on the 7,753-ft runway. Therefore, 3,253 ft of runway remained for stopping the aircraft, which was 192 feet short of the 3,445 ft required for a dry runway landing. Upon observing a down hill embankment and support poles beyond the runway, the captain forced the airplane to depart the right side of the runway to avoid the poles. After the airplane started down the embankment, the nose landing gear collapsed, and the airplane came to a stop. ", "probable_cause": "The diminished effectiveness of the anti-skid brake system due to the slush contaminated runway. Factors were the freezing rain encountered during the approach, coupled with a failure of the horizontal stabilizer heat. "}