{"url": "https://www.baaa-acro.com/crash/crash-boeing-727-92c-taipei-22-killed", "date": "Feb 16, 1968 at 2120 LT", "type": "Boeing 727-100", "operator": "Civil%20Air%20Transport", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Hong Kong - Tainan - Taipei", "msn": "19175/339", "yom": 1966, "flight_number": "CAT010", "city": "Taipei-Songshan", "zone": "Taipei City (臺北市)", "country": "Taiwan", "region": "Asia", "crew_on_board": 11, "crew_fatalities": 3, "pax_on_board": 52, "pax_fatalities": 18, "other_fatalities": 1, "total_fatalities": 22, "captain_hours": null, "captain_hours_type": 104, "copilot_hours": null, "copilot_hours_type": 108, "aircraft_hours": null, "circumstances": "Flight No. 10 operated by Civil Air Transport was a scheduled international flight from Taipei to Hong Kong and return. The accident occurred on the return trip from Hong Kong to Taipei. The aircraft departed Hong Kong at 2018 hours local time. At 2045 hours it reported to Taipei Area Control Centre over Yellowtail, a compulsory reporting intersection, at flight level 29 000 ft. At 2059 hours it reported over Makung VOR, and was then cleared to descend to 11 000 ft. At 2111 hours it reported over Hsinchu (PO) NDB at 11 000 ft and was cleared to descend to 5 000 ft crossing Taoyuan (GM) NDB and to 2 000 ft crossing Linkuo outer marker for a straight-in ILS approach to runway 10. The current Taipei weather information was also given to the pilot at that time. At 2118 hours the aircraft reported approaching Linkuo outer marker at 2 000 ft and was cleared to continue its ILS approach and to contact Taipei Tower. The aircraft reported to Taipei Tower and requested landing instructions. The tower controller advised the pilot to continue his ILS approach to runway 10, gave him the surface wind and the altimeter setting and requested him to report approach lights in sight. The pilot acknowledged all this information. From that moment, even though repeated attempts to contact the aircraft were made by Taipei Tower and Taipei Area Control Centre, no further communication was received from the aircraft. Then, right after, Taipei Area Control Centre was informed that the aircraft had crashed in the vicinity of Linkou, about 8 miles west of Taipei City. Three crew members, 18 passengers and one person on the ground were killed. The aircraft was destroyed. It was found during the investigation that the left hand pilot seat was not occupied by the assigned pilot-in-command, but by another Senior Pilot of Civil Air Transport.", "probable_cause": "The \"Senior Pilot\" who was actually at the controls failed to maintain proper altitude while approaching the Linkou outer marker and the aircraft was far below the required altitude; consequently the aircraft could not intercept the glide path. When the radio altimeter warning light came on, while the aircraft descended to an altitude of 350 ft, the pilot failed to take corrective action in time. The wheels touched the ground and the aircraft rolled on the ground for about 200 metres. The aircraft was then pulled up in the air but it hit trees and a farm house and subsequently crashed. It was concluded that this accident was caused by careless operation in piloting the aircraft. According to the Flight Plan and documents of this flight, the pilot-in-command was properly assigned. Although the above-mentioned \"Senior Pilot\" held an appropriate licence with a rating for Boeing 727 aircraft, he was neither the assigned pilot-in-command nor a pilot under training on this flight. It was concluded that in allowing him to perform the functions of pilot- in-command, the assigned pilot-in-command of this flight, was also at fault."}