{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-3t5-burbank", "date": "Mar 5, 2000 at 1811 LT", "type": "Boeing 737-300", "operator": "Southwest-Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Las Vegas - Burbank", "msn": "23060", "yom": 1984, "flight_number": "WN1455", "city": "Burbank", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 137, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11000, "captain_hours_type": 9870, "copilot_hours": 5022, "copilot_hours_type": 2522, "aircraft_hours": null, "circumstances": "On March 5, 2000, about 1811 Pacific standard time (PST), Southwest Airlines, Inc., flight 1455, a Boeing 737-300 (737), N668SW, overran the departure end of runway 8 after landing at Burbank-Glendale-Pasadena Airport (BUR), Burbank, California. The airplane touched down at approximately 182 knots, and about 20 seconds later, at approximately 32 knots, collided with a metal blast fence and an airport perimeter wall. The airplane came to rest on a city street near a gas station off of the airport property. Of the 142 persons on board, 2 passengers sustained serious injuries; 41 passengers and the captain sustained minor injuries; and 94\r\npassengers, 3 flight attendants, and the first officer sustained no injuries. The airplane sustained extensive exterior damage and some internal damage to the passenger cabin. During the accident sequence, the forward service door (1R) escape slide inflated inside the airplane; the nose gear collapsed; and the forward dual flight attendant jump seat, which was occupied by two flight attendants, partially collapsed. The flight, which was operating on an instrument flight rules flight plan, was conducted under 14 Code of Federal Regulations (CFR) Part 121. Visual meteorological conditions (VMC) prevailed at the time of the accident, which occurred\r\nin twilight lighting conditions. ", "probable_cause": "The flight crew's excessive airspeed and flightpath angle during the approach and landing and its failure to abort the approach when stabilized approach criteria were not met. Contributing to the accident was the controller's positioning of the airplane in such a manner as to leave no safe options for the flight crew other than a go-around maneuver."}