{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-12-near-krasnoyarsk-19-killed", "date": "Oct 28, 1954 at 0010 LT", "type": "Ilyushin II-12", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Irkutsk – Novosibirsk", "msn": "9 301 32 06", "yom": 1949, "flight_number": "SU136", "city": "Krasnoyarsk", "zone": "Krasnoyarsk Krai", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 13, "pax_fatalities": 13, "other_fatalities": 0, "total_fatalities": 19, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was supposed to fly from Irkutsk to Novosibirsk but weather conditions at destination deteriorated in flight so the crew was diverted to Krasnoyarsk Airport. While approaching the Krasnoyarsk area by night, the crew was cleared by ATC to descend to 1,500 meters. Descending to the altitude of 1,725 meters in poor visibility, the twin engine aircraft hit the east slope of Mt Sivukha (1,807 meters high) located 30 km from the Mana River. As the airplane failed to arrive in Krasnoyarsk, SAR operations were conducted but eventually suspended few days later as no trace of the aircraft nor the 19 occupants was found. The wreckage was found in June 1955, about 132 km south of the intended route. The aircraft was destroyed upon impact and all 19 occupants have been killed, among them nine foreign citizens (one Polish, one Chinese and 4 Cyprus, four UNO emissaries in Vietnam).", "probable_cause": "At the time of the accident, the aircraft was off course by 132 km and deviated from the prescribed flight path from 10° due to strong winds blowing from the northwest up to 130 km/h. Poor flight organisation and follow up, letting the crew descending to 1,500 meters while the minimum safe altitude was 2,100 meters in the area and incomplete information transmitted to the crew regarding wind component that did not reflect the truth were considered as contributing factors. "}