{"url": "https://www.baaa-acro.com/crash/crash-douglas-26b-45-dl-invader-near-hubbards-fork-1-killed", "date": "Mar 5, 1983 at 1758 LT", "type": "Douglas A-26 Invader", "operator": "Lynch Air Tankers", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Mountains", "schedule": "Asheville - Asheville", "msn": "27381", "yom": 1944, "flight_number": "Tanker 01", "city": "Hubbards Fork", "zone": "Kentucky", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4199, "captain_hours_type": 733, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1558, "circumstances": "The pilot and aircraft had been fighting forest fires earlier in the day. A late developing fire necessitated another dispatch. The aircraft arrived on scene and checked in with the lead aircraft circling overhead coordinating the fire fighting efforts. The tanker made two runs over the fire area following the lead aircraft. After the second run, the aircraft banked left in a level turn to make another run without using the lead aircraft. During the third run the tanker struck trees near the top of a 1,800 feet ridgeline. Witnesses on the ground remarked how low the aircraft was. According to the pilot's peers, he took pride in doing his job well and always strove to put the chemical right on target. There had been occasions in the past where this zeal to succeed had resulted in his going lower than the 150 feet agl minimum altitude mandated by forestry service regs. He had, on occasions, returned to base with tree foliage stuck in his aircraft. The pilot, sole on board, was killed. ", "probable_cause": "Occurrence #1: in flight collision with terrain/water\r\nPhase of operation: maneuvering\r\nFindings\r\n1. (f) terrain condition - mountainous/hilly\r\n2. (c) proper altitude - not maintained - pilot in command\r\n3. (c) overconfidence in personal ability - pilot in command"}