{"url": "https://www.baaa-acro.com/crash/crash-hawker-800xp-carson-city", "date": "Aug 28, 2006 at 1506 LT", "type": "Hawker 800XP", "operator": "NetJets-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Carlsbad – Reno", "msn": "258379", "yom": 1998, "flight_number": null, "city": "Carson City", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6134, "captain_hours_type": 1564, "copilot_hours": 3848, "copilot_hours_type": 548, "aircraft_hours": 6727, "circumstances": "The Hawker and the glider collided in flight at an altitude of about 16,000 feet above mean sea level about 42 nautical miles south-southeast of the Reno/Tahoe International Airport (RNO), Reno, Nevada, which was the Hawker's destination. The collision occurred in visual meteorological conditions in an area that is frequently traversed by air carrier and other turbojet airplanes inbound to RNO and that is also popular for glider operations because of the thermal and mountain wave gliding opportunities there. Before the collision, the Hawker had been descending toward RNO on a stable northwest heading for several miles, and the glider was in a 30-degree, left-banked, spiraling climb. According to statements from the Hawker's captain and the glider pilot, they each saw the other aircraft only about 1 second or less before the collision and were unable to maneuver to avoid the collision in time. Damage sustained by the Hawker disabled one engine and other systems; however, the flight crew was able to land the airplane. The damaged glider was uncontrollable, and the glider pilot bailed out and parachuted to the ground. Because of the lack of radar data for the glider's flight, it was not possible to determine at which points each aircraft may have been within the other's available field of view. Although Federal Aviation Regulations (FARs) require all pilots to maintain vigilance to see and avoid other aircraft (this includes pilots of flights operated under instrument flight rules, when visibility permits), a number of factors that can diminish the effectiveness of the see-and-avoid principle were evident in this accident. For example, the high closure rate of the Hawker as it approached the glider would have given the glider pilot only limited time to see and avoid the jet. Likewise, the closure rate would have limited the time that the Hawker crew had to detect the glider, and the slim design of the glider would have made it difficult for the Hawker crew to see it. Although the demands of cockpit tasks, such as preparing for an approach, have been shown to adversely affect scan vigilance, both the Hawker captain, who was the flying pilot, and the first officer reported that they were looking out the window before the collision. However, the captain saw the glider only a moment before it filled the windshield, and the first officer never saw it at all.", "probable_cause": "The failure of the glider pilot to utilize his transponder and the high closure rate of the two aircraft, which limited each pilot's opportunity to see and avoid the other aircraft."}