{"url": "https://www.baaa-acro.com/crash/crash-polikarpov-p-5-mt-kyzyltas-4-killed", "date": "Nov 25, 1935 at 2155 LT", "type": "Polikarpov P-5", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Balkhash – Karaganda", "msn": "10109", "yom": 1935, "flight_number": null, "city": "Mt Kyzyltas", "zone": "Karagandy", "country": "Kazakhstan", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 107, "circumstances": "The single engine airplane departed Balkash Airport at 1500LT on a schedule service to Karaganda, carrying three passengers, one pilot and mail. En route, weather conditions worsened and the visibility was poor due to snow falls and fog. Instead of returning to Balkhash, the pilot decided to continue. Flying at night, the pilot flew for almost four hours in difficult conditions when the airplane impacted the slope of Mt Kyzyltas located some 190 km north of Balkash, in the region of Aktogay. In the evening, the manager of the Balkhach Airport received a message confirming that the plane landed at Karaganda, which was wrong. It took two days for the Authorities to realize this information was erroneous. The wreckage was eventually found on the slope of the mountain. The aircraft was destroyed and all four occupants were killed. ", "probable_cause": "The accident was the consequence of a navigation error on part of the pilot who was exhausted after flying nearly seven hours in difficult flying conditions (fog, snowfall, night and rough terrain).\r\nThe following contributing factors were identified: \r\n- The aircraft departed Balkhach Airport at 1500LT for a 2 hours and 40 minutes flight, giving an ETA in Karaganda at 1740LT when the sunset was scheduled at 1716LT,\r\n- The aircraft was not certified to fly at night,\r\n- The pilot was only allowed to carry passengers during daylight hours and in good weather conditions only, \r\n- The pilot made the wrong decision by continuing the flight when he should have turned back when he encountered bad weather conditions (fog and snow),\r\n- The pilot was overconfident,\r\n- The pilot obtained weather bulletins for both departure and arrival airports but no information about the conditions en route."}