{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-presque-isle", "date": "Nov 22, 2017 at 1845 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Fresh Air", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Presque Isle – Bangor", "msn": "421C-0264", "yom": 1977, "flight_number": null, "city": "Presque Isle", "zone": "Maine", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4482, "captain_hours_type": 3620, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7473, "circumstances": "After takeoff, the commercial pilot saw flames coming from the left engine nacelle area. He retarded the throttle and turned off the fuel boost pump; however, the fire continued. He then feathered the propeller, shut down the engine, and maneuvered the airplane below the clouds to remain in the local traffic pattern. He attempted to keep the runway environment in sight while drifting in and out of clouds. He was unable to align the airplane for landing on the departure runway, so he attempted to land on another runway. When he realized that the airspeed was decreasing and that the airplane would not reach the runway, he landed it on an adjacent grass field. After touchdown, the landing gear separated, and the airplane came to a stop. The airframe sustained substantial damage to the wings and lower fuselage. Examination of the left engine revealed evidence of a fuel leak where the fuel mixture control shaft inserted into the fuel injector body, which likely resulted in fuel leaking onto the hot turbocharger in flight and the in-flight fire. A review of recent maintenance records did not reveal any entries regarding maintenance or repair of the fuel injection system. The pilot reported clouds as low as 500 ft with rain, snow, and reduced visibility at the time of the accident, which likely reduced his ability to see the runway and maneuver the airplane to land on it.", "probable_cause": "The in-flight leakage of fuel from the fuel injection system's mixture shaft onto the hot turbocharger, which resulted in an in-flight fire, and the pilot's inability to see the runway due to reduced visibility conditions and conduct a successful landing."}