{"url": "https://www.baaa-acro.com/crash/crash-short-330-200-dubois", "date": "Apr 9, 2003 at 0715 LT", "type": "Short 330", "operator": "SkyWay%20Enterprises", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pittsburgh – DuBois", "msn": "3055", "yom": 1980, "flight_number": "SKZ1170", "city": "DuBois-Jefferson County", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3470, "captain_hours_type": 2100, "copilot_hours": 1347, "copilot_hours_type": 431, "aircraft_hours": 24401, "circumstances": "The airplane was on an instrument landing system (ILS) approach in instrument meteorological conditions. The captain initially stated that the airplane was on the ILS approach with the engine power set at flight idle. About 300 feet above the ground, and 1/4 to 1/2 mile from the threshold, the captain made visual contact with the runway. The captain stated that the left engine then surged, which caused the airplane to yaw right and drift left. At the time, the airplane was in visual conditions, and on glideslope, with the airspeed decreasing through 106 knots. The captain aligned the airplane with the runway and attempted to go-around, but the throttles were difficult to move. The airplane began to stall and the captain lowered the nose. The airplane subsequently struck terrain about 500 feet prior to the runway. After the captain was informed that the engine power should not be at flight idle during the approach, he amended his statement to include the approach power setting at 1,000 lbs. of torque. The co-pilot initially reported that the engine anomaly occurred while at flight idle. However, the co-pilot later amended his statement and reported that the anomaly occurred as power was being reduced toward flight idle, but not at flight idle. Examination of the left engine did not reveal any pre-impact mechanical malfunctions. Examination of the airplane cockpit did not reveal any anomalies with the throttle levers. Review of a flight manual for the make and model accident airplane revealed that during a normal landing, 1,100 lbs of torque should be set prior to turning base leg. The manual further stated to reduce the power levers about 30 feet agl, and initiate a gentle flare. The reported weather at the airport about 5 minutes before the accident included a visibility 3/4 mile in mist, and an overcast ceiling at 100 feet. The reported weather at the airport about 7 minutes after the accident included visibility 1/4 mile in freezing fog and an overcast ceiling at 100 feet. Review of the terminal procedure for the respective ILS approach revealed that the decision height was 200 feet agl, and the required minimum visibility was 1/2 mile.", "probable_cause": "The captain's failure to maintain the proper glidepath during the instrument approach, and his failure to perform a go-around. Factors were a low ceiling and reduced visibility due to mist."}