{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-i-marietta-1-killed", "date": "Mar 24, 2017 at 1924 LT", "type": "Cessna 500 Citation", "operator": "Shelter Charter Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "Cincinnati – Atlanta", "msn": "500-0303", "yom": 1976, "flight_number": null, "city": "Marietta", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9299, "circumstances": "The private pilot departed on an instrument flight rules flight plan in his twin-engine turbojet airplane. The flight was uneventful until the air traffic controller amended the flight plan, which required the pilot to manually enter the new routing information into the GPS. A few minutes later, the pilot told the controller that he was having problems with the GPS and asked for a direct route to his destination. The controller authorized the direct route and instructed the pilot to descend from 22,000 ft to 6,000 ft, during which time the sound of the autopilot disconnect was heard on the cockpit voice recorder (CVR). During the descent, the pilot told the controller that the airplane had a steering problem and was in the clouds. The pilot was instructed to descend the airplane to 4,100 ft, which was the minimum vectoring altitude. The airplane continued to descend, entered visual meteorological conditions, and then descended below the assigned altitude. The controller queried the pilot about the airplane's low altitude and instructed the pilot to maintain 4,100 ft. The pilot responded that he was unsure if he would be able to climb the airplane back to that altitude due to steering issues. The controller issued a low altitude warning and again advised the pilot to climb back to 4,100 ft. The pilot responded that the autopilot was working again and that he was able to climb the airplane to the assigned altitude. The controller then instructed the pilot to change to another radio frequency, but the pilot responded that he was still having a problem with the GPS. The pilot asked the controller to give him direct routing to the airport. A few minutes later, the pilot told the controller that he was barely able to keep the airplane straight and its wings level. The controller asked the pilot if he had the airport in sight, which he did not. The pilot then declared an emergency and expressed concerns related to identifying the landing runway. Afterward, radio contact between the controller and the pilot was lost. Shortly before the airplane impacted the ground, a witness saw the airplane make a complete 360° roll to the left, enter a steep 90° bank to the left, roll inverted, and enter a vertical nose-down dive. Another witness saw the airplane spiral to the ground. The airplane impacted the front lawn of a private residence, and a postcrash fire ensued.The pilot held a type rating for the airplane, but the pilot's personal logbooks were not available for review. As a result, his overall currency and total flight experience in the accident airplane could not be determined. The airplane was originally certified for operations with a pilot and copilot. To obtain an exemption to operate the airplane as a single pilot, a pilot must successfully complete an approved single-pilot exemption training course annually. The accident airplane was modified, and the previous owner was issued a single-pilot conformity certificate by the company that performed the modifications. However, there was no record indicating that the accident pilot received training under this exemption. Several facilities that have single-pilot exemption training for the accident airplane series also had no record of the pilot receiving training for single-pilot operations in the accident airplane. Therefore, unlikely that the pilot was properly certificated to act as a single-pilot. The GPS was installed in the airplane about 3.5 years before the accident. A friend of the pilot trained him on how to use the GPS. The friend said that the pilot generally was confused about how the unit operated and struggled with pulling up pages and correlating data. The friend of the pilot had flown with him several times and indicated that, if an air traffic controller amended a preprogrammed flight plan while en route, the pilot would be confused with the procedure for amending the flight plan. The friend also said the pilot depended heavily on the autopilot, which was integrated with the GPS, and that he would activate the autopilot immediately after takeoff and deactivate it on short final approach to a runway. The pilot would not trim the airplane before turning on the autopilot because he assumed that the autopilot would automatically trim the airplane, which led to the autopilot working against the mis-trimmed airplane. The friend added that the pilot was \"constantly complaining\" that the airplane was \"uncontrollable.\" A postaccident examination of the airplane and the autopilot system revealed no evidence of any preimpact deficiencies that would have precluded normal operation. This information suggests that pilot historically had difficulty flying the airplane without the aid of the autopilot. When coupled with his performance flying the airplane during the accident flight without the aid of the autopilot, it further suggests that the pilot was consistently unable to manually fly the airplane. Additionally, given the pilot's previous experience with the GPS installed on the airplane, it is likely that during the accident flight the pilot became confused about how to operate the GPS and ultimately was unable to properly control of the airplane without the autopilot engaged. Based on witness information, it is likely that during the final moments of the flight the pilot lost control of the airplane and it entered an aerodynamic stall. The pilot was then unable to regain control of the airplane as it spun 4,000 ft to the ground.", "probable_cause": "The pilot's failure to maintain adequate airspeed while manually flying the airplane, which resulted in the airplane exceeding its critical angle of attack and experiencing an aerodynamic stall. Contributing to the accident was the pilot's inability control the airplane without the aid of the autopilot."}