{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-boston", "date": "Nov 15, 1961 at 1710 LT", "type": "Douglas DC-6", "operator": "National-Airlines-4", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Boston – New York – Norfolk", "msn": "43821", "yom": 1953, "flight_number": "NA429", "city": "Boston", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 25, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8000, "captain_hours_type": 1445, "copilot_hours": 6000, "copilot_hours_type": 1459, "aircraft_hours": 26849, "circumstances": "On November 15, 1961, at approximately 1710LT, 47 minutes after sunset, a ground collision occurred at Logan International Airport, Boston, Massachusetts, between a National Airlines DC-6B, N8228H, attempting a takeoff on runway 09 and a Northeast Airlines Viscount N6592C, during its landing roll on runway 04R. National Airlines Flight 429 originated at Boston. Its destination was Norfolk, Virginia, with five intermediate stops. Northeast Airlines Flight 120 originated at Washington, D. C. Its destination was Boston, Massachusetts, with an intermediate stop at LaGuardia Airport, New York. There were no serious injuries to either the crew or passengers of the DC-6; however, four passengers of the Viscount received minor cuts and abrasions while deplaning. There was major damage to both aircraft. As a result of this accident the Board recommended to the Federal Aviation Agency that consideration be given to requiring that all restrictive clearances or instructions issued by air traffic control be acknowledged by pilot repetition.", "probable_cause": "The Board finds that this ground collision accident occurred as the result of commencement of takeoff by National 429 without clearance. Contributing factors were the failure of tower personnel to provide adequate surveillance of the active runways and to issue an appropriate warning message to the pilot of National 429 alerting him to the impending traffic confliction."}