{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-62-yakutsk", "date": "Nov 21, 1990 at 1245 LT", "type": "Ilyushin II-62", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Yakutsk", "msn": "1901", "yom": 1975, "flight_number": "SU95", "city": "Yakutsk-Magan", "zone": "Republic of Yakutia (Sakha)", "country": "Russia", "region": "Asia", "crew_on_board": 10, "crew_fatalities": 0, "pax_on_board": 179, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Moscow-Domodedovo Airport, the crew started the approach to Yakutsk-Intl Airport. Due to poor weather conditions and a visibility below minima, the crew diverted to Magan Airport. The aircraft overflew the runway threshold at a height of 22 meters and a speed of 297 km/h. It 'floated' for 22 seconds and eventually landed 1,647 meters past the runway threshold. For unknown reasons, the captain maintained the aircraft in a nose-up attitude and the nose gear landed nine seconds after the first touchdown only. Reverse thrust were not activated and the spoilers were finally deployed but too late. At a distance of 47 meters from the runway end, the captain shut down all four engine when the aircraft overran at a speed of 167 km/h. It went down an embankment, lost its undercarriage and came 538 meters past the runway end, 3,978 meters from the runway threshold and 2,331 meters from the touchdown point. Four passengers were injured and 185 other occupants were evacuated safely. The aircraft was damaged beyond repair. ", "probable_cause": "The accident was the consequence of a poor planned approach and a wrong approach configuration. The following contributing factors were reported:\r\n- Lack of crew training, \r\n- It was the first time (except for one crew member) that the crew was landing at Yakutsk-Magan Airport, \r\n- Marginal weather conditions (visibility below minimums at the initial destination airport),\r\n- Failure to comply with flight crew recommandations, \r\n- Poor crew instructions and interaction, \r\n- The crew failed to follow the published procedures for a standard approach and landing, \r\n- Deviations in aircraft piloting during approach and landing, causing the aircraft to land too far down the runway, \r\n- The pilot-in-command maintained the aircraft in a nose-up attitude for a period of 9 seconds between the main gear touchdown and the nose gear landing, \r\n- The reverse thrust systems were not activated, \r\n- The spoilers were deployed too late, \r\n- Lack of leadership on part of the captain during the approach and landing,\r\n- The crew did not make the decision to initiate a go-around procedure when the landing maneuver was obviously missed. "}