{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-5d-buffalo-farnborough", "date": "Sep 5, 1984 at 1618 LT", "type": "De Havilland DHC-5 Buffalo", "operator": "De-Havilland-Aircraft-of-Canada", "flight_phase": "Landing (descent or approach)", "flight_type": "Demonstration", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Farnborough - Farnborough", "msn": "103", "yom": 1980, "flight_number": null, "city": "Farnborough", "zone": "Hampshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10400, "captain_hours_type": 1300, "copilot_hours": 3600, "copilot_hours_type": 30, "aircraft_hours": 902, "circumstances": "During the 1984 Farnborough International Air Display de Havilland Canada was to fly a display using DHC-5D C-GCTC, DHC-6 Twin Otter C-GFJQ, and both Dash 7 and Dash 8 prototypes C-GNBX and C-GDNK. Brakes were released at 16:16 and the Buffalo commenced its takeoff run as the third aircraft in the DHC combine behind the Dash 7 and Dash 8. Immediately after takeoff the Buffalo carried out a steep climb to a height of 1000 feet agl. Following a descending turn to the right, the airplane carried out a low level flypast along the display line at height of 250 feet agl and an airspeed of 215 kts. The Buffalo then entered a climbing turn to the left through about 270 degrees, before reversing bank in order to position for a right hand final approach for a STOL landing back onto runway 25. During this manoeuvre the landing gear was selected down and the copilot lowered the ramp and opened the rear cargo door. At a height of 450 feet agl the nose dropped significantly and the rate of descent increased. The DHC-5 continued in a steep side-slipping and descending turn to the right. Shortly before touchdown the rate of descent reduced slightly. The aircraft then landed very hard. The nose gear collapsed, both wings failed and the propellers disintegrated after contacting the runway. Debris caused some damage to vehicles and three aircraft in the static display area.", "probable_cause": "An error of judgement by the aircraft commander. Unfavourable weather conditions, a transitory handling problem whilst flying outside the tested flight regime and the pressure on the commander to complete his flying sequence, where probably contributing factors."}