{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-500-columbus", "date": "Dec 27, 2010 at 2246 LT", "type": "Rockwell Aero Commander 500", "operator": "Central%20Air%20Southwest", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jeffersonville – Columbus", "msn": "500B-1318-127", "yom": 1963, "flight_number": null, "city": "Columbus-Ohio State University-Don Scott", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5700, "captain_hours_type": 3525, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Prior to the flight, the pilot preflighted the airplane and recalled observing the fuel gauge indicating full; however, he did not visually check the fuel tanks. The airplane departed and the en route portion of the flight was uneventful. During the downwind leg of the circling approach, the engines began to surge and the pilot added full power and turned on the fuel boost pumps. While abeam the approach end of the runway on the downwind leg, the engines again started to surge and subsequently lost power. He executed a forced landing and the airplane impacted terrain short of the runway. A postaccident examination by Federal Aviation Administration inspectors revealed the fuselage was buckled in several areas, and the left wing was crushed and bent upward. The fuel tanks were intact and approximately one cup of fuel was drained from the single fuel sump. Fueling records indicated the airplane was fueled 3 days prior to the accident with 135 gallons of fuel or approximately 4 hours of operational time. Flight records indicated the airplane had flown approximately 4 hours since refueling when the engines lost power.", "probable_cause": "The pilot’s improper fuel management which resulted in a loss of engine power due to fuel exhaustion.\n"}