{"url": "https://www.baaa-acro.com/crash/crash-short-360-100-east-midlands", "date": "Jan 31, 1986 at 1851 LT", "type": "Short 360", "operator": "Aer%20Lingus-1", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dublin - East Midlands", "msn": "3642", "yom": 1984, "flight_number": "EI328", "city": "East Midlands", "zone": "Leicestershire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 33, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7528, "captain_hours_type": 123, "copilot_hours": 4299, "copilot_hours_type": 1240, "aircraft_hours": 3226, "circumstances": "The Shorts 360 aircraft was scheduled to fly from Dublin (DUB) to East Midlands Airport (EMA) as Aer Lingus flight 328. During the pre-flight briefing the crew learned that at East Midlands the precision radar was unserviceable and that, although the visual approach slope indicators (VASI) had been withdrawn, the precision approach path indicators (PAPI) were operational. The en-route weather was reported as being overcast for the whole journey, with cloud tops at FL70 and a probability of icing when flying in the cloud. There had also been a pilot's report of severe icing between FL30 and FL70 in the Birmingham area, some 30 nm south-west of East Midlands Airport. The terminal area forecast for East Midlands suggested a brisk north-easterly wind and a cloud base of 1200 feet. The aircraft took off at 17:25. The crew report that they exercised the wing and tail de-icing system during the climb to FL 90, the level which had been assigned for the flight, and that at that level they were above the layers of stratiform cloud. Following an uneventful flight, via Wallasey, to the NDB at Whitegate, they were taken under radar control directly towards the airport and given descent clearance, eventually to 3000 feet, to intercept the ILS approach path for runway 09. During the descent and before entering the cloud tops at about FL60, the crew switched on the aircraft's anti-ice system, which heats the windscreen, engine air intakes, propellers, static air vents and pitot probes but, in accordance with normal operating procedure, they did not use the wing and tail de-icing system. At this time, the freezing level (0°C isotherm) was at 1000 feet, the temperature at FL 60 was minus 6°C and the air was saturated. Whilst in the cloud, which according to the non-handling pilot was particularly dense, ice thrown from the propellers was heard striking the side of the aircraft fuselage, and it was suggested that the propeller rpm be increased to expedite the removal of the ice. Both pilots state that, at some time during the descent, they visually checked the aircraft for ice but saw none. Nevertheless, several other flights during that evening have since reported the occurrence of severe icing. Having levelled at 3000 feet, still in and out of cloud, the aircraft was directed by radar to intercept the ILS and was fully established on the glideslope and centreline by 10 nm, at which point the final descent was initiated. A normal approach was established and continued, past the outer marker beacon situated at 3.9 nm from touchdown, down to around 1000 feet above the runway threshold height. The crew state that up to this point they had neither experienced any significant turbulence nor observed any ice forming on the aircraft. The last meteorological information passed to the crew gave the wind as 060 degrees /15 kt, however, over the previous hour the wind speed in the area, although not automatically recorded at the airport, is reported as gusting up to 30 kt. As the aircraft descended through about 1000 feet, it suddenly rolled very sharply to the left without apparent cause. With the application of corrective aileron and rudder the aircraft rolled rapidly right, well beyond the wings level position. This alternate left and right rolling motion continued with the angles of bank increasing for some 30 seconds, causing the commander to believe that the aircraft might roll right over onto its back. The angles of bank then gradually decreased. During this period and the subsequent few seconds the aircraft established a very high descent rate approaching 3000 feet/min. Subsequently, with the aid of full engine power, the airspeed increased and the rate of descent was arrested just as the aircraft struck an 11 KV power cable. It continued through another similar cable, two of the supporting wooden poles and the tops of two trees, before coming to rest nose into a small wood edging a field of barley, some 460 metres from the impact with the first power cable. The cockpit and passenger cabin were relatively undamaged and there was no fire. The aircraft came to rest lying virtually upright and the passengers, and subsequently the crew, successfully evacuated from the front and rear emergency exits.", "probable_cause": "The accident most probably occurred as a result of the effects of a significant accumulation of airframe ice degrading the aircraft's stability and control characteristics, such that the crew were unable to maintain control. Turbulence and or downdraught may have contributed to the accident. Other contributory factors were the difficulty in detecting clear ice at night on the SD3-60 which resulted in the airframe de-icing system not being used. The delay in application of go-around power may have also contributed to the accident."}