{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31p-pressurized-navajo-miami-1-killed", "date": "Jun 17, 1988 at 1927 LT", "type": "Piper PA-31-310 Navajo", "operator": "Laurence D. Gavolic", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Miami - Miami", "msn": "31-7400195", "yom": 1974, "flight_number": null, "city": "Miami-Opa Locka", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3444, "captain_hours_type": 270, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1750, "circumstances": "The instructor (cfi), who survived, was flying the aircraft from the right front seat while the owner/pilot was in the left seat. The flight had progressed normally until the pilots returned to the airport to land. Clearance was received to land on runway 09L. According to the cfi, he lowered the landing gear, selected 10° of flaps and noted he needed excessive back pressure on the control yoke to keep the aircraft from descending. Also, he stated he was unable to relieve the pressure with electrical or manual trim. He asked the pilot/owner to use his electrical trim (on the left yoke), but this did not help. The cfi stated he retracted the flaps and increased power, but the aircraft continued to settle. Subsequently, it hit a tree and a pole, then impacted the ground and struck a vehicle before stopping. A fire erupted and all 3 occupants were burned while evacuating the aircraft. The pilot/owner died from his injuries. No preimpact part failure or malfunction was found during the investigation. Flight test data concerning thrust-drag ratio showed that induced drag increases rapidly below 90 knots. Witnesses said the aircraft was low/slow on final approach. ", "probable_cause": "Occurrence #1: in flight collision with object\r\nPhase of operation: approach - vfr pattern - final approach\r\nFindings\r\n1. (c) in-flight planning/decision - improper - pilot in command (cfi)\r\n2. Descent - inadvertent\r\n3. (c) airspeed - not maintained - pilot in command (cfi)\r\n4. (c) proper altitude - not maintained - pilot in command (cfi)\r\n5. (f) object - tree(s)\r\n6. (f) object - utility pole\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled\r\nFindings\r\n7. Object - vehicle"}