{"url": "https://www.baaa-acro.com/crash/crash-lockheed-pv-1-ventura-richmond", "date": "Nov 18, 1996 at 1335 LT", "type": "Lockheed PV-1 Ventura", "operator": "RAAF%20Museum", "flight_phase": "Landing (descent or approach)", "flight_type": "Demonstration", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Richmond - Richmond", "msn": "5378", "yom": 1943, "flight_number": null, "city": "Richmond AFB", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 0, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11444, "captain_hours_type": 25, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was approaching to land after completing a handling display during an Open Day at RAAF Richmond. At an altitude of about 800 feet, on the base leg for runway 28, both engines stopped simultaneously and without warning. As there was insufficient altitude to reach the field for a power off landing, the flaps and landing gear were retracted and a successful forced landing carried out into a cleared field short of the airfield. The crew evacuated the aircraft without injury.", "probable_cause": "A subsequent investigation failed to positively determine the cause of the simultaneous stoppage of both engines. A large quantity of fuel remained in the tanks and no defects were found with either of the engine fuel systems. The engine ignition systems were tested and functioned normally after the accident. The design of this aircraft, as with other ex-military multi-reciprocating engine types, includes a master ignition switch. The switch is guarded, and when turned off results in the termination of ignition to all engines simultaneously. The switch was removed from the aircraft after the accident and subjected to extensive testing, including vibration tests, but could not be faulted. It was noted however that ignition isolation resulted with only a small movement of the switch from the ON position. The most likely reason for the sudden stoppage of both engines was movement of the master ignition switch from the ON position, possibly as the result of vibration or by a crew member inadvertently bumping the switch prior to landing."}