{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-l-20a-beaver-nose-mountain-3-killed", "date": "Oct 17, 1958", "type": "De Havilland DHC-2 Beaver", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Plain, Valley", "schedule": "Grande Prairie – Edmonton", "msn": "425", "yom": 1952, "flight_number": null, "city": "Nose Mountain", "zone": "Alberta", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On October 17, 1958 a Beaver belonging to the USAF took off from Grande Prairie, Alberta en route to Edmonton, AB., for a routine maintenance inspection. On board were Capt. William Varns, Capt. Walter Brown, Lt. Lawrence Anderson and Sgt. Jackie Herth from the 919th Squadron, Saskatoon Mountain Air Squadron, Beaverlodge, AB. Two hunters were reported missing in the area of Nose Mountain, south of Grande Prairie, and the flight was side-tracked to search for them. The hunters were spotted and the crew radioed that they were going down closer to enable them to drop a note to the hunters. That was the last word from them. A civilian plane with an USAF Sgt. aboard was dispatched from the Grande Prairie airport to search for the missing aircraft. They located it, but had no radio so had to return to Grande Prairie to report. Meanwhile a RCAF Search and Rescue aircraft from Namao, Alberta was dispatched. When they located the crash site, they radioed in the location and continued to circle until a RCAF helicopter from Dawson Creek, British Columbia, reached the site. The helicopter picked up the injured airmen and radioed back that “One of the chaps didn’t make it.” The injured were airlifted to Grande Prairie, AB., and transported by ambulance to the hospital in Beaverlodge. The hunters stayed at the crash site overnight and were airlifted out early the next day when the helicopter returned to fetch the body of Capt. William Varns. The two hunters were praised for their help in assisting the injured airmen. Airframe buried at crash site.\r\nSource & photos: http://www.dhc-2.com/cn425.html", "probable_cause": null}