{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31t-cheyenne-ii-puerto-montt", "date": "Jan 19, 2012 at 2100 LT", "type": "Piper PA-31 Cheyenne", "operator": "Compania%20Chilena%20de%20Fosforos", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Santiago – Puerto Montt", "msn": "31-7920005", "yom": 1979, "flight_number": null, "city": "Puerto Montt-Marcel Marchant (La Paloma)", "zone": "Región de Los Lagos", "country": "Chile", "region": "South America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 30353, "captain_hours_type": 972, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6989, "circumstances": "The twin engine aircraft departed Santiago-Eulogio Sánchez Errázuriz-Tobalaba Airport at 1815LT on a flight to Puerto Montt, carrying seven passengers and one pilot. On approach to Puerto Montt-Marcel Marchant Airport runway 19, his attention was focused on the GPS and he forgot to lower the landing gear. The aircraft belly landed and slid for few dozen metres before coming to rest on the main runway. All eight occupants escaped uninjured while the aircraft was damaged beyond repair. ", "probable_cause": "Belly landing on runway 19 after the pilot forgot to lower the landing gear while approaching the airport. \r\nThe following contributing factors were identified:\r\n- Probable distraction of the pilot by keeping his attention mainly on the GPS equipment to maintain the flight path and avoid unnecessary engine power adjustments,\r\n- The pilot failed to follow the approach and landing checklist, \r\n- The pilot failed to check the three gear lights on the cockpit panel, \r\n- The pilot performed an unstabilized approach without completing the pre-landing checklist and eventually stabilized the airplane at a height of 500 feet. "}