{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-65-a90-king-air-wheeling", "date": "Nov 13, 1997 at 2141 LT", "type": "Beechcraft 90 King Air", "operator": "Skyward%20Aviation%20USA", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Bristol - Washington DC", "msn": "LJ-137", "yom": 1966, "flight_number": null, "city": "Wheeling-Ohio County", "zone": "West Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10000, "captain_hours_type": 100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7290, "circumstances": "The pilots reported they experienced an engine fire during a missed approach in night, IMC conditions, and feathered the propeller and shut down the engine. On an approach to another airport, the airplane touched down short of the runway, traveled onto the runway, and then departed the left side of the runway. The pilot reported he could not maintain altitude due to ice accumulations, and the lack of power with one engine shut down. Examination of the wreckage revealed rotational damage to both engines and propellers consistent with operating engines. Neither propeller was in the feathered position. The pilot had been briefed about known moderate icing conditions, and isolated severe icing. The AFM recommended a minimum speed in icing conditions of 140 knots, and at less than 140 knots, ice could accumulate on the wings in unprotected areas. The pilot reported he flew the approach at 114 knots. ", "probable_cause": "The failure of the pilot to maintain the minimum required airspeed while operating in icing conditions which resulted in ice accumulations and an inadvertent stall while on approach. Factors were the icing conditions and the pilot's lack of experience in the airplane. "}