{"url": "https://www.baaa-acro.com/crash/crash-bae-atp-f-wamena", "date": "Mar 4, 2015 at 1515 LT", "type": "BAe ATP", "operator": "Deraya-Air-Taxi", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jayapura – Wamena", "msn": "2029", "yom": 1990, "flight_number": null, "city": "Wamena", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3912, "captain_hours_type": 833, "copilot_hours": 415, "copilot_hours_type": 45, "aircraft_hours": 200845, "circumstances": "On 4 March 2015 a BAe-ATP registration PK-DGB operated by PT. Deraya Air as scheduled cargo flight from Sentani to Wamena Airport. On board of this flight was two pilots while the Pilot in Command (PIC) acted as pilot flying and First Officer (FO) acted as pilot monitoring. The aircraft departed Sentani at 0524 UTC to Wamena airport. The pilot contacted Wamena Tower controller while position on Jiwika way point at altitude 10,000 feet. Wamena Tower controller instructed to use runway 33 and to proceed to left runway 33. At 0602 UTC the pilot requested to proceed to Pyramid waypoint and to descend to 8,000 feet and made holding due to weather. At 0613, a C-130 pilot that was on approach reported making go around runway 33 and ATC instructed to C-130 pilot to proceed to Pyramid waypoint and hold. At 0619 UTC, Wamena Tower controller informed that the weather reported continuous heavy rain, visibility was reported 2 up to 3 km and wind was from 060° with velocity of 6 knots. The PK-DGB aircraft left Pyramid waypoint for approach runway 33. The aircraft proceed to left downwind and descent to 6,500 feet. During turning base leg, the pilot observed runway insight and continued the approach. At 0620 UTC, the aircraft touched down, thereafter veered off to the right of the runway and skid. The aircraft re-entered the runway at approximately 400 meters from beginning runway 33 and stopped near taxiway Delta at approximately 800 meters from beginning runway 33. ", "probable_cause": null}