{"url": "https://www.baaa-acro.com/crash/crash-armstrong-whitworth-aw38-whitley-v-sylling-1-killed", "date": "Apr 30, 1940 at 0105 LT", "type": "Armstrong Whitworth AW.38 Whitley", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Bombing", "survivors": "Yes", "site": "Mountains", "schedule": "Kinloss - Kinloss", "msn": "1575", "yom": 1939, "flight_number": null, "city": "Sylling", "zone": "Buskerud", "country": "Norway", "region": "Europe", "crew_on_board": 5, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew left RAF Kinloss at 2000LT on 29APR with Oslo-Fornebu Airport as its target. While approaching Oslo by night, the aircraft was shot down by Flak. Four crew members abandoned the aircraft and bailed out. They were later recovered and taken PoW. The aircraft then crashed in flames in a wooded area located on the top of a mountain near Sylling, some 27 km west of Oslo, killing the fifth crew member. \r\nCrew (102nd Squadron):\r\nF/O K. H. P. Murphy, \r\nSgt J. F. Graham,\r\nSgt C. Warner,\r\nCpl D. Magee,\r\nLAC John Ellwood. †\n\r\nThanks to Bent Julenissen Lønrusten for his following testimony:\r\nMy great aunt watched the burning plane go down.  I have been to the crashe site several times and based on the pieces of fuselage left is was damaged hard by flak. Pictures taken of the wreck on the crashe site the day after the crash show a plane damaged by flak. Based on the reports the DY-C was hit by flak during the bombing of Fornebu. The flak was hard. Four crew members jumped from the wounded plane. Two over Asker and two over Sylling. Murphy and Graham came to a farm and told the story of the crash, they where later taken prisoner and sent to Germany. I talked to one of the farm members and based on the story told by FO Murphy, John Ellwood was killed by flak over Oslo, the plane was burning and over Sylling the engines stopped. A big explosion was heard just before the plane came down from NW and crashed onto the ridge named Brennenga. Witnesses told that it crashed at 0105LT. The wristwatch of LAC Ellwod had stopped at this time. Based on his wounds he was killed instantly, and blood in the front of the plane showed that he was not in his rear turret, but most likely helping out the stop the fire.  John Ellwood was found outside the plane.  And uncle of mine spoke to FO Murphy on his visit to Ellwoods grave in 1949.  Murphy said the same.  Flak damage and fire forced the plane to crash.", "probable_cause": null}