{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-950m-near-mangamingi-1-killed", "date": "Mar 1, 1983 at 0848 LT", "type": "Fletcher FU-24", "operator": "Wanganui%20Aero%20Work", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Mangamingi - Mangamingi", "msn": "001", "yom": 1954, "flight_number": null, "city": "Mangamingi", "zone": "Taranaki Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot and loader driver arrived in the morning in ZK-CLI, flying over from Stratford. They had been working at the same farm the previous day. At about 08:35 a break in the operation was taken for refueling. The Fletcher was airborne again at about 08:45 carrying 16 hundredweight ( 815 kgs ) of fertilizer, and the pilot flew towards an area of river flat enclosed in a horseshoe bend in the Patea River, surrounded by higher ground. The loader driver reversed his vehicle to the superphosphate bin and began filling the bucket in preparation for the next sortie. As he did so he heard the sound of an impact and, hurrying back to the airstrip, saw the Fletcher crashed nose down on a hillside above the opposite bank of the Patea River, and about 1,200 metres to the northeast of the strip. The driver estimated that about a minute and a half had elapsed between the take off and the sound of the crash. The aircraft was wrecked. There was no fire. The pilot was found dead. The weather was fine with a light breeze. Flying conditions were not considered to be a factor in the accident. The condition of the propeller showed that the engine was producing power at the time of impact. The gross weight and C of G were within the permitted limits. There was evidence of about 250 kg of fertilizer at the crash site. It is believed that the pilot had carried out two sowing runs on the river flat area and was climbing away steeply to clear an adjacent ridge when control was lost during a turn and the plane dived into the ground.\n", "probable_cause": null}