{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-paris-1-killed", "date": "Aug 27, 2013 at 1120 LT", "type": "Cessna 421C Golden Eagle III", "operator": "RSB Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Paris - Terre Haute", "msn": "421C-0088", "yom": 1976, "flight_number": null, "city": "Paris", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 8600, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3000, "circumstances": "Company personnel reported that, in the weeks before the accident, the airplane's left engine had been experiencing a problem that prevented it from initially producing 100 percent power. The accident pilot and maintenance personnel attempted to correct the discrepancy; however, the discrepancy was not corrected before the accident flight, and company personnel had previously flown flights in the airplane with the known discrepancy. Witnesses reported observing a portion of the takeoff roll, which they described as slower than normal. However, the airplane was subsequently blocked from their view. Examination of the runway environment showed that, during the takeoff roll, the airplane traveled the entire length of the 4,501-ft runway, continued to travel through a 300-ft-long grassy area and a 300- ft-long soybean field, and then impacted the top of 10-ft-tall corn stalks for about 50 ft before it began to climb. About 1/2 mile from the airport, the airplane impacted several trees in a leftwing, nose-low attitude, consistent with the airplane being operated below the minimum controllable airspeed. The main wreckage was consumed by postimpact fire. Postaccident examinations revealed no evidence of mechanical anomalies with the airframe, right engine, or propellers that would have precluded normal operation. Given the left engine's preexisting condition, it is likely that its performance was degraded; however, postimpact damage and fire preluded a determination of the cause of the problem. ", "probable_cause": "The pilot's failure to abort the takeoff during the ground roll after detecting the airplane's degraded performance. Contributing to the accident was the pilot's decision to attempt a flight with a known problem with the left engine and the likely partial loss of left engine power for reasons that could not be determined during the postaccident examination of the engine."}