{"url": "https://www.baaa-acro.com/crash/crash-dornier-do328-100tp-fakfak", "date": "Nov 6, 2008 at 1033 LT", "type": "Dornier DO328", "operator": "Express-Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Sorong - Fakfak", "msn": "3037", "yom": 1995, "flight_number": "XAR9000", "city": "Fakfak", "zone": "Special Region of West Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 32, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10190, "captain_hours_type": 2365, "copilot_hours": 4673, "copilot_hours_type": 15, "aircraft_hours": 24404, "circumstances": "The aircraft touched down heavily approximately 5 meters before the touch-down area of runway 10 at Torea Airport, Fak-Fak at 01:33. The investigation found that the left main landing gear touched the ground first (5 meters before the end of the runway), and the right main landing gear touched the ground (4.5 meters from the end of the runway). It stopped on the runway, approximately 700 meters from the touch-down area. The left main landing gear fractured in two places; at the front pivot point, and the aft pivot point. The left fuselage contacted the runway surface 200 meters from the touch-down point and the aircraft slid with the left fuselage on the ground for a further 500 meters, before it stopped at the right edge of the runway. The wing tip and left propeller blade tips also touched the runway and were damaged. The passengers and crew disembarked normally; there were no injuries. Following an inspection of the landing gear and temporary replacement of the damaged left main landing gear, the aircraft was moved to the apron on 8 November 2008 at 04:00. The runway was closed for 5 days.", "probable_cause": "The Digital Flight Data Recorder data showed evidence that the aircraft descended suddenly and rapidly when it was on short final approach before the aircraft was above the touchdown area. Propeller RPM was reduced suddenly and rapidly to 70% less than 10 seconds before ground contact. Given that the propellers are constant speed units, the sudden and rapid changes could not be explained other than the probability that a crew member had made the control inputs. The PIC (pilot monitoring/flight instructor) did not monitor the operation of the aircraft sufficiently to ensure timely and effective response to the pilot induced excessive sink rate.\r\nOther Factors:\r\nThe airport did not meet the ICAO Annex 14 Standard with respect to the requirement to have runway end safety areas. "}