{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-17c-flying-fortress-tells-peak-1-killed", "date": "Nov 2, 1941", "type": "Boeing B-17 Flying Fortress", "operator": "USAAF", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "Yes", "site": "Mountains", "schedule": "Salt Lake City - McClellan AFB", "msn": "2048", "yom": 1940, "flight_number": null, "city": "Tells Peak", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The bomber departed Fort Douglas with five crew and four passengers on 31Oct41. The destination of the flight was the Sacramento Air Depot, McClellan Field, California where the No.3 engine with over 420 hours on it was to be replaced. After a two day stopover in Reno, NV, because of bad weather to the west, they departed late on the morning on an instrument flight to their destination 2Nov41. There was no Command Set installed on this aircraft so the flight crew relied on their Compass Set radio to navigate to the airfield in Sacramento. After passing Lake Tahoe, the plane entered into the overcast sky. Then, after several minutes, the radio begun to static, and communications were down to the point where they were unable to check it at Donner Summit. Attributing the loss of radio functions to a temporary static condition, the pilot continued on to Sacramento via a more southerly route. Then, at that moment, the No.1 supercharger began to have problems maintaining pressure. With the aircraft in a climb towards 14,000ft, the co-pilot attempted to manipulate the supercharger controls to add additional pressure to it. Being partially successfully, the pressure continued to change, but not lost entirely, the flight continued onward. Then, after 45 minutes of flight, the flight indicators all ceased working. With the vacuum pumps having problems, and the pitot tube heat being turned on, no clear cause could be determined for this difficulty. The pilot and co-pilot decided to head back to Reno. Throttling up the engines to climb to 18,000ft, the aircraft pulled to the right. The flight crew, trying to hold the B-17 in a straight line of flight, cut the engine power to try again. After a more successfully attempt, the pilot and co-pilot realized they were having serious troubles controlling the airplane, the pilot ordered the crew to don parachutes as a precaution, and be ready to bail out of the aircraft. With their bank-and-turn instrument being the only functioning guide, the aircraft seemed to be handling fine. Then, the nose rose slightly, the pilot compensated by pushed the controls downward. The pilot, attempting to level off the aircraft's descent, realized that flight controls had been lost. He attempted to pull the controls back to regain attitude, but the aircraft then rolled over onto its back, righted itself for a brief moment, and then plummeted into a spin. As the aircraft began to break apart, six of the crew were able escape by jumping out. Two were thrown from the plane. All eight of these airmen parachuted to safety, leaving the pilot trapped in the cockpit as the bomber plummeted down to earth; he did not make it out. The aircraft crashed on Tells Peak, southwest of Lake Tahoe.\n\r\nSource: http://www.joebaugher.com/usaf_serials/1940.html", "probable_cause": null}