{"url": "https://www.baaa-acro.com/crash/crash-cessna-s550-citation-sii-friemersheim-3-killed", "date": "Jan 23, 2020 at 1050 LT", "type": "Cessna 550 Citation II", "operator": "SACAA", "flight_phase": "Flight", "flight_type": "Calibration", "survivors": "No", "site": "Mountains", "schedule": "George - George", "msn": "S550-0078", "yom": 1985, "flight_number": null, "city": "Friemersheim", "zone": "Western Cape", "country": "South Africa", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 5215, "captain_hours_type": 1315, "copilot_hours": 1061, "copilot_hours_type": 265, "aircraft_hours": 10106, "circumstances": "A Cessna S550 Citation S/II of the South African Civil Aviation Authority crashed into the Outeniqua mountains, near the town of Friemersheim. The three occupants were killed and the aircraft was destroyed. The Citation departed Port Elizabeth Airport (FAPE) on a positioning flight to George Airport (FAGG). On approach to FAGG, the flying crew requested to carry out a calibration flight for the very high frequency omnidirectional range (VOR) beacon at FAGG. Due to inclement weather conditions at the time, they were not cleared to conduct VOR calibration. As a result, they decided to land and refuel the aircraft before commencing with the calibration of the Instrument Landing System (ILS) on runway 11 at FAGG. The flying crew requested take-off from runway 11 and an early right turn to intercept radial 250°, 17 nautical miles (nm) DME arc to radial 330° at 3000 feet (ft) climbing to 4,000 feet. The air traffic control (ATC) granted their request. Radar data indicated that at 10:42, the aircraft took off from runway 11 and, once airborne, made a right-hand turn to intercept radial 250° using the George VOR (GRV VOR). The aircraft climbed to 3000ft. Once the aircraft reached 17 nm on the DME from the GRV VOR (DME is co-located with the VOR), it commenced with a right-hand turn to intercept radial 330° while maintaining 17nm DME arc. At 10:46, the ATC at FAGG advised the flying crew that they were now exiting controlled airspace and were advised to broadcast on the special rules frequency. The crew acknowledged the advisory to change frequency and there was no further communication. The aircraft was still being monitored by ATC using secondary surveillance radar. At 10:50, radar data showed the aircraft crossing radial 310° and entered a climb from 3000ft, reaching 3,900 feet. As the aircraft levelled off at 3,900 feet, a rapid descent occurred, and the aircraft lost 1500ft in approximately 9 seconds. Three seconds prior to impact, the aircraft nose pitched up before impacting a ridge at 2,192 feet. The aircraft was destroyed and all three occupants were killed. ", "probable_cause": "The crew lost control of the aircraft which resulted in significant loss of altitude; as they attempted to recover, they collided with the mountain. According to the SAWS report, there was significant cloud coverage below 1,500 feet above ground level at the time of the accident as observed in the METARs. Mountain tops were obscured as seen on the webcam. The aircraft route which is 17 NM arc passes over the obscured mountains. From the limited FDR reading the aircraft attitude drastically changed into an unusual attitude when approaching the mountain area. This indicates that most probably, the pilot has entered an unusual attitude during transition from VFR to IFR flight without preparation. The accident flight plan was VFR.\r\nThe following contributing factor were identified:\r\n- The presence of low clouds at about 1,500 feet above ground and obscured mountains with clouds, \r\n- The incapability of the crew to recover from unusual attitude,\r\n- Lack of supervision and disregard of the Civil Aviation Regulations requirements by the FIU (operator),\r\n- Overbanked and steep dive maneuver, unable to gain the required altitude before impact,\r\n- Lack of upset prevention and recovery technique (UPRT)."}