{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-goulburn-1-killed", "date": "May 15, 1979 at 1851 LT", "type": "Cessna 340", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Melbourne – Ballarat – Bendigo – Albury – Goulburn – Sydney", "msn": "340-0349", "yom": 1974, "flight_number": null, "city": "Goulburn", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 3500, "captain_hours_type": null, "copilot_hours": 1060, "copilot_hours_type": 3, "aircraft_hours": null, "circumstances": "The pilot contacted Sydney Flight Service Center at 1849, advised he was taxiing for runway 22 and that he would call again on departure. No further transmissions were received from the aircraft. VH-TDU completed an apparently normal take off and the landing gear was retracted. Shortly after it became airborne, it entered a gradual descending left turn and flew into the ground. The initial impact was on the left wing tip, approximately 1700 metres south of the departure end of Runway 22, at a speed of about 125 knots. The aircraft bounced, rolled inverted and again struck the ground some 100 metres further to the east. It then ;slid across the ground for a further 230 metres. A small fuel-fed fire broke out in the right wing but died out after several minutes. Five occupants were slightly injured while the captain was killed. Examination of the wreckage found no evidence of pre-existing mechanical malfunction or defect, apart from an open circuit in the gyro motor of the pilot's turn co-ordinator instrument. The instrument was not subjected to mechanical damage during impact and it is likely the fault existed prior to the accident. It could not be determined whether the pilot was aware that the instrument was unserviceable. All other instruments, including the primary flight instruments used in aircraft attitude control, were found to be serviceable and calibrated within specified limits. There was no evidence of pilot incapacitation prior to impact. Injuries were such that he was unable to recall details of the final flight. The passengers were not aware of any abnormality until the aircraft struck the ground. The pilot's current log book was not located. Therefore, while it is known that he had considerable experience at flying Cessna 340 aircraft, his hours on this type are unknown.", "probable_cause": "There is insufficient evidence to establish the cause of the accident but the most likely explanation is that the pilot, influenced by fatigue, did not adequately refer to the flight instruments during the take-off and initial climb."}