{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-nome-0", "date": "Feb 19, 2009 at 1812 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Frontier%20Flying%20Service2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Brevig Mission – Nome", "msn": "31-8553001", "yom": 1985, "flight_number": "FTA8218", "city": "Nome", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 5, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 24850, "captain_hours_type": 7500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10928, "circumstances": "The scheduled commuter flight was about 10 miles north of the destination airport, operating under a special visual-flight-rules clearance, and descending for landing in instrument meteorological conditions. According to the pilot he started a gradual descent over an area of featureless, snow-covered, down-sloping terrain in whiteout and flat light conditions. During the descent a localized snow shower momentarily reduced the pilot’s forward visibility and he was unable to discern any terrain features. The airplane collided with terrain in an all-white snow/ice field and sustained substantial damage. At the time of the accident the destination airport was reporting visibility of 1.5 statute miles in light snow and mist, broken layers at 900 and 1,600 feet, and 3,200 feet overcast, with a temperature and dew point of 25 degrees Fahrenheit. The pilot reported that there were no pre accident mechanical problems with the airplane and that the accident could have been avoided if the flight had been operated under an instrument-flight-rules flight plan.\n", "probable_cause": "The pilot's continued flight into adverse weather and his failure to maintain clearance from terrain while on approach in flat light conditions.\n"}