{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b60-duke-olney-2-killed", "date": "May 9, 1995 at 0711 LT", "type": "Beechcraft 60 Duke", "operator": "Leonard Schroetlin", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dixon - Olney", "msn": "P-374", "yom": 1976, "flight_number": null, "city": "Olney-Noble", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2805, "captain_hours_type": 1405, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1079, "circumstances": "The pilot was cleared for the localizer runway 11 approach. The airplane impacted in an open field approximately 1 mile northeast of the airport and approximately 600 feet left of the extended centerline of the departure end of the runway. A witness saw the airplane at a low altitude, and stated 'it was foggy,' and he did not see the airplane until it was directly over his head. The witness stated that he saw the airplane for about '3 seconds,' at an altitude of 'between 50 and 100 feet above the ground,' and it did not sound like it was having 'mechanical difficulty.' The airplane turned left (north), and struck the ground with the left wing. The published missed approach called for a climbing 'right turn.' The olney airport automated weather observing system (awos) was operating and current at the time of the accident, but could only be obtained by telephone; hence atc could not provide the pilot with the current awos information. The pilot was provided the Evansville, Indiana (EVV) weather; 1,200 scattered, measured 4,500 overcast, visibility 5 miles, light rain and fog. Evansville was located approximately 20 miles southeast of Olney. The local (awos) weather was; partial obscuration, 100 feet overcast, visibility 3/4 mile.", "probable_cause": "The pilot's improper IFR procedures by descending below the minimum descent altitude and not executing the published missed approach procedures. A factor in thE accident was the low overcast and fog conditions. "}