{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-049-constellation-hinsdale-78-killed", "date": "Sep 1, 1961 at 0205 LT", "type": "Lockheed L-049 Constellation", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Boston – New York – Pittsburgh – Chicago – Las Vegas – Los Angeles – San Francisco", "msn": "2035", "yom": 1945, "flight_number": "TW529", "city": "Hinsdale", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 73, "pax_fatalities": 73, "other_fatalities": 0, "total_fatalities": 78, "captain_hours": 17011, "captain_hours_type": 12633, "copilot_hours": 5344, "copilot_hours_type": 1975, "aircraft_hours": 43112, "circumstances": "During engine runup, Flight 529 was given its air traffic control clearance which was: \"cleared to the Las Vegas Airport via Victor 6 Naperville, Victor 8 flight plan route, maintain 5,000 feet.\" The clearance was acknowledged correctly and TWA Flight 529 departed on runway 22L at 0200, making a right turn out of traffic. The 0200 Midway Airport weather was: scattered clouds at 10,000 feet; high overcast, visibility three miles in haze and smoke; wind south eight knots. The Chicago O'Hare Airport weather at 0200 was: partial obscuration; scattered clouds 15,000 feet; high overcast; visibility two and one-half miles in ground fog and smoke; wind south six knots. Radar contact was established with the flight one minute and 34 seconds after the flight acknowledged takeoff clearance and as the aircraft proceeded outbound in a right turn. At 0204, Flight 529 was observed on radar by the departure controller to be five miles west of Midway Airport proceeding on course. Northwest Airlines Flight 105 was cleared for takeoff on runway 22L at Midway, and took off Immediately. The ground controller observed a flash west of Midway Airport at this time and asked Flight 105 if he had seen a flash. Flight 105 advised that they had seen a flash fire and would fly over the area. As Flight 105 reported over the fire, the radar range was noted to be nine miles west of Midway Airport and the radar return of TWA. Flight 529 had disappeared from the scope. It was later determined that Flight 529 had crashed at this site and that the observed ground fire was the result of the accident. The airplane disintegrated in a field and all 78 occupants have been killed. ", "probable_cause": "The Board determines that the probable cause of this accident was the loss of an AN-175-21 nickel steel bolt from the parallelogiam linkage of the elevator boost system, resulting in loss of control of the aircraft."}