{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-pownal-1-killed", "date": "Aug 4, 2006 at 0918 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Airnow", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "No", "site": "Mountains", "schedule": "Binghamton - Bennington", "msn": "110-396", "yom": 1982, "flight_number": "BEN059", "city": "Pownal", "zone": "Vermont", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2877, "captain_hours_type": 47, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 40043, "circumstances": "The airport's instrument approach procedures included a very high frequency, omnidirectional range (VOR) approach, and a global positioning system (GPS) approach that was not an overlay. The VOR approach procedure included an inbound course to the VOR, and after passage, a descent along the same course to a missed approach point. The missed approach point was defined as 6 nautical miles beyond the VOR, as well as by timing. The pilot twice attempted the VOR approach in instrument meteorological conditions. He flew the first approach to the missed approach point, initiated a missed approach, contacted the controller, and requested a second VOR approach. He then received vectors to rejoin the approach course inbound to the VOR. The airplane subsequently passed over the VOR, on course, about 100 feet above the minimum altitude. However, instead of descending as described in the procedure, the airplane maintained that altitude until reaching the airport, then began a descent. The airplane continued to travel outbound along the same approach course until it impacted rising terrain about 6.5 miles beyond the airport. There was no dedicated distance measuring equipment (DME) onboard the airplane. Instead, distance was determined by the use of an instrument flight rules (IFR)-approved GPS unit. Due to the non-storage capability of the unit, historical waypoint selection could not be determined. The pilot could have selected the airport as a \"direct to\" waypoint, or, if he had entered flight plan waypoints, the unit would have sequenced from the VOR to the airport during the first approach. In either case, unless the pilot reprogrammed the unit, the last waypoint entered would have remained at the airport, rather than the VOR. The pilot then most likely mistook the airport position for the VOR position, and displaced the beginning of the descent by 6 nautical miles. Also noted, was that once the airplane passed over the VOR en route to the airport, the HSI would have indicated a change of \"to\" to \"from\". There were no medical anomalies noted with the pilot and no mechanical anomalies noted with the airplane.\n", "probable_cause": "The pilot's misinterpretation of the airplane's position relative to the final approach fix, which resulted in the displacement of the descent profile by 6 nautical miles and the subsequent controlled flight into rising terrain. Contributing to the accident were the low clouds.\n"}