{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-100-king-air-jeffersonville", "date": "Oct 30, 2016 at 1235 LT", "type": "Beechcraft 100 King Air", "operator": "Honaker%20Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jeffersonville – Brunswick", "msn": "B-21", "yom": 1970, "flight_number": null, "city": "Jeffersonville-Clark County", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13142, "captain_hours_type": 34, "copilot_hours": 1605, "copilot_hours_type": 3, "aircraft_hours": 12583, "circumstances": "The airline transport pilot, who was the pilot flying, and commercial pilot, who was the pilot not flying and was acting as a safety pilot and was not expected to know the airplane's systems, limitations, or characteristics, were preparing to depart for a personal flight with eight passengers on board. When the pilot arrived at the airport, he determined that the airplane had 900 lbs of fuel onboard. He instructed the lineman to fuel the airplane with 211 gallons of fuel (1,413.7 lbs) for a fuel total of 2,313.7 lbs. The pilot reported that he was aware that the total weight of the eight passengers, their bags, and the fuel caused the airplane to be overweight but that he did not complete a weight and balance form or determine the expected takeoff performance before the flight. He informed the other pilot that the flight would be heavy, but he did not tell him how much the airplane exceeded the airplane's maximum gross takeoff weight. After the accident, the pilot determined that the airplane was 623 lbs over the maximum gross takeoff weight. The pilot reported that the airplane's flight controls and engines were operating normally during the pretakeoff check and that the elevator pitch trim was positioned in the \"green\" range. The pilot taxied the airplane onto the runway and applied the brakes and increased the throttles to takeoff power before releasing the brakes for the takeoff roll. However, he did not confirm the power settings that he applied when he advanced the throttles. The airplane did not accelerate as quickly as the pilot expected during the takeoff roll. When the airplane was about halfway down the runway, the airspeed was 80 kts, so the pilot continued the takeoff roll, but the airplane was still not accelerating as expected. He stated that he heard the other pilot say \"redline,\" so he decreased the power. At this point, the airplane had reached the last third of the runway, and the pilot pulled back on the control yoke to lift the airplane off the runway, but the stall warning sounded. He lowered the nose, but the airplane was near the end of the runway. He added that he did not get \"on\" the brakes or put the propellers into reverse pitch and that the airplane then departed the runway. The pilot veered the airplane right to avoid the instrument landing system antenna, which was 500 ft from the end of the 5,500-ft-long runway, but the left wing struck the antenna, the left main landing gear and nose gear collapsed, and both propellers contacted the ground. The airplane then skidded left before stopping  about 680 ft from the end of the runway. The pilot reported that the airplane did not have any preaccident mechanical malfunctions or failures. The evidence indicates that the pilot decided to depart knowing that the airplane was over its maximum gross takeoff weight and without determining the expected takeoff performance. During the takeoff roll, he did not check his engine instruments to determine if he had applied full takeoff power, although the acceleration may have been sluggish because of the excess weight onboard. The other pilot was not trained on the airplane and was not able to provide the pilot timely performance information during the takeoff. Neither the pilot nor the other pilot called out for an aborted takeoff, and when they recognized the need to abort the takeoff, it was too late to avoid a runway excursion. ", "probable_cause": "The pilot's inadequate preflight planning, his decision to take off knowing the airplane was over its gross takeoff weight, and his failure to abort the takeoff after he realized that the airplane was not accelerating as expected, which resulted in a runway excursion. "}