{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-boothville", "date": "Sep 15, 2019 at 1146 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Mailworks", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Titusville – Ozona – Santee", "msn": "46-36470", "yom": 2010, "flight_number": null, "city": "Boothville", "zone": "Louisiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3500, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1116, "circumstances": "On September 15, 2019, at 1146 central daylight time, a Piper PA-46-350P, N218MW, lost engine power while maneuvering over the Gulf of Mexico, and the pilot was forced to ditch. The private pilot was not injured. The airplane was registered to and operated by Mailworks, Inc., Spring Valley, California, under Title 14 Code of Federal Regulations Part 91 as a personal flight. Visual meteorological conditions existed near the accident site at the time of the accident, and the flight was operated on a visual flight rules flight plan. The flight originated at 0830 eastern daylight time from Space Coast Regional Airport (TIX), Titusville, Florida, and was en route to Ozona Municipal Airport (OZA), Ozona, Texas. His final destination was Gillespie Field Airport (SEE), El Cajon, California. According to the pilot's accident report, he departed TIX with 140 gallons of fuel. After crossing Gulfport (GPT), Mississippi's Terminal Radar Service Area (TRSA) at 10,500 ft, he initiated a slow descent over Boothville, Louisiana, and proceeded southbound towards the mouth of the Mississippi River, descending to 1,500 ft. He then configured the airplane for climb. The engine did not respond to the application of power and the airplane began losing altitude. After going through the emergency checklist, he was unable to restore engine power, and declared an emergency to Houston air route traffic control center (ARTCC) and on frequency 121.5 mHz. He also activated the emergency locator transmitter (ELT) prior to ditching. After ditching, the pilot put on his life jacket, exited the airplane, and remained on its wing until it sank. About an hour later, a U.S. Coast Guard helicopter rescued the pilot and transported him to a hospital in New Orleans, Louisiana. He was discharged a few hours later. The airplane has not been recovered.", "probable_cause": " A loss of engine power for undetermined reasons."}