{"url": "https://www.baaa-acro.com/crash/crash-cessna-421b-golden-eagle-ii-big-bear-lake-3-killed", "date": "Nov 14, 2006 at 1013 LT", "type": "Cessna 421B Golden Eagle II", "operator": "Robert F. Cartwright", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Big Bear Lake - Las Vegas", "msn": "421B-0658", "yom": 1974, "flight_number": null, "city": "Big Bear Lake", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4700, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4556, "circumstances": "Witnesses said that it appeared that the left engine sustained a loss of power just after rotation and liftoff. The airplane initially had a positive rate of climb, but then immediately yawed to the left as it cleared 30-foot-high power lines that were perpendicular across the flight path. The airport is at the east end of a lake in a mountain valley; the airplane departed to the west and was flying over the lake. The airplane was about 2 miles from the runway when witnesses observed dark smoke coming from the left engine, and the smoke increased significantly as the flight continued. The airplane banked hard left with the wings perpendicular to the ground, and then nosed in vertically. The landing gear remained down throughout the accident sequence. On site examination revealed that the top spark plugs for the left engine were black and sooty. A detailed examination revealed that the left turbocharger turbine wheel shaft fractured and separated. Extreme oxidation of the fracture surfaces prevented identification of the failure mode; however, the oxidation was the result of high temperature exposure indicating that the fracture occurred while the turbocharger was at elevated temperature during operation. The multiple planes exhibited by the fracture also were not consistent with a ductile torsional failure as would be expected from a sudden stoppage of either rotor. No evidence of a mechanical malfunction was noted to the right engine. The Cessna Owners Manual for the airplane notes that the most critical time for an engine failure is a 2-3 second period late in the takeoff while the airplane is accelerating from the minimum single-engine control speed of 87 KIAS to a safe single-engine speed of 106 KIAS. Although the airplane is controllable at the minimum control speed, the airplane's performance is so far below optimum that continued flight near the ground is improbable. Once 106 KIAS is achieved, altitude can more easily be maintained while the pilot retracts the landing gear and feathers the propeller. The best single-engine rate-of-climb is 108 KIAS with flaps up below 18,000 feet msl. Section VI of the manual provides operational data for single-engine climb capability. The data was only valid for the following conditions: gear and flaps retracted, inoperative propeller feathered, wing banked 5 degrees toward the operating engine, 39.5 inches of manifold pressure if below 18,000 feet, and mixture at recommended fuel flow.", "probable_cause": "Failure of the turbine wheel shaft in the left turbocharger during the takeoff initial climb for undetermined reasons, and the pilot's failure to attain and maintain safe single engine airspeed that led to a loss of control."}