{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-7b-pilottown-42-killed", "date": "Nov 16, 1959 at 0055 LT", "type": "Douglas DC-7", "operator": "National-Airlines-4", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Miami – Tampa – New Orleans", "msn": "45355", "yom": 1958, "flight_number": "NA967", "city": "Pilottown", "zone": "Louisiana", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 36, "pax_fatalities": 36, "other_fatalities": 0, "total_fatalities": 42, "captain_hours": 14700, "captain_hours_type": 400, "copilot_hours": 8710, "copilot_hours_type": 400, "aircraft_hours": 6578, "circumstances": "While cruising at an altitude of 14,000 feet by night and approaching the Louisiana Coast, the airplane disappeared from radar screens and crashed into the Gulf of Mexico about 30 miles east of Pilottown. Intensive sea and air searches resulted in finding nine floating bodies and a small amount of floating debris the following morning. None of this disclosed conclusive evidence as to the genesis of the accident. The main wreckage has not been located despite several well planned searches. There was no radio message of impending trouble or any distress call from the crew prior to the accident. All 42 occupants were killed in the crash. ", "probable_cause": "Analysis of this accident must rest almost entirely on circumstantial evidence for the aircraft's wreckage still lies on the bottom of the Gulf. There is little or no physical evidence upon which to explain this accident. The aircraft was airworthy at the tine of departure, the crew was competent, weather conditions were good, and when disaster struck, the flight was very close to being both on course and on schedule. No operational or maintenance item was found which can reasonably be linked to this accident. It may safely be concluded that there was no warning of the disaster. This is evident by the lack of any unusual radio messages. As has been detailed, the fire marks on bodies and on debris were of the type caused exclusively by a flash surface fire, probably both hot and brief, upon impact with the water. Because of the lack of physical evidence, the probable cause of this accident remains unknown."}