{"url": "https://www.baaa-acro.com/crash/crash-rockwell-aero-commander-685-near-ben-lomond-1-killed", "date": "Jan 20, 1984 at 0825 LT", "type": "Rockwell Aero Commander 685", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Mountains", "schedule": "Armidale – Glen Innes", "msn": "685-12054", "yom": 1973, "flight_number": null, "city": "Ben Lomond", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "During the flight the pilot reported that he would descend to cruise at 500 feet above ground level. Witnesses saw an aircraft at low level on the expected track, and others heard aircraft noise and then the sound of an impact. Weather conditions were overcast with low cloud covering the hills. The wreckage was found at an elevation of about 4,300 feet above mean sea level. The aircraft had apparently struck the ground while in a steep nosedown attitude and rotating to the right. A fire had broken out and engulfed the wreckage. The pilot, sole on board, was killed. ", "probable_cause": " Investigation did not reveal any defect or malfunction of the aircraft which might have contributed to the development of the accident. Both engines were operating at high power settings and the gear and flaps were up. The aircraft had been operating under the Instrument Flight Rules when the pilot reported his intention to descend. Conditions at the destination were suitable for visual flight, and the reason the pilot elected to proceed at a low height above the ground was not determined. It was likely that while cruising below the cloud, the pilot was suddenly confronted by localised adverse weather conditions in the vicinity of the accident site. The maintenance of control of the aircraft under these conditions should have presented little problem to the pilot, who was suitably qualified to operate in instrument conditions. In these circumstances, the precise sequence of events leading to the evident loss of control of the aircraft could not be established."}