{"url": "https://www.baaa-acro.com/crash/crash-short-s25-sunderland-iii-bowmore-9-killed", "date": "Jan 24, 1943 at 1930 LT", "type": "Short S.25 Sunderland", "operator": "Royal-Air-Force-4", "flight_phase": "Landing (descent or approach)", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Bowmore - Bowmore", "msn": null, "yom": null, "flight_number": null, "city": "Bowmore (Isle of Islay)", "zone": "Hebrides Islands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 12, "crew_fatalities": 9, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew of the aircraft had been on an operational patrol, carrying out a parallel track search, from Bowmore of the sea area RU58, having taken off at 0724LT. The sea state at Bowmore was not ideal that day and it was expected that after dark it would be too rough to land aircraft. The original ETA back at Bowmore for DV979 had been 1810LT which being just before last light and it was decided by Flying Control not to divert the crew to Lough Erne in Northern Ireland. At 1700LT the situation was reviewed and the flare path was laid in the calmest area of water available should the aircraft arrive a little late. Shortly after the crew made contact with Bowmore stating that they would be 50 minutes late, at this point they were told that if they had sufficient fuel they were to divert to Lough Erne. However at the time the aircraft was contacted they only had some 45 minutes fuel remaining and were unable to divert. At 1926LT, over a hour late and in near complete darkness, DV979 arrived back overhead at Bowmore. The flare path was ignited and Capt Lever was told that he could not overshoot his landing as the landing area finished close to where other aircraft were moored. He then warned his crew to expect a rough landing and gathered them in the upper deck around the cockpit.After gathering the crew Capt Lever and P/O Johnston began their approach overland from the north, intending to cross the northern shore of Loch Indaal at 200 feet and touch down as soon as possible. While approaching the coast the port float struck a building near the shore and the aircraft crashed a short distance beyond it. A fire quickly took hold and the crew began to evacuate the aircraft, at least nine had survived the crash. Captain Lever was spotted by Sgt Hogg wandering on the shore ahead of the aircraft and he called to Sgt Williams that they should go and get him. As the two Sergeants reached their Captain, about 30 yards away, the aircraft's Depth Charges detonated destroying the aircraft and killing outright the men who were still around the wreck to help pull trapped colleagues from the aircraft.\nCrew (246th Squadron):\nCpt Eric John Lever, pilot,\nP/O Wallace Arthur Johnston, pilot, †\nSgt Walter Eric Charles Heath, navigator, †\nSgt George Charles Major, bomb aimer, †\nSgt George Hogg, wireless operator and air gunner, \nSgt Roy John Jabour, wireless operator and air gunner, †\nSgt Ernest Geoff Palmer,wireless operator and air gunner, †\nSgt Henry John Tasker, wireless operator and air gunner, †\nSgt George Cyril Phillips, air gunner, †\nSgt John Ivor Williams, flight mechanic, \nSgt William Simpson, flight mechanic, †\nSgt Douglas Howarth, flight engineer. †\nSource & photos:\nhttp://www.peakdistrictaircrashes.co.uk/pages/scotland/scotlanddv979.htm", "probable_cause": null}