{"url": "https://www.baaa-acro.com/crash/crash-douglas-b-26b-invader-near-offutt-afb-3-killed", "date": "Feb 28, 1953 at 1749 LT", "type": "Douglas A-26 Invader", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "Plain, Valley", "schedule": "Peterson - Offutt", "msn": "27462", "yom": 1944, "flight_number": null, "city": "Offutt AFB (Bellevue)", "zone": "Nebraska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3038, "captain_hours_type": 74, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On Saturday, February 28th 1953 at 1749 Hours a Douglas B-26B Invader [44-34183A] aircraft assigned to the 3902 Air Base Wing at Offutt Air Force Base, crashed in a cornfield 2.25 miles southeast of Springfield or 3 miles south of Richfield, Nebraska. The pilot, flight engineer and the sole passenger were fatally injured. The exact cause of the accident was never fully determined and there is no suggestion of pilot error. The B-26B aircraft, piloted by Colonel James R. Luper, was returning to Offutt from Ent AFB (Peterson Field) Colorado after attending a three-day TDY security briefing. Colonel Luper was the Deputy Inspector General of Security assigned to the Strategic Air Command Headquarters at Offutt AFB. Upon arriving over the Weeping Water Homer, the aircraft was cleared to descend from the en-route altitude of 9,000 feet to 3,500 feet. Offutt GCA (Ground Controlled Approach) took over at a range of 8 miles on an inbound heading of 020 from Weeping Water and further descended the aircraft to 3,000 feet. Because the aircraft was too close to the field to attempt a straight-in approach, a short box pattern to the left for a landing on Runway 03 was employed. The aircraft was turned on a cross-wind leg, then to the downwind leg and descended to 2,500 feet. The request for initial cockpit check, runway information, emergency procedures, etc., was transmitted at that time. The aircraft was then given instructions to turn to the base leg and descend to 2,000 feet. All of the radio transmissions were acknowledged by the pilot and no indication of any difficulty was reported. The acknowledgment for the turn to base leg was the last radio contact and up to that point, all procedures were normal. Search Controller, S/Sgt Michael Mullins, 1911 AACS Squadron, Offutt AFB, observed the aircraft complete the turn to base leg on radar and followed the aircraft for approximately 20 seconds when the blip suddenly disappeared from the radar screen. When the pilot did not respond to radio calls, S/Sgt Mullins notified Senior Controller S/Sgt John R. Nelson and Chief Air Traffic Controller Lt. Elman N. Sandell who initiated base emergency procedures. The aircraft wreckage was located in a cornfield owned by Mrs. Annie Bowser, 9 miles southwest of Offutt AFB. Today, the location is approximately one-tenth of a mile east of the intersection of 111th Street and Whitney Road. According to Weather Station Officer, Major David A. Adams, local cloud conditions at the time reported 5/10 fracto cumulus bases 1,800 feet MSL. 10/10 strato cumulus bases at 2,000 feet MSL with tops estimated at 3,000 MSL. The ground temperature was 33°F and the dew point 30 degrees. At 2,000 feet the temperature was 28°F and at 3,000 feet it was 26°F. The wind was from the northeast at 17 knots and barometric setting was 30.01. Visibility was 3 miles restricted by light snow grains and fog. Local farmer, Arthur Carstens, who was located 5 miles south-southwest of Papillion, Nebraska; heard the aircraft pass overhead while it was in the clouds. Shortly thereafter, he saw it emerge from the cloud-deck about 1.5 miles south of his position. Mr. Carstens reported that he saw the aircraft \"going straight down with the engines roaring and suddenly, all was silent.\" He did not see or hear the actual collision with terrain and no smoke or fire was observed. Inspection of the crash scene indicated that the B-26B struck the ground in a flat altitude from a steep trajectory, estimated between 45 to 60 degrees. The impact gouged the frozen earth 35 feet wide and 23 feet long. Although totally destroyed, the aircraft did not catch fire. The majority of the aircraft was piled on top of itself immediately adjacent to the crater. Smaller parts of the aircraft were thrown forward and scattered from the point of impact for a distance of 250 feet. The bodies of the pilot, flight engineer and passenger were located 95 feet in front of the wreckage and all within 19 feet of each other. The cockpit was completely demolished. The aircraft clock displayed a time of 1749 Hours. The altimeter read 1,400 feet and the Kollsman window indicated 30.00 InHg. The main fuel line was on and the two engine magneto switches were set on \"both.\" The fuel selector valves were set for main tanks. Approximately two hours of fuel remained in the tanks. The landing gear was down. Flaps were set at approximately 10 degrees. Trim tabs and control surfaces although badly mangled appeared normal. No prop blades remained on the right engine hub. Investigation of the dome indicated a prop blade angle of 35 degrees. The left prop had one blade remaining on the hub indicating that the engine was feathered. Due to the steep angle of descent, but relative flatness of the angle of attack, there was some reason to believe the aircraft was stalled at the time of impact. Both engines were sent to the Ogden Air Material Area, Hill AFB, Utah for a Disassembly Inspection Report. The subsequent inspection report issued on May 12th 1953 declared that both engines were developing power at the time of impact. No evidence could be found indicating any mechanical failure or malfunction. Neither carburetor nor structural icing were considered to be a contributing cause. Approximately 20 minutes prior to the accident, another B-26B aircraft piloted by Lt. Colonel Wayne J. Seward also arriving from Ent AFB, had landed safely at Offutt AFB with the assistance of GCA. Lt. Colonel Seward testified at the investigation board inquiry that he did not encounter any adverse weather conditions that placed his aircraft in jeopardy. Interestingly, the US Army Air Force accepted delivery of B-26B Invader 44-34183A from the Douglas Aircraft Company on Wednesday, February 28th 1945, exactly eight years in prelude to the date of the crash. \n\r\nColonel James R. Luper, (1448A) joined the US Army in 1933 and graduated in 1938 from the US Military Academy at West Point. He served as the Commanding Officer, 457th Bombardment Group, 8th Air Force, during World War II. He received his initial Pilot rating on August 25th 1939 and Senior Pilot rating on September 10th 1944. Colonel Luper acquired 136 combat hours as a co-pilot and pilot in the Boeing B-17 type aircraft while stationed in the ETO. He was awarded the Silver Star Medal for gallantry in action and the Legion of Merit (posthumously) for meritorious conduct in the performance of outstanding services and achievements. Col. Luper had acquired a total of 3,038 career flight hours with 74.25 hours as a Pilot In Command of the B-26 type aircraft. Colonel Luper had completed his 60-2 Instrument and Proficiency check ten days prior to the fatal accident with an excellent grade. He was considered an above average pilot. On March 6th 1953, Colonel James R. Luper was interred at the US Military Academy Cemetery, West Point, NY. Crew Chief/Engineer on the flight was Technical Sergeant James R. Armstrong, (AF15067847) 3902 Periodic Maintenance Squadron, 3902 Air Base Wing. He was stationed in Europe during WWII and had 11 years of combined service in the US Army Air Force and US Air Force. During his overseas service, he had been awarded a Good Conduct Medal, European Theater of Operations ribbon with four battle stars, the Air Medal with eight Oak leaf clusters and Presidential Unit Citation. Sergeant Armstrong had 907 total flying hours and for the past 30 months had been a Crew Chief on the Douglas B-26 type aircraft. He was considered a well above average Crew Chief and Flight Technician. On March 3rd 1953, Technical Sergeant James R. Armstrong was interred at Hillcrest Cemetery in Omaha, Nebraska. Lieutenant Colonel George R. Groves, (O-357534) was a US Army Infantry Officer assigned to Colonel Luper's office and was the sole passenger aboard the aircraft. Colonel Groves had served in the Texas National Guard (36th Infantry Division) during WWII and was also a Korean War veteran. In March 1953, Lieutenant Colonel George R. Groves was interred at Southland Memorial Park in Grand Prairie, Texas. \n\r\nThe FBI Laboratory toxicology examination report submitted on March 27th 1953, found no signs of alcohol, drugs or poisons present in the autopsy specimens of the three decedents. \n\r\nFrank R. Vondra (source of all text above) would like to recognize and thank his USAF retired friends, Brigadier General Regis \"Reg\" Urschler, former 55th Wing Commander, Offutt AFB; Colonel Roger Craig former Commander of the Kirtland AFB, New Mexico; Master Sergeant Richard Shively, Security Forces, Offutt AFB; Mr. Ben Justman, Executive Director, Sarpy County Museum and Lieutenant Russ Zeeb, Sarpy County Sheriff's Office who provided valuable research assistance in this endeavor.\n\r\nSpecial thanks to Frank R. Vondra for his contribution. \n\n", "probable_cause": null}