{"url": "https://www.baaa-acro.com/crash/crash-yakovlev-yak-40-armavir", "date": "Dec 7, 1976", "type": "Yakovlev Yak-40", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dnipropetrovsk - Mineralnye Vody", "msn": "9 02 01 12", "yom": 1970, "flight_number": "SU929N", "city": "Armavir", "zone": "Krasnodar Krai", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 25, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11272, "captain_hours_type": 2257, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Dnepropetrovsk, the crew started the approach to Mineralnye Vody Airport at dusk. Unable to distinguish the runway, the captain decided to initiate a go-around. He elected to divert to Stavropol Airport but ATC informed him that the visibility was 300 metres only (although it was in fact 700 metres which would have allowed a safe landing). The captain attempted a second approach to Mineralnye Vody but was forced to initiate a second go-around manoeuvre. This time, he decided to divert to Armavir Airport when on final, all three engines failed simultaneously due to fuel exhaustion. The captain completed an emergency landing in an orchard located 1,745 metres short of runway threshold. All 29 occupants escaped unhurt while the aircraft was damaged beyond repair. \n", "probable_cause": "Failure of all three engines on final approach to Armavir Airport due to fuel exhaustion. The following contributing factors were reported:\r\n- Poor flight planning on part of the crew who departed Dnepropetrovsk Airport with an insufficient quantity of fuel (taking into consideration two missed approach and a divert to Armavir),\r\n- Inaccurate information provided by ATC concerning the visibility at Stavropol Airport which was not 300 metres but 700 metres and would allow the crew to land safely. "}