{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b200c-super-king-air-nuevo-saposoa", "date": "Oct 19, 2017 at 1149 LT", "type": "Beechcraft 200 Super King Air", "operator": "Air-Majoro.png", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Contamana – Pucallpa", "msn": "BL-5", "yom": 1980, "flight_number": null, "city": "Nuevo Saposoa", "zone": "Ucayali", "country": "Peru", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 11, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 17659, "captain_hours_type": null, "copilot_hours": 334, "copilot_hours_type": 131, "aircraft_hours": 12334, "circumstances": "The twin engine aircraft departed Contamana Airport at 1128LT on a charter flight to Pucallpa, carrying 11 passengers and two pilots. Few minutes after takeoff, while climbing to an altitude of 4,500 feet, the right engine lost power and failed. The crerw decided to return to Contamana but was able to transfer fuel from the left tank to the right tank to restart the right engine. Decision was taken to continue to Pucallpa at an altitude of 13,500 feet. At a distance of 42 km from Pucallpa, the crew started the descent when the right engine failed again, followed shortly later by the left engine. The captain declared an emergency and attempted an emergency landing when the aircraft crashed in a wooded area. All 13 occupants were injured and the aircraft was destroyed. ", "probable_cause": "Double engine failure in flight due to fuel starvation, forcing the crew to attempt an emergency landing in trees.\r\nThe following contributing factors were identified:\r\n- Recurrent failures on the ground and in flight of the aircraft fuel quantity indicators, a situation that was maintained because the Maintenance Programme did not include an inspection and calibration of the fuel quantity gauges.\r\n- Initiating the flight with a fuel indication system inoperative.\r\n- Complacency on part of the crew who decided to continue the flight by having an aerodrome nearby after the first engine failure. "}