{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690b-el-yunque-national-forest-3-killed", "date": "Dec 3, 2008 at 1205 LT", "type": "Rockwell Grand Commander 690", "operator": "Webstas%20Aviation%20Services", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Tortola – San Juan", "msn": "690-11444", "yom": 1978, "flight_number": null, "city": "El Yunque National Forest", "zone": "All Puerto Rico", "country": "Puerto Rico", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 9600, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5286, "circumstances": "The charter flight departed for the destination, where the passengers would connect with another airline flight. The instrument-rated pilot may have felt pressured as the flight departed late. The accident airplane approached the destination airport from the east, descending at 250 knots ground speed from 8,800 feet above mean sea level (msl), on a 270 degree assigned heading, and was instructed to enter the right downwind for runway 10. The airplane's altitude readout was then observed by the approach controller to change to \"XXX.\" The pilot was queried regarding his altitude and he advised that he was descending to 3,200 feet msl. The pilot was asked to confirm that he was in visual flight rules (VFR) conditions and was advised that the minimum vectoring altitude (MVA) for the area was 5,500 feet msl. The pilot responded that “We just ahh,” at which time the controller advised that she missed his transmission and asked him to repeat it. The pilot stated “Ahh roger, could we stay right just a little, we are in and out of some clouds right now.” The controller advised the pilot to “Maintain VFR” and again of the MVA. The controller then made multiple attempts to contact the pilot without result. The wreckage was discovered on the side of a mountain, where the airplane impacted after entering instrument meteorological conditions. Because aircraft operating in VFR flight are not required to comply with minimum instrument altitudes, aircraft receiving VFR radar services are not automatically afforded Minimum Safe Altitude Warning services except by pilot request. The controller's query to the pilot about his altitude and flight conditions was based on her observation of the loss of altitude reporting information. The pilot had not indicated any difficulty in maintaining VFR flight or terrain clearance up to that point. His comment that the aircraft was \"in and out of some clouds\" was her first indication that the pilot was not operating in visual conditions, and came within seconds of impact with the terrain. The controller was engaged in trying to correct the situation, and despite having been advised of the minimum vectoring altitude, the pilot continued to descend. The airplane was equipped with a terrain avoidance warning system but it could not be determined if it was functional. The pilot owned the charter operation. Documents discovered in the wreckage identified the pilot and airplane as operating for a different company since the pilot did not have the permissions necessary to operate in the United Kingdom Overseas Territories.", "probable_cause": "The pilot's continued visual flight into instrument meteorological conditions, which resulted in an in-flight collision with terrain."}