{"url": "https://www.baaa-acro.com/crash/crash-yakovlev-yak-40-near-stepanakert-47-killed", "date": "Aug 1, 1990 at 1009 LT", "type": "Yakovlev Yak-40", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Yerevan - Stepanakert", "msn": "9 43 10 36", "yom": 1974, "flight_number": "SU35D", "city": "Stepanakert", "zone": "Yukhari Garabakh", "country": "Azerbaijan", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 43, "pax_fatalities": 43, "other_fatalities": 0, "total_fatalities": 47, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft operated on a passenger service from Yerevan-Erebuni Airport to Stepanakert Airport. In addition to 30 passengers with tickets, the crew took on board 13 unregistered passengers. With this heavy load, the captain requested a lower altitude, 4,500 meters, for the flight. This was granted by ATC, while the regular altitude on the route was 5,100-6,600 meters with a minimum safe height of 4,516 meters. At 09:59, at a distance of 21 km after passing the Azizbekov NDB, the crew was taken over by a controller of Kafan Airport. The controller instructed to keep the height of 4,500 meters to the point of descent. The flight was the cleared down to 3,900 meters and the aircraft descended over mountains covered by a cloud deck with an upper boundary of 3,000-3,300 meters. However, the flight crew never reported their exact position and the controller did not check it on radar. The flight reached the altitude of 3,900 meters at 10:07, and continued descending without informing the controller. At 10:08, the captain requested to contact Stepanakert, while giving a false report that the flight altitude was 3,900 meters. Not observing the aircraft, not knowing its actual flight altitude and not having direct communication with the controller at Stepanakert, the Kafan ATC controller allowed the crew to switch to the Stepanakert frequency. The captain reported to the controller that they were at an altitude of 3,900 meters and requested permission to descend to 2,400 meters. The controller at Stepanakert, having no radar facilities to monitor the aircraft, permitted a descent to 3,000 meters the NDB. At 10:09:57, the aircraft collided with a rocky mountain slope at an altitude of 2,520 meters while descending in clouds. All 47 occupants were killed. ", "probable_cause": "The accident was caused by a combination of the following factors:\r\n- The captain's violations of the flight rules set forth in the policy documents manifested in unsatisfactory navigation, straightening the route and premature unauthorized descent to a height below the minimum safety altitude, which resulted in a collision with a mountain.\r\n- Violations of ATC rules in their zones by ATC dispatchers of Erebuni, Kafan and Stepanakert airports, expressed in failure to comply with the rules of air traffic control and non-interference in the actions of the crew who violated the rules of navigation and flight regime, which did not allow timely prevention of the aircraft collision with an obstacle. The dispatchers at Yerevan-Stepanakert have a stereotype of work: to allow those conditions of approach, which the crews requested. These violations became possible due to shortcomings in the organization of flight work, flights and air traffic control at the Yerevan-Stepanakert MVL of the Armenian and Azerbaijani State Administration."}