{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46f-1-cu-commando-denver", "date": "Jul 30, 1950 at 0330 LT", "type": "Curtiss C-46 Commando", "operator": "Flying%20Tiger%20Line", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Newark – Cleveland – Detroit – Chicago – Des Moines – Denver – Los Angeles", "msn": "22511", "yom": 1945, "flight_number": null, "city": "Denver-Stapleton", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 8479, "captain_hours_type": 479, "copilot_hours": 6479, "copilot_hours_type": 74, "aircraft_hours": 2180, "circumstances": "The crew performed their “before takeoff check\", found all components of the aircraft to operate normally, and then, at 0329, rolled onto the runway for takeoff. From the tower, the aircraft appeared to accelerate slowly and to take an excessively long period of time to become airborne. The pilots stated that the engines operated normally, developing 45-inch hg. of manifold pressure and 2700 RPH (revolutions per minute), but air speed increased slowly. Between 90 and 100 miles per hour, and just before the end of the runway was reached, the aircraft was pulled off the runway by Captain Robins as he applied back pressure on the control column. After take-off, the highest air speed attained was between 100 and 105 miles per hour. The landing gear, control was placed in the “up” position,when the flight became airborne, and a climb was made to about 100 feet. During the climb, the aircraft shuddered severely. Altitude was lost, and the aircraft struck an obstruction light on the top of a 40-foot electric light pole which was 1,910 feet south of the end of the runway. The aircraft struck three more pole, then touched ground and skidded for 350 feet. It came to a full stop 2,791 feet from the south end, and in line Runway 17. The crash landing was made in an alley way of a residential district located between Stapleton Air Field and the Lowry Air Force Base, which is located 1-1/4 miles south of Stapleton. In addition to striking the electric light poles, the aircraft knocked down several fences, a small tool shed, and collided into two parked automobiles. Crash and fire equipment which was dispatched from both the Stapleton and Lowry Airports and the city of Denver arrived promptly. Partly as a result of their precautionary action, no fire occurred.", "probable_cause": "The Board determines that the probable cause of this accident was the sub-normal take-off performance of the aircraft, the reason for which cannot be determined.\r\nThe following factors were identified:\r\n- The aircraft was overloaded 172 pounds, but this amount did not appreciably affect the aircraft's take-off performance,\r\n- Under conditions of aircraft weight and density altitude that existed at the time of the accident, the flight should have obtained an altitude of 50 feet and an air speed of 123-1/2 miles per hour after traversing a distance of 5,850 feet from the start of the take-off roll according to data contained in the CAA approved flight manual,\r\n- The aircraft. N-67960, was reported to be consistently slower in accelerating and taking off than other aircraft of the same type,\r\n- A runway 6,980 feet long was selected for take-off although the practically calm wind condition permitted the use of another runway which is 8,500 feet long,\r\n- The take-off run was made with the aircraft in an unusually tail low attitude and nearly the entire runway length, 6,980 feet, was used before the aircraft was pulled off the ground,\r\n- In a climb to 100 feet altitude after take-off a partial stall developed,\r\n- The aircraft settled, collided with obstructions and crashed,\r\n- No defects were found in the aircraft, the engines, or the propellers."}