{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-31-near-duarte-49-killed", "date": "Jun 6, 1971 at 1711 LT", "type": "Douglas DC-9", "operator": "Hughes%20Air%20West", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Los Angeles – Salt Lake City – Boise – Lewiston – Pasco – Yakima – Seattle", "msn": "47441/503", "yom": 1969, "flight_number": "RW706", "city": "Duarte", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 44, "pax_fatalities": 44, "other_fatalities": 0, "total_fatalities": 49, "captain_hours": 15490, "captain_hours_type": 2562, "copilot_hours": 17128, "copilot_hours_type": 272, "aircraft_hours": 5542, "circumstances": "Airwest flight 706, a DC-9, was to fly from Los Angeles, CA (LAX) to Seattle, WA (SEA) with intermediate stops at Salt Lake City (SLC), Boise (BOI), Lewiston (LWS), Pasco (PSC) and Yakima (YKM). The aircraft departed Los Angeles at 18:02. At 18:09 the crew reported leaving FL120 and Los Angeles ARTCC cleared them direct to Daggett. At 17:16 h a US Marine Corps McDonnell F-4B Phantom 151458 departed Naval Auxiliary Air Station (NAAS) Fallon for a flight to MCAS El Toro at low altitude. The aircraft had several technical difficulties, including an inoperative transponder and a leak in the oxygen system. Due to deteriorating visibility northwest of Palmdale, the crew climbed to 15,500 feet . Shortly after level-off, aircraft was 50 miles from MCAS El Toro. The pilot executed a 360° aileron roll at this time, which took approximately 3 seconds to complete. The Radar Intercept Officer (RIO) estimated that the true airspeed in the climb and after level-off was 420 knots. The F-4B collided with the Airwest DC-9 about 1 minute and 20 sec after the roll, at 15150 feet. After the collision, the F-4 began to tumble violently about the lateral axis. The RIO waited about 5 seconds, and, after seeing numerous warning lights in the cockpit, he ejected from the aircraft . The ejection was successful, and he parachuted to the ground without injury. The other F-4 crewmember did not survive the accident.", "probable_cause": "The failure of both crews to see and avoid each other but it is recognized that they had only marginal capability to detect, assess, and avoid the collision. Other causal factors include a very high closure rate, comingling of IFR and VFR traffic in an area where the limitation of the ATC system precludes effective separation of such traffic, and failure of the crew of 151458 to request radar advisory service, particularly considering the fact that they had an inoperable transponder."}