{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-f90-king-air-lynchburg", "date": "Nov 24, 2000 at 1151 LT", "type": "Beechcraft 90 King Air", "operator": "Jim Mitchell Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lynchburg - Lynchburg", "msn": "LA-124", "yom": 1981, "flight_number": null, "city": "Lynchburg", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 12000, "captain_hours_type": 250, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6788, "circumstances": "The pilot was conducting a post-maintenance test flight. An overhauled engine had been installed on the right side of the airplane, and both propeller assemblies had been subsequently re-rigged. Ground checks were satisfactory, although the right engine propeller idled 90-100 rpm higher than the left engine propeller. Test flight engine start and run-up were conducted per the checklist, with no anomalies noted. Takeoff ground roll and initial climb were normal; however, when the airplane reached about 100 feet, it stopped climbing and lost airspeed. The pilot could not identify the malfunction, and performed a forced landing to rough, hilly terrain. Upon landing, the landing gear collapsed and the engine nacelles were compromised. The airplane subsequently burned. Post-accident examination of the airplane revealed that the propeller beta valves of both engines were improperly rigged, and that activation of the landing gear squat switch at takeoff resulted in both propellers going into feather. The maintenance personnel did not have rigging experience in airplane make and model. As a result of the investigation, the manufacturer clarified maintenance manual and pilot handbook procedures.", "probable_cause": "Improper rigging of both propeller assemblies by maintenance personnel, which resulted in the inadvertent feathering of both propellers after takeoff. Factors included a lack of rigging experience in airplane make and model by maintenance personnel, unclear maintenance manual information, and unsuitable terrain for the forced landing."}