{"url": "https://www.baaa-acro.com/crash/crash-martin-404-louisville", "date": "Mar 10, 1957 at 1138 LT", "type": "Martin 404", "operator": "Eastern-Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago – Indianapolis – Louisville – Miami", "msn": "14144", "yom": 1952, "flight_number": "EA181", "city": "Louisville", "zone": "Kentucky", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 31, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7795, "captain_hours_type": 2151, "copilot_hours": 1201, "copilot_hours_type": 652, "aircraft_hours": 15365, "circumstances": "Flight 181 originated at Midway Airport, Chicago, Illinois, for Miami, Florida. Several stops were scheduled including Indianapolis, Indiana, and Louisville, Kentucky, the latter a point of crew change. Departure, scheduled for 0955, was at 1001, with a crew of Captain Clarence G. Chambers, Pilot Harold D. Bingham, and Stewardess Shirley Michael. To Indianapolis the flight was routine, with Captain Chambers flying, and arrival was on schedule. Departure from Indianapolis was on schedule, at 1105, with 31 passengers and 450 gallons of fuel. The aircraft’s gross weight was 41,126 pounds, 3,774 less than the maximum takeoff allowable of 44,900, and its center of gravity was located within prescribed limits. Captain Chambers instructed Pilot Bingham to do the flying and, accordingly, Bingham, seated on the right, made the takeoff and flew this segment of the flight. The aircraft proceeded along V-53 airway at 5,000 feet altitude on a VFR flight plan in clear weather. At 1133 the flight advised Standiford (Louisville) tower that it was over New Albany, Indiana, eight miles to the north-northwest, and requested clearance to the airport. At 1134 the flight asked landing information of its company radio station and was given the Louisville pressure altitude as 340 feet and the Louisville altimeter setting as 30.10 inches. A minute later the flight advised the tower that it was over the city and received clearance to land on runway 11. Wind conditions were given as southeast five to eight knots, variable both sides. Ceiling and visibility were unlimited. The “Fasten Seat Belt” sign had been put on. Pilot Bingham descended from 5,000 feet to 2,000 feet and then reduced both rate of descent and power. An airspeed of 165 knots was established, the landing gear was lowered, and the flaps were placed in takeoff position. Bingham then started a turn for final approach, and the flaps were placed in approach position. Captain Chambers saw that the aircraft was too high and reduced power still further; Bingham lowered the flaps to full down. The pre-landing checklist had been accomplished. At this point (the altitude was then 1,000 to 1,500 feet higher than the runway) the captain took over control. He nosed down sharply, holding as closely as possible to an airspeed of 100 knots. The landing gear remained down, flaps remained fully down, and throttles were pulled fully back. Neither pilot read the rate-of-climb (descent) indicator during the approach. When approximately over the threshold of the runway and while about 100 feet above it, the captain pulled back on the yoke to flare out. No power was used. The aircraft’s attitude was observed to change from nose-down to nose-up but its rate of descent did not seem to lessen markedly. The aircraft struck the runway on its main landing gear, the left wing separated inboard of the left engine nacelle, and the remainder of the aircraft half rolled to an inverted position. It slid along in that attitude, turning and coming to rest headed nearly opposite its direction at touchdown. Two minutes later, by estimate, all occupants were out of their inverted seats, in which they were belted, and away from the wreckage which had developed a small fire. This was confined by a passenger using a hand extinguisher until emergency apparatus, which had been alerted by the tower, arrived quickly and took the necessary steps to prevent further fire.", "probable_cause": "The Board determines that the probable cause of this accident was the captain’s faulty landing approach technique, resulting in an excessively high rate of sink at the instant of touchdown imposing load beyond the design strength of the wing stricture. The following findings were reported:\r\n- An approach was started from a paint too close and too high in relation to the approach end of the runway, \r\n- The speed and configuration of the aircraft in conjunction with the retarded throttle during this approach resulted in an inordinately high rate of descent,\r\n- This high descent rate was not sufficiently checked during the attempted flareout,\r\n- Touchdown imposed loads beyond the design strength of the wing structure, which failed."}