{"url": "https://www.baaa-acro.com/crash/crash-boeing-rc-135e-bering-sea-19-killed", "date": "Jun 5, 1969 at 1022 LT", "type": "Boeing KC-135 Stratotanker", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Military", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Shemya - Eielson", "msn": "18477/C43", "yom": 1962, "flight_number": "Irene92", "city": "Bering Sea", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 14, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 19, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3350, "circumstances": "The crew departed Shemya Airport, in the Aleutians Islands, bound for Eielson AFB, under call sign Irene 92. At 0936LT, while cruising between the Rats and Andreanof Islands, the copilot informed ATC about vibrations but elected to continue the flight. Few minutes later, the radio contact was lost due to technical problems but ATC was able to follow the plane on screens till 1022LT when it disappeared in the Amchitka passage. SAR operations were conducted for nine days but no trace of the airplane nor the 19 occupants was found. More details on http://www.spyflight.co.uk/Rivet%20Amber.htm", "probable_cause": "Due to the lack of evidences, it was not possible to determine the exact cause of the accident. Nevertheless, it was reported that the airplane experienced severe turbulences while completing an observation mission off the east coast of the Kamchatka Peninsula. After landing at Shemya AFB, the airplane was inspected for damage. Extensive skin damage to the tail section to include the vertical stabilizer, and areas close to the long wire High Frequency (HF) antenna tail mounts was found. No other external or internal damage that could be visually inspected was discovered, and no damage to the modified sections of the aircraft’s S-Band radome was noted. Over the objection of the maintenance crew, the aircrew was directed to fly the aircraft to Eielson Air Force Base, Alaska for additional inspection and repairs as necessary."}