{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6-mt-costone-dellacquasanta-29-killed", "date": "Feb 13, 1955 at 1953 LT", "type": "Douglas DC-6", "operator": "Sabena.gif", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Brussels – Rome – Athens – Cairo – Elisabethville", "msn": "43063", "yom": 1947, "flight_number": "SN503", "city": "Mt Costone dell'Acquasanta", "zone": "Lazio", "country": "Italy", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 21, "pax_fatalities": 21, "other_fatalities": 0, "total_fatalities": 29, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed the Brussels-Haren Airport for Rome at 1717LT on an IFR flight plan. According to radio communications between the aircraft and the area controls at Zurich, Milan and Rome the flight appears to have been normal. The aircraft was in touch with Rome area control at 1929LT and the last message from it was received at 1953LT. At about 1950LT the aircraft after overflying the village of Leonessa and continued on a heading of 163° until it hit the slope of the Mt Costone dell'Acquasanta at an altitude of 1,700 meters after breaking off the tops of trees in a wood in line with the point of impact, near the end of its course. The wreckage was found one week later only and all 29 occupants have been killed, among them the Italian actress Marcella Mariani. ", "probable_cause": "The probable cause of the accident was that the navigation was conducted without making use of all such radio aids as would have permitted checking, and consequently correcting the drift of the aircraft, whereas the crew actually remained unaware of the drift. In fact, instead of making sure they were over the Viterbo beacon, they merely held that conviction, and therefore the approach procedure to the Rome terminal area (which prescribes overflight of the Viterbo beacon) was erroneously applied. The following contributing causes may be taken into consideration: \r\n- crosswind to the route stronger than forecast,\r\n- weather conditions particularly unfavorable to radio reception in MF,\r\n- None of the messages from the aircraft gave the impression that the crew were in any doubt as to their position,\r\n- The gradual uncontrolled eastward drift may be assumed to have started along the Alpine route, in view of the atmospheric conditions then prevailing, and particularly because of the jet stream previously mentioned,\r\n- The message \"passed Viterbo beacon one minute ago\" sent by the aircraft at 1951LT was certainly an error, actually, the aircraft struck the surface at 1853 at a point more than 60 km east of Viterbo on a heading of 163°."}