{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-200-washington-dulles-1-killed", "date": "Jul 20, 1988 at 1608 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Fairways Corporation", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Washington - Washington", "msn": "195", "yom": 1969, "flight_number": null, "city": "Washington-Dulles", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 12400, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10513, "circumstances": "This was the first flight after a maintenance inspection. The flaps were left full down after a post-inspection by company mechanics, before the flight. Witnesses stated the flaps were down when the aircraft taxied to takeoff on runway 19L. Witnesses stated the aircraft climbed steeply after it lifted off with a pitch attitude up to 60°. According to witnesses, the aircraft climbed to 200 to 500 feet agl, before it stalled and descended nose down in a left turn. The aircraft crashed about 300 ft left of and 2000 ft down the rwy. Examination of the aircraft revealed the flaps were full down. The scroll type checklist was positioned at the beginning of the takeoff check. The flight manual recommends a 10 degree flap setting for takeoff and prohibits flap full down takeoff. Review of previous DHC-6 accidents involving flap full down resulted in a steep takeoff climb and excessive pitch attitude followed by a stall. The position of the control lock suggests it may have been in the locked position during the takeoff. The pilot, sole on board, was killed. ", "probable_cause": "The pilot inadvertently misused the flaps, by failing to set the flaps to the proper setting. The flaps were set full down. This caused the aircraft to pitch up steeply after liftoff. Additionally, the flight control lock was probably installed during some portion, if not the entire flight, which prevented flight control operation. The pilot subsequently failed to maintain adequate flying speed and the aircraft stalled. Contributing factors are the pilot's inattention and his failure to adequately use the checklist.\r\nFindings: \r\nOccurrence #1: loss of control - in flight\r\nPhase of operation: takeoff - initial climb\r\nFindings\r\n1. (c) raising of flaps - not performed - pilot in command\r\n2. (f) inattentive - pilot in command\r\n3. (f) checklist - not used - pilot in command\r\n4. (f) procedures/directives - not followed - pilot in command\r\n5. (f) removal of control/gust lock(s) - inadvertent use - pilot in command\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled"}