{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-kamsack-2-killed", "date": "Jul 19, 2009 at 2124 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Underhill Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kamsack – Saskatoon", "msn": "46-8508108", "yom": 1985, "flight_number": null, "city": "Kamsack", "zone": "Saskatchewan", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1000, "captain_hours_type": 300, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Kamsack, on an instrument flight rules flight to Saskatoon, Saskatchewan. The pilot and three passengers were on board. At takeoff from runway 34, the aircraft began rolling to the left. The aircraft initially climbed, then descended in a steep left bank and collided with terrain 200 feet to the left of the runway. A post-impact fire ignited immediately. Two passengers survived the impact with serious injuries and evacuated from the burning wreckage. The pilot and third passenger were fatally injured. The aircraft was destroyed by impact forces and the post-impact fire. The accident occurred during evening civil twilight at 2124 Central Standard Time.", "probable_cause": "Finding as to Causes and Contributing Factors:\r\n1. The pilot was unable to maintain aircraft control after takeoff for undetermined reasons and the aircraft rolled to the left and collided with terrain.\r\nFinding as to Risk:\r\n1. The manufacturer issued a service bulletin to regularly inspect and lubricate the stainless steel cables. Due to the fact that the bulletin was not part of an airworthiness directive and was not considered mandatory, it was not carried out on an ongoing basis. It is likely that the recommended maintenance action has not been carried out on other affected aircraft at the 100-hour or annual frequency recommended in FAA SAIB CE-01-30.\r\nOther Findings:\r\n1. Due to the complete destruction of the surrounding structure, restriction to aileron cable movement prior to impact could not be determined.\r\n2. The use of the available three-point restraint systems likely prevented the two survivors from being incapacitated, enabling them to evacuate from the burning wreckage. "}