{"url": "https://www.baaa-acro.com/crash/crash-airbus-a330-321-toulouse-7-killed", "date": "Jun 30, 1994 at 1741 LT", "type": "Airbus A330", "operator": "Airbus%20Industries", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Toulouse - Toulouse", "msn": "42", "yom": 1993, "flight_number": "BGA129", "city": "Toulouse-Blagnac", "zone": "Haute-Garonne", "country": "France", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 7713, "captain_hours_type": 345, "copilot_hours": 9558, "copilot_hours_type": 137, "aircraft_hours": 360, "circumstances": "An Airbus A330-300 aircraft crashed during a test flight at the Toulouse-Blagnac Airport in France, killing all seven on board. The test flight was part of the preparation required to certify the autopilot, on this Airbus A330 equipped with Pratt and Whitney engines, to category III standards. The first part of the test flight was completed successfully when the aircraft landed on runway 15L. A 180 degree turn was made for takeoff from runway 33R. The second takeoff was to be performed under conditions similar to those of the first takeoff. For this test however, the autopilot would incorporate the modification under study. The takeoff was performed by the co-pilot with TOGA (Takeoff Go Around) power instead of Flex 49, a lower power setting which was specified in the test procedure. Rotation was positive and pitch input was stopped when the attitude changed from 12 to 18 degrees nose-up. Within 5 seconds after takeoff several attempts to engage the autopilot were unsuccessful. After it was engaged, activation was delayed by two seconds because the first officer was exerting a slight nose down input on the side stick. The aircraft, still trimmed at 2.2 degrees nose-up, pitched up to reach 29 degrees and the speed had decreased to 145 knots. The captain meanwhile reduced thrust on the no. 1 engine to idle and cut off the hydraulic system in accordance with the flight test order. Immediately after it activated, the autopilot switched to altitude acquisition mode. The altitude had been set at 2000 feet on the previous flight phase. This caused the pitch attitude to increase to 32 degrees in an attempt to reach 2000 feet. The speed decreased further to 100 knots, whereas the minimum control speed is 118 kts. Roll control was lost and the captain reduced no. 2 engine thrust to idle to recover symmetry on the roll axis. Bank and pitch attitudes had reached 112 degrees left and -43 degrees resp. before the pilot managed to regain control. It was however too late to avoid ground impact at a pitch attitude of around -15 degrees.", "probable_cause": "At the present stage of its work, the commission estimates that the accident can be explained by a combination of several factors none of which, taken separately, would have led to an accident.\r\nThe initial causes are primarily related to the type of the test and its execution by the crew during the last takeoff:\r\n1) choice of maximum power (TOGA) instead of Flex 49;\r\n2) very aft CG for the last takeoff;\r\n3) trim set in the takeoff range, but in too high a nose-up position;\r\n4) selected altitude of 2000 feet;\r\n5) imprecise and late definition of the test to be conducted and the tasks to be performed by the captain and first officer, respectively;\r\n6) positive and very rapid rotation executed by the first officer;\r\n7) the captain was busy with the test operations to be performed immediately after take off (engagement of the autopilot, reduce thrust on the engine and cut off the blue hydraulic system) which temporarily placed him outside the control loop;\r\n8) in addition the absence of pitch attitude protection in the autopilot altitude acquisition mode played a significant role.\r\nThe following factors also contributed to the accident:\r\n1) The inability of the crew to identify the mode in which the autopilot was placed;\r\n2) the confidence of the crew in the expected reactions of the aircraft;\r\n3) the late reaction from the flight test engineer when faced with a potentially hazardous change in parameters (speed in particular);\r\n4) the time taken by the captain to react to an abnormal situation."}