{"url": "https://www.baaa-acro.com/crash/crash-cessna-340-rock-springs-3-killed", "date": "Apr 26, 1983 at 1103 LT", "type": "Cessna 340", "operator": "Flight Brothers", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Rock Springs - Rock Springs", "msn": "340-0028", "yom": 1972, "flight_number": null, "city": "Rock Springs", "zone": "Wyoming", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 4281, "captain_hours_type": 31, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2022, "circumstances": "The aircrew of a Cessna 340, N5415M, were scheduled for an air taxi check ride with an inspector at Jackson, WY, later in the afternoon. They had planned to takeoff from Rock Springs, WY, practice at few instrument approaches at Rock Springs, then proceed to Jackson. After taking off, they made an NDB approach, made a missed approach, then began an ILS approach. A Beech Bonanza, N1825F, was on a flight from Scottsbluff, NE to Rock Springs. During arrival to Rock Springs, the Bonanza pilot was monitoring the position of a King Air that was ahead of him and also on an approach to the same airport. All three aircraft were using the same frequency and all three were providing reports of their respective positions. At approximately 1103 mdt, witnesses heard N5415M and N1825F collide, then saw the aircraft and pieces of wreckage falling. An investigation revealed the Cessna was inbound toward the outermarker (270° course) and the Bonanza was in level flight, heading approximately 219°. Both aircraft were operating VFR. All six occupants in both aircraft were killed. ", "probable_cause": "Occurrence #1: midair collision\r\nPhase of operation: approach - iaf to faf/outer marker (IFR)\r\nFindings\r\n1. Radar traffic information service - not used - pilot in command\r\n2. (c) visual lookout - inadequate - copilot/second pilot\r\n3. (c) visual lookout - inadequate - pilot of other aircraft\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled"}