{"url": "https://www.baaa-acro.com/crash/crash-cessna-f406-caravan-ii-barrow-2-killed", "date": "Aug 17, 2003 at 1256 LT", "type": "Cessna 406 Caravan", "operator": "Hageland-Aviation-Services-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Barrow - Wainwright", "msn": "406-0053", "yom": 1990, "flight_number": null, "city": "Barrow", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 7000, "captain_hours_type": 1000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7675, "circumstances": "The certificated airline transport pilot, with one non-revenue passenger, departed in the twin engine turboprop airplane from a rural airport on a CFR Part 135, VFR cargo flight over ocean waters. The flight did not reach its destination, and was reported overdue. Search personnel searched along the airplane's anticipated route of flight, over ocean waters. Shortly after initiation of the search, airborne search personnel reported sighting floating debris, consisting of what appeared to be aircraft seats, cardboard boxes, and small portions of aircraft wreckage, about 30.5 miles southwest of the flight's departure airport, and about 10 miles from shore. The airplane is presumed to have sunk in ocean waters estimated to be between 50 and 70 feet deep. Underwater search and recovery efforts were unsuccessful, and the airplane, pilot, and passenger remain missing. A review of archived radar data disclosed that as the accident airplane approached an area about 30.5 miles southwest of the departure airport, it descended to 500 feet msl, and then entered a right turn. As the turn progressed, the airplane continued to descend to 400 feet msl, with a radar-derived ground speed of 180 knots. The last radar return was recorded with the same radar-derived groundspeed, on an approximate heading of 200 degrees. A pilot who is familiar with geographical locations in the area reported that migrating whales are commonly sighted in the area where the radar depicted a descending right turn. ", "probable_cause": "An in-flight collision with ocean waters while maneuvering for an undetermined reason."}