{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-3y0-osh", "date": "Nov 22, 2015 at 0800 LT", "type": "Boeing 737-300", "operator": "Avia-Traffic", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Krasnoyarsk – Osh", "msn": "24681/1929", "yom": 1990, "flight_number": "AVJ768", "city": "Osh", "zone": "Osh City", "country": "Kyrgyzstan", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 148, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10600, "captain_hours_type": 6362, "copilot_hours": 16400, "copilot_hours_type": 3731, "aircraft_hours": 50668, "circumstances": "The crew departed Krasnoyarsk-Yemilianovo Airport on a night flight to Osh, Kyrgyzstan. En route, he was informed that a landing in Osh was impossible to due low visibility caused by foggy conditions. The captain decided to divert to Bishkek-Manas Airport where the aircraft landed safely at 0520LT. As weather conditions seems to improve at destination, the crew left Bishkek bound for Osh some ninety minutes later. On approach to Osh, the vertical visibility was reduced to 130 feet when the aircraft hit violently the runway 12 surface. Upon impact, the left main gear was sheared off, the aircraft slid for several yards, overran, hit obstacles and came to rest in a field located 529 meters past the runway end with its left engine detached and its right engine destroyed. All 154 occupants were evacuated, ten passengers were injured, six of them seriously. The aircraft was damaged beyond repair. ", "probable_cause": "It was determined that the accident occurred in poor weather conditions with an horizontal visibility reduced to 50 meters and a vertical visibility limited to 130 feet. It was reported that the accident was caused by the combination of the following factors:\r\n- the crew decided to leave Bishkek Airport for Osh without taking into consideration the weather forecast and the possibility of deteriorating weather, \r\n- the competences of the captain for a missed approach procedure in poor weather conditions were limited to a simulator training despite the fact that he was certified for Cat IIIa approaches, \r\n- failure of the crew to comply with the standard operating procedures for a missed approach,\r\n- wrong actions on part of the pilot in command while crossing the runway threshold at a height of 125 feet and about five seconds after the initiation of the TOGA procedure, disrupting the go around trajectory and causing the aircraft to continue the descent, \r\n- lack of reaction of the copilot who did not try to correct the wrong actions of the pilot in command, \r\n- lack of concentration on part of the crew who failed to control the approach speed and failed to recognize the pitch angle that was increasing, \r\n- it is possible that the crew suffered somatogravic illusions caused by fatigue due to a duty time period above 13 hours,\r\n- a non proactive reaction of the crew when the GPWS alarm sounded."}