{"url": "https://www.baaa-acro.com/crash/crash-cessna-t303-crusader-prescott-5-killed", "date": "Jul 4, 1993 at 0320 LT", "type": "Cessna 303 Crusader", "operator": "Sawyer%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Prescott - Prescott", "msn": "303-00200", "yom": 1982, "flight_number": null, "city": "Prescott-Ernest A. Love", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 550, "captain_hours_type": 40, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3123, "circumstances": "On July 4, 1993, about 0320 hours mountain standard time, a Cessna T303, N9667C, collided with terrain about 2,000 feet short of the approach end of runway 21 at Ernest A. Love Field in\r\nPrescott, Arizona. The airplane was destroyed. The commercial pilot and four passengers were fatally injured. The airplane was being operated as a personal flight. The local flight departed Love Field about two minutes before the accident. Night visual meteorological conditions prevailed at the time. The accident airplane arrived at Love Field about 2300 hours on July 3, 1994. An airport operations specialist employed by the City of Prescott greeted the airplane to see if the pilot needed fuel. Three males got out of the airplane, one of which was carrying a can of beer. One occupant of the airplane replied to the operations specialist fuel inquiry and stated, \"Not right now, maybe later or in the morning.\" The operations specialist asked the three men if they had a place to stay and they indicated they were meeting friends. The night manager of the Airport Centre Motel, located off the west boundary of Love Field, noticed the three men walking from the airport 2330 hours on July 3, 1994. The motel manager stated all three men were drinking beverages from cans. The manager was unable to state the type of beverages they were drinking. At 2300 hours, July 3, 1994, the girl friend of one of the airplane's passengers received a call from her boy friend requesting a ride from Love Field to \"downtown\" Prescott. The girlfriend met her boy friend with two other friends. According to the girl friend, all three men were holding beer cans. The girl friend dropped the men off in the downtown area with plans to meet later. Approximately 0100 hours July 4, 1993, three females were leaving the Palace Saloon in downtown Prescott. The women were approached by three men on the sidewalk. One of the men  identified himself as a pilot to the women. One of the women did not believe him and being associated with pilots in the past she asked him, \"How many hours do you need [from] bottle to throttle?\" The pilot responded, \"Eight, but I guess I will have to break that rule tonight.\" The six walked on the sidewalk continuing the conversations. The woman who previously challenged the pilot walked along side him. She described him as quiet, friendly, not intoxicated, and at one point apologetic for being quiet. The pilot expounded on his quietness by stating he was very tired, and that he had been in Laughlin, Nevada, the night before, worked all day, rented the airplane, and then flew to Prescott. As the evening progressed, the group went to a restaurant, ate, and walked to the women's hotel. The men solicited a ride to the airport and the women agreed. During the ride to the airport, two of the men were talkative but the pilot remained quiet. The pilot was observed closing his eyes with his head back. The group arrived at the airport about 0245 hours. The men offered to show the women the airplane. The pilot opened the airplane and moved into the cockpit. The woman, who earlier challenged the pilot, asked one of the other men, \"Why is the pilot so quiet, is he drunk?\" The other man said, \"No, he only had a few drinks.\" The woman then heard the pilot and the other man talking in the cockpit. The pilot was trying to turn on the pilot-controlled airport lighting. The woman heard the other man tell the pilot to \"stop clicking the button so many times, and that it was supposed to be three clicks and then stop.\" The men then offered the women a 10-minute ride in the airplane. The woman who earlier challenged the pilot refused. Her two friends accepted and got into the airplane and she went back to their vehicle and waited. At 0254 hours, the pilot contacted the Prescott Flight Service Station (FSS) on frequency 122.4 Mhz and asked about the pilot- controlled lighting system. The pilot indicated that he tried to activate the lights but was unsuccessful. After consulting the Airport/Facility Directory, the air traffic control (ATC) specialist informed the pilot the lights were pilot activated on frequency 125.3 Mhz. The ATC specialist then heard seven \"clicks\" on 122.4 Mhz. He advised the pilot that he was still on 122.4 Mhz. The pilot replied, \"Thank you, sir, we got 'em.\" At 0259 hours, the ATC specialist asked the pilot if he needed any further assistance. The pilot indicated that further assistance was not needed. The ATC specialist then issued the Prescott altimeter setting, 29.92 inHg, and asked the pilot if he had the flight precaution for turbulence. The pilot responded he did not. The ATC specialist issued AIRMET Tango for occasional moderate turbulence below 20,000 feet. The pilot then acknowledged he had received it. There were no further communications between the pilot and the Federal Aviation Administration ATC specialist. FAA radar data from Albuquerque Center tracked a single aircraft in the Love Field traffic pattern at 0319 hours. The radar data listed ten positions corresponding to right traffic off runway 21. The radar data indicates the tracked airplane reached an altitude of 6,500 feet mean sea level (msl), or about 1,500 feet above the ground.", "probable_cause": "The pilot misjudging distance and altitude during a night approach. Factors which contributed to the accident were: the pilot's impairment due to fatigue exacerbated by alcohol consumption, the dark night, and the high density altitude and turbulent weather condition. "}