{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-15-dc-skymaster-saint-cleophas-de-brandon-5-killed", "date": "Nov 4, 1959 at 2307 LT", "type": "Douglas C-54 Skymaster", "operator": "Wheeler-Airlines-2", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Plain, Valley", "schedule": "Montreal – Hall Beach", "msn": "10360", "yom": 1944, "flight_number": "WH1658", "city": "Saint-Cléophas-de-Brandon", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 30357, "circumstances": "Flight 1658 took off from Montreal-Dorval runway 10 at 2244LT on a cargo flight to Hall Beach, NWT. Following takeoff the aircraft continued runway heading and climbed to 6,000 feet. Course was then changed and the aircraft climbed to the assigned altitude of 9,000 feet, reaching this altitude at 2259LT. Some 3 and a half minutes later the crew reported that they were in an emergency descent because of a no. 2 engine fire. Last radio contact was at 2307LT when the crew reported that the plane had lost its left wing and \"was in a spin and going straight in\". The DC-4 broke up in midair, causing wreckage to cover a 1,25 x 0,75 mile area. All five crew members were killed. ", "probable_cause": "A fire of undetermined origin started in no.2 engine nacelle during the climb and developed to the stage where fire extinguishing equipment was inadequate to extinguish it. The following are considered to be primary contributing factors: \r\n- The deteriorated condition of the exhaust collector ring,\r\n- The probable deteriorated condition of the flexible wire braid hose assemblies,\r\n- The probable use of high power during the climb,\r\n- The possible failure of the fire detection and warning system to inform the pilot of the existence of a fire before it had penetrated the firewall and ignited the fuel feed system and oil tank to the rear of no.2 engine. During the rapid letdown, stresses were imposed on the weekened left wing by manoeuvre and/or gusts which were sufficient to sever the left wing spar. No subsequent action by the pilot could have brought the aircraft safely to the ground; neither was it possible to determine what effect a less rapid letdown would have had."}