{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-chamblee-2-killed", "date": "Oct 1, 1989 at 1642 LT", "type": "Beechcraft 90 King Air", "operator": "Roy Beatty", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Chamblee - Orlando", "msn": "LJ-652", "yom": 1975, "flight_number": null, "city": "Chamblee", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2000, "captain_hours_type": 400, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4272, "circumstances": "After taking off, the pilot established radio contact with departure control and reported a directional gyro problem. Seconds later, he reported that he was losing all instruments. Departure control attempted to provide no-gyro vectors. The pilot was instructed to make a frequency change. Soon thereafter, radio and radar contact were lost and the aircraft crashed. Before crashing the aircraft was observed in a rolling attitude. Wreckage was found scattered over a 600 feet by 150 feet area. An exam revealed the right wing had separated in flight. There was evidence that the right wing had failed in an upward (positive) direction. The pilot's attitude gyro was damaged during impact, but no rotational damage was noted. The pilot's attitude indicator and copilot's turn indicator were air driven, the pilot's turn indicator was dc powered and the copilot's attitude indicator was ac powered. The maintenance log did not have a current static/altimeter and transponder check. Both occupants were killed. ", "probable_cause": "Malfunction of one or more flight instruments for an undetermined reason, failure of the pilot to maintain control of the aircraft with partial panel instruments after becoming spatially disoriented, and his exceeding the design stress limits of the aircraft. The weather (low ceiling) and malfunctioning directional gyro were related factors."}