{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-aniak", "date": "May 28, 2020 at 1600 LT", "type": "Rockwell Shrike Commander 500", "operator": "Alaska%20Forest%20Department", "flight_phase": "Takeoff (climb)", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Aniak - Aniak", "msn": "500-3232", "yom": 1975, "flight_number": null, "city": "Aniak", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4869, "captain_hours_type": 30, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6966, "circumstances": "On May 28, 2020, about 1600 Alaska daylight time, an Aero Commander 500S airplane, N909AK sustained substantial damage when it was involved in an accident near Aniak, Alaska. The pilot and three passengers sustained serious injuries. The airplane was operated as a Title 14 Code of Federal Regulations Part 91 public aircraft flight. The airplane was owned by the State of Alaska and operated by the Division of Forestry. According to the pilot, after arriving in Aniak, he had the local fuel vendor's ground service personnel refuel the airplane. He then signed the fuel receipt, and he returned to the airplane's cockpit to complete some paperwork before departure. Once the paperwork was complete, he then loaded his passengers, started the airplane's engines, and taxied to Runway 29 for departure. The pilot said that shortly after takeoff, and during initial climb, he initially noticed what he thought was mechanical turbulence followed by a reduction in climb performance, and the airplane's engines began to lose power. Unable to maintain altitude and while descending about 400 ft per minute, he selected an area of shallow water covered terrain as an off-airport landing site. The airplane sustained substantial damage during the landing. The fueler reported that he was unfamiliar with the airplane, so he queried the pilot as to where he should attach the grounding strap and the location of the fuel filler port. Before starting to refuel the airplane, he asked the pilot \"do you want Prist with your Jet\" to which the pilot responded that he did not. After completing the refueling process, he returned to his truck, wrote \"Jet A\" in the meter readings section of the prepared receipt, and presented it to the pilot for his signature. The pilot signed the receipt and was provided a copy. The fueler stated that he later added \"no Prist\" to his copy of the receipt, and that he did not see a fuel placard near the fueling port. A postaccident examination revealed that the reciprocating engine airplane had been inadvertently serviced with Jet A fuel. A slightly degraded placard near the fuel port on the top of the wing stated, in part: \"FUEL 100/100LL MINIMUM GRADE AVIATION GASOLINE ONLY CAPACITY 159.6 US GALLONS.\" ", "probable_cause": "Loss of engine power after the aircraft has been refueled with an inappropriate fuel. "}