{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-61-aerostar-ted-smith-601p-pottstown-2-killed", "date": "Mar 18, 1994 at 1126 LT", "type": "Piper PA-61 Aerostar (Ted Smith 601)", "operator": "K%26L%20Microwave", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pottstown - Salisbury", "msn": "61-0843-8163444", "yom": 1981, "flight_number": null, "city": "Pottstown-Limerick-Heritage Field", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 19950, "captain_hours_type": 7500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4356, "circumstances": "At 0815 edt, N36444 landed with light snow falling and the temperature above freezing. Snow continued falling and the temperature dropped below freezing. At about 1100, the pilot filed an IFR flight plan and had a lineman brush snow from the wings. The lineman noted that patches of ice remained on the left wing, but the pilot declined to deice the plane. (At an airport 3 miles away, another flight was delayed due to ice that had formed below a snow cover on a plane that sat outside from 0945 to 1100.) The surviving passenger said that after takeoff, N36444 lost lift and yawed left. It appeared to recover, then vibrated, yawed, banked left, descended, and impacted the ground. After the accident, the engines were test run with no notable deficiencies. There was evidence the pilot was taking prescription medication. Tests of his blood showed 0.157 ug/ml of diazepam and 0.134 ug/ml of nordiazepam. Tests of his urine showed 0.152 ug/ml of nordiazepam and 0.167 ug/ml of oxazepam. On 3/2/90, the pilot had surgery for a tumor of (or near) the left optic nerve. In his last FAA medical application, he denied that he had medical treatment in the previous 5 years and did not report use of any medications. The aviation medical examiner had prescribed reserpine (for hypertension) and was aware of the surgery, but this was not reported in the pilot's faa medical record.", "probable_cause": "The pilot's failure to ensure that ice was properly removed from the airplane before flight, possibly due to impairment of judgment caused by a prescription drug (valium) that was not approved for use while flying. Factors related to the accident were: the pilot's failure to properly report his medical history on his faa medical application, and failure of the designated medical examiner to report the pilot's known medical history."}