{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-2p5-phuket-83-killed", "date": "Aug 31, 1987 at 1536 LT", "type": "Boeing 737-200", "operator": "Thai-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Hat Yai - Phuket", "msn": "22267", "yom": 1980, "flight_number": "TG365", "city": "Phuket", "zone": "Phuket (ภูเก็ต)", "country": "Thailand", "region": "Asia", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 74, "pax_fatalities": 74, "other_fatalities": 0, "total_fatalities": 83, "captain_hours": 19538, "captain_hours_type": 5576, "copilot_hours": 5951, "copilot_hours_type": 156, "aircraft_hours": 16963, "circumstances": "Thai Airways Flight 365 was approaching Phuket VOR/DME on radial 119 after a flight from Hat Yai. At the same time Dragon Air Flight 203 (a Boeing 737 registered VR-HYL, carrying 62 occupants) also approached Phuket VOR/DME on radial 090. At 08:34 UTC Dragonair 203 reported at 2500 feet with Thai 365 in sight in front of them. The Thai Boeing was flying at 3000 feet at the time, and was 13 miles from Phuket VOR/DME. Dragonair 203, first priority in approach sequence, then turned right at 12 DME and was going to turn inbound for finals for runway 27. The Thai crew surmised that the other crew were making a false position report to gain landing priority and reported hurriedly that they were at 8 DME inbound and requested visual approach, though they hadn't reached 8 DME yet. This forced Phuket Approach to give Thai 365 landing priority at 08:35. The Dragonair crew (flying IFR) immediately warned that the Thai plane couldn't descend through their flight level. Concentrating on the conflicting traffic the speed decayed to 163 knots until the stick shaker activated. The Thai crew then applied power and raised the landing gear, but the aircraft entered a stall crashed into the sea, disintegrating on impact. All 83 occupants were killed. ", "probable_cause": "The pilot slowed the aircraft and it stalled while the pilot prepared to be number one on landing as advised by Phuket approach control. It appears that he was worrying and not sure whether he could make number one landing because the pilot if number two aircraft in sequence gave warning that the number one aircraft ahead was above him and could not descend passing through his level. The pilot added power and raised the gear after stick shaker activated but didn't execute a recovery before hitting the sea."}