{"url": "https://www.baaa-acro.com/crash/crash-avro-748-234-2a-sandy-lake-7-killed", "date": "Nov 10, 1993 at 1805 LT", "type": "Avro 748", "operator": "Air%20Manitoba", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Winnipeg – Sandy Lake – Saint Theresa Point – Island Lake – Winnipeg", "msn": "1617", "yom": 1967, "flight_number": "7N205", "city": "Sandy Lake", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 7, "captain_hours": 16000, "captain_hours_type": 4500, "copilot_hours": 6500, "copilot_hours_type": 1100, "aircraft_hours": 29284, "circumstances": "The aircraft, a Hawker Siddeley 748 Series 2A Model 234 (HS 748) owned and operated by Air Manitoba Ltd. (Air Manitoba), took off from Winnipeg at 1438 central standard time (CST) , 10 November 1993, on scheduled flight NAM 205/ 206 that included stops at Sandy Lake, Ontario; St. Theresa Point, Manitoba; Island Lake, Manitoba; and return to Winnipeg, Manitoba. The flight was conducted in accordance with an instrument flight rules (IFR) flight plan and flight notification. On arrival at Sandy Lake at approximately 1549, the crew attempted to land but were unable to because of the low ceiling and visibility. They then diverted to St. Theresa Point, landing at 1630. A normal turnaround was completed; the number of passengers on departure was 26, and 2,086 pounds of fuel was uploaded to an estimated total of 6,700 pounds on board. The flight departed St. Theresa Point for Sandy Lake at 1720. The aircraft landed at approximately 1745 at Sandy Lake, where 22 passengers deplaned while four remained on board; the aircraft was not refuelled or otherwise serviced at Sandy Lake. During the stop, both engines were shut down. On take-off from Sandy Lake, there were two pilots, a flight attendant, and four passengers on board. The aircraft took off from runway 29 at Sandy Lake at approximately 1805 and entered a right turn. Witnesses indicate that the aircraft appeared to fly at a lower than normal height throughout the turn. After turning through approximately 120 degrees(°), the aircraft descended into 100-foot trees and crashed. The aircraft struck the ground about one nautical mile (nm) northwest of the airport. All seven occupants of the aircraft were fatally injured in the crash. The accident occurred during the hours of darkness. The wreckage was located at position latitude 53°04'71\"N, longitude 93°21'38\"W, at an elevation of approximately 940 feet above sea level (asl).", "probable_cause": "After take-off, the crew most likely lost situational awareness and, as a result, did not detect the increasing deviation from their intended flight path. Contributing to the loss of situational awareness was the lack of AC power to some of the flight instruments; the reason for the lack of AC power could not be determined."}