{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-440-11-metropolitan-shannon-4-killed", "date": "Jul 15, 1956 at 0135 LT", "type": "Convair CV-440 Metropolitan", "operator": "Swissair", "flight_phase": "Landing (descent or approach)", "flight_type": "Delivery", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "San Diego – New York – Gander – Shannon – Zurich", "msn": "335", "yom": 1956, "flight_number": null, "city": "Shannon", "zone": "Munster", "country": "Ireland", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed from San Diego, California, at 0407LT on 12 July for Zurich Airport, Switzerland, with two American pilots at the control, on a delivery flight to Swissair. Intermediate stops included New York, Gander and Shannon. Having left New York at 1240 GMT on 14 July 1956, the aircraft landed at Gander at 1659 GMT. After a stop of 57 minutes, it left Gander for Shannon at 1748 GMT carrying the same crew of 4 members. Following an uneventful ocean crossing the aircraft at 0008 hours on 15 July was given initial descent clearance to Shannon and was then cleared into the Shannon Holding Pattern, where four other aircraft were holding. At 0125 hours the aircraft commenced a Ground Controlled Approach to runway 23 and on establishing visual reference to the ground broke off the approach for a left-hand visual circuit to runway 05. During the turn onto final approach to runway 05, the aircraft, while banking steeply was observed to drop. The aircraft was destroyed on impact with the ground at approximately 0135LT and the 4 occupants were killed. There was no fire.", "probable_cause": "The probable cause of the accident was an error of judgment by the pilot, resulting in the execution of an abnormally steep turn onto final approach during which the aircraft slipped into the ground. \r\nPossible contributory factors were:\r\n- That for the successful execution of an approach involving a steep turn near the ground on a very dark night, there had been insufficient visual guidance from the terrain,\r\n- Impairment of the pilots' proficiency due to the length of the period on duty. "}