{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-1049g-super-constellation-cabarete-1-killed", "date": "Aug 16, 1957", "type": "Lockheed L-1049 Super Constellation", "operator": "Varig.gif", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Ciudad Trujillo - Miami - New York", "msn": "4610", "yom": 1955, "flight_number": null, "city": "Cabarete", "zone": "Puerto Plata", "country": "Dominican Republic", "region": "Central America", "crew_on_board": 11, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft arrived at Ciudad Trujillo on the morning of 16 August with No, 2 engine inoperative. It was decided to disembark the passengers there and continue the flight to New York via Miami, using only three engines, in order that the defective engine could be changed in New York. The aircraft, therefore, carrying only the crew, took off from General Andrews Airport, Ciudad Trujillo at 1516 hours with No. 2 propeller feathered. About 50 minutes after take-off, No. 4 engine propeller oversped and proved to be impossible to control or feather. It then tore free from the engine, damaging No. 3 engine propeller as it parted; No. 3 propeller was, therefore, feathered. In the meantime, No. 4 engine caught fire, and only No. 1 engine remained operative. As it was not possible to reach Ciudad Trujillo, an attempt was made to land on the road or the beach, but this failed owing to the large number of trees and the narrowness of the beach. Under these circumstances the aircraft was ditched parallel to the coast about 500 metres from it. It was considered that in carrying out the three-engined ferry flight without passengers, the operator acted in accordance with para. 6.2. 2, Part II of the ICAO International Standards and Recommended Practices, Annex 8 to the Convention, \"when the State of Registry considers that the damage sustained is of a nature such that the aircraft is no longer airworthy, it shall prohibit the aircraft from resuming flight until it is restored to an airworthy condition; the State of Registry may, however, in exceptional circumstances, prescribe particular limiting conditions to permit the aircraft to fly without fare-paying passengers to an aerodrome at which it can be restored to an airworthy condition\". After ditching, the aircraft sank to a depth of about 40 feet. On a second attempt the weather permitted a diving operation to be carried out, and inspection of the wreckage revealed the following in- formation:  All six flap sections of the port wing were entirely separated from the aircraft. No. 1 engine propeller tore free at the time of impact, splitting the propeller shaft next to the propeller thrust bearing. No. 2 power plant was wrenched free from its nacelle and remained attached to it only by pipes and control cables. This propeller was feathered. The two inner flap sections of the starboard wing were fractured and partially detached from the aircraft. The No. 3 engine propeller also was feathered and the tip of one of its blades was broken a point 18 inches from the leading edge to 12 inches from the trailing edge. The trailing edge of the same blade also had two deep dents. Marks, apparently made by a propeller blade, were found on the right side of the No. 3 engine cowling, No. 4 engine propeller was missing but only a small part of the nose section of the No. 4 engine was broken. The diaphragm and the pitch reducing mechanism were in their original places. The fuselage was fractured and the crack extended diagonally across the main part from the front towards the right rear wall. ", "probable_cause": "Due to the fact that three of its engines were inoperative, the aircraft had to be ditched in the sea. "}