{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-bronson-1-killed", "date": "Jan 23, 2002 at 0735 LT", "type": "Cessna 402", "operator": "Riley%20Aviation", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Plain, Valley", "schedule": "Sturgis - Ann Arbor", "msn": "402B-1322", "yom": 1978, "flight_number": null, "city": "Bronson", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1800, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7339, "circumstances": "The airplane was destroyed when it impacted the ground while maneuvering at a low altitude following a loss of control in instrument meteorological conditions. The airplane was on a flight in instrument meteorological conditions when radar and voice contact were lost. Prior to the loss of communication, controllers advised the pilot to check altitude. At this point, the radar data shows that the airplane was about 400 feet below the assigned altitude. Subsequently, the pilot said, \"roger sir my auto pilot i just cut off uh correcting immediately.\" This was the last received transmission from the pilot. The radar data shows that the airplane then began a descending right turn at an average rate of descent of 1,276 feet per minute. This descent was followed by a climbing left turn with an average rate of climb of 5,423 feet per minute. The radar data shows that the radius of the left turn continued to decrease until radar contact was lost about 500 feet above the last assigned altitude. A witness who saw the airplane just prior to impact described the airplane maneuvering beneath the clouds prior to pulling up sharply and then pitching down and impacting the ground. There was a utility wire and associated poles running across the airplane's flight path in the field where the wreckage was located. The airplane exploded and burned upon impact. No anomalies were found with the airplane or associated systems. The autopilot section of the Pilot's Operating Handbook states, \"Sustained elevator overpower will result in the autopilot trimming against the overpower force.\" The result is that if up elevator pressure is applied with the autopilot engaged, the autopilot will trim the airplane nose down.", "probable_cause": "The maneuver to avoid the utility wire while maneuvering resulting in an inadvertent stall and subsequent impact with the ground. Factors were the pilot's inadvertent activation of the elevator trim, resulting in a loss of control during flight in instrument meteorological conditions, as a result of pilot's lack of knowledge concerning the operation of the autopilot system. Another factor was the utility wire."}