{"url": "https://www.baaa-acro.com/crash/crash-honda-ha-420-hondajet-foz-do-iguacu", "date": "Sep 24, 2018 at 1342 LT", "type": "Honda HA-420 HondaJet", "operator": "Alta", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Curitiba – Foz do Iguaçu", "msn": "420-00068", "yom": 2017, "flight_number": null, "city": "Foz do Iguaçu", "zone": "Paraná", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5600, "captain_hours_type": 77, "copilot_hours": 660, "copilot_hours_type": 14, "aircraft_hours": null, "circumstances": "The airplane departed Curitiba-Afonso Pena Airport at 1240LT on an executive flight to Foz do Iguaçu, carrying one passenger and two pilots. Following an uneventful flight, the crew started the descent to Foz do Iguaçu-Cataratas Airport. The aircraft was stabilized and landed on wet runway 32. After touchdown, the crew encountered difficulties to stop the aircraft that overran and came to rest into a ravine. All three occupants evacued safely and the aircraft was damaged beyond repair. ", "probable_cause": "The following findings were identified:\r\n- The approach was considered stabilized;\r\n- The required landing distance of 6,431t (1,960m) was compatible for the operation, since the LDA of runway 32 at SBFI was 7,201ft (2,195m);\r\n- There was no evidence of malfunction of the aircraft brake system that could have caused the runway excursion;\r\n- At the time of landing, the runway was wet with a significant amount of water on the pavement;\r\n- The estimated deceleration corresponded to what would be expected on a very wet runway (> 3mm of water) with hydroplaning of the tires at higher speeds;\r\n- The friction and macrotexture measurements had normal parameters and did not contribute to the aircraft's poor deceleration;\r\n- The characteristics of the precipitation over threshold 14 associated with the large variations in wind direction and intensity were consistent with the windshear phenomenon, resulting from a microburst;\r\n- The PR-TLZ sensors did not detect the occurrence of windshear during the landing approach;\r\n- A sudden increase in the calibrated speed that peaked at 32kt altered the aircraft's lift and, consequently, reduced the tires' grip on the ground, resulting in poor braking in the parts where the ground speed was lower;\r\n- The speedbrakes were not extended during the run after landing, contrary to what was prevised in the AFM;\r\n- The aircraft ran the full length of the runway, overpassed its limits and crashed into a ravine;\r\n- There was a windshear alert issued about 30 seconds after the landing of the PRTLZ by an aircraft that was at the threshold 32;\r\n- The aircraft had substantial damage; and\r\n- The crewmembers and the passenger left unharmed.\r\nContributing factors:\r\n- Control skills – undetermined\r\nDespite the low contribution of the speedbrakes to the reduction of the landing distance, this device represents a deceleration resource through aerodynamic drag that should not be neglected, especially during landing on wet runways, and could have contributed to avoiding runway excursion.\r\n- Adverse meteorological conditions – a contributor\r\nThe large variation in wind intensity peaked at 32 kt. This variation lasted 13 seconds and raised the indicated speed from 76 kt to 108 kt. Considering that the speed of 108 kt was very close to the VREF (111 KCAS), it can be stated that this phenomenon altered the aircraft's lift and, consequently, reduced the tires' grip on the ground, leading to poor braking."}