{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226t-merlin-iiib-rockport-2-killed", "date": "Jan 19, 1982 at 1323 LT", "type": "Swearingen SA226T Merlin III", "operator": "Baker Marine Construction Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Corpus Christi-Rockport", "msn": "T-336", "yom": 1980, "flight_number": null, "city": "Rockport-Aransas County", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": null, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3800, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Prior to the FAF during a VOR/DME approach, the Merlin was cleared to change to the unicom frequency. The pilot of the Merlin contacted unicom and requested and airport advisory. The unicom operator replied that there was a pirep of 500 feet over the field with two miles visibility but 'zilch' over the water. Shortly after this contact the pilot of the AA-5A called on unicom turning final. The pilot of the AA-5A was given the same advisory as given to the Merlin and further advised that another aircraft was inbound for runway 14. The aircraft collided less than one mile northwest of the approach end of runway 14. AIM 157 recommends that VFR inbound flights broadcasting entering downwind and final. AIM 363 recommends that, when making an IFR approach to an airport not served by a tower or FSS and after ATC advises to change to advisory frequency, to broadcast intentions, including type approach, position and when over FAF inbound. All three occupants in both airplanes were killed. ", "probable_cause": "Midair collision during IFR circling due to inadequate visual lookout on part of both crew. The following findings were reported:\r\n- Unavailable control tower,\r\n- Unavailable radar approach/departure, \r\n- Low ceiling, \r\n- Fog,\r\n- Inadequate air/ground communications from both crew."}