{"url": "https://www.baaa-acro.com/crash/crash-boeing-b-29a-60-bn-superfortress-peconic-bay-6-killed", "date": "Apr 24, 1953", "type": "Boeing B-29 Superfortress", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Wright-Patterson - Wright-Patterson", "msn": "11570", "yom": 1944, "flight_number": null, "city": "Peconic Bay (Long Island)", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A coupling and fully-towed flight was accomplished using the right-handed EF-84B, but no electrical power was received from the B-29. The right hand fighter uncoupled and the left hand fighter coupled with the B-29 and was retracted in the fully-locked towing position. The cockpit panel light indicated that electrical power was available from the B-29, and as soon as everything was trimmed and stabilized and the automatic flight control system was activated momentarily from the fighter. This resulted in a violent pitching motion of the EF-84B causing it to flip up and inward into the B-29. The B-29 outer wing panel crumpled and struck the main B-29 wing spar, shearing off the F-84 nose section before the two aircraft separated. As Bud Anderson flew in formation on the right side of the Superfortress, John Davis brought the left-hand EF-84D into position and linked wingtips with the EB-29A. He transmitted, \"Autopilot coming on\" and then switched the autopilot on. It commanded hard nose-up elevator. Davis' Thunderjet rolled rapidly to the right onto the outer wing panel of the Superfortress. As the fighter rotated about the wing tip of the bomber, the explosive bolts fired to jettison the Thunderjet, but not in time to prevent the collision between the planes. The left wing of the EB-29A failed outboard of the engines. The nose of the EF-84D broke away from the rest of the airplane. \nB-29 went into steep spiral and crashed into Peconic Bay, Long Island and the F-84 crashed shortly thereafter. John Davis and five crew members aboard the EB-29A were killed in the accident. The other fighter, having unhooked, presumably landed safely. The project 'Tip Tow' was immediately cancelled.\nSource:\nhttp://www.air-and-space.com/Wing Tip Coupling B-29 F-84.htm\nhttp://www.joebaugher.com/usaf_serials/1944_4.html", "probable_cause": null}