{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh104-dove-i-chewton-common-3-killed", "date": "Mar 13, 1947 at 1808 LT", "type": "De Havilland DH.104 Dove", "operator": "BOAC-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Bournemouth - Bournemouth", "msn": "4003", "yom": 1946, "flight_number": null, "city": "Chewton Common", "zone": "Dorset", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Two pilots and one engineer were conducting a one hour test flight from Bournemouth-Hurn Airport. While circling around the airport, the crew encountered poor weather conditions but the captain informed ground he was able to reach the airfield. Shortly later, while flying at low height, the twin engine aircraft hit tree tops and crashed in a wooded area located in Chewton Common, southeast of the airport. All three occupants were killed. \r\nIt was reported in the final report that the flight was planned to obtain fuel consumption figures of the Gypsy 70 engine under cruising conditions & Captain R. G. Buck, the pilot, took off from Hurn at 1620LT, his intention being to carry out a flight of one hour duration below the cloud which was then at 1,200 feet. No notification of the flight was made to flying control until the time of take-off & no weather forecast was requested or given. It is presumed that the test was satisfactorily concluded for at 1714LT the Captain requested permission to join the circuit prior to landing. This was given together with weather information & Q.F.E. Weather conditions then began to deteriorate rapidly, cloud base lowering to 800 feet with rain. Capt. Buck gave his position as being over Bournemouth Pier at 1724LT and was instructed not to fly above 1,500 feet owing to the presence of another aircraft at 2,000 feet. Rockets & Very lights were fired & at 1735LT the pilot announced that he could see the airfield. He immediately carried out a left-hand circuit at an estimated height of 200 feet with the undercarriage down, at times going out of view into low cloud & rain. An approach at about 50 feet on runway 170 was attempted but the pilot failed to line-up with the runway & passed over the center of the airfield & disappeared in a right hand circuit. After a similar unsuccessful attempt to land, the controller gave permission for landing on any runway & gave further assistance by lighting sodium funnels. Capt. Buck then asked for a diversion stating \" No radio, VHF not working & endurance three hours.\" At 1804LT he was told the best weather was in the London area & that London Airport had G.C.A & could work him on 5100 kc/s. The suggestion was not acted upon so the controller proposed he should make a further attempt to land at Hurn. Capt. Buck's reply was \" Do not know where I am, but will try to find you.\" At approximately 1808LT the aircraft struck a row of trees & crashed in an adjoining copse. Weather conditions were bad with fine drizzle, a cloud base of 60 feet & visibility down to as little as 200 yards. ", "probable_cause": "In the opinion of the Inspector the accident was the result of the aircraft striking trees whilst flying low in conditions of poor visibility. The only recommendation made was that the present location of the inertia crash switch be reconsidered. Owing to the high inertia required to actuate this switch it was felt that a position such as the belly of the fuselage adjacent to the nose of the aircraft would be more desirable."}