{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-golden", "date": "Oct 1, 1986", "type": "De Havilland DHC-2 Beaver", "operator": "Amiskwi Air", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": null, "msn": "1070", "yom": 1957, "flight_number": null, "city": "Golden", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot, under the supervision of his employer/instructor, had set out to practise solo take-offs and landings in order to qualify for a float endorsement. During a take-off attempt from the river, the aircraft porpoised, cleared the water momentarily with the left and then the right float, swerved left, and struck the river bank in a level attitude. The aircraft then rolled and came to rest, partially submerged, on its left side. A fire started in the engine compartment but lasted for a short time only. The seriously injured pilot was rescued by the aircraft owner who swam across the river. ", "probable_cause": "The pilot, although experienced in the operation of wheel-equipped aircraft, had limited experience with aircraft on floats. His solo flying experience on float-equipped aircraft was less than one hour and was from the same location the day before the accident. The river flowed at about five knots in the direction of take-off. The water level of the river was low, and, as a result, sand bars were both above and just below the water surface. Because of these conditions, the average usable width of the river for take-offs and landings was less than 100 feet. The river had one prominent bend in the area where the aircraft commenced its take-off and another just downstream of the occurrence site. The riverbank on the left, in the direction of take-off, had tall trees up to the water's edge. The pilot suffered injuries during the crash; the lap belt had a Sliding friction-type buckle that loosened during the crash, and there was no shoulder harness installed in the aircraft. It is probable that the pilot's injuries would have been less serious if he had had a better restraint system. Although the pilot had successfully taken off and landed on the river the day before the accident, the conditions of that area were unsuitable for his limited float-flying experience. When the pilot could not establish directional control during the take-off, a prudent decision would have been to reject, rather than to continue. The supervising pilot should have realized that the conditions of the river were not suitable as a practice area for any pilot, particularly for a pilot whose float-flying experience was limited."}