{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e18s-miami-1-killed", "date": "May 2, 2011 at 0809 LT", "type": "Beechcraft E18", "operator": "Island Air Service", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Miami - Marsh Harbour", "msn": "BA-312", "yom": 1957, "flight_number": null, "city": "Miami-Opa Locka", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6400, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13221, "circumstances": "After taking off from runway 9L at his home airport and making an easterly departure, the pilot, who was also the president, director of operations, and chief pilot for the on-demand passenger and cargo operation, advised the air traffic controller that he was turning downwind. According to witnesses, the airplane did not sound like it was developing full power. The airplane climbed to about 100 feet, banked to the left, began losing altitude, and impacted a tree, a fence, and two vehicles before coming to rest in a residential area. A postcrash fire ensued, which consumed the majority of the cabin area and left wing. Examination of the accident site revealed that the airplane had struck the tree with its left inboard wing about 20 feet above ground level. Multiple tree branches exhibiting propeller cuts were found near the base of the tree. Propeller strike marks on the ground also corresponded to the location of the No. 1 (left side) propeller. There were minimal propeller marks from the No. 2 (right side) propeller. Examination of the propellers revealed that the No. 1 propeller blades exhibited chordwise scratching and S-bending, consistent with operation at impact, but the No. 2 propeller blades did not exhibit any chordwise scratching or bending, which indicates that the No. 2 engine was not producing power at the time of impact. There was no evidence that the pilot attempted to perform the manufacturer’s published single engine procedure, which would have allowed him to maintain altitude. Contrary to the procedure, the left and right throttle control levers were in the full-throttle position, the mixture control levers were in the full-rich position, neither propeller was feathered, and the landing gear was down. Postaccident examination of the No. 1 engine revealed no evidence of any preimpact malfunction or failure. However, the No. 2 engine's condition would have resulted in erratic and unreliable operation; the engine would not have been able to produce full rated horsepower as the compression on four of the nine cylinders was below specification and both magnetos were not functioning correctly. Moisture and corrosion were discovered inside the magneto cases; the left magneto sparked internally in a random pattern when tested and its point gap was in excess of the required tolerance. The right magneto's camshaft follower also exhibited excessive wear and its points would not open, rendering it incapable of providing electrical energy to its spark plugs. Additionally, the main fuel pump could not be rotated by hand; it exhibited play in the gear bearings, and corrosion was present internally. When the airplane was not flying, it was kept outdoors. Large amounts of rain had fallen during the week before the accident, which could have led to the moisture and corrosion in the magnetos. Although the pilot had been having problems with the No. 2 engine for months, he continued to fly the airplane, despite his responsibility, particularly as president, director of operations, and chief pilot of the company, to ensure that the airplane was airworthy. During this period, the pilot would take off with the engine shuddering and would circle the departure airport to gain altitude before heading to the destination. On the night before the accident, the director of maintenance (DOM) replaced the No. 1 cylinder on the No. 2 engine, which had developed a crack in the fin area and had oil seeping out of it. After the DOM performed the replacement, he did not do a compression check or check the magnetos; such checks would have likely revealed that four of the remaining cylinders were not producing specified compression, that the magnetos were not functioning correctly, and that further maintenance was necessary. Review of the airplane's maintenance records did not reveal an entry for installation of the cylinder. The last entry in the maintenance records for the airplane was an annual and a 100-hour inspection, which had occurred about 11 months before the accident.", "probable_cause": "The pilot’s improper response to a loss of power in the No. 2 engine and his failure to ensure that the airplane was airworthy. Contributing to the accident was the inadequate engine maintenance by the operator's maintenance personnel.\n"}