{"url": "https://www.baaa-acro.com/crash/crash-lockheed-p-3a-orion-near-florence-2-killed", "date": "Oct 16, 1991 at 1945 LT", "type": "Lockheed P-3 Orion", "operator": "Aero%20Union.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Mountains", "schedule": "Santa Barbara - Missoula", "msn": "185-5072", "yom": 1964, "flight_number": "Tanker 24", "city": "Florence", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Air tanker N924AU had been dispatched from its base in Santa Barbara, CA to Missoula, MT to support fire suppression efforts involving a number of large fires in the Northern Region. The flight departed in VFR conditions at 16:05 PDT. While still in the area controlled by the Oakland FAA Air Route Traffic Control Center (ARTCC), the crew requested and received an Instrument Flight Rules (IFR) clearance. They were assigned an altitude of 23,000 feet. The Orion proceeded uneventfully and was handed off to the Approach Controller at Missoula (MSO). MSO Approach did not have, at that time, terminal radar equipment that covered their entire area of responsibility. At first contact with MSO Approach, the Orion was 26 miles southeast of the Missoula International Airport and descending to 12,000 feet. In the course of several exchanges between the Orion and the MSO Approach Controller, it was disclosed and confirmed that the Orion’s flight crew did not have the approach plate (or chart) depicting the published approach procedure for the VOR-DME Bravo (B) approach, which was the approach in use for aircraft arriving from the south. Clearance was nevertheless offered and accepted and the controller provided the information as the Orion crew began to execute the VOR-DME B approach. At this time, the cloud bases at the MSO Airport were at about 7,900 feet and other aircraft making instrument approaches there were descending through 8,000 feet, cancelling their IFR flight plans and making visual approaches to the airport for landing. Since the Orion’s crew was able to monitor these radio communications/transmissions on the same frequency, they were probably counting on doing the same. At this time, there were very strong winds and moderate to severe turbulence reported at altitudes above 8,000 feet that increased with altitude in the MSO area. In addition to turbulence, the Orion crew contended with effects of flying at high altitudes, using oxygen in an unheated and un-pressurized aircraft for more than two hours. At some point in the initial phase of the approach, some confusion as to what heading to fly apparently occurred and the airtanker turned back toward the south, away from MSO. By this time the controller had authorized descent to 8,600 feet on an approximate heading of 200 degrees magnetic. MSO Approach received notification by Salt Lake City ARTCC (Center) that this airtanker was west of the course consistent with the approach procedure and subsequent notification that the airtanker had disappeared off Center’s radar screen. Repeated attempts to contact the Orion crew failed and MSO Approach notified the County Sheriff’s office, the Forest Service, and other agencies that the aircraft was missing and presumed down. Search and rescue attempts were not able to detect an Emergency Locator Transmitter (ELT) signal. The mishap site was located the following day.\r\nSource: https://www.fs.usda.gov/managing-land/fire by Candy S. Rock Fitzpatrick. ", "probable_cause": null}