{"url": "https://www.baaa-acro.com/crash/crash-lockheed-14h-super-electra-miles-city-4-killed", "date": "Jan 13, 1939 at 2115 LT", "type": "Lockheed 14 Super Electra", "operator": "Northwest%20Airlines2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Chicago – Minneapolis – Fargo – Bismarck – Miles City – Butte – Spokane – Seattle", "msn": "1408", "yom": 1938, "flight_number": "NW001", "city": "Miles City", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 11800, "captain_hours_type": 600, "copilot_hours": 4400, "copilot_hours_type": 600, "aircraft_hours": null, "circumstances": "The aircraft started the take-off to the northwest at 2114LT, leaving the ground at a point approximating the intersection of the two field run rays, and crossed the field boundary in a normal climb. After reaching an estimated altitude of 500 feet, the aircraft began a slow turn to the left, thick is the usual procedure in contacting the west leg of the Miles City radio range for the purpose of continuing flight to Billings, Montana. Shortly after starting the turn, the aircraft was seen to lose altitude rapidly and descend almost to the ground before the descent was checked, and the aircraft pulled up in a sharp climb to an altitude approximating that previously attained. Immediately thereafter, the aircraft turned sharply to the loft and descended rapidly, striking the ground in a ravine and headed in a southeasterly direction with its left tang and nose slightly down. The aircraft traveled for a distance of approximately 280 feet from the point of first contact with the ground, scattering fragments along its path, and came to rest on rising terrain, where it was entirely destroyed by fire at a point 2650 feet distant from the west boundary of the Miles City airport, and 1200 feet south of a projection of north boundary of the airport. The crash resulted in the death of all person aboard the aircraft.\r\nCrew:\r\nC. B. Chamberlain, pilot,\r\nR. B. Norby, copilot.\n", "probable_cause": "Although the exact origin and source of the fire is undermined, the condition and location of the emergency-control-box cover, ‘then found, indicates the possibility of Lire at a point of leakage in the cross-feed-fuel system beta is the immediate vicinity of the cross-feed valve, and that such fire could have entered the cockpit prior to crash, through or around the box containing the emergency controls. It was concluded that the probable cause of the accident was a fire in the pilot’s control cabin, resulting in loss of control of the aircraft. Improper location and installation of that portion of the aircraft’s cress-feed fuel system which passed through the fuselage was considered as a contributory factor. "}