{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-kansas-city", "date": "Jan 28, 2005 at 2217 LT", "type": "Learjet 35", "operator": "Million%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Salt Lake City - Kansas City", "msn": "35-109", "yom": 1977, "flight_number": null, "city": "Kansas City-Charles B. Wheeler-Downtown", "zone": "Missouri", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5127, "captain_hours_type": 1236, "copilot_hours": 4301, "copilot_hours_type": 482, "aircraft_hours": 11138, "circumstances": "The Learjet 35A received substantial damage on impact with airport property and terrain during a landing overrun on runway 19 (7,002 feet by 150 feet, grooved asphalt) at Charles B. Wheeler Downtown Airport (MKC), Kansas City, Missouri. The airplane was operated by a commercial operator as a positioning flight to Kansas City International Airport (MCI), Kansas City, Missouri, with a filed alternate destination of Lincoln Airport (LNK), Lincoln, Nebraska. Night instrument meteorological conditions prevailed at the time of the accident. LNK was a certificated airport with a snow removal plan and was served by runway 17R (12,901 feet by 200 feet, grooved asphalt and concrete). The flight was en route to MCI to pick up passengers and continue on as an on-demand charter but diverted to MKC following the closure of MCI. MCI was closed due to a McDonnell Douglas MD83 sliding off a taxiway during an after landing taxi on contaminated runway/taxiway conditions. MKC held a limited airport certificate that did not have a snow removal plan and was served by runway 19. Following a precision approach and landing on runway 19 at MKC, the Learjet 35A slid off the departure end of the runway and impacted airport property and terrain. The Learjet 35A was operated with inoperative thrust reversers as per the airplane's minimum equipment list at the time of the accident. About 1:05 hours before the accident, runway 19 Tapley values were recorded as 21-22-22 with 1/2 inch of wet snow. About 17 minutes before the accident, MKC began snow removal operations. About 7 minutes before the accident, the MKC air traffic control tower (TWR) instructed the snow removal vehicles to clear the runway for inbound traffic. TWR was advised by airport personnel that runway 19 was plowed and surface conditions were 1/4 inch of snow of snow; friction values were not taken or reported. While inbound, the Learjet 35A requested any braking action reports from TWR. The first airplane to land was a Cessna 210 Centurion, and the pilot reported braking action to the TWR as \"moderate\", which was then transmitted by TWR as \"fair\" from a Centurion in response to the Learjet 35A's query. The Cessna 210 Centurion pilot did not use brakes during landing and did not indicate this to TWR during his braking action report. The Aeronautical Information Manual states that no correlation has been established between MU values and the descriptive terms \"good,\" fair,\" and \"nil\" used in braking action reports. The Airport Winter Safety and Operations advisory circular (AC) states that \"pilot braking action reports oftentimes have been found to vary significantly, even when reported on the same frozen contaminant surface conditions.\" The AC  also states, \"It is generally accepted that friction surveys will be reliable as long as the depth of snow does not exceed 1 inch (2.5 cm) and/or depth of wet snow/slush does not exceed 1/8 inch (3mm). The Learjet 35A flightcrew calculated a landing distance 5,400 feet. Two of the cockpit voice recording channels, which normally contain the pilot and copilot audio panel information, were blank.", "probable_cause": "The contaminated runway conditions during landing. Contributing factors were the operation of the airplane without thrust reversers, flight to the planned alternate airport not performed by the flightcrew, and the insufficient runway information. Additional factors were the airport property and terrain that the airplane impacted."}