{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130k-hercules-tromso", "date": "Sep 12, 1972", "type": "Lockheed C-130 Hercules", "operator": "Royal-Air-Force-4", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Wittering - Tromsø", "msn": "4214", "yom": 1967, "flight_number": null, "city": "Tromsø", "zone": "Troms", "country": "Norway", "region": "Europe", "crew_on_board": 12, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was completing a flight from RAF Wittering to Tromsø, carrying a Harrier load. After touchdown on a runway covered with slush, the airplane deviated to the left. The Aircraft Captain, without saying 'he had control' feathered the two starboard engines. The co-pilot, believing he was still in control, applied right rudder and brakes. Instead of a gentle correction to the centreline, the aircraft swung hard right and left the runway. As it crossed over the 'monnie' drain the cockpit area of the fuselage broke off by the crew door, coming to rest at an angle to the main fuselage, the tail also broke off. At this stage the crew 'legged it' through the flight deck windows leaving everything still switched on and live! The passenger had trapped his hand on the 'towel rail' when it folded under the impact, the navigator gave him a 'whack' which loosened his hand but broke his fingers.On hitting the ground outside the aircraft, the ALM had a heart attack (non-fatal). The main fuselage was covered in dirt which had entered through the break and if the ALM and pax had been sitting there they would have been killed. The Load remained 'nailed to the floor' and not one bottle was broken!\r\nCrew:\r\nF/Lt Charles Collier, \r\nF/O Brian Clucas, \r\nF/S Taff Thomas,\r\nF/S Tony ‘Chomper’ Lamb, \r\nSgt Ivan Gervais,\r\nSgt Merv Corke, \r\nCpl Keith Simmonds,\r\nCpl Tom Blues, \r\nSAC Bob Ford, \r\nSAC Bob Thacker, \r\nSAC Keri Eynon,\r\nSAC Fred Kitts.\r\nSource: http://ukmamsoba.org/obb022318_light.html", "probable_cause": "At the Board of Enquiry everyone, apart from the Navigator, was found guilty of negligence, both pilots for lack of coordination, the engineer for leaving the frame live and the ALM for not being at his correct position for landing."}