{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-680f-near-cloncurry-2-killed", "date": "Nov 9, 1994 at 1015 LT", "type": "Rockwell Grand Commander 680", "operator": "Prive", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Plain, Valley", "schedule": "Cloncurry - Cloncurry", "msn": "680-1128-74", "yom": 1961, "flight_number": null, "city": "Cloncurry", "zone": "Queensland", "country": "Australia", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 11400, "captain_hours_type": 710, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7546, "circumstances": "The aircraft was engaged in aero-magnetic survey operations in an area which extended from approximately 40–130 km south of Cloncurry. The task involved flying a series of north-south tie lines spaced 2 km apart at a height above ground of 80 m and a speed of 140 kts. At this speed, each tie line occupied about 20 minutes of flight time. The flight was planned to depart Cloncurry at 0700–0730 EST and was to return by 1230 to prepare data collected during the flight for transfer to the company’s head office. An employee of the operating company saw the crew (pilot and equipment operator) preparing to depart the motel for the airport at about 0500. No person has been found who saw the crew at the aerodrome or who saw or heard the aircraft depart. At about 1000, three witnesses at a mining site in the southern section of the survey area saw a twin-engine aircraft at low level heading in a northerly direction. One of these witnesses, about 1.5 hours later, saw what he believed was the same aircraft flying in an easterly direction about 1 km from his position. Between 1000 and 1030, two witnesses at a mine site some 9 km north of the survey area (and about 5 km west of the accident site) heard an aircraft flying in a north-south direction, apparently at low level. On becoming aware that the aircraft had not returned to Cloncurry by 1230, a company employee at Cloncurry initiated various checks at Cloncurry and other aerodromes in the area, with Brisbane Flight Service, and with the company’s head office later in the afternoon. At about 2030, the employee advised the company chief pilot that the aircraft was overdue. The chief pilot contacted the Civil Aviation Authority Search and Rescue organisation at about 2045 and search-and-rescue action was initiated. The burnt-out wreckage of the aircraft was found early the following morning approximately 9 km north of the survey area.", "probable_cause": "For reason(s) which could not be conclusively established, the pilot shut off the fuel supply to the left engine and feathered the left propeller. For reason(s) which could not be conclusively established, the pilot lost control of the aircraft.\n"}