{"url": "https://www.baaa-acro.com/crash/crash-cessna-500-citation-san-luis-obispo-4-killed", "date": "Sep 24, 1990 at 0702 LT", "type": "Cessna 500 Citation", "operator": "HiTech Helicopters", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Van Nuys - San Luis Obispo", "msn": "500-0254", "yom": 1975, "flight_number": null, "city": "San Luis Obispo", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1021, "captain_hours_type": 95, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4197, "circumstances": "The flight was cleared for a loc runway 11 approach. About 3 minutes later, the 2nd-in-command (sic) reported '. . . We don't get the localizer can you see if we're on course.' The LAX ARTCC R-15 controller confirmed the flight was right of course and below the required altitude. The aircraft's mode C indicated an altitude of 1,400 feet; the controller advised the flight crew to maintain at least 2,300 feet until past the final approach fix (faf). The crew then replied that they were in VMC. Radar svc was terminated and a frequency change to tower was approved. Shortly thereafter, the aircraft hit a eucalyptus tree at about 90 feet agl, 2.05 miles from the approach end of the runway and about 195 feet right of the loc. Elevation of the crash site was 101 feet; minimum descent altitude (MDA) for the approach was 640 feet. The 0645 pdt weather was, in part: indefinite ceiling, 100 feet obscured, vis 1/8 mile with fog, wind from 220° at 4 kts. No preimpact part failure or malfunction of the aircraft was found. All four occupants were killed. ", "probable_cause": "The pilot's improper IFR (instrument) procedure, and his failure to maintain the minimum descent altitude (MDA) for the approach. The adverse weather was a related factor."}