{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-209-burbank-8-killed", "date": "Dec 1, 1944 at 0258 LT", "type": "Douglas DC-3", "operator": "TWA-1", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Francisco – Burbank – New York", "msn": "1968", "yom": 1937, "flight_number": "TW018", "city": "Burbank", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 20, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 5400, "captain_hours_type": 4315, "copilot_hours": 1084, "copilot_hours_type": 136, "aircraft_hours": 22180, "circumstances": "The flight was cleared to Burbank Airport for a standard instrument approach. During the approach the plane descended under instrument conditions to such a low altitude as to clip the tree tops and strike a power line pole and then crash at a point approximately 6 1/2 miles short of the Burbank Airport. In a normal approach the plane would have flown over this point at an altitude of about 1650 feet above the ground. The specific reasons for the plane's descent below the minimums for instrument approach were not determinable, nor was it possible to tell whether the deviation was a voluntary one. Investigation did reveal, however, that a number of divisions were made from the company's standard Civil Aeronautics Administration approved procedures during this flight. Both pilots and six passengers were killed. \r\nCrew:\r\nJohn Pollard Snowden, pilot, †\r\nThomas Leo Bamberger, copilot, †\r\nDonna Elizabeth Marr, hostess.", "probable_cause": "On the basis of the evidence available the Board finds that the probable cause of this accident was the pilot's deviation from the standard instrument approach procedure then he descended below the established safe minimum altitude. A contributing factor was the company's failure to enforce adherence to company procedures."}