{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-cannes", "date": "Aug 31, 2015 at 0855 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Prive", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Cannes – Triengen", "msn": "46-22063", "yom": 1989, "flight_number": null, "city": "Cannes", "zone": "Alpes-Maritimes", "country": "France", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 18213, "captain_hours_type": 900, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The single engine aircraft departed Cannes-Mandelieu Airport on a private flight to Triengen, Switzerland, with one passenger and one pilot on board. Shortly after takeoff from runway 17, while in initial climb, the pilot noticed engine troubles and the speed dropped. He was able to maintain a straight-in path and eventually ditched the airplane few hundred metres offshore. Both occupants were slightly injured and the aircraft sank and was lost. ", "probable_cause": "The engine failure was the result of an incorrect refueling, due to an intake initial order probably incorrect that the incomplete application of procedures by the operator in charge of refueling and the lack of attention of the pilot did not allow recovery. The quantity of 100LL present in the feeders and the pipes allowed the taxiing and the take-off run, without the pilot noticing any anomaly. Once this quantity of 100LL consumed, the JET A1 present in the lower part of the tanks fed the engine and caused the power decrease.\r\nContributed to the accident:\r\n- Coordination between the aerodrome operator and its subcontractors during the fuel order taken by the ramp agent, who does not encourage the operator in charge of refueling to confirm the type of fuel in a service carried out under strong time constraints,\r\n- A usual practice for refueling certain types of helicopters, whose reservoir ports are not compatible with the dimensions of the standard refueling nozzles, which trivialize the change of nozzle for the refueling of JET A1, occasionally leading to the filling of order confirmation vouchers, thus reducing the effectiveness of the manifest safety for the operator through the presence of keying devices specific to each fuel,\r\n- The ineffectiveness of the fuel type check item of the pre-flight procedure."}