{"url": "https://www.baaa-acro.com/crash/crash-lockheed-18-56-lodestar-near-tyrone-3-killed", "date": "Dec 20, 1956 at 1923 LT", "type": "Lockheed 18 LodeStar", "operator": "Columbia-Geneva-Steel-Company", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Pittsburgh – New York", "msn": "2470", "yom": 1943, "flight_number": null, "city": "Tyrone", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 10615, "captain_hours_type": 498, "copilot_hours": 2315, "copilot_hours_type": 424, "aircraft_hours": 3715, "circumstances": "N1245V departed Greater Pittsburgh Airport, Pittsburgh, Pennsylvania, at 1850, December 20, 1956, on an IFR flight plan via airways V-35, V-6, V-168, V-30, and V-1 to New York International Airport. Jamaica, New York. The crow consisted of Captain Roy E. Rollo and Copilot Lewis Thomas Williams. Mr. Alden Roach, President of Columbia-Geneva Steel Company, was the only passenger. At the time of takeoff from Pittsburgh, the gross weight of the aircraft was 19,421 pounds (maximum allowable gross load 19,500 pounds) and the weight was properly distributed. The purpose of the flight was to transport Mr. Roach to New York International Airport. The flight reported to Pittsburgh Air Route Traffic Center at 1905 when it was over New Alexandria, Pennsylvania, altitude 7,000 feet. A revised routing clearance to New York International Airport was issued to the flight at 1906 by ARTC to proceed via airways V-35, V-6, V-168, and Blue 18, and to climb to and maintain 9,000 feet. 2 Accordingly, N1245V reported leaving 7,000 and 8,000 feet at 1907 and 1909, respectively. At 1921 the Civil Aeronautics Administration Communications Station at Philipsburg, Pennsylvania, received a call from the flight giving its position as over the Coalport intersection at 1916, estimating Philipsburg at 1930. Philipsburg radio then requested N1245V to change over to the frequency of the New York Air Route Traffic Control Center and this message was acknowledged. This was the last radio contact with the flight. At 1928 Philipsburg radio received a telephone call, from a location 24 miles east of the Coalport intersection and approximately 12 miles south-southwest of the Philipsburg Airport, to the effect that an aircraft, later identified as N1245V, had crashed and was burning in a nearby mountainous wooded area. The Philipsburg 1928 weather sequence was: Ceiling measured 400 feet, overcast; visibility 2 miles; fog; temperature 40; dewpoint 40; wind calm; altimeter 30.04.", "probable_cause": "The Board determines that the probable cause of the accident was the loss of control for reasons unknown resulting in a rapid descent during which structural failure occurred. The following findings were reported:\r\n- Meteorological conditions at the aircraft's cruising altitude were conducive to the formation of carburetor or induction system icing,\r\n- During an uncontrolled descent the aircraft failed structurally as a result of airloads in excess of design strength,\r\n- There was no aircraft or engine fire prior to ground impact."}