{"url": "https://www.baaa-acro.com/crash/crash-airbus-a400m-seville-4-killed", "date": "May 9, 2015 at 1257 LT", "type": "Airbus A400M", "operator": "Airbus%20Industries", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Seville - Seville", "msn": "023", "yom": 2015, "flight_number": "Casa423", "city": "Seville-San Pablo", "zone": "Andalusia", "country": "Spain", "region": "Europe", "crew_on_board": 6, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 0, "circumstances": "Brand new, the aircraft just came out from the manufacturer in Seville and was engaged in its first post assembly test flight. After take off from Seville-San Pablo Airport Runway 09 at 1254LT, the crew completed a 90° turn to the left bound to the north. Shortly later, three of the four engines (engines n°1, 2 and 3) got stuck at high power. The crew attempted to control the power setting to the normal mode but those three engines failed to respond. The crew reduced the engine power after selecting the thrust levers to idle. The regime of those three engines remained blocked in idle so the crew decided to return to the airport for an emergency landing. On approach, the aircraft collided with power lines, stalled and crashed in an open field located 1,6 km north of the airport, bursting into flames. Two crew members were rescued while four others were killed. The aircraft was totally destroyed by a post crash fire. The aircraft was following a test program prior to its delivery to the Turkish Air Force (Türk Hava Kuvvetleri). ", "probable_cause": "An Airbus official after the accident stated that engine control software was incorrectly installed during final assembly of the aircraft. This led to engine failure and the resulting crash."}