{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-f90-king-air-midland", "date": "Dec 2, 2011 at 0810 LT", "type": "Beechcraft 90 King Air", "operator": "Quality Lease Air Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "City", "schedule": "Wharton - Midland", "msn": "LA-2", "yom": 1979, "flight_number": null, "city": "Midland", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4600, "captain_hours_type": 25, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8253, "circumstances": "The aircraft collided with terrain while on an instrument approach to the Midland Airpark (MDD), near Midland, Texas. The commercial pilot, who was the sole occupant, sustained serious injuries. The airplane was registered to and operated by Quality Lease Air Services LLC., under the provisions of 14 Code of Federal Regulations Part 91 as a positioning flight. Instrument meteorological conditions prevailed and an instrument flight rules (IFR) flight plan had been filed for the cross-country flight. The flight originated from the Wharton Regional Airport (ARM), Wharton, Texas, about 0626. The pilot obtained a weather briefing for the flight to MDD. The briefing forecasted light freezing drizzle for the proposed time and route of flight. While on approach to MDD, the airplane was experiencing an accumulation of moderate to severe icing and the pilot stated that he had all the deicing equipment on. According to the pilot, the autopilot was flying the airplane to a navigational fix called JIBEM. He switched the autopilot to heading mode and flew to the final approach fix called WAVOK. He deployed the deice boots twice before approaching WAVOK. An Airport Traffic Control Tower (ATCT) controller informed the pilot, that according to radar, he appeared to be flying to JIBEM. The pilot responded that he was correcting back and there was something wrong with the GPS. The controller canceled the airplane's approach clearance and the controller issued the pilot a turning and climbing clearance to fly for another approach. The pilot stated that his copilot's window iced up at that point. The pilot was vectored for and was cleared for another approach attempt. The pilot said that his window was \"halfway iced up.\" About two minutes after being cleared for the second approach, the controller advised the pilot that the airplane appeared to be \"about a half mile south of the course.\" The pilot responded, \"Yep ya uh I got it.\" The pilot was given heading and climb instructions in case of a missed approach and was subsequently cleared to change to an advisory frequency. The pilot responded with, \"Good day.\" The pilot had configured the aircraft with approach flaps and extended the landing gear prior to reaching the final approach fix. The pilot stated the aircraft remained in this configuration and he did not retract the gear and flaps. The pilot stated that he descended to 3,300 feet and was just under the cloud deck where he was looking for the runway. The pilot's accident report, in part, said: Everything was flying smooth until I accelerated throttles from about halfway to about three quarters. At this point I lost roll control and the airplane rolled approximately 90 degrees to the left. I disengaged autopilot and began to turn the yoke to the right and holding steady. It was slow to respond and when I thought that I had it leveled off the airplane continued to roll approximately 90 degrees to the right. At this time I was turning the yoke back to the left and pulling back to level it off, but it continued to roll to the left again. I was turning the yoke to the right again as I continued to pull back and the airplane rolled level, and the stall warning horn came on seconds before impact on the ground. The pilot stated he maintained a target airspeed speed of 120 knots on approach and 100 knots while on final approach. He stated he was close to 80 knots when the aircraft was in the 90° right bank. Witnesses in the area observed the airplane flying. A witness stated that the airplane's wings were \"rocking.\" Other witnesses indicated that the airplane banked to the left and then nosed down. The airplane impacted a residential house, approximately 1 mile from the approach end of runway 25, and a post crash fire ensued. The pilot was able to exit the airplane and there were no reported ground injuries.", "probable_cause": "The pilot's failure to maintain the recommended airspeed for icing conditions and his subsequent loss of airplane control while flying the airplane under autopilot control in severe\r\nicing conditions, contrary to the airplane's handbook. Contributing to the accident was the pilot's failure to divert from an area of severe icing. Also contributing to the accident was the lack of an advisory for potential hazardous icing conditions over the destination area."}