{"url": "https://www.baaa-acro.com/crash/crash-cessna-402a-miami", "date": "Jun 23, 1995 at 1054 LT", "type": "Cessna 402", "operator": "Air%20Florida%20Express", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Marsh Harbor - Miami", "msn": "402A-0103", "yom": 1969, "flight_number": null, "city": "Miami-Intl", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9800, "captain_hours_type": 7800, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4980, "circumstances": "The aircraft crashed on a visual approach to runway 09 left at Miami International Airport, Miami, Florida. Visual meteorological conditions prevailed and an IFR flight plan was filed. The airplane was destroyed. The airline transport pilot sustained serious injuries. The flight originated from Marsh Harbor, Bahamas, about 1 hour 14 minutes before the accident.  Witnesses stated they observed the airplane descending to the right of the final approach path for runway 09 left with the landing gear down and an engine was heard sputtering. The wings of the airplane were observed to be rocking back and forth. The airplane rolled right 90 degrees. The nose pitched up, the airplane rolled over inverted, the nose pitched down, the airplane collided with a parking lot and slid in between a front end loader and a dump truck coming to a complete stop.  Transcripts of recorded transmissions between Miami Air Traffic Control Tower (ATCT), N7884J, and review of Miami ATCT continuous data recording radar revealed there were no airplanes in the vicinity of N7884J at the time of the accident. ", "probable_cause": "The pilot-in-command's failure to maintain airspeed (VMC) after loss of power of one engine while on final approach, resulting in an in-flight loss of control and subsequent in-flight collision with terrain. Contributing to the accident was a total loss of engine power of the right engine due to fuel exhaustion. "}