{"url": "https://www.baaa-acro.com/crash/ground-fire-boeing-777-266er-cairo", "date": "Jul 29, 2011 at 0911 LT", "type": "Boeing 777-200", "operator": "Egyptair", "flight_phase": "Parking", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cairo - Jeddah", "msn": "28423/71", "yom": 1997, "flight_number": "MS667", "city": "Cairo-Intl", "zone": "Cairo", "country": "Egypt", "region": "Africa", "crew_on_board": 10, "crew_fatalities": 0, "pax_on_board": 307, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16982, "captain_hours_type": 5314, "copilot_hours": 2247, "copilot_hours_type": 198, "aircraft_hours": 48281, "circumstances": "On July 29, 2011, the said Boeing 777-200, Egyptian registration SU-GBP, operated by EgyptAir, arrived from Madina, Saudi Arabia  (Flight No 678) and stopped at Gate F7, terminal 3, Cairo international airport almost at 0500 UTC time. Necessary maintenance actions (After Landing Check ALC, Transit Check) have been performed by EgyptAir engineers and technicians, to prepare the aircraft for the following scheduled flight (Cairo/Jeddah, scheduled at 0730 UTC, same day 29 July 2011, flight number 667). The cockpit crew (Captain and F/O) for the event flight (Cairo/Jeddah), started the cockpit preparation including checking the cockpit crew oxygen system as per normal procedures. The F/O reported that the oxygen pressure was within normal range (730 psi). At almost 0711 UTC, and while waiting for the last passengers to board the aircraft, the F/O officer reported that a pop, hissing sound originating from the right side of his seat was heard, associated with fire and smoke coming from the right side console area below F/O window #3 (right hand lower portion of the cockpit area) [The aircraft was still preparing for departure at Gate F7, Terminal 3 at Cairo Airport at the time the crew detected the fire]. The Captain requested the F/O to leave the cockpit immediately and notify for cockpit fire. The captain used the cockpit fire extinguisher bottle located behind his seat in attempt to fight and extinguish the fire. The attempt was unsuccessful, the fire continued in the cockpit. The F/O left the cockpit, he asked the cabin crew to deplane all the passengers and crew from the aircraft, based on captain’s order. He moved to the stairs and then underneath the aircraft in attempt to find anyone with a radio unit but he could not. He returned to the service road in front of the aircraft and stopped one car and asked the person in the car to notify the fire department that the aircraft is burning on the stand F7 using his radio unit. The cabin crew deplaned the passengers using the two doors 1L and 2L. The passenger bridge was still connected to the entry doors that were used for deplaning. The first fire brigade arrived to the aircraft after three minutes. The fire was extinguished. Extinguishing actions and cooling of the aircraft were terminated at 0845 UTC (1045 Cairo local time). The aircraft experienced major damage resulting from the fire and smoke. Passengers deplaned safely, some (passengers, employees) suffered mild asphyxia caused by smoke inhalation. Passengers and crew were as follows: Passengers 307, Cockpit Crew 2, Cabin Crew 8.", "probable_cause": "Probable causes for the accident can be reached through:\r\n- Accurate and thorough reviewing of the factual information and the analysis sections\r\n- Excluding the irrelevant probable causes included in the analysis section \r\nExamination of the aircraft revealed that the fire originated near the first officer's oxygen mask supply tubing, which is located underneath the side console below the no. 3 right hand flight deck window. Oxygen from the flight crew oxygen system is suspected to have contributed to the fire's intensity and speed. \r\nThe cause of the fire could not be conclusively determined. It is not yet known whether the oxygen system breach occurred first, providing a flammable environment or whether the oxygen system breach occurred as a result of the fire.\r\nAccident could be related to the following probable causes:\r\n1. Electrical fault or short circuit resulted in electrical heating of flexible hoses in the flight crew oxygen system. (Electrical Short Circuits; contact between aircraft wiring and oxygen system components may be possible if multiple wire clamps are missing or fractured or if wires are incorrectly installed).\r\n2. Exposure to Electrical Current"}