{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh60g-gipsy-moth-waipara-1-killed", "date": "Jan 19, 1935 at 1400 LT", "type": "De Havilland DH.60 Moth", "operator": "Canterbury-Aero-Club", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Sockburn – Wellington", "msn": "1806", "yom": 1930, "flight_number": null, "city": "Waipara", "zone": "Canterbury Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane departed Sockburn Aerodrome on a Saturday morning in an intended flight to Wellington. The foggy flying conditions encountered caused the pilot to land at Blenheim to await an improvement in the weather but when, after waiting for the rest of the morning, no improvement looked likely the decision was made to return to Christchurch. The pilot was hugging the coastline in bad visibility and at a low height about seven miles (12 kilometres) north of the Waipara River mouth when he took evasive action as a cliff appeared ahead. In doing so he lost control of the aircraft and it dived into the sea about 250 yards from the rocky coastline. On impact the Moth nosed over and began to sink upside down. The passenger, Cecil Haigh, was able to vacate his cockpit and help the pilot, Richard Roake, out of his. Using the aircraft's tires that been had torn off in the crash as life-buoys, they were able after a struggle to reach the shore. Unfortunately Mr Roake had hit his head on a rock before getting ashore and could proceed no further. Mr Haigh then set off alone in a harrowing trek along the steep and wild coastline to get help. At about 7 p.m., around 5 hours after the crash, Cecil Haigh came to the the homestead of Glenaffric Station, where despite his exhaustion he insisted on accompanying the rescue party that was quickly assembled. The searchers were unable to locate Mr. Roake that night, but in the morning he was found dead. The medical opinion was that he had died as the result of his head injuries.\r\nCrew:\r\nRichard Roake, pilot. †\r\nPassenger:\r\nCecil Haigh.", "probable_cause": null}