{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-99a-airliner-johnstown-12-killed", "date": "Jan 6, 1974 at 1905 LT", "type": "Beechcraft 99 Airliner", "operator": "Air%20East", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pittsburgh - Johnstown", "msn": "U-125", "yom": 1969, "flight_number": "AE317", "city": "Johnstown", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 15, "pax_fatalities": 11, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 6331, "captain_hours_type": 383, "copilot_hours": 1790, "copilot_hours_type": 380, "aircraft_hours": 7503, "circumstances": "Following an uneventful flight from Pittsburgh-International Airport, the crew deliberately started the descent prematurely, causing the aircraft to approach below the minimum published altitude. While descending in marginal weather conditions, the twin engine airplane struck an ILS antenna and crashed few dozen yards short of runway 33 threshold. A pilot and four passengers were seriously injured while 12 other occupants were killed. The aircraft was destroyed. By reason of numerous violations, unsafe practices, policies, and coercing tactics,  Air East has demonstrated that it does not possess the judgement, responsibility or compliance disposition required of a holder of an air taxi commercial operators certificate. Thus, the operator's AOC was revoked on March 7, 1974. ", "probable_cause": "It was determined that the accident was caused by a premature descent below a safe approach slope followed by a stall and loss of aircraft control. The reason for the premature descent could not be determined, but it was probably the result of the combination of the following factors: \r\n- A deliberate descent below the published minimum descent altitude to establish reference with the approach lights and make the landing, \r\n- A visual impairment or an optical illusion created by the runway/approach lighting systems, \r\n- Downdrafts near the approach end of the runway."}