{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-20-dl-eloy", "date": "Jun 12, 1948 at 0105 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "Eagle Air Freight", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Burbank – El Paso", "msn": "9394", "yom": 1943, "flight_number": null, "city": "Eloy", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 1843, "captain_hours_type": 700, "copilot_hours": 1300, "copilot_hours_type": 250, "aircraft_hours": 4823, "circumstances": "At approximately 2235, June 11, 1948, the flight departed from Burbank, California, for Fort Worth, Texas, via El Paso, Texas. Prior to takeoff a VFR2 flight plan was filed, the weather being clear. Only cargo was carried the only persons aboard being the crew, which consisted of John Dobson, pilot, and John Leslie, copilot. After departure from Burbank, the flight proceeded en route to El Paso at the specified flight plan altitude of 9,000 feet. Approximately 15 minutes after takeoff, over the vicinity of Palmdale, California, control of the aircraft was given to the copilot, and the pilot went to sleep. No trouble was experienced until 0048, at which time the copilot observed flames, deep orange in color and extending about two feet rearward, coming from under the cowl flaps around the entire circumference of the left engine. The pilot was awakened by a shout, and he immediately assumed control of the aircraft. In an attempt to control the fire the crew discharged the emergency fire bottle, cut the fuel flow to the engine, and feathered the propeller, however, the fire continued to burn intensely and the propeller did not feather. A descent for an emergency landing was started, during which the color of the flame changed to brilliant white. It appeared to the crew that the nacelle skin and the leading edge of the wing were burning. Three emergency radio transmissions from NC-79042 were intercepted by an Air Force airplane which relayed the message to Tucson Radio at 0056. To correct excessive air speed the crew reduced power to the right engine and raised the nose of the aircraft. Then the cockpit filled with smoke to the extent that the crew were unable to see the instruments. The aircraft vibrated violently, then fell into an uncontrolled spin or spiral. At approximately 4,000 feet smoke cleared from the cockpit and control of the aircraft was regained. During the descent the burning engine had fallen from the wing, and after regaining control, the crew could observe no sign of fire. Since the aircraft seemed to fly satisfactorily, a right turn towards Tucson, approximately 47 miles to the southeast, was made. In the turns however, altitude could not be maintained, and the aircraft became increasingly right-wing heavy. Accordingly it was decided to land at Eloy, Arizona, 45 miles northwest of Tucson which was observed straight ahead. Ground witnesses in Eloy saw the aircraft at a low altitude with fire in the left wing. A crash landing was made in a wheat stubble field one-fourth mile northeast of Eloy and the crew escaped through the cockpit hatch from the burning aircraft.", "probable_cause": "The Board determines that the probable cause of this accident was fire in flight which resulted in the loss of the left engine, and required a crash landing. The cause of the fire has not been determined. Contributing factors were the failure of the pilot to remain fully awake at all times, and failure to follow correct emergency procedures.\r\nThe following factors were considered as contributory:\r\n- Neither the captain nor copilot was familiar with engine fire emergency procedures and failed to follow them in attempting to control the fire,\r\n- The engine fell from the aircraft after fire weakened the supporting structure and this engine to-date has not been found."}