{"url": "https://www.baaa-acro.com/crash/crash-vickers-708-viscount-tramoyes-16-killed", "date": "Aug 12, 1963 at 1419 LT", "type": "Vickers Viscount", "operator": "Air%20Inter", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Lille – Lyon – Nice", "msn": "039", "yom": 1954, "flight_number": "IT2611", "city": "Tramoyes", "zone": "Ain", "country": "France", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 12, "pax_fatalities": 11, "other_fatalities": 1, "total_fatalities": 16, "captain_hours": 7400, "captain_hours_type": 1125, "copilot_hours": 5795, "copilot_hours_type": 462, "aircraft_hours": 12732, "circumstances": "Flight IT 2611 was a scheduled domestic flight from Lille to Nice with an intermediate stop at Lyon. It took off from Lille at 1151 hours GMT, on an IFR flight plan. Estimated flying time between Lille and Lyon was 1 hour 21 min., cruising at flight level 150. Until 1300 hours, when it began its descent, the flight had been normal; at 1309:50, it reported to Marseilles Control that it was above Tramoyes at flight level 40, and was cleared to Lyon Approach, which was contacted at approximately 1310Z. The flight was then in position for a direct approach to runway 17. At this point Lyon Control having a Caravelle ready to take off asked the aircraft to hold momentarily over Tramoyes at flight level 30. After having first agreed, the flight reported that it was in a severe storm and requested permission to descend below flight level 25, at 1313 hours. Lyon then cleared the flight for a straight-in approach to runway 17. This was acknowledged by the aircraft, Subsequent calls from Lyon Control were not replied. The flight was seen by witnesses in the heart of a storm flying very low in an easterly direction around 1320 hours. At 1326 the aircraft was not visible on Satolas Control radar. It was subsequently found that the aircraft had hit trees, the roof of a farmhouse and a telephone pole before crashing into a field, 15 km from Lyon/Bron airport, at an altitude of 300 m (100 metres higher than the airport) at approximately 1319 hours. Four occupants, among them a crew member, were seriously injured while 12 other occupants were killed. Few hours later, three of the survivors died from their injuries and a little girl was the only survivor. In the farmhouse, a boy was seriously injured while a second one was killed. \r\nCrew:\r\nGeorges Valencia, pilot,\r\nGuy Cleret-Langavant, copilot, \r\nChristiane Souleil, stewardess,\r\nLiliane Perois, stewardess.", "probable_cause": "The Board considered: \r\n- that the aircraft would probably have landed safely if it had been able to carry through the approach it had initiated; \r\n- that the accident resulted from the exceptionally bad weather conditions in the area where the aircraft was holding at the request of Lyon Approach. \r\nThe Board did not rule out the possibility of a flash of lightning dazzling the crew and causing temporary blindness or appreciably incapacitating both crew members. "}