{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-100-groton-5-killed", "date": "Feb 10, 1970 at 1837 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Pilgrim%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Groton - New York", "msn": "41", "yom": 1967, "flight_number": "PM203", "city": "Groton", "zone": "Connecticut", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 6335, "captain_hours_type": 2180, "copilot_hours": 991, "copilot_hours_type": 669, "aircraft_hours": 5817, "circumstances": "Pilgrim Flight 203 departed from Groton about 16:21, approximately 15 minutes behind schedule primarily because of ground delays encountered on previous flights which used the aircraft. Shortly after takeoff, Flight 203 reported on course and was instructed to contact the New York Center. Communications were established at 16:27 and the Center cleared the flight to Deer Park via its flight plan route to cross Saybrook at 4,000 feet, and then to climb and maintain 6,000 feet. At 16:33, the New York Center controller recleared the flight to Deer Park, to climb to 9,000 feet, and issued it holding instructions at Deer Park. About 2 minutes later, the controller advised that 7,000 feet was open for the flight, with the possibility of no holding, and he cleared it back to 7,000 feet. The flight reported at 7,000 immediately thereafter. About 16:36, the controller told Pilgrim 203 that if holding were necessary, its expected approach clearance time was 17.06. At 16:47 the crew contacted Kennedy Approach Control and they reported holding at Deer Park at 7,000 feet. About this time, the weather conditions at the Kennedy Airport deteriorated, and some flights which were then making instrument approaches to runway 13L began missing their approaches. Because of this, instrument approaches were changed to runway 22R, which had a better RVR. At 16:55, in connection with the runway change, Pilgrim 203 was recleared to hold in the Medford holding pattern. At 1709, Pilgrim 203 was given an expected approach clearance time of 17:46, which the flight acknowledged. At 17:39, the Kennedy approach controller cleared Pilgrim Flight 203 to descend to 6,000 feet. At 17:42, the crew of Pilgrim 203 radioed: \"Pilgrim 203 request New Haven if we can get there, expedite.\" At 17:48, the flight was cleared to descend to 4,000 feet, and at 1750, it was cleared to Pond Point, which is the final approach fix from which VOR instrument approaches are made to New Haven-Tweed Airport. During the next minute, Pilgrim Flight 203 contacted Westchester Approach Control and asked for the latest Tweed weather. It was advised that the weather was: Scattered clouds 200 feet, estimated ceiling 500 feet broken, 700 feet overcast; visibility 2 miles, rain and fog; altimeter 29.46: wind variable 120° to 040° at 15 knots with gusts to 25 knots. At 17:53, the Westchester approach controller instructed Flight 203, \"Upon reaching Pond Point hold southwest on the 205 radial, right turns, EAC 1815.\" Two minutes later the controller checked the position of the flight and, finding it was suitable for descent, cleared the flight to descend to 3,000 feet. At 17:57, the flight reported at Pond Point and asked if holding were still necessary. The controller advised that it was and repeated the holding instruction. At 18:12, the Westchester approach controller called Flight 203 and advised that, based on a report from the Cessna pilot who just landed, the airport was below minimums. He advised the weather was: Aircraft ceiling 200 feet broken, 500 feet, overcast: visibility 2 miles. He then asked the pilot his intentions. About 18:13, after asking for and being given the Bridgeport weather, which was lower than New Haven, the flight advised it would make the approach. The flight was cleared for the approach and instructed to contact New Haven Tower. This was done, and, at 1814, the flight advised New Haven it was inbound from Pond Point. The controller acknowledged, cleared the flight to land, and repeated the surface wind as variable 120° to 060°, 15 knots with gusts to 25 knots. Shortly before 18:17, Flight 203 reported to New Haven it had missed its approach. The tower controller immediately cleared the flight to the Madison VOR at 2,000 feet and instructed it to contact Westchester Approach Control. At 18:17, the flight asked for the Groton weather. The controller then gave the flight the Groton weather as: Measured ceiling 300 feet overcast; visibility 1-1/2 miles, moderate rain and fog; wind 100° at 15 knots, with gusts to 25 knots; altimeter 29.50. At 18:19, the crew told the controller, \"Westchester, we’d like to ah get direct Groton right now.\" Within the same minute, the controller advised he was getting the clearance. The flight repeated that it had to get direct to Groton and the controller replied he had to coordinate (with New York Center). At 18:20, Flight 203 advised the Westchester controller, \"Ah Westchester, 203 ah we got minimum fuel now, we gotta get to Groton.\" About 18:21, the controller cleared the flight to the Groton VOR via Victor Airway 126 and climb and maintain 3,000 feet. The flight reported it was level at 3,000 feet and asked to be cleared for an approach to Groton direct from Saybrook. The controller advised the flight to contact Quonset Approach Control. At 18:22, Flight 203 called Bradley FSS and advised it could not contact Quonset Approach Control, it was low on fuel, and wanted clearance for an instrument approach direct to Groton from Saybrook. On request, Quonset Approach Control gave this clearance to Bradley FSS and, at 18:23, the latter delivered it to the flight. About 18:24, the captain of Flight 203 called his company radio and said, \"We’re coming home with this... pile of junk. We ain’t got any equipment working.\" He then asked to talk to the chief pilot. The captain asked initially for the Groton weather which was ceiling 300 feet, overcast; visibility 1-1/2 miles, rain and fog Later, he was advised that the ceiling had lowered to 200 feet. The captain said that Kennedy would not accept him because the aircraft transponder was not working. He said he was inbound to Groton on the 270 degree radial of the Groton VOR, flying about 100 feet above the water, and he could see the shoreline. Asked how much fuel he had remaining, the captain answered \"none,\" and added, in essence, that fuel exhaustion could occur at anytime. Shortly thereafter, he radioed that he had lost one engine and was going to try to reach the shore. He then said he had just lost the other engine, could not make the shore, and was going into the water off Harkness Point. This was the last transmission from the aircraft.", "probable_cause": "Fuel exhaustion resulting from inadequate flight preparation and erroneous in-flight decisions by the pilot-in-command."}