{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-salmon-2-killed", "date": "Dec 10, 2007 at 0755 LT", "type": "Beechcraft 200 Super King Air", "operator": "QB%20Corporation", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Salmon - Boise", "msn": "BB-746", "yom": 1981, "flight_number": null, "city": "Salmon", "zone": "Idaho", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 14500, "captain_hours_type": 75, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10885, "circumstances": "The pilot removed the airplane from a hangar that was kept heated to about 60 degrees Fahrenheit, and parked it on the ramp while awaiting the arrival of the passengers. The outside temperature was below freezing, and a steady light to moderate snow was falling. The airplane sat in the aforementioned ambient conditions for at least 45 minutes before the initiation of the takeoff roll. Prior to attempting the takeoff, the pilot did not remove the accumulated snow or the snow that had melted on the warm airframe and then refroze as ice. The surviving passengers said that the takeoff ground run was longer than normal and the airplane lifted off at 100 knots indicated and momentarily touched back down, and then lifted off again. Almost immediately after it lifted off the second time, the airplane rolled into a steep right bank severe enough that the surviving passengers thought that the wing tip might contact the ground. As the pilot continued the takeoff initial climb, the airplane repeatedly rolled rapidly to a steep left and right bank angle several times and did not seem to be climbing. The airplane was also shuddering, and to the passengers it felt like it may have stalled or dropped. The pilot then lowered the nose and appeared to attain level flight. The pilot made a left turn of about 180 degrees to a downwind for the takeoff runway. During this turn the airplane reportedly again rolled to a steeper than normal bank angle, but the pilot successfully recovered. When the pilot initiated a left turn toward the end of the runway, the airplane again began to shake, shudder, and yaw, and started to rapidly lose altitude. Although the pilot appeared to push the throttles full forward soon after initiating the turn, the airplane began to sink at an excessive rate, and continued to do so until it struck a hangar approximately 1,300 feet southwest of the approach end of runway 35. No pre-impact mechanical malfunctions or failures were identified in examinations of the wreckage and engines.", "probable_cause": "An in-flight loss of control due to the pilot's failure to remove ice and snow from the airplane prior to takeoff. Contributing to the accident were the pilot's improper preflight preparation/actions, falling snow, and a low ambient temperature."}