{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-super-cargomaster-reno-1-killed", "date": "Mar 22, 1995 at 0812 LT", "type": "Cessna 208B Grand Caravan", "operator": "Union Flights", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sacramento - Reno", "msn": "208B-0065", "yom": 1987, "flight_number": "UNF9840", "city": "Reno-Tahoe (ex Cannon)", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4388, "captain_hours_type": 200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4959, "circumstances": "Approaching Reno, the pilot received an instrument clearance to perform a Localizer DME-1, Rwy 16R, approach, which the FAA had previously approved for the operator's use. The localizer centerline passed over a 6,161-foot msl mountain, which was depicted on the chart. The pilot was familiar with the area, having transported cargo from Sacramento to Reno for 5 days each week since December, 1994. IMC existed and light snow showers were present. ATC issued the pilot a series of instructions as he was radar vectored toward the final approach fix (FAF), which had a minimum crossing altitude of 6,700 feet msl. The pilot misstated four of the instructions during clearance readbacks and was corrected by ATC each time. Contact with the pilot was lost following issuance of his landing clearance. The airplane impacted the mountainside at an elevation of about 6,050 feet, while tracking inbound near the centerline of the localizer course, about 2.7 nautical miles before reaching the FAF. The airframe, engine, and avionics equipment were examined. No mechanical malfunctions were found.", "probable_cause": "The pilot's failure to comply with published instrument approach procedures by a premature descent below the minimum altitude specified for the approach."}