{"url": "https://www.baaa-acro.com/crash/crash-lockheed-wv-2-super-constellation-kahuku-19-killed", "date": "Dec 23, 1957 at 1600 LT", "type": "Lockheed L-1049 Super Constellation", "operator": "US%20Navy", "flight_phase": "Flight", "flight_type": "Training", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": null, "msn": "4471", "yom": 1957, "flight_number": null, "city": "Kahuku (Oahu Island)", "zone": "Hawaii", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 19, "pax_fatalities": 15, "other_fatalities": 0, "total_fatalities": 19, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Constellation 143197 set out on its flight two days before Christmas with a crew of 23. Commander Guy Howard Jr., executive officer of the squadron was sitting in the copilot seat, to give Commander Frederick Woodward a checkout that would qualify him as a plane commander. For five and a half hours Howard put Woodward through his paces. Then, as the Connie cruised only 1,500 feet above the ocean, Howard called for a new exercise: what would Woodward do if a fire broke out in the forward baggage compartment? Responding correctly, Woodward \"cut\" (disconnected by pulling circuit breakers) some electrical Circuits. But something went wrong. The plane began falling. \"I thought it was a drill\" Navigator Richard Rentschler later told LIFE Correspondent James Goode. \"The next thing I notice was water out the starboard window.\" Seconds later the plane hit the water, broke in two and caught fire. As the plane hit, Rentschler was hurled under the navigator’s table and came out surrounded by flames. He pushed Radioman Franklin Henry Jr. through the escape hatch, then jumped free himself Lt Thomas Kline, pinned under the radar console, was freed by another crewman (Robert O. Clark). \"I jumped through the fire,\" says Kline, and swam under water 50 feet to avoid the flames. Commander Howard escaped from the cockpit. Nineteen crew members were killed and four others were rescued. \r\nSource: \r\nhttp://www.willyvictor.com/History/Accidents/1957/LifeArtcl.htm", "probable_cause": "Mismanagement of the fuel supply system on part of the crew, which caused the simultaneous failure of all four engines in flight. "}