{"url": "https://www.baaa-acro.com/crash/crash-gaf-nomad-n22-franz-josef-glacier-9-killed", "date": "Oct 25, 1993 at 1245 LT", "type": "GAF Nomad N.22", "operator": "Hibiscus Air Services", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Glentanner - Queenstown", "msn": "004", "yom": 1975, "flight_number": "Hibiscus One Mike", "city": "Franz Josef Glacier", "zone": "West Coast Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 902, "captain_hours_type": 15, "copilot_hours": 2477, "copilot_hours_type": 99, "aircraft_hours": 3850, "circumstances": "The aircraft had been chartered to fly a German group to a number of tourist destinations in New Zealand. It had departed from Glentanner on a VFR flight to Queenstown. The flight was to include scenic flying in the Mount Cook region. A 'taxiing' call was received at 1153 hours but later attempts by Christchurch Flight Information to communicate with the aircraft were unsuccessful. Aircraft wreckage, which proved to be that of ZK-NOM, was sighted during the afternoon in a severely crevassed and pinnacled area of Franz Josef Glacier, at an elevation of 4,500 feet amsl. The crew and passengers had all sustained fatal injuries on impact. ", "probable_cause": "The probable cause of this accident was the decision to attempt to climb above the lower region of Franz Josef Glacier which had an average slope steeper than the aircraft could outclimb. A causal factor was the crew's lack of training and experience in mountain flying rendering them vulnerable to visual misperception. Probable contributing factors included a cloud layer limiting the position and altitude at which climb could be commenced and an optimistic assessment of the aircraft's capability and progress during the climb. "}