{"url": "https://www.baaa-acro.com/crash/crash-atr72-202-magong-2-killed", "date": "Dec 21, 2002 at 0152 LT", "type": "ATR72-200", "operator": "TransAsia%20Airways", "flight_phase": "Flight", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Taipei - Macau", "msn": "322", "yom": 1992, "flight_number": "GE791", "city": "Magong", "zone": "Penghu County (澎湖縣)", "country": "Taiwan", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 14247, "captain_hours_type": 10608, "copilot_hours": 4578, "copilot_hours_type": 4271, "aircraft_hours": 19254, "circumstances": "The aircraft departed Taipei-Chiang Kai Shek Airport at 0105LT on a cargo flight to Macau with two pilots on board and a load consisting of leather parts and electronic materials. While cruising at an altitude of 18,000 feet off the Penghu Islands, the crew contacted ATC and was cleared to descend to 16,000 feet due to icing conditions. At 01h52, at an altitude of 17,853 feet, the stall warning sounded and the stick shaker activated. The crew disconnected the autopilot system and elected to maintain control of the airplane. Sixteen seconds later, the aircraft entered an uncontrolled descent and reached the speed of 320 knots with a rate of descent of 603 feet per second (more than 36,000 feet per minute) before crashing in the sea 17 km southwest of the city of Magong. Few debris were found floating on water and both pilots were killed. ", "probable_cause": "The following findings were identified:\r\n1. The accident flight encountered severe icing conditions. The liquid water content and maximum droplet size were beyond the icing certification envelope of FAR/JAR 25 appendix C.\r\n2. TNA's training and rating of aircraft severe icing for this pilots has not been effective and the pilots have not developed a familiarity with the Note, CAUTION and WARNING set forth in Flight Crew Operating Manual and Airplane Flight Manual to adequately perform their duties.\r\n3. After the flight crew detected icing condition and the airframe de-icing system was activated twice, the flight crew did not read the relative Handbook, thereby the procedure was not able to inform the flight crew and to remind them of \"be alert to severe icing detection\".\r\n4. The \"unexpected decrease in speed\" indicated by the airspeed indicator is an indication of severe icing.\r\n5. The flight crew did not respond to the severe Icing conditions with pertinent alertness and situation awareness that the aircraft might have encountered conditions which was \"outside that for which the aircraft was certificated and might seriously degrade the performance and controllability of the aircraft\".\r\n6. The flight crew was too late in detecting the severe icing conditions. After detection, they did not change altitude immediately, nor take other steps required in the Severe Icing Emergency Procedures.\r\n7. The aircraft was in an \"unusual or uncontrolled rolling and pitching\" state, and a stall occurred thereafter.\r\n8. After the aircraft had developed a stall and an abnormal attitude, the recovery maneuvering did not comply with the operating procedures and techniques for Recovery of Unusual Attitudes. The performance and controllability of the aircraft may have been seriously degraded by then. It cannot be confirmed whether the unusual attitudes of the aircraft could have been recovered if the crew's operation had complied with the relevant procedures and techniques.\r\n9. During the first 25 minutes, the extra drag increased about 100 counts, inducing a speed diminishing about 10 knots.\r\n10. During the airframe de-icing system was intermittently switched off, it is highly probable that residual ice covered on the wings of the aircraft.\r\n11. Four minutes prior to autopilot disengaged, the extra drag increased about 500 counts, and airspeed decayed to 158 knots, and lift-drag ratio loss about 64% rapidly.\r\n12. During the 10s before the roll upset, the longitudinal and lateral stability has been modified by the severe ice accumulated on the wings producing the flow separation. Before autopilot disengaged, the aerodynamic of the aircraft (lift/drag) was degraded of about 40%."}