{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-mt-kilimandjaro-1-killed", "date": "Nov 1, 1997 at 1020 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Air Zanzibar", "flight_phase": "Flight", "flight_type": "Ferry", "survivors": "No", "site": "Mountains", "schedule": "Nairobi - Zanzibar", "msn": "31-8052207", "yom": 1980, "flight_number": null, "city": "Mt Kilimanjaro", "zone": "Kilimanjaro Region", "country": "Tanzania", "region": "Africa", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 10000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On 1 November 1997 at 09:46 hours 5H-AZM took off from Nairobi Wilson airport, for a visual flight rules flight to Zanzibar International Airport, Tanzania. It was carrying one pilot and some cargo. There were no passengers. The flight plan indicated that the aircraft had 0330 hours of fuel on departure. The pilot planned' to fly a direct route to Zanzibar with Dar-es-salaam International airport as his alternate aerodrome. After take off from Nairobi Wilson, the flight transited the southern axis lane of the Nairobi control Zone to the zone boundary. The pilot checked the Nairobi zone boundary with Nairobi Wilson Tower and was instructed by air traffic control to contact the Nairobi Control Centre. No contact was reported established by Nairobi Control with 5H-AZM. 5H-AZM contacted the Kilimanjaro Control Tower at 10:20 hours and passed his own ward estimates as Flight Information Region 10:25 hours and arrival at Zanzibar at 11:40 hours. 5H-AZM was advised that there was no reported traffic for the flight in the Kilimanjaro Terminal Control area at 'the VFR flight level 115, and at the same time instructed the aircraft to contact Dar-es-salaam Control on 119.6 MHz when in range. No further transmission was received from the aircraft. It also failed to arrive in Zanzibar. Unfruitful formal searches (involving communications, aerial and ground searches) were mounted on 3 November 1997 along the probable route area in Kenya and Tanzania. The formal search was terminated on 4 December 1997 and there after the missing aircraft incident was considered to be an 'accident. Wreckage was eventually located in the Kibo Crater near the summit of Mount Kilimanjaro in Tanzania on 28 August 2003, almost six years later. The wreckage of the Piper PA 31-350 was found at 15,400 feet on the Kibo wing. It was also 30 nautical miles west of its projected track. The aircraft had earlier been cleared to climb from 9,500 feet to 11,500 feet under visual flight rules.", "probable_cause": "Controlled flight into terrain for unknown reasons. "}