{"url": "https://www.baaa-acro.com/crash/crash-cessna-421a-golden-eagle-i-akron-2-killed", "date": "Dec 25, 2002 at 1006 LT", "type": "Cessna 421A Golden Eagle I", "operator": "Robert A. Rumachik", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Denver - Mitchell", "msn": "421A-0045", "yom": 1967, "flight_number": null, "city": "Akron-Colorado Plains", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1230, "captain_hours_type": 22, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3564, "circumstances": "The pilot reported to Denver Air Route Traffic Control Center (ZDV) that his left engine had an oil leak and he requested to land at the nearest airport. ZDV informed the pilot that Akron (AKO) was the closest airport and subsequently cleared the pilot to AKO. On reporting having the airport in sight ZDV terminated radar service, told the pilot to change to the advisory frequency, and reminded him to close his flight plan. Approximately 17 minutes later, ZDV contacted Denver FSS to inquire if the airplane had landed at AKO. Flight Service had not heard from the pilot, and began a search. Approximately 13 minutes later, the local sheriff found the airplane off of the airport. Witnesses on the ground reported seeing the airplane flying westbound. They then saw the airplane suddenly pitch nose down, \"spiral two times, and crash.\" The airplane exploded on impact and was consumed by fire. An examination of the airplane's left engine showed the number 2 and 3 rods were fractured at the journals. The number 2 and 3 pistons were heavily spalded. The engine case halves were fretted at the seam and through bolts. All 6 cylinders showed fretting between the bases and the case at the connecting bolts. The outside of the engine case showed heat and oil discoloration. The airplane's right engine showed similar fretting at the case halves and cylinder bases, and evidence of oil seepage around the seals. It also showed heat and oil discoloration. An examination of the propellers showed that both propellers were at or near low pitch at the time of the accident. The examination also showed evidence the right propeller was being operated under power at impact, and the left propeller was operating under conditions of low or no power at impact. According to the propeller manufacturer, in a sudden engine seizure event, the propeller is below the propeller lock latch rpm. In this situation, the propeller cannot be feathered. Repair station records showed the airplane had been brought in several times for left engine oil leaks. One record showed a 3/4 inch crack found at one of the case half bolts beneath the induction manifold, was repaired by retorquing the case halves and sealing the seam with an unapproved resin. Records also showed the station washed the engine and cowling as the repair action for another oil leak. ", "probable_cause": "The fractured connecting rods and the pilot not maintaining aircraft control following the engine failure. Factors contributing to the accident were the low altitude, the pilot not maintaining minimum controllable airspeed following the engine failure, the pilot's inability to feather the propeller following the engine failure, oil exhaustion, the seized pistons, and the repair station's improper maintenance on the airplane's engines."}