{"url": "https://www.baaa-acro.com/crash/crash-vickers-815-viscount-karachi-2-killed", "date": "Aug 14, 1959 at 2214 LT", "type": "Vickers Viscount", "operator": "Pakistan%20International%20Airlines-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Karachi - Karachi", "msn": "337", "yom": 1959, "flight_number": null, "city": "Karachi-Muhammad Ali Jinnah-Quaid-e-Azam", "zone": "Sindh (سنڌ سندھ)", "country": "Pakistan", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off from Karachi at 14:30 GMT for a training flight. The aircraft returned to Karachi at 16:39 and took off again at 16:48 for further training. At 17:07 the crew were cleared to land. The aircraft (probably carrying out an ILS approach) was not properly lined up with the runway, so a go around was carried out. On the second time, the Viscount was seen flying very low over the runway with the engines no. 3 and 4 inoperative. During the overshoot, the Viscount yawed almost 90° to starboard, causing the right wing to strike a blast pen wall. The aircraft then crashed in flames. Two crew members were killed while the third occupants was injured. Christened 'City of Dacca', the airplane had been delivered just 5 months prior to the accident.", "probable_cause": "The trainee captain attempted a manoeuvre in disregard of the prescribed limitations of such a manoeuvre. A two-engine overshoot was attempted at a very low height and below the prescribed minimum speed, when the aircraft was committed to a landing. This resulted in a violent yaw and sharp drop which could not be controlled. The training captain was conversant with the minimum requirements of a two-engine overshoot of the Viscount 815 aircraft but appears to have overestimated his performance."}