{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-65-queen-air-meridian", "date": "Jul 17, 1991 at 1702 LT", "type": "Beechcraft 65 Queen Air", "operator": "Jack Marshall Foods", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Meridian – Tuscaloosa", "msn": "LC-139", "yom": 1962, "flight_number": null, "city": "Meridian", "zone": "Mississippi", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 943, "captain_hours_type": 34, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9200, "circumstances": "The pilot reported that shortly after takeoff the aircraft yawed to the right, left then right again. The passenger in the copilot seat stated the right engine rpm gauge indication needle was fluctuating. The pilot positioned the right engine mixture control to idle cutoff and the propeller control to feather. The propeller continued to windmill. Unable to maintain altitude, the  pilot attempted to land on a highway but the aircraft collided with an unmarked power line, light pole, then the ground and was destroyed by a post crash fire. The right engine was recovered and due to impact damage, the propeller and fuel servo were replaced. The engine was placed on a test stand and was started and found to operate normally. The prop governor and damaged fuel servo were tested and found to operate normally. The damaged propeller was inspected and found to be free of preimpact failure or malfunction. No determination could be made as to the reason for the reported power fluctuation from the right engine. A witness stated gear retraction was delayed after takeoff. ", "probable_cause": "Loss of power from the right engine due to undetermined reasons. The failure of the propeller to feather was a factor in the accident."}