{"url": "https://www.baaa-acro.com/crash/crash-boeing-767-2j6er-busan-129-killed", "date": "Apr 15, 2002 at 1121 LT", "type": "Boeing 767-200", "operator": "Air%20China-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Beijing - Busan", "msn": "23308", "yom": 1985, "flight_number": "CA129", "city": "Busan-Gimhae", "zone": "Busan (부산)", "country": "South Korea", "region": "Asia", "crew_on_board": 11, "crew_fatalities": 8, "pax_on_board": 155, "pax_fatalities": 121, "other_fatalities": 0, "total_fatalities": 129, "captain_hours": 6497, "captain_hours_type": 6287, "copilot_hours": 5295, "copilot_hours_type": 1215, "aircraft_hours": 39541, "circumstances": "On April 15, 2002, about 11:21:17, Air China flight 129, a Boeing 767-200ER, operated by Air China International (Air China hereinafter), en route from Beijing, China to Busan, Korea, crashed during a circling approach, on Mt. Dotdae located 4.6 km north of runway 18R threshold at Busan/Gimhae International Airport (Gimhae airport hereinafter), at an elevation of 204 meters. The flight was a regularly scheduled international passenger service flight operating under instrument flight rules (IFR) within Korean airspace, according to the provisions of the Korean Aviation Act and Convention on International Civil Aviation. One captain, one first officer and one second officer, eight flight attendants, and 155 passengers were on board at the time of the accident. The aircraft was completely destroyed by impact forces and a post crash fire. Of the 166 persons on board, 37 persons including the captain and two flight attendants survived, while the remaining 129 occupants including two copilots were killed.", "probable_cause": "3.1 Findings Related to Probable Causes:\r\n1. The flight crew of flight 129 performed the circling approach, not being aware of the weather minima of widebody aircraft (B767-200) for landing, and in the approach briefing, did not include the missed approach, etc., among the items specified in Air China’s operations and training manuals.\r\n2. The flight crew exercised poor crew resource management and lost situational awareness during the circling approach to runway 18R, which led them to fly outside of the circling approach area, delaying the base turn, contrary to the captain’s intention to make a timely base turn.\r\n3. The flight crew did not execute a missed approach when they lost sight of the runway during the circling approach to runway 18R, which led them to strike high terrain (mountain) near the airport.\r\n4. When the first officer advised the captain to execute a missed approach about 5 seconds before impact, the captain did not react, nor did the first officer initiate the missed approach himself. "}