{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-tegucigalpa-4-killed", "date": "Feb 20, 1967 at 0845 LT", "type": "Douglas DC-6", "operator": "SAHSA", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "San Pedro Sula – Tegucigalpa – San Salvador – Guatemala City – Mexico City", "msn": "42894/56", "yom": 1947, "flight_number": "SH203", "city": "Tegucigalpa", "zone": "Francisco Morazán", "country": "Honduras", "region": "Central America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 50, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 13128, "captain_hours_type": 682, "copilot_hours": 5799, "copilot_hours_type": 206, "aircraft_hours": 48871, "circumstances": "Flight 203 was a scheduled domestic flight from La Mesa Airport, Cortis Department, to Toncontín, Tegucigalpa, D.C., with three flight crew members, two stewardesses and fifty passengers on board. The gross weight of the aircraft at take-off was 75 023 lbs. After a routine pre-flight check which did not reveal any abnormality, the aircraft took off from La Mesa at 0815 hours. Its estimated flight time was 32 minutes and the en-route altitude was 7 500 ft. After 23 minutes of flight the aircraft contacted Toncontín control tower over \"El Rancho\" and requested authorization to use frequency 118.1 Mc/s. This was acknowledged by the tower which cleared the aircraft to enter the circuit for a landing on runway 01, the wind being calm. The crew then requested to use runway 19 but the tower refused because there was some traffic on runway 01 and several aircraft were waiting to land on that runway. The landing was initiated, 20° of flaps and the undercarriage were lowered; the pilot reported on base leg and extended the flaps to 300. According to the flight crew the indicated airspeed was 100 kt over the fence located before the threshold of runway 01. The landing was normal and smooth and immediately after the nose-wheel touched down the pilot-in-command called for withdrawal of the safety lock of the propeller reverse system. This was done; however the throttle controls would not shift to the desired position (rearward) to operate the propeller reverse system satisfactorily. Three consecutive attempts were made without success. The pilot evaluated the situation and, since the air- craft had passed the point where a go-around could be attempted, he decided to use the brakes only as they appeared to operate normally at the time. According to some reliable observers (aviation mechanics and tower controllers) one of the aircraft's tires burst approximately halfway down the runway and another tire, possibly on the opposite side, burst 50 m farther down. It was assumed that these tires were the two outermost tires. As the aircraft was nearing the end of the runway, the pilot-in-command became afraid of the pronounced slope ahead and veered to the left to execute a 180° turn (ground loop). The turn was successfully completed; however, due to the aircraft's inertia, the radius of the turn was too wide and the nose-wheel ran into a drainage ditch; the aircraft then skidded, the left undercarriage ran into the same ditch and stayed in it, the nose-wheel broke off, the left wing fuel tanks burst and the propellers of Nos. 1 and 4 engines were damaged. A fire resulting from the intense heat of the brakes and wheels, the spilled fuel and the dry grass immediately broke out and destroyed the aircraft. Four passengers were killed while 51 other occupants were evacuated. The aircraft was destroyed. ", "probable_cause": "According to the reports of the crew, the probable cause of the accident was the failure of the reverse pitch control mechanism. The Board was not able to confirm or deny this because the fire had obliterated all traces of any possible cause. "}