{"url": "https://www.baaa-acro.com/crash/crash-lisunov-li-2-iskra-12-killed", "date": "Mar 25, 1951 at 0442 LT", "type": "Lisunov LI-2", "operator": "Aeroflot-3", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Irkutsk – Chita – Yakutsk", "msn": "184 341 04", "yom": 0, "flight_number": "SU451", "city": "Irkutsk", "zone": "Irkutsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 9, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1026, "circumstances": "The aircraft left Irkutsk Airport at 0431LT in poor weather conditions with an horizontal visibility of 2 km in snow falls, low cloud base, turbulences and icing conditions. After its departure, the airplane failed to follow the prescribed flight path and few minutes later, at an altitude of 1,500 meters, the right engine caught fire. The crew decided to feather the propeller and to return to the airport. Approximately 10 to 15 seconds later, while losing altitude, the aircraft hit tree tops and crashed inverted in a wooded area located 4 km north of the village of Iskra, about 20 km east of Irkutsk. As the aircraft failed to arrive at destination, SAR operations were conducted and the wreckage was found in an isolated area 10 days later, on April 4. A passenger was found seriously injured while 12 other occupants were killed. The aircraft was destroyed. ", "probable_cause": "It was determined that the third cylinder of the right engine failed in flight, causing the engine to catch fire. With one engine inoperative and flying in icing conditions and turbulences, the aircraft was unable to maintain height, hit trees and crashed. The board determined that the following factors were considered as contributory:\n- lack of visibility due to poor weather,\n- icing conditions and turbulences, \n- poor maintenance of the right engine regarding the 50 hours periodic inspection procedure, \n- poor quality of the third cylinder,\n- improper adjustment of the exhaust valve,\n- the pilot-in-command voluntarily modified the crew prior to take-off and requested the presence of a copilot who was not licensed to fly a Lisunov LI-2 but only a Polikarpov PO-2,\n- because of his inexperience on this type of aircraft, the copilot was unable to assist the captain in a complexe flight situation, \n- the crew was tired and intoxicated after consuming alcohols prior to takeoff."}