{"url": "https://www.baaa-acro.com/crash/crash-cessna-340a-council-bluffs-4-killed", "date": "Feb 16, 2007 at 2104 LT", "type": "Cessna 340", "operator": "Color Ink", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Fayetteville – Council Bluffs", "msn": "340A-0335", "yom": 1977, "flight_number": null, "city": "Council Bluffs", "zone": "Iowa", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 3275, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6417, "circumstances": "The flight was on a VHF Omni Range (VOR) instrument approach to the destination airport at the time of the accident. Radar track data indicated that the airplane passed the VOR at 2,800 feet. After passing the VOR, it turned right, becoming established on an approximate 017- degree magnetic course. The published final approach course was 341 degrees. The airplane subsequently entered a left turn, followed immediately by a right turn, until the final radar data point. Altitude returns indicated that the pilot initiated a descent from 2,800 feet upon passing the VOR. The airplane descended through 2,000 feet during the initial right turn, and reached a minimum altitude of 1,400 feet. The altitude associated with the final data point was 1,600 feet. The initial impact point was about 0.18 nautical miles from the final radar data point, at an approximate elevation of 1,235 feet. The minimum descent altitude for the approach procedure was 1,720 feet. Review of weather data indicated the potential for moderate turbulence and low-level wind shear in the vicinity of the accident site. In addition, icing potential data indicated that the pilot likely encountered severe icing conditions during descent and approach. The pilot obtained a preflight weather briefing, during which the briefer advised the pilot of current Airman's Meteorological Information advisories for moderate icing and moderate turbulence along the route of flight. The briefer also provided several pilot reports for icing and turbulence. A postaccident inspection of the airframe and engines did not reveal any anomalies associated with a preimpact failure or malfunction.", "probable_cause": "The pilot's continued flight into adverse weather, and his failure to maintain altitude during the instrument approach. Contributing factors were the presence of severe icing, moderate turbulence, and low-level wind shear."}