{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-500tp-malibu-meridian-white-plains-1-killed", "date": "Jun 13, 2014 at 0808 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Richard Rockefeller", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "City", "schedule": "White Plains - Portland", "msn": "46-97100", "yom": 2001, "flight_number": null, "city": "White Plains-Westchester County", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5100, "captain_hours_type": 134, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1931, "circumstances": "The pilot arrived at the fixed-base operator on the morning of the accident and requested that his airplane be brought outside and prepared for an immediate departure; this occurred 1 hour 15 minutes before his scheduled departure time. Radar data showed that the airplane departed 23 minutes later. According to air traffic control data, shortly thereafter, the ground and departure controllers contacted the tower controller and asked if the airplane had departed yet; the tower controller responded, \"I have no idea. We have zero visibility.\" Weather conditions about the time of the accident included a 200-ft overcast ceiling with about 1/4-mile visibility. Only five radar targets identified as the accident airplane were captured, and all of the targets were located over airport property. The first three radar targets began about midpoint of the 6,500-ft-long runway, and each of these targets was at an altitude of about 60 ft above ground level (agl). The final two targets showed the airplane in a shallow right turn, consistent with the published departure procedure track, at altitudes of 161 and 261 ft agl, respectively. The final radar target was about 1/2 mile from the accident site. Witnesses reported observing the airplane impact trees in a wings-level, slightly right-wing-down attitude at high speed. Examination of the wreckage revealed no preimpact mechanical malfunctions or anomalies of the airplane. The pilot's personal assistant reported that the pilot had an important meeting that required his attendance on the day of the  accident flight. His early arrival to the airport and his request to have the airplane prepared for an immediate departure were actions consistent with self-induced pressure to complete the flight. Due to the poor weather conditions, which were expected to continue or worsen, he likely felt pressure to expedite his departure to ensure he was able to make it to his destination and to attend the meeting. This pressure may have further affected his ability to discern the risk associated with departing in low-visibility and low-ceiling conditions. As noted, the weather conditions were so poor that the local air traffic controller stated that he could not tell whether the airplane had departed. Such weather conditions are highly conducive to the development of spatial disorientation. Further, the altitude profile depicted by the radar data and the airplane's near  wings-level attitude and high speed at impact were consistent with the pilot experiencing a form of spatial disorientation known as \"somatogravic illusion,\" in which the pilot errantly perceives the airplane's acceleration as increasing pitch attitude, and efforts to hold the nose down or arrest the perception of increasing pitch attitude can exacerbate the situation. Such an illusion can be especially difficult to overcome because it typically occurs at low altitudes after takeoff, which provides little time for recognition and subsequent corrective inputs, particularly in very low-visibility conditions.", "probable_cause": "The pilot's failure to maintain a positive climb rate after takeoff due to spatial disorientation (somatogravic illusion). Contributing to the accident was the pilot's self-induced pressure to depart and his decision to depart in low-ceiling and low-visibility conditions.\n"}