{"url": "https://www.baaa-acro.com/crash/crash-learjet-c-21a-alexander-city-8-killed", "date": "Apr 17, 1995 at 1820 LT", "type": "Learjet C-21A", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Randolph – Wright-Patterson – Andrews – Randolph", "msn": "35-583", "yom": 1985, "flight_number": "Kiowa 71", "city": "Alexander City-Thomas C. Russell", "zone": "Alabama", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 6, "pax_fatalities": 6, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 1074, "captain_hours_type": 877, "copilot_hours": 2242, "copilot_hours_type": 547, "aircraft_hours": null, "circumstances": "The C-21A, a USAF designation of the Learjet 35A was assigned to the 332nd Airlift Flight at Randolph AFB, Texas. The aircraft would depart Randolph AFB as flight Kiowa 71 to Wright-Patterson AFB, Andrews AFB and then back to Randolph. The aircraft was landed at Andrews AFB at 10:57. The crew requested a full load of fuel and told Serv-Air maintenance technicians that they had been unable to transfer fuel from the wing tanks to the fuselage tank. A Serv-Air maintenance technician removed the fuel-control panel from the aircraft and replaced the fuselage-tank transfer/fill switch. The maintenance technician told the crew that replacement of the fuselage-tank switch had not corrected the problem and that he was going to try to correct the problem by replacing the fuel-control relay panel. This was a time consuming job. The crew decided to continue back to Randolph without the repairs. The fuselage fuel tank was full and they had not had trouble earlier in the day getting fuel out of the fuselage tank. The aircraft departed from Andrews AFB at 16:38. The aircraft was in cruise flight at FL390 at 17:53 when the crew began to transfer fuel from the fuselage tank to the wing tanks. The crew did not know that the right standby fuel pump was operating and was preventing fuel from being transferred from the fuselage tank to the right wing. Bearings in the right standby pump were in a deteriorated condition and the pump had required higher-than-normal electrical current for rotation. The higher-than-normal electrical current had caused progressive damage to two contacts in the fuel control relay panel and eventually had caused the contacts to bond together. This caused the pump to run continuously throughout the flight and to prevent fuel transfer from the fuselage tank to the right wing. The aircrew noticed that the left wing-tip tank had become 800 pounds [363 kilograms] heavier than the right wing-tip tank during the transfer, and they attempted to analyse the malfunction and correct the imbalance. A fuel-imbalance during-fuel-transfer malfunction however was not included in the Air Force training syllabus, nor was the procedure contained in the C-21A checklist. At 17:56, the copilot told the Atlanta Air Route Traffic Control Center (Atlanta Center) controller, \"Sir, we need to revise our flight plan. We’re having a problem getting some fuel out of one of our wings. Can we get vectors to Maxwell Air Force Base? And we’re going to need to dump fuel for about five minutes.\" The crew at 18:00 began to dump fuel from the left wing-tip tank. However, they still had an imbalance in the wing tanks themselves of about 200 pounds (91 kilograms). At 18:03 the flight was cleared to descend from FL350. The crew then observed that fuel quantity was decreasing rapidly in the right wing tank, that the left wing tank was full and that the left wing-tip tank had begun to fill with fuel. At 18:07, the copilot told the Atlanta Center controller, \"Sir, we’d like to declare an emergency at this time for a fuel problem and, ah, get to Maxwell quick as we can.\" They were cleared direct to Maxwell AFB and cleared to descend to 17,000 feet, and later to 11,000 feet. At 18:15, the copilot told Atlanta Center, \"We need to change the airfield, to get to the closest piece of pavement we can land on.\" The controller said, \"Kiowa 71, we got an airport at 12 o’clock and 12 miles. It’s Alexander City.\" The crew accepted this and began their emergency descent into Alexander City airport. At 18:16 the copilot took over control since the captain did not have the airfield in sight and the copilot did. The aircraft was northeast of the airport at 8,800 feet and was descending at 5,600 feet per minute with the wing-lift spoilers extended when the copilot told Atlanta Center that they were on a left base for the runway. The crew attempted to fly a visual traffic pattern to runway 18 but were in a poor position to complete the approach and landing. They subsequently elected to enter a left downwind leg for runway 36. As airspeed was reduced, aileron authority diminished and, because of the fuel imbalance, the aircraft became difficult to control. The copilot, flying from the right seat, did not have a good view of the runway and asked the aircraft commander for help in positioning the aircraft on downwind and in beginning the turn toward the runway. The captain wanted to get the gear down but the copilot had difficult controlling the plane already: \"Don’t put anything down,\" the copilot said. \"Nothing down, nothing down.\" The aircraft was at 2,030 feet when the gear-warning horn sounded. The captain said, \"Gear down. Gear down.\" The copilot said, \"No. Stand by. Stand by.\" \"Gear down,\" the captain said. \"Gear down, man.\" \"No, not yet, not yet,\" the copilot said. The copilot then asked the aircraft commander to \"push the power up a little bit for me.\" Power was increased and the gear was extended. The aircraft was at about 1,500 feet and was one mile southwest of the runway at 18:19 when the copilot began a left turn. Approximately halfway through the final turn and one mile due south of runway 36, the aircraft abruptly rolled out, flew through the extended runway centerline and continued in an east, northeasterly direction approximately 800 feet above the ground. The copilot had rolled out of the turn to regain lateral control of the aircraft. At this time the right engine was operating at a reduced thrust setting in an attempt to counteract the effects of the fuel imbalance. The captain, to center the ball in the slip indicator, applied pressure on the left rudder, against pressure that was being applied on the right rudder by the copilot. The captain said, \"Step on the rudder. Step on the rudder.\" The copilot said, \"Paul, no. Paul, don’t.\" The application of left rudder caused the aircraft to roll left rapidly. It rolled inverted entered the trees and struck the ground.", "probable_cause": "The investigating officer found that the mechanical malfunction consisted of the right standby [fuel] pump continuing to operate uncommanded after engine start. This malfunction resulted in fuel being pumped into the left wing and prevented fuel from being transferred to the right wing during normal transfer procedures. This condition caused a fuel imbalance. The Air Force, for whatever reason, did not contract for flight-manual updates from Learjet following purchase of the airplane in 1984. The \"fuel imbalance during fuel transfer\" emergency procedure was included in civilian Learjet flight-manual updates published by subsequent to 1984. As a result, the Air Force training syllabus likewise did not include this emergency procedure. Because the crew did not have checklist or flight-manual guidance on this problem, the crew misanalysed the malfunction. They failed to correct the fuel imbalance as a result, allowed their airspeed to become too slow for the aircraft’s configuration when attempting to land and then made control inputs that caused the aircraft to enter a flight regime from which they could not recover."}