{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-centerville-5-killed", "date": "Sep 7, 1998 at 1945 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Destiny Leasing", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Manchester - Griffith", "msn": "46-22006", "yom": 1989, "flight_number": null, "city": "Centerville", "zone": "New York", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 910, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane was on an IFR flight plan, level at 16,000 feet, when radar and radio contact was lost. The tops of the clouds in the area of the accident were reported to be at 18,000 feet. A pilot who was flying in the area of the accident site at the time of the accident stated that the cloud tops of 'the buildups' were from 16,000 to 20,000 feet. The pilot additionally stated that moderate unexpected turbulence was encountered and 'Obviously, the updrafts in the area were very strong.' Satellite imagery data revealed that an east-west cloud band, about 10 miles wide, was located in the area of the accident. The ground track of the airplane was traversing the cloud band during the minutes prior to and around the accident time. The onboard weather radar was found in the off position. According to Advisory Circular -00-6A, 'Do avoid by at least 20 miles any thunderstorm identified as severe or giving an intense radar echo. Do clear the top of a known or suspected severe thunderstorm by at least 1,000 feet altitude for each 10 knots of wind speed at the cloud top.' The airplanes calibrated airspeed (KCAS) was calculated at 141 knots, and the indicated airspeed (KIAS) was 139 knots. According to the POH, the maneuvering speed at gross weight was 135 KCAS and 133 KIAS. ", "probable_cause": "The pilot's inadvertent flight into adverse weather conditions. Factors related to the accident were the pilot's failure to use weather detection equipment and use of airspeeds in excess of limitations. "}