{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e18s-eden-prairie-2-killed", "date": "Aug 12, 2009 at 1145 LT", "type": "Beechcraft E18", "operator": "Wayne R. Monson", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Eden Prairie - Osceola", "msn": "BA-374", "yom": 1958, "flight_number": null, "city": "Eden Prairie", "zone": "Minnesota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1150, "captain_hours_type": 0, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10626, "circumstances": "The pilot purchased the airplane approximately one year prior to the accident with the intention of restoring it for flight. The airplane had not been flown for approximately five years and had been used for spare parts. The pilot was flying the airplane to another airport to pick up passengers prior to returning. The pilot was cleared for takeoff and to circle the airport at 2,500 feet prior to departing the area. Witnesses reported that after taking off the airplane seemed to “wobble” at a slow airspeed in a nose-high attitude and that it never got higher than 500 feet. Some witnesses reported the engine(s) sputtering, and another stated that the airplane was loud and \"didn't sound good,\" although other witnesses reported that the engines sounded normal. One witness reported seeing white smoke coming from the left engine and hearing the engine \"popping\" as the airplane took off. The airplane made three left turns and it appeared as if the pilot was attempting to return to land. Witnesses described the left wing rising prior to the airplane banking hard to the left and the nose dropping straight down. The airplane impacted the ground just northeast of the airport property and a postimpact fire ensued. Flight control continuity was established. The right side of the elevator/tailcone structure exhibited black rub marks and scrapes. Grass and nesting material was found inside the left wing. The left fuel valve was found in the OFF position and the right fuel valve was positioned to the rear auxiliary tank. Neither the fuel crossfeed valve nor the fuel boost pump switch was located. The left engine sustained substantial fire and impact damage. The right engine sustained heavy impact damage. The airplane was last fueled one month prior to the accident with 120 gallons of fuel. About 20 engine test runs in addition to high-speed taxi tests had been conducted since then. A Special Flight Permit had been obtained but had not been signed by the mechanic, who did not know that the pilot was going to fly the airplane on the day of the accident. The pilot reportedly did not have any Beech 18 flight experience.", "probable_cause": "The pilot’s lack of experience flying the accident make and model of airplane, which led to a loss of control while maneuvering to return to the airport. Contributing to the accident was a partial loss of engine power for undetermined reasons."}