{"url": "https://www.baaa-acro.com/crash/crash-pacific-aerospace-pac-750xl-tekin-0", "date": "Jan 26, 2022 at 0943 LT", "type": "PAC 750XL - Pacific Aerospace Corporation", "operator": "Niugini%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kiunga – Oksapmin", "msn": "136", "yom": 2007, "flight_number": null, "city": "Oksapmin (Tekin)", "zone": "Western (Fly)", "country": "Papua New Guinea", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 14129, "captain_hours_type": 3625, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6752, "circumstances": "The airplane was on a VFR charter flight from Kiunga Airport, Western Province to Tekin Airstrip, Sandaun Province, Papua New Guinea. During the landing roll aircraft sustained a left main landing gear assembly collapse and subsequent runway excursion. There were seven persons onboard: one pilot and six passengers. At 09:06, P2-BWC departed Kiunga Airport and arrived at Tekin circuit area at 09:40. The pilot established the aircraft on the final approach profile, he configured the aircraft for landing by fully extending the flaps and maintained an airspeed of about 80 knots (kts). The pilot also stated that he experienced a downdraft prior to touch down. The aircraft landed at 09:43 with an airspeed of 75 knots as recalled by the pilot. The aircraft touched down about 3m short of the airstrip edge boundary. The investigation determined that due to reduced damping effect of the oleo and/or the tyre of the left main landing gear, the landing gear attachment bolts sustained significant impact stress from the landing impact force and snapped, causing the gear assembly to collapse and separate from the aircraft. Subsequently, the left wing abruptly dropped, and the aircraft began veering to the left, towards the eastern edge of the airstrip. The aircraft continued veering to the left and subsequently the left wingtip struck the outer edge of the extended right-hand flap of P2-BWE, a wreckage of the same aircraft type owned and operated by NASL that was involved in a similar accident on 18 January 2022, causing P2-BWC to abruptly veer further left and skid across the airstrip boundary as the nose-wheel and right main wheel bogged into the ground. The pilot immediately shut down the engine and evacuated the passengers with the assistance of one of the Operator’s personnel who was also a passenger on board. There were no reported injuries and the aircraft sustained significant damage. ", "probable_cause": "During the landing at Tekin Airstrip, the pilot encountered downdraft and touchdown about 4 metres short of the designated landing threshold. Due to less damping effect on the oleo or the tyre, the landing impact force could have transferred up through the structure and concurrently causing the left main landing gear to collapse. Subsequently, the left wing abruptly dropped and began veering to the left, towards the eastern edge of the airstrip. The aircraft continued veering to the left and subsequently the left wingtip struck the outer edge of the extended right-side flap of P2-BWE, causing it to abruptly veer further left and skid across the airstrip boundary as the nose-wheel and right main wheel bogged into the ground."}