{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-3-otter-near-schefferville", "date": "Aug 21, 1992 at 0730 LT", "type": "De Havilland DHC-3 Otter", "operator": "Air%20Saguenay", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Schefferville - Desbergères Lake", "msn": "9", "yom": 1953, "flight_number": null, "city": "Schefferville", "zone": "Quebec", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot departed the Air Saguenay base at Squaw Lake, Schefferville in northern Quebec around 07:00 local on a VFR flight to Desbergères Lake, about 210 miles to the northwest. The float-equipped C-FBSF was carrying six passengers and equipment for hunting caribou. Weather conditions deteriorated 30 minutes into the flight. The pilot entered a narrow valley some 50 miles northwest of Schefferville, then realised he could not clear the mountain peaks because of the lower ceiling in that area. When he tried to turn around to the left he flew into a fog bank. On emerging from the fog he saw the aircraft was going to strike the mountain. He raised the nose to minimize the force of the impact and tried to set the Otter down on the mountain side. The floats slid about 150 feet along the rocky surface, then broke off. The engine struck the ground and was torn off. The engine then rolled under the aircraft and came to rest on the right side of the fuselage. The Otter came to rest on the mountainside at an altitude of 2,650 feet. All passengers had been sitting on the right side of the aircraft and the baggage and equipment was stowed on the left side. The pilot and passengers were able to evacuate the Otter and there were no injuries. As they did so the Otter caught fire and burned for 45 minutes, consuming the fuselage. The wings fell to the ground after the wing supports melted. The fire died out after all flammable  material was consumed. When radio contact with the Otter was lost, search aircraft were launched and located the crash site. The occupants were spotted at 11:30 and a rescue helicopter arrived at the site at 14:00 and all were rescued. There was however no rescue for the Otter which had been completely destroyed.\r\nSource: http://www.dhc-3archive.com/DHC-3_9.html", "probable_cause": null}