{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-60a-5-lo-lodestar-gander-3-killed", "date": "May 8, 1942 at 0010 LT", "type": "Lockheed C-60 LodeStar", "operator": "Royal-Canadian-Air-Force-31", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Moncton – Gander", "msn": "18-2377", "yom": 1943, "flight_number": null, "city": "Gander", "zone": "Newfoundland & Labrador", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Lodestar 557 departed Moncton. New Brunswick, at 2345 GMT on 7 May 1943 on a cargo transport flight to Gander. At 0313 GMT the following day, the aircraft contacted the Aerodrome Control Officer at Gander Station to request landing clearance. The aircraft was given landing clearance by P/O Thomas Howard Murray, aerodrome control officer, and was told to check their wheels down. The messages were acknowledged by 557. At this time the ceiling was practically unlimited. The aircraft was heard to pass over Gander airfield shortly thereafter, but the ceiling had unexpectedly fallen to 700 feet. This lowering of the ceiling possibly meant that ice may have formed on the aerials. It is unlikely that icing would have occurred on the wings or engines. This fly over was apparently done on instruments. The Lodestar contacted the Control Officer to indicate they had missed the field and were to try again. The aircraft then acknowledged being given the ceiling height and barometric pressure by the station. At this point, the landing of the aircraft on the control tower side was taken over by the station manager of Trans Canada Airlines (TCA), Mr. Harry Beardsell. The aircraft was carrying cargo and under the operational control of TCA and therefore should be under TVA radio coverage. Instructions were passed to the aircraft by TCA as to the proper landing procedures for Gander, and these were acknowledged. The aircraft broke through the now 600 ft. ceiling, and was advised to circle and approach runway 27 (note, runway 27 is no longer in use at YQX; ourairports.com). At this point, TCA spoke directly to the pilot. According to Beardsell, he advised Svendsen to make one more attempt before proceeding to Sydney where the ceiling was at 1000 ft. and visibility was 3 miles. P/O Murray, who was listening to the communications between the control tower and Lodestar 557 denied that the aircraft was advised of a secondary landing location. According to the radio log, it was actually Lodestar 557 who suggested that it would try for one more landing and if not successful would return to Sydney and TCA seconded the decision. The aircraft approached, but seemed to be lined up with the wrong runway and was advised to circle again and attempt runway 27. P/O Murray believed that the boundary lights were confusing 557, causing it to line up with the wrong runway, so he switched off the lights and informed the aircraft through Beardsell. One the second attempt, the aircraft did not turn enough and was again told that it would probably not make it to the runway and to attempt again. The aircraft was told to make a right turn over the field near the airport, but it could be seen that the aircraft would not make the turn successfully. The pilot was advised to pull up two or three times by TCA, but at this point 557 was in a steep bank and went into a stall, losing altitude until it crashed. One witness saw the aircraft moments before the crash and stated it was flying very low at 200 ft. with engines functioning properly. The crash was indicated by a flash followed by a second, brighter flash, indicating it had crashed and was burning. Fire trucks and ambulances were dispatched to the scene. It crashed at 0340 GMT on 8 May 1943 approximately two miles east of the RCAF Station in Gander. All crew were killed.\nCrew (164th Squadron):\nWo2 H. Svendsen, pilot,\nWo2 C. H. Allen, pilot,\nLac A. G. Sewell, wireless operator.\nSource & photo: \nhttp://www.planecrashgirl.ca/2016/03/17/lodestar-557/", "probable_cause": "The aircraft had been certified as airworthy and in serviceable condition; the pilot, WO2 Svendsen, was fully qualified to fly a Lodestar in all conditions, and had twice flown the same route to Gander on transportation flights. The cause of the crash was determined to be “pilot error, while attempting to get into position to make approach under low ceiling” (Mulvihill 1943). The aircraft slipped or stalled after changing from a left turn to a right turn in an attempt to realign with the runway. Because it was already in low altitude, the slip or stall caused it to strike the trees while trying to recover from the turn. The report recommends safety changes to the airbase. As Lodestar 557 had to make a final attempt because it had aligned with the wrong runway, the report determined that the runway lighting system of the RCAF station in Gander was confusing and should be studied and improved."}