{"url": "https://www.baaa-acro.com/crash/crash-cessna-525-citationjet-cj1-near-buda-1-killed", "date": "Mar 26, 2000 at 0840 LT", "type": "Cessna 525 CitationJet CJ1", "operator": "Mike G. Rutherford", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Houston - Rutherford Ranch", "msn": "525-0097", "yom": 1995, "flight_number": null, "city": "Rutherford Ranch (Buda)", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5887, "captain_hours_type": 154, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 720, "circumstances": "The flight was approaching a private airport (elevation 983 feet msl), that did not have an instrument approach system, during instrument meteorological conditions. The pilot informed the air traffic controller that he had the airport in sight, and cancelled his instrument flight plan. The twin turbofan airplane impacted a tree approximately 4,000 feet northeast of the airport in an upright position. The airplane then impacted the ground in an inverted position approximately 200 yards from the initial impact with the tree. The weather observation facility located 16 miles northeast of the accident site was reporting an overcast ceiling at 400 feet agl, and visibility 4 statute miles in mist. The weather observation facility elevation was 541 feet msl. Local residents in the vicinity of the accident site stated that there was heavy fog and drizzle at the time of the accident. The pilot had filed an alternate airport (with a precision instrument approach); however, he elected not to divert to the alternate airport. Examination of the wreckage did not reveal any evidence of pre-impact anomalies that would have prevented operation of the airplane. ", "probable_cause": "The pilot's inadequate in-flight decision to continue a visual approach in instrument meteorological conditions which resulted in his failure to maintain terrain clearance. Contributing factors were the fog, drizzle, and low ceilings. "}