{"url": "https://www.baaa-acro.com/crash/crash-pac-fletcher-fu-24-954-near-riversdale-1-killed", "date": "Mar 27, 1999 at 1435 LT", "type": "Fletcher FU-24", "operator": "Fieldair", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Riversdale - Riversdale", "msn": "276", "yom": 1980, "flight_number": null, "city": "Riversdale", "zone": "Southland Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 8175, "captain_hours_type": 4500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8837, "circumstances": "After completing the first run at the heavier weight, the pilot of ZK-EMV indicated to the loader driver that the load be increased by an additional hundredweight after the next run. The pilot of the second aircraft remained at 22 hundredweight, though he had moved his loading point back a short distance to provide additional take-off distance. The second pilot was still encountering “some sink” after take off, coinciding with the raising of flap. On completion of the second run at 22 hundredweight, the pilot of ZK-EMV positioned the aircraft for loading about 25 m to the east of his previous loading point. ZK-EMV was regarded by some personnel in the company to have had slightly better performance than other similar model aircraft. Consequently the increase to 23 hundredweight, while of interest, did not raise any concerns by the loader driver. Despite being unable to observe the departure of ZK-EMV, the loader driver was still able to hear the aircraft’s engine noise and recalled nothing unusual as the aircraft departed after loading. On returning from his run, the pilot of the second aircraft saw ZK-EMV to his lower right, in a steep climb, estimated to be about 45 to 50°. As it continued to climb the aircraft rolled slowly to the left, peaking at a height equivalent to “3 times power pole height”. Objects were seen falling from the aircraft during this time. Once inverted the aircraft descended rapidly, striking the ground. The aircraft hit the ground approximately 350 m from the strip, near where the power lines crossed a bend in the road and a small intersection. The pilot of the second aircraft landed and informed the two loader drivers. Together the group headed for the accident site in the loader truck. While en route a member of the group alerted emergency services by the use of a cellular telephone. The accident was also observed by the driver of a truck who had recently deposited a load of fertiliser in the bin at the airstrip. The driver had stopped the truck on a narrow gravel road below the airstrip to check the tailgate of the trailer. He then heard an aircraft begin its take-off run and decided to stay and watch the departure as the aircraft would fly over the road close to where the truck was parked. The driver saw ZK-EMV leave the end of the strip and “sag down a long way”, appearing to “drop like a stone”. The aircraft was observed to be in a high nose or climbing attitude as it continued to descend in a slight left turn towards a fence next to the road. The aircraft was then seen to strike the fence and balloon up, dropping fertiliser as it climbed. The aircraft then rolled left and descended in the direction of the truck driver, who quickly sought cover underneath the trailer. The aircraft struck the ground in a paddock next to the road, stopping about 5 m from the truck. With 15 years of working near agricultural aircraft, the truck driver considered himself to be familiar with their operations. The driver observed no items falling from the aircraft before it struck the fence, or anything hit the aircraft. He considered the engine to be at “full song” or maximum power the whole time and heard no change in pitch or beat. After the accident the truck driver went quickly to the upturned aircraft and attempted unsuccessfully to locate the pilot. The driver then headed for the airstrip in the truck, meeting the loader drivers and second pilot on their way to the aircraft. On reaching ZK-EMV the bucket on the loader was used to lift the aircraft to gain access to the cockpit. However, no assistance could be given to the pilot who had died on impact.", "probable_cause": "The following findings were identified:\r\n- The pilot was appropriately licensed, rated and experienced for the agricultural operation.\r\n- The aircraft had a valid Certificate of Airworthiness and its records indicated that it had been maintained correctly.\r\n- There was no evidence of any malfunction with the aircraft.\r\n- The topography of the area should have presented no unusual problems for the pilot.\r\n- The weather conditions at the time were suitable for sowing.\r\n- A light tailwind component degraded the take-off and departure performance of the aircraft.\r\n- Any ground effect benefits would have been lost immediately after take-off.\r\n- The pilot was unable to establish a positive climb gradient after take-off.\r\n- The aircraft was probably overweight for the prevailing variable weather conditions at the time of the last take-off.\r\n- The pilot’s jettisoning of the load was too late to prevent the aircraft from striking the fence.\r\n- As a result of striking the fence, the aircraft became uncontrollable. "}