{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-60-aerostar-ted-smith-602p-frenchtown-1-killed", "date": "Dec 21, 1989 at 1035 LT", "type": "Piper PA-60 Aerostar (Ted Smith 600)", "operator": "Walter V. Wicker Jr.", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Teterboro – Reading", "msn": "62-0909-8165036", "yom": 1981, "flight_number": null, "city": "Frenchtown", "zone": "New Jersey", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2061, "captain_hours_type": 312, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On January 16, 1989, Machen nacelle mounted induction air intercoolers were installed on N6894Y. On December 14, 1989, an annual inspection was performed, and a Machen superstar i-680 kit was installed. On December 21, 1989, N6894Y was at 6,000 feet when the pilot reported a problem with the right engine. The pilot reported a fire in the right engine. A couple of minutes later, he radioed he could not shut down the right engine. At 1034:37 the pilot advised his 'right engine just tore off' and that he was 'in a spin heading down.' The exhaust tailpipe of the left turbocharger on the right engine was found to have separated. Metallurgical examination revealed the tailpipe failed due to fatigue cracking. Records showed that part I of piper service bulletin 920 (engine tailpipe inspection) had been completed, while part II (addition of fire detection system) had not been accomplished due to the lack of available kits. The pilot, sole on board, was killed. ", "probable_cause": "The inadequate maintenance and inspection of the turbocharger tailpipe exhaust stack on the right engine by the mechanic(s). The failure of the tailpipe permitted heat from the exhaust to weaken the main spar of the right wing resulting in a catastrophic failure."}