{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-sydney-13-killed", "date": "Feb 21, 1980 at 1909 LT", "type": "Beechcraft 200 Super King Air", "operator": "Advance%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sydney – Temora – Condobolin", "msn": "BB-245", "yom": 1977, "flight_number": "DR4210", "city": "Sydney-Kingsford Smith", "zone": "New South Wales", "country": "Australia", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 13, "captain_hours": 6384, "captain_hours_type": 448, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5061, "circumstances": "The aircraft was engaged in a scheduled service, designated Flight DR 4210, from Sydney to Temora and Condobolin, within the State of New South Wales. The scheduled departure time was 1845 hours. At 1844 hours the pilot of VH-AAV contacted Sydney Airport Clearance Delivery by radio and requested his airways clearance. The airways clearance issued was a Standard Instrument Departure (SID), titled '25 Katoomba Two'. That SID specified that radar headings would be assigned after take-off from Runway 25. The pilot correctly acknowledged the airways clearance. At 1848 hours the pilot contacted Sydney Ground Control and requested clearance to· taxi. This was granted and the aircraft was taxied to the holding point for Runway 25. The pilot reported to Sydney Aerodrome Control at 1858 hours that he was ready for take-off. Due to other traffic. the aircraft was not cleared to line up until 1906 hours. VH-AAV then entered Runway 25 and stopped about 50 metres from the threshold. At 1907 hours VH-AAV was cleared to 'maintain runway heading, maintain 3000 (feet), clear for take-off. This was correctly acknowledged and VH-AAV commenced takeoff. The aircraft became airborne and crossed the intersection with Runway 16/34, at a height of about 100 feet above ground level (AGL) at 1908:19 hours. The landing gear was retracted. Observers then noted the aircraft level off at about 150 feet AGL and commence a shallow banked turn to the left. As this was contrary to the departure instructions, Aerodrome Control was about to query the pilot when, at 1908:33 hours. he advised: ' ... we've lost er, the left engine. Request landing, ah, landing on runway three four immediately please.' This was acknowledged and Aerodrome Control cleared VH-AAV for a visual approach to a left base for Runway 34. During these transmissions, VH-AAV continued its left turn through approximately 90 degrees, onto a southerly heading. It had maintained a height of about 150 feet AGL and the left propeller was probably in the process of feathering. At 1908:44 hours, Aerodrome Control queried' ... do you have the seven two seven in sight on short final.' At 1908:49 hours, the pilot of VH-AAV replied, 'Affirmative'. The other aircraft referred to by Aerodrome Control was an Ansett Airlines of Australia Boeing 727, VH-RMO, which was on approach for Runway 34. Shortly after passing over the shore of Botany Bay, VH-AAV entered a steady descent and then levelled off just above the water. The left turn was continued and the aircraft converged towards the western side of the sea wall enclosing the extension of Runway 16/34. At 1908:50 hours, Aerodrome Control asked,' ... will your approach and landing be normal.' The reply, eight seconds later, was 'Alpha Alpha Victor negative'. At 1909:08 hours, Aerodrome Control activated the crash alarm system. In addition, VH-RMO was directed' ... go around, correction, st ... stay on the runway and expedite. We have a landing, er, right behind you ... one engine out.' The initial direction was made prior to visually assessing the Boeing ?27's situation, but when, during the transmission, it was noted that the aircraft was on the ground and well established in its landing roll sequence, the 'expedite' instruction was substituted. At 1909:20 hours, Aerodrome Control cleared VH-AAV to land. This was not acknowledged. The final segment of the flight was at an extremely low altitude and in a nose-high attitude. The right propeller, on at least one occasion, probably contacted the water and the tail either furrowed the water or induced a wake. VH-AAV struck the sea wall in a nose-up attitude, banking to the left and skidding to the right. The left wing of the aircraft disintegrated. The resultant fuel spillage ignited and a 'fire ball' explosion occurred. The right engine and the outboard section or the right wing both separated and were thrown across the ground adjacent to the runway. The remainder of the aircraft bounced over the sea wall, landed inverted on a taxiway and slid backwards. The accident occurred in daylight at 1909:22 hours. The aircraft was totally destroyed by impact forces and a post crash fire and all 13 occupants were killed.", "probable_cause": "The cause of the accident has not been determined, but the most likely explanation is that the aircraft was operated in a reduced power configuration which, under the prevailing conditions, rendered its single-engine performance critical in respect to aircraft handling. The following findings were reported:\r\n- At a height of about 100 feet AGL the left engine failed, probably due to the ingestion of water-contaminated fuel,\r\n-  The source of water contamination of the left fuel system of VH-AAV was not established but elemental analyses indicated the water had been present in the fuel system for some time,\r\n- It could\r\nnot be determined where the water in the left fuel system of VH-AAV had accumulated or by what means it traveled to the left engine,\r\n- It was not established whether or not the pilot had carried out a fuel drain check prior to the accident flight,\r\n- At the time of engine failure, a high cockpit workload situation existed. "}