{"url": "https://www.baaa-acro.com/crash/crash-rockwell-sabreliner-65-las-vegas", "date": "Jul 5, 2013 at 1845 LT", "type": "Rockwell Sabreliner 65", "operator": "EseAsa%20Construcciones", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Brownsville – Las Vegas", "msn": "465-55", "yom": 1981, "flight_number": null, "city": "Las Vegas-McCarran", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 4, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7400, "captain_hours_type": 2100, "copilot_hours": 1939, "copilot_hours_type": 788, "aircraft_hours": 9940, "circumstances": "The pilots reported that, during the approach, the main hydraulic system lost pressure. They selected the auxiliary hydraulic system \"on,\" continued the approach, and extended the landing gear using the emergency landing gear extension procedures. During the landing roll, about two-thirds down the runway, the pilots noticed that the brakes were not working normally and then turned onto a taxiway to clear the runway. The captain reported that, once on the taxiway, he was unable to stop or steer the airplane as it proceeded across a parallel runway and into an adjacent field where it subsequently struck a metal beam. A postaccident examination of the airplane revealed brake system continuity with the cockpit controls. The tires, brake assemblies, and brake pads were intact and undamaged. The hydraulic lines from the hydraulic pump to the wheel brakes were intact. No hydraulic fluid was observed leaking on the exterior or interior portions of the airplane. The hydraulic fluid reservoir was found about 1/4 full. Further, testing of the two hydraulic pumps revealed that they were both functional, and no mechanical failures or anomalies that would have precluded normal operation were noted. The airplane's hydraulic system failure emergency procedures state that, if hydraulic pressure is lost, the electrically driven hydraulic pump should be reset and that, if the hydraulic pressure was not restored, that the primary hydraulic system should be disengaged and the landing gear should be lowered using the emergency landing gear extension procedures. After the gear is extended, the auxiliary hydraulic system should be selected \"on\" for landing. However, the pilots stated that they did not attempt to reset the electric hydraulic pump and that they performed the emergency landing gear extension procedures with the auxiliary hydraulic pump engaged. It is likely that the pilots' failure to select the auxiliary hydraulic system \"off\" before extending the landing gear caused the hydraulic pressure in the auxiliary system to dissipate, which left only the emergency brake accumulator available for braking  during the landing. The number of emergency brake applications that can be made by the pilots depends on the accumulator charge, which may be depleted in a very short time. The airplane's emergency braking procedures state that, as soon as the airplane is safely stopped, the pilots should request towing assistance. However, the pilots did not stop the airplane on the runway despite having about 3,900 ft of runway remaining; instead, they turned off the runway at an intersection, which resulted in a loss of directional control.", "probable_cause": "The pilots' failure to follow the airplane manufacturer's emergency procedures for a hydraulic system failure and emergency braking, which resulted in the loss of braking action upon landing and the subsequent loss of directional control while turning off the runway. Contributing to the accident was the loss of hydraulic pressure for reasons that could not be determined because postaccident testing and examination of the hydraulic system revealed no mechanical failures or anomalies that would have precluded normal operation."}