{"url": "https://www.baaa-acro.com/crash/crash-sud-est-aviation-se-210-caravelle-vi-n-near-tetouan-106-killed", "date": "Dec 22, 1973 at 2210 LT", "type": "Sud-Aviation SE-210 Caravelle", "operator": "Sobelair", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Paris - Tangier - Casablanca", "msn": "69", "yom": 1961, "flight_number": null, "city": "Tétouan", "zone": "Tangier-Tétouan", "country": "Morocco", "region": "Africa", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 98, "pax_fatalities": 98, "other_fatalities": 0, "total_fatalities": 106, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane, leased by Sobelair to Royal Air Maroc, was completing a charter flight from Paris to Casablanca with an intermediate stop in Tangier. While descending to Tangier-Boukhalef Airport by night and poor weather conditions, the crew completed a circuit too far to the east when, at an altitude of 2,300 feet, the airplane struck the slope of Mt Mellaline located about 17 km northwest of Tétouan. The wreckage was found a day later and all 106 occupants have been killed. Most of them were Moroccan citizen flying back home for the end of year celebrations. At the time of the accident, weather conditions were poor with thunderstorm activity and a visibility below minimums. ", "probable_cause": "For unknown reason, the crew extended the outbound procedure turn for runway 28 too far to the east, causing the airplane to descend over mountainous terrain. Due to lack of visibility (below minimums), the crew was unable to see and avoid the mountain. At the time of the accident, weather conditions were poor with thunderstorm activity and the assumption that the flight crew was misled by a possible malfunction of flight instruments whose parameters may have been altered by the presence of static electricity was not ruled out. \n\n"}