{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-640-kafountine-31-killed", "date": "Feb 9, 1992 at 0515 LT", "type": "Convair CV-640", "operator": "Gambcrest", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Dakar - Cap Skirring", "msn": "9", "yom": 1966, "flight_number": null, "city": "Kafountine", "zone": "Ziguinchor Region", "country": "Senegal", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 53, "pax_fatalities": 25, "other_fatalities": 0, "total_fatalities": 31, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was completing a charter flight from Dakar to Cap Skirring on behalf of the Club Mediterranée, carrying 53 tourists from France, Belgium and Switzerland and six crew members. By night, the crew started the descent prematurely when the aircraft struck trees and crashed in a swampy area located south of Kafountine, about 52 km north of Cap Skirring Airport runway 14. The aircraft was destroyed and 31 occupants were killed, among them all six crew members. At the time of the accident, weather conditions were good. Built in 1952, the aircraft  was owned by a Gambian company near bankrupt and insurance bills have not been paid. Among the crew were one Russian stewardess, an American captain aged 67 and a Norwegian copilot aged 31. The were not familiar with the region and the aircraft was not maintain according to published procedures as at least 16 instruments were out of order at the time of the accident, among them one altimeter. The aircraft was operated illegally under the registration of its ex operator as the Gambian owner company failed to proceed to the official deregistration / re-registration of the aircraft. Thus the aircraft was not compliant with regulations in force. ", "probable_cause": "By night, the crew mistook the blue lights of an hotel for the approach lights of Cap Skirring Airport and initiated the approach and landing when the aircraft crashed 52 km north of the intended destination. The following contributing factors were reported: \r\n- Poor flight planning, \r\n- Poor planned approach, \r\n- Poor crew coordination, \r\n- The crew was not familiar with the area, \r\n- Poor general state of the aircraft. "}