{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-lake-wicksteed", "date": "Jun 5, 2003 at 1800 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Ontario%20Ministry%20of%20Natural%20Resources", "flight_phase": "Landing (descent or approach)", "flight_type": "Fire fighting", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": null, "msn": "750", "yom": 1981, "flight_number": null, "city": "Lake Wicksteed", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 22000, "captain_hours_type": 8500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft with a single pilot on board was performing firefighting operations in the vicinity of Lake Wicksteed, approximately 10 nautical miles north of Hornepayne, Ontario. The aircraft was scooping water from Lake Wicksteed for the nearby fire. The lake is approximately 7300 feet in length with gentle rising terrain along its shoreline. This was the third scooping from the lake, and the approach was flown in an easterly direction in light wind conditions. The pilot performed the inbound checks, lowered the water probes to begin filling the float water tanks, and touched down on the lake. Within a short time, he observed water spraying from the overflow vents located on top of the floats, indicating that the tanks were filled to capacity. He pressed a button on the yoke to retract the probes, and the aircraft immediately nosed over into the lake in a wings-level attitude and began to sink. The accident occurred at approximately 1800 eastern daylight time. The pilot extricated himself from the aircraft and held on to the side of the partially submerged aircraft. A witness to the occurrence immediately boarded a powered, aluminum boat and went to assist the pilot, while a second witness travelled to Hornepayne to notify the authorities and emergency services. Once the pilot reached the shore, he was taken to a nearby cottage where he remained until emergency services arrived. The aircraft came to rest on the bottom of the shallow lake in an inverted attitude with the floats above the surface of the water.", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. Ministry of Natural Resources DHC-6 SOPs were not followed, and the Vital Action checklist was not fully completed during the approach. As a result, the bomb door armed switch on the centre panel was not selected Off after the previous water bombing run and prior to the scooping operation.\r\n2. After completing the water scooping operation, the pilot unintentionally selected the bomb door push button switch instead of the adjacent probe switch. Because the bomb door armed switch on the centre panel was left On, the bomb doors extended into the water. Drag from the doors and the water rushing into the door openings resulted in the aircraft nosing over in the water.\r\n3. The hinged cover plate for the bomb door push button switch was not re-installed following maintenance to replace the push button switch. The push button was exposed, making an inadvertent selection more likely."}