{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-clonbullogue-2-killed", "date": "May 13, 2018 at 1438 LT", "type": "Cessna 208B Grand Caravan", "operator": "Irish%20Parachute%20Club", "flight_phase": "Landing (descent or approach)", "flight_type": "Skydiving / Paratroopers", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Clonbullogue - Clonbullogue", "msn": "208B-1146", "yom": 2005, "flight_number": null, "city": "Clonbullogue", "zone": "Leinster", "country": "Ireland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2157, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4670, "circumstances": "The Cessna 208B aircraft took off from Runway 27 at Clonbullogue Airfield (EICL), Co. Offaly at approximately 13.14 hrs. On board were the Pilot and a Passenger (a child), who were seated in the cockpit, and 16 skydivers, who occupied the main cabin. The skydivers jumped from the aircraft, as planned, when the aircraft was overhead EICL at an altitude of approximately 13,000 feet. When the aircraft was returning to the airfield, the Pilot advised by radio that he was on ‘left base’ (the flight leg which precedes the approach leg and which is normally approximately perpendicular to the extended centreline of the runway). No further radio transmissions were received. A short while later, it was established that the aircraft had impacted nose-down into a forested peat bog at Ballaghassan, Co. Offaly, approximately 2.5 nautical miles (4.6 kilometres) to the north-west of EICL. The aircraft was destroyed. There was no fire. The Pilot and Passenger were fatally injured.", "probable_cause": "Impact with terrain following a loss of control in a steeply banked left-hand turn. The following contributing factors were reported:\r\n- The steeply banked nature of the turn being performed,\r\n- Propeller torque reaction following a rapid and large increase in engine torque,\r\n- The aircraft’s speed while manoeuvring during the steeply banked turn,\r\n- Insufficient height above ground to effect a successful recovery."}