{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-san-antonio-5-killed", "date": "Nov 14, 2004 at 1718 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Dash Air Charter", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dodge City – San Antonio", "msn": "31-8152003", "yom": 1981, "flight_number": null, "city": "San Antonio", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 8590, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2248, "circumstances": "The twin-engine airplane collided with a residential structure and terrain following a loss of control after the pilot experienced difficulties maintaining course during an Instrument Landing System (ILS) approach while on instrument meteorological conditions. The impact occurred approximately 3.7 miles short of the approach end of the runway. Radar data depicted that after the 8,700-hour commercial pilot was vectored to the ILS Runway 3 approach, the airplane remained left throughout the approach before turning right of the localizer approximately 2 miles before the final approach fix (FAF). Radar then showed the aircraft turn to the left of course line. When the aircraft was abeam the FAF, it was approximately 1 mile left of the course line. As the aircraft closed to approximately 1.5 miles from the runway threshold, the aircraft had veered about 1.3 miles left of the course line (at which time air traffic control instructed the pilot to turn left to a heading of 270 degrees). The aircraft continued to turn left through the assigned heading and appeared to be heading back to the ILS course line. According to the radar, another aircraft was inbound on the ILS course line and Air Traffic Control Tower (ATCT) instructed the pilot to turn left immediately. Thereafter, the aircraft went below radar coverage. A witness, located approximately 1.25 miles northwest of the accident site, reported that he heard a very loud noise, and then observed an airplane flying toward a building, approximately 60 feet in height. The airplane was observed to have pitched-up approximately 45 - 90 degrees just before the building and disappeared into the clouds. A second witness located approximately 1 mile northwest of the accident site reported that he heard a low flying aircraft, and then observed a white twin engine airplane banking left out of the clouds. The airplane leveled out, and flew into the clouds again a few seconds later. The witness stated that the airplane was at an altitude of 100- 200 feet above the ground. A third witness located adjacent to the accident site reported that they heard the sound of a low flying airplane in the distance. As the sound became louder and louder, they looked up and observed the airplane in a near vertical attitude as it impacted trees and the side of an apartment complex. Examination of the airplane did not reveal any preimpact mechanical anomalies. A weather observation taken approximately 15 minutes after the accident included a visibility 4 status miles, light drizzle and mist, and an overcast ceiling at 400 feet.", "probable_cause": "The pilot's failure to maintain control during an ILS approach. Contributing factors were the prevailing instrument meteorological conditions( clouds, low ceiling and drizzle/mist), and the pilot's spatial disorientation."}