{"url": "https://www.baaa-acro.com/crash/crash-learjet-60-aspen", "date": "Jun 7, 2012 at 1224 LT", "type": "Learjet 60", "operator": "Performance Aircraft Leasing", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Miami-Opa Locka - Aspen", "msn": "60-017", "yom": 1993, "flight_number": null, "city": "Aspen-Pitkin County-Sardy Field", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 18000, "captain_hours_type": 600, "copilot_hours": 13500, "copilot_hours_type": null, "aircraft_hours": 6456, "circumstances": "While the first officer was flying the airplane on a visual approach to the airport located in a steep mountain valley, the tower controller informed him that the pilot of a Citation that had landed about 10 minutes earlier had reported low-level windshear with a 15-knot loss of airspeed on short final. The first officer used the spoilers while on the left base leg and then maneuvered the airplane in an \"S-turn\" on the final leg to correct for a too-steep approach. Just as the airplane was about to touch down with the airspeed decreasing, the captain made several calls for \"power\" and then called for a \"go around.\" However, the first officer did not add power for a go-around, and the captain did not take control of the airplane. Both pilots reported that, when the airplane was about 30 ft above ground level (agl), they felt a sensation that the airplane had \"stopped flying\" with a simultaneous left roll, which is indicative of an aerodynamic stall, followed by an immediate impact with terrain. After striking obstructions that completely separated the right main landing gear and the right flap, the airplane came to rest upright in the dirt on the side of the runway about 4,000 ft from the initial impact point. The airplane sustained substantial damage to the fuselage and both wings. All eight occupants evacuated through the main cabin door. There was a substantial fuel spill but no postimpact fire. Both pilots reported no mechanical malfunctions or failures of the airplane, and neither pilot reported an uncommanded loss of engine power. Data from the enhanced ground proximity warning system showed that seven warning events occurred in the last 3 minutes before the accident. The first warning was for \"sink rate,\" and it occurred when the airplane was about 1,317 ft agl and in a 3,400-ft-per-minute descent. The last warning was for \"bank angle,\" and it occurred about 10 seconds before touchdown as the airplane exceeded 42 degrees of bank when it was about 200 ft agl. The wind recorded at the airport at the time of the accident would have resulted in a 12-knot variable tailwind with gusts to 18 knots. The evidence is consistent with the first officer flying a non stabilized approach with a decreasing airspeed during low-level windshear conditions. The first officer did not properly compensate for the known low-level windshear conditions and allowed the airspeed to continue to decrease and the bank angle to increase until the airplane experienced an aerodynamic stall. ", "probable_cause": "The first officer's failure to maintain adequate airspeed and his exceedance of the airplane's critical angle-of-attack during the final approach in known low-level windshear conditions, which resulted in an aerodynamic stall. Contributing to the accident were the first officer's failure to initiate a go-around when commanded and the captain's lack of remedial action when he recognized that the approach was unstabilized. "}