{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-b100-king-air-aurora", "date": "Oct 6, 2009 at 1450 LT", "type": "Beechcraft 100 King Air", "operator": "Robert J. Schumacher", "flight_phase": "Flight", "flight_type": "Private", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Oklahoma City - Fort Worth", "msn": "BE-103", "yom": 1981, "flight_number": null, "city": "Aurora", "zone": "Texas", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4120, "captain_hours_type": 103, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1063, "circumstances": "The pilot added fuel to the multi-engine airplane prior to departure. While en route to the destination airport, the pilot noted that the fuel gauges indicated that the right main-tank appeared to be almost empty and the left tank appeared half full. The pilot initiated the crossfeed procedure in an effort to supply fuel to both engines from the left main tank. Shortly after beginning the crossfeed procedure, both engines experienced a total loss of power. The pilot notified air traffic control (ATC) and selected a field to perform a forced landing. Prior to touchdown, the right engine produced a surge of power and, in response, the airplane rolled to the left. The surge abruptly ended and the pilot continued the forced landing by lowering landing gear and extending the flaps. The airplane impacted the ground, coming to rest in an open field. A postimpact examination did not reveal any anomalies with the airframe or engine that would have precluded normal operation. Although both fuel tanks were ruptured, the accident scene did not contain a large amount of residual fuel. A small fuel slick was found on the surface of a nearby pond; however, the grass area underneath both wings did not contain dead grass; this would have been expected if there was more than a negligible amount of fuel in the tanks at time of impact.", "probable_cause": "The loss of engine power due to fuel exhaustion as a result of the pilot's inadequate fuel management."}