{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-8-202q-ilulissat", "date": "Jan 29, 2014 at 0842 LT", "type": "De Havilland DHC-8-200 (Dash-8)", "operator": "Air%20Greenland", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kangerlussuaq – Ilulissat", "msn": "477", "yom": 1997, "flight_number": "GRL3205", "city": "Ilulissat", "zone": "Qaasuitsup Kommunia", "country": "Greenland", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 12, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4201, "captain_hours_type": 739, "copilot_hours": 1592, "copilot_hours_type": 1022, "aircraft_hours": 29947, "circumstances": "Upon landing on runway 07 at Ilulissat (BGJN) in gusting crosswind conditions above the aircraft and the operator limited maximum crosswind components, the left main landing gear collapsed. The aircraft skidded off the left side of the runway in a nose right position and into the safety zone. The aircraft continued an increasingly sideways skid in a nose right position, skidded down a steep snow-covered slope and impacted a rocky area approximately 10 meters below the runway elevation. One passenger and one crew member suffered minor injuries. The aircraft was destroyed. The accident occurred in dark night and under visual meteorological conditions (VMC). ", "probable_cause": "The following factors were identified:\r\n- A non-optimum CRM on final approach to runway 07 led to flight crew target fixation and a mental blocking of an appropriate decision on going around.\r\n- A non-stabilized approach in crosswind conditions above the aircraft and the operator’s crosswind limitations combined with the actual crosswind landing technique and the power levers retarded below flight idle in flight resulted in an accelerated rate of descent leading to a hard landing, with side load on the left main landing gear at touchdown.\r\n- The left main landing gear structural fuse pin sheared as a result of lateral and vertical overload stress.\r\n- Cycling the power levers between ground and flight range prevented an appropriate deceleration of the aircraft and prolonged the landing roll.\r\n- The combination of applying full left rudder and no decisive use of reverse thrust on the side with the unaffected main landing gear made it impossible for the flight crew to maintain directional control."}