{"url": "https://www.baaa-acro.com/crash/crash-hawker-siddeley-hs780-andover-c1-lokichoggio", "date": "Jun 10, 2005 at 1307 LT", "type": "Hawker Siddeley HS.780 Andover C.1", "operator": "748%20Air%20Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Humanitarian", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Lokichoggio – Boma – Torit – Natinga – Lokichoggio", "msn": "SET06", "yom": 1966, "flight_number": null, "city": "Lokichoggio", "zone": "Rift Valley", "country": "Kenya", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": 2000, "copilot_hours": 4300, "copilot_hours_type": 2800, "aircraft_hours": 14439, "circumstances": "A 748 Air Services Hawker Siddeley Andover aircraft departed Lokichoggio Airport (LKG) at 08:40 hours for Boma, Southern Sudan. After Boma, the aircraft landed at Torit (HSTR) then Natinga, all in Southern Sudan, before proceeding back to Lokichoggio. The aircraft joined long final from the west of the airfield and was given instructions to land on runway 09. As soon as the aircraft touched down, the propellers struck the runway surface for some distance then the aircraft veered off the centerline to the left and came to a stop. The captain, the first officer and the loadmaster evacuated themselves. They were not injured. The aircraft sustained substantial damage, blocking Lokichoggio's single 1800-metre runway 09/27. Three other light aircraft, a Dornier 228, an Antonov 28 and a Cessna 208, landed safely at the airfield on runway 27 after the HS-748 accident. Two Antonov 12 aircraft inbound to Lokichoggio from Torit, Southern Sudan, diverted to Juba upon getting information of the runway obstruction. Transafrik Hercules S9-BAS, flying for the United Nations World Food Programme, contacted Lokichoggio Tower at 14:30 hours. The aircraft was returning from a food air drop at Motot, Southern Sudan. The pilot was advised to divert to Eldoret International Airport but he opted to land at Lokichoggio. The Tower cleared the Hercules to land on runway 27 at the pilot’s discretion. The aircraft made a very heavy landing short of the runway and the top centre fuselage broke. The aircraft came to a stop about one kilometre from the touchdown point. Shortly before coming to a halt, the aircraft impacted the HS 748 with its right wing tip. The captain, the first officer, the flight engineer and the two loadmasters evacuated themselves safely.", "probable_cause": "The probable cause of the HS 748 accident was the failure to complete the landing checklist by the crew. Failure in cockpit monitoring and cross checking and misinterpretation of the landing gear up warning were contributory factors."}