{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-178-near-fonseca-15-killed", "date": "Jun 9, 1950 at 1900 LT", "type": "Douglas DC-3", "operator": "New-Tribes-Mission", "flight_phase": "Flight", "flight_type": "Humanitarian", "survivors": "No", "site": "Mountains", "schedule": "Miami – Kingston – Maracaibo", "msn": "1546", "yom": 1936, "flight_number": null, "city": "Fonseca", "zone": "La Guajira", "country": "Colombia", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 12, "pax_fatalities": 12, "other_fatalities": 0, "total_fatalities": 15, "captain_hours": 2500, "captain_hours_type": 400, "copilot_hours": 3576, "copilot_hours_type": 500, "aircraft_hours": 36534, "circumstances": "The aircraft had departed Miami, Florida, at 1045 on June 9, 1950, for Kingston, Jamaica. It arrived at Kingston at 1512 and departed at 1545 on an instrument flight plan of four hours to cruise at 9,500 feet direct to .Maracaibo, Venezuela, with Barranquilla, Colombia, as an alternate. The flight plan was filed with Kingston ARTC personally by the copilot. There was sufficient fuel on board at departure from Kingston for a flight of approximately five hours and thirty minutes duration. Radio contacts were made with Kingston at 1558, 1658, and 1752. The 1752 message indicated the flight's position at 1745 as 14 degrees north latitude, altitude 9,500 feet, and the ETA at Maracaibo at 1915. No longitude was given. This position report to Kingston was intercepted by Balboa, Canal Zone, and relayed to Maracaibo. At 1802 Balboa sent a message to the flight advising it that the Maracaibo radio was already closed on FA (air to ground) and closing soon on FX (point to point). It was therefore suggested that Balboa be contacted to close the flight plan when the aircraft landed at Maracaibo. At 1852 the flight advised Balboa that it was \"over the coast line at 5,000 feet and descending VFR.\" This was the last message received from the aircraft which never arrived at Maracaibo.", "probable_cause": "The Board finds that there is not sufficient evidence upon which to make a determination of probable cause."}