{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-palm-beach-county-1-killed", "date": "Dec 8, 2012 at 1334 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Subway%20Development_0", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Palm Beach County - Kendall", "msn": "421C-0826", "yom": 1980, "flight_number": null, "city": "Palm Beach County Park-Lantana", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1219, "captain_hours_type": 100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7040, "circumstances": "On December 8, 2012, at 1334 eastern standard time, a Cessna 421C, N297DB, operated by a private individual, was destroyed when it collided with trees and terrain following a loss of control after takeoff from North Palm Beach County Airpark (LNA), Lantana, Florida. The commercial pilot was fatally injured. Visual meteorological conditions prevailed, and no flight plan was filed for the personal flight, which was conducted under the provisions of Title 14 Code of Federal Regulations Part 91. The pilot took delivery of the airplane from a maintenance facility that had just completed an annual inspection and repainting of the airplane. According to the owner of the facility, who was a certificated pilot and an airframe and powerplant mechanic, the pilot completed the preflight inspection and the airplane was towed outside. The pilot started the airplane, but then shutdown to resolve an alternator charging light. Afterwards, the pilot stated that he planned to fly to Okeechobee, Florida, complete a few landings, and then continue to Miami. According to the mechanic, the pilot performed a ground run of the airplane for several minutes before taxiing to the approach end of Runway 3 for takeoff. The airplane lifted off about halfway down the runway and climbed at a \"normal\" rate. The mechanic then observed the airplane suddenly yaw to the left \"for a second or two\" and the airplane's nose continued to pitch up before rolling left and descending vertically, nose-down, until it disappeared from view. Several witnesses provided similar accounts to a Federal Aviation Administration (FAA) inspector and the local sheriff's department. One witness, a certificated flight instructor said, \"The airplane just kept pitching up, and then it looked like a VMC roll.\"", "probable_cause": "The pilot's failure to follow established engine-out procedures and to maintain a proper airspeed after the total loss of engine power on one of the airplane’s two engines during the initial climb. Contributing to the accident was the total loss of engine power due to a loss of torque on the crankcase bolts for reasons that could not be determined because of impact- and fire-related damage to the engine."}