{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-749-79-46-constellation-santa-maria-48-killed", "date": "Oct 28, 1949 at 0252 LT", "type": "Lockheed L-749 Constellation", "operator": "Air-France-31", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Paris – Lisbon – Santa Maria – New York", "msn": "2546", "yom": 1947, "flight_number": "AF009", "city": "Santa Maria", "zone": "Azores Islands", "country": "Portugal", "region": "Europe", "crew_on_board": 11, "crew_fatalities": 11, "pax_on_board": 37, "pax_fatalities": 37, "other_fatalities": 0, "total_fatalities": 48, "captain_hours": 6705, "captain_hours_type": 1513, "copilot_hours": 3010, "copilot_hours_type": 1582, "aircraft_hours": 3394, "circumstances": "About 150 nm from his destination, the crew informed ground about the ETA in Santa Maria-Vila do Porto Airport at 0245LT. Few minutes later, the captain changed this ETA to 0255LT. During the final approach completed by night but in good weather conditions, while at an altitude of 3,000 feet, the captain confirmed to ATC that he had the runway in sight and was approaching in VFR mode. Shortly later, the aircraft hit the slope of Mt Redondo (about 900 meters high) located few km from the airport. The aircraft was destroyed by impact forces and a post crash fire and all 48 occupants were killed. Among them were the French boxer Marcel Cerdan, the French violinist Ginette Neveu and her brother Jean Neveu, pianist, and Kay Kamen, artistic director by Walt Disney Studios. \r\nCrew:\r\nJean de la Noue, pilot,\r\nCharles Wolfer, copilot,\r\nCamille Fidency, copilot,\r\nAndré Villet, mechanic, \r\nMarcel Sarrazin, mechanic, \r\nRoger Pierre, radio operator, \r\nPaul Giraud, radio operator, \r\nJean Salvatori, navigator, \r\nRaymond Redon, steward,\r\nAlbert Brucker, steward,\r\nSuzanne Ruig, stewardess.", "probable_cause": "Without rejecting with an absolute certainty the possibility of a misinterpretation, the Commission of Inquiry believes that the inaccurate navigation of the aircraft is due to a sudden failure, at the end of the flight and unsuspected by the crew, of some elements from the receiving direction finding system, abnormal radio propagation operation or become defective. This cause combined with overconfidence due to good weather conditions in the arrival zone, conditions which have not prompted the captain to check his radio point as it would have done under unfavorable weather conditions. A visual confusion in darkness finally resulted.\r\nFinal report:\r\nhttp://aviatechno.net/constellation/rapport_f-bazn.php"}