{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-north-platte", "date": "May 28, 1998 at 1300 LT", "type": "Cessna 414 Chancellor", "operator": "Silverhawk Security Specialists", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "North Platte - Kearney", "msn": "414-0468", "yom": 1974, "flight_number": null, "city": "North Platte", "zone": "Nebraska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2353, "captain_hours_type": 312, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6159, "circumstances": "The airplane had just taken off and was at approximately 300 agl when the right engine 'had a sudden and catastrophic failure.' The right propeller stopped spinning with the blades in the low-pitch position. The pilot initiated a right turn back toward the airport, but the airplane would not maintain altitude. The pilot rolled out of the turn, but the descent continued until the airplane struck the trees. Examination of the airplane's right engine revealed that the crankshaft was broken at the number 3 short cheek, just forward of the number two cylinder piston rod. The number two crankshaft bearing was broken and melted. The oil feed line to the number two bearing was blocked by a piece of the broken bearing. The Single Engine Climb Data table in the Cessna 414 Pilot's Operating Handbook indicates that an airplane weighing 5,680 pounds, with gear and flaps retracted and the inoperative propeller in feather, operating at a density altitude of 5,055 feet, will have a best climb indicated airspeed of 115 knots. The rate of climb will be 308 feet per minute. ", "probable_cause": "The slipped number two bearing in the airplane's right engine, which blocked the bearing's oil feed line, causing the bearing and the crankshaft to overheat and fracture. A factor contributing to this accident was the trees. "}