{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-21-lake-pontchartrain-58-killed", "date": "Feb 25, 1964 at 0205 LT", "type": "Douglas DC-8", "operator": "Eastern-Airlines-3", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Mexico City – New Orleans – Atlanta – Philadelphia – New York", "msn": "45428", "yom": 1960, "flight_number": "EA304", "city": "Lake Pontchartrain", "zone": "Louisiana", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 51, "pax_fatalities": 51, "other_fatalities": 0, "total_fatalities": 58, "captain_hours": 19160, "captain_hours_type": 916, "copilot_hours": 10734, "copilot_hours_type": 2404, "aircraft_hours": 11340, "circumstances": "The flight, scheduled from Mexico City to New York City, with several intermediate stops, had just departed New Orleans at 0200. Three minutes later the captain acknowledged a request to change radio frequencies, but no further communications were received from the flight At 0205-40 the radar target associated with Flight 304 had disappeared from the scopes of both the radar controllers who were observing the flight. Moderate to severe turbulence existed in the area at the time of the accident. At 0159 46 the local controller in the tower observed Flight 304 commence the takeoff. The lift-off appeared normal, and at approximately 0201 he advised the flight to contact Departure Control, which was acknowledged. He estimated that the flight was two or three miles north of the airport when the lights disappeared into the overcast Voice communication and radar contact were established immediately between the flight and the departure controller who advised them to\" . . turn right heading 030, be a vector north of J-37 (the planned route of flight)\" While the flight continued on this vector, the departure controller contacted the New Orleans Air Route Traffic Control Center (ARTCC) The radar target was identified five miles north of the New Orleans VORTAC, and a radar handoff was effected at 0202 38. Flight 304 was instructed to \"contact New Orleans Center radar, frequency 123.6 now.\" At 0203 15 the crew replied, \"OK\". This was the last transmission from the flight. At 0205 40, when no transmissions had been received from the flight, the center controller contacted the departure controller to verify that proper instructions had been given. During this conversation both controllers confirmed that the radar target associated with the flight had disappeared from both scopes, and emergency procedures were initiated shortly thereafter. The last position noted by the controllers was approximately eight miles from the New Orleans VORTAC on the 030-degree radial. The aircraft crashed at 14.5 miles on the 034-degree radial, in Lake Pontchartrain. The aircraft disintegrated on impact and all 58 occupants have been killed. ", "probable_cause": "The Board determines the probable cause of this accident was the degradation of aircraft stability characteristics in turbulence, because of abnormal longitudinal trim component positions."}