{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-piako-1-killed", "date": "Feb 6, 1973 at 1200 LT", "type": "Fletcher FU-24", "operator": "Robertson%20Air%20Service", "flight_phase": "Flight", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Piako - Piako", "msn": "35", "yom": 1957, "flight_number": null, "city": "Piako", "zone": "Waikato Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The pilot was engaged in a superphosphate spreading operation over hilly farmland. Just before noon he took off on his 72nd sortie of the day with the usual load of 14 hundredweight in the hopper. On the completion of the first sowing run the aircraft was turned to position it for the next run. As usual this put the plane out of sight to those on the airstrip as it passed behind an intervening spur. At about the time the plane was expected to reappear a loud bang was heard by the crew on the strip, and moments later a column of smoke was seen rising from behind the spur. The aircraft was found wrecked and burning. This was not a survivable crash. Physical evidence at the site showed that the Fletcher had struck the ground with its right wingtip first while banked past the vertical with the fuselage then impacting in a perpendicular attitude. Propeller score marks on the pasture indicated that the engine was developing power at the moment of the crash. The weather was fine and clear with a southwesterly breeze of about 5 knots. Not a cause factor in the accident. The pilot had recently completed an agricultural pilot course and had almost accumulated the fifty hours of supervised productive flying required before being cleared for unsupervised operations.", "probable_cause": "No evidence of mechanical or structural failure was found. Weather conditions were considered as good. The crash investigation found that the most probable cause of the tragedy was a catastrophic physical incapacity of the pilot causing him to lose control of the aircraft. "}