{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-bozeman-3-killed", "date": "Feb 6, 2007 at 2104 LT", "type": "Beechcraft 200 Super King Air", "operator": "Metro%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "No", "site": "Plain, Valley", "schedule": "Great Falls - Bozeman", "msn": "BB-234", "yom": 1977, "flight_number": null, "city": "Bozeman", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 17608, "captain_hours_type": 1318, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5992, "circumstances": "The cross-country flight was on an instrument flight rules (IFR) flight plan, approximately 42 nautical miles from the tower-controlled destination airport, when the pilot was cleared for the visual approach. Dark night visual meteorological conditions prevailed, and there was an overcast layer of clouds at 11,000 feet. After the en route radar service was terminated, the pilot contacted the local control tower and made a garbled and partially unintelligible transmission. Shortly after the time of the transmission, local law enforcement personnel received reports of a downed aircraft. The wreckage was located later that evening approximately 80 feet below the peak of a ridge that rose to an elevation of approximately 5,700 feet. From the initial point of contact with terrain, the debris path was scattered over the crest of the ridge and continued down the opposing side, in a south-southeast direction, toward the airport. The ridge was the highest obstruction between the accident location and the destination airport. The airport is located in a large valley and is surrounded by rising mountainous terrain. At night, clouds and terrain are difficult for pilots to see, and a gradual loss of visual cues can occur as flight is continued toward darker terrain. Additionally, the horizon is less visible and less distinct at night than during the day. Because the pilot was descending the airplane over rural, mountainous terrain that provided few visual ground reference cues, and because the overcast cloud layer would have prevented moonlight from illuminating the terrain, it is likely that the pilot did not see the rising terrain as the airplane continued toward it. The airplane was equipped with an Enhanced Ground Proximity Warning System; however, impact damage to the unit precluded post accident testing. It is not known how the unit was configured during the flight or what type of alerts the pilot received prior to impact. Post accident examination of the wreckage, to include both engines, did not disclose evidence of a mechanical malfunction prior to impact. Additionally, no evidence was found to suggest an in-flight structural failure.", "probable_cause": "The pilot's failure to maintain an adequate altitude and descent rate during a night visual approach. Dark night conditions and mountainous terrain are factors in the accident."}