{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-fort-wayne-1-killed", "date": "Oct 24, 1983 at 1615 LT", "type": "Beechcraft 90 King Air", "operator": "Lightning Air Service", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Wayne - Tulsa", "msn": "LJ-541", "yom": 1972, "flight_number": null, "city": "Fort Wayne", "zone": "Indiana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 18980, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3821, "circumstances": "At 1604 est, the aircraft departed Fort Wayne on a ferry flight. IFR conditions prevailed and the pilot had filed an IFR flight plan. While climbing after takeoff, the pilot passed his assigned altitude of 2,500 feet msl and flew to 4,200 feet. Also, he failed to turn to his initial assigned heading of 130°. He had problems contacting departure control as he was not on the assigned frequency. He reported problems with his heading indicator and his 'gyro'. Shortly after his last transmission, the aircraft left 4,200 feet msl and crashed in a steep dive. Before takeoff, the atp pilot reported he had flown all King Air aircraft and was currently flying the Beech 200. A review of his last log book revealed over 2,000 hours in the Beech 200, but showed no time in the Beech C90. A witness that reviewed the aircraft with the pilot before the flight believed he (the pilot) was very familiar with the aircraft systems. During an inspection of the wreckage, no evidence was found to verify a pre-impact malfunction or failure of the aircraft or engines. All instruments were destroyed. The pilot, sole on board, was killed. ", "probable_cause": "Occurrence #1: loss of control - in flight\r\nPhase of operation: climb\r\nFindings\r\n1. (c) reason for occurrence undetermined\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: descent - uncontrolled"}