{"url": "https://www.baaa-acro.com/crash/crash-pilatus-pc-1245-raphine-4-killed", "date": "Jul 5, 2009 at 1002 LT", "type": "Pilatus PC-12", "operator": "Nicholas Elliott & Jordan", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Teterboro - Tampa", "msn": "570", "yom": 2004, "flight_number": null, "city": "Raphine", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1873, "captain_hours_type": 715, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 723, "circumstances": "While in instrument meteorological conditions flying 800 feet above the airplane’s service ceiling (30,000 feet), with no icing conditions reported, the pilot reported to the air traffic controller that he, “...lost [his] panel.” With the autopilot most likely engaged, the airplane began a right roll about 36 seconds later. The airplane continued in a right roll that increased to 105 degrees, then rolled back to about 70 degrees, before the airplane entered a right descending turn. The airplane continued its descending turn until being lost from radar in the vicinity of the accident site. The airplane impacted in a nose-down attitude in an open field and was significantly fragmented. Postaccident inspection of the flight control system, engine, and propeller revealed no evidence of preimpact failure or malfunction. The flaps and landing gear were retracted and all trim settings were within the normal operating range. Additionally, the airplane was within weight and balance limitations for the flight. The cause of the pilot-reported panel failure could not be determined; however, the possibility of a total electrical failure was eliminated since the pilot maintained radio contact with the air traffic controller. Although the source of the instrumentation failure could not be determined, proper pilot corrective actions, identified in the pilot operating handbook, following the failure most likely would have restored flight information to the pilot’s electronic flight display. Additionally, a standby attitude gyro, compass, and the co-pilot’s electronic flight display units would be available for attitude reference information assuming they were operational.", "probable_cause": "The pilot's failure to maintain control of the airplane while in instrument meteorological conditions following a reported instrumentation failure for undetermined reasons."}