{"url": "https://www.baaa-acro.com/crash/crash-learjet-23-richmond-2-killed", "date": "May 6, 1980 at 0312 LT", "type": "Learjet 23", "operator": "Kennedy Flite Center", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Richmond – Louisville – Gainesville – Richmond", "msn": "23-018", "yom": 1965, "flight_number": null, "city": "Richmond-Byrd Field", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 2547, "captain_hours_type": 301, "copilot_hours": 905, "copilot_hours_type": 10, "aircraft_hours": 4861, "circumstances": "On May 5, 1980, an unmodified Gates Learjet 23 (N866JS) was operated by Kennedy Flite Center, Richmond, Virginia, on a purported crew training flight. The pilot called the Newport News, Virginia, flight service station (FSS) about 2105 and received a weather briefing for a flight originating in Richmond to Louisville, Kentucky, continuing to Gainesville, Florida, and returning to Richmond. He filed three instrument flight rules (IFR) flight plans. The first flight plan called for a flight of 1+00 hour from Richmond to Louisville with the pilot and copilot aboard. The second flight plan called for a flight of 1+29 hours from Louisville to Gainesville with the pilot, copilot, and six passengers aboard. The third flight plan called for a flight of 1+10 hours from Gainesville to Richmond with the pilot and copilot aboard. All of the plans requested flight level (FL) 410 as an en route altitude. N866JS departed Richmond about 2128 with the two pilots aboard, and arrived at Standiford Field in Louisville at 2228 after a routine flight. The aircraft was refueled with 386 gallons of Jet A fuel costing $479.46, which was paid by check. The flightcrew boarded the six passengers, who were friends of the copilot according to the company's flight manager, and the aircraft departed Louisville at 2315. After a routine flight, the aircraft arrived at Gainesville Regional Airport at 0044, May 6, 1980, and the passengers deboarded. Charter Air Center service personnel \"topped off\" the fuel tanks with 404 gallons of Jet A fuel. The fuel bill was $596.63, which was paid in cash. The flight departed Gainesville at 0152. Initial climb was to 23,000 feet with further clearance to FL 370 and final clearance to the requested FL 410. The en route portion of the flight proceeded normally, and at 0257, during descent, the aircraft was handed off at 14,000 feet by the Washington Air Route Traffic Control Center to Richmond approach control. The Richmond approach controller acknowledged the handoff, gave current weather and wind conditions, and told the flightcrew to expect a visual approach to runway 2 at the Byrd International Airport. The flightcrew requested an instrument landing system (ILS) approach to runway 33. This request was acknowledged, and the approach controller vectored the aircraft to the ILS final approach course, outside of the outer marker, at 2,000 feet. The approach controller turned the aircraft over to the local control tower operator at 0308. Radio communication between the aircraft and the tower controller was established, and the aircraft was cleared to land at 0308:41. While on final approach at about 2 miles from the runway, the pilot asked for a wind check, and the controller responded that the winds were calm. About 0311:10, the flightcrew requested that the sequenced flashing approach lights be turned down and the controller asked that the message be repeated. The controller heard two garbled radio transmissions within 40 seconds referring to lights, and he dimmed the lights when the aircraft was about 0.5 mile from the runway. The tower controller stated that the aircraft's flightpath appeared higher than normal and that N866JS seemed, to float down the runway at about 50 feet altitude. He then'saw the wingtip lights rocking back and forth, the nose of the aircraft rising, and the aircraft starting to roll. He stated that he reached for the crash phone when he saw the wings rocking because he was concerned about the safety of the aircraft. He then saw a ball of fire on runway 33 and immediately sounded the crash alert; the time was 0311:58. A Virginia Air National Guard security guard on duty near an aircraft parking ramp and the \"M\" taxiway adjacent to runway 33 witnessed the accident. He stated that he was in a parked truck, engine off, with an unobstructed view of the runway approach zone and touchdown area. He said that the aircraft was \"a bit high\" on its approach, but descended to a normal touchdown attitude and altitude with the noise of the engines winding down. He did not hear the \"screech\" of the tires which would have been normal if the aircraft touched the runway. Instead, he said that the aircraft yawed right, the nose came up, and the aircraft started to roll to the right. The roll continued to the inverted position accompanied by a buildup of engine noise. He then saw the aircraft strike the ground inverted, catch fire, and explode. Another security guard on duty at the entrance to the Air National Guard base also witnessed part of the accident sequence. He observed the approach to runway 33 and stated that he thought the aircraft was landing farther down the runway than normal. He did not hear the aircraft touch down, but did hear a sudden rise of engine noise. He saw a white light traveling down the runway followed by an orange fireball and flames. The aircraft was totally destroyed and both pilots were killed. ", "probable_cause": "The pilot's failure to maintain proper airspeed and aircraft attitude while transitioning from final approach through flare to touchdown. The low-speed/high angle-of attack flight condition precipitated wing rolloff, wingtip strikes, and ultimate loss of aircraft control. The pilot's improper technique during roundout may have been due to fatigue, his limited knowledge, training, and experience regarding the flight characteristics of the Learjet aircraft, and distraction caused by concern over the intensity of the approach lighting."}