{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-8-54f-detroit-3-killed", "date": "Jan 11, 1983 at 0252 LT", "type": "Douglas DC-8", "operator": "United-Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cleveland - Detroit - Los Angeles", "msn": "46010", "yom": 1968, "flight_number": "UA2885", "city": "Detroit-Metropolitan-Wayne County", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 16102, "captain_hours_type": 2711, "copilot_hours": 9360, "copilot_hours_type": 6493, "aircraft_hours": 31902, "circumstances": "United Flight 2885 departed Cleveland at 01:15 for a cargo flight to Los Angeles via Detroit. The DC-8 arrived at Detroit at 01:52. Cargo for Detroit was unloaded, the airplane was refueled, and cargo for Los Angeles was loaded. The engines were started, and then the crew called for taxi instructions at 02:45:58. During the taxi, the flightcrew accomplished the before takeoff checklist. The second officer called \"trim\" and the first officer responded \"set\". The flightcrew however, inadvertently overlooked setting the stabilizer trim for takeoff, and the setting of 7.5 units ANU was the previous landing trim setting. At 02:49:16, the captain, the first officer, and the second officer discussed the idea of the first officer switching seats with the second officer. They then switched seats about 02:49:40. United 2885 called for clearance onto runway 21R at 02:49:58 and was cleared for takeoff at 02:50:03. The throttles were advanced for takeoff at 02:51:05 and power stabilized 7 seconds later. Speed callouts \"eighty knots\" and \"Vee One\" were called by the captain and the airplane broke ground about 02:51:41. The airplane continued to climb with wings level to about 1,000 feet. The airplane then rolled to the right in a gradual right turn until it was in a wings vertical position (right wing down, left wing up) and crashed into a freshly plowed farm field.", "probable_cause": "The flight crew's failure to follow procedural checklist requirements and to detect and correct a mistrimmed stabilizer before the aircraft became uncontrollable. Contributing to the accident was the captain allowing the second officer, who was not qualified to act as a pilot, to occupy the seat of the first officer and to conduct the take-off."}