{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47a-80-dl-near-ashland-2-killed", "date": "Aug 25, 1946 at 2210 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "American-Airlines-2", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Plain, Valley", "schedule": "Memphis - Memphis", "msn": "19776", "yom": 1944, "flight_number": "AA026", "city": "Ashland", "zone": "Mississippi", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6770, "captain_hours_type": 4270, "copilot_hours": 5835, "copilot_hours_type": 5051, "aircraft_hours": 3462, "circumstances": "The crew left Memphis at 2110LT for a three hours local training flight. About one hour later, contact was lost and the crew did not report anymore. The next early morning, the wreckage was found in a wooded, rolling terrain located five miles WSW of Ashland, and both crew members were killed. The attitude at impact indicates that, prior to the accident, the aircraft had been in an almost vertical dive and the complete demolition of the structure resulting from impact indicates very high speed. It is apparent, therefore, that the aircraft was not under normal control at the time of impact. During the course of this flight, the pilots were expected to practice recovery from unusual maneuvers similar to those contained in CAA flight checks. While it appears that the unusual attitude of the aircraft at the moment of impact may have resulted from a voluntary maneuver by one of the pilots, recovery from which was not completed, the possibility of loss of control from some other factor not apparent in the investigation cannot be eliminated. The fact that the ballast in the passengers' compartment was unsecured created the possibility of a serious shifting of balance during unusual attitudes. While the maximum possible movement of this ballast would probably not alter the center of gravity beyond approved limits, a sudden shift during an unusual maneuver may have produced a forward movement of the aircraft center of gravity location of almost 12 Inches. Such a change in center of gravity would have had an appreciable effect on \"trim\", and the resulting change in control forces would obviously have complicated an attempt by the pilot to recover from an unanticipated severe change in attitude. Some laxity must be charged to the company, therefore, for its failure to assure that the condition of the aircraft and its contents was suitable for the flight activity contemplated. As a result of the investigation of this accident, it appears that the aircraft, for reasons not determined, entered an unusual attitude from which recovery was not completed. Recovery in this instance may have been complicated by unsecured ballast or defective instruments, or both.", "probable_cause": "The Board determines that the probable cause of this accident was the loss of control of the aircraft during an unusual attitude. Neither the reason for the initial loss of control nor the reason for the pilot's failure to recover has been determined."}