{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-86-moscow-14-killed", "date": "Jul 28, 2002 at 1525 LT", "type": "Ilyushin II-86", "operator": "Pulkovo%20Aviation.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Saint-Petersburg", "msn": "51483203027", "yom": 1983, "flight_number": null, "city": "Moscow-Sheremetyevo", "zone": "Moscow oblast", "country": "Russia", "region": "Asia", "crew_on_board": 16, "crew_fatalities": 14, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 14, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 18363, "circumstances": "The aircraft was leaving Moscow on a ferry flight to St Petersburg following a charter flight from Sochi. On board were 16 crew members, among them 10 employees of the company. Two seconds after takeoff from runway 07L, while climbing to a height of about 200 metres, the stabilizers trimmed to the full up position of 12°. The aircraft nosed up and reached a super critical angle of attack. The crew attempted to regain control by pushing the control column forward but the aircraft stalled and crashed in a huge explosion about 700 metres past the runway end. Two stewardesses were injured while 14 other occupants were killed. ", "probable_cause": "The cause could not be determined with certainty due to the almost complete destruction of the main and reserve stabilizer control system units as a result of the fire on the ground and lack of information on the primary and backup stabilizer control systems on the flight data recorder, and the lack of crew comments on the cockpit voice recorder. The accident of IL-86 RA-86060 could be caused by an electrical failure in the stabilizer control system, which led to the reverse control response when controlling the stabilizer from the main system or inadequate actions of one of the pilots, expressed in pressing and holding the \"pitch up\" stabilizer switch on the control column."}