{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-85r-mumbai", "date": "Jul 1, 2019 at 2351 LT", "type": "Boeing 737-800", "operator": "SpiceJet", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Jaipur - Mumbai", "msn": "30410/1228", "yom": 2002, "flight_number": "SG6237", "city": "Mumbai-Chhatrapati Shivaji (Santa Cruz)", "zone": "Maharashtra", "country": "India", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 0, "pax_on_board": 160, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5355, "captain_hours_type": 5113, "copilot_hours": 4826, "copilot_hours_type": 4625, "aircraft_hours": null, "circumstances": "On 01.07.2019, B737-800 aircraft was involved in an accident (runway excursion) at Mumbai airport while landing in moderate to heavy rain. The aircraft was under the command of an ATPL holder (PF) with a CPL holder as First Officer (PM). There were 160 passengers and 7 crew members on board. There was no injury to any of the passengers or crew members. The aircraft suffered substantial damage. The subject flight was fifth of the day for the aircraft and second for the flight crew. The flight crew had earlier operated Mumbai-Jaipur sector and the incident flight was from Jaipur to Mumbai. There were no technical issues reported by the flight crew either during Mumbai Jaipur sector or on the return leg (Jaipur- Mumbai) till descent into Mumbai. The pilots had carried out briefing amongst themselves for the approach including the weather and Go Around actions, if required. The aircraft commenced descent into Mumbai in the late evening hours. As per the reported weather at the time of approach visibility was 2100 metres in rain making it dark. Reported winds were 090/12 Knots. Runway was wet and the trend provided was ³temporary reduction in visibility to 1500 metres with thunder/ showers of rain´. During descend at approximately 7000' Pressure Altitude, the crew observed an indication for IAS disagree, indicating a discrepancy of airspeed between the instrument sources for the flight crew. Although this indication was momentary, the 'Non-Normal Checklist' was carried out. The indication discrepancy did not recur for the remainder of the flight. The aircraft was radar vectored for an ILS approach for Runway 27 at Mumbai. The approach was stabilized by 3800' Pressure Altitude with landing gear down, flaps 30 and auto brake selected at 3. The autopilot was engaged throughout the descent phase and during approach, the second autopilot was also coupled for the ILS approach. At 100', the autopilot and the auto-throttle were disengaged by the PF. The flare manoeuvre consumed approximately 5807' of the runway length prior to the aircraft touchdown with 3881' of runway remaining. After touchdown, the speed brakes deployed automatically and maximum reverse thrust and wheel brakes were applied. The aircraft exited the paved surface at 65 Knots and came to rest at a distance of 615' beyond the end of the runway. Once the aircraft came to rest, the flight crew advised cabin crew to be at their stations. The pilots were unable to contact ATC through VHF communication. The PF contacted his airline personnel using mobile phone and informed that the aircraft had overrun the runway and requested for step ladders. The ATC activated fire  services and the runway was closed for operation. The Cabin crew carried out check on the passengers in the cabin. The fire services reached the aircraft location and verbal communication was established with the flight crew once the cockpit window was opened. Two Fire Services personnel boarded the aircraft from the L1 door using a fire ladder. An assessment of the aircraft structure and occupants was made and the fire services personnel informed the cabin crew that deplaning was to be carried out using fire ladders. There were no injuries during evacuation or otherwise.", "probable_cause": "The runway excursion occurred because of combination of:\r\n- Disconnection of auto pilot at an altitude 118' RA with the nose up trim bias without adequate compensation.\r\n- Disconnection of auto throttle at 118' RA at a higher thrust setting for that phase of flight.\r\n- Late touchdown of the aircraft on the runway.\r\n- Reduced visual cues due to heavy rain impacting depth perception and ascertaining of actual touchdown position.\r\n- Tailwind conditions at the time of landing resulting In increasing the distance covered during the extended flare (float).\r\n- Approach with lower flaps (30) than recommended (40)."}