{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-harrisburg-4-killed", "date": "Apr 7, 2017 at 1048 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Park City Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Van Nuys – Eugene", "msn": "46-8508023", "yom": 1985, "flight_number": null, "city": "Harrisburg", "zone": "Oregon", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 5060, "captain_hours_type": 163, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3681, "circumstances": "The commercial pilot and three passengers departed on an instrument flight rules crosscountry flight. While on approach to the destination airport, the pilot indicated to the air traffic controller that the airplane was passing through areas of moderate-to-extreme precipitation. After clearing the airplane for the approach, the controller noted that the airplane descended below its assigned altitude; the controller issued a low altitude alert, but no response was received from the pilot. The airplane subsequently impacted terrain in a level attitude about 12 miles from the airport. Examination of the airframe, engine, and system components revealed no evidence of preimpact mechanical malfunction that would have precluded normal operation. An area of disturbed, flattened, tall grass was located about 450 ft southwest of the accident site. Based on the images of the grass, the National Weather Service estimated that it would take greater than 35 knots of wind to lay over tall grass as the images indicated, and that a downburst/microburst event could not be ruled out. A downburst is an intense downdraft that creates strong, often damaging winds. About 6 hours before the flight, the pilot obtained weather information through a mobile application. Review of weather data indicated the presence of strong winds, heavy precipitation, turbulence, and low-level wind shear (LLWS) in the area at the time of arrival, which was reflected in the information the pilot received. Given the weather conditions, it is likely that the airplane encountered an intense downdraft, or downburst, which would have resulted in a sudden, major change in wind velocity. The airplane was on approach for landing at the time and was particularly susceptible to this hazardous condition given its lower altitude and slower airspeed. The downburst likely exceeded the climb performance capabilities of the airplane and resulted in a subsequent descent into terrain. It is unknown if the accident pilot checked or received additional weather information before or during the accident flight. While the flight was en route, several PIREPs were issued for the area of the accident site, which also indicated the potential of LLWS near the destination airport; however, the controller did not provide this information to the pilot, nor did he solicit PIREP information from the pilot. Based on published Federal Aviation Administration guidance for controllers and the widespread adverse weather conditions in the vicinity of the accident site, the controller should have both solicited PIREP information from the pilot and disseminated information from previous PIREPs to him; this would have provided the pilot with more complete information about the conditions to expect during the approach and landing at the destination.", "probable_cause": "An encounter with a downburst during an instrument approach, which resulted in a loss of control at low altitude. Contributing to the accident was the air traffic controller's failure to\r\nsolicit and disseminate pilot reports from arriving and departing aircraft in order to provide pilots with current and useful weather information near the airport."}