{"url": "https://www.baaa-acro.com/crash/crash-cessna-551-citation-iisp-siegerland", "date": "Apr 24, 2019 at 1442 LT", "type": "Cessna 551 Citation II", "operator": "Advance Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Siegerland - Siegerland", "msn": "551-0552", "yom": 1987, "flight_number": null, "city": "Siegerland", "zone": "North Rhine-Westphalia", "country": "Germany", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6800, "captain_hours_type": 170, "copilot_hours": 1300, "copilot_hours_type": 0, "aircraft_hours": 8479, "circumstances": "The Cessna 551 Citation II/SP corporate jet took off at 13:30 local time from Reichelsheim Airfield, Germany, for a training flight at Siegerland Airport. It was a training flight to acquire the type rating for the aircraft. The right pilot's seat was occupied by the pilot in command, who was deployed on this flight as a flight instructor. The student pilot, as co-pilot, sat on the left pilot seat and was the pilot flying. For the co-pilot it was the second flight day of his practical training program on the Cessna 551 Citation II/SP. The day before, he had already completed about three flying hours on the plane. At Siegerland Airport, three precision approaches to runway 31 were carried out with the help of the Instrument Landing System (ILS). After the third landing, the tower, due to the changed wind, turned the landing direction to runway 13. The cockpit crew therefore rolled the aircraft to the end of the runway, turned and took off at 14:34 from runway 13. This was followed by a left-hand circuit at an altitude of 3,500 ft AMSL. The approach to runway 13 took place under visual flight conditions. According to both pilots, the checklists were processed during the circuit and the aircraft was prepared for landing on runway 13. In the final approach, the landing configuration was then established and the landing checklist performed. The copilot reported that shortly before the landing the speed decreased, the aircraft flew too low and the approach angle had to be corrected. He pushed the engine thrust levers forward to the stop. The pilot in command supported this action by also pushing the engine thrust levers forward with his hand. However, according to the pilot in command, the remaining time to touch down on the runway was no longer sufficient for the engines to accelerate to maximum speed in order to deliver the corresponding thrust. He also described that the aircraft had been in the stall area at that time. However, he had not noticed a stall warning. At 14:42, with the landing gear extended, the aircraft touched down in the grass in front of the asphalt area of runway 13. The left main landing gear buckled and damaged the tank of the left wing. The right main landing gear also buckled, the tank on the right side remained undamaged. The kerosene escaping from the left wing ignited and a fire broke out. The aircraft burned and slipped along runway 13 on the folded landing gear, the underside of the airframe and the extended landing flaps until it came to a standstill after a distance of approx. 730 m from runway threshold 13. After the plane had come to a standstill on the runway, the copilot noticed flames on the left side of the plane. The pilot switched off both engines. Then both pilots left the plane via the emergency exit door on the right side. The pilots were not injured.", "probable_cause": "The accident, during which the airplane touched down ahead of the runway, was caused by an unstabilized approach and the non-initiation of a go-around procedure.\r\nThe following factors contributed to the accident:\r\n- The organisation of the traffic pattern was performed too close to the airport.\r\n- The final approach was flown too short and conducted in a way that it resulted in an unstabilized approach.\r\n- During the final approach the approach angle was not correctly maintained until the runway threshold.\r\n- During the final approach speed was too low.\r\n- Both pilots did not recognize the decrease in speed early enough and had not increased engine performance in time.\r\n- The flight instructor intervened too late and thus control of the flight attitude of the aircraft was not regained soon enough.\r\n- The ascending terrain ahead of the runway threshold was also a contributory factor. It is highly likely that the student pilot had the impression of being too high and deliberately maintained a shallow approach angle."}