{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-cincinnati-8-killed", "date": "Oct 8, 1979 at 1008 LT", "type": "Piper PA-31-310 Navajo", "operator": "Comair%20Delta%20Connection", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Cincinnati - Nashville", "msn": "31-580", "yom": 1969, "flight_number": "OH444", "city": "Cincinnati-Northern Kentucky", "zone": "Kentucky", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 2820, "captain_hours_type": 45, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4317, "circumstances": "The twin engine airplane was engaged in a schedule service (flight OH444) from Cincinnati-Northern Kentucky Airport (Greater Cincinnati) to Nashville, carrying seven passengers and one pilot. After a roll of about 1,500 - 2,000 feet on runway 18, the pilot started the rotation. During initial climb, at an altitude of about 150 feet, the right engine lost power. The airplane entered a right turn then lost height and crashed in a field located 1,188 feet to the west of runway 18. The aircraft was totally destroyed by impact forces and all eight occupants were killed. ", "probable_cause": "The probable cause of the accident was the loss of control following a partial loss of power immediately after liftoff. The accident could have been avoided if either the pilot had rejected the takeoff or had raised the landing gear and flaps. His failure to take decisive action may have been due to preoccupation with correcting the malfunction, and a lack of familiarity with the aircraft and with its emergency procedures. Contributing to the accident was the pilot's inexperience in multiengine aircraft, a hurried departure, inadequate training, inexperienced company management, and ineffective FAA certification and surveillance of the operator. "}