{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-near-leeds-12-killed", "date": "May 24, 1995 at 1751 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "Knight%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Leeds - Aberdeen", "msn": "110-256", "yom": 1980, "flight_number": "NE816", "city": "Leeds-Bradford", "zone": "West Yorkshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 12, "captain_hours": 3257, "captain_hours_type": 1026, "copilot_hours": 302, "copilot_hours_type": 46, "aircraft_hours": 15348, "circumstances": "On the morning of 24 May 1995 the aircraft had returned to its base at Leeds/Bradford from Aberdeen, U.K. on a scheduled passenger flight landing at 09:44 local time. The crew, which was not the one later involved in the accident, stated that all of the aircraft's systems and equipment had been serviceable during the flight. Some routine maintenance was performed on the aircraft which was later prepared for a scheduled passenger flight, NE816, to Aberdeen. It was positioned at the passenger terminal where it was taken over by the crew which was to operate the service, comprising the commander, who occupied the left hand seat, the first officer and a flight attendant. Nine passengers were boarded. The weather at Leeds/Bradford Airport was poor with Runway Visual Range (RVR) reported as 1,100 metres; scattered cloud at 400 feet above the aerodrome elevation of 682 feet and a light south-easterly wind. It was raining and the airfield had recently been affected by a thunderstorm. The freezing level was at 8,000 feet and warnings of strong winds and thunderstorms were in force for the Leeds/Bradford area. The crew called ATC for permission to start the engines at 17:41 hrs. Having backtracked the runway to line up, the aircraft took-off from runway 14 at 17:47 hrs and the crew was instructed by ATC to maintain the runway heading (143°M). The aircraft began to turn to the left shortly after becoming airborne. One minute and fifty seconds after the start of the take-off roll and as the aircraft was turning through a heading of 050° and climbing through 1,740 feet amsl, the first officer transmitted to Leeds/Bradford aerodrome control: \"Knightway 816 we've got a problem with the artificial horizon sir and we'd like to come back.\" The aerodrome controller passed instructions for a radar heading of 360° and cleared the aircraft to 3,000 feet QNH. These instructions were read back correctly but the aircraft continued its left turn onto 300° before rolling into a right hand turn with about 30° of bank. About 20 seconds before this turn reversal, the aircraft had been instructed to call the Leeds/Bradford approach controller. The aircraft was now climbing through an altitude of 2,800 feet in a steep turn to the right and the approach controller transmitted: \"I see you carrying out an orbit just tell me what i can do to help\". The first officer replied: \"Are we going straight at the moment sir\" The controller informed him that the aircraft was at that time in a right hand turn but after observing further radar returns he said that it was then going straight on a south-easterly heading. The first officer's response to this transmission was: \"Radar vectors slowly back to one four then sir please\". The controller then ordered a right turn onto a heading of 340°. This instruction was correctly acknowledged by the first officer but the aircraft began a left hand turn with an initial angle of bank between 30° and 40°. This turn continued onto a heading of 360° when the first officer again asked \"Are we going straight at the moment sir\" to which the controller replied that the aircraft looked to be going straight. Seconds later the first officer asked: \"Any report of the tops sir\". This was the last recorded transmission from the aircraft, although at 17:52 hrs a brief carrier wave signal was recorded but it was obliterated by the controller's request to another departing aircraft to see if its pilot could help with information on the cloud tops. At this point, the aircraft had reached an altitude of 3,600 feet, having maintained a fairly constant rate of climb and airspeed. The ATC clearance to 3000 feet had not been amended. After the controller had confirmed that the aircraft appeared to be on a steady northerly heading, the aircraft immediately resumed its turn to the left and began to descend. The angle of bank increased to about 45° while the altitude reduced to 2,900 feet in about 25 seconds. As the aircraft passed a heading of 230° it ceased to appear on the secondary radar. There were four further primary radar returns before the aircraft finally disappeared from radar. There had been a recent thunderstorm in the area and it was raining intermittently with a cloud base of about 400 feet and a visibility of about 1,100 metres. Residents in the vicinity of the accident site reported dark and stormy conditions. Several witnesses described the engine noise as pulsating or surging and then fading just prior to impact. Other witnesses saw a fireball descending rapidly out of the low cloud base and one witness saw the aircraft in flames before it stuck the ground. All of the occupants died at impact. From subsequent examination it was apparent that, at a late stage in the descent, the aircraft had broken up, losing a large part of the right wing outboard of the engine, and the right horizontal stabiliser. There was some disruption of the fuselage before it struck the ground. The airborne structural failure that had occurred was the result of flight characteristics which were beyond the design limits of the aircraft following the loss of control shortly before impact.", "probable_cause": "The following causal factors were identified:\r\n- One or, possibly, both of the aircraft's artificial horizons malfunctioned and, in the absence of a standby horizon, for which there was no airworthiness requirement, there was no single instrument available for assured attitude reference or simple means of determining which flight instruments had failed.\r\n- The commander, who was probably the handling pilot, was initially unable to control the aircraft's heading without his artificial horizon, and was eventually unable to retain control of the aircraft whilst flying in IMC by reference to other flight instruments.\r\n- The aircraft went out of control whilst flying in turbulent instrument meteorological conditions and entered a spiral dive from which the pilot, who was likely to have become spatially disoriented, was unable to recover."}