{"url": "https://www.baaa-acro.com/crash/crash-learjet-45-batesville", "date": "Nov 29, 2022 at 1910 LT", "type": "Learjet 45", "operator": "Jett%20Aircraft", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Waterloo – Batesville", "msn": "45-352", "yom": 2007, "flight_number": "DHR003", "city": "Batesville", "zone": "Arkansas", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane departed Waterloo Regional Airport (ACO), Waterloo, Iowa, about 1757LT on an instrument flight rules (IFR) flight plan and climbed to cruise at flight level (FL) 410. During the arrival to BVX, a non-towered airport, the air traffic controller cleared the airplane for the RNAV (GPS) Runway 08 approach and the crew cancelled IFR after visually acquiring the runway environment. The airplane crossed the final approach fix at 265 knots ADS-B groundspeed and the Runway 8 threshold at 190 knots ADS-B groundspeed. The airplane landed about 2,000 feet past the threshold of the 6,022 feet runway, which was wet due to earlier precipitation. Tire marks consistent with intermittent braking application started about 3,021 feet from the end of the runway. Tire marks consistent with continuous anti-skid braking application began about 2,069 feet from the end of the runway and continued until the end of the runway. The airplane exited the runway at an airspeed of about 100 knots ADS-B groundspeed, then continued forward and struck a ditch and the airport perimeter fence before coming to rest nearby a road, approximately 1,240 feet past the runway end. Both pilot were slightly injured and all six passengers escaped unhurt. ", "probable_cause": null}