{"url": "https://www.baaa-acro.com/crash/crash-handley-page-hp52-hampden-i-evington-3-killed", "date": "Apr 10, 1941 at 1530 LT", "type": "Handley Page H.P.52 Hampden", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Test", "survivors": "Yes", "site": "City", "schedule": "Lindholme - Lindholme", "msn": null, "yom": null, "flight_number": null, "city": "Leicester", "zone": "Leicestershire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 1, "total_fatalities": 3, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane, with Sergeant John James Campbell as pilot, took off to carry out a general test prior to an operational trip that night. The flight was to have been for about three hours’ duration. Weather conditions at the time of the accident were favorable. The cloud base was about 3,000 feet and visibility was over 5 miles. Two hours later the aircraft was seen flying at tree-top height near St. Denys Road, Evington. After circling for a few minutes it dived lightly and then levelled out. Immediately afterwards the port mainplane struck the roofs of three houses, demolishing the chimney stacks. A woman standing in the back garden of No. 26 St. Denys Road, was killed by falling debris. After hitting the houses it struck high trees about 40 yards distant and the tail unit and part of the bomb compartment were torn off. It then crashed into the adjoining field and distributed itself over a distance of 120 yards, killing the pilot and the 1st WOp/Air Gunner. Interviewed at the hospital next day, the 2nd WOp/Air Gunner., who was the sole survivor, said that a short while before the crash they had been flying round the telephone exchange at Uppingham. It was later learned that the pilot had, until two days before, been on leave, staying at St. Denys Road, Evington, with a lady friend, who was a telephonist employed at Uppingham Exchange.\r\nCrew:\r\nSgt John James Campbell, pilot, †\r\nSgt Leslie Albert Carn, wireless operator, †\r\nSgt J. E. Kilduff.\r\nThe woman killed on the ground was Mrs. Maud Louisa Harris. ", "probable_cause": "It is believed that the pilot engaged the airplane in an unauthorized low flight to show his girlfriend. "}