{"url": "https://www.baaa-acro.com/crash/crash-antonov-2-chelyabinsk-8-killed", "date": "May 16, 1955 at 1400 LT", "type": "Antonov AN-2", "operator": "Aeroflot-3", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Chelyabinsk - Chelyabinsk", "msn": "1 49 473 17", "yom": 2, "flight_number": null, "city": "Chelyabinsk", "zone": "Chelyabinsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 132, "circumstances": "The crew arrived at the Podovinnoe Farm in the Chelyabinsk region on May 12 to apply fertilizers on crops. On the evening of May 12, the crew drank a lot of vodka and red wine. There were no flight on May 13 due to poor weather conditions. On May 14 and 15, the crew completed 30 rotations each day for a total of 12 hours flight. On the evening of May 15, all four crew members went to a local hostel and again drank a lot of vodka and red wine. The captain went to bed at 0030LT, the copilot at 0255LT, the machanic at 0105LT and the flight engineer slept at the hostel. On the 16, at 0900LT, all four crew took their breakfast with vodka and red wine again. Later, the crew arrived at the airplane with four other people, among them two young girls. A local keeper elected to dissuade the crew to takeoff but without success. After takeoff at 1400LTf, the single engine aircraft climbed to a height of 60 meters then continued to a heading of 110° for about 2-3 minutes before entering a dive and crashing in a field located six km from the airstrip. The aircraft was destroyed and all eight occupants were killed. ", "probable_cause": "All four crew members were drunk at the time of the accident and were not able to fly. Poor discipline and responsibility on part of the crew who decided to takeoff in such conditions. Also, the crew violated the company procedures letting non authorized people to fly with. "}