{"url": "https://www.baaa-acro.com/crash/crash-dornier-do28d-skyservant-nuuk", "date": "Dec 5, 1994 at 1223 LT", "type": "Dornier DO.28D Skyservant", "operator": "Dornier_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Delivery", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Reykjavik - Goose Bay", "msn": "4112", "yom": 1971, "flight_number": null, "city": "Nuuk (Godthåb)", "zone": "Kommuneqarfik Sermersooq", "country": "Greenland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine aircraft was on a delivery flight from Germany to Colombia via Iceland and Canada, carrying one passenger and one pilot. On the leg from Reykjavik to Goose Bay, about 20 minutes into the flight, the right engine failed. As the pilot was unable to restart it, he decided to divert to Nuuk for an emergency landing. On short final, at a height of about 100 metres, the aircraft entered a right turn and struck the ground. Upon impact, the undercarriage were torn off and the aircraft came to rest against an embankment. Both occupants were slightly injured and the aircraft was damaged beyond repair. ", "probable_cause": "The exact cause of the engine failure could not be determined. Except the fact that a hinge pin was missing in the injector air heating system, no technical malfunction was found. It was reported that the pilot was not certified to perform such flight and the passenger was not allowed to take part to such mission according to the provisional airworthiness certificate that was valid till the day of the occurrence. The possible presence of windshear on final approach was not ruled out and it was also reported that the approach was completed with a speed that was approximately 10 to 15 knots below the prescribed approach speed. "}