{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e18s-detroit-3-killed", "date": "Mar 10, 1988 at 0026 LT", "type": "Beechcraft E18", "operator": "Lafayette Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "City", "schedule": "Detroit - Fort Wayne", "msn": "BA-298", "yom": 1957, "flight_number": null, "city": "Detroit-City (Coleman A. Young)", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 2, "total_fatalities": 3, "captain_hours": 1764, "captain_hours_type": 375, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight was an air taxi cargo flight carrying truck parts. After takeoff, the tower asked the pilot if he was in difficulty and the pilot replied 'roger' and requested a change of flight plan. The aircraft was seen flying erratically just above the tree tops. The aircraft descended almost vertically into a residential area. The rear of one home was ignited by the impact and 2 occupants of the house were fatally burned. Post accident investigation revealed no engine malfunction but there were discrepancies in the load manifest and the aircraft weight and balance. Before takeoff a company employee watched the pilot secure the cargo with ropes nets and clips but did not help because he 'didn't know what the pilot was doing. 'Impact' damage precluded determination of the original placement and security of the cargo and any possible shifting prior to impact. The net weight on the cargo manifest did not include the weight of the trays to hold the parts. This was an omission of 150 lbs. Company personnel said no weight and balance information was left with them when the aircraft departed.  ", "probable_cause": "Occurrence #1: loss of control - in flight\r\nPhase of operation: takeoff - initial climb\r\nFindings\r\n1. (f) dispatch procedures - inadequate - company/operator management\r\n2. (c) aircraft weight and balance - not performed - pilot in command\r\n3. (c) aircraft weight and balance - improper\r\n4. (c) aircraft performance, climb capability - inadequate\r\n5. (c) aircraft control - not maintained - pilot in command\r\n6. (f) supervision - poor - company/operator management"}