{"url": "https://www.baaa-acro.com/crash/crash-learjet-24d-ribeirao-preto-5-killed", "date": "Apr 7, 1999 at 1147 LT", "type": "Learjet 24", "operator": "Manacá Taxi Aéreo", "flight_phase": "Landing (descent or approach)", "flight_type": "Training", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "São Paulo - Ribeirão Preto", "msn": "24-270", "yom": 1973, "flight_number": null, "city": "Ribeirão Preto", "zone": "São Paulo", "country": "Brazil", "region": "South America", "crew_on_board": 5, "crew_fatalities": 5, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 4000, "captain_hours_type": 4000, "copilot_hours": 6000, "copilot_hours_type": 100, "aircraft_hours": null, "circumstances": "The aircraft departed São Paulo-Congonhas on a training flight to Ribeirão Preto-Leite Lopes Airport, carrying five crew members, instructor and pilots. On final approach to runway 18, during the last segment, just prior to touchdown, the aircraft rolled to the right, causing the right wing tip to struck the runway surface. The pilot-in-command overcorrected, the aircraft went out of control and crashed 420 metres past the first impact, bursting into flames. All five occupants were killed. ", "probable_cause": "Contributing Factors:\r\n- There was the participation of individual psychological variables in the pilot-in-command's performance due to the excess of self-confidence and self-demand in his customary behavior, besides the dissimulation regarding his real qualification for the type of flight. The personality with traces of permissiveness and insecurity of the co-pilot also contributed to the occurrence, as it allowed the aircraft to be operated by an unqualified pilot, with no employment link with the company.\r\n- There was a lack of adequate supervision by Manacá Táxi Aéreo, as it allowed a crew member who had not operated the type of aircraft for one year and had not made any type of flight for four months, besides not having any employment relationship with that company. It is also necessary to consider the failure of supervision at the organizational level due to the issue of an incorrect license by the DAC, giving rise to the possibility of its use for the revalidation of license in aircraft for which the pilot was not qualified to exercise the function of commander.\r\n- The entire sequence of events began with pilot errors resulting from the pilot's lack of flight experience in the left-hand seat on the aircraft in question.\r\n- The inadequate use of cockpit resources destined to the aircraft operation, due to an ineffective accomplishment of the tasks assigned to each crew member, besides the interpersonal conflict resulting from the co-pilot's intervention in the pilot in command operation, in the final approach phase, already close to the aircraft's touchdown, configure the collaboration of this factor to the accident.\r\n- The inadequate use of the aircraft commands, by the pilot in command, making excessive aileron corrections in the final approach phase, near the landing.\r\n- The pilot was qualified as a co-pilot on the equipment, but due to a typing error, he was issued a pilot license. Thus, the situation and operation of the pilot in question were totally irregular."}