{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-chicago-3-killed", "date": "Nov 11, 1999 at 2020 LT", "type": "Beechcraft 200 Super King Air", "operator": "Jaymar Ruby", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Chicago - South Bend", "msn": "BB-174", "yom": 1976, "flight_number": null, "city": "Chicago-Merrill C. Meigs", "zone": "Illinois", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 18000, "captain_hours_type": 4536, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8636, "circumstances": "Shortly after being cleared for takeoff on runway 18 (3,899 feet by 150 feet, dry concrete) at Merrill C. Meigs Field, Chicago, Illinois, the airplane impacted into Lake Michigan, approximately 300 feet south of the end of the runway. The tower controller said that at the 3/4 field point, the airplane had not rotated. 'All I can see are lights [from the airplane]. At the point where he would have been at the end of the runway, [I] lost the lights.' A witness on the airport said that when the airplane went by, it 'didn't sound like most King Airs do at that point.' There was a pulsating sound, but it was not heavy. The witness said that the airplane was 'bouncing up and down on the [gear] struts, and wasn't coming off the ground.' NTSB Materials examination of the pilot's control yoke showed that there were small distortions in the holes of the column and the rod where the control lock would be inserted. A small crack was observed around 1/4 of the control lock rod hole. The control lock was a substitute for the original airplane equipment. The examination of the control lock showed 'several shiny scratches ... parallel to the length of the pin.' A small deformation was observed near the top of the pin part of the control lock. The company flight department's third pilot said that when they flew the airplane, they always placed the control lock in the pilot's side cockpit wall pocket, along with a car key and a remote hanger door opener. The car key and the door opener were found in the wall pocket during the on-scene investigation. The control lock was\r\nrecovered from the lake, 7 days later.", "probable_cause": "On ground collision with the lake for undetermined reasons. "}