{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-burlington-2-killed", "date": "Feb 13, 1990 at 1830 LT", "type": "Beechcraft 90 King Air", "operator": "Holt", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Teterboro - Burlington", "msn": "LJ-729", "yom": 1977, "flight_number": null, "city": "Burlington-Alamance", "zone": "North Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 13800, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 5976, "circumstances": "The pilot transmitted on unicom that he was on final for runway 24. Following a double fuel starvation power loss the airplane impacted nose low with trees and terrain about 2.6 miles from runway 24. Last fueling occurred on the previous day at Albermarle, NC, the pilot's primary source of fuel, 50 miles from Burlington. The flight proceeded to Burlington, Teterboro, and was returning to Burlington. Total estimated flight time was 4 hours 32 minutes. Fuel burn was calculated to be 361 gallons. Usable fuel was 384 gallons and 24 gallons were recovered from the right center tank. If the fuel transfer pump does not operate 28 gallons will be unusable. That pump was found in the off position. No fuel spillage occurred at the scene. On 2/8/90 the pilot purchased 361 gallons of fuel for N110LT. Lower fuel prices at the favored location were the pilot's reason for fueling there. Examination of engines, propellers, fuel pumps, and other relative components did not reveal any significant discrepancy. Both occupants were killed. ", "probable_cause": "The double engine power loss due to fuel starvation, the pilot's failure to follow procedures and directives by not engaging the right fuel transfer pump, and the inadvertent stall during the forced landing approach. A factor was the pilot's failure to refuel before adequate fuel reserves were exhausted."}