{"url": "https://www.baaa-acro.com/crash/crash-antonov-26b-coxs-bazar-3-killed", "date": "Mar 9, 2016 at 0905 LT", "type": "Antonov AN-26", "operator": "True%20Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Cox’s Bazar – Jessore", "msn": "134 08", "yom": 1984, "flight_number": "21", "city": "Cox's Bazar", "zone": "Chittagong", "country": "Bangladesh", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 13315, "captain_hours_type": 6896, "copilot_hours": 1438, "copilot_hours_type": 1195, "aircraft_hours": 16379, "circumstances": "On March 9, 2016 one AN -26B aircraft belonging to True Aviation Ltd was operating a schedule cargo flight from a small domestic airport (Cox’s Bazar-VGCB) in southern Bangladesh to another domestic airport (Jessore -VGJR) in western Bangladesh, The cargo was Shrimp fries. As per the General Declaration the total cargo quantity was 802 boxes weighing 4800 kg. The airline had filled a flight plan keeping the ETD blank. The flight plan routing was CB W4 CTG W5 JSR at FL 100. All the documents except the load sheet were found properly signed and are in the possession of AAIT. According to ATC controller’s statement and recorded tape the aircraft requested for startup clearance at 0258z. As per the recordings with ATC the controller passed the visibility information of Jessore Airport as 3km. The aircraft started engines and requested for taxi. The aircraft was cleared to taxi to Runway 35 via taxiway S. The aircraft requested for takeoff clearance and was cleared for Take Off at 0305z. Immediately after airborne the pilot reported engine failure without mentioning initially which engine had failed but later confirming failure of the left engine and requested for immediate return back to Cox’s Bazar airport. He was advised by ATC to call left hand down wind. But the control tower spotted the aircraft making a right hand down wind at a very low altitude. All emergency services were made standby from the ATC. The aircraft called final and requested for landing clearance. For reasons so far unknown the aircraft made a low level Go Around. The controller in the tower saw the aircraft flying at about 400 to 500 feet. The surviving Flight Navigator also confirmed this in his statement. The ATC advised the captain to call left hand down wind. But there was no response from the crew. The ATC repeatedly kept calling the aircraft but there was no response from the crew and total communication was lost. At time 0332z the airport authority came to know through other means that the aircraft had crashed approximately 03km west of the airport. ", "probable_cause": "The accident was the consequence of the combination of the following factors:\r\na) Failure to initiate a rejected take off during take off roll following the indication of engine failure;\r\nb) Failure to adhere to the company SOP following the detection of the engine failure during take off;\r\nc) Considering the poor visibility at Cox’s Bazar Airport, diverting to the alternate airfield Chittagong Airport located only 50 nm away that has the provision for full ILS approach facility. This could have helped the crew in carrying out a proper one engine out precision approach landing;\r\nd) The aircraft flew at a speed much lower than the clean configuration speed. The aircraft flew at 225 km/h in clean configuration whereas the minimum clean configuration speed is 290 km/hr.\r\ne) As per the FDR data the aircraft stalled while making a turn towards the side of the failed engine at a very low altitude."}