{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-byers-10-killed", "date": "Jan 27, 2001 at 1737 LT", "type": "Beechcraft 200 Super King Air", "operator": "Jet%20Express", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Jefferson - Stillwater", "msn": "BB-158", "yom": 1976, "flight_number": null, "city": "Byers", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 8, "pax_fatalities": 8, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 5117, "captain_hours_type": 767, "copilot_hours": 1828, "copilot_hours_type": 1218, "aircraft_hours": 8737, "circumstances": "On January 27, 2001, about 1737 mountain standard time, a Raytheon (Beechcraft) Super King Air 200, N81PF, owned by North Bay Charter, LLC, and operated by Jet Express Services, crashed into rolling terrain near Strasburg, Colorado. The flight was operating on an instrument flight rules (IFR) flight plan under 14 Code of Federal Regulations (CFR) Part 91. The flight departed about 1718 from Jefferson County Airport (BJC), Broomfield, Colorado, with two pilots and eight passengers aboard. The pilot who occupied the left seat in the cockpit was solely responsible for the flight. The pilot who occupied the right seat in the cockpit, referred to in this report as the \"second pilot,\" was not a required flight crewmember. N81PF was one of three airplanes transporting members of the Oklahoma State University (OSU) basketball team and associated team personnel to Stillwater Regional Airport (SWO), Stillwater, Oklahoma, after a game at the University of Colorado at Boulder that afternoon. All 10 occupants aboard N81PF were killed, and the airplane was destroyed by impact forces and a post crash fire. Instrument meteorological conditions (IMC) prevailed at the time of the accident.", "probable_cause": "The pilot’s spatial disorientation resulting from his failure to maintain positive manual control of the airplane with the available flight instrumentation. Contributing to the cause of the accident was the loss of a.c. electrical power during instrument meteorological conditions."}