{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-3-islander-aldeia-pikany-5-killed", "date": "Dec 4, 2013 at 1130 LT", "type": "Britten-Norman Islander", "operator": "Heringer", "flight_phase": "Takeoff (climb)", "flight_type": "Ambulance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Aldeia Pikany – Novo Progresso", "msn": "314", "yom": 1974, "flight_number": null, "city": "Aldeia Pikany", "zone": "Pará", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 530, "captain_hours_type": 58, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Shortly after takeoff from The Pikany Indian Reserve Airfield, while in initial climb, the twin engine aircraft lost height, collided with trees and crashed in a wooded area located on km from the airstrip. The aircraft was destroyed and all five occupants were killed, among them Indian Kayapo who were flying to Novo Progresso to have urgent care. ", "probable_cause": "The following factors were identified:\r\n- The utilization of an aircraft not included in the Operating Specifications and of a runway neither registered nor approved, with a pilot who did not have the amount of hours necessary nor specific training, disclose a culture based on informal practices, which led to operation below the minimum safety requirements.\r\n- It is possible that the pilot forgot to verify the quantity of fuel in the tanks of the aircraft before takeoff. \r\n- The lack of specific training for the pilot and for the coordinator who, possibly, assumed the function of instructor may have compromised their operational performance during the preparation and conduction of the flight, since they were not effectively prepared for the activity.\r\n- It is possible that the pilot failed to comply with the prescriptions of the legislation relatively to the minimum amount of fuel required for the flight leg. The operation of the aircraft by a pilot with expired qualifications and without the required training goes against the prescriptions at the time, but it was not determined whether this pilot (coordinator) was in the aircraft controls at the moment of the accident. The transport of a cylinder onboard the aircraft also configures flight indiscipline, since it goes against the legislation which prohibits the transport of such material.\r\n- The lack of training of the differences may have contributed to the forgetting to verify the fuel tanks, a procedure that is prescribed in the aircraft manual. Likewise, lack of training may have deprived the pilots from acquiring proficiency for the operation of the aircraft in a single engine condition.\r\n- The fact of conducting a flight to provide assistance in an emergency situation may have contributed to the pilot having forgotten to check safety parameters, such as the amount of fuel necessary.\r\n- The pilot’s intention to earn his operational promotion may have stimulated him excessively, to the point of disregarding the minimum safety requirements for the operation. In addition, the emergency nature of the flight request possibly added to the motivation of the pilot and the coordinator.\r\n- It is possible that, due to having little total experience either both of flight and in the aircraft, the pilot lost control of the aircraft when faced with the situation of in-flight engine failure after the takeoff.\r\n- It is possible that the pilot and the coordinator prioritized the emergency requirement of the situation, failing to evaluate other aspects relevant for the safety of the flight, such as planning, for example.\r\n- The lack of control on the part of the company’s management in relation to the flights operating outside of the main base allowed the pilot and the base manager to conduct a flight without the operating sector authorization. The lack of supervision of the air transport service provision by the contracting organizations allowed the company to provide services without the minimum conditions required by the legislation. Such conditions exposed the passengers to the risks of an irregular operation."}