{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-237b-atlantic-ocean-329-killed", "date": "Jun 23, 1985 at 0715 LT", "type": "Boeing 747-200", "operator": "Air-India", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Vancouver – Toronto – Montreal – London – New Delhi – Bombay", "msn": "21473", "yom": 1978, "flight_number": "AI182", "city": "Atlantic Ocean", "zone": "All World", "country": "World", "region": "World", "crew_on_board": 22, "crew_fatalities": 22, "pax_on_board": 307, "pax_fatalities": 307, "other_fatalities": 0, "total_fatalities": 329, "captain_hours": 20379, "captain_hours_type": 6488, "copilot_hours": 7489, "copilot_hours_type": 2469, "aircraft_hours": 23634, "circumstances": "On the morning of 23rd June, 1985 Air India's Boeing 747 aircraft VT-EFO (Kanishka) was on a scheduled passenger flight (AI182) from Montreal and was proceeding to London enroute to Delhi and Bombay. It was being monitored at Shannon on the radar scope. At about 0714 GMT it suddenly disappeared from the radar scope and the aircraft, which had been flying at an altitude of approximately 31,000 feet, plunged into the Atlantic Ocean off the southwest coast of Ireland at position latitude 51° 3.6' N and longitude 12° 49' W. This was one of the worst air disasters wherein all the 307 passengers plus 22 crew members perished. The fact that emergency had arisen was first by Shannon Upper Area Control (UAC) after the aircraft had disappeared from the radar scope. The control gave a number of calls to the aircraft but there was obviously no response. Thereafter various messages were transmitted and that is how the rest of the world came to know of the accident. Shannon Control at 0730 hours advised the Marine Rescue Coordination Center (MRCC) about the situation which appeared to have arisen. MRCC, in turn, explained the situation to Valencia Coast Station and requested for a Pan Broadcast. Thereafter ships started converging on the scene of the accident and they commenced search and rescue operations.", "probable_cause": "The following findings were reported:\r\n- The aircraft was subjected to a sudden event at an altitude of 31,000 feet resulting in its crash into the sea and the death of all on board,\r\n- The forward and aft cargo compartments ruptured before water impact,\r\n- The section aft of the wings of the aircraft separated from the forward portion before water impact.\r\n- There is no evidence to indicate that structural failure of the aircraft was the lead event in this occurrence.\r\n- There is considerable circumstantial and other evidence to indicate that the initial event was an explosion occurring in the forward cargo compartment. This evidence is not conclusive. However, the evidence does not support any other conclusion."}