{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-freeport", "date": "Apr 21, 2006 at 0023 LT", "type": "Cessna 402", "operator": "Cambridge Air Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Lauderdale – Freeport", "msn": "402C-0051", "yom": 1979, "flight_number": null, "city": "Freeport", "zone": "West Grand Bahama", "country": "Bahamas", "region": "Central America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3033, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "At approximately 0423UTC on April 21, 2006 the pilot reported that approximately 20 miles out of Freeport, both hydraulic pressure lights illuminated on the annunciator panel. He extended the gear and noticed only the right gear safe light illuminated. The pilot obtained the assistance of a passenger, who retrieved the aircraft pilot operating handbook and read the appropriate procedures as the pilot followed the instructions for emergency gear extension. The pilot stated that he landed the aircraft on the right main gear, hoping this action would release the left main and nose gear. After realizing that this manoeuvre was not successful, he decided to initiate a go-around. Before he could get the aircraft airborne the left propeller made contact with the ground. The aircraft touched down approximately 9,000 feet from the threshold of runway 06; which has a total length of 11,000 feet. The aircraft travelled approximately 1,500 feet on its right main wheel before it veered off the left shoulder of the runway, struck several trees and finally came to rest pointing in a northwesterly direction. The approximate final position was measured to be 180 feet from the side of the runway. The aircraft left wing burst into flames. The left wing and left side of the fuselage was substantially damaged by fire. The four occupants escaped with only minor injuries.", "probable_cause": "The investigation determines that the probable causes of this accident to be the following;\r\n• Substandard maintenance that was performed. (Due to the improper flange on the hydraulic line, the hydraulic line came loose from its housing and depleted the fluid from the hydraulic\r\nreservoir).\r\n• Failure of the back up emergency blow down bottle system. It has been determined from inspection that the cable that connects the emergency blow down bottle system in the nose well of the aircraft to the T-handle in the cockpit, exhibited excessive play. Therefore even though the cable was pulled all the way to its fullest extent, it did not allow movement of the pin that would have provided activation of the system. Annual inspection report completed in December 2005 revealed that the portion of the Annual Inspection that required inspection of the emergency blow down bottle was not signed off by the mechanic as having been accomplished. However, the aircraft was returned to service with this discrepancy outstanding.\r\n• Pilot’s lack of qualification and unfamiliarity with this aircraft, its systems and emergency procedures. ( Evidence of falsification of qualification and time requirement exists in pilot’s logbook).\r\n• Pilot’s poor decision making and impaired judgement. (Possibility of impaired judgement due to pilot fatigue).\r\n• Pilot’s failure in assessing the severity of his situation.\r\n• Pilot’s failure to notify ATC of his problem. (Problem was discovered 20 miles prior to the accident).\r\n• Pilot’s failure to properly assess the conditions for landing and maintain vigilant situational awareness while manoeuvring the aircraft after landing. (From post accident inspection, it was noted that the flaps were not extended for the landing. Had it been extended the aircraft glide path as well as the distance required for roll out after landing may have been greatly decreased).\r\n• Pilot’s failure to take immediate action once he realized his predicament. (Pilot stated that after the propeller made contact with the ground, he decided to apply power and go around, but it was too late. Failure to act also can be attributed to possible pilot fatigue as (pilot was out all day shopping and then decided to leave at such a late hour) well as pilot’s unfamiliarity with aircraft systems and performance capabilities).\r\n• Pilot’s failure to request Emergency Service Assistance. Had this service been requested in a timely manner, preparations could have been made to prevent the fire from spreading to the degree in which it did."}