{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-2-beaver-near-ocean-falls-6-killed", "date": "Jul 30, 1981", "type": "De Havilland DHC-2 Beaver", "operator": "Air%20BC", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Ocean Falls – Vancouver – Bella Bella – Klemtu – Ocean Falls", "msn": "1573", "yom": 1964, "flight_number": null, "city": "Ocean Falls", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The float-equipped aircraft departed Vancouver with a pilot and two passengers on board. The flight proceeded approximately 330 mi north to Bella Bella where one passenger deplaned. A further stop was made at Klemtu, 39 mi north of Bella Bella, where four passengers boarded for the final leg to Ocean Falls, 35 mi further east. The aircraft failed to arrive at Ocean Falls and search and rescue action was initiated. Eleven days later the aircraft was located in a bush area, 100 yards from shore, 6 mi short of Ocean Falls; all on board had perished in the crash. The flight had originated in Ocean Falls on the morning of the accident. Evidence indicates that the pilot had received less than 4 hrs rest the previous night. On arrival in Vancouver, after an approximate 3 hr and 15 min, direct nonstop flight from Ocean Falls, the aircraft’s fuel state was very low. During refuelling it was estimated the aircraft had only 4 gal of fuel remaining following the previous flight. After refuelling and emplaning of passengers, the aircraft departed for Bella Bella. The flight lasted 3 hrs. No additional fuel was added after departure from Vancouver, although a company agent queried the pilot about his fuel state prior to his departure from Bella Bella. The pilot indicated that he had enough fuel to complete the flight from Ocean Falls via Klemtu. The aircraft then proceeded to Klemtu, and was last heard from following departure from there. The aircraft’s total flight time from Vancouver to the accident scene was approximately 3 hrs and 30 min, 15 min longer than the original, direct flight from Ocean Falls to Vancouver.\r\nSource: www.dhc-2.com", "probable_cause": "Examination of the wreckage indicated that there was no preimpact damage of any kind. Damage to the aircraft was consistent with ground impact in a flat attitude with little forward velocity. No evidence of post-impact fire, or fuel was found at the crash site. The centre and rear fuel tank bays were undamaged but the forward bay had been punctured on impact. The fuel selector was found selected to the centre tank. Draining of the aircraft’s fuel system produced only 6 oz from the rear fuel tank sump. Damage to the prop indicated that it was not rotating on impact, however, examination of the engine showed that it would have been capable of producing power had fuel been available. From the evidence examined, it is concluded that while in normal cruise configuration, at a relatively low altitude, the aircraft’s engine stopped due to fuel exhaustion. While proceeding down slope toward a small inlet, in an apparent attempt at a forced landing, the aircraft entered a rapid descent in a flat attitude, consistent with the stall, and impacted the ground heavily. Most probably, this apparent stall occurred as a result of an attempt to stretch the glide."}