{"url": "https://www.baaa-acro.com/crash/crash-fletcher-fu-24-near-taneatua-1-killed", "date": "Oct 21, 1963 at 0915 LT", "type": "Fletcher FU-24", "operator": "Adastra-Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Spraying (Agricultural)", "survivors": "No", "site": "Plain, Valley", "schedule": "Owhakatoro - Owhakatoro", "msn": "41", "yom": 1957, "flight_number": null, "city": "Taneatua", "zone": "Bay of Plenty Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off normally at about 0912 on approximately the twenty-sixth sortie of the morning. It was seen by the loader driver to commence a sowing run, but after a few seconds the flow of mixture from the hopper ceased, and the plane entered a right-hand turn which quickly developed into a steep diving turn before the plane went out of view behind a ridge. The loader driver then heard the sound of an impact. The Fletcher had crashed about 1.75 miles from the Owhakatoro Station airstrip. It was destroyed by impact forces. Fire did not occur. The pilot must have died instantly. Inspection of the crash site indicated that the the plane had first struck the face of the steep slope, at the base of which it came to rest. The right wing tip fitted neatly into the scar mark on the slope and showed that the aircraft had been in a steep bank to the right of 78 degrees. The plane had then pivoted with force into the bed of a swampy gully about 40 feet below. The weather at the time was CAVU with smooth, calm air. ", "probable_cause": "Examination of the airframe and engine revealed no pre-impact defects or failures. The loader driver testified that the engine was developing normal power at the time of the diving turn. The investigators concluded that sudden physical incapacitation of the pilot was the most likely cause of this accident."}