{"url": "https://www.baaa-acro.com/crash/crash-lockheed-c-130k-hercules-c3p-near-blair-atholl-9-killed", "date": "May 27, 1993", "type": "Lockheed C-130 Hercules", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Mountains", "schedule": "Lyneham - Kinloss", "msn": "4213", "yom": 1967, "flight_number": "Star Trek 3", "city": "Blair Atholl", "zone": "Perth and Kinross", "country": "United Kingdom", "region": "Europe", "crew_on_board": 9, "crew_fatalities": 9, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft with the call sign 'Star trek 3' was one of three Hercules aircraft from 70th Squadron, RAF Lyneham, engaged in formation and low-level navigation training over Scotland. Having completed the formation element of the sortie, the three aircraft separated for individual exercises, which, for the crew of XV193, included a simulated drop of a small cargo pack onto a dummy drop zone in a valley, (Glen Tilt) eight miles north of Pitlochry. Having completed the simulated drop exercises and turned north to begin their egress from the drop zone, a rocky outcrop forced the crew to continue the left turn. After avoiding this obstacle, the crew elected to reverse their turn to enter the narrow valley of Glen Loch and regain the original route. In performing this\r\nmanoeuvre, at low-level and low-speed, the aircraft stalled and crashed crashed forcefully into the moorland in Glen Loch (East of Glen Tilt) near Loch Loch. All nine crew members were killed. \r\nCrew (70th Squadron from RAF Lyneham):\r\nS/L Graham Paul Young,\r\nS/L Stanley Duncan Muir,\r\nF/Lt Graham Robert John Southard,\r\nF/Lt Stephen Paul McNally,\r\nF/O Jonathan Huw Owen,\r\nM/A Terence John William Gilmore,\r\nSgt Craig Thomas Hilliard,\r\nSgt Alan Keith King,\r\nLt/Cpl Gary Reginald Manning.", "probable_cause": "There were no eyewitnesses to the final moments of the flight, and the aircraft was not fitted with an Accident Data Recorder or Cockpit Voice Recorder. The Board of Inquiry's investigation therefore remains conjecture; notwithstanding that specialist advice from various sources, including the Air Accident Investigation Branch of the Department of Transport and the aircraft manufacturer supports their findings. The investigation found that the cause of the accident was consistent with the aircraft having stalled at an altitude from which recovery was impossible."}