{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-9-14-detroit-8-killed", "date": "Dec 3, 1990 at 1345 LT", "type": "Douglas DC-9", "operator": "Northwest%20Airlines2", "flight_phase": "Taxiing", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Detroit - Pittsburgh", "msn": "45708", "yom": 1966, "flight_number": "NW1482", "city": "Detroit-Metropolitan-Wayne County", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 1, "pax_on_board": 40, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 23000, "captain_hours_type": 4000, "copilot_hours": 4500, "copilot_hours_type": null, "aircraft_hours": 62253, "circumstances": "On December 3, 1990, at 1345 est, Northwest flight 1482, a DC-9 (N3313L), and Northwest flight 299, a Boeing 727 (N278US), collided near the intersection of runway 09/27 and 03C/21C in dense fog at Detriot-Metropolitan-Wayne County Airport, MI. At the time of the collision, the B-727 was on its takeoff roll, and the DC-9 had just taxied onto the active runway. The B-727 was substantially damaged, and the DC-9 was destroyed. Seven of the 40 passengers and 1 crew member aboard the DC-9 received fatal injuries. None of the 146 passengers and 8 crewmembers aboard the B-727 were injured.", "probable_cause": "Lack of proper crew coordination, including virtual reversal of roles by the DC-9 pilots, which led to their failure to stop taxiing and alert ground controller of their positional uncertainty in a timely manner before and after intruding onto the active runway. Contributing to cause of accident were:\r\n- Deficiencies in ATC services provided by Detroit tower, including failure of ground control to take timely action to alert local controller to possible runway incursion, inadequate visibility observation, failure to use progressive taxi instructions low-visibility conditions, and issuance of inappropriate and confusing taxi instructions compounded by inadequate backup supervision for level of experience of staff on duty; \r\n- Deficiencies in surface markings, signage and lighting at airport and failure of FAA surveillance to detect or correct any of these deficiencies;\r\n- Failure of Northwest Airlines to provide adequate cockpit resource management training to line aircrews. Contributing to fatalities was inoperability of DC-9 internal tailcone release mechanism. Contributing to number and severity of injuries was failure of crew of DC-9 to properly execute the passenger evacuation."}