{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-120er-brasilia-rio-branco-23-killed", "date": "Aug 30, 2002 at 1800 LT", "type": "Embraer EMB-120 Brasília", "operator": "Rico", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cruzeiro do Sul – Tarauacá – Rio Branco", "msn": "120-043", "yom": 1987, "flight_number": "RLE4823", "city": "Rio Branco-Presidente Médici", "zone": "Acre", "country": "Brazil", "region": "South America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 28, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 23, "captain_hours": 9315, "captain_hours_type": 4560, "copilot_hours": 4242, "copilot_hours_type": 3585, "aircraft_hours": null, "circumstances": "Following an uneventful flight from Tarauacá, the crew started the descent to Rio Branco-Presidente Médici Airport in limited visibility due to the night and rain falls. On final, the aircraft descended below the MDA and, at a speed of 130 knots, struck the ground and crashed in a field located 4 km short of runway 06. The aircraft was totally destroyed. Eight passengers were rescued while 23 other occupants were killed, among them the Brazilian politician Ildefonço Cardeiro. ", "probable_cause": "The exact cause of the accident could not be determined with certainty. However, it is believed that the accident was the consequence of a controlled flight into terrain after the crew continued the approach in poor weather conditions and descended below the MDA until the aircraft, in a flaps and gear down configuration, impacted ground. The following contributing factors were identified:\r\n- A difference of 70 feet in the settings was noted between both pilot's altimeters, \r\n- Poor crew coordination,\r\n- Complacency on part of the flying crew caused several deviations from procedures during the approach, \r\n- Lack of crew resources management, \r\n- The crew failed to check the altitude during the final stage of the approach, \r\n- Poor weather conditions. "}