{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226ac-metro-ii-denver", "date": "Apr 15, 2003 at 2041 LT", "type": "Swearingen SA226 Metro II", "operator": "Superior%20Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Gunnison - Denver", "msn": "TC-305", "yom": 1979, "flight_number": "HKA1813", "city": "Denver-Intl", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 4565, "captain_hours_type": 2179, "copilot_hours": 2517, "copilot_hours_type": 1400, "aircraft_hours": 31643, "circumstances": "The flight was following a heavy jet on landing approach. The crew agreed to fly the approach at a slightly higher altitude than normal to avoid any possible wake turbulence. The first officer, who was flying the airplane, called for the landing gear to be lowered. When the captain placed the gear handle in the DOWN position, he noted red IN-TRANSIT lights. He recycled the landing gear, but got the same result. He consulted the emergency checklist and thought he had manually extended the landing gear because he \"heard the normal 'clunk feel' and airspeed started to decay.\" In addition, when power was reduced to FLIGHT IDLE, the GEAR UNSAFE warning horn did not sound. The first officer agreed, noting 2,000 pounds of hydraulic pressure. The airplane landed wheels up. Propeller blade fragments penetrated the fuselage, breaching the pressure vessel. Postaccident examination revealed the nose gear had been partially extended but the main landing gear was retracted. The crew said the GEAR UNSAFE indication had been a recurring problem with the airplane. The problem had previously been attributed to a frozen squat switch in the wheel well.", "probable_cause": "The failure of the landing gear system and the flight crew's failure to ascertain that the landing ear was down and locked. A contributing factor was the inadequate maintenance inspections performed by maintenance personnel."}