{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-augusta-3-killed", "date": "Aug 19, 1971 at 2140 LT", "type": "Piper PA-31-310 Navajo", "operator": "Downeast%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Boston - Augusta", "msn": "31-422", "yom": 1969, "flight_number": "DE88", "city": "Augusta", "zone": "Maine", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 7, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 3100, "captain_hours_type": 625, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2468, "circumstances": "The aircraft departed Boston-Logan at 2028LT bound to Augusta with seven passengers and a pilot on board. At the origin, the flight was scheduled to Rockland but it was not possible to land there due to foggy conditions. The flight was cleared for a VOR approach at 2114LT. At 2127LT, flight 88 reported a missed approach and was cleared for another VOR approach at that time. At 2140LT, the flight reported 'four miles out'. This was the last known transmission made by the flight. The wreckage was located in a heavily wooded area on Allen Hill at approximately the 520 foot level. Allen Hill is a prominent terrain feature which is 640 feet high, located approximately 4 nautical miles from the threshold of runway 17 and eight-tenth of a mile west of the approach radial. The pilot and two passengers were killed, two passengers received serious injuries and three passengers received minor injuries. ", "probable_cause": "The NTSB determines that the probable cause of this accident was the improper action of the pilot in discontinuing the execution of a non-precision instrument approach and attempting to maintain visual flight while operating in instrument flight conditions at an altitude below the level of obstructing terrain. "}