{"url": "https://www.baaa-acro.com/crash/crash-fairchild-c-119g-flying-boxcar-huntingdon-4-killed", "date": "Feb 26, 1954 at 1450 LT", "type": "Fairchild C-119 Flying Boxcar", "operator": "United%20States%20Air%20Force", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "City", "schedule": "Fort Benning - Fort Benning", "msn": "11061", "yom": 1952, "flight_number": null, "city": "Huntingdon", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1188, "captain_hours_type": 436, "copilot_hours": 444, "copilot_hours_type": 104, "aircraft_hours": null, "circumstances": "The crew left Fort Benning-Lawson AFB in Columbus, Georgia, at 1334LT on a training flight to Maxwell AFB, Montgomery, Alabama. The training program consisted of approaches, touch and goes and landings. After takeoff from Fort Benning, the captain decided to modify his schedule and flew to the northwest to Huntingdon, Tennesse, where he came from. This city is more than 300 miles northwest from Fort Benning. Approaching Huntingdon, the captain reduced his altitude and completed a first low pass over the city. Few minutes later, at a speed of 230 knots, he made a second low pass over the city when the plane hit the roof of a house and disintegrated on a field. All four crew members were killed while nobody on the ground was injured. \r\nCrew:\r\n1st Lt Jack C. Jenkins, pilot,\r\n2nd Lt John C. Peachey, copilot,\r\nA2c Franklin D. Levy, flight engineer, \r\nA2c David A. Probus, flight engineer. ", "probable_cause": "The aircraft disintegrated as a result of stress applied beyond the designed load limits. Inspection of the engines disclosed no malfunction of the power recovery turbines. The pilot violated several procedures by operating an aircraft in a careless and reckless manner, by flying over a congested area at less than 2,000 feet above the highest obstacle within a radius of 2,000 feet, by disregarding established boundaries of the local flying area and proceeding to a point approximately 170 nautical miles outside of the prescribed flying area while operating on a local flight clearance. In addition, the pilot failed to follow instructions for accomplishing scheduled crew training published by squadron training directive and as briefed by the Squadron Operations Officer. The pilot had made two extremely low and high speed passes over the town of Huntingdon. "}