{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-madeira-1-killed", "date": "Mar 12, 2019 at 1516 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Marc%20Inc", "flight_phase": "Flight", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "City", "schedule": "Cincinnati - Cincinnati", "msn": "31-8152002", "yom": 1981, "flight_number": null, "city": "Madeira", "zone": "Ohio", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 6421, "captain_hours_type": 1364, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 19094, "circumstances": "The commercial pilot was conducting an aerial observation (surveying) flight in a piston engineequipped multiengine airplane. Several hours into the flight, the pilot advised air traffic control (ATC) that the airplane had a fuel problem and that he needed to return to the departure airport. When the airplane was 8 miles from the airport, and after passing several other airports, the pilot informed ATC that he was unsure if the airplane could reach the airport. The final minutes of radar data depicted the airplane in a descent and tracking toward a golf fairway as the airplane's groundspeed decreased to a speed near the single engine minimum control airspeed. According to witnesses, they heard an engine sputter before making two loud \"back-fire\" sounds. One witness reported that, after the engine sputtered, the airplane \"was on its left side flying crooked.\" Additional witnesses reported that the airplane turned to the left before it \"nose-dived\" into a neighborhood, impacting a tree and private residence before coming to rest in the backyard of the residence. A witness approached the wreckage immediately after the accident and observed a small flame rising from the area of the left engine. Video recorded on the witness' mobile phone several minutes later showed the airplane engulfed in flames. Examination of the wreckage revealed no evidence of any preimpact mechanical malfunctions or failures of either engine. The fuel systems feeding both engines were damaged by impact forces but the examined components generally displayed that only trace amounts of fuel remained; with the exception of the left engine nacelle fuel tank. Given the extent of the fire damage to this area of the wreckage, and the witness report that the post impact fire originated in this area, it is likely that this tank contained fuel. By design, this fuel in this tank was not able to supply fuel directly to either engine, but instead relied on an electric pump to transfer fuel into the left main fuel tank. Fire damage precluded a detailed postaccident examination or functional testing of the left nacelle fuel transfer pump. Other pilots who flew similar airplanes for the operator, along with a review of maintenance records for those airplanes, revealed at least three instances of these pumps failing in the months surrounding the accident. The other pilots also reported varying methods of utilizing fuel and monitoring fuel transfers of fuel from the nacelle fuel tanks, since there was no direct indication of the quantity of fuel available in the tank. These methods were not standardized between pilots within the company and relied on their monitoring the  quantity of fuel in the main fuel tanks in order to ensure that the fuel transfer was occurring. Had the pilot not activated this pump, or had this pump failed during the flight, it would have rendered the fuel in the tank inaccessible. Given this information it is likely that the fuel supply available to the airplane's left engine was exhausted, and that the engine subsequently lost power due to fuel starvation. The accident pilot, along with another company pilot, identified fuel leaking from the airplane's left wing, about a week before the accident. Maintenance records showed no actions had been completed to the address the fuel leak. Due to damage sustained during the accident, the origin of the fuel leak could not be determined, nor could it be determined whether the fuel leak contributed to the fuel starvation and eventual inflight loss of power to the left engine. Because the left engine stopped producing power, the pilot would have needed to configure the airplane for single-engine flight; however, examination of the left engine's propeller found that it was not feathered. With the propeller in this state, the pilot's ability to maintain control the airplane would have been reduced, and it is likely that the pilot allowed the airplane's airspeed to decrease below the singleengine minimum controllable airspeed, which resulted in a loss of control and led to the airplane's roll to the left and rapid descent toward the terrain. Toxicology results revealed that the pilot had taken doxylamine, an over-the-counter antihistamine that can decrease alertness and impair performance of potentially hazardous tasks. Although the toxicology results indicated that the amount of doxylamine in the pilot's cavity blood was within the lower therapeutic range, review of ATC records revealed that the pilot was alert and that he was making necessary decisions and following instructions. Thus, the pilot's use of doxylamine was not likely a factor in the accident.", "probable_cause": "Fuel starvation to the left engine and the resulting loss of engine power to that engine, and a loss of airplane control due to the pilot's failure to maintain the minimum controllable airspeed."}