{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-049-constellation-washington", "date": "Mar 29, 1946 at 1234 LT", "type": "Lockheed L-049 Constellation", "operator": "Trans%20World%20Airlines.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris – Shannon – Gander – New York – Washington", "msn": "2034", "yom": 1945, "flight_number": "TW955", "city": "Washington-National", "zone": "Virginia", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6200, "captain_hours_type": 155, "copilot_hours": 11000, "copilot_hours_type": 53, "aircraft_hours": 489, "circumstances": "The flight was cleared to Washington National Airport by the Washington control tower and Instructed to use Runway 21 However, because it had been necessary to bear to the left when northeast of the airport to a position from which approach to Runway 21 was, not practicable, the flight was asked by Washington Tower if it desired to use a right-hand. Pattern for Runway 36 The flight replied that it desired clearance for Runway 27, and, as the wind was calm, Washington Tower approved this request. The flight approached the field from the northeast and while over the east bank of the Potomac River approximately 2/3 of a mile from the boundary of the airport, turned to the right and started a descent in final approach to Runway 27. According to the testimony of the pilots, Initial contact was made with the runway between 800 and 1,000 feet from the approach end and the aircraft continued down the runway with less than normal deceleration, Approximately 600 feet from the far end of the runway the pilot attempted a turn to the right. After turning approximately 30 degrees, the aircraft rolled beyond the runway end and struck a concrete transformer housing. The aircraft whipped approximately 90 degrees to the right and came to rest across a drainage ditch with its empennage extending over the highway which adjoins the airport. All twelve occupants were evacuated safely while the aircraft was damaged beyond repair. ", "probable_cause": "The Board determines that the probable cause of this accident was the poor judgement of the flight crew in attempting to land from a position which did not afford sufficient time to accomplish a satisfactory approach. A contributing factor was the peer landing technique of the pilot in falling to reduce the air sufficiently for a safe landing. A further contributing factor was the lack of knowledge on the part of the crew concerning the poor braking action of rubber tires on a wet runway."}