{"url": "https://www.baaa-acro.com/crash/crash-learjet-24-near-felt-3-killed", "date": "Oct 1, 1981 at 1502 LT", "type": "Learjet 24", "operator": "Sky Train Air", "flight_phase": "Flight", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Plain, Valley", "schedule": "Thermopolis - Casper - McAllen", "msn": "24-146", "yom": 1967, "flight_number": null, "city": "Felt", "zone": "Oklahoma", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 6404, "captain_hours_type": 28, "copilot_hours": 17500, "copilot_hours_type": null, "aircraft_hours": 7412, "circumstances": "While on a return flight to their company headquarters in McAllen, Texas, from Thermopolis, Wyoming, the president of Sky Train Air Inc., the chief pilot, and another company pilot stopped in Casper, Wyoming, for fuel. The lineman noted a fuel imbalance when 320 gallons of fuel were added to the left wing and only 260 gallons of fuel were added to the right wing tanks. According to the lineman, the crew was aware of the imbalance. A total of 585 gallons of Jet-A with Prist (anti-ice additive) was supplied which filled the wing tanks to capacity. No fuel transferring was necessary during the refueling. The lineman stated that he believed the fuselage tank was full because the nosegear strut was extended 6 to 12 inches. We stated a ground power unit was used to start the engines and he did not notice any difficulties with the aircraft during the crew's preflight checks. The flight plan filed by the president, reported to be the pilot-in-command, as follows: IFR to McAllen, Texas, at Flight Level (FL) 450, true airspeed 450 knots, Airway J170 to Denver, J17 to Amarillo, J17 to San Antonio, J25 to Corpus Christi, direct McAllen; time en route 2 hours 20 minutes with 3 hours 40 minutes of fuel on board. A weather briefing was not given to him because he had reported that he already had the weather information. The crew called the Casper Air Traffic Control Tower for taxi clearance at 1352:08 and began its departure from runway 21 at 1357:02. At 1449:39, while in cruise flight at FL 450, the flightcrew made initial radio contact with Sector 71 of the Albuquerque Air Route Traffic Control Center (ARTCC). The aircraft was \"squawking\" transponder code 0670. About 1458, a new controller took over the radar and data positions. At 1459:36, he issued a frequency change to which the crew did not respond. At the time, the controller noticed no transponder target reply from the aircraft. Until 1501:39, he made several attempts to contact the aircraft, but received no response. Albuquerque ARTCC radar computer data showed that radar contact with the aircraft was lost at 1458:07 at FL447. Five witnesses at Felt, Oklahoma, located in the southwest portion of the Panhandle, heard an aircraft overhead at a very high speed. One witness stated that he heard a vibration sound which indicated to him the aircraft was overspeeding. Another witness stated that the aircraft was about lo break the sound barrier. Of the five witnesses interviewed, only one saw the aircraft - and only momentarily - and he stated the aircraft was in about a 45° descent angle and the wings appeared to be rocking up and down. All the witnesses stated that they heard an explosion and saw a mushroom cloud of black smoke erupt when the aircraft crashed to the ground. The accident occurred at approximately 1502LT. The aircraft crashed 2.5 miles southwest of Felt, Oklahoma. All three occupants were killed. ", "probable_cause": "A loss of control, possibly initiated by an unexpected encounter with moderate to severe clear air turbulence, which caused the aircraft to depart the narrow flight envelope boundaries in which it was operating and from which recovery was not effected, the flightcrew's lack of adequate training and experience in the Learjet; and the aircraft's marginal controllability characteristics near and beyond the boundaries of its flight envelope. Contributing to the accident was the flightcrew's probable extension of the spoilers in an overspeed situation, a procedure that had been prescribed in the approved aircraft flight manual until 1 year before the accident."}