{"url": "https://www.baaa-acro.com/crash/crash-handley-page-hpr7-dart-herald-202-musquodoboit-8-killed", "date": "Mar 17, 1965 at 0922 LT", "type": "Handley Page HPR-7 Dart Herald", "operator": "Eastern%20Provincial%20Airways", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Moncton – Summerside – Charlottetown – New Glasgow – Halifax – Sydney – Deer Lake – Gander – Torbay", "msn": "160", "yom": 1962, "flight_number": "PV102", "city": "Musquodoboit", "zone": "Nova Scotia", "country": "Canada", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 5, "pax_fatalities": 5, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 20200, "captain_hours_type": 1000, "copilot_hours": 11960, "copilot_hours_type": 1000, "aircraft_hours": 4135, "circumstances": "Flight 102 was a scheduled domestic flight from Moncton to Torbay, Newfoundland, with scheduled stops at Summerside, Charlottetown, Prince Edward Island, New Glasgow, Halifax and Sydney, Nova Scotia, Deer Lake, Gander and Torbay, Newfoundland. It took off from Moncton, New Brunswick at 0635 hours Atlantic Standard Time. The flight was routine as far as Halifax where a 36-minute stopover was made. No aircraft unserviceabilities were reported by the crew during the stopover. The flight departed Halifax for Sydney at 0910 hours. It was cleared to depart runway 33, to turn right and climb on course to an altitude of 13 000 ft via Victor 312 Airway to the Sydney omnirange station. Following take-off, it was requested to report reaching 13 000 ft and this was acknowledged. There was no further communication between the aircraft and Air Traffic Control. At 0915 hours the aircraft contacted the airline's radio facility at Halifax and transmitted flight data as follows: time out 0908 hours and off at 0912 hours along with an estimated time of arrival at Sydney of 0959 hours. This was the last known transmission from the aircraft. No difficulty was reported by the crew. Nineteen witnesses located about three miles north-north-east of the accident site and about 2 miles south-east the centre line of Victor 312 Airway testified that an unusual noise attracted their attention to an aircraft flying on an easterly heading and that the tail unit and, later on, the nose section separated from the aircraft, whereupon it went out of control and crashed 45 to 60 seconds after. The time of the accident was calculated to be approximately 0922 hours. The aircraft was destroyed and all eight occupants were killed.", "probable_cause": "Failure of corroded skin area along the bottom centre line of the aircraft beneath stringer No.32 which resulted in structural failure of the fuselage and aerial disintegration. The precise nature and origin of the skin corrosion has not been determined. "}