{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-76td-baucau-6-killed", "date": "Jan 31, 2003 at 1521 LT", "type": "Ilyushin II-76", "operator": "Euro Asia Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Macau - Baucau", "msn": "00534 65941", "yom": 1985, "flight_number": null, "city": "Baucau", "zone": "All Timor Leste", "country": "Timor Leste", "region": "Asia", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 14500, "captain_hours_type": null, "copilot_hours": 6800, "copilot_hours_type": null, "aircraft_hours": 2349, "circumstances": "Carrying 31 tons of telecommunications equipments for a Portuguese telephone company, the aircraft departed Macau to Baucau with two passengers and four crew members. On approach, the aircraft impacted terrain near Caicido village during a landing approach, about 1 NM (1.87 km) to the northwest of Cakung Airport, Baucau, Timor-Leste. The pilot in command was the handling pilot during the descent and approaches at Baucau. The aircraft was destroyed by impact forces and a severe post-impact fire, and the six occupants were fatally injured. The occupants included the flight crew, which comprised the pilot in command, the copilot, the flight navigator and the flight engineer, and two loadmasters who did not form part of the flight crew. At the time of the occurrence, there was low cloud near the aerodrome.2 Witnesses at the aerodrome estimated the cloud base to be about 1,000 ft (305 m) above ground level, and visibility to be about 1,500 m (0.8 NM). Before the aircraft’s departure from Macau, the flight crew was provided with notices to airmen (NOTAMs) and weather forecast information for the planned flight. The weather information provided to the flight crew did not include a terminal aerodrome forecast (TAF), or an aviation routine weather report (METAR) for Baucau. Those weather forecasts were not produced for Baucau.", "probable_cause": "The following findings were identified:\r\nAir Traffic Services:\r\n1. ATS was not available at Baucau at the time of the occurrence.\r\n2. There was no procedure in place to provide flight crews of aircraft engaged in non-UN operations with an altimeter subscale setting for Baucau at the time of the occurrence.\r\nOrganisational factors:\r\n1. Neither the Lao-based company, nor the Cambodian-based company, sought the consent for the proposed sublease, dated 18 November 2002, and accordingly the inferred sublease had not been finalised.\r\n2. The Cambodian-based company was not the operator of the aircraft for the occurrence flight.\r\n3. The Lao PDR was the State of Registry and State of the Operator.\r\n4. The Lao DCA was responsible for the continued surveillance of the operator to ensure that the required standards of operation were maintained.\r\n5. The operator provided flight crews with inflight CFIT avoidance procedures in its operations manual.\r\nCFIT risk exposure:\r\n1. The planned flight from Macau to Baucau was exposed to moderate risk of a CFIT event, based on historical CFIT data and the Transport Canada simple method of risk analysis.\r\n2. The destination risk factors, type of operation, area of operation, weather conditions, and flight crew non-compliance with published procedures increased the CFIT risk exposure of the planned flight to an above-average level.\r\n3. The consequences of the accident were catastrophic and resulted in loss of human life and damage to property and the environment.\r\n4. Those catastrophic consequences resulted from the flight crew’s disregard of established procedures; that disregard bypassed all the safety criteria and inbuilt risk treatments in the design of those procedures and steadily increased the CFIT risk exposure to an extreme level during the latter stages of the flight.\r\nSignificant factors:\r\n1. The flight crew did not comply the published non-precision instrument approach and/or missed approach procedures at Baucau during flight in instrument meteorological conditions.\r\n2. The flight crew conducted user-defined non-precision instrument approaches to runway 14 at Baucau during flight in instrument meteorological conditions. \r\n3. The pilot in command permitted the aircraft to descend below the MDA(H) published on both the Jeppesen and CAD runway 14 instrument approach charts during flight in instrument meteorological conditions.\r\n4. The flight crew did not recognise the increased likelihood and therefore risk of CFIT.\r\n5. The flight crew did not recognise or treat that risk in a timely manner."}