{"url": "https://www.baaa-acro.com/crash/crash-avro-748-2b-faa-cheney-2-killed", "date": "Sep 15, 1988 at 1019 LT", "type": "Avro 748", "operator": "Bradley%20Air%20Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "No", "site": "Plain, Valley", "schedule": "Montreal - Ottawa", "msn": "1789", "yom": 1981, "flight_number": null, "city": "Cheney", "zone": "Ontario", "country": "Canada", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "A BAe-748 cargo plane was destroyed when it crashed while on approach to Ottawa International Airport, ON (YOW), Canada. Both pilots were killed. The airplane had arrived at Montreal-Dorval International Airport, QC (YUL) following a cargo flight from Dayton, OH, USA. All the cargo was unloaded in Montreal and the aircraft departed at 09:58 for Ottawa on an instrument flight rules (IFR) flight plan. The en route phase of the flight were uneventful. At about 10:19, while the aircraft was in level cruise flight at 3000 feet at approximately 200 knots indicated airspeed (KIAS), the flight data recorder (FDR) recorded a full-up deflection of the left aileron and a full-down deflection of the right aileron, and the aircraft began a roll to the left at a high rate. The right aileron remained at the fully-deflected position for a period of three seconds, and then, over the next seven seconds, the deflection gradually decreased by about five degrees. During the same 10-second period, the left aileron remained nearly fully deflected for the first eight seconds, then the deflection decreased by about five degrees during the next two seconds. By this time, the aircraft had rolled through approximately 460 degrees, and the aircraft nose had dropped 20 to 30 degrees below the horizon. At this point, the ailerons suddenly returned to about the neutral position and remained there for the last three seconds of the flight. The aircraft bank angle remained at approximately 90 degrees of left bank with a maximum vertical g of 4.7 recorded. The aircraft struck the ground at an airspeed of approximately 290 KIAS after a heading change of about 75 degrees left of the cruise heading. At impact, the aircraft bank angle was nearly 90 degrees left and the pitch angle was 41 degrees down. The time from the initial aileron deflection to ground impact was approximately 18 seconds.", "probable_cause": "The Board determined that the aileron control system was asymmetrically rigged, making it susceptible to aerodynamic overbalance. The operator did not conduct the required post-maintenance flight tests of the aileron control response. When the ailerons were held at full deflection by aerodynamic forces, following a large control-wheel input by the pilot, the subsequent control reaction by the pilot was inappropriate. Contributing to the accident were the design of the aileron system; ambiguous and incomplete maintenance instructions; a lack of published information for flight crew concerning aileron system performance and possible emergencies; and the presence of factors which may have led to the development of flight crew fatigue."}