{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-chariton-1-killed", "date": "Sep 7, 2016 at 1219 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Wolf Aviation - USA", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Olathe - Ankeny", "msn": "46-8408042", "yom": 1984, "flight_number": null, "city": "Chariton", "zone": "Iowa", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 242, "captain_hours_type": 118, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The noninstrument-rated private pilot was conducting a visual flight rules (VFR) cross-country flight while receiving VFR flight following services from air traffic control. Radar data and voice\r\ncommunication information indicated that the airplane was in cruise flight as the pilot deviated around convective weather near his destination. The controller issued a weather advisory to the pilot concerning areas of moderate to extreme precipitation along his route; the pilot responded that he saw the weather on the airplane's NEXRAD weather display system and planned to deviate around it before resuming course. About 3 minutes later, the pilot stated that he was around the weather and requested to start his descent direct toward his destination. The controller advised the pilot to descend at his discretion. Radar showed the airplane in a descending right turn before radar contact was lost at 2,900 ft mean sea level. There were no eyewitnesses, and search personnel reported rain and thunderstorms in the area about the time of the accident. The distribution of the wreckage was consistent with an in-flight breakup. Examination of the airframe revealed overload failures of the empennage and wings. No pre-impact airframe structural anomalies were found, and the propeller showed evidence of rotation at the time of impact. Further, there was no evidence of pilot impairment or incapacitation. Review of weather information indicated that the pilot most likely encountered instrument meteorological conditions as the airplane descended during the last several minutes of flight. During this time, it is likely that the pilot became disoriented while attempting to maneuver in convective, restricted visibility conditions, and lost control of the airplane. The transition from visual to instrument flight conditions would have been conducive to the development of spatial disorientation; the turning descent before the loss of radar contact and the in-flight breakup are also consistent with a loss of control due to spatial disorientation.", "probable_cause": "The non-instrument-rated pilot's loss of control due to spatial disorientation in instrument meteorological conditions, which resulted in an exceedance of the airplane's design stress limitations and a subsequent in-flight breakup. Contributing to the accident was the pilot's decision to continue visual flight into convective instrument meteorological conditions. "}