{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-110p1-bandeirante-inverness-1-killed", "date": "Nov 19, 1984 at 2059 LT", "type": "Embraer EMB-110 Bandeirante", "operator": "EuroAir", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Aberdeen – Inverness – Edinburgh", "msn": "110-294", "yom": 1980, "flight_number": null, "city": "Inverness", "zone": "Inverness-shire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 2800, "captain_hours_type": 95, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off at 2055 hrs and the ATC stated that the take-off appeared to be normal. However, three witnesses standing outside the terminal buildings state that the aircraft appeared to maintain an unusually level flight path, about 100 feet, until they lost sight of it behind the buildings. Whichever of these take-off profiles was followed, the aircraft climbed ahead to a position short of Inverness town, and returned on an approximately reciprocal track to intercept and take up the 175° radial from the VOR beacon on the airfield. Approximately 4 minutes after takeoff, the aircraft was seen flying, apparently level, in a southerly direction at a height which was unspecified but low enough to be below the main cloud base. Less than a minute later a 'dying orange glow' was seen in the area of the accident site. A search was commenced shortly afterwards but due to uncertainty about the aircraft's position it was not until early on the morning of 21 November, when the weather cleared, that the wreckage of the aircraft was found. The aircraft had flown into the side of a hill at 1,600 feet amsl and disintegrated on impact. There were only small areas of locally contained fire. The pilot, sole on board, was killed. ", "probable_cause": "Although various hypotheses could be formulated to fit these flight profiles, there is no evidence which would enable a determination as to the cause of the accident to be made with any degree of certainty."}