{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-351c-mwanza", "date": "Feb 3, 2000 at 1736 LT", "type": "Boeing 707", "operator": "Trans%20Arabian%20Air%20Transport", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Khartoum - Mwanza - Brussels", "msn": "19412", "yom": 1967, "flight_number": "TRT310", "city": "Mwanza", "zone": "Mwanza Region", "country": "Tanzania", "region": "Africa", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 19000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 51200, "circumstances": "The aircraft was departed Khartoum for a flight to Mwanza where it was supposed to pick up a cargo of 38 tonnes of fish fillet from Vick Fish Processors for delivery in Europe. When it went dark en route to Mwanza, the radio altimeter integral light was found to be unserviceable. The crew were not able to fix the problem and the continued using the FMS. The crew contacted Mwanza tower at 16:58 and were being advised that there was no power at the airport and that efforts were being made to use a standby generator. Further information passed on the crew reportedly included VOR, DME and NDB all unserviceable, weather: wind calm, 8 km visibility, temperature 25deg C and QNH 1015. After holding for 10 minutes, the airport generator came on and the runway lights went on. The first officer, who was pilot flying, started a visual runway 12 approach. When well established on finals with full landing configuration, the captain told the f/o that he was too low, and a few seconds later he told the f/o he was too high. Both the captain and the flight engineer then told the f/o to go around. The f/o overshot and climbed to 5500 feet on the downwind leg. Turning on the left base the captain remarked that the turn was too tight: \".. I will do a 360-degree turn to the right and position you finals\". The captain thus took over control and started a right turn at 4400 feet. Just before completing the turn, the f/o said: \"do not go down anymore, the altimeter is reading 4100 feet\". Almost aligned with the runway, the f/o took over control again. At that same moment the aircraft bounced 2 or 3 times yawing to the left and came down to a halt in the middle of the lake.", "probable_cause": null}