{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154b-1-sharjah-85-killed", "date": "Dec 15, 1997 at 1835 LT", "type": "Tupolev TU-154", "operator": "Tajik%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dushanbe - Sharjah", "msn": "78A281", "yom": 1978, "flight_number": "TZK3183", "city": "Sharjah", "zone": "Sharjah (الشارقةّ)", "country": "United Arab Emirates", "region": "Asia", "crew_on_board": 7, "crew_fatalities": 6, "pax_on_board": 79, "pax_fatalities": 79, "other_fatalities": 0, "total_fatalities": 85, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Following an uneventful flight, the aircraft entered the UAE airspace and was cleared by Dubai ATC to successively descend to FL170, 100, 060 and 025 via heading 190. Passing 3,460 feet on descent, the crew was cleared to continue to 1,500 feet when, at an altitude of 1,800 feet, the aircraft entered an area of turbulences. The level of 1,500 feet was reached 15 km from the runway 30 threshold. For unknown reasons, the crew failed to report he was passing 1,500 feet and was then instructed to continue via heading 270 for the final approach to runway 30. In a relative limited visibility, the crew initiated a right turn at a speed of 400 km/h then lowered the landing gear. At an altitude of 820 feet, an alarm sounded in the cockpit, informing the crew about an excessive angle of attack. The captain corrected the pitch from 20° to 14° when few seconds later, at an altitude of 690 feet, the aircraft entered a second area of turbulences. The captain realized his altitude was insufficient and requested an increase of engine power when the aircraft struck the ground and crashed 13 km short of runway, bursting into flames. The copilot was the only survivor while 85 other occupants were killed. The aircraft disintegrated on impact. ", "probable_cause": "The accident was the consequence of a controlled flight into terrain. \r\nThe following findings were reported:\r\n- The crew failed to follow the approach published procedures, \r\n- The crew continued the approach below the MDA until the aircraft collided with terrain, \r\n- The crew failed to proceed to the usual approach briefing and checks, \r\n- Lack of visibility due to the night, \r\n- Crew fatigue, \r\n- Lack of crew mutual crosscheck during descent, \r\n- Lack of crew coordination, \r\n- Turbulences in the approach path,\r\n- Non compliance to published procedures. "}