{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-ii-dillon-2-killed", "date": "May 3, 2007 at 1037 LT", "type": "Cessna 550 Citation II", "operator": "Hamilton%20Ranches_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Rockford - Dillon", "msn": "550-0103", "yom": 1986, "flight_number": null, "city": "Dillon", "zone": "Montana", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 5057, "captain_hours_type": 1200, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 10526, "circumstances": "Radar data indicated that the airplane descended on a straight track from flight level (FL) 380 in accordance with the pilot's clearance to descend to 13,000 feet and begin the VOR (very high frequency omni-directional radio range) approach to the destination airport. The last transmission from the pilot was an acknowledgment of the cancellation of radar service and an instruction to switch to the airport advisory frequency. At that time, the airplane was at a mode C reported altitude of 14,000 feet. The airplane maintained a steady descent rate for the next minute and leveled off at 13,000 feet. About 2 1/2 minutes later, the airplane began a turn to the right to head outbound for the procedure turn on the approach and descended to 12,900 feet. The approach procedure specified a minimum altitude of 8,200 feet in the procedure turn. The airplane lost 1,600 feet in the next 10 seconds, and this was the last radar contact. A witness working in his office at the airport heard a loud engine noise, and then a “plop” noise. He said that the engine noise was loud, then softer, and then loud again. He heard it for 3 to 5 seconds. Another witness saw an airplane below the cloud bases that was turning to the right with a nose low pitch attitude of about 75 to 80 degrees. It made six to seven turns before it disappeared from sight behind terrain, and the radius of the turn got tighter as the airplane descended. Examination of the airframe, systems, and engines revealed no anomalies that would have precluded normal operation. Anti-ice fluid was on the leading edges of the wing and tail anti-ice panels. An Airmen’s Meteorological Information (AIRMET) in effect for an area that included the accident site noted that the freezing level was from 4,000 to 10,000 feet with the potential for icing from the freezing level to 20,000 feet.\n", "probable_cause": "An in-flight loss of control for undetermined reasons."}