{"url": "https://www.baaa-acro.com/crash/crash-boeing-707-321b-marana-1-killed", "date": "Sep 20, 1990 at 0707 LT", "type": "Boeing 707", "operator": "Omega%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Marana - Davis Monthan", "msn": "20028", "yom": 1968, "flight_number": null, "city": "Marana-Pinal Airpark", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 13192, "captain_hours_type": 4000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 34965, "circumstances": "Witnesses reported 1st attempt to takeoff was aborted after aircraft swerved left and right. On 2nd try, aircraft lifted off about halfway down runway. After lift-off, it rolled right, right wing hit ground and aircraft crashed. Investigations revealed rudder trim was 7.9 to 8.3 units (79% to 83%) nose right. Simulator tests with that setting resulted in consistent right wing collisions with ground after liftoff. Crew's checklist referred to mech checklist for critical items to check before takeoff. Mech checklist and 50 of 54 flight instruments had been removed from aircraft, leaving 2 airspeed indicators, altimeter and standby gyro horizon. In 60 simulated takeoffs in this configuration, there was evidence of insufficient attitudinal ref to recognize rolling of aircraft before sufficient altitude was attained. FAA's designated airworthiness rep (dar) had inspected aircraft three days before and issued ferry permit. He lacked FAA mechanical certification and experience with large aircraft. FAA order 8000.62 and ac 183.33 lacked specific guidance for selection, training and oversight of dar activity. Also, lack of guidance concerning minimum equipment list. Pilot not current or medical qualified to fly aircraft. ", "probable_cause": "Improper preflight planning/preparation by the pilot, and his failure to use a checklist. Factors related to the accident were: the faa's inadequate surveillance of the operation, the FAA's insufficient standards/requirements, the pilot's operation of the aircraft with known deficiencies, and his lack of recent experience in the type of aircraft."}