{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-u-6a-beaver-near-da-nang-2-killed", "date": "Nov 15, 1966 at 1440 LT", "type": "De Havilland DHC-2 Beaver", "operator": "US-Army", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "No", "site": "Mountains", "schedule": "Đông Hà – Đà Nẵng", "msn": "872", "yom": 1956, "flight_number": null, "city": "Đà Nẵng", "zone": "Đà Nẵng City District", "country": "Vietnam", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Crashed whilst serving with the 138th Aviation Company. The pilot, US Army Capt. Harry M. Ravenna, and passenger, US Marine Corps Cpl. John C. Keiper, were-on a routine flight from Dong Ha to Da Nang. Keiper while assigned to Helicopter Attack Maintenance Squadron 16, Marine Air Group 16. Their role on this mission is unclear from public record. Ravenna was assigned to the 138th Aviation Company, 224th U.S. Army Security Agency Battalion (Aviation), U.S. Army Security Agency Group, Vietnam. All missions of this agency were-highly classified during the war and secret cover designations (Radio Research Units) were-used instead of the actual unit designations on station lists and reports. The 138th was based at Da Nang. Ravenna filed a VFR (visual flight rules) flight plan, but ran into poor weather conditions. He radioed Dong Ha and requested radar guidance. At 14:30 hours, he passed into Da Nang airfield radar control and radioed, “Lonely Ranger 723, heading 125, at 3,000 feet, estimating Da Nang at 40, request radar. Presently on instruments.”  Having trouble bringing him onto radar screen, Da Nang instructed Ravenna to activate his transponder, but this did not improve radar contact, so they asked his location, which he gave as 45 nautical miles from Dong Ha. Da Nang instructed him to re-contact Dong Ha (believing he was out of Da Nang range and still in that of Dong Ha). Ravenna acknowledged the transmission; radio contact was broken, and never resumed. Ravenna and Keiper were-last believed to be in South Vietnam about halfway between Da Nang and the city of Hue. Later investigation concluded that on his present course, had it been followed, Ravenna’s aircraft would have impacted with the side of a mountain in that vicinity. The hostile threat in the area prevented extensive search, and all efforts to discover the status of Ravenna and Keiper have failed.\r\nCrew:\r\nCpt Harry M. Ravenna.\r\nPassenger:\r\nCpl John C. Keiper.\r\nSource: http://www.dhc-2.com/cn872.html", "probable_cause": null}