{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900c-seattle", "date": "Aug 13, 1997 at 1913 LT", "type": "Beechcraft 1900C", "operator": "Ameriflight2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Portland - Seattle", "msn": "UB-47", "yom": 1985, "flight_number": "AMF262", "city": "Seattle-Tacoma (SeaTac)", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 6370, "captain_hours_type": 106, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 23892, "circumstances": "The Beech 1900C cargo aircraft was loaded with more than 4,962 pounds of cargo during an approximate 20 minute period. No scale was available at the aircraft, forcing loaders to rely on tallying either waybill weights or estimates of total cargo weight and center of gravity (CG) during the brief loading period. Additionally, a strike had shut down a major cargo competitor at the time with substantial cargo overflow to the operator. Post-crash examination determined the cargo load was 656 pounds greater than that documented on the pilot's load manifest, and the CG was between 6.8 and 11.3 inches aft of the aft limit. The airplane behaved normally, according to the pilot, until he initiated full flaps for landing approaching the threshold of runway 34L at the Seattle-Tacoma International airport. At this time, the aircraft's airspeed began to decay rapidly and a high sink rate developed as the aircraft entered into a stall/mush condition. The aircraft then landed hard, overloading the nose and left-main landing gear which collapsed. A post-impact fuel system leak during the ground slide led to a post-crash fire. ", "probable_cause": "A stall/mush condition resulting from an aft center of gravity which was inaccurately provided to the pilot-in-command by contractual cargo-loading personnel. Additional causes were overloading of the aircraft's landing gear and fuel leakage resulting in a post-crash fire. Factors contributing to the accident were the pilot's improper lowering of flaps in an aft CG situation and the inadequate company procedures for cargo loading. "}