{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-200-super-king-air-leonardtown", "date": "Oct 12, 2006 at 1216 LT", "type": "Beechcraft 200 Super King Air", "operator": "Tigress Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Leonardtown - Leonardtown", "msn": "BB-151", "yom": 1979, "flight_number": null, "city": "Leonardtown", "zone": "Maryland", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7140, "captain_hours_type": 900, "copilot_hours": 1100, "copilot_hours_type": 59, "aircraft_hours": 11077, "circumstances": "With all cockpit indications showing the landing gear was down and locked, the airplane touched down on the runway. Immediately after touchdown, the pilots heard the landing gear warning horn sound intermittently for several seconds, and then the right main landing gear collapsed. The airplane veered to the right, exited the runway, and came to rest. A post crash fire ensued, and the crew exited without injury. A postaccident examination of the airplane revealed that the collapsed right main landing gear had penetrated the right main fuel tank and the majority of the right side of the fuselage had been consumed by fire. Examination of the left and right main landing gear assemblies revealed, that both downlock plates had been installed backwards, providing only a fraction of the design contact area between the plate and throat of the downlock hook. Examination of the manufacturer's component maintenance manual, which was used for the assembly and installation of the left and right main landing gear, revealed no guidance regarding downlock plate orientation during installation.", "probable_cause": "The airplane manufacturer's inadequate landing gear downlock plate maintenance orientation information, and the disengaged main landing gear."}