{"url": "https://www.baaa-acro.com/crash/crash-eclipse-ea500-danbury", "date": "Aug 21, 2015 at 1420 LT", "type": "Eclipse EA500", "operator": "UF Equipment", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Oshkosh – Danbury", "msn": "199", "yom": 2008, "flight_number": null, "city": "Danbury", "zone": "Connecticut", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7846, "captain_hours_type": 1111, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 858, "circumstances": "**This report was modified on April 2, 2020. Please see the public docket for this accident to view the original report.**\r\nAfter the airplane touched down on the 4,422-ft-long runway, the airline transport pilot applied the brakes to decelerate; however, he did not think that the brakes were operating. He continued \"pumping the brakes\" and considered conducting a go-around; however, there was insufficient remaining runway to do so. The airplane subsequently continued off the end of the runway, impacted a berm, and came to rest upright, which resulted in substantial damage to the right wing. During postaccident examination of the airplane, brake pressure was obtained on both sets of brake pedals when they were depressed, and there was no bleed down or reduction in pedal firmness when the brakes were pumped several times. Examination revealed no evidence off any preimpact anomalies with the brake system that would have precluded normal operation. In addition, the pilot indicated that he was not aware of and was not trained on the use of the ALL INTERRUPT button, which is listed as a step in the Emergency Procedures section of the airplane flight manual and is used to disable the anti-skid brake system functions and restore normal braking when the brakes are ineffective; thus, the pilot did not follow proper checklist procedures. According to data downloaded from the airplane's diagnostic storage unit (DSU), the airplane touched down 1,280 ft beyond the runway threshold, which resulted in 2,408 ft of runway remaining (the runway had a displaced threshold of 734 ft) and that it traveled 2,600 ft before coming to rest about 200 ft past the runway. The airplane's touchdown speed was about 91 knots. Comparing DSU data from previous downloaded flights revealed that the airplane's calculated deceleration rate during the accident landing was indicative of braking performance as well as or better than the previous landings. Estimated landing distance calculations revealed that the airplane required about 3,063 ft when crossing the threshold at 50 ft above ground level. The target touchdown speed was 76 knots. However, the airplane touched down with only 2,408 ft of remaining runway faster than the target touchdown speed, which resulted in the runway overrun.", "probable_cause": "The pilot's failure to attain the proper touchdown point and exceedance of the target touchdown speed, which resulted in a runway overrun."}