{"url": "https://www.baaa-acro.com/crash/crash-mcdonnell-douglas-md-82-machiques-160-killed", "date": "Aug 16, 2005 at 0300 LT", "type": "McDonnell Douglas MD-82", "operator": "West%20Caribbean%20Airways", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Panama City - Fort-de-France", "msn": "49484", "yom": 1986, "flight_number": "YH708", "city": "Machiques", "zone": "Zulia", "country": "Venezuela", "region": "South America", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 152, "pax_fatalities": 152, "other_fatalities": 0, "total_fatalities": 160, "captain_hours": 5942, "captain_hours_type": 1128, "copilot_hours": 1341, "copilot_hours_type": 862, "aircraft_hours": 49494, "circumstances": "The MD-82 arrived at Panama City-Tocumen after a flight from Medellín-José María Córdova Airport (MDE). The plane was then prepared to carry out a flight to the Caribbean island of Martinique. Flight WCW 708 departed Panama City at about 06:00 UTC and climbed to its cruising altitude of FL310. This altitude was reached at about 06:25 UTC. Sixteen minutes later the airplane began a normal climb to FL330. At 06:49 the speed began to steadily decrease from Mach 0.76. The horizontal stabilizer moved from about 2 units nose up to about 4 units nose up during this deceleration. At 06:51 UTC the crew reported at FL330 over the SIDOS waypoint, over the Colombian/Venezuelan border, and requested a direct course to the ONGAL waypoint. The controller instructed the crew to continue on the present heading and to await further clearance direct to ONGAL. The flight crew meanwhile discussed weather concerns that included possible icing conditions and the possible need to turn on engine and airfoil anti-ice. At 06:57 UTC the flight crew requested permission to descend to FL310, which was approved. The autopilot was disconnected and the airplane started to descend. As the airplane descended past about FL315, the airspeed continued to decrease and the engine EPR decreased to about flight idle. Two minutes later a further descent to FL290 was requested, but the controller at Maiquetía did not understand that this was a request from flight 708 and asked who was calling. Flight 708 responded and immediately requested descent to FL240. The controller inquired about the state of the aircraft, to which they responded that both engines had flamed out. The controller then cleared the flight to descent at pilot's discretion. In the meantime, the altitude alert warning had activated, followed by the stick shaker and the aural stall warning alert. The airspeed had reached a minimum of about 150 indicated air speed (IAS) knots at about FL250. The crew reported descending through FL140 and reported that they were not able to control the airplane. The aircraft descended at 7,000 ft/min, and finally crashed in a swampy area. The aircraft disintegrated on impact and all 160 occupants were killed. Debris were found on an area of 205 metres long and 110 metres wide. The entire descent from FL330 had taken approximately 3 minutes and 30 seconds.", "probable_cause": "Given the aerodynamic and performance conditions, the aircraft was taken to a critical state, which led to a loss of lift. Consequently, the cockpit resource management (CRM) and decision-making during the development of emergency were misguided. This was caused by the following:\r\na) Awareness of environment (or situational awareness) insufficient or improper that allowed the cockpit crew, not being full and timely aware of what was happening regarding the performance and behavior of the aircraft.\r\nb) Lack of effective communication between the cockpit crew that limited, within the decision making process, the possibility to timely choose appropriate alternatives and options and to set respective priorities in the actions taken at the time when it was established that there was a critical or emergency situation (stall condition at high altitude).\r\nIt is found that the cause of the accident is determined by the absence of appropriate action to correct the stall of the aircraft, and also in the emergency up to the impact with the ground, at an inappropriate hierarchy of priorities in implementing the procedures. Subsequently, the operations were conducted outside of the limits and parameters set by the manufacturer's manual performance, together with an inadequate flight planning by failing to consider meteorological aspects, in addition a misinterpretation and late of the energy state of the aircraft by the flight crew. Therefore, the evidence shows the classification of \"Human Factor\" as a cause of this accident."}