{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-118a-liftmaster-candle", "date": "Aug 1, 2019 at 1400 LT", "type": "Douglas C-118 Liftmaster", "operator": "Everts%20Air%20Cargo.png", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fairbanks – Candle", "msn": "43712/358", "yom": 1953, "flight_number": null, "city": "Candle", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9910, "captain_hours_type": 147, "copilot_hours": 8316, "copilot_hours_type": 69, "aircraft_hours": 42037, "circumstances": "The flight crew was landing the transport-category airplane at a remote, gravel-covered runway. According to the captain, the terrain on the approach to the runway sloped down toward the approach end, which positioned the airplane close to terrain during the final stages of the approach. A video recorded by a bystander showed that while the airplane was on short final approach, it flew low on the glidepath and dragged its landing gear through vegetation near the approach end of the runway. The video showed that, just before the main landing gear wheels reached the runway threshold, the right main landing wheel impacted a dirt and rock berm. The captain said that to keep the airplane from veering to the right, he placed the No. 1 and No. 2 engine propellers in reverse pitch. The flight engineer applied asymmetric reverse thrust to help correct for the right turning tendency, and the airplane tracked straight for about 2,000 ft. The video then showed that the right main landing gear assembly separated, and the airplane continued straight down the runway before veering to the right, exiting the runway, and spinning about 180°, resulting in substantial damage to the fuselage. On-site examination of the runway revealed several 4-ft piles of rocks and dirt at the runway threshold, which is likely what the right main landing wheel impacted. Given that the airplane landing gear struck vegetation and rocks on the approach to the runway, it is likely that they were below the proper glidepath for the approach. The crew stated there were no preaccident mechanical malfunctions or anomalies that would have precluded normal operation.", "probable_cause": "The pilot's failure to maintain an adequate glidepath during the approach, which resulted in the airplane impacting rocks and dirt at the runway threshold, a separation of the right main landing gear, and a loss of directional control. "}