{"url": "https://www.baaa-acro.com/crash/crash-dassault-falcon-20c-pueblo", "date": "Jan 21, 2004 at 0040 LT", "type": "Dassault Falcon 20", "operator": "Jet%20Express", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Saint Louis – Pueblo", "msn": "133", "yom": 1968, "flight_number": null, "city": "Pueblo", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3750, "captain_hours_type": 1900, "copilot_hours": 2850, "copilot_hours_type": 110, "aircraft_hours": 8378, "circumstances": "The captain reported that he obtained weather briefings prior to and during the flight. The briefings did not include any NOTAMS indicating a contaminated runway at their destination airport. The captain obtained a report from the local fixed base operator that a Learjet had landed earlier and reported the runway as being okay. The tower was closed on their arrival, so they made a low pass over the airport to inspect the runways. Based on the runway and wind conditions, they decided their best choice for landing was on runway 08L. The captain said the landing was normal and the airplane initially decelerated with normal braking. As they encountered snow and ice patches, the captain said he elected to deploy the thrust reversers. The captain said that as the thrust reversers deployed, the airplane began to yaw to the left and differential braking failed to realign the airplane with the runway. The captain said the airplane departed the left side of the runway and rotated counter clockwise before coming to rest on a southwesterly heading. A witness on the airport said, \"I watched them touch down. I heard the [thrust] reversers go on and then off, and then on again. As they came back on for the second time, that's when the plane started making full circles on the runway. This happened two, maybe three times before going off the side of the runway.\" The airplane's right main landing gear collapsed on departing the runway, causing substantial damage to the right wing, right main landing gear and aft pressure bulkhead. At the accident site, the right engine thrust reverser was partially deployed. The left engine thrust reverser was fully deployed with the blocker doors extended. An examination of the airplane revealed a stuck solenoid on the right engine thrust reverser. No other system anomalies were found. Approximately 33 minutes prior to the accident, the pilot requested from Denver Air Route Traffic Control Center, the weather for the airport. Denver Center reported the conditions as \"winds calm, visibility 6 miles with light mist, 3,000 overcast, temperature zero degrees Centigrade (C) dew point -1 degree C, altimeter three zero 30.20, and there was at least a half inch of slush on all surfaces.\" The pilot acknowledged the information. The NOTAM log for the airport showed that at 2115, the airport issued a NOTAM stating there was \"1/2 inch wet snow all surfaces.\" The airport operations manager reported that at the time of the accident the runway surface was covered with 3/4 inch of wet snow. The airport conducts a 24 hour, 7 days a week operation; however, operations support digresses to fire coverage only after 2300.", "probable_cause": "The pilot's improper in-flight planning/decision to land on the contaminated runway, the stuck thrust reverser solenoid resulting in partial deployment of the right engine thrust reverser, and the pilot's inability to maintain directional control of the airplane due to the asymmetric thrust combined with a contaminated runway. Factors contributing to the accident were the wet, snow-covered runway, the airport's failure to remove the snow from the runway, and the pilot's failure to recognize the reported hazardous runway conditions by air traffic control."}