{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-680fl-north-las-vegas", "date": "Jul 21, 2005 at 1707 LT", "type": "Rockwell Grand Commander 680", "operator": "US%20Forest%20Service", "flight_phase": "Takeoff (climb)", "flight_type": "Fire fighting", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "North Las Vegas - North Las Vegas", "msn": "680-1349-29", "yom": 1963, "flight_number": null, "city": "North Las Vegas", "zone": "Nevada", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5285, "captain_hours_type": 75, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8942, "circumstances": "The airplane descended into the ground during takeoff-initial climb on a local fire reconnaissance flight. Witnesses reported that airplane became airborne, but was not climbing, and it continued down the runway in a nose-up attitude in ground effect until impacting terrain about 600 feet southeast from the departure end of the runway. The ambient temperature was about 107 degrees Fahrenheit, and the density altitude was calculated at 5,878 feet mean sea level. On scene examination found the flaps in the 30-degree position, which also corresponded to the flap actuator position. The cockpit indicator for the flaps also showed a 30-degree extension. A subsequent bench test of the combined flap/gear selector valve was conducted. During the initial inspection, both the gear selector and the flap selector valves were bent, but otherwise operational. The \"stop-pin\" on the flap selector lever was missing. There was no leakage of fluid during this test. Examination of both engines revealed no abnormalities, which would prevent normal operations. The aircraft flight manual specifies that the flaps should be set at 1/4 down (10 degrees) for normal takeoff.", "probable_cause": "The pilot's excessive selection of flaps prior to takeoff, which resulted in a failure to obtain/maintain an appropriate climb airspeed, and an inadvertent stall/mush during takeoff-initial climb. A factor contributing to the accident was a high density altitude."}