{"url": "https://www.baaa-acro.com/crash/crash-yakovlev-yak-42d-yaroslavl-44-killed", "date": "Sep 7, 2011 at 1600 LT", "type": "Yakovlev Yak-42", "operator": "Yak%20Service", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yaroslavl - Minsk", "msn": "4520424305017", "yom": 1993, "flight_number": "AEK9633", "city": "Yaroslavl", "zone": "Yaroslavl oblast", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 7, "pax_on_board": 37, "pax_fatalities": 37, "other_fatalities": 0, "total_fatalities": 44, "captain_hours": 6954, "captain_hours_type": 1525, "copilot_hours": 13492, "copilot_hours_type": 613, "aircraft_hours": 6490, "circumstances": "The aircraft was chartered by the Lokomotiv Yaroslavl ice hockey team to carry his staff to Minsk to take part to the first game of the Russian 2011-2012 championship. During the takeoff roll from runway 23 at Yaroslavl-Tunoshna Airport, the crew selected flaps down at 20° and the stabilizer in a nose-up position of 8,7°. The aircraft slowly accelerated to 165 km/h due to a residual pressure on the brake pedal. At a speed of 185 km/h and at a distance of 1,350 metres from the runway end, the nose gear lifted off. But the aircraft continued, passed the runway end and rolled for about 400 metres before it took off. Then it collided with various approach lights and the localizer antenna, lost height and eventually crashed on the shore of the Volga River, bursting into flames, 2 minutes after the takeoff roll was initiated. A passenger and the flight engineer were seriously injured while 43 other occupants were killed. Almost a week later, the passenger died from his injuries. Among the passengers were 26 players from the Lokomotiv Yaroslavl ice hockey team, Russian citizens and also Canadian, Czech, Ukrainian, German and Slovak. The Canadian coach Brad McCrimmon, his both assistants, the cameraman, three masseurs, one admin and two doctors were among the victims. ", "probable_cause": " Erroneous actions on part of the crew, especially by applying brake pedal pressure just before rotation as result of a wrong foot position on the pedal during the takeoff run. This led to braking forces on the main gear requiring additional time for acceleration, a nose down moment preventing the crew to establish a proper rotation and preventing the aircraft to reach a proper pitch angle for becoming airborne, overrun of the runway at high speed with the elevator fully deflected for nose up rotation (producing more than double the elevator forces required to achieve normal takeoff rotation). The aircraft finally achieved a high rate of nose up rotation, became airborne 450 meters past the runway end and rotated up to a supercritical angle of attack still at a large rate of pitch up causing the aircraft to stall at low altitude, to impact obstacles and ground, break up and catch fire killing all but one occupants.\r\nContributing factors were:\r\n- serious shortcomings in the re-training of the crew members with regards to the Yak-42, which did not take place in full, was spread out over a long period of time and took place while the crew remained in full operation on another aircraft type (Yak-40), which led to a negative transfer of skills, especially a wrong position of the foot on the brake pedal on the Yak-42,\r\n- Lack of supervision of the re-training,\r\n- errors and missed procedures by the crew in preparation and execution of the takeoff,\r\n- inconsistent, uncoordinated actions by the crew in the final stages of the takeoff."}