{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154b-2-thessaloniki", "date": "Jul 4, 2000 at 1657 LT", "type": "Tupolev TU-154", "operator": "Malev", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Budapest - Thessaloniki", "msn": "82A543", "yom": 1982, "flight_number": "MA262", "city": "Thessaloniki", "zone": "Thessaly / Θεσσαλία", "country": "Greece", "region": "Europe", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 86, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7420, "captain_hours_type": 7000, "copilot_hours": 566, "copilot_hours_type": 566, "aircraft_hours": 22409, "circumstances": "Originally, flight MA262 from Budapest to Thessaloniki should be performed by a Boeing 737-300 HA-LES but due to technical problems, a Tupolev TU-154B-2 was dispatched. Following an uneventful flight, the crew was cleared for a VOR/DME approach to runway 34 followed by a visual circle to land on runway 28 as the runway 34 was closed to traffic due to construction works. Because a Boeing 757 slowed to vacate the runway after landing, ATC instructed the crew to extend the downwind leg for runway 28. For unknown reasons, the crew failed to comply with this instructions and performed 'S'. On final approach, the tower controller informed the crew that he forgot to lower the undercarriage. The captain increased engine power and initiated a go-around procedure but this decision was too late. The aircraft continued to descend and struck the runway surface in a gear-up configuration at 1657LT. The aircraft suffered substantial damages but the crew managed to go-around and to follow a holding pattern. A safe landing was completed at 1715LT. All 94 occupants evacuated safely while the aircraft was damaged beyond repair. ", "probable_cause": "Despite repeated instructions of the control tower the crew did not carried out a short turn for landing, resulting in:\r\n- The aircraft was not aligned with the runway in time (unstabilized approach).\r\n- Attention of the cockpit crew was to exclusively dedicated to performing sudden maneuvers at low altitude, in order to align the plane with the runway.\r\n- Failure to lower the undercarriage in accordance with the applicable procedures for this flight phase.\r\nContributing Factors:\r\n- The apparent inactivation of the audible warning when the undercarriage was not deployed.\r\n- Lack of Cockpit Resources Management."}