{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-corona-10-killed", "date": "Feb 19, 1989 at 1210 LT", "type": "Cessna 402", "operator": "Las Vegas Flyers", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Las Vegas – Santa Ana", "msn": "402B-0527", "yom": 1975, "flight_number": null, "city": "Corona", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 10, "captain_hours": 4000, "captain_hours_type": 572, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 3129, "circumstances": "The pilot was operating an on-demand air taxi passenger flight to Santa Ana, CA. The accident occurred during descent, when the aircraft collided with a mountain at 2,060 feet msl. The pilot had received a preflight weather briefing in which he was advised of low ceilings and reduced visibility in the Los Angeles basin, surrounding mountains obscured by clouds, and that VFR flight to Santa Ana was not recommended. He departed VFR. While en route, the pilot was advised that Santa Ana was reporting 1,400 feet overcast with 5 miles visibility. A videotape recorded by a passenger showed mountain peaks protruding through a solid cloud layer and showed the aircraft descending into the clouds. Witnesses described a low cloud ceiling near the crash site and cloud tops at 5,000 feet. Examination of the wreckage revealed evidence of powered flight and no evidence of preimpact control or engine malfunction. Records indicated that the pilot had encountered IMC on only one flight in the previous 9 months. He was director of operations for the operator. The aircraft disintegrated on impact and all 10 occupants were killed. ", "probable_cause": "The pilot's failure to properly preflight and plan for flight and his intentional flight into IMC conditions. Factors contributing to the accident were the low ceiling conditions in conjunction with the mountainous terrain. \r\nOccurrence #1: in flight encounter with weather\r\nPhase of operation: descent - normal\r\nFindings\r\n1. (c) preflight planning/preparation - improper - pilot in command\r\n2. Weather forecast - disregarded - pilot in command\r\n3. In-flight weather advisories - disregarded - pilot in command\r\n4. (f) weather condition - low ceiling\r\n5. (c) vfr flight into imc - intentional - pilot in command\r\n----------\r\nOccurrence #2: in flight collision with terrain/water\r\nPhase of operation: descent - normal\r\nFindings\r\n6. (f) terrain condition - mountainous/hilly"}