{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-4-lake-michigan-58-killed", "date": "Jun 23, 1950 at 2325 LT", "type": "Douglas DC-4", "operator": "Northwest%20Airlines2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "New York – Minneapolis – Spokane – Seattle", "msn": "10270", "yom": 1943, "flight_number": "NW2501", "city": "Lake Michigan", "zone": "Michigan", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 55, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 8662, "captain_hours_type": 1968, "copilot_hours": 8821, "copilot_hours_type": 400, "aircraft_hours": 15902, "circumstances": "The flight 2501, was scheduled to operate between the terminal points of New York, N. Y., and Seattle, Wash, via intermediate points of Minneapolis, Minn., and Spokane, Wash. At approximately 1931 the flight departed from LaGuardia Airport for Minneapolis with a crew consisting of Robert C. Lind, captain, Verne F. Wolfe, first officer, and Bonnie A. Feldman, stewardess. On board were 55 passengers, 2, 500 gallons of fuel, 80 gallons of oil, and 490 pounds of express, which resulted in an aircraft weight of 71, 342 pounds for takeoff. This was 58 pounds below the maximum permissible takeoff weight, and the load was distributed so that the center of gravity was within approved limits. The flight plan filed with ARTC (Air Route Traffic Control) specified a cruising altitude of 6 000 feet to Minneapolis. An altitude of 4,000 feet had been originally requested because of forecast en route thunderstorms, but denied by ARTC because other traffic was assigned at that level. At 2149, when over Cleveland, Ohio, a cruising altitude of 4,000 feet was again requested by the flight and this time approved by ARTC. Forty minutes later the flight was requested by ARTC to descend to 3, 500 feet because there was an eastbound flight at 5,000 feet over Lake Michigan which was experiencing severe turbulence and difficulty in maintaining its assigned altitude. ARTC estimated that the two flights would pass each other in the vicinity of Battle Creek, Mich., and that the standard separation of 1,000 feet would not be sufficient because of the turbulence. At 2251, Flight 2501 reported that it was over Battle Creek at 3,500 feet, and that it would be over Milwaukee at 2337. When in the vicinity of Benton Harbor, at 2313, the flight requested a cruising altitude of 2,500 feet, however, no reason was given for the request. ARTC was unable to approve this altitude because of other traffic. Acknowledgement that ARTC could not approve descent to 2,500 feet was received at 2315, and this was the last communication received from the flight. At 2337, Northwest Radio at Milwaukee advised the company at LaGuardia and Minneapolis, and ARTC at Chicago, that the flight was ten minutes overdue since they had incorrectly copied the 2251 flight report as 2327. At 2345 Northwest Radio at Milwaukee transmitted to the flight instructions to circle the range station at Madison, Wis., if its radio transmitter was inoperative. During the same period, all CAA (Civil Aeronautics Administration) radio stations in the Chicago-Minneapolis area tried to contact the flight on all frequencies. At 2358, Chicago ARTC, at the request of Northwest Airlines, alerted air-sea rescue facilities in the area, which included the Air Force, Navy, Coast Guard, and the state police of Illinois, Michigan, Wisconsin, and Indiana. The missing aircraft was assumed to have been involved in an accident at 0530 since the fuel supply at that time would have been exhausted. An intensive search of the Lake Michigan area was commenced at daylight June 24. On the following day, at 1830, the United States Coast Guard cutter Woodbine found an oil slick, aircraft debris, and the aircraft log book in Lake Michigan approximately 18 miles north-northwest of Benton Harbor. At 0530, June 25, underwater search operations were conducted with divers and sonar equipment. Divers descended at the points where strong sonar contacts were made. At those locations, the lake bottom was 150 feet below the surface of the water and was covered by a layer of silt and mud estimated to be 30 to 40 feet deep. Visibility was less than eight inches. The possibility of locating anything was slight, and movement was severely restricted. In addition to diving operations, the entire area was dragged with grapnel but without results. After two days of operation, the Navy suspended their search because of the difficult conditions, and because nothing had been found which would indicate that the aircraft could be recovered. Since then, the Coast Guard and aircraft flying in that area have maintained a sea and air surveillance. The only parts of the aircraft that were recovered were those with sufficient buoyancy to float a fuel tank float, foam rubber cushions, arm rests, clothing, blankets, pillows, pieces of luggage, cabin lining, plywood flooring and other wooden parts. The cushions and arm rests, shredded from impact forces and cutting edges of the fuselage, indicated that the aircraft struck the water at high speed. A plywood oxygen bottle support bracket, which had been installed in the forward left side of the fuselage, showed that the inertia forces acted in a forward, downward, and to the left direction. There was no sign of fire found on any parts recovered. All 58 occupants have been killed. ", "probable_cause": "The Board determines that there is not sufficient evidence upon which to make a determination of probable cause. At the approximate time of the accident a squall line was located in the area where the aircraft crashed. Despite an intensive surface and underwater search, the aircraft was not located with the exception of a few fragments."}