{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-7b-near-kyburz-2-killed", "date": "Oct 1, 1992 at 1225 LT", "type": "Douglas DC-7", "operator": "US%20Forest%20Service", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "No", "site": "Mountains", "schedule": "Stockton - Stockton", "msn": "45454", "yom": 1958, "flight_number": "Tanker 61", "city": "Kyburz", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Douglas DC-7B airtanker N848D had been operating from Stockton, CA (SCK) and had made several drops of retardant on the southeast edge of a fire on the El Dorado National Forest. Their first mission on October 1, 1992, had begun at 08:33. Their fourth mission had them departing the base at 11:56. Their departure was immediately followed by a Lockheed SP2H enroute to the same fire. The DC-7B arrived in the fire vicinity at an elevation of about 6,500 feet MSL at 12:20. Air attack briefed the DC-7B’s two-person flight crew for their retardant drop. Air attack was flying at approximately 7,500 feet MSL. The planned drop was to be made from north to south about one mile west of the upper dam on the reservoir. It was to be the air tanker’s first drop in this particular location. The visibility was good, in excess of ten miles, and turbulence was reported as mild, but bumpy. The area over the lake to the east of the drop pattern was experiencing reduced visibility due to smoke. According to occupants of the second airtanker, the DC-7B made a turn around the fire and was descending northbound for a drop out of a right hand pattern when the DC-7B captain indicated that he wanted to depart the pattern as he had a problem with an engine. He suggested the second airtanker perform the intended drop while he worked with his engine problem. The second airtanker then received attention from air attack and began a circle to fly a pattern similar to the pattern the DC-7B had flown. Shortly thereafter, air attack asked the DC-7B if he needed to abort (drop) his load of retardant. That captain replied that he might have to if he couldn’t solve his engine problem. All communications were normal. Air attack was operating without lead plane assistance as the lead plane had departed the scene for fuel a few minutes before, instructing air attack to perform drops on the west side of the reservoir. Another lead plane was about six minutes out. The mishap air tanker was reported to be descending at about 6,000 feet MSL heading in a north-northwesterly direction after departing the drop pattern, with no visible signs of engine problems and no indication of concern present in his radio transmissions. The DC-7B continued northbound toward gently rising terrain about two miles from the intended drop site and was next observed heading in an easterly direction and low to the ground. The airtanker was reported to be in a sharply pitched up attitude prior to dropping its retardant. Air attack reported that he observed the retardant start and stop, but did not know if a full load had been dropped. He said the load was continuous. The DC-7B was then reported to fall off on the right wing as it descended steeply toward the ground. During this sequence, the captain transmitted on the radio, \"We’re going in, we’re going in.\" It was at this point that tree strikes occurred which removed the horizontal stabilizers and elevators from the tail of the airtanker. This entire sequence took place within the span of about 60 seconds. The airtanker then went behind a ridge and white smoke was observed rising from the site. The airtanker had impacted the ground in steep terrain at an elevation of approximately 5,100 feet MSL. Some of the wreckage was deposited in a creek bottom and the remainder was located on an adjacent south-facing slope. Both the captain and copilot were fatally injured. The aircraft was totally destroyed. ", "probable_cause": "The accident was the probably the consequence of the pilot’s preoccupation, inattention, or possible distraction while operating the airtanker in close proximity to terrain. The following contributing factors were reported: \r\n- Crew Management, \r\n- The pilots failed to recognize the severity of the situation and were reluctant to abort their retardant load."}