{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-350-navajo-chieftain-christchurch-8-killed", "date": "Jun 6, 2003 at 1907 LT", "type": "Piper PA-31-350 Navajo Chieftain", "operator": "Air Adventures New Zealand", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Palmerston North – Christchurch", "msn": "31-7405203", "yom": 1974, "flight_number": null, "city": "Christchurch", "zone": "Canterbury Regional Council", "country": "New Zealand", "region": "Oceania", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 9, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 4325, "captain_hours_type": 820, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 13175, "circumstances": "The aircraft was on an air transport charter flight from Palmerston North to Christchurch with one pilot and 9 passengers. At 1907 it was on an instrument approach to Christchurch Aerodrome at\r\nnight in instrument meteorological conditions when it descended below minimum altitude, in a position where reduced visibility prevented runway or approach lights from being seen, to collide with trees and terrain 1.2 nm short of the runway. The pilot and 7 passengers were killed, and 2 passengers received serious injury. The aircraft was destroyed. The accident probably resulted from the pilot becoming distracted from monitoring his altitude at a critical stage of the approach. The possibility of pilot incapacitation is considered unlikely, but cannot be ruled out. ", "probable_cause": "Findings:\r\n- The pilot was appropriately licensed and rated for the flight.\r\n- The pilotís previously unknown heart disease probably would not have made him unfit to hold his class 1 medical certificate.\r\n- The pilotís ability to control the aircraft was probably not affected by the onset of any incapacitation associated with his heart condition.\r\n- Although the pilot was experienced on the PA 31 type on VFR operations, his experience of IFR operations was limited.\r\n- The pilot had completed a recent IFR competency assessment, which met regulatory requirements for recent instrument flight time.\r\n- The aircraft had a valid Certificate of Airworthiness, and the scheduled maintenance which had been recorded met its airworthiness requirements.\r\n- The return of the cabin heater to service by the operator, after the maintenance engineer had disabled it pending a required test, was not appropriate but was not a factor in the accident.\r\n- The cabin heater was a practical necessity for IFR operations in winter, and the required test should have been given priority to enable its safe use.\r\n- The 3 unserviceable avionics instruments in the aircraft did not comply with Rule part 135, and indicated a less than optimum status of avionics maintenance. However there was sufficient\r\nserviceable equipment for the IFR flight.\r\n- The use of cellphones and computers permitted by the pilot on the flight had the potential to cause electronic interference to the aircraftís avionics, and was unsafe.\r\n- The pilotís own cellphone was operating during the last 3 minutes of the flight, and could have interfered with his glide slope indication on the ILS approach.\r\n- The aircraftís continued descent below the minimum altitude could not have resulted from electronic interference of any kind.\r\n- The pilotís altimeter was correctly set and displayed correct altitude information throughout the approach.\r\n- There was no aircraft defect to cause its continued descent to the ground. \r\n- The aircraftís descent which began before reaching the glide slope, and continued below the glide slope, resulted either from a faulty glide slope indication or from the pilot flying a localiser approach instead of an ILS approach.\r\n- When the aircraft descended below the minimum altitude for either approach it was too far away for the pilot to be able to see the runway and approach lights ahead in the reduced visibility at the time. \r\n- The pilot allowed the aircraft to continue descending when he should have either commenced a missed approach or stopped the aircraftís descent.\r\n- The pilotís actions or technique in flying a high-speed unstabilised instrument approach; reverting to hand-flying the aircraft at a late stage; not using the autopilot to fly a coupled approach and, if intentional, his cellphone call, would have caused him a high workload and possibly overload and distraction.\r\n- The pilotís failure to stop the descent probably arose from distraction or overload, which led to his not monitoring the altimeter as the aircraft approached minimum altitude.\r\n- The possibility that the pilot suffered some late incapacity which reduced his ability to fly the aircraft is unlikely, but cannot be ruled out.\r\n- If TAWS equipment had been installed in this aircraft, it would have given warning in time for the pilot to avert the collision with terrain.\r\n- While some miscommunication of geographical coordinates caused an erroneous expansion of the search area, the search for the aircraft was probably completed as expeditiously as possible in difficult circumstances. "}