{"url": "https://www.baaa-acro.com/crash/crash-short-sc7-skyvan-3a-variant-200-bethel-1-killed", "date": "Jul 13, 1992 at 1230 LT", "type": "Short SC.7 Skyvan Variant", "operator": "Arctic%20Circle%20Air", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bethel - Chevak", "msn": "1918", "yom": 1973, "flight_number": null, "city": "Bethel", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 5000, "captain_hours_type": 2000, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6390, "circumstances": "The airplane rolled 200-300 feet before becoming airborne in a very nose high attitude. It maintained this attitude, made a right, then a left bank, and fell to the ground in a nose high attitude. The cargo consisted of eight 55-gallons drums of fuel, laid on their side and secured by one cargo strap running fore and aft and another cargo strap running diagonally across the barrels. The tie down ring ultimate strength rating was 1,600 pounds. The weight of the cargo was 2,863 pounds. Three of the cargo hooks associated with the cargo straps were found still attached to the tie down rings, and one hook and tie down ring were not located. Post-impact fire destroyed the cargo straps, and the barrels were strewn randomly through the cabin/cargo area. According to the manufacturer, the davis tie down ring installation is not approved by the manufacturer. The modification should have been accomplished under a supplemental type certificate. The logbooks showed only an entry. The certificated max gross weight was calculated to have been exceeded by 324.8 lbs. The pilot, sole on board, was killed. ", "probable_cause": "Inadequate security of the cargo which shifted rearward during the takeoff roll. Factors which contributed to the accident were: the over gross weight condition, and the improper alteration of the tie down rings by the overhauling maintenance facility."}