{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54a-1-do-skymaster-tacoma-9-killed", "date": "Nov 30, 1947 at 1425 LT", "type": "Douglas C-54 Skymaster", "operator": "Alaska%20Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Anchorage – Yakutat – Seattle", "msn": "7453", "yom": 1943, "flight_number": "AS009", "city": "Tacoma", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 1, "pax_on_board": 25, "pax_fatalities": 7, "other_fatalities": 1, "total_fatalities": 9, "captain_hours": 8352, "captain_hours_type": 738, "copilot_hours": 3220, "copilot_hours_type": 1483, "aircraft_hours": 5548, "circumstances": "The flight arrived over the Seattle radio range station at 3,000 feet on its initial approach to the Boeing Airport at 1357. Shortly before Captain Farris had reported to Seattle Radio that he had 2 rough engines, but he did not declare an emergency. The condition of engine roughness is discussed below. Weather at Boeing Field, Seattle, Washington, was reported to be ceiling indefinite 500 feet visibility one mile. An instrument approach for landing at Boeing Field was made, but not completed because of the low ceiling and visibility, so the flight returned to an altitude of 1,500 feet on the northwest course of the Seattle radio range. During this time Copilot Whitting remained in the left seat and flew the airplane. The second instrument approach was made for a landing at the Seattle-Tacoma Airport, sometimes referred to as the Bow Lake Airport, which is located 4 miles south of the Seattle radio range station. The airplane was flown inbound on the northwest course of the range. Then, after passing over the range station at  1,500 feet, a heading of 193 degrees toward the airport was flown, and a descent made for landing. The aircraft was first observed at the Seattle-Tacoma Airport when approximately 500 feet above the approach and of Runway 20, 5,611 feet long, at which time it was flying at an angel to the left of the runway. An \"S\" maneuver and rapid decent were made. A right turn was entered and held until the airplane was again over Runway 20, then it turned left. When the airplane first made contact with the runway it was in the left turn, and the left wing was so low that those who observed the landing thought that it would strike the ground. The first point of touchdown was made 2,748 feet beyond the approach end of the runway. The airplane progressed over the remaining distance of the runway without apparent deceleration. Captain Farris, who had taken over the controls of the airplane when it was in the left turn, stated that he allowed the airplane to slow down of its run accord to 50 or 60 miles per hour before applying brakes, and that he released the emergency air bottle 1,000 feet from the end of the runway. Before passing over the end of the runway an attempt was made to groundloop the airplane to the left by applying power to engine 4. Nevertheless, the airplane traveled almost straight ahead. It went off the end of the runway, crossed 229 feet of wet ground, and then rolled down a 24-foot embankment. At the bottom of the embankment it struck a ditch which sheared off the left lending gear and the left wing. The aircraft continued on to the intersection of the Des Moines Highway and South 188th Street where it collided with a moving automobile. Spilled gasoline was ignited, and the wreckage was enveloped in flames. The Weather Bureau at tie Seattle-Tacoma Airport made an observation immediately following the crash and reported an indefinite ceilings, 400-foot overcast, visibility variable one-half to one mile, and light rain and fog.", "probable_cause": "The Board determines that the probable cause of this accident was the landing of the airplane too far from the approach end of a wet runway and at a speed too great to accomplish a full stop on the runway.\r\nThe following factors were considered as contributory:\r\n- The flight arrived over the approach end of the intended runway too high and non properly lined up for a normal landing, \r\n- First touchdown was made at a point 2,748 feet from the approach end of Runway 20, 5,611 feet long, at which time the airplane was in a left bark steep enough to place the left wing tip almost on the ground,\r\n- The left outboard main landing gear tire marked the runway for a distance of 105 feet after which the airplane flow 60 feet. Seven hundred and eleven feet of runway were traversed from the first point of touchdown before all 4 main landing gear wheels were solidly on the runway."}