{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-mirage-samedan-5-killed", "date": "Apr 7, 2004 at 1121 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Phoenix%20Kapitaldienst", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Plain, Valley", "schedule": "Egelsbach – Samedan", "msn": "46-22004", "yom": 1988, "flight_number": null, "city": "Samedan", "zone": "Graubünden", "country": "Switzerland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 2770, "captain_hours_type": 842, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2473, "circumstances": "Before the flight involved in the accident, the pilot himself had loaded and prepared the aircraft. According to the statement of the official on duty, neither the pilot nor the passengers were behaving conspicuously. The flight plan envisaged a VFR-IFR-VFR flight from Egelsbach (EDFE), south of Frankfurt, to Samedan (LSZS) in the Engadine. After take-off, the flight was to proceed under VFR (visual flight rules) to the waypoint RID and then to waypoint GERSA under IFR (instrument flight rules). From GERSA it was then planned to continue flying to Samedan under VFR again. The total duration of the flight was indicated in the flight plan as 75 minutes, and the endurance was indicated as 4 hours and 30 minutes. Take-off took place in Egelsbach at 10:09 LT. At 10:37 LT, the pilot contacted Swiss Radar Lower Sector North on frequency 136.150 MHz as follows: “... level two one zero inbound Trasadingen”. He was instructed to continue flying in the direction of GERSA. At 10:45 LT, the pilot contacted Radar Lower Sector South, on frequency 128.050 MHz, and continued flying as far as LUKOM. Based on an instruction from air traffic control, the aircraft left flight level 210 and descended to flight level 170. The pilot was instructed to continue flying direct to Samedan. At 11:10 LT, the pilot changed from instrument flight rules to visual flight rules and signed off from Lower Sector South. He attempted to contact Samedan. Initially, the communication was poor. After several attempts, he made contact at 11:15 LT on the Samedan aerodrome frequency. At 11:18 LT, the pilot reported that he was over the aerodrome and wanted to fly to the east to get below the cloud ceiling. No further radiocommunication took place. Shortly afterwards, witnesses saw the aircraft fall out of the clouds in an uncontrolled attitude. The aircraft crashed into the ground in a flat spin and with practically no forward motion. The aircraft was destroyed and all five occupants were killed. ", "probable_cause": "The accident is attributable to the fact that during an attempt to get below the clouds for the approach to Samedan, control of the aircraft was lost and it crashed into the ground. Exceeding the maximum permissible mass and the tail-heavy condition of the aircraft may have contributed to the accident. \r\nThe following factors were identified:\r\n• On take-off, an endurance of 4½ hours was specified. Recalculation produced an actual take-off mass which was 722 lb over the MTOM.\r\n• At the time of the accident, the mass of the aircraft was still 425 lb above the maximum take-off mass.\r\n• The aircraft was loaded tail-heavy.\r\n• The aircraft impacted the ground in a spin.\r\n• There was partial cloud cover, though somewhat clearer to the east. Cloud conditions were changing relatively quickly.\r\n• Visibility in Samedan below the clouds was good."}