{"url": "https://www.baaa-acro.com/crash/crash-cessna-402c-chadron-2-killed", "date": "Dec 22, 1987 at 2057 LT", "type": "Cessna 402", "operator": "GP-Express%20Airlines", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Alliance - Chadron", "msn": "402C-0642", "yom": 1982, "flight_number": null, "city": "Chadron", "zone": "Nebraska", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6865, "captain_hours_type": 169, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 8229, "circumstances": "The aircraft was on a flight to Chadron via Chadron VOR. About 30 miles south-southeast of the VOR, the pilot requested and was cleared to fly direct to Ackme IAF for an NDB runway 02 approach. The aircraft continued toward the VOR which was in the same general direction, but 11.9 miles south of Ackme. The NDB was at the airport. Ackme IAF was 9 miles southwest of the airport on a bearing of 227° and defined by an intersection with the 356° radial of the VOR. About 3 to 4 miles southeast of the VOR, radar service was transmitted and frequency change was made. Subsequently, the aircraft struck trees on a ridge and crashed. Initial impact occurred in wings level flight at approximately 4,480 feet on a direct route between the VOR and Ackme IAF. An investigation revealed that after the frequency change, the aircraft continued to the VOR, then maneuvered as if the pilot was flying the NDB approach, but was using the VOR as the IAF. Radar data showed contact was lost after a procedure turn was made and the aircraft was outbound about 6 miles northeast of the VOR. The crash site, however, was about 3 miles west-southwest of where radar contact was last recorded. The weather at Chadron was in part: 500 feet overcast, 1.5 mile visibility with light snow and fog. No preimpact part failure/malfunction was found. The passenger was seriously injured and both pilots were killed. ", "probable_cause": "Occurrence #1: in flight collision with object\r\nPhase of operation: approach\r\nFindings\r\n1. (f) light condition - dark night\r\n2. (f) weather condition - low ceiling\r\n3. (f) weather condition - fog\r\n4. (f) weather condition - snow\r\n5. (c) ifr procedure - improper - pilot in command\r\n6. Planned approach - discontinued\r\n7. (c) proper altitude - not maintained - pilot in command\r\n8. (f) terrain condition - high terrain\r\n9. (f) object - tree(s)"}