{"url": "https://www.baaa-acro.com/crash/crash-bristol-175-britannia-102-ljubljana-98-killed", "date": "Sep 1, 1966 at 0047 LT", "type": "Bristol Britannia", "operator": "Britannia%20Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Luton – Ljubljana", "msn": "12903", "yom": 1955, "flight_number": "BY105", "city": "Ljubljana", "zone": "Central Slovenia (Osrednjeslovenska)", "country": "Slovenia", "region": "Europe", "crew_on_board": 7, "crew_fatalities": 6, "pax_on_board": 110, "pax_fatalities": 92, "other_fatalities": 0, "total_fatalities": 98, "captain_hours": 12000, "captain_hours_type": 517, "copilot_hours": 11000, "copilot_hours_type": 1200, "aircraft_hours": 18444, "circumstances": "Flight BY 105 was a non-scheduled international flight from Luton (England) to Ljubljana (Yugoslavia), for the transport of tourists. The aircraft took off from Luton at 2110 hours GMT on 31 August 1966, with a crew of 7 and 110 passengers. Before overflying the Yugoslav border, the crew contacted the Zagreb Area Control Centre. The radiocommunications were uninterrupted, and the crew received all necessary information and instructions. After overflying Klagenfurt, the crew contacted Ljubljana Aerodrome Control, and from that time on the radio communications were uninterrupted and continuous. The conversation between the crew spoken sometimes too fast and a trifle garbled, and the controller spoken without any difficulty to understand is contained in the transcript of the R/T tape recording. During the radiocommunications the controller supplied the crew with meteorological and other necessary landing information: \"Wind is calm, visibility 5 kilometres, shallow fog aver the runway is forming now, clouds 218 strato-cumulus 1 800 metres. QNH 1011, QFE 968 millibars. Temperature 10 and dew point also 10 degrees. Runway will be 31. After Dolsko make left pattern holding, descend down to 4 500 by QNH, report inbound.\" The crew acknowledged receipt of the information with: \"Roger. We have runway 31. Over Dolsko descend 4 500 in the holding pattern. The QNH 1 011.\" When the pilot asked the controller if the ILS was operating, the controller answered that he had radar contact at a position 20 NM southeast from the airport and advised the crew to make an ILS approach to runway 31, and to report after descending to 4 500 ft QNH. The crew acknowledged and reported they were at 4 500 ft and would call over Dolsko inbound for the outer marker and asked again if the ILS was operating and if it was serviceable. The controller answered affirmatively, adding that the ILS was working normally. He then gave the position \"abeam Dol\" and after that was acknowledged by the crew, he asked if they had contact with the runway. The crew confirmed that they had contact, and thereafter did not at any time indicate that they had lost contact, although it was implied by their request for a radar approach just before the accident occurred, and one minute later they reported having passed Dolsko continuing and descending towards runway 31. The controller acknowledged this information and requested the crew to \"check final for runway 31\", and gave the aircraft its position as 7 NM from touchdown on the centre line should be passing 3 300 ft and repeated \"check final for runway 31'. The crew acknowledged this message and 1 1/2 minute later reported having passed the outer marker inbound. The controller issued clearance for landing and advised that he had set the approach and runway lights to maximum intensity. He then left the radar console and went to the light control console at the same time glancing towards the approach and the runway. He could not see the aircraft but the approach and runway lights were clearly visible. At that moment, the crew requested radar assistance. The controller returned to the radar console and started to supply them with radar information. After giving the crew two aircraft positions of 34 NM and 2 NM from touchdown, he observed that the aircraft signal was turning to the right and gave a correction of 3° left. Observing that the aircraft did not make any correction, the controller informed the crew that its position was 1 1/2 NM from the touchdown, and asked the pilot whether he was making a short right turn to the radio beacon Menges. The crew did not reply, and there was no further contact with them although the controller continued calling. Radar contact was lost at 0047 hours local time on 1 September 1966 (2347 hours GMT on 31 August 1966) and when fire and smoke was seen from the tower, the controller gave the alarm and took necessary emergency measures. The rescue services, after 15 minutes, found the crashed aircraft on fire, in a wood, 2.8 km southeast of the threshold of runway 31 and 0.7 km north of the runway extended centre line. A crew member and 18 passengers were evacuated to local hospital while 98 other occupants were killed. The aircraft was destroyed by impact forces and a post crash fire. ", "probable_cause": "The probable cause of the accident was that the pilot-in- command did not set his altimeter to the QFE-968 mb in accordance with the information passed by the controller. However, the whole approach to the airport was made as if the altimeter had been set to the QFE, and resuited in the approach being about 1 250 ft lower than procedural safety altitudes, so that the aircraft crashed into tree tops. The copilot's altimeter was set to the QNH and he did not notice that the aircraft's approach was too low, because although it was a moonlight night he could not distinguish any visual landmarks, which might have warned him of the low altitude, due to the nature of the tree covered terrain over which they were flying. As the altimeter error passed unnoticed by both pilots and because they were not carrying out cross-checks of the two altimeters in accordance with the relevant operations manual instruction, the error was not corrected by climbing to a safe altitude. This disregard of the procedures laid down in the checklists and operations manual for approach and landing, may be explained by the fact that the approach was carried out on a moonlight night in calm weather and with visibility of approximately 12 NM, which reduced the crew's concentration on following precisely the prescribed procedures and checks. The visual effect of the runway slope made the situation worse, giving the pilots a wrong impression of the aircraft's approach angle. The copilot's altimeter was found set to 1005.5 mb. The difference between the QNH and QFE passed to the aircraft was approximately equivalent to 1 000 ft, a figure which might have led to further confusion. "}