{"url": "https://www.baaa-acro.com/crash/crash-canadair-cl-415-6b11-esine", "date": "Aug 16, 2003 at 1548 LT", "type": "Canadair CL-415", "operator": "SOREM", "flight_phase": "Flight", "flight_type": "Fire fighting", "survivors": "Yes", "site": "Mountains", "schedule": "Verona - Verona", "msn": "2008", "yom": 1995, "flight_number": "Tanker 9", "city": "Esine", "zone": "Lombardy", "country": "Italy", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 15700, "captain_hours_type": 3500, "copilot_hours": 2200, "copilot_hours_type": 400, "aircraft_hours": 1186, "circumstances": "The aircraft was dispatched over the region of Esine to fight a forest fire under call sign Tanker 9. The area under fire was located on the southern slope of the Val Camonica, about 8 NM northeast from Lake Iseo. While approaching the zone to be treated, the aircraft struck trees and crashed on the mountain slope. Both pilots were injured, one seriously, and the aircraft was destroyed. ", "probable_cause": "The cause of the accident is attributable to the human factor and can be identified in the impact of the aircraft against certain trees following the setting of an inadequate escape manoeuvre.\r\nThe following causal factors may have contributed to the dynamics of the accident:\r\n- The crew's failure to strictly comply with the Operator's Manual of Operations, which provided that the route of attack and escape should not be made uphill, unless there were very limited differences in level that could be overcome without power fluctuations,\r\n- The failure to carry out, as a precautionary measure, since the trajectory of the attack route has changed (from descending to ascending), a new reconnaissance with subsequent briefing by the crew, in order to properly assess the different perspective of all the elements of interest (orography, escape route, etc..), even if the Operating Manual provided for a new reconnaissance by the crew with a subsequent briefing only in the case of a different target, even within the same fire, not even if the target had remained unchanged, but had changed the trajectory of the attack,\r\n- The attack to the fire in unstabilized conditions, therefore not in line with what is previewed from the operating manual, even if the Operating Manual provided for a new reconnaissance by the crew with a subsequent briefing only in the case of a different target, even within the same fire, not even if the target had remained unchanged, but had changed the trajectory of the attack,\r\n- The attack to the fire in not stabilized conditions, therefore not in line with what is previewed from the operating manual;\r\n- The existence of communication problems within the cockpit, deriving from the fact that there was no information flow between the co-pilot (depositary of the information necessary for the assumption of the most appropriate operational decisions) and the commander, responsible for the final decisions; in this regard, it should be noted that radio communications with the DOCFS were made by the co-pilot in Italian, as the latter was not known by the commander, of Canadian nationality,\r\n- The significant difference in experience and age between the two crew members, with possible negative effects in terms of crew coordination,\r\n- The presence of critical points in the operating manuals, partly eliminated after the accident,\r\n- The presence of locally significant turbulence."}