{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-414-hudson-near-beddgelert-4-killed", "date": "Feb 4, 1943 at 0030 LT", "type": "Lockheed L-414 Hudson", "operator": "Royal-Air-Force-4", "flight_phase": "Flight", "flight_type": "Training", "survivors": "No", "site": "Mountains", "schedule": null, "msn": null, "yom": null, "flight_number": null, "city": "Beddgelert", "zone": "Gwynedd", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft left its base in the evening of February 3 on a night training exercise. One hour into the flight, following a navigational error, the aircraft went off course and was flying over the Snowdonia mountains. In poor visibility due to poor weather conditions, while cruising at an altitude of 2,300 feet, the twin engine aircraft hit the slope of Mt Llechog located northeast of Beddgelert. All four crew members were killed. \r\nCrew (1st OTU):\r\nSgt R. J. Bennett, pilot,\r\nSgt J. C. Sharpley, navigator,\r\nSgt S. J. Meddings, wireless operator and air gunner,\r\nSgt A. W. Peach, wireless operator and air gunner.\r\nSource: Alan Storr\r\nhttp://static.awm.gov.au/images/collection/pdf/RC09125_022--1-.pdf", "probable_cause": "A Court of Inquiry into the accident reported that : “ In our opinion the cause of the accident was faulty navigation resulting in an aircraft flying to a position approx 60 miles south of its intended turning point at Kish Lt. W/T facilities for checking the position do not appear to have been initiated at all apart from obtaining the one QDM. The aircraft was airborne at 2201 hours and using still air conditions should have turned at Kish Lt at 2306 hours. In actual fact it will be seen that it did not make this turn until 2342 hours ie.  36 minutes late. He stayed on the leg from South Rock to Kish Lt for a period of one hour instead of 31 minutes. The aircraft after leaving its estimated position at Kish Lt lost height and apparently obeyed the QDM which was passed as a weak signal and should have been treated with caution. It crashed on a mountain side at approx 2300 feet causing the death of the crew and the complete destruction of the aircraft.” The Grp Capt.CO RAF Silloth stated “ The cause of the accident remains obscure, but the findings of faulty navigation recorded by the Court is not an unlikely reason for the accident.” "}