{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-saint-barthelemy-20-killed", "date": "Mar 24, 2001 at 1628 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Air%20Caraibes", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Sint Maarten - Saint-Barthélemy", "msn": "254", "yom": 1969, "flight_number": "TX1501", "city": "Saint-Barthélemy-Rémy de Haenen (Saint-Jean-Gustave III)", "zone": "Saint-Barthélemy", "country": "Saint-Barthélemy", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 17, "pax_fatalities": 17, "other_fatalities": 1, "total_fatalities": 20, "captain_hours": 9864, "captain_hours_type": 5000, "copilot_hours": 670, "copilot_hours_type": 15, "aircraft_hours": 35680, "circumstances": "The aircraft departed Saint Maarten Airport on a flight to Saint-Barthélemy Airport under callsign TX1501, carrying 17 passengers and two pilots. The captain was pilot flying and the cruise level was 1,500 feet. The crew left the Sint Maarten Juliana aerodrome frequency when abeam of the island of Fourchue, the entry point of the aerodrome circuit located three nautical miles northwest of the island of Saint-Barthélemy. A few seconds later, they announced, on the Saint-Barthélemy Information frequency, that they were passing the 'Fourchue' reporting point. Shortly afterwards, they announced passing the 'Pain de Sucre' reporting point for a final approach to runway 10. That was their last communication. When the aircraft began its short final before the La Tourmente pass, several people, including the AFIS agent, saw it turn left which a steep bank angle then dive towards the ground. It crashed near a house and caught fire. All of the occupants perished, along with one person who was in the house. ", "probable_cause": "The accident appears to result from the Captain's use of the propellers in the reverse beta range, to improve control of his track on short final. A strong thrust asymmetry at the moment when coming out of the reverse beta range would have caused the loss of yaw control, then roll control of the aircraft. The investigation could not exclude three other hypotheses which can nevertheless be classified as quite unlikely:\r\n- A loss of control during a go-around,\r\n- A loss of control due to a stall,\r\n- A loss of control due to sudden incapacitation of one of the pilots,\r\nThe Captain's lack of recent experience on this airplane type, the undeniable difficulty of conducting an approach to runway 10 at Saint-Barthélemy and the pressure of time during this flight were contributory factors. The low height at which the loss of control occurred was an aggravating factor."}