{"url": "https://www.baaa-acro.com/crash/crash-antonov-8-irkutsk-2-killed", "date": "May 16, 1991", "type": "Antonov AN-8", "operator": "Minaviaprom", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Tbilisi - Omsk - Irkutsk - Komsomolsk-on-Amur", "msn": "133430", "yom": 1961, "flight_number": null, "city": "Irkutsk-2 (Northwest/Vostochny)", "zone": "Irkutsk oblast", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 17293, "circumstances": "Following a wrong approach configuration, the twin engine aircraft passed over the runway threshold at a height of 20 meters. At a distance of 300 meters from the runway end, the flight engineer (who was acting as a copilot on this flight) reduced power on both engines above idle. The captain took over control, increased engine power at maximum and initiated a go-around procedure when the left engine autofeathered. At a speed of 170 km/h, the aircraft banked left to an angle of 70° then stalled and crashed 1,526 meters past the runway end. Seven occupants were injured while two others, including one pilot, were killed. ", "probable_cause": "It was determined that the copilot was intoxicated when he started his duty and was revoked for this flight and replaced by the flight engineer who was in the right seat at the time of the accident. The crew violation of reducing the operating mode of both engines followed by a sudden increase in power resulted in the left engine being automatically feathered. The following contributing factors were reported:\r\n- Poor crew interactions and coordination;  \r\n- Errors in landing calculations; \r\n- Poor approach configuration; \r\n- Disproportionate reaction from the captain; \r\n- The replacement of the copilot by the flight engineer due to his incapacity to fly because he was intoxicated."}