{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31p-425-navajo-dalton-1-killed", "date": "Jun 30, 2012 at 1620 LT", "type": "Piper PA-31-310 Navajo", "operator": "Donald L. Holbrook", "flight_phase": "Takeoff (climb)", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Dalton - Dalton", "msn": "31-7300157", "yom": 1973, "flight_number": null, "city": "Dalton", "zone": "Georgia", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1685, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "According to a friend of the pilot, the pilot was taking the airplane to have an annual inspection completed. The friend assisted the pilot before departure and watched as the airplane departed. He did not notice any anomalies with the airplane during the takeoff or the climbout. According to a witness in the vicinity of the accident site, he heard the airplane coming toward him, and it was flying very low. He looked up and saw the airplane approximately 200 feet over his house and descending toward the trees. As he watched the airplane, he noticed that the right propeller was not turning, and the right engine was not running. He stated that the left engine sounded as if it was running at full power. The airplane pitched up to avoid a power line and rolled to the right, descending below the tree line. A plume of smoke and an explosion followed. Examination of the right propeller assembly revealed evidence of significant frontal impact. The blades were bent but did not have indications of rotational scoring; thus they likely were not rotating at impact. One preload plate impact mark indicated that the blades were at an approximate 23-degree angle; blades that are feathered are about 86 degrees. Due to fire and impact damage of the right engine and related system components, the reason for the loss of power could not be determined. An examination of the airframe and left engine revealed no mechanical malfunctions or failures that would have precluded normal operation. A review of the airplane maintenance logbooks revealed that the annual inspection was 12 days overdue. According to Lycoming Service Instruction No. 1009AS, the recommended time between engine overhaul is 1,200 hours or 12 years, whichever occurs first. A review of the right engine maintenance logbook revealed that the engine had accumulated 1,435 hours since major overhaul and that neither engine had been overhauled within the preceding 12 years. Although the propeller manufacturer recommends that the propeller be feathered before the engine rpm drops below 1,000 rpm, a review of the latest revision of the pilot operating handbook (POH) revealed that the feathering procedure for engine failure did not specify this. It is likely that the pilot did not feather the right propeller before the engine reached the critical 1,000 rpm, which prevented the propeller from engaging in the feathered position", "probable_cause": "The pilot’s failure to maintain airplane control following loss of power in the right engine for reasons that could not be determined because of fire and impact damage. Contributing to the accident was the pilot’s delayed feathering of the right propeller following the loss of engine power and the lack of specific emergency procedures in the pilot operating handbook indicating the need to  feather the propellers before engine rpm falls below 1,000 rpm."}