{"url": "https://www.baaa-acro.com/crash/crash-gulfstream-giv-bukavu-6-killed", "date": "Feb 12, 2012 at 1300 LT", "type": "Gulfstream GIV", "operator": "Stanford Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Government", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kinshasa - Goma - Bukavu", "msn": "1104", "yom": 1989, "flight_number": null, "city": "Bukavu", "zone": "Sud-Kivu", "country": "Democratic Republic of Congo", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 2, "other_fatalities": 2, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was performing a flight from Kinshasa to Bukavu with an intermediate stop in Goma on behalf of the DRC Government. After touchdown at Bukavu-Kavumu Airport, the aircraft failed to stop within the remaining distance. It veered off runway to the left, went down 20 metres high embankment before coming to rest, broken in two. There was no fire. Both pilots, a passenger and two people on the ground were killed. All others occupants were seriously injured. Fifteen days later, on 27FEB2012, a second passenger died from his injuries. The Governor of Katanga Katumba Mwanke was killed as well as the Deputy of Lukunga District Oscar Gema di Mageko who died on 27FEB2012. The survivors were the Finance Minister Matata Ponyo, the Governor of Sud-Kivu Marcelin Cishambo and the Ambassador of the President Antoine Ghonda. ", "probable_cause": "It was determined that the crew was not focused on the landing procedure during the approach, causing the aircraft to be well above the glide. In such conditions, the aircraft landed 1,200 metres past the runway threshold (the runway is 2,000 metres long). After touchdown, the crew activated the reverse thrust systems on both engines but the spoilers were not used. With a landing distance of about 800 metres, the aircraft could not be stopped in a safely manner and the crew failed to initiate a go-around procedure. "}