{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa26t-merlin-iib-monongahela", "date": "Oct 12, 1990 at 1545 LT", "type": "Swearingen SA26T Merlin II", "operator": "Gary Zagari & Associates", "flight_phase": "Landing (descent or approach)", "flight_type": "Ferry", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Monongahela – Pittsburgh – Teterboro – Pittsburgh – Monongahela", "msn": "T26-141", "yom": 1969, "flight_number": null, "city": "Monongahela-Rostraver", "zone": "Pennsylvania", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7525, "captain_hours_type": 21, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The flight was from Monongahela to Pittsburgh to Teterboro, NJ, then return to Pittsburgh and back to Monongahela. The flight departed Monongahela with 100 gallons of fuel; 160 gallons were added at Pittsburgh; and 80 gallons were added at Teterboro. The pilot wanted to add more fuel at Teterboro but the owner did not due to the higher cost of fuel and the fuel gage indications. During the return trip no fuel was added at Pittsburgh because the pilot did not have a credit card provided by the owner or money to buy fuel. The flight experienced a two-engine power loss due to fuel exhaustion while approaching the Monongahela Airport. Subsequent examination of the cockpit fuel gages showed a total of 125 gallons in the left tank and 90 gallons in the right tank; the reading remained the same with or without power. ", "probable_cause": "The pilot's inadequate monitoring of the fuel burn which resulted in total fuel exhaustion. Factors which contributed to the accident were: the pilot's limited experience in the make and model of airplane, an erroneous fuel quantity indication, and the pilot's failure to refuel the airplane due to pressure from the owner to not add fuel."}