{"url": "https://www.baaa-acro.com/crash/crash-cessna-f406-caravan-ii-johannesburg-3-killed", "date": "Nov 2, 2001 at 0320 LT", "type": "Cessna 406 Caravan", "operator": "Transafrican Aviation", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Johannesburg - Windhoek", "msn": "406-0041", "yom": 1989, "flight_number": null, "city": "Johannesburg-Oliver Reginald Tambo (Jan Smuts)", "zone": "Gauteng", "country": "South Africa", "region": "Africa", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 1956, "captain_hours_type": 1001, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Johannesburg International Airport at 0119Z on an international cargo flight to Eros, an aerodrome located on the outskirts of Windhoek the capital of Namibia. There were two pilots and a passenger onboard the aircraft as well a substantial amount of cargo, consisting mainly of express freight parcels and two heavy steel bars approximately 3 metres in length each. The aircraft crashed approximately 106 seconds after commencing its take-off roll, impacting the ground in a left wing low attitude approximately 700 metres South of the threshold of runway 03R at Johannesburg International Airport in a marshy area. All three occupants onboard were fatally injured and the aircraft was destroyed. ", "probable_cause": "The accident resulted due to a loss of control (aircraft becoming uncontrollable in the pitch and roll axis), which occurred approximately 35 to 40 seconds after lift-off/rotation. It was induced and aggravated by a 16% overload condition as well as the exceedance of the certified aft CG limitation of the aircraft. The investigation revealed that the aircraft was overloaded by approximately 16% 699.6kg). The cargo was not secured, nor was there a seat or a restraining device in the aircraft for the passenger that was onboard the ill-fated flight. The last Mandatory Periodic Inspection prior to the accident was certified on 30 May 2001 at 4 353.1 airframe hours, by AMO No. 273. Since the inspection was certified a further 96.6 hours were flown. The Certificate of Airworthiness for the aircraft was invalid at the time of the accident, as both engines have exceeded their TBO (time between overhaul) by approximately 185 hours. "}