{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-c90-king-air-rhinelander", "date": "Dec 28, 1996 at 1145 LT", "type": "Beechcraft 90 King Air", "operator": "Mutual Security", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "Plain, Valley", "schedule": "Moline - Rhinelander", "msn": "LJ-785", "yom": 1978, "flight_number": null, "city": "Rhinelander", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 932, "captain_hours_type": 338, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 6301, "circumstances": "There were five recorded transmissions of conversations from one of the pilots aboard the accident airplane and the Fort Dodge, Iowa AFSS; one on 12/27 and four on 12/28. The weather forecast for icing included wording such as '...moderate to isolated severe icing from seven thousand downward for your entire route of flight....' The pilot stated that he received 'Full Flight Service briefings...' and also indicated that he spoke to flight watch prior to takeoff. While executing the ILS approach to the destination airport, the pilot was unable to maintain the proper glidepath even with the application of full power. The pilot maintained marginal control of the airplane during the descent until impact with trees and the terrain about 10 miles west of the destination airport. The pilot and passengers reported 'vibration' and 'shudder' of the airplane prior to the impact. One passenger reported that she saw ice forming on the left 'rear' wings. Persons on the ground reported severe icing conditions around the time of the accident. ", "probable_cause": "the pilot-in-command's inadequate weather evaluation and continued flight into forecast severe icing conditions which exceeded the capabilIty of the airplane's anti-ice/deice system. The icing conditions were a factor. "}