{"url": "https://www.baaa-acro.com/crash/crash-consolidated-b-24h-20-cf-liberator-freckleton-61-killed", "date": "Aug 23, 1944 at 1047 LT", "type": "Consolidated B-24 Liberator", "operator": "USAAF", "flight_phase": "Landing (descent or approach)", "flight_type": "Test", "survivors": "No", "site": "City", "schedule": "Warton - Warton", "msn": "722", "yom": null, "flight_number": null, "city": "Warton AFB", "zone": "Lancashire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 58, "total_fatalities": 61, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The crew was performing a circular test flight at RAF Warton after the plane had been refurbished. Following an uneventful flight, the crew started the approach to runway 08 and received the authorization to land. At that time, weather conditions deteriorated with low clouds down to 120 meters above ground, heavy rain falls and winds gusting up to 25 knots. From a height of dozen feet, the aircraft went out of control, banked left and came with wings near vertical before crashing in a huge explosion in the center of the village of Freckleton. The aircraft hit several houses, a school and a cafe as well. All three crew members were killed and 58 others on the ground: 38 children and two teachers in the school, and 18 people in the cafe: seven US officers, four British officers and seven civilians. To date, this was considered as the worst air disaster in the world. \r\nCrew:\r\n1st Lt John A. Bloemendal, pilot,\r\nT/Sgt James M. Parr, copilot,\r\nSgt Gordon W. Kinney, flight engineer.\r\nMore info on http://laituk.org/B-24 42-50291.htm", "probable_cause": "The official report stated that the exact cause of the crash could not be determined. However, it was concluded that the pilot had not fully realized the danger the storm posed until underway in his final approach, by which time he had insufficient altitude and speed to maneuver, given the probable strength of wind and downdrafts that must have prevailed. A structural failure of the aircraft in the extreme conditions was not ruled out, although the complete destruction of the airframe had precluded any meaningful investigation. Noting that many of the pilots coming to the UK commonly believed that British storms were little more than showers, the report recommended that all US trained pilots should be emphatically warned of the dangers of British thunderstorms."}