{"url": "https://www.baaa-acro.com/crash/crash-boeing-e-3b-sentry-elmendorf-afb-24-killed", "date": "Sep 22, 1995 at 0747 LT", "type": "Boeing E-3 Sentry", "operator": "United%20States%20Air%20Force", "flight_phase": "Takeoff (climb)", "flight_type": "Survey / Patrol / Reconnaissance", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Elmendorf - Elmendorf", "msn": "21554", "yom": 1978, "flight_number": "Yukla 27", "city": "Elmendorf-Richardson AFB (JBER)", "zone": "Alaska", "country": "United States of America", "region": "North America", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 20, "pax_fatalities": 20, "other_fatalities": 0, "total_fatalities": 24, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft was dispatched out from Elmendorf AFB on an AWACS survey mission under call sign Yukla 27, carrying 20 passengers and four crew members. Shortly after takeoff from runway 05, while in initial climb, the aircraft collided with a flock of Canada geese that struck both left engines n°1 and 2. The aircraft climbed to a maximum height of about 250 feet when the engine n°1 failed and the engine n°2 exploded. The aircraft entered an uncontrolled left roll, causing the left wing to struck trees. Out of control, it crashed in a huge explosion in a wooded area located about a mile from the runway end. The aircraft disintegrated on impact and all 24 occupants were killed. Numerous dead geese were found at the crash site. ", "probable_cause": "It was determined that the loss of control and subsequent crash was the consequence of a collision with Canada geese during initial climb. Investigations revealed that a USAF Lockheed C-130 just took off from the same runway about two minutes prior to the accident. At that time, numerous geese were standing near the runway end and were probably disturbed by the C-130 low pass. All geese took off and remained hovering at low height. This phenomenon was spotted by the tower controller who failed to warn the Sentry crew accordingly. It was also determined that there was no efficient program to detect and deter bird hazard at Elmendorf AFB. "}