{"url": "https://www.baaa-acro.com/crash/crash-airbus-a300b4-230f-recife", "date": "Oct 21, 2016 at 0630 LT", "type": "Airbus A300", "operator": "Sterna%20Linhas%20A%C3%A9reas", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "São Paulo – Recife", "msn": "236", "yom": 1983, "flight_number": "STR9302", "city": "Recife-Guararapes", "zone": "Pernambuco", "country": "Brazil", "region": "South America", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 11180, "captain_hours_type": 3000, "copilot_hours": 7300, "copilot_hours_type": 800, "aircraft_hours": null, "circumstances": "Following an uneventful cargo service from São Paulo-Guarulhos Airport, the crew initiated the descent to Recife-Guararapes Airport. On final approach to runway 18, after the aircraft had been configured for landing, at an altitude of 500 feet, the crew was cleared to land. After touchdown, the thrust lever for the left engine was pushed to maximum takeoff power while the thrust lever for the right engine was simultaneously brang to the idle position then to reverse. This asymetric configuration caused the aircraft to veer to the right and control was lost. The airplane veered off runway to the right and, while contacting soft grounf, the nose gear collapsed. The airplane came to rest to the right of the runway and was damaged beyond repair. All four occupants evacuated safely. ", "probable_cause": "Contributing factors.\r\n- Control skills - undetermined\r\nInadequate use of aircraft controls, particularly as regards the mode of operation of the Autothrottle in use and the non-reduction of the IDLE power levers at touch down, may have led to a conflict between pilots when performing the landing and the automation logic active during approach. In addition, the use of only one reverse (on the right engine) and placing the left throttle lever at maximum takeoff power resulted in an asymmetric thrust that contributed to the loss of control on the ground.\r\n- Attitude - undetermined\r\nThe adoption of practices different from the aircraft manual denoted an attitude of noncompliance with the procedures provided, which contributed to put the equipment in an unexpected condition: non-automatic opening of ground spoilers and asymmetric thrust of the engines. These factors required additional pilot intervention (hand control), which may have made it difficult to manage the circumstances that followed the touch and led to the runway excursion.\r\n- Crew Resource Management - a contributor\r\nThe involvement of the PM in commanding the aircraft during the events leading up to the runway excursion to the detriment of its primary responsibility, which would be to monitor systems and assist the PF in conducting the flight, characterized an inefficiency in harnessing the human resources available for the airplane operation. Thus, the improper management of the tasks assigned to each crewmember and the non-observance of the CRM principles delayed the identification of the root cause of the aircraft abnormal behavior.\r\n- Organizational culture - a contributor\r\nThe reliance on the crew's technical capacity, based on their previous aviation experience, has fostered an informal organizational environment. This informality contributed to the adoption of practices that differed from the anticipated procedures regarding the management and operation of the aircraft. This not compliance with the procedures highlights a lack of safety culture, as lessons learnt from previous similar accidents (such as those in Irkutsk and Congonhas involving landing using only one reverse and pushing the thrust levers forward), have apparently not been taken into account at the airline level.\r\n- Piloting judgment - undetermined\r\nThe habit of not reducing the throttle lever to the IDLE position when passing at 20ft diverged from the procedures contained in the aircraft-operating manual and prevented the automatic opening of ground spoilers. It is possible that the consequences of this adaptation of the procedure related to the operation of the airplane were not adequately evaluated, which made it difficult to understand and manage the condition experienced.\r\n- Perception - a contributor\r\nFailure to perceive the position of the left lever denoted a lowering of the crew's situational awareness, as it apparently only realized the real cause of the aircraft yaw when the runway excursion was already underway.\r\n- Decision-making process - a contributor\r\nAn inaccurate assessment of the causes that would justify the behavior of the aircraft during the landing resulted in a delay in the application of the necessary power reduction procedure, that is, repositioning the left engine power lever."}