{"url": "https://www.baaa-acro.com/crash/crash-pzl-mielec-2r-yugorsk-1-killed", "date": "Nov 25, 2012 at 1120 LT", "type": "PZL-Mielec AN-2", "operator": "Maestro Aeroclub", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Yugorsk - Yugorsk", "msn": "1G230-31", "yom": 1988, "flight_number": null, "city": "Yugorsk", "zone": "Khantia-Mansia okrug", "country": "Russia", "region": "Asia", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 9, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 12116, "captain_hours_type": 3068, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 1250, "circumstances": "The single engine aircraft was engaged in a local skydiving mission, carrying one pilot and 9 skydivers. Shortly after take off from runway 31, while climbing to a height of about 80 meters, the engine suffered a power loss. The pilot initiated a left turn to reach the airport when the aircraft rolled to an angle of 60° then stalled and crashed in a snow covered field near a forest, bursting into flames. The aircraft was destroyed by a post impact fire. Nine occupants escaped injured and a passenger was killed. ", "probable_cause": " Most probably the accident with  and An-2 RA-33589 aircraft was caused by aircraft beyond stall angle of attack entry during dynamic turn for emergency landing with reverse runway heading due to engine failure after take-off at low-altitude followed by shaking and its power loss resulted in aircraft ground impact with bank angle more than 60°. Engine failure was caused by high-temperature damage and destruction of cylinder-piston group details due to it inadequate technical operation and using motor gasoline in aircraft fuel flow system which quality didn't comply with requirements for preferred AI-95 gasoline in accordance with aeronautical equipment flight service evaluation program, Order of Ministry of Transport of the Russian Federation № НА-131-р from April 11, 2001 and engineering solution № АБ-1236-2003 from May 22, 2003. Most probably the contributing factor was partial skill loss of An-2 aircraft control by aircraft pilot in command (PIC). Flight operation was performed by PIC, meteorological minimas and which authorizations written in Private-Pilot License and the fact of medical flight-expert commission procedure were not documented. PIC's decision to perform straight-ahead landing most probably didn't allow to reduce the severity of accident consequences."}