{"url": "https://www.baaa-acro.com/crash/ground-fire-boeing-737-2k3-kaduna", "date": "Feb 23, 1998 at 1623 LT", "type": "Boeing 737-200", "operator": "Chanchangi%20Airlines", "flight_phase": "Taxiing", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Kaduna - Kaduna", "msn": "24139", "yom": 1988, "flight_number": null, "city": "Kaduna-Intl", "zone": "Kaduna", "country": "Nigeria", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 21, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The Boeing 737 completed a flight from Lagos (LOS) through Abuja (ABV) to Kaduna (KAD) and was parked for over an hour. At 14:45 UTC, the Chief Pilot of Chanchangi Airline approached the Air Traffic Controller stating that he would like to fly around the circuit for a training flight. He was told that the visibility was 600 meters which was below the landing minima and was then advised against it. The pilot then suggested that he would carry out a \"Rejected Takeoff\" training. Additional persons boarded the flight to witness the exercise. At 15:37 UTC the pilot requested a take off clearance which was granted, and was directed to proceed to the holding point of runway 05. The prevailing visibility was 600 meters and the wind was 090 at 10 knots. Four rejected take off training runs were carried out within an interval of twelve minutes. In the conditions at Kaduna, a single exercise of a rejected take off would have required a cooling period of at least ten minutes. At the end of the fourth run, the left main landing gear number 2 brake unit had started to burn. The pilot steered the airplane off the runway into the last taxiway. Fifty meters from the runway 05 threshold the left inner wheel failed and leaving a molten rubber footprint on the taxiway and at the same time the hydraulic fluid of the brake units started to spill tracing an oily track along. Pieces of broken wheel rim were randomly shed for a distance of 150 meters when the rims appeared to undergo a major collapse. The footprint of the two left wheels became more pronounced for a distance of 120 meters when there was a positive turn to the left indicating a total failure in roll from the left wheel assembly. The zigzag motion continued for about 699 meters until the aircraft could no longer be easily moved and the pilot called for the fire trucks. The aircraft burnt to ashes on the spot.", "probable_cause": "The decision of the instructor pilot to carry out four rejected take-off exercises within a time interval of twelve minutes was the main cause of the accident. His estimate of reducing the brake temperatures by avoiding the use of brakes was a fabrication which is contradicted by the fact that the brake units on the left main landing gear did heat up and started the fire."}