{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-300-hyannis-1-killed", "date": "Jun 17, 1979 at 2248 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Air%20New%20England", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New York-LaGuardia – New Bedford – Hyannis", "msn": "245", "yom": 1969, "flight_number": "NE248", "city": "Hyannis-Barnstable", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 8, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 25101, "captain_hours_type": 951, "copilot_hours": 4362, "copilot_hours_type": 102, "aircraft_hours": 17058, "circumstances": "Before loading the aircraft for takeoff from LaGuardia, the flight crew checked the enroute weather for the return flight to Hyannis and learned that a landing at the en route stop at New Bedford might not be possible. When they were advised of the weather situation, the passengers destined for New Bedford decided to remain in LaGuardia. At 2132, flight 248 departed LaGuardia for Hyannis on the last leg of the day. There were eight passengers and two flight crew members aboard. According to the first officer's and a passenger's testimony at the public hearing during the investigation of the accident, flight 248 was normal until the approach for landing at Hyannis. At 2234:08, flight 248 contacted Otis Approach Control and reported level at 5,000 feet. At 2239:05, the flight was given the current Hyannis weather which included an indefinite ceiling of 200 feet, sky obscured, visibility 3/4 mile in fog, wind 210° at 10 knots. It also included a visibility of 1 1/8 in light drizzle on runway 24. At 2244:36, flight 248 was 4 nmi north-northeast of the outer marker when Otis Approach Control gave the flight a vector of 210° to intercept the localizer at 1,700 feet for an ILS approach to runway 24 at the Barnstable Airport. At 2245:34, flight 248 was instructed to contact the Barnstable Airport tower. About 2247, the flight complied with this request and reported crossing the outer marker. The flight was cleared to land, however, no further transmissions were heard form the aircraft. The Boston Air Route Traffic Control Center (Boston Center) was able to track flight 248 to within 2.8 nmi of the intended touchdown point on runway 24. Boston Center's computer printout showed the flight's position at 2246:51 about 0.35 nmi northeast of the ILS outer marker at 1,700 feet. It also showed the flight about 0.15 nmi southwest of the outer marker at 1,500 feet at 2247:03. The last radar position shown for the flight was about 1.1 nmi southwest of the outer marker at 2247:27 at 1,100 feet. The first officer stated that the captain was flying the aircraft during the approach to Hyannis. He said that he made the following callouts: localizer alive, outer marker, 500 feet above, 200 feet above, 100 feet above, minimums, and 100 feet below. He said that the captain did not acknowledge any of these calls. The first officer said that when he called 'minimums', the aircraft was one dot below the ILS glidepath. The first officer said that it appeared that the aircraft was in a continual descent without any excessive sink rates or descent angles from 5,000 feet until impact, with the airspeed near 130 knots for the entire approach. He stated that, as he called '100 feet below', he looked outside the cockpit because he believed that the captain had the approach lights in sight. The first officer said that he did not see the ground before the aircraft crashed about 2248 into a heavily wooded area located 1.5 nmi from the approach end of runway 24, on the runway centerline extended. The accident occurred during the hours of darkness. The captain was killed while all other occupants were injured, some of them seriously. ", "probable_cause": "The National Transportation Safety Board determines that the probable cause of the accident was the failure of the flightcrew to recognize and react in a timely manner to the gross deviation from acceptable approach parameters, resulting in a continuation of the descent well below decision height during a precision approach without visual contact with the runway environment. Although the Board was unable to determine conclusively the reason for the failure to recognize and react to the gross deviation, it is believed that the degraded physiological condition of the captain seriously impaired his performance. Also, the lack of adequate crew coordination practices and procedures contributed to the first officer's failure to detect and react to the situation in a timely manner. "}