{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-47b-20-dk-jersey-26-killed", "date": "Apr 14, 1965 at 1806 LT", "type": "Douglas C-47 Skytrain (DC-3)", "operator": "British%20United%20Airways_0", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Paris – Jersey", "msn": "15762/27207", "yom": 1945, "flight_number": "BR1030X", "city": "Jersey", "zone": "Channel Islands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 4, "crew_fatalities": 3, "pax_on_board": 23, "pax_fatalities": 23, "other_fatalities": 0, "total_fatalities": 26, "captain_hours": 4750, "captain_hours_type": 1227, "copilot_hours": 1188, "copilot_hours_type": 730, "aircraft_hours": 18544, "circumstances": "Flight 1030X was an extra scheduled international flight from Paris (Orly), France, to Jersey, Channel Islands. It took off from Orly at 1626 hours GMT. At 1706 hours, when about 100 miles from Jersey, the pilot made his first radio contact with Jersey zone concerning the Jersey weather. At 1742 hours he informed Jersey zone that he was descending to 1 500 ft and estimated Jersey at 1755 hours. He was then given the 1720 hours Jersey weather report, which included visibility 80 m, RVR 200 m and 818 cloud at the surface, after which the aircraft was cleared to Jersey Approach Control. In response to the approach controller's question as to his intentions concerning diversion, the pilot replied: \"We'll come down the ILS and then overshoot and go to Dinard.\" The controller then cleared the aircraft to 1 000 ft and passed the QFE as 1 007 mb. The aircraft arrived at the Jersey beacon at 1753 hours and began an approach to runway 27, during which the guidance provided from the ILS was supplemented by distance information provided by the controller from the indications of the Decca 424 radar. The approach, the subsequent overshoot and the climb to 1 000 ft appear to have been without incident, following which the pilot informed the controller of his intention to make another approach and requested radar guidance back to the ILS outer marker. After directing the aircraft into position for a second approach to runway 27, the controller advised the pilot to take up his own headings on the ILS and informed him at 1803 hours that the aircraft was 5 miles from touchdown. Just after being given a distance of 4 miles, the pilot reported passing the outer marker and also that he was established, thus indicating that guidance was being received from the ILS and being used for the approach. Subsequent distance information was given by the controller at 1.5 mile, which was not acknowledged by the pilot, and again at 1 mile (at 1806:13 hours). Both these transmissions were clipped and are recorded as \"... and a half miles now\" and \"... mile from touchdown\". The latter transmission provoked an immediate \"how many?\" from the pilot, to which the controller replied by giving \"three quarters of a mile now and left of the centre line.\" The pilot acknowledged this at 1806:24* hours with \"TB\" (the final two letters of the aircraft's registration). This was the last communication received from the aircraft. According to the air hostess, (the sole survivor), the flight was uneventful up to the time of the accident. She did not have any feeling of descending at any time. There was a bump which she attributed to the starboard undercarriage wheels having hit something; this was followed by a momentary roll to the right and a much greater roll back to the left. Subsequently, it was established that the aircraft had hit with its starboard wing the outermost approach light pole, which was 3 000 ft from the runway threshold, at a height 58 ft above runway level. After climbing slightly,'it rolled to an inverted attitude, at which time the starboard wing folded rearwards and separated as the aircraft dived to the ground, still inverted. It crashed at about 1806:27 hours. The stewardess survived while all 26 other occupants were killed. ", "probable_cause": "The aircraft struck the approach lighting when it was flown below the safe approach path during an approach to land in conditions of very low cloud and poor visibility, the pilot having disregarded the approach ban applied by his operations manual."}