{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54g-15-do-skymaster-ramona-2-killed", "date": "Jun 21, 1995 at 1108 LT", "type": "Douglas C-54 Skymaster", "operator": "Aero%20Union.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Fire fighting", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Hemet - Ramona", "msn": "36082", "yom": 1945, "flight_number": "Tanker 19", "city": "Ramona", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6100, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 23507, "circumstances": "A Douglas C-54G & Beech 58P were on a fire suppression mission with the USDA Forest Service. The C-54 (Tanker 19) was being used as an aerial tanker, while the Beech 58 (Lead 56) was on a lead operation. Lead 56 departed the fire area about 5 minutes before Tanker 19. Both airplanes proceeded to an uncontrolled airport at Ramona, CA, for landing on runway 27 with a 360° overhead approach. Tanker 19 was on the initial approach about 1 mile east of the airport, when the two planes collided. Investigation revealed that Lead 56 struck the vertical stabilizer of Tanker 19, while descending. The empennages of both airplanes separated, and both crashed in uncontrolled descents. Before the accident, a Grumman S2 pilot was following Tanker 19. While in a shallow descent to the airport, he saw Tanker 19 slightly below the horizon and heard Tanker 19 make two calls (at 8 and 2 miles on initial approach). He also heard a transmission from Lead 56 moments before the collision, but did not see Lead 56, nor was he watching Tanker 19 when the collision occurred. Investigators were unable to determine Lead 56's activities after departing the fire area. Transmissions were heard from Lead 56 on the forest service tactical (operations) frequency when the plane was within 10 miles of the airport. Moments before the collision, Lead 56 was heard on the airport's common traffic advisory frequency (ctaf). Forest service procedures required that all pilots transmit their position on the ctaf within 10 miles of the airport. The forest service had not made arrangements with the airport manager to perform overhead approaches, nor were parameters published for initial approach altitude or airspeed.", "probable_cause": "Inadequate visual lookout by the Beech 58P pilot, and the operator's inadequate procedures concerning 360° overhead approaches."}