{"url": "https://www.baaa-acro.com/crash/crash-boeing-747-121-karachi", "date": "Aug 4, 1983 at 0438 LT", "type": "Boeing 747-100", "operator": "Pan%20Am.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "New Delhi – Karachi – London – New York", "msn": "19645", "yom": 1970, "flight_number": "PA073", "city": "Karachi-Muhammad Ali Jinnah-Quaid-e-Azam", "zone": "Sindh (سنڌ سندھ)", "country": "Pakistan", "region": "Asia", "crew_on_board": 16, "crew_fatalities": 0, "pax_on_board": 227, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 53324, "circumstances": "Flight PA073 was cleared to land on runway 25R of Karachi International Airport (KHI), Pakistan. The approach speed just prior to touchdown was 152 knots. After touchdown reverse thrust was applied on engines n°1, 2 and 3. Engine No.4 which had an unserviceable reverser was left in forward idle. Seventy knots was called and some three seconds later reverse power was decreased. At this stage EPR on n°4 engine increased rapidly. The aircraft veered to the left of the centerline at about 7400 feet from the approach end of runway 25R and departed the runway edge at 8000 feet from the approach end of runway 25R with 2,500 feet of runway remaining. Shortly before the aircraft departed the runway, the pilot flying (copilot) reported that he had no brakes and no nose wheel steering. The captain stated that he got on the brakes and tiller at this time to assist. After departing the runway surface the aircraft travelled 380 feet through soft mud before it came to rest at a point about 2100 feet from the end of runway 25R, heading about 160 degrees on the Southern side of the runway with the tail of the aircraft 120 feet from the runway edge. Shortly after the aircraft departed the runway, the nose gear struck a VASI light installation and its concrete base causing the nose gear to collapse backwards and to the left, resulting in total destruction of the VASI light installation and damage to the forward cargo hold, floor of the first class section and the stairway leading to the upper deck. Damage to the aircraft was substantial and it was not repaired. All 243 occupants evacuated safely. \r\nSource: ASN", "probable_cause": "Loss of directional control as the result of inadvertent application of forward thrust on n°4 engine at the time the pilot flying was coming out of reverse thrust on engines n°1, 2 and 3 during the landing roll, and subsequent failure of the crew to recognize the asymmetric power condition. Contributing were failure of the crew to monitor the engines, and failure to follow specified procedures during the landing."}