{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-6b-milan-4-killed", "date": "Feb 18, 1966 at 0304 LT", "type": "Douglas DC-6", "operator": "BIAS", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Brusssels - Milan", "msn": "43829/351", "yom": 1953, "flight_number": null, "city": "Milan-Malpensa", "zone": "Lombardy", "country": "Italy", "region": "Europe", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 6770, "captain_hours_type": 1619, "copilot_hours": 6958, "copilot_hours_type": 21, "aircraft_hours": null, "circumstances": "The aircraft had taken off from Brussels at 0010 hours GMT on 18 February 1966 on a cargo flight to Milan-Malpensa, Italy, to transport 214 calves. The flight was routine until the aircraft arrived over the Saronno VOR/NDB at 0148 hours. It was then cleared by Milan ACC to fly directly to the Malpensa radio beacon with a 6 000 ft \"clearance limit\" and to contact Malpensa APP directly. The aircraft was duly transferred to this latter unit at 0150 hours. At 0153 hours the aircraft was over NDB Malpensa at 6 000 feet and was cleared by Malpensa APP to carry out a STANDARD/ILS (SIA) approach procedure to runway 35R. The aircraft was also provided with complete meteorological data for Malpensa Airport; runway visibility was given as 250 m. The aircraft left the 6 000 ft level at 0153:20 hours outbound on track 1550 as specified in AIP/ITALY MAP/050/1. At 0157:33 hours the pilot reported on approach inbound (352°) at 4 000 feet. At 0159:49 hours the Malpensa airport PAR controller provided the pilot with the current parameters: distance 7 NM/on track/ on the glide path. At 0200:44 hours the pilot reported 2 000 ft at the outer marker. It was cleared by Malpensa APP to land on runway 35R and instructed to report runway in sight. The ground/air/ground communications log indicates that the approach procedure was being carried out correctly and at 0202:50 hours the radar controller informed the pilot that he was over the approach end of the runway. This was the last contact between the aircraft and the control services. The aircraft had actually carried out a night-time final approach phase procedure in extremely critical visibility conditions because of fog, and in such conditions it had crossed the threshold of runway 35R deviating about 8° to the right in relation to the runway centre line; it then continued alongside the runway for about 2 400 m and struck the top of a group of trees beyond which it crashed to the ground approximately 3 000 m from the runway threshold and 435 m from its centre line. The aircraft caught fire following fuel spillage after impact with the ground. All the occupants were killed and the cargo was destroyed.", "probable_cause": "The Commission attributed the accident to the following causes: \r\n(1) Failure of the pilot to comply with the Company's \"minima\"; \r\n(2) Subsequent belated decision to execute the missed approach procedure. "}