{"url": "https://www.baaa-acro.com/crash/crash-boeing-720-051b-everglades-national-park-43-killed", "date": "Feb 12, 1963 at 1350 LT", "type": "Boeing 720", "operator": "Northwest%20Airlines2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Miami – Chicago – Spokane – Seattle – Portland", "msn": "18354", "yom": 1961, "flight_number": "NW705", "city": "Everglades National Park", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 35, "pax_fatalities": 35, "other_fatalities": 0, "total_fatalities": 43, "captain_hours": 17835, "captain_hours_type": 150, "copilot_hours": 11799, "copilot_hours_type": 1093, "aircraft_hours": 4684, "circumstances": "The aircraft arrived in Miami at 1240, following a routine flight from Chicago, Illinois The captain of the inbound flight reported that the only mechanical discrepancy was, \"the outflow valves being a little sticky merely made it a little difficult to maintain the pressurization in a smooth manner. \"These valves were cleaned, and a leaking rivet at the No. 4 reserve fuel tank was plugged when it was noticed by the mechanic. This was the only maintenance performed during the \"turnaround\". Flight 705 is regularly scheduled from Miami. to Portland, Oregon, with intermediate stops at Chicago, Illinois and Spokane and Seattle, Washington. The computed takeoff gross weight of 175,784 pounds, and center of gravity (e.g.) of 25 percent mean aerodynamic chord (MAC) were both well within the allowable limits. Prior to departing the ramp at 1325, the crew asked the ground controller about the departure routes being utilized, and he replied that most flights were departing \". . either through a southwest climb or a southeast climb and then back over the top of it. . . \"The flight departed Miami with an Instrument Flight Rules (IFR) clearance at 1335 In accordance with the pilot's request for a\". . . southeast vector \"a left turn was rude after takeoff from runway 27L and circuitous routing was utilized in conjunction with radar vectors from Miami Departure Control, to avoid *** of anticipated turbulence associated with thunderstorm activity (See Attachment A). A similar departure pattern had been previously flown by another flight Subsequently, while maintaining 5,000 feet and a heading of 300 degrees, Flight 705 requested clearance to climb to a higher altitude. Following a discussion between the flight and the Federal Aviation Agency (FAA) radar departure controller about the storm activity, and while clearance to climb was being coordinated with the Miami Air Route Traffic Control Center (ARTCC), the flight advised \"Ah-h we're in the clear now. We can see it out ahead . . . looks pretty bad.\" At 1343, Flight 705 was cleared to climb to flight level 2/ 250 (FL250). They responded, \"OK ahhh, we'll make a left turn about thirty degrees here and climb. . \"The controller asked of 270 degree was their selected climbout heading, and they replied that this would take them\". . . out in the open again\". . Accordingly, clearance was granted. Following some discussion about the severity of the turbulence, which was described as moderate to heavy, the flight advised, \"OK, you better run the rest of them off the other way then.\" At 1345 radar service was terminated and control of Flight 705 was transferred to Miami ARTCC. When the flight did not establish radio communication with ARTCC on the initial frequency, Departure Control provided a secondary frequency, and instructed the flight to turn to a heading of 360 degrees which was acknowledged. When Miami ARTCC requested position and altitude, the flight replied, \"We're just out of seventeen five (17,500 feet) and standby on the DME one.\" This transmission ended at 1348, and was the last known communication with Flight 705 The voice transmissions emanating from the flight were made by the first officer. Witnesses in the area reported that a loud explosion had occurred in the air, and several felt a subsequent ground tremor. They also reported that heavy rain had been failing in the area. One witness, in company with five other persons, was seven miles south of the main wreckage site She heard the sound of an explosion which had no echo. When she looked in that direction she saw an orange ball of flame in the edge of a cloud. As she directed the attention of her companions toward this flame, it dropped straight down, becoming a streak, and disappeared behind trees. Shortly after the disappearance a second sound was heard. Statements were received from the crews of four other flights operating in the Miami area at the approximate time of the accident. The first, in a large jet which approached Miami from the west at 7,000 feet, reported the weather as \". . . in and out of broken clouds and light rain showers with light turbulence. Darker heavy shower activity was observed to the (south) of course. We observed no small cells on our radar scope. . only a broad rain area. . . \"Another crew, in a four-engine aircraft, departed Miami at 1318, via a departure pattern similar to that which Flight 705 later followed. They described the worst turbulence as\". medium to moderate . . . \"from west of the airport to north of the Miami VORTAC .3/ They were maintaining 5,000 feet at the time. A third crew in a 720B was folding southeast of Miami at 13,000 feet. They observed numerous rain cells on radar in the Miami area and encountered light ice at this altitude. The fourth crew, also flying a large jet, taxied out shortly after Flight 705 but delayed takeoff for nearly an hour because of the weather. The weather in the Miami area at the time of the accident was characterized by a pre-frontal squall line approximately 250 miles in length, oriented on a northeast-southwest line immediately northwest of Miami (See Attachment A). The U. S. Weather Bureau (USWB) radar observation at Miami at 1344 indicated a broken area of thunderstorms associated with this line, with cells two to twenty miles in diameter, and tops of detectable moisture at 30,000 feet. The line was moving southeast at eight knots, and moderate rain showers were occurring at the station. The 0600 and 1800 Miami radiosonde ascents showed the freezing level to have been at 11,100 and 12,400 feet m.s.1., respectively. SIGMET 4/ No. 3 prepared by the USWB at Miami, valid from 0900-1300, forecast moderate to severe turbulence 5/ in thunderstorms, with a chance of extreme turbulence in heavier thunderstorms. This advisory was called to the attention of the crew of Flight 705 by the operations agent at Miami, and was attached to their dispatch papers. SIGMET No. 4, valid from 1300-1700, was not received until approximately 1315, after the crew of Flight 705 had left the operations office. It forecast moderate to severe turbulence, but deleted the reference to extreme turbulence indicated in SIGMET No 3. Since the dispatcher for this flight is stationed in Minneapolis, the physical Limitations involved made it difficult to apprise the crew of this latest advisory prior to their taxi time of 1325. The aircraft was completely destroyed by impact forces and all 43 occupants have been killed. ", "probable_cause": "The Board determines that the probable cause of this accident was toe unfavorable interaction of severe vertical air drafts and large longitudinal control displacements resulting in a longitudinal \"upset\" from which a successful recovered was not made."}