{"url": "https://www.baaa-acro.com/crash/crash-vickers-720-viscount-mangalore-3-killed", "date": "Oct 31, 1954 at 1507 LT", "type": "Vickers Viscount", "operator": "Trans%20Australia%20Airlines", "flight_phase": "Takeoff (climb)", "flight_type": "Training", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Mangalore - Mangalore", "msn": "44", "yom": 1954, "flight_number": null, "city": "Mangalore", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 8, "crew_fatalities": 3, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 11000, "captain_hours_type": 21, "copilot_hours": 12000, "copilot_hours_type": 4, "aircraft_hours": 100, "circumstances": "The crew (pilots and engineers) were engaged in a local training flight at Mangalore Airport, Victoria. During the takeoff roll on runway 22, after it reached V1 speed, the instructor shut down the engine number four and feathered its propeller to simulate an engine failure. The pilot-in-command continued the takeoff procedure. Shortly after rotation, the aircraft turned to the right and reached the height of 100 feet when it stalled and crashed in flames in a field located less than one km west of the airfield. Five crew members were injured (three of them seriously) while three pilots were killed. The aircraft was destroyed. The takeoff from which the accident resulted was being attempted in the most critical three-engine configuration, i.e. with number 4 engine (starboard outer) inoperative. In this configuration, with flaps extended 20° and the three engines on full power, a minimum speed of 96 knots is necessary in order to ensure that, using both rudder and aileron, a constant heading can be maintained. When flying under these conditions at speeds below 96 knots it is not possible to keep the aircraft from turning. The takeoff safety speed for the conditions existing at the time of this accident is given in the flight manual for Viscount VH-TVA as 106 knots and it has been the practice of Trans- Australia Airlines to teach its pilots not to lift the aircraft off the ground at speeds below 110 knots in a three-engine takeoff. It has been calculated that with normal acceleration in a three-engine take-off the speed of the aircraft when it left the runway would have been 85 to 90 knots which was too low.  ", "probable_cause": "The cause of the accident was an error of judgment on the part of the pilot-in-command in that he took the aircraft into the air at a speed below the minimum control speed, following loss of directional control during the ground run. Some difficulty in maintaining directional control had been experienced during the take-off run but the final loss probably occurred through nose-wheel steering being relinquished as the pilot-in-command took over the controls. A factor probably contributing to this accident was the limited experience of the pilot-in-command on this type of aircraft. Also, the report included the conclusion that the injuries sustained by the operating crew indicate that they may have survived this accident if they had been wearing the full safety harness provided for their use in the aircraft. "}