{"url": "https://www.baaa-acro.com/crash/crash-cessna-650-citation-iii-trigoria-2-killed", "date": "Feb 7, 2009 at 0602 LT", "type": "Cessna 650 Citation III", "operator": "Air%20One.gif", "flight_phase": "Takeoff (climb)", "flight_type": "Positioning", "survivors": "No", "site": "Plain, Valley", "schedule": "Rome - Bologna", "msn": "650-0105", "yom": 1986, "flight_number": "AOE301", "city": "Trigoria", "zone": "Lazio", "country": "Italy", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 6077, "captain_hours_type": 877, "copilot_hours": 3000, "copilot_hours_type": 58, "aircraft_hours": 6977, "circumstances": "The crew was engaged in a positioning flight from Rome to Bologna to pick up a medical team for an ambulance mission. At 0554LT, the crew was cleared for takeoff. The aircraft departed Rome-Ciampino Airport runway 15 at 0600LT. During initial climb, after being cleared to Bolsena at FL240, the aircraft entered an uncontrolled descent and crashed near a cattle barn. The aircraft disintegrated on impact and both pilots were killed. At the time of the accident, weather conditions were as follow: wind from 140 at 18 knots, light rain, few at 1,800 feet, broken 3,000 feet and scattered at 7,000 feet with an OAT of 13° C. ", "probable_cause": "The cause of the accident was due to an impact with the ground resulting from the loss of control of the aircraft by the captain, who was also the PF. It appears very likely that during the initial phase inadequate attention was replaced by a phase of spatial disorientation, resulting in a loss of situational awareness, which prompted an inadequate intervention on the flight controls by the PF, resulting in total loss of control of the aircraft (having accentuated the tilt to the left wing, instead of leveling the aircraft). It is reasonable to assume that the PF, based on the conviction of being in a right turn for Bolsena in IMC night conditions, misinterpreted the unusual turn, using the controls in order to accentuate the bank angle to the left, drastically reducing the vertical component of lift. This turn has consequently caused the aircraft to assume an attitude of increasing bank, a condition that has been aggravated by the continued application on the controls of a positive load factor in order to stop the sudden loss of altitude, without first leveling the wings. Or the aircraft is stabilized in a pronounced downward spiral to the left. The first officer (PNF), engaged in the management of navigation equipment, has created the unusual turn of the aircraft in conjunction with the commander (PF). Nevertheless, the considerable gradient of experience on the airplane and hierarchy within the organization between the captain and the first officer has probably prevented him to intervene in a more directive or authoritative way in the recovery phase of the situation. Also contributing to the outcome of the event was the lack of detail in the definition of the duties of the crew procedures and inadequate adherence to the basic principles of CRM/MCC, with reference to the monitoring and statement of the navigation modes active, navigation procedures and in particular to the lack of requests for inclusion of turns and routes, the deficiency in the performance of controls and optimization of automation that can lighten the workload in a time unfavorable from the point of view of the circadian rhythm and IMC night. In this respect, it seems fitting to remember the problem of spatial disorientation, although known and studied for decades, is still relevant, and that the only way to counter it is the application of proper use of instruments in compliance with the basic principles of CRM/MCC, which should be part of the normal operating procedures of an operator. This is especially true when working outside of normal circadian rhythms, when it is most easily seen a slowing of cognitive processes."}