{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-bilogai-sugapa-1-killed", "date": "Nov 23, 2011 at 0942 LT", "type": "Cessna 208B Grand Caravan", "operator": "Susi%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Nabire - Bilogai-Sugapa", "msn": "208B-1308", "yom": 2007, "flight_number": null, "city": "Bilogai-Sugapa", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1859, "captain_hours_type": 1550, "copilot_hours": 690, "copilot_hours_type": 231, "aircraft_hours": 4331, "circumstances": "The flight route was Nabire to Bilogai as an unscheduled cargo flight. There were two pilots on board and the freight load was a mixture of food, palm oil, and cement. The aircraft departed from Nabire at 2355 UTC (0855 LT), the estimate time of arrival of Bilogai was 0045 UTC. At 0042 UTC the aircraft was reported above touchdown zone and the altitude recorded of 6,960 feet, direction 277 degrees and air speed 94 knots. The aircraft executed a go around due to an unauthorized person entering the shoulder of the runway 27, the aircraft then continued to climb and headed left. It was reported while the aircraft initially was climbing with the nose up but following lost altitude. During go around manoeuvre the aircraft attitude was in high nose up position, caused the angle of attack was too high and beyond a stall margins caused the aircraft stall. The aircraft bank to the right and crashed on a corn farm at coordinate S 03 44.58 E 137 0.96 and altitude about 6,550 feet with heading about 260 degrees. The aircraft was destroyed on impact with the ground. The captain seriously injured and still on seat in the aircraft wearing the shoulder harness. The second in command was fatally injured outside of the aircraft at the crashed site. \n", "probable_cause": "FINDINGS :\r\n• The aircraft was airworthy prior the accident and there was no evidence of system malfunction during the flight. \r\n• The crew had valid license and medical certificate. \r\n• There were no fences at the airport perimeter. \r\n• There was a local plantation area nearby the runway. \r\n• Unauthorized person entering the shoulder of the runway 27. \r\n• There was no warning signal to alert if unauthorized persons entering the runway, especially during any aircraft Takeoff and Landing. \r\n• The valley (gap) on the south side of the runway was too narrow for successful go around manoeuvre by a caravan aircraft. \r\n• The aircraft most probably stalled due to very high angle of attack, when the aircraft was manoeuvre to avoid the surrounding terrain and bank to the right. \r\n• The communication of incoming and outgoing Susi Air aircraft from and to Bilogai was only to Susi Air ground handling Agent at Sugapa. \r\nCAUSES :\r\nThe aircraft was executed a Go Around due to a unauthorized person entering the shoulder of the runway 27, after go around, crew tried to avoid terrain impact, increasing the aircraft attitude more pitching up caused the angle of attack was higher and beyond a stall margins , finally stall just before impact. "}