{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-414-hudson-i-bairnsdale-4-killed", "date": "Oct 27, 1942 at 1500 LT", "type": "Lockheed L-414 Hudson", "operator": "Royal-Australian-Air-Force-3", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bairnsdale - Bairnsdale", "msn": "414-1889", "yom": 1940, "flight_number": null, "city": "Bairnsdale", "zone": "Victoria", "country": "Australia", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 915, "circumstances": "The crew was performing a test flight at Bairnsdale Aerodrome following the 80 flying hours service. When pulling out of high speed shallow dive at 80 feet and some 200 yards down from the camera (the flight was filmed), the starboard wing failed at wing station # 144, causing part of the outer wing (3 feet from engine) and spar to separate from the aircraft. The aircraft then rolled inverted, causing a further failure of the tail plane, with the aircraft then crashing into the ground and exploding.\r\nCrew (1st OTU):\r\nS/L P. C. Tampion,\r\nCpl H. P. Smith,\r\nLAC A. P. Thomas,\r\nLAC N. L. Cheshire.\r\nSource: http://www.adf-gallery.com.au/\r\nPhotos: Gordon Birkett", "probable_cause": "The starboard wing panel was sent to the CSIR for metallurgy inspection. The finding was that the mainplanes had been repaired per then accepted practices, but had failed in flight where numerous patched repairs were made during its overhaul at 5AD. The report stated that many Hudsons withdrawn from operational service and used in 1 OTU had been flown to the limits with resultant heavy loadings on their wings on operational service. All similar houred Hudsons were inspected some found to have similar problems, which would result in their replacement by GAF Beauforts in the near future in operational squadrons."}