{"url": "https://www.baaa-acro.com/crash/crash-cessna-208b-grand-caravan-near-mayo-2-killed", "date": "Aug 6, 2019 at 1113 LT", "type": "Cessna 208B Grand Caravan", "operator": "Alkan-Air-Canada", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Mountains", "schedule": "Rackla - Mayo", "msn": "208B-0673", "yom": 1998, "flight_number": null, "city": "Mayo", "zone": "Yukon", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 1694, "captain_hours_type": 212, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 19060, "circumstances": "At 1101 Pacific Daylight Time on 06 August 2019, the Alkan Air Ltd. Cessna 208B Grand Caravan aircraft (registration C‐FSKF, serial number 208B0673) departed Rau Strip, Yukon, on a visual flight rules company flight itinerary to Mayo Airport, Yukon. The aircraft had 1 pilot, 1 passenger, and cargo on board. At 1113, the aircraft entered instrument meteorological conditions and struck rising terrain in a box canyon shortly after. The crash occurred approximately 25 nautical miles east‐northeast of Mayo Airport, at an elevation of 5500 feet above sea level. The Canadian Mission Control Centre did not receive a signal from the aircraft’s 406 MHz emergency locator transmitter. Eyewitnesses from a nearby exploration camp arrived at the site after approximately 1 hour. Royal Canadian Mounted Police and emergency medical services arrived on site approximately 90 minutes after the accident. The pilot and passenger received fatal injuries. The aircraft was destroyed; there was a brief post‐impact fire.", "probable_cause": "Findings as to causes and contributing factors:\r\nThese are conditions, acts or safety deficiencies that were found to have caused or contributed to this occurrence.\r\n1. The pilot’s decision making was influenced by several biases and, as a result, the flight departed and subsequently continued into poor weather conditions in mountainous terrain.\r\n2. The high speed at low altitude and low forward visibility reduced the opportunities for the pilot to take alternative action to avoid terrain.\r\n3. Within the box canyon, the canyon floor elevation increased abruptly within less than 1 NM and the low visibility prevented the pilot from detecting this and taking sufficient actions to prevent collision with terrain.\r\n4. When the pilot turned into the box canyon, the terrain awareness and warning system aural alerts were ineffective in warning the pilot about the rising terrain either because he had already heard multiple similar alerts in the preceding minutes, or because he had silenced the alerts.\n\r\nFindings as to risk:\r\nThese are conditions, unsafe acts, or safety deficiencies that were found not to be a factor in this occurrence but could have adverse consequences in future occurrences.\r\n1. If administrative safety defences are not used as intended, it increases the risk that the hazards associated with the flight will not be identified and mitigated.\n\r\nOther findings:\r\nThese items could enhance safety, resolve an issue of controversy, or provide a data point for future safety studies.\r\n1. The pilot held a valid instrument rating and the aircraft was equipped to fly in instrument meteorological conditions. However, there were no scenarios in the pilot’s flying history on the Cessna 208B Grand Caravan or in his training where a transition from visual flight rules to a flight under instrument flight rules in an emergency was performed."}