{"url": "https://www.baaa-acro.com/crash/crash-cessna-550-citation-bravo-vienna", "date": "Sep 3, 2015 at 1227 LT", "type": "Cessna 550 Citation Bravo", "operator": "Jet24", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Salzburg - Vienna", "msn": "550-0977", "yom": 2001, "flight_number": null, "city": "Vienna-Schwechat", "zone": "Vienna", "country": "Austria", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 5000, "captain_hours_type": 1800, "copilot_hours": 1200, "copilot_hours_type": 350, "aircraft_hours": 7525, "circumstances": "Following an uneventful flight from Salzburg, the crew was cleared to descent to Vienna-Schwechat Airport. On approach to runway 34, the crew completed the checklist and lowered the landing gear when he realized the the left main gear remained stuck in its wheel well and that the green light failed to come on on the cockpit panel. The crew agreed to continue. After touchdown on runway 34, the aircraft deviated to the left, veered off runway and came to rest in a grassy area located near taxiway D and taxiway B5 and B6. All five occupants evacuated safely and the aircraft was damaged beyond repair. ", "probable_cause": "The accident was caused by a metallic foreign body between valve seat and ball of the spring loaded ball check valve in the undercarriage servo valve of the left main landing gear caused the check valve not to close as intended and hydraulic fluid was directed directly to the landing gear cylinder without moving the piston rod. Due to the fact that the piston rod of the undercarriage servo valve did not move as intended, the mechanical unlocking hook of the left undercarriage was also not controlled - the landing gear was therefore not deployed.\r\nContributing factors:\r\n- The possibility to abort the approach, to Go Around and fly a holding to carry out troubleshooting, as described in the operations manual of the aviation company as well as in the \"Emergency / Abnormal Procedures\" manual of the aircraft manufacturer, was not used.\r\n- The emergency extension system of the landing gear was not used."}