{"url": "https://www.baaa-acro.com/crash/crash-cessna-525-citationjet-m2-fazenda-fortaleza-de-santa-terezinha-4-killed", "date": "Nov 26, 2018 at 0830 LT", "type": "Cessna 525 Citation M2", "operator": "ARG", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Belo Horizonte - Fazenda Fortaleza de Santa Terezinha", "msn": "525-0849", "yom": 2014, "flight_number": null, "city": "Fazenda Fortaleza de Santa Terezinha (Várzea da Palma)", "zone": "Minas Gerais", "country": "Brazil", "region": "South America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 3, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 11000, "captain_hours_type": 522, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The twin engine airplane was completing a flight from Belo Horizonte-Pampulha-Carlos Drummond de Andrade to the Fortaleza de Santa Terezinha Farm (Fazenda Fortaleza de Santa Terezinha) located in Várzea da Palma, Jequitaí, Minas Gerais. On board were three passengers and one pilot. On final approach to runway 20, during the last segment, the airplane collided with a metallic water irrigation system. The pilot initiated a go around procedure when he lost control of the airplane that veered to the left, impacted the ground and crashed in a field located to the left of the runway, about 600 metres from the initial impact, bursting into flames. The aircraft was totally destroyed by impact forces and a post crash fire and all four occupants were killed, among them Mr. Adolfo Geo, owner of the Brazilian group ARG Ltd active in food, oil and construction. He was accompanied by his wife Margarida Janete Geo.", "probable_cause": "The following factors were identified:\r\n- Airport infrastructure – a contributor.\r\nIt was found that the irrigation pivot, at the point where the collision took place, was impairing the gauge of the approach surface as described in Ordinance 957/GC3, of 09JUL2015, which provided for restrictions on objects projected into the airspace that could adversely affect the safety or regularity of air operations.\r\n- Piloting judgment – a contributor.\r\nThe final approach was carried out below the ideal approach ramp, allowing the collision against the pivot, located in the alignment of the runway.\r\n- Perception – undetermined.\r\nIt is possible that the PIC, when approaching for the landing, did not notice the irrigation pivot and, therefore, collided with the obstacle.\r\n- Flight planning – a contributor.\r\nThere was no prior coordination with the farm employees, in a timely manner so that the irrigation pivot could be repositioned to a safe location in relation to the flight trajectory on the final landing approach."}