{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-31-310-navajo-bogota-4-killed", "date": "Feb 12, 2020 at 1544 LT", "type": "Piper PA-31-310 Navajo", "operator": "Aero%20Taxi%20Guaymaral", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Bogotá – Villagarzón", "msn": "31-344", "yom": 1968, "flight_number": null, "city": "Bogotá-Guaymaral", "zone": "Bogotá Capital District", "country": "Colombia", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 1890, "captain_hours_type": 250, "copilot_hours": 646, "copilot_hours_type": null, "aircraft_hours": 10251, "circumstances": "Shortly after takeoff from Bogotá-Guaymaral Airport, while in initial climb, the crew informed ATC about the failure of the right engine. He was cleared to return for an emergency and completed a circuit to land on ruwnay 11. On final, the airplane lost height and crashed in a wooded area located about 800 metres short of runway, bursting into flames. The aircraft was destroyed by a post crash fire and all four occupants were killed. ", "probable_cause": "The investigation determined that the accident was caused by the following probable cause(s):\r\n- Loss of in-flight control as a result of slowing below Minimum Control Speed and drag, generated by the failure of the right engine (No. 2).\r\n- Failure of engine No. 2, due to lack of lubrication, possibly caused by oil leakage through an 11.5 mm fracture, found in one of the sides of cylinder No. 2 at the height of the intake valves.\r\n- Inappropriate application by the crew of the emergency procedure for landing with an inoperative engine, by not declaring the emergency, not feathering the propeller of the inoperative engine and configuring the aircraft early for landing (with landing gear and flaps) without having a safe runway, making it difficult to control the aircraft and placing it in a condition of loss of lift and control.\n\r\nContributing Factors:\r\n- Failure of the operator to emphasize in the crew training program the techniques and procedures to be followed in the event of engine failure, among others, the declaration of emergency to ATC, the flagging of the propeller of the inoperative engine, the care in the application of power to the good engine so as not to increase yaw and not to configure the aircraft until landing has been assured.\r\n- Lack of emergency calls by the crew, which denotes deficiencies in the Operator's Safety Management System, and which prevented the early warning of the aerodrome support services and deprived the crew of possible assistance from other aircraft or from the same operator."}