{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-e18s-lone-rock-1-killed", "date": "May 4, 1993 at 0140 LT", "type": "Beechcraft E18", "operator": "Viking Express", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Aurora - Minneapolis", "msn": "BA-257", "yom": 1957, "flight_number": null, "city": "Lone Rock", "zone": "Wisconsin", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 4492, "captain_hours_type": 310, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15027, "circumstances": "The pilot of a twin-engine cargo airplane shut down the left engine and feathered the propeller due to a loss of engine oil. The FAA ARTCC handling the flight vectored the airplane toward a VOR. Due to the airplane's altitude and distance from the center's radar, the pilot of the airplane had to perform a full instrument approach procedure. The airplane maintained its enroute assigned altitude until passing the VOR outbound. Ntap readouts show the airplane descending throughout the procedure turn and inbound leg of the approach. The airplane's last radar contact was 300 feet below the inbound altitude for the approach while outside the final approach fix. The airplane collided with trees and terrain approximately 2 1/4 miles from the airport. The VOR is 5.5 miles from the airport. The on-scene investigation revealed the left engine's propeller had been feathered, its number nine cylinder mounting studs on the engine's case were crushed downward or were broken off at the case's surface, and the landing gear had been extended. The pilot, sole on board, was killed. ", "probable_cause": "The National Transportation Safety Board determines the probable cause(s) of this accident to be: was a pre-mature extension of the landing gear by the pilot which resulted in the inability of\r\nthe pilot to maintain the minimum descent altitude. Factors related to the accident were the loose cylinder and loss of oil. "}