{"url": "https://www.baaa-acro.com/crash/crash-cessna-402b-fort-lauderdale-0", "date": "Apr 20, 1999 at 1910 LT", "type": "Cessna 402", "operator": "Execstar Aviation", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Myers – Fort Lauderdale", "msn": "402B-0592", "yom": 1974, "flight_number": null, "city": "Fort Lauderdale-Executive", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2600, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2675, "circumstances": "While on approach to land the left engine surged and lost power. The pilot switched the left engine fuel selector to another fuel tank and the engine restarted. A short time later the left engine surged and lost power again. The pilot switched the left engine fuel selector to the right main fuel tank and the engine again restarted. A short time later the left engine quit again and he shutdown the engine and feathered the propeller. A short time later the right engine surged and lost power. He shut down the right engine and feathered the propeller. He then made a forced landing in a field and during landing rollout the aircraft's left wing collided with a tree. A fire erupted in the left wing area. Post crash examination showed the right main fuel tank was empty. The right auxiliary fuel tank contained 2.5 gallons. The left main fuel tank contained one half gallon of fuel and the left auxiliary tank was ruptured. The pilot operating handbook stated that the main fuel tanks had one gallon unusable fuel and the auxiliary fuel tanks had one half gallon of unusable fuel. ", "probable_cause": "A loss of engine power due to fuel exhaustion and the pilot in command's failure to ensure that the aircraft had adequate fuel to complete the flight. "}