{"url": "https://www.baaa-acro.com/crash/crash-swearingen-sa226tc-metro-ii-grand-junction", "date": "Nov 18, 2003 at 0721 LT", "type": "Swearingen SA226 Metro II", "operator": "Key%20Lime%20Air-2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Rifle – Grand Junction", "msn": "TC-222E", "yom": 1976, "flight_number": null, "city": "Grand Junction", "zone": "Colorado", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2419, "captain_hours_type": 140, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 23972, "circumstances": "According to the pilot, he was told to enter left base and was cleared to land. The pilot stated that, when he reduced the airspeed to lower the landing gear, he \"heard the gear come down,\" and he verified \"three green in the [landing] gear indicator.\" He landed the airplane on its \"main [landing gear] wheels first\" and slowly let the nose of the airplane drop. Although both main landing gear assemblies remained down and locked, the nose landing gear collapsed, allowing the nose of the airplane and both propellers to strike the runway. The airplane slid approximately 3,000 feet, coming to a stop on the right edge of the runway. Several fractured propeller pieces impacted the left and right sides of the fuselage substantially damaging two fuselage station bulkheads. The fuselage bulkhead, forward of the nose landing gear well, was also substantially damaged due to contact with the runway. The pilot said that, during the approach, from base to final, he did not hear a landing gear warning horn. An air traffic control specialist, stated that he told the pilot to enter a left base and that he was cleared to land. The specialist stated that he observed the airplane roll out on a 2-mile final \"with the gear down.\" As the airplane was rolling down the runway the \"nose wheel collapsed.\" An FAA inspector examined the airplane and noted that, according to the Fairchild SA226 Maintenance Manual, the nose landing gear's up-lock mechanism was not properly lubricated, a \"critical clearance\" measurement between the nose landing gear's bell crank roller and positioning cam was found to be out of tolerance, and when the throttles were retarded, the landing gear warning horn activated, but it was \"barely audible.\" According to the Fairchild SA226 Maintenance Manual, the landing gear should be lubed every 200 hours. The FAA inspector stated that the approved maintenance inspection sheet for the operator, did not show the requirement for the main landing gear or nose landing gear to be lubed every 200 hours.", "probable_cause": "The operator's improper maintenance and servicing of the airplane's nose landing gear assembly, resulting in the collapse of the nose landing gear during the landing roll. Contributing factors include the nose section of the airplane's subsequent contact with the runway, the impact of several fractured propeller pieces into the fuselage, and the operator's inadequate maintenance and servicing procedures."}