{"url": "https://www.baaa-acro.com/crash/crash-cessna-560-citation-v-zurich-2-killed", "date": "Dec 20, 2001 at 2206 LT", "type": "Cessna 560 Citation V", "operator": "Eagle%20Air%20Swiss", "flight_phase": "Takeoff (climb)", "flight_type": "Ferry", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Zurich - Bern", "msn": "560-0077", "yom": 1990, "flight_number": "EAB220", "city": "Zurich-Kloten", "zone": "Zurich", "country": "Switzerland", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4761, "captain_hours_type": 250, "copilot_hours": 1110, "copilot_hours_type": 401, "aircraft_hours": 3559, "circumstances": "At 19:43:49 UTC the crew of EAB 220 called clearance delivery (CLD) for the first time and asked if their flight plan to Bern-Belp was available. The answer was in the affirmative and the CLD air traffic controller informed the crew that they would need authorisation for the landing in Bern-Belp. Once it had been clarified that this authorisation had been obtained, EAB 220 called back a little later. CLD informed the pilots that their departure was planned from runway 34. However, they would have to expect a delay at that time, as arrivals and departures were being handled in batches. EAB 220 was scheduled in the next batch for take-off. CLD intimated to the crew an approximate departure time of 20:30 UTC. When the crew called back at 20:13:49 UTC to ask for any news, CLD informed them that departure would now take place in about 45 minutes. Since visual conditions were deteriorating due to the thickening fog, air traffic control had to increase the separation between arriving aircraft. As a result, flight EAB 220’s estimated departure time was delayed to about 21:00 UTC. At 20:24:38 UTC CLD transmitted to the crew a departure clearance.  Flight EAB 220 was assigned the standard instrument departure (SID) “WILLISAU 3N” and transponder code 1403. In addition, a departure time of 21:07 UTC was estimated. The CEO of Eagle Air Ltd. had applied in Bern-Belp for a special authorisation for a late landing after 21:00 UTC and obtained a slot until 21:30 UTC at the latest. Since the departure of HB-VLV in Zurich was being further and further delayed, the crew found themselves under increasing time pressure. The crew were in contact with the CEO several times; at the time, the latter was performing the function of the dispatcher. In order to ensure the arrival of HB-VLV in Bern-Belp by 21:30 UTC at the latest, he also telephoned the duty manager in Zurich control tower and urged him several times for an earlier departure time. After a frequency change to apron control, the apron controller cleared EAB 220 to start its engines at 20:43:50 UTC. Approximately at the same time, an airport manager observed that HB-VLV’s right-hand engine was running, although only one pilot was present in the cockpit. He was sitting in the right-hand seat. The other crew member, probably the commander, was using a scraper to remove ice deposits from the left wing. The eye witness later observed how this crew member occupied the left-hand position in the cockpit, shortly before taxiing. Since the pilots were eager to leave their stand in the General Aviation Centre (GAC) Sector 1 as quickly as possible, they were cleared to taxi as far as the holding point for runway 28 just 2 minutes later. There they had to wait for a taxiing Saab 2000 to pass in the opposite direction. EAB 220 was then instructed by the apron controller to continue taxiing to the holding point for runway 34 via taxiways ALPHA, INNER and ECHO. One minute after taxi clearance had been given, the crew of EAB 220 again asked for the wording of this clearance: “Swiss Eagle 220, sorry for that, can you say the clearance again?” It must remain open whether HB-VLV had missed the intersection in the direction of the INNER taxiway. It is clear, however, that the apron controller had to intervene shortly afterwards with a correction: “220, continue on taxiway INNER, INNER, and then ECHO to Holding Point 34, Echo 9”. At 20:56:50 UTC flight EAB 220 made contact with Aerodrome Control (ADC) and stated that the aircraft was on Echo 9 just before the start of runway 34. The air traffic controller (ATCO) requested the crew to wait short of runway 34, since approaches were still taking place in the opposite direction on runway 16. At 21:04:51 UTC ADC cleared the aircraft to line up on runway 34. The crew  taxied onto runway 34 and – after they had received take-off clearance at 21:05:54 UTC – initiated a rolling take-off by setting take-off power. At this time, meteorological visibility was 100 m with partial fog. Since the left-hand engine was run up within six seconds to 102 percent of take-off power and the right-hand engine to 58 percent, for a few seconds during the acceleration phase the aircraft veered on the runway to such an extent that it’s heading changed 10 degrees to the right. The crew were only able to bring the aircraft back into alignment with the runway by making a major nose-wheel control correction and by distinctly reducing the thrust of the left-hand engine. Afterwards the two engines were brought synchronously to take-off power and the take-off continued. Flight EAB 220 lifted off from runway 34 at 21:06:40 UTC. Shortly after take-off, the commander of EAB 220 acknowledged the request to change frequency to departure control. At about the same time various members of the airport fire-fighting services, who were inside and in front of the fire-fighting unit satellite “North” between runways 34 and 32, heard noises and saw visual indications of a low-flying aircraft. Immediately afterwards the noise of a crash and the flash of a fire were noted. At 21:07 UTC the aircraft impacted onto the frozen ground 400 m to the south-east of the end of runway 34 and skidded in a northerly direction, leaving a trail of debris. The main body of the wreck finally came to rest 500 m beyond the site of initial impact on runway 14/32. The rescue services reached the burning wreck after a few minutes. DFDR data revealed that the autopilot was disengaged during the whole flight. ", "probable_cause": "The accident is attributable to the fact that the crew of HB-VLV did not continue their climb after take-off. As a result the aircraft came in a descent and collided with the terrain.\r\nThe investigation determined the following causal factor for the accident:\r\n• With a high degree of probability the crew lost spatial orientation after take-off, leading to an unintentional loss of altitude.\r\nThe following factors contributed to the accident:\r\n• The copilot’s basic training in instrument flying did not include night instrument take-offs.\r\n• The crew’s method of working was adversely affected by great time pressure.\r\n• Executing the take-off as a rolling take-off was not adapted to the prevailing meteorological conditions.\r\n• There was no system in the aircraft which triggers an alarm in the event of a loss of altitude after take-off (GPWS).\r\n• The instrumentation on the copilot’s side of the aircraft involved in the accident was not optimal. "}