{"url": "https://www.baaa-acro.com/crash/crash-grumman-g-21a-goose-near-port-hardy-5-killed", "date": "Aug 3, 2008 at 0722 LT", "type": "Grumman G-21A Goose", "operator": "Pacific%20Coastal%20Airlines", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Mountains", "schedule": "Port Hardy - Chamiss Bay", "msn": "B76", "yom": 1944, "flight_number": null, "city": "Port Hardy", "zone": "British Columbia", "country": "Canada", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 4, "other_fatalities": 0, "total_fatalities": 5, "captain_hours": 3998, "captain_hours_type": 500, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": " At 0708 Pacific daylight time, the Pacific Coastal Airlines G-21A amphibian (registration C-GPCD, serial number B76) operating as a charter flight departed Port Hardy Airport, British Columbia, on a visual flight rules flight to Chamiss Bay, British Columbia. At 0849 and again at 0908, the flight follower attempted to contact the tugboat meeting the aircraft at Chamiss Bay by radiotelephone but was unsuccessful. At 0953, the flight follower reported the aircraft overdue to the Joint Rescue Coordination Centre in Victoria, British Columbia, and an aerial search was initiated. A search and rescue aircraft located the wreckage on a hillside near Alice Lake, approximately 14 nautical miles from its departure point. A post-crash fire had ignited. The emergency locator transmitter had been destroyed in the crash and did not transmit. The accident happened at about 0722. Of the seven occupants, the pilot and four passengers were fatally injured, one passenger suffered serious injuries, while another suffered minor injuries. The two survivors were evacuated from the accident site at approximately 1610. ", "probable_cause": "Findings as to Causes and Contributing Factors:\r\n1. While likely climbing to fly above a cloud-covered ridge and below the overcast ceiling, the aircraft stalled aerodynamically at a height from which full recovery could not be made before striking the trees.\r\n2. The aircraft broke apart upon impact, and electrical arcing from exposed wires in the presence of spilled fuel caused a fire that consumed most of the aircraft.\r\nFindings as to Risk:\r\n1. While the company’s established communications procedures and infrastructure met the regulatory requirements, they were not effective in ascertaining an aircraft’s position and flight progress, which delayed critical search and rescue (SAR) action.\r\n2. The emergency locator transmitter was destroyed in the crash and failed to operate, making it difficult for SAR to find the aircraft. This prolonged the time the injured survivors had to wait for rescue and medical attention. "}