{"url": "https://www.baaa-acro.com/crash/crash-convair-cv-240-2-kingston", "date": "Sep 2, 1951 at 1010 LT", "type": "Convair CV-240", "operator": "Pan%20Am.gif", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Lake, Sea, Ocean, River", "schedule": "Miami – Camagüey – Kingston – Maracaibo", "msn": "49", "yom": 1948, "flight_number": "PA507", "city": "Kingston", "zone": "Kingston City District", "country": "Jamaica", "region": "Central America", "crew_on_board": 4, "crew_fatalities": 0, "pax_on_board": 30, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9666, "captain_hours_type": 2618, "copilot_hours": 2591, "copilot_hours_type": 1199, "aircraft_hours": 4146, "circumstances": "Flight 507 departed Miami, Florida, at 0700, September 2, 1951, and made a routine scheduled stop at Camagüey, Cuba. No irregularities were reported by the flight crew upon arrival at Camagüey, and the flight departed there on schedule at 0900, cleared under visual flight rules direct to Kingston, Jamaica, with Montego Bay, Jamaica, as an alternate. The gross weight of the aircraft and distribution of the disposable load were within allowable limits upon departure from Camagüey. The flight was uneventful between Camagüey and Kingston, and routine radio contacts were made en route At 1003 Flight 507 reported its position to Palisadoes Airport Tower, Kingston, as 20 miles north and a little later was cleared into the traffic pattern for Runway 14. The flight acknowledged this clearance and shortly thereafter reported that the field was in sight Palisadoes Tower then advised Flight 507 of the presence of a local squall between Kingston and the approach end of Runway 14, with heavy rain at the airport, and suggested a low approach. When the aircraft first came into view of the air traffic controller, it was just emerging from the heavy part of the squall, which was then over the approach end of Run-way 14 and moving northwesterly. At this time the flight requested and received permission to circle the airport to the right Witnesses located near the approach end of Runway 14 observed the aircraft flying in a southeasterly direction, paralleling the runway. At approximately the runway intersection, 2 the aircraft turned right and continued around the airport to a point northwest of the approach end of Runway 14 and over Kingston Harbor, here it was observed to descend into the water about 800 feet short of the runway. No one was seriously injured. A motor launch from a nearby salvage vessel arrived alongside the wrecked aircraft in a matter of minutes and took the survivors ashore. The wreckage floated for a short time, then sank, leaving only a part of the tail group and one wing visible above the surface of the water.", "probable_cause": "The Board determines that the probable cause of this accident was the serious error in judgment and piloting technique on the part of the co-pilot and the failure of the captain to recognize the error and take over the controls in sufficient time to take corrective action. It was also determined that the rain squall in the Kingston area was local in nature and the visibility and ceiling at the airport were well above minimums. Also there was no malfunctioning of the aircraft or any of its components prior to impact."}