{"url": "https://www.baaa-acro.com/crash/crash-vickers-720-viscount-near-port-hedland-26-killed", "date": "Dec 31, 1968 at 1135 LT", "type": "Vickers Viscount", "operator": "MMA-2", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Plain, Valley", "schedule": "Perth – Port Hedland", "msn": "45", "yom": 1954, "flight_number": "MV1750", "city": "Port Hedland", "zone": "Western Australia", "country": "Australia", "region": "Oceania", "crew_on_board": 4, "crew_fatalities": 4, "pax_on_board": 22, "pax_fatalities": 22, "other_fatalities": 0, "total_fatalities": 26, "captain_hours": 19129, "captain_hours_type": 367, "copilot_hours": 2660, "copilot_hours_type": 143, "aircraft_hours": null, "circumstances": "Flight 1750 was a scheduled domestic flight from Perth to Port Hedland in the State of Western Australia. Whilst taxiing for take-off on runway 02 at Perth Airport, the crew received and acknowledged an air traffic clearance communicated by Perth Tower. Of the alternative clearances offered, the pilot-in-command elected to proceed via the 030° radial of the Perth Very High Frequency Omni-Range (VOR), to Ballidu, whilst climbing to FL 170. Take-off was normal and the crew reported the departure time as 0836 hours Western Standard Time. At 0839 hours the pilot-in-command reported that he was climbing at an indicated airspeed of 155 kt, instead of the 175 kt proposed in the flight plan, because of turbulence which he first encountered at 1 500 ft. During this climb the co-pilot also advised Perth that the aircraft would continue its climb beyond the proposed FL 170 and cruise at FL 190. Apart from these minor changes to the flight plan the aircraft continued normally along the intended route with position reports being transmitted as scheduled to Perth Flight Service Centre, Meekatharra Flight Service Unit and Port Hedland Flight Service Centre. At 1114 hours the aircraft advised Port Hedland that it was abeam Wittenoom Gorge at FL 190 and that its estimated time of arrival at Port Hedland was 1142 hours. At 1120 hours the flight advised that it would be commencing its descent from FL 190 in three minutes and at 11-34 hours it reported that it was 30 miles by Distance Measuring Equipment south of Port Hedland-and had left 7 000 ft on descent. The flight service officer at Port Hedland acknowledged this message and transmitted the surface wind and temperature conditions and the altimeter setting for landing at Port Hedland. When this communication was not acknowledged further calls were made but no further communication from the aircraft was heard or recorded. At about the time that the aircraft failed to respond to the radio communication, two persons, each in different positions, saw the aircraft descending rapidly and steeply although these observations were made from distances of 44 and 64 miles respectively. Neither of these eyewitnesses was able to observe any impact with the ground because of intervening high terrain. At 1212 hours a Cessna 337 aircraft left Port Hedland to search along the route which the aircraft had been expected to follow and, eleven minutes later, the pilot of the search aircraft saw the burning wreckage of the Viscount aircraft, close to the intended route. Approximately one hour later a ground party from Port Hedland reached the scene of the accident. The location of the wreckage was later determined to be 28.1 miles on a bearing of 184' true from Port Hedland Airport. The aircraft was totally destroyed and none of the 26 occupants survived the crash. ", "probable_cause": "The cause of the accident was that the fatigue endurance of the starboard inner main spar lower boom was substantially reduced by the insertion of a flared bush at station 143 when the margin of safety associated with the retirement life specified for such booms did not ensure that this boom would achieve its retirement life in the presence of such a defect."}