{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-690a-yakima-2-killed", "date": "Dec 12, 1997 at 2230 LT", "type": "Rockwell Grand Commander 690", "operator": "Yakima%20Theatres", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Seattle - Yakima", "msn": "690-11242", "yom": 1975, "flight_number": null, "city": "Yakima", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 1, "pax_fatalities": 1, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 4800, "captain_hours_type": 80, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7001, "circumstances": "The flight was operating into the Yakima airport at night during the period the airport operates as non-towered. Some witnesses reported the aircraft initially appeared lower than normal and that it descended and impacted the ground at a steep angle, and some witnesses reported an abrupt entry into the descent. The aircraft crashed 2.2 nautical miles east of the runway threshold, slightly right of the localizer course The pilot was 'cleared for approach' by air traffic control (ATC) and he subsequently initiated an instrument landing system (ILS) approach to runway 27. The last radar position showed the aircraft approximately on the localizer, at glide slope intercept altitude, 9 nautical miles east of the airport. Three minutes after the last radar position, the pilot reported to ATC he had broken out and had the airport in sight, and canceled instrument flight rules (IFR). ATC then terminated service and approved a frequency change.. Ceiling was 1,500 feet overcast with 6 miles visibility in mist, with no significant icing forecast. No evidence of mechanical problems was found; however, much of the aircraft was consumed by an intense post-crash fire. ", "probable_cause": "A loss of aircraft control for undetermined reasons."}