{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-350p-malibu-rochester-3-killed", "date": "Dec 22, 1994 at 1152 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "Ryders Replica Fighter Museum", "flight_phase": "Takeoff (climb)", "flight_type": "Private", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Rochester - Guntersville", "msn": "46-22133", "yom": 1993, "flight_number": null, "city": "Rochester", "zone": "Minnesota", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 2500, "captain_hours_type": 96, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 106, "circumstances": "The airplane departed on runway 31 in instrument meteorological conditions (IMC) and turned right to a heading of 090°. Radar contact (arts tag) was acquired about 1 to 2 miles north of the airport. Reportedly, the arts tag would typically be acquired as the airplane climbed through an altitude of about 700 feet agl. Subsequently, the airplane crashed about 2 miles north of the airport. A witness reported hearing a loud engine noise before the plane crashed. The wreckage path was oriented along a westerly heading and over an area of about 380 feet. There was evidence of an in-flight breakup. An outboard portion of the right wing was found about 150 feet from the main impact crater. An examination revealed the right wing had failed near the production seam. The right spar exhibited features 'typical of an upward bending overstress separation.' Examination revealed no other evidence of preimpact aircraft or engine malfunction. The airplane's gross weight was estimated to be about 4,696 pounds; its max limit was 4,300 pounds. The pilot's logbook indicated that he had flown only 2 instrument approaches in the previous 14 months. All three occupants were killed. ", "probable_cause": "Failure of the pilot to maintain control of the airplane, while climbing in instrument meteorological conditions (IMC) after takeoff. Factors related to the accident were: fog, low ceiling, the pilot's lack of recent instrument experience, and the excessive gross weight of the airplane."}