{"url": "https://www.baaa-acro.com/crash/crash-bae-146-300-wamena-6-killed", "date": "Apr 9, 2009 at 0743 LT", "type": "BAe 146", "operator": "Aviastar%20Mandiri2", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Jayapura - Wamena", "msn": "E3189", "yom": 1990, "flight_number": null, "city": "Wamena", "zone": "Special Region of Papua", "country": "Indonesia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": 8305, "captain_hours_type": 958, "copilot_hours": 12389, "copilot_hours_type": 191, "aircraft_hours": 22225, "circumstances": "On the morning of 9 April 2009, a British Aerospace BAe 146-300 aircraft, registered PK-BRD, was being operated by PT. Aviastar Mandiri Airlines as a scheduled passenger and cargo flight from Sentani Airport to Wamena Airport, Papua. The crew consisted of two pilots, two flight attendants, an engineer, and a load master. The aircraft performed a go-around from the initial landing approach on runway 15 at Wamena. The flight crew positioned the aircraft on a right downwind leg for another landing approach. As the aircraft was turned towards the final approach for the second landing approach at Wamena it impacted terrain and was destroyed. All of the occupants were fatally injured. The Enhanced Ground Proximity Warning System (EGPWS) manufacturer performed simulations using data from the flight recorders, and two separate terrain data sources. The manufacturer informed the investigation that “the GPWS/EGPWS alerts recorded in the CVR were issued as designed”. However the enhanced Look-Ahead function appeared to have been inhibited following the go around. There was no evidence from the CVR that the crew had deliberately inhibited the terrain function of the EGPWS. The investigation determined that the EGPWS issued appropriate warnings to the flight crew, in the GPWS mode. The pilot in command did not take appropriate remedial action in response to repeated EGPWS warnings. The investigation concluded that flight crew’s lack of awareness of the aircraft’s proximity with terrain, together with non conformance to the operator’s published operating procedures, resulted in the aircraft’s impact with terrain. As a consequence of this accident, the operator took safety action to address deficiencies in its documentation for missed approach procedures at Wamena. As a result of this accident, the National Transportation Safety Committee (NTSC) also issued safety recommendations to the operator and to the Directorate General Civil Aviation (DGCA) to ensure that relevant documented safety procedures are implemented. During the investigation, safety issues were identified concerning modification of aircraft and DGCA approval of those modifications. While those safety issues did not contribute to the accident, they nevertheless are safety deficiencies. Accordingly, the NTSC report includes recommendations to address those identified safety issues.", "probable_cause": "The crew did not appear to have awareness of the aircraft’s proximity with terrain until impact with terrain was imminent. The flight crew did not act on the Enhanced Ground Proximity Warning System aural warnings, and did not conform to the operator’s published operating procedures. Together, those factors resulted in the aircraft’s impact with terrain."}