{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-8al-near-douala-114-killed", "date": "May 5, 2007 at 0008 LT", "type": "Boeing 737-800", "operator": "Kenya%20Airways-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Abidjan – Douala – Nairobi", "msn": "35069/2079", "yom": 2006, "flight_number": "KQ507", "city": "Douala", "zone": "Littoral", "country": "Cameroon", "region": "Africa", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 108, "pax_fatalities": 108, "other_fatalities": 0, "total_fatalities": 114, "captain_hours": 8682, "captain_hours_type": null, "copilot_hours": 831, "copilot_hours_type": null, "aircraft_hours": 2100, "circumstances": "During the night of 4th May 2007, the B737-800, registration 5Y-KYA, operating as flight KQ507 from Abidjan international Airport, Ivory Coast, to the Jomo Kenyatta Airport in Nairobi (Kenya), made a scheduled stop-over at the Douala international Airport. The weather was stormy. The aircraft took off and climbed into the dark night. There were no external visual references, yet no instrument scanning was done by the crew. At 1000 feet climbing, the pilot flying released the flight controls for 55 seconds without having engaged the autopilot. The bank angle of the airplane increased continuously by itself very slowly up to 34° right and the captain appeared unaware of the airplane’s changing attitude. Just before the \"Bank Angle\" warning sounds, the captain grabbed the controls, appeared confused about the attitude of the airplane, and made corrections in an erratic manner increasing the bank angle to 50° right. At about 50° bank angle, the autopilot was engaged and the inclination tended to stabilize; then movements of the flight controls by the pilot resumed and the bank angle increased towards 70° right. A prolonged right rudder input brought the bank angle to beyond 90°. The aircraft descended in a spiral dive until it crashed at approximately 0008LT (May 5) in a mangrove swamp located 5,5 km southeast of Douala Airport. The aircraft disintegrated on impact and all 114 occupants were killed. ", "probable_cause": "The airplane crashed after loss of control by the crew as a result of spatial disorientation (non recognized or subtle type transitioning to recognized spatial disorientation), after a long slow roll, during which no instrument scanning was done, and in the absence of external visual references in a dark night. Inadequate operational control, lack of crew coordination, coupled with the non-adherence to procedures of flight monitoring, confusion in the utilization of the AP, have also contributed to cause this situation."}