{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-99a-airliner-saint-barthelemy", "date": "Dec 31, 1999 at 1055 LT", "type": "Beechcraft 99 Airliner", "operator": "Bohlke International Airways", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Christiansted - Saint-Barthélemy", "msn": "U-97", "yom": 1969, "flight_number": null, "city": "Saint-Barthélemy-Rémy de Haenen (Saint-Jean-Gustave III)", "zone": "Saint-Barthélemy", "country": "Saint-Barthélemy", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 7, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "On December 31, 1999, at about 1055 Atlantic standard time, a Beech 99A, N491BB, registered to Alberta Aircraft Leasing Inc., operated by Bohlke International Airways, as a 14 CFR Part 135 on-demand air taxi, experienced a collapse of the main landing gear on landing at St. Barthelemy, (TFFJ) French Antilles. Visual meteorological conditions prevailed and no flight plan was filed. The airplane sustained substantial damage. The airline transport-rated pilot, copilot, and seven passengers reported no injuries. The flight originated from St. Croix, (STX) Virgin Islands, about 55 minutes before the accident. The accident was initially reported to the NTSB on January 5, 2000, by the FBI. The pilot stated they departed STX at about 1000. They had to make a 360-degree turn upon arrival at TFFJ due to other arriving traffic. They completed the descent arrival checklist and turned an 8- mile final. At a 1 1/2-mile final the flaps were lowered to the full down position, the propellers were set at 2,000 rpm, airspeed 95 knots, and all three landing gear lights were illuminated. On touchdown the airplane yawed to the left. Right rudder and aileron was applied with negative results. Power was increased and the airplane continued to yaw to the left. The airplane went off the left side of the runway and ground looped, separating the right main landing gear. The airplane came to a complete stop on its fuselage with the nose gear extended. They returned to the airplane on January 3, 2000. The airplane was lifted with a forklift and the left main landing gear was observed in the retracted position. A commuter pilot informed them that he observed the landing on the day of the accident. He stated he observed the left main landing gear moving forward and backwards.", "probable_cause": null}