{"url": "https://www.baaa-acro.com/crash/crash-antonov-148-100e-garbuzovo-6-killed", "date": "Mar 5, 2011 at 1040 LT", "type": "Antonov AN-148", "operator": "VASO", "flight_phase": "Flight", "flight_type": "Test", "survivors": "No", "site": "Plain, Valley", "schedule": "Voronezh - Voronezh", "msn": "41-03", "yom": 2010, "flight_number": null, "city": "Garbuzovo", "zone": "Belgorod oblast", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 6, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft departed Voronezh-Pridacha Airport in the morning to conduct a test flight with six crew on board, two pilots from the manufacturer, two engineers and two pilots from the Myanmar Air Force to whom the aircraft should be delivered. In flight, the crew decided to perform an emergency descent. During this manoeuvre, the aircraft reached an excessive speed and lost part of its tail, stabilizers and elevators. It entered an uncontrolled descent and crashed in a snow covered field located near Garbuzovo, bursting into flames. The aircraft was totally destroyed and all six occupants were killed. Tail parts, stabilizers and elevators were later found about 3 km from the point of impact. The airplane was operated by the Voronezh Aircraft Production Association. (VASO - Voronezhskoye Aktsionernoye Samoletostroitelnoe Obshestvo). First accident involving an Antonov AN-148. ", "probable_cause": "The cause of the accident was the inadvertently permitted the aircraft to accelerate 110 km/h above the design limit speed during an emergency descent. This led to low-frequency vibrations on the aircraft in all axes, an increase of alternating accelerations exceeding the margin of safety. The result was the break up of the aircraft in the air, followed by its collision with the earth.\r\nThe main factors contributing to the accident were: \r\n- Untimely and inadequate actions of the crew to control the emergency decent,\r\n- Lack of proper coordination among the members of the crew,\r\n- Deviations from recommendations in the flight manual in executing the emergency descent,\r\n- Misleading indications on basic instruments when outside characteristic operating conditions."}