{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-154m-quito-80-killed", "date": "Aug 29, 1998 at 1303 LT", "type": "Tupolev TU-154", "operator": "Cubana-de-Aviacion-2", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Quito - Guayaquil - Havana", "msn": "85A720", "yom": 1985, "flight_number": "CU389", "city": "Quito-Mariscal Sucre (City)", "zone": "Pichincha", "country": "Ecuador", "region": "South America", "crew_on_board": 14, "crew_fatalities": 14, "pax_on_board": 77, "pax_fatalities": 56, "other_fatalities": 10, "total_fatalities": 80, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9256, "circumstances": "While parked on the apron at Quito-Mariscal Sucre Airport, the crew started the engine when a pneumatic valve blocked. The problem was resolved and two engines were started with ground power unit while the third engine was started during taxi. During the takeoff roll on runway 17, at Vr speed, the pilot-in-command started the rotation but the aircraft failed to respond. For unknown reasons, the crew took 10 seconds to decide to abort the takeoff. The captain initiated an emergency braking procedure but the remaining distance of 800 metres was insufficient. Unable to stop, the aircraft overran, struck a concrete wall, an auto spare parts building and crashed near a soccer field, bursting into flames. Seventy people in the aircraft was well as 10 people on the ground were killed while 21 people in the airplane and 15 on the ground were injured, some seriously. At the time of the accident, the total weight of the aircraft was 73,309 kilos, within limits.", "probable_cause": "It is believed that the crew failed to follow the taxi and pre-takeoff checklist and forgot to select the switches for the hydraulic valves of the control system. No technical anomalies were found on the aircraft and engines. "}