{"url": "https://www.baaa-acro.com/crash/crash-cessna-414-chancellor-greeneville-4-killed", "date": "Dec 11, 2003 at 1047 LT", "type": "Cessna 414 Chancellor", "operator": "Young Forever", "flight_phase": "Landing (descent or approach)", "flight_type": "Executive/Corporate/Business", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Columbus – Greeneville", "msn": "414-0372", "yom": 1972, "flight_number": null, "city": "Greeneville", "zone": "Tennessee", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 4, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 4845, "captain_hours_type": 160, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 4989, "circumstances": "The pilot was on a circling approach for landing in instrument icing conditions. The landing gear were extended and the flaps were lowered to 15°. The alternate air induction system was not activated. The surviving passenger stated when the airplane came out of the clouds and the airplane started to buffet and shake. The pilot was heard to state on the UNICOM frequency by the fixed base operator and a lineman, \"Emergency engine ice.\" The airplane was observed to make a 60-degree angle of bank and collided with trees and terrain. The Pilot's Operating Handbook states the airplane will stall at 129 miles per hour with the landing gear and flaps down at 15-degrees. The maximum landing weight for the Cessna 414 is 6,430 pounds. The total aircraft weight at the crash site was 6,568.52 pounds. Witnesses who knew the pilot stated the pilot had flown one other known flight in icing conditions before the accident flight.", "probable_cause": "The pilot's failure to maintain airspeed while maneuvering in icing conditions on a circling approach for landing resulting in an inadvertent stall and collision with trees and terrain. A factor in the accident was a partial loss of engine power due to the pilot's failure to activate the alternate induction air system, and exceeding the maximum landing weight of the airplane."}