{"url": "https://www.baaa-acro.com/crash/crash-bae-3201-jetstream-32ep-lulea", "date": "Sep 17, 2003 at 1828 LT", "type": "BAe Jetstream 31", "operator": "European%20Executive%20Express", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pajala – Luleå", "msn": "948", "yom": 1991, "flight_number": "EXC403", "city": "Luleå", "zone": "Norrbotten", "country": "Sweden", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 31000, "captain_hours_type": 2000, "copilot_hours": 660, "copilot_hours_type": 237, "aircraft_hours": 13494, "circumstances": "The pilots were scheduled to fly the aircraft, a BAe Jetstream 32, on scheduled flight EXC403 from Pajala Airport to Luleå/Kallax Airport. This was the third flight together for the day. Before takeoff they noted that the flight was planned without passengers. Since the co-pilot was shortly to undergo an Operator’s Proficiency Check and the commander had long flying experience, including as an instructor, the commander decided to take the opportunity to have the co-pilot train flying with simulated engine failure. The takeoff from Pajala was at 17.57 hrs with the co-pilot as Pilot Flying. During the climb the commander reduced thrust on the right engine to simulate engine failure. This was done by moving the engine control lever to its rear stop. The commander understood this to represent what is termed ”simulated feather” in which an engine generates no drag and causes the least possible resistance. The exercise passed off without problem and the co-pilot had no difficulties in handling the aircraft. It was decided to practise flying with simulated engine failure during the landing as well. During the approach to Luleå/Kallax Airport when the aircraft was at an altitude of about 3500 feet the commander accordingly reduced thrust on the right engine once again. The co-pilot understood that the whole landing, including touchdown, would be with one engine on reduced thrust. However, the commander’s intention was to restore normal thrust on the right engine before touchdown. Prior to landing the reference speed (Vref1) had been calculated at 107 knots IAS2 and the flaps lowered 20°, based on the calculated landing mass of 5 640 kg. During the approach when the aircraft was at about 3500 feet, the commander reduced right engine thrust. According to the FDR recording thrust was reduced initially to just over 19 % and subsequently, for six minutes, further to just under 11% at the same time as altitude decreased to 900 feet. The co-pilot flew the aircraft in a right turn to runway 32 and started his final 2 nautical miles from the runway threshold at a height of 900 feet. The final was entered with a somewhat higher glide angle than normal. As the aircraft approached the runway threshold the thrust on the right engine had decreased to approximately 7%. The approach took place with applied rudder and opposite banking to counteract the lateral forces generated by the asymmetrical thrust. During the approach the co-pilot experienced an inertia in the ailerons that he had never experienced previously. Shortly after the aircraft had crossed the runway threshold and was about 5 metres above the runway, both the co-pilot and the commander felt how the aircraft suddenly yawed and rolled to the right. Neither pilot remembers hearing the stall warning sounding. Despite application of full aileron and rudder the pilots were unable to stop the aircraft’s uncontrolled motion. This continued until the right wing tip hit the ground. The fuselage then struck the ground. The aircraft slid on its belly about 50 metres alongside the runway before stopping. The pilots hastily evacuated the aircraft. The accident was observed by the air traffic controller who immediately alarmed the airport rescue service, which arrived at the accident scene within a minute or so. After its arrival the commander boarded the aircraft and turned off the fuel  supply and the main electricity, whereafter the rescue service covered the aircraft with foam. The accident occurred on 17 September 2003 at 18.28 hrs in position 6532N 02207E; 20 m above sea level in daylight.", "probable_cause": "The accident was caused by shortcomings in the company’s quality assurance system, operational routines and regulations. These contributed to the facts that:\r\n- the commander considered he was able to serve as a flying instructor on an aircraft type and in a flight situation for which he was neither qualified nor authorised,\r\n- the pilot's lacked necessary familiarity with the aircraft type’s special flight characteristics during asymmetrical thrust, and\r\n- the pilot's lacked familiarity with the regulations in force for flying training. "}