{"url": "https://www.baaa-acro.com/crash/crash-curtiss-c-46f-1-cu-commando-near-des-moines-2-killed", "date": "May 22, 1953 at 0413 LT", "type": "Curtiss C-46 Commando", "operator": "Resort-Airlines", "flight_phase": "Flight", "flight_type": "Positioning", "survivors": "No", "site": "Plain, Valley", "schedule": "New York – Cheyenne – Chicago ", "msn": "22536", "yom": 1945, "flight_number": null, "city": "Des Moines", "zone": "Iowa", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 8106, "captain_hours_type": 3622, "copilot_hours": 2593, "copilot_hours_type": 393, "aircraft_hours": 6867, "circumstances": "The aircraft arrived at Cheyenne, Wyoming at 0038, May 22, on a Civil Air Movement flight (military contract) from New York International Airport. The incoming pilots had no mechanical or radio discrepancies to report. After the aircraft was serviced, Captain Bowen F. Marshall and Copilot Samuel B. Aronson relieved the incoming crew for the purpose of ferrying the aircraft to Chicago, at which point, the pilots were to turn it over to another crew. Both pilots visited the U. S. Weather Bureau Airport Station at Cheyenne for weather briefing; all current weather information through 2330 (including three severe weather warnings) was on file and available to them. The aircraft departed Cheyenne at 0132, on an instrument flight plan to O’Hare Airport, Chicago, via Green Airway 3 and Red Airway 42 at 7,000 feet. Neither passengers nor cargo was carried and the center of gravity was within permissible limits. Routine position reports were made over Sidney, North Platte, Grand Island, and Omaha, Nebraska. In the last position report, at 0337, the flight reported to Omaha INSAC (Interstate Airways Communication Station) that it was over Omaha at 7,000 feet, estimating over Des Moines at Ohio. Three minutes later, the pilot again contacted Omaha INSAC and requested a change of altitude to 3,000 feet. Air Route Traffic Control, through Omaha INSAC, advised the flight that the 3,000-foot altitude was unavailable until arrival over Des Moines owing to a westbound flight proceeding at 2,600 feet between Des Moines and Omaha, and the request for descent would have to be disapproved. The flight was given the latest weather information between Omaha and Chicago, and the Des Moines 0327 weather, and there were no further radio contacts after this. Des Moines tower personnel received a telephone call at 0517 notifying them of the crash. The aircraft was destroyed and both pilots were killed.", "probable_cause": "The Board determines that the probable cause of this accident was separation of the right aileron tab motor from its support bracket due to loss of its outboard trunnion while the aircraft was an the severe turbulence of a thunderstorm. These conditions resulted in a tendency to roll erratically, and an conjunction with the extreme turbulence, caused loss of control and subsequent overloading of the wing to the point of failure. The following findings were pointed out:\r\n- The pilots had knowledge of expected weather conditions between Cheyenne and Chicago, including severe thunderstorms,\r\n- The aircraft flew into a severe thunderstorm in the vicinity of Des Moines, and structural failure occurred In flight,\r\n- Prior to impact the outboard trunnion supporting the right aileron tab motor backed out of the airport bracket due to inadequate safetying,\r\n- The right aileron tab motor tore loose from its bracket, punched through the wing, and was lost when the aileron tore loose,\r\n- The right wing panel failed at the attach angles to the center section due to a strong downward force which exceeded the design strength of the wing,\r\n- The tall group was struck by the right wing panel prior to the tail disintegration,\r\n- All radio contacts were routine and no declaration of emergency was received from the flight,\r\n- There was no malfunctioning or failure of the engines or propellers."}