{"url": "https://www.baaa-acro.com/crash/crash-lockheed-18-07-01-lodestar-gao-17-killed", "date": "Mar 24, 1952 at 0307 LT", "type": "Lockheed 18 LodeStar", "operator": "SATT", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Abidjan – Bobo Dioulasso – Bamako – Gao – Tamanrasset – El Golea – Algiers – Nice", "msn": "2005", "yom": 1940, "flight_number": null, "city": "Gao", "zone": "Gao", "country": "Mali", "region": "Africa", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 18, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 17, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft left Abidjan on its return flight to Nice with a  night stop scheduled at Tamanrasset. However, the flight was behind schedule and in view of the fact that Tamanrasset was not provided with night markings, the pilot decided to spend the night at Gao and leave the following morning at about 0900LT. He mentioned also that he was tired. Later that evening word was received from the company which caused the pilot to change his plans and decide to leave at 0300LT. On arrival at the meteorological office for preparation of the pre-flight plan, the pilot, during a conversation with the air traffic controller, complained that he was very tired and mentioned that the Gao-Nice flight would have to be made with only short stops on the way and that he had to fly in an aircraft not equipped with an automatic pilot and in which he was also required to perform the duties of navigator. He seemed to dread the take-off at night very much and went so far as to ask the controller to prohibit him from taking off. The controller could not comply with such a request, as the flight planned was normal from the regulation point of view. The aircraft took off from Gao at night at 0307LT with eighteen passengers and three crew. The take-off was normal and the aircraft rose to an altitude of about 10 meters. The navigation lights were then seen to fade gradually and to disappear in a depression beyond the runway, and shortly afterwards, flashes from a fire were seen and the alarm given. The aircraft collided with the ground after take-off completely destroying the aircraft. The wreckage was found about two km east of the airfield. Fourteen passengers and three crew were killed and four passengers injured.", "probable_cause": "The probable cause was an untimely contact with the ground after a take-off at night without any visible references beyond the runway lights. The contact was due to an unsuspected loss of altitude. The reasons for this poor altitude control are not well-known; they may be attributed to the pilot's state of fatigue or to an occurrence, perhaps of minor significance in the cockpit which distracted the pilot's attention. "}