{"url": "https://www.baaa-acro.com/crash/crash-antonov-26b-magadan", "date": "Jan 3, 2015 at 1119 LT", "type": "Antonov AN-26", "operator": "KAPO-Avia.png", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Petropavlovsk-Kamchatsky – Magadan – Mirny – Nizhnevartovsk", "msn": "117 05", "yom": 1981, "flight_number": null, "city": "Magadan-Sokol", "zone": "Magadan oblast", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3783, "captain_hours_type": 2240, "copilot_hours": 11986, "copilot_hours_type": 94, "aircraft_hours": 13698, "circumstances": "During the take off run, at a speed of 250 km/h, the crew initiated the rotation when the aircraft failed to lift off. The captain decided to abandon the take off and started an emergency braking. The aircraft veered off runway to the right, went through a snow covered terrain, lost its nose and right main gear before coming to rest 490 meters further, with the right wing bent. The aircraft was considered as damaged beyond repair while all eight occupants were unhurt. ", "probable_cause": "The accident occurred as result of the aircraft departing the side of the runway after the commander rejected takeoff after having been unable to use the elevator because of the yoke's locked position. The roll beyond the edge of the runway was likely caused by the flight engineer while attempting to operate the handle to release the flight controls lock while the aircraft was already accelerating for takeoff. The accident was thus caused by this combination of factors:\r\n- violation of requirements by FCOM to ascertain the flight controls were free and usable before engine start,\r\n- failure by the crew to execute the checklists to check elevator, rudder and ailerons were free to move before takeoff,\r\n- flight crew receives insufficient practice in real flight to maintain skills acquired during simulator training in the management of the aircraft and its systems resulting in negative impact during emergency situations."}