{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dh104-dove-1b-fritham-1-killed", "date": "Jul 23, 1955 at 0952 LT", "type": "De Havilland DH.104 Dove", "operator": "Cambrian%20Airways", "flight_phase": "Flight", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Cardiff – Southampton – Paris", "msn": "04116", "yom": 1948, "flight_number": null, "city": "Stoney Cross AFB", "zone": "Hampshire", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 6, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "Before leaving Cardiff (Rhoose) Airport the pilot filed a Visual Flight Rules flight plan giving an elapsed time of 35 minutes for the flight to Eastleigh Airport, Southampton at a cruising altitude of 5,500 feet and then on to Paris. The aircraft took off at 0925LT carrying the pilot and 6 passengers. At approximately 0950LT he called London, asked for clearance to Southampton Zone and was told to call Southampton Zone. He then acknowledged this request. Shortly after 0950 the engines became unsynchronized and the aircraft vibrated. The port propeller stopped rotating and the aircraft lost height. On reaching 200 feet the port engine was restarted and the aircraft flew very low over a line of high tension cables. It continued to fly at 200 feet at low speed with increased vibration over undulating country and after climbing slightly to clear a ridge it descended into a densely wooded area. When near the tree tops it banked to the left and the port wing tip struck a tree. The aircraft then traveled 400 yards further, struck the tops of several trees and crashed, killing the pilot and seriously injuring 4 passengers. ", "probable_cause": "The accident was the result of the pilot mistakenly shutting down the port engine instead of the starboard engine in which a serious mechanical fault had developed. This led to a rapid loss of height and although the pilot re- started the port engine the starboard engine was not shut down. The starboard engine had sustained considerable impact damage. When dismantled it was found that the crankshaft had broken at n° 3 crankpin. This failure had occurred before the crash as a result of a fatigue crack which developed at a plugged hole in the rear web of the n°3 crankpin. Heavy scoring on the faces of the crankcase web and cap of n°1 main bearing showed that n° 1 & 2 cylinders continued working after the crankshaft had failed. The crankshaft had run for a total of 1,205 hours since manufacture including 619 hours since the last overhaul when a modification designed to prevent failures of this nature was embodied. "}