{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2a-26-islander-walney-island", "date": "Jun 14, 1986 at 0415 LT", "type": "Britten-Norman Islander", "operator": "Air%20Furness", "flight_phase": "Landing (descent or approach)", "flight_type": "Positioning", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Glasgow – Walney", "msn": "3012", "yom": 1985, "flight_number": null, "city": "Walney Island", "zone": "Cumbria", "country": "United Kingdom", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2658, "captain_hours_type": 936, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The aircraft took off from Glasgow at 0317 hrs to fly to Barrow-in-Furness via Dean Cross. It left Dean Cross at flight level 50 on track for Walney Island aerodrome using radar advisory service from Manchester Control. When 12 miles north of his destination, the pilot began a slow descent over a layer of stratus cloud. On reaching Walney Island, he was still above cloud so, using positional advice from radar, he turned out to sea to continue his descent. He turned back to the airfield,still in cloud at 1500 feet and, shortly after fading from radar at approximately 1200 feet over the sea, he advised Manchester Control that he vas overhead the airfield. Air traffic control at Walney Island was not manned at the time and no formal record of local weather exists. Witnesses close to the airfield reported that the wind was calm and visibility was reduced by patchy, low-lying, sea fog. One witness, some 600 meters southwest of the touchdown zone of runway 06, saw the aircraft flying due north at a height he estimated to be between 50 and 100 feet but heard nothing unusual. Another witness, also near the southwest corner of the airfield, heard the aircraft pass overhead travelling north and then heard a cessation of engine noise followed immediately by a dull thud. Both witnesses estimated the surface visibility to be more than 200 meters at the time. The aircraft struck the ground on the centerline but some 30 meters short of the beginning of runway 06 in a steep nose-down, left wing low attitude, and came to rest within 10 meters of the initial impact. Ground marks showed the first impact to have been by the port wingtip followed immediately by the nose of the aircraft, which was crushed. The aircraft appeared then to have pivoted to the right about the nose and starboard wingtip, and to have bounced laterally to the right of the centerline before coming to rest with its tail toward the runway. The flaps were set to 25°. The main undercarriage was relatively undamaged and showed no evidence of having struck the ground during the initial impact sequence. ", "probable_cause": "The accident occured approximately 35 minutes after sunrise, and the approach to runway 06 would have been towards the rising sun. Examination of the wreckage revealed no pre-existing defects on the aircraft that could have had any bearing on the accident. "}