{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-350-super-king-air-pansol-9-killed", "date": "Sep 1, 2019 at 1510 LT", "type": "Beechcraft 350 Super King Air", "operator": "Lionair%20Inc", "flight_phase": "Flight", "flight_type": "Ambulance", "survivors": "No", "site": "City", "schedule": "Dipolog - Manila", "msn": "FL-196", "yom": 1998, "flight_number": null, "city": "Pansol", "zone": "Laguna", "country": "Philippines", "region": "Asia", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 7, "pax_fatalities": 7, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The airplane encountered a loss of control in flight while approaching Manila and crashed into a private resort located in Barangay Pansol, Calamba, Laguna, Philippines. It lost radar contact with Manila Approach after being cleared to descent from 9,000 feet for 5,000 feet tracking-in radial 170, 25 DME to Ninoy Aquino International Airport (RPLL). The aircraft wreckage was found in a private resort with coordinates of 14°10’33.62” N and 121°11’34” E and heading approximately 228° with most its fuselage totally burned. All the nine (9) occupants were fatally injured and two (2) other persons on the ground sustained serious injuries. The aircraft took off from Dipolog Principal Airport (RPMG), Dipolog City, Zamboanga del Norte bound for Manila (RPLL) on a MEDEVAC flight. Instrument Metrological Condition (lMC) prevailed at the time of the accident.", "probable_cause": "The aircraft experienced a loss of control in flight (LOC-I) after encountering adverse and hazardous atmospheric turbulent weather conditions which led to an inflight breakup.\r\nThe following contributing factors were identified:\r\n- The presence of adverse and potentially hazardous atmospheric conditions on route of the flight.\r\n- Failure of the flight crew to maintain situational awareness.\r\n- Break-down of CRM to apply appropriate emergency procedures to recover the aircraft from the unusual situation they encountered."}