{"url": "https://www.baaa-acro.com/crash/crash-beechcraft-1900d-karachi", "date": "Mar 18, 2016 at 0820 LT", "type": "Beechcraft 1900D", "operator": "ASSL", "flight_phase": "Takeoff (climb)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Karachi – Sui", "msn": "UE-45", "yom": 1993, "flight_number": null, "city": "Karachi-Muhammad Ali Jinnah-Quaid-e-Azam", "zone": "Sindh (سنڌ سندھ)", "country": "Pakistan", "region": "Asia", "crew_on_board": 3, "crew_fatalities": 0, "pax_on_board": 18, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 2885, "captain_hours_type": 717, "copilot_hours": 3614, "copilot_hours_type": 245, "aircraft_hours": 19574, "circumstances": "The Aircraft Sales and Services (Private) Limited (ASSL) aircraft Beechcraft-1900D Registration No. AP-BII was scheduled for a chartered flight on 18th March, 2016 from Karachi to Sui. Just after takeoff from runway 25L at 0820 hrs local time, the crew observed power loss of right engine and made a gear up landing on the remaining runway on the right side of centreline. After touchdown, the aircraft went off the runway towards right side and then came back on the runway before coming to a final stop 1,050 feet short from the end of runway. The Captain and one passenger received serious injuries due to hard impact of the aircraft with ground. All other passengers and technician remained unhurt.", "probable_cause": "The investigation therefore, concludes that:\r\n- Some internal malfunction of the Propeller Governor Part No. 8210-410 Serial No. 2490719 was the cause of experienced uncommanded auto feather. However, exact cause of the occurrence could not be determined.\r\n- Continuing take off below V1 speed (104kts) after encountering engine malfunction and after takeoff raising flaps below recommended height (400ft AGL) lead to decrease in lift and unsustainability of flight. "}