{"url": "https://www.baaa-acro.com/crash/crash-fokker-f27-friendship-600-saint-peter-2-killed", "date": "Jan 12, 1999 at 1706 LT", "type": "Fokker F27 Friendship", "operator": "Channel%20Express", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Luton - Saint Peter", "msn": "10508", "yom": 1975, "flight_number": null, "city": "Saint Peter-La Villiaze", "zone": "Channel Islands", "country": "United Kingdom", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 2, "captain_hours": 3930, "captain_hours_type": 750, "copilot_hours": 958, "copilot_hours_type": 317, "aircraft_hours": null, "circumstances": "The Fokker F27 was operating on a cargo flight to Guernsey, carrying newspapers. The aircraft departed Luton at 16:14. and climbed to cruising altitude FL150/160). The descent was begun at about 60 miles from Guernsey Airport and the aircraft was vectored onto final approach by Jersey Radar. The approach checklist was actioned and the flaps were lowered to 16° just before the aircraft was turned to intercept the ILS localizer. With less than six miles to run to the threshold the commander told the first officer that he could see the runway and was content to continue the approach visually. The first officer informed ATC that they wished to continue the approach visually; they were given the appropriate clearance and control of the aircraft was then handed over to Guernsey Tower. Initially the aerodrome controller cleared the aircraft to continue the approach (there was departing traffic on the runway) and the commander called for flaps to 26° followed by the landing checklist. About one minute later the commander said \"three whites\" (meaning that he was aware that the aircraft was slightly high on the glide path indicated by the precision approach path indicator lights) which the first officer acknowledged. The commander then said \"ok the decision is to land, speed below one four four, flaps forty\". The first officer acknowledged the instruction to select flaps to 40° and announced \"running\". There followed a pause of about five seconds before the first officer said, \"flaps forty gear and clearance you have - oops\". The commander then said, in an anxious tone of voice \"ok flaps twenty six\" and the engines could be heard accelerating on the cockpit voice recording. There then followed a number of expletives from the commander interspersed with some loud clicks as controls or switches were operated and the sound of a warning horn which stopped before the end of the recording. On approach the aircraft had lost control, attaining a nose-high attitude. The plane stalled, clipped a house on Forest Road with its left wing and ploughed into a field short of the runway.", "probable_cause": "The investigation identified the following causal factors: \r\n(i) The aircraft was operated outside the load and balance limitations; \r\n(ii) Loading distribution errors went undetected because the load sheet signatories did not reconcile the cargo distribution in the aircraft with the load and balance sheet;\r\n(iii) The crew received insufficient formal training in load management."}