{"url": "https://www.baaa-acro.com/crash/crash-partenavia-p68c-tc-meyrin-3-killed", "date": "Dec 16, 1985 at 1904 LT", "type": "Partenavia P.68", "operator": "Rieker%20Air%20Service", "flight_phase": "Takeoff (climb)", "flight_type": "Executive/Corporate/Business", "survivors": "No", "site": "City", "schedule": "Geneva - Stuttgart", "msn": "257-15", "yom": 1982, "flight_number": null, "city": "Meyrin", "zone": "Geneva", "country": "Switzerland", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 234, "captain_hours_type": 28, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 631, "circumstances": "After takeoff from Geneva-Cointrin Airport runway 23 in poor visibility due to foggy conditions, the pilot initiated a right turn. While flying at an altitude of 100 feet, the twin engine aircraft struck the concrete block of a lift cable system located on the roof of a residential building of seven floors located in the city of Meyrin. Out of control, the aircraft lost height and crashed on a second building located less than 2 km west of the airport. The aircraft was totally destroyed and all three occupants were killed. Both buildings were damaged and 51 vehicles in few parkings were damaged or demolished.", "probable_cause": "It was determined that the aircraft was in an uncontrolled attitude while in a right turn in flight conditions of limited visibility due to fog. Given his low height, the pilot was unable to restore the situation in time and to gain sufficient altitude. One or more of the following factors may have played a role in the accident:\r\n- A too sharp turn during initial climb, \r\n- The pilot was distracted in the aircraft handling,\r\n- The pilot's lack of experience, \r\n- Possible residuals wake turbulence caused by a Boeing 737 that departed shortly before the accident, and \r\n- A possible failure of the artificial horizon."}