{"url": "https://www.baaa-acro.com/crash/crash-lockheed-l-649-constellation-boston", "date": "Jan 21, 1948 at 0417 LT", "type": "Lockheed L-649 Constellation", "operator": "Eastern-Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Miami – Newark", "msn": "2532", "yom": 1947, "flight_number": "EA604", "city": "Boston", "zone": "Massachusetts", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 20, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 10312, "captain_hours_type": 363, "copilot_hours": 3001, "copilot_hours_type": 145, "aircraft_hours": 1499, "circumstances": "Flight 604 departed Miami, Florida, at 2301, January 20, 1948, on an instrument flight rules clearance, non-stop to Newark, New Jersey, to cruise at 15,000 feet via Airway Amber 7 to Jacksonville, Florida, and Airway Amber 6 to Alma, Georgia, thence direct to Spartanburg, South Carolina, Winston-Salem, North Carolina, and Washington, D. C., and via Airway Amber 7 to Newark, Boston, Massachusetts, and Providence. Rhode Island, were designated as alternate air ports. In order to remain above the overcast, the flight requested changes of cruising altitude between Winston-Salem and Washington, and at 0232, at which time it reported over Washington, the flight was cruising at 21,000 feet. Shortly after passing Washington, Flight 604 was cleared to descend en route to Newark and to cross Philadelphia at 7,000 feet, and was advised that no traffic was reported above 7,000 feet. A descent was established and at 0253 the flight reported over Philadelphia \"at 8,000 feet descending.\" Shortly thereafter the company radio station at LaGuardia Field, New York, advised the flight that the 0240 weather observation for Newark indicated a ceiling of 700 feet and visibility of one-half mile. Immediately thereafter the flight was given an air traffic control clearance \"to Flatbush and LaGuardia Approach Control\" to cross Keyport and Flatbush at 2,500 feet. Upon receiving this clearance the captain immediately requested a confirmation from the New York dispatcher, inasmuch as no prior notice had been received of a change of destination from Newark to LaGuardia. In acknowledgment the flight was informed that the dispatcher desired the flight to proceed to LaGuardia Field. During the period of the flight from midnight until 0300, the ceilings had lowered throughout the New York-New Jersey area. At the time of the re-clearance the LaGuardia weather was being reported as ceiling 500 feet, visibility one and one-quarter miles, and light snow. The flight continued its descent on the east course of the Philadelphia radio range and reached 2,500 feet in the vicinity of Freehold, New Jersey, over which the crew reported passing at 0309. Immediately after this report the flight changed to the LaGuardia Approach Control frequency. LaGuardia Approach Control immediately cleared the flight to descend to 1,500 feet and approved a straight-in landing on Runway 4. Since no material change had been observed in the LaGuardia weather, the flight was again informed that the ceiling was reported as 500 feet, the visibility one and one-quarter miles, and the wind calm. The flight passed directly over the airport without attempting a landing approach and shortly thereafter reported over the range station which is located three and two-tenths miles northeast of the airport. The flight was then cleared to use the reciprocal runway, 22, but the aircraft returned southeastward, passing to the east of LaGuardia Field again without attempting a landing approach. During this period the LaGuardia weather observer completed the 0325 weather observation and approximately 3 minutes thereafter the flight was advised that this report indicated an indefinite ceiling 400 feet and visibility one and one-half miles. The flight continued southwestward in order to establish an approach to Runway 4. Approach Control asked the flight at this time whether it desired a GCA (Ground Controlled Approach Radar) monitored approach. The captain declined a controlled approach but stated that he would accept a monitored approach. At approximately 0330 the aircraft again passed over the airport in a northeasterly direction; the flight advised Approach Control that the ceiling was not 500 feet and requested a report of the current Boston weather. The 0230 Boston weather report was transmitted to the flight, indicating a ceiling of 8,000 feet, 3 miles visibility, smoke, and haze. Upon receiving this report, the flight requested and received clearance to Boston from Air Traffic Control and from the company dispatcher. At 0337, the flight reported leaving Rye, New York, en route to Boston, climbing to 5,000 feet. Shortly after the flight passed over Hartford, Connecticut, at 0354, the company station at Boston advised the captain that the flight was cleared to the Boston Tower. Before reaching Boston the flight was informed that the 0400 weather report for that station indicated \"ceiling 600 feet, sky obscured, visibility one mile, light snow; surface wind southeast 8 miles per hour.\" After passing Franklin, Massachusetts, at 0409, the flight changed to the Boston Tower frequency. When asked by the flight whether the Instrument Landing System (ILS) was operating, the tower advised the flight that the monitor panel indicated this system to be operating normally. Shortly thereafter the tower cleared the flight for a straight-in approach to Runway 4 and cautioned that due to the runway condition braking action was \"fair to poor.\" Initial touchdown was made on Runway 4, at 0417, approximately 2,000 feet beyond the approach end of the runway. After completing approximately 600 feet of its landing roll, the aircraft was seen to skid to the left and crash into a snowbank along the left side of the runway. The right landing gear and nose gear collapsed and the aircraft fell on the right wing, coming to rest on the left side of the runway heading in a westerly direction. Fire broke out in the vicinity of the No. 3 and No. 4 engines and spread rapidly toward the fuselage. However, all passengers were deplaned and were removed from the vicinity of the aircraft without injury resulting from the crash or subsequent fire. Five of the occupants were injured during the evacuation due to the necessity for jumping from the rear exit, which was estimated to be 12 to 16 feet above the ground. Several fire fighting units from the airport and from East Boston were alerted and proceeded to the scene of the accident; however, the aircraft continued to burn for approximately one hour and 30 minutes after the crash.", "probable_cause": "On the basis of the above findings, the Board determines that the probable cause of this accident was the loss of directional control of the aircraft on the runway due to excessive snow accumulation. A contributing factor was the lack of precaution exercised by the air carrier’s station manager, the Civil Aeronautics Administration’s operations inspector and the airport management in determining that the conditions of the runways were adequate for safe aircraft landing."}