{"url": "https://www.baaa-acro.com/crash/crash-learjet-35a-cancun", "date": "Aug 14, 2003 at 2222 LT", "type": "Learjet 35", "operator": "Air America Flight Services", "flight_phase": "Landing (descent or approach)", "flight_type": "Ambulance", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Lauderdale - Cancún", "msn": "35-403", "yom": 1981, "flight_number": null, "city": "Cancún", "zone": "Quintana Roo", "country": "Mexico", "region": "Central America", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 3, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 7950, "circumstances": "On August 14, 2003, about 2222 central daylight time, a Gates LearJet Corporation 35A, N403FW, registered to Aircraft Holdings LLC, operated by Air America Flight Services, Inc., was landed with the landing gear retracted at the Cancun International Airport, Cancun, Mexico. Visual meteorological conditions prevailed at the time and an instrument flight rules flight plan was filed for the 14 CFR Part 91 positioning flight. The airplane was substantially damaged and there were no injuries to the airline transport rated pilot and copilot, nor to the three medical personnel on board the airplane. The flight originated about 2145 eastern daylight time from the Fort Lauderdale Executive Airport, Fort Lauderdale, Florida. According to the director of operations for the operator, the airplane was cleared for a visual approach to runway 12, and the flightcrew advised him they did read the landing checklist. The landing gear was down and locked as indicated by the three green lights; though they didn't recall if the landing gear was extended as evidenced by the landing lights. They also advised him of feeling fuselage to runway surface contact; the airplane slid approximately 4,000 feet before coming to rest upright. Following the occurrence, the nose of the airplane was raised and the nose landing gear was observed to be inside the wheel well. Emergency extension of the landing gear was initiated and the nose landing gear extended and locked; the main landing gear did not extend as fuselage to runway contact prevented extension of the main landing gears. The airplane was dragged from the runway where approximately 2 days later, a crane raised the airplane. At that time, the main landing gears which were in the wheel wells, extended and locked into position.", "probable_cause": null}