{"url": "https://www.baaa-acro.com/crash/crash-ilyushin-ii-76td-mwanza-8-killed", "date": "Mar 23, 2005 at 2305 LT", "type": "Ilyushin II-76", "operator": "Airline%20Transport", "flight_phase": "Takeoff (climb)", "flight_type": "Cargo", "survivors": "No", "site": "Lake, Sea, Ocean, River", "schedule": "Mwanza – Khartoum – Benghazi – Osijek", "msn": "0043 4546 23", "yom": 1984, "flight_number": "RIN982", "city": "Mwanza", "zone": "Mwanza Region", "country": "Tanzania", "region": "Africa", "crew_on_board": 8, "crew_fatalities": 8, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 8, "captain_hours": 11609, "captain_hours_type": 8939, "copilot_hours": 4769, "copilot_hours_type": null, "aircraft_hours": 2615, "circumstances": "On 23 March 2005 at 0533 hours an Ilyushin IL-76 cargo jet with the Republic of Moldova registration letters ER-IBR landed at Mwanza on a flight from Benghazi, Libya. It was carrying a crew of 8 including 2 ground engineers. All the 8 crew members were later involved in the accident. While at Mwanza, some 50,000 kg of fish was uplifted. At 1930 hours the commander filed a flight plan for Khartoum. The endurance was 0450 hours. The cargo manifest showed that ER-IBR was operating Air Trans Inc. Flight RIN 982 from Mwanza to Osijek, Croatia, with refueling stops at Khartoum and Benghazi. At 2000 hours the aircraft was given information relevant for take off as well as the departure clearance. ER-IBR subsequently advised that he was starting the take-off roll. This was the last communication received from the aircraft. The aircraft was observed to execute a normal take-off roll from runway 30. This runway ends 120m short of Lake Victoria. After observing that the aircraft was airborne, the controller who was handling the flight reported that he turned to complete the flight progress strip. Having done so, he lost visual contact with the aircraft that was supposed to be in a climb profile over the lake. Efforts to raise the aircraft on the radio failed. In about two minutes from the time that the aircraft was airborne, he saw a fire tender speeding along runway 30. It was then that he realized that the flight may have crashed. The Mwanza Airport Rescue and Fire Fighting Services were not equipped for operations in the lake. They were therefore unable to reach the aircraft, which was more than 1 km away from the shore. It was the fishermen at the lake shore near Mwanza airport who saw the aircraft going down in the lake. They proceeded to the crash site in fishing boats and brought back some documents (flight manuals and wiring diagrams) which they found floating near the wreckage. ", "probable_cause": "The accident was caused by aircraft colliding with the water surface shortly after take off.  While the aircraft had gathered sufficient energy to sustain climb, the crew failed to monitor altitude and react correctly in the short time that the aircraft was airborne. This resulted in the aircraft going into descent till it reached an altitude where recovery was not possible. The possibility of crew fatigue as a contributory factor in this accident cannot be ruled out."}