{"url": "https://www.baaa-acro.com/crash/crash-douglas-c-54g-skymaster-mcchord-afb-37-killed", "date": "Nov 28, 1952 at 0048 LT", "type": "Douglas C-54 Skymaster", "operator": "United%20States%20Air%20Force", "flight_phase": "Landing (descent or approach)", "flight_type": "Military", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fort Wainwright – McChord", "msn": null, "yom": null, "flight_number": null, "city": "McChord AFB", "zone": "Washington", "country": "United States of America", "region": "North America", "crew_on_board": 7, "crew_fatalities": 7, "pax_on_board": 32, "pax_fatalities": 30, "other_fatalities": 0, "total_fatalities": 37, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The C-54G, assigned to the Military Air Transport Service (MATS), 1701st Air Transport Wing at Malmstrom Air Force Base (AFB), Great Falls, Montana, was inbound from Ladd AFB, Fairbanks, Alaska, carrying 32 American servicemen and their dependents, and a crew of seven. At 0030LT, the pilot, Captain Albert J. Fenton, radioed the McChord air traffic control tower for field conditions and was informed that visibility was approximately three-quarters of a mile. Captain Fenton was directed to execute a wide left-hand turn and descend for a ground-controlled landing from the south. As the aircraft neared the field, a thick fog bank, rising 300 feet high, suddenly developed, reducing visibility to near zero. At 0048LT, Captain Fenton, now on final approach, decided to abort the landing and radioed the control tower that he was proceeding to Malmstrom AFB instead. Minutes later, witnesses telephoned the control tower and the Pierce County Sheriff’s Department to report a downed aircraft. The Skymaster crashed into an open field (now Wards Lake Park) approximately one mile north of McChord AFB and one-half mile east of S Tacoma Way between S 84th and S 88th Streets in the unincorporated community of Lakewood. It barely missed the Edgewood Park apartments, 35 four-family units built to ease the military’s housing shortage during the Korean War (1950-1953), and other nearby homes. Several people who saw the accident said the Skymaster was on fire before it crashed. Upon impact, the aircraft broke in two and exploded into flames. Bodies, personal belongings, packages and luggage were scattered around the crash scene for 200 yards. Most of the fire was in the forward section of the fuselage, the tail and aft section remaining almost intact. Some witnesses said they could hear the cries of people caught in the burning wreckage, but were helpless to render assistance. Meanwhile, fire and rescue teams from McChord AFB, Lakewood, and Tacoma rushed to the crash site and extinguished the fires in the fuselage and scattered debris. Using magnesium flares and flashlights, police and sheriff’s officers, firemen, and military personnel searched the smoldering, twisted wreckage, looking for victims. Of the 39 people aboard the C-54G, they found only three survivors: Airman Bobby R. Wilson, age 20, a member of the plane’s crew, Airman Curtis Redd, age 23, and Joseph M. Iacovitti, age 8, both passengers. Wilson, who had third-degree burns, internal injuries, and multiple skull fractures, died at Pierce County Hospital on Saturday, November 29. Redd was taken to St. Joseph Hospital in Tacoma in critical conditions with third-degree burns, but survived. Iacovitti was taken to Pierce County Hospital in serious condition with burns, broken legs and a fractured neck. He lived through the ordeal, but his parents, two brothers, and a sister died in the mishap, leaving him an orphan and the only surviving member of his family. Three other families were wiped out entirely.\r\nCrew:\r\nBenedict, John H., 20, Airman Second Class\r\nBentley, Patricia, 24, Airman Third Class\r\nBokinsky, Joseph H., 24, Staff Sergeant\r\nChilders, Wilber C., 21, Airman Second Class\r\nFenton, Albert J., 29, Captain, pilot\r\nHarvey, James D., 27, First Lieutenant, copilot\r\nWilson, Bobby R., 20, Airman Third Class.\r\nPassengers:\r\nU.S. Army:\r\nCoons, Robert F., 22, Corporal\r\nGalloway, Calvin, 18, Private First Class\r\nHockenberry, Denny L., 22, Sergeant\r\nHockenberry, Elda M., 21, spouse\r\nHockenberry, Susan E., 2, daughter\r\nHockenberry, Denise M., 1, daughter\r\nLebonitte, Joseph T., 23, Private First Class\r\nZeravich,Christoph, 24, Corporal\r\nU.S. Air Force\r\nAlsbury, Jack R., 21, Airman Third Class\r\nCook, Robert H., 20, Airman First Class\r\nFarley, Donna L., 20, (spouse of Farley, Glen D., Staff Sergeant)\r\nIacovitti, Anthony R., First Lieutenant \r\nIacovitti, Dorothy E., 31, spouse\r\nIacovitti, Anthony F., 6, son\r\nIacovitti, John A., 4, son\r\nIacovitti, Barbara, 2, daughter\r\nJohnson, Dwight P., 23, Airman Second Class\r\nMorris, George E., 33, Master Sergeant\r\nMorris, Anna D., 28, spouse\r\nMorris, George E., Jr., 3, son\r\nMorris, Geraldine A., 5, daughter\r\nNiemi, Edwin, 35, Staff Sergeant\r\nParlett, Frederick D., 18, Basic Airman\r\nPickerel, Robert L., 22, Airman First Class\r\nSmith, Raymond D., 24, Staff Sergeant\r\nSwang, Marion E., 41, Major [incorrectly listed as Swann]\r\nWeikum, Elmer, 23, Airman Second Class\r\nWells, Samuel R., 35, Master Sergeant\r\nWells, Margaret A., 33, spouse\r\nWells, Samuel R. III, 3, son\r\nSurvivors\r\nIacovitti, Joseph M., 8, (son of Dorothy and Anthony Iacovitti)\r\nRedd, Curtis, 23, Airman Second Class.\r\nSource:\r\nhttp://www.koreanwar-educator.org/topics/airplane_crashes/c54_tacoma_19521128/p_c54_tacoma_11_28_52.htm", "probable_cause": "An Air Force crash-probe team, commanded by Brigadier General Richard J. O’Keefe, was immediately dispatched from Norton AFB, San Bernardino, California, to begin sifting through the wreckage for clues to the accident. They wanted to determine why the aircraft was so low as to clip the tops of two fir trees before crashing. One of the aircraft’s four propellers was found 100 yards from the wreckage, sitting upright in the field. The condition of the blades indicated the propeller had stopped turning before it hit the ground. Twelve witnesses, who saw the Skymaster just prior to the crash, said the right wing or an engine was on fire. Captain Fenton had been in constant radio contact with the tower until the final moment, but never reported a mechanical difficulty or fire. Just before announcing his decision to fly to Malstrom AFB, the pilot inquired about weather at the Seattle-Tacoma International Airport and was told conditions were clear. The Air Force Board of Inquiry determined that as Captain Fenton was on final approach to land at McChord AFB, he boosted power to regain altitude, but the Skymaster’s number three engine failed. In the thick fog, the pilot was unable to see, much less avoid, a line of towering fir trees immediately north of the base. The aircraft sheared off the tops of two 100-foot tall Douglas firs, slammed into an open field and exploded into flames."}