{"url": "https://www.baaa-acro.com/crash/crash-tupolev-tu-134a-near-almaty-90-killed", "date": "Aug 30, 1983 at 2017 LT", "type": "Tupolev TU-134", "operator": "Aeroflot-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Mountains", "schedule": "Kazan - Chelyabinsk - Alma-Ata", "msn": "60630", "yom": 1978, "flight_number": "SU5463", "city": "Almaty", "zone": "Almaty Province", "country": "Kazakhstan", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 6, "pax_on_board": 84, "pax_fatalities": 84, "other_fatalities": 0, "total_fatalities": 90, "captain_hours": null, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9976, "circumstances": "Following an uneventful flight from Chelyabinsk at an altitude of 10,200 meters, the crew was cleared to initiate the approach to Alma-Ata Airport in view of a landing on runway 05. By night, the crew was instructed to initiate a left turn and to descend to an altitude of 600 meters after being informed of an II-62 approaching eight km right of their position. As the aircraft was too low, the GPWS warning sounded in the cockpit. For unknown reasons, the crew failed to react promptly and initiated a corrective maneuver 23 seconds later. The aircraft nosed up to an angle of 14° then turned left to an angle of 11-12° when it struck two seconds later the slope of Mt Dolan (690 meters high) located about 36 km west of Almaty Airport. The aircraft disintegrated on impact and all 90 occupants were killed. The wreckage was found 24 meters below the summit.", "probable_cause": "It was determined that the crew failed to prepare the approach maneuver according to published procedures. ATC failed to assist the crew properly and transmitted wrong instructions, causing the airplane to descent prematurely to the unsafe altitude of 600 meters and outside the approach diagram. The crew failed to be proactive when the GPWS alarm sounded and a corrective action was taken too late. It was also reported that the phraseology used by the pilots was non standard. "}