{"url": "https://www.baaa-acro.com/crash/crash-cessna-421c-golden-eagle-iii-near-floriston-1-killed", "date": "May 16, 2013 at 1330 LT", "type": "Cessna 421C Golden Eagle III", "operator": "Tri-Wings", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "San Jose - Reno", "msn": "421C-0868", "yom": 1980, "flight_number": null, "city": "Floriston", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 1480, "captain_hours_type": 79, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 9086, "circumstances": "During a cross-country instrument flight rules (IFR) flight, the air traffic controller cleared the pilot to begin his initial descent for landing and issued a heading change to begin the approach. The pilot acknowledged the altitude and heading change. One minute later, the controller noticed that the airplane's radar track was not tracking the assigned heading. The controller queried the pilot as to his intentions, and the pilot replied that he was in a spin. There were no further communications with the pilot. The wreckage was subsequently located in steep mountainous terrain. A study of the weather indicated widespread cloud cover in the area around the time of the accident. A witness near the accident site reported that he heard an airplane in a dive but could not see it due to the very dark clouds in the area. He heard the engine noise increase and decrease multiple times. It is likely that the pilot entered into the clouds and failed to maintain airplane control. The changes in the engine noise were most likely the result of the pilot's attempt to recover from the spin. About 8 months before the accident, the pilot completed the initial pilot training course in the accident airplane and was signed off for IFR currency; however, recent or current IFR experience could not be determined. Examination of the fragmented airplane and engines revealed no abnormalities that would have precluded normal operation.", "probable_cause": "The pilot's failure to maintain airplane control during descent while operating in instrument meteorological conditions. "}