{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-3-201g-near-florence-22-killed", "date": "Sep 7, 1945 at 0213 LT", "type": "Douglas DC-3", "operator": "Eastern-Airlines-3", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "No", "site": "Airport (less than 10 km from airport)", "schedule": "Miami – Jacksonville – Savannah – Raleigh – New York", "msn": "4137", "yom": 1941, "flight_number": "EA042", "city": "Florence-Peretola", "zone": "South Carolina", "country": "United States of America", "region": "North America", "crew_on_board": 3, "crew_fatalities": 3, "pax_on_board": 19, "pax_fatalities": 19, "other_fatalities": 0, "total_fatalities": 22, "captain_hours": 16390, "captain_hours_type": 6500, "copilot_hours": 2492, "copilot_hours_type": 650, "aircraft_hours": 17532, "circumstances": "Flight 42 departed Miami for New York City at 2122LT, September 6, 1945, with routine stops at Jacksonville and Savannah. Having obtained an instrument clearance from Airway Traffic Control to cruise at 5,000 feet to Raleigh, the flight departed Savannah at 0041, September 7, with Washington and Baltimore listed as alternates. At 0150 the flight transmitted a position report to the company station at Washington indicating that it had passed over Florence at 0144 at 5,000 feet. The flight was advised that Raleigh, its next scheduled stop, was reporting a 300 foot overcast. Since the weather at Raleigh was below authorized minimums, Flight 42 requested permission from the company dispatcher to proceed past Raleigh without landing. The station at Washington advised the flight at 0155 that it had been re-cleared to Washington with Baltimore as an alternate, but no acknowledgement of the message was received. At 0205, a radio transmission from Flight 42 was intercepted in which it was indicated that the pilot intended to return to Florence and that he desired clearance to lend at Florence Field. Because of the unusually severe radio interference, the entire message was not readable and no reason was apparent at that time for the pilot's decision to return to Florence. Several subsequent attempts by company, CAA and army stations in the vicinity to contact the flight were unsuccessful. While attempting to return to Florence the aircraft crashed at 0213 in a swampy, wooded area 6 miles ENE of Florence Army Air Filed. The wreckage was located at approximately 1040, September 7.", "probable_cause": "The Board determines that the probable cause of this accident was fire of undetermined genesis in the rear cargo compartment or lavatory which resulted in the inability of the pilot to maintain altitude long enough to effect a landing."}