{"url": "https://www.baaa-acro.com/crash/crash-piper-pa-46-310p-malibu-prescott", "date": "May 29, 2018 at 2115 LT", "type": "Piper PA-46 (Malibu/Meridian/Mirage/Matrix/M-Class)", "operator": "1st Avenue Malibu Services LLC", "flight_phase": "Landing (descent or approach)", "flight_type": "Private", "survivors": "Yes", "site": "City", "schedule": "Santa Ana – Prescott", "msn": "46-8608009", "yom": 1986, "flight_number": null, "city": "Prescott", "zone": "Arizona", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 3100, "captain_hours_type": 3, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "According to the pilot, about 15 minutes before reaching the destination airport during descent, the engine lost power. The pilot switched fuel tanks, and the engine power was momentarily restored, but the engine stopped producing power even though he thought it \"was still running all the way to impact.\" The pilot conducted a forced landed on a highway at night, and the right wing struck an object and separated from the airplane. The airplane came to rest inverted. According to the Federal Aviation Administration (FAA) aviation safety inspector (ASI) that performed the postaccident airplane examination, the fuel lines to the fuel manifold were dry, and the fuel manifold valves were dry. He reported that the fuel strainer, the diaphragm, and the fuel filter in the duel manifold were unremarkable. Fuel was found in the gascolator. The FAA ASI reported that, during his interview with the pilot, \"the pilot changed his story from fuel exhaustion, to fuel contamination.\" The inspector reported that there were no signs of fuel contamination during the examination of the fuel system. According to the fixed-base operator (FBO) at the departure airport, the pilot requested 20 gallons of fuel. He then canceled his fuel request and walked out of the FBO.", "probable_cause": "The pilot's improper fuel planning, which resulted in fuel exhaustion and the subsequent total loss of engine power."}