{"url": "https://www.baaa-acro.com/crash/crash-rockwell-shrike-commander-500s-sao-sebastiao-do-passe-4-killed", "date": "Mar 14, 2007 at 1355 LT", "type": "Rockwell Shrike Commander 500", "operator": "BATA", "flight_phase": "Flight", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "No", "site": "Plain, Valley", "schedule": "Petrolina – Salvador", "msn": "500-3094", "yom": 1971, "flight_number": null, "city": "São Sebastião do Passé", "zone": "Bahia", "country": "Brazil", "region": "South America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 2, "pax_fatalities": 2, "other_fatalities": 0, "total_fatalities": 4, "captain_hours": 6858, "captain_hours_type": 2368, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 15843, "circumstances": "The twin engine aircraft departed Petrolina Airport at 1221LT on a flight to Salvador, carrying 2 passengers, 2 pilots and a load of bags containing bank documents. At 1332LT, while in cruising altitude, the crew contacted ATC and reported an engine failure. The captain elected to make an emergency landing and reduced his altitude when the aircraft entered a right turn and crashed in a field located in São Sebastião do Passé, about 50 km northwest of Salvador Airport. The aircraft was destroyed upon impact and all four occupants were killed. ", "probable_cause": "Engine failure in flight following a fuel exhaustion. It was determined that the crew failed to prepare the flight properly and did not calculate the fuel consumption correctly. Investigations determined that the crew calculated a fuel consumption of 100 liters per hour while the true consumption was 120 liters per hour. The following contributing factors were identified:\r\n- Overconfidence on part of the crew,\r\n- Poor organisational culture that affected flight safety, \r\n- Poor flight planning, \r\n- The crew failed to feather the propeller following the engine failure, causing drag and contributing to the loss of control at low height. "}