{"url": "https://www.baaa-acro.com/crash/crash-douglas-dc-7c-miami-9-killed", "date": "Mar 25, 1958 at 0006 LT", "type": "Douglas DC-7", "operator": "Braniff-International-Airways-1", "flight_phase": "Takeoff (climb)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Dallas – Miami – Panama City – Rio de Janeiro", "msn": "45072", "yom": 1957, "flight_number": "BN971", "city": "Miami-Intl", "zone": "Florida", "country": "United States of America", "region": "North America", "crew_on_board": 5, "crew_fatalities": 0, "pax_on_board": 19, "pax_fatalities": 9, "other_fatalities": 0, "total_fatalities": 9, "captain_hours": 20672, "captain_hours_type": 241, "copilot_hours": 13250, "copilot_hours_type": 257, "aircraft_hours": 3306, "circumstances": "Braniff International Flight 971 was originally scheduled to depart New York, New York, for Miami, Florida, on March 23, 1958, at 2355 but this leg of the flight was not made owing to shortage of equipment and scheduling difficulties on that date. N 5904 was ferried from Dallas, Texas, to Miami, arriving at 1915 on March 24 for use as Flight 971. The aircraft was serviced and made reedy for the trip to Panama City, Panama, the first scheduled stop on the route to Rio de Janeiro, Brazil. The crew consisted of Captain Thomas D. George, First Officer John C. Winthrop, Jr., Second Officer Charles F. Fink, Steward Alberto Zapatero, and Stewardess Madelon Campion. The flight departed the Miami terminal at 2356, taxied to runway 27R where engine runup was made, after which a normal takeoff was accomplished. Shortly after takeoff, and in accordance with tower clearance, a climbing right turn was started. During the turn the No. 3 engine malfunctioned and a fire developed in that area. The airplane, still in a right turn, started to lose altitude rapidly. While traveling in a north-northeasterly direction it struck in an open marsh containing scattered trees and underbrush. Rescue operations were immediately initiated but were seriously hampered by heavy ground traffic of sightseers attracted to the area. Several of the passengers and crew members were airlifted by U. S. Coast Guard helicopters direct to hospital grounds in Miami and the others were removed to nearby ambulances and taken to hospitals.", "probable_cause": "The Board determines that the probable cause of this accident was the failure of the captain to maintain altitude during an emergency return to the airport due to his undue preoccupation with an engine fire following takeoff. The following findings were reported: \r\n- Weather was not a factor in the accident,\r\n- The flight was properly planned and dispatched,\r\n- Smoke from No. 3 engine on the prior flight was reported to the ferry crew by the Miami tower and the crew should have written up this item in the aircraft log,\r\n- Shortly after a routine takeoff No. 11 cylinder of the No. 3 engine failed, resulting in a fire in flight,\r\n- Emergency measures (i.e., propeller feathering, extinguisher, fuel shutoff) were promptly taken by the crew,\r\n- Full power was available from the other three engines and there was no impairment of structure or control of the airplane,\r\n- The captain made a decision to return to the airport and, in attempting to do so, altitude was not maintained and the aircraft struck the ground."}