{"url": "https://www.baaa-acro.com/crash/crash-rockwell-grand-commander-680fl-near-perris-1-killed", "date": "Dec 20, 2010 at 1000 LT", "type": "Rockwell Grand Commander 680", "operator": "Christopher J. Petrikas", "flight_phase": "Flight", "flight_type": "Private", "survivors": "No", "site": "Mountains", "schedule": "Palm Springs - Chino", "msn": "680-1753-146", "yom": 1968, "flight_number": null, "city": "Perris", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 1, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 1, "captain_hours": 33000, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2278, "circumstances": "The pilot departed the airport mid-morning to fly to his home airport, 63 miles to the northwest. Weather conditions at the departureb airport were visual flight rules (VFR), the weather at the destination airport was not reported, and the weather conditions en-route were marginal VFR. The global positioning system (GPS) track for the flight indicated that the airplane departed from the airport and headed west along a highway corridor flying approximately 1,000 feet above ground level (agl) through a mountain pass. For the majority of the flight, the airplane maintained altitudes between 900 feet and 1,200 feet agl. Twenty-nine minutes after takeoff, the airplane’s GPS track turned southwest away from an area of concentrated precipitation and directly towards an isolated mountain peak that rose approximately 1,000 feet above the surrounding terrain. The pilot contacted the local air traffic control facility, reported his position and requested traffic advisories through the local airspace to his destination airport. About 6 minutes later, the pilot stated that he was having difficulty maintaining VFR and asked for an instrument flight rules (IFR)clearance. At the same time, the GPS track showed that the airplane came within 50 feet of the mountainous terrain. No further transmissions from the pilot were received. The final GPS position was recorded 1 minute later, at 500 feet agl and approximately half a mile from the crash site. The terrain rapidly ascended in this area and intersected the airplane's flight path over the remaining 1/2 mile. An airport located about 4 miles from the accident site and in an area of flat terrain 1,000 feet below the isolated mountain top, recorded weather at the time of the accident as few clouds at 900 feet agl, overcast clouds at 1,500 feet agl, and a variable ceiling between 1,200 and 1,800 feet agl, in drizzle. Weather radar images at the time of the accident depicted precipitation at the elevation and location of the accident site, indicating probable mountain obscuration.\n", "probable_cause": "The pilot’s decision to continue visual flight into instrument meteorological conditions, which resulted in an in-flight collision with mountainous terrain.\n"}