{"url": "https://www.baaa-acro.com/crash/crash-de-havilland-dhc-6-twin-otter-200-perris-valley-16-killed", "date": "Apr 22, 1992 at 1109 LT", "type": "De Havilland DHC-6 Twin Otter", "operator": "Skydive-Perris", "flight_phase": "Takeoff (climb)", "flight_type": "Skydiving / Paratroopers", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Perris Valley - Perris Valley", "msn": "141", "yom": 1968, "flight_number": null, "city": "Perris Valley", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 2, "crew_fatalities": 2, "pax_on_board": 20, "pax_fatalities": 14, "other_fatalities": 0, "total_fatalities": 16, "captain_hours": 4300, "captain_hours_type": 100, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 29391, "circumstances": "The ground loader had fueled the airplane from the airport fuel truck. He stated that the flight crew did not sump the fuel tanks after they were fueled. Immediately after takeoff the right engine lost power, the right wing lowered to about 90°, and the airplane impacted the ground adjacent to the runway. Then forward fuel tank, which provides fuel to the right engine, was found to contain about 8 gallons of a heavily contaminated mixture composed of water, an emulsifying agent, and bacterial growth. The fuel from the airport fuel truck and main underground tank contained the same mixture. Fuel had been transferred from the underground tank to the truck on the evening preceding the accident. The left propeller control was found seized in the feather position; left propeller blades in the near feather position. Six skydivers were injured while 16 other occupants including both pilots were killed. ", "probable_cause": "The pilot-in-command's inadvertent feathering of the wrong propeller following an engine power loss, and the failure of the operator to assure that the pilot was provided with adequate training in the airplane. Factors related to the accident were: water contamination of fuel in the airport storage tanks, the operator's lack of fuel quality control procedures, improper fuel servicing, improper preflight by the pilot(s), and exceeding the gross weight/forward cg limits of the airplane."}