{"url": "https://www.baaa-acro.com/crash/crash-britten-norman-bn-2b-26-islander-ruhnu-island", "date": "Mar 3, 2007 at 1608 LT", "type": "Britten-Norman Islander", "operator": "Luftverkehr%20Friesland-Harle", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Pärnu - Ruhnu Island", "msn": "2271", "yom": 1994, "flight_number": null, "city": "Ruhnu Island", "zone": "Saaremaa", "country": "Estonia", "region": "Europe", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 2, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 16079, "captain_hours_type": null, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": 2811, "circumstances": "Luftverkehr Friesland Brunzema und Partner KG, registered in Germany and holding the Air Operator Certificate issued by the Federal Republic of Germany in 1983, has been operating scheduled flights between Pärnu (EEPU) and Ruhnu (EERU) since 2006. The flight, initially planned for 26th February 2007, was postponed several times due to adverse meteorological conditions, causing problems with provision supply on the island. On Friday, 3rd March, pilot checked the weather at 13:00 and at 14:00. Based on the received information the pilot decided to depart for Ruhnu at 14:00. At 14:08, the aircraft took off from Pärnu airport to make a scheduled VFR flight to the island of Ruhnu. Flight was carried out in the uncontrolled airspace. Pilot, two passengers and 520 kg of cargo were on board the aircraft. According to the weather briefing received by the pilot via telephone from Kuressaare, at 14:00 the cloud height in Kuressaare (EEKE, 36 Nm northwest of Ruhnu) was 600 ft. and 180 m (approximately 540 ft.) in Ruhnu. During the uneventful flight on the altitude 1500 ft., the coast and the ice border were clearly visible. The aircraft stayed clear from the clouds and no signs of icing were noticed by persons on board. Approaching the island from the northeast it was intended by the pilot to use RWY 32 for landing. The pilot decided to fly low from east to west across the runway to check the windsock and runway condition. While approaching the island, the pilot descended at the rate of 150 ft/min with low power settings and flaps extended by 1 notch. During descent the horizontal and vertical visibility deteriorated and the flight was continued in IMC2 . The descent was continued in clouds; therefore the pilot had no visual contact with the ground and horizon. The aircraft broke off the clouds over the coast on a very low altitude (100-120 ft. by pilot’s statement). Trying to maintain safe altitude and speed pilot added power, at the same time stall warning signal activated and seconds later the lower part of aircraft’s fuselage touched the treetops and collided with the terrain at 14:36. The engines continued producing power until collision with trees which after those were set to the idle by pilot. The passengers and pilot escaped the aircraft without assistance and with no injuries. The accident site is situated 0.24 Nm northeast off the runway 32 threshold. Ground surface is uneven and forested with young pinewoods. ", "probable_cause": "The investigation established the following causes of the accident:\r\n1. The pilot could not maintain safe flight altitude when approaching Ruhnu aerodrome.\r\n2. The pilot continued the descent in spite of IMC.\r\nContributing factors to the accident:\r\nThe investigation established the following factors contributing to the accident:\r\n1. High motivation to perform the flight.\r\n2. Inadequate weather information from ground services of Ruhnu aerodrome.\r\n3. Inadequate aeronautical oversight in the destination airport."}