{"url": "https://www.baaa-acro.com/crash/crash-boeing-737-8as-sochi", "date": "Sep 1, 2018 at 0258 LT", "type": "Boeing 737-800", "operator": "UTAir", "flight_phase": "Landing (descent or approach)", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Moscow - Sochi", "msn": "29937/1238", "yom": 2002, "flight_number": "UT579", "city": "Sochi-Adler", "zone": "Krasnodar Krai", "country": "Russia", "region": "Asia", "crew_on_board": 6, "crew_fatalities": 0, "pax_on_board": 164, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 13995, "captain_hours_type": 6391, "copilot_hours": 12277, "copilot_hours_type": 5147, "aircraft_hours": 45745, "circumstances": "On 31.08.2018 Boeing 737-800 VQ-BJI operated by UTAir Airlines conducted the scheduled flight UT 579 from Moscow (Vnukovo airport) to Sochi (Adler airport). During the preflight briefing (at 19:50) the crew was provided with the necessary weather information. At 20:15, the crew had passed the medical examination at Vnukovo airport mobile RWY medical unit. The Daily Check line maintenance (DY) was done on 30.08.2018 at Vnukovo airport by UTG aviation services, ZAO; job card # 11465742. The A/C takeoff weight was 68680 kg and the MAC was 26.46 %, that was within the AFM limitations for the actual conditions. At 21:33 the takeoff from Vnukovo airport was performed. The flight along he prescribed route was performed on FL350 in auto mode and without any issues. The F/O acted as the pilot flying (PF). When approaching the Sochi aerodrome traffic control area, the flight crew was provided by the aerodrome approach control with the approach and descending conditions, as well as with the weather conditions near the aerodrome. After descending to the height specified by Sochi Approach, the pilot contacted Sochi Radar, waited for the weather that met his minimum and was cleared for landing. In course of the first approach to landing (from the altitude about 30 m) when RVR got down because of heavy showers, the PIC took controls and performed the go-around. In course of the second approach, the crew performed the landing but failed to keep the airplane within the RWY. The airplane had landed at about 1285 m from the RWY threshold, overrun the threshold, broke through the aerodrome fencing, and came to rest in Mzymta river bed. This ended with the fire outbreak of fuel leaking from the damaged LH wing fuel tank. The crew performed the passenger evacuation. The aerodrome alert measures were taken and the fire was brought under control. Eighteen occupants were injured while all other occupants were unhurt. The aircraft was damaged beyond repair. ", "probable_cause": "The aircraft overrun, destroying and damage by fire were caused by the following factors:\r\n- repeated disregarding of the windshear warnings which when entered a horizontal windshear (changing from the head wind to tail one) at low altitude resulted in landing at distance of 1285 m from the RWY threshold (overrunning the landing zone by 385 m) with the increased IAS and tail wind;\r\n- landing to the runway, when its normative friction coefficient was less than 0.3 that according to the regulations in force, did not allow to land.\r\nThe factors contributed the accident:\r\n- the crew violation of the AFM and Operator's OM requirements in regards to the actions required a forecasted or actual wind shear warning;\r\n- use of the automatic flight mode (autopilot, autothrottle) in the flight under the windshear conditions which resulted in the aircraft being unstable (excess thrust) when turning to the manual control;\r\n- lack of prevention measures taken by the Operator when the previous cases of poor crew response to windshear warning were found;\r\n- insufficient crew training in regards to CRM and TEM that did not allow to identify committed mistakes and/or violations in good time;\r\n- the crew members' high psychoemotional state caused by inconsistency between the actual landing conditions and the received training as well as the psychological limit which was determined by the individual psychological constitution of each member;\r\n- insufficient braking both in auto and manual mode during the aircraft rollout caused by the insufficient tyre-to-ground friction aiming to achieve the specified rate of braking. Most probably the insufficient tyre-to-ground friction was caused by the significant amount of water on the RWY surface;\r\n- the aerodrome services' noncompliance of Sochi International Aerodrome Manual requirements related to the RWY after heavy showers inspection which resulted in the crew provision of wrong normative friction coefficients. In obtaining of the increased overrun speed of about ≈75 kt (≈140 km/h) the later setting of engines into reverse mode was contributed (the engines were set into reverse mode 16 s later than the aircraft landed at distance of about ≈200 m from the runway end)."}