{"url": "https://www.baaa-acro.com/crash/crash-embraer-emb-505-phenom-300-altenrhein", "date": "Aug 6, 2012 at 1540 LT", "type": "Embraer EMB-505 Phenom 300", "operator": "Dalia%20Air", "flight_phase": "Landing (descent or approach)", "flight_type": "Charter/Taxi (Non Scheduled Revenue Flight)", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Geneva - Altenrhein", "msn": "505-00025", "yom": 2011, "flight_number": "DLI211", "city": "Altenrhein", "zone": "Saint Gallen", "country": "Switzerland", "region": "Europe", "crew_on_board": 2, "crew_fatalities": 0, "pax_on_board": 1, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 7025, "captain_hours_type": 75, "copilot_hours": 5854, "copilot_hours_type": 465, "aircraft_hours": 510, "circumstances": "On 6 August 2012 the Embraer EMB-505 Phenom 300 aircraft, registration CN-MBR, took off at 12:59 UTC from Geneva (LSGG) on a commercial flight to St. Gallen-Altenrhein (LSZR). After the initial call to the aerodrome control centre St. Gallen tower, the crew quickly decided, after an enquiry from the air traffic controller, on a direct approach on the runway 10 instrument landing system (ILS). Shortly thereafter, the landing gear and flaps were extended. The flaps jammed at approximately 10 degrees and the FLAP FAIL warning message was displayed. The crew carried out a go-around shortly before landing. The landing gear subsequently remained extended. The flaps remained jammed for the remainder of the flight. The crew decided immediately on a second ILS approach with jammed flaps, which according to the manufacturer's information required an increased approach speed. During the approach, the crew had difficulty in reducing the airspeed to this increased approach speed. At 13:40 UTC, the aircraft subsequently touched down on the wet runway at an indicated air speed of 136 kt, approximately 290 m after the runway threshold, and could not be brought to a standstill on the remaining length of runway. The aircraft then rolled over the end of runway 10, broke through the aerodrome perimeter fence and overrun the road named Rheinholzweg running perpendicular to the runway centreline, on which a public transport bus was travelling. The aircraft rolled very close behind the bus and came to a standstill in a maize field, approximately 30 m from the end of the runway. The female passenger and the two pilots were not injured in the accident. The aircraft was badly damaged. There was crop damage and damage to the aerodrome perimeter fence.", "probable_cause": "The accident is attributable to the fact that the aircraft touched down late and at an excessively high speed on the wet runway after an unstabilized final approach and consequently rolled over the end of the runway.\r\nThe following factors contributed to the accident:\r\n- The insufficient teamwork and deficient situation analysis by the crew.\r\n- The flaps remained jammed at approximately 10 degrees, a position that is almost consistent with the flaps 1 position.\r\n- Late initiation of full brake application after landing."}