{"url": "https://www.baaa-acro.com/crash/crash-cessna-208a-cargomaster-fresno", "date": "Jun 6, 1990 at 1715 LT", "type": "Cessna 208A Caravan", "operator": "FedEx", "flight_phase": "Landing (descent or approach)", "flight_type": "Cargo", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Fresno - Oakland", "msn": "208-0015", "yom": 1985, "flight_number": null, "city": "Fresno", "zone": "California", "country": "United States of America", "region": "North America", "crew_on_board": 1, "crew_fatalities": 0, "pax_on_board": 0, "pax_fatalities": 0, "other_fatalities": 0, "total_fatalities": 0, "captain_hours": 9275, "captain_hours_type": 335, "copilot_hours": null, "copilot_hours_type": null, "aircraft_hours": null, "circumstances": "The engine lost oil pressure while climbing through 6,000 feet, and the pilot requested to return to his departure airport. ATC informed the pilot of a closer airport. The pilot secured the engine, feathered the prop, and made a power-off descent to the airport. The pilot elected to make a downwind approach to runway 12L due to his altitude. The airplane overflew the runway and touched down past the departure end. It penetrated the airport perimeter fence, struck several trees, a sign post, a light pole, and an auto before coming to rest in a residential area. Examination of the wreckage revealed the loss of pressure was due to oil leaking. The oil filler cap was found improperly adjusted after the original installation. The maintenance manual does not approve any field repairs on the oil filler cap engaging mechanisms. The airplane's flaps were found at a 7° intermediate setting.", "probable_cause": "A loss of engine oil pressure due to improper maintenance performed on the engine oil filler cap by an unknown person. In addition, the pilot misjudged his landing approach to the runway during the forced landing which resulted in an overshoot and collision with objects. A tailwind contributed to the overshoot."}