{"url": "https://www.baaa-acro.com/crash/ground-fire-tupolev-tu-154b-2-surgut-3-killed", "date": "Jan 1, 2011 at 1525 LT", "type": "Tupolev TU-154", "operator": "Kolavia", "flight_phase": "Parking", "flight_type": "Scheduled Revenue Flight", "survivors": "Yes", "site": "Airport (less than 10 km from airport)", "schedule": "Surgut - Moscow", "msn": "83A588", "yom": 1983, "flight_number": "KGL348", "city": "Surgut", "zone": "Khantia-Mansia okrug", "country": "Russia", "region": "Asia", "crew_on_board": 8, "crew_fatalities": 0, "pax_on_board": 126, "pax_fatalities": 3, "other_fatalities": 0, "total_fatalities": 3, "captain_hours": 12202, "captain_hours_type": 2780, "copilot_hours": 3775, "copilot_hours_type": 3279, "aircraft_hours": 32354, "circumstances": "Ready for taxi, the crew started the engines when a short circuit occurred and a fire erupted in the rear compartment. The evacuation of all 134 occupants was initiated but three passengers died while 32 others were seriously injured. The aircraft was totally destroyed by fire. The OAT was -29° C at the time of the incident. ", "probable_cause": "A short circuit emerged while the aircraft generators were connected to the aircraft's electrical system after start-up of the engines, via an APU. The short circuit caused a strong fire in the generators compartment in the tail which spread rapidly through the fuselage. The cause of the fire was an electrical arc produced by electrical currents exceeding ten to 20 times the nominal loads when two generators not synchronized with each other were brought online but got connected together instead of being connected to parallel busses. The following contributing factors were identified:\r\n- Poor technical conditions of contacts TKS233DOD responsible for connecting the generators with the electrical busses, that were damaged by prolonged operation without maintenance. A contact normally open was welded and fractured insulation material moved between contacts that are normally closed. These abnormal contact positions led to the connection between #2 and #3 generators.\r\n- Differences in the schematic diagrams of generator 2 and generators 1 and 3. When the switch is moved from \"check\" to \"enable\" with no delay in the \"neutral\" position generator 2 is brought online without time delay which leads to increased wear of normally closed contacts in the TKS233DOD unit.\r\n- The specific design of the electrical systems to ensure power supply to each bus from either the APU or either engine integrated drive generator."}